{
    "Proclamation on National Gun Violence Awareness Day and Month.": [
        "'speaker_1': 'Area. So tourism is a really important part of our economy and also a lot of fun for everybody as well. So thank you so much.'",
        "'speaker_0': 'Excellent. Thank you. All right, we have. Now Proclamation 594. Councilman Lopez, will you please read it.'",
        "'speaker_5': 'About Councilman Cashman instead?'",
        "'speaker_0': 'Councilman Cashman. Yeah. Councilman Cashman. Yes, please. Rita, we had a little typo there. Sorry about that.'",
        "'speaker_5': 'You know, 1 is as good as another. Yes. This is proclamation number 18 0594, declaring June 1st as National Gun Violence Awareness Day and June is Gun Violence Awareness Month, whereas every day 96 Americans are killed by gun violence.'",
        "'speaker_5': 'And on average, there are approximately 13,000 gun homicides every year. And. Whereas, Americans are 25 times more likely to be killed with guns than people in other developed countries. And. WHEREAS, in Colorado, 78% of firearm deaths are suicides.'",
        "'speaker_5': 'Nearly half of all suicide deaths in Colorado involve the use of a firearm, which is the most common method of suicide death in the state. And. Whereas, in 2016, in Colorado, 781 persons died from gun violence, with suicides claiming 605 lives and homicide another 176, with the majority of those dying from gun violence being less than 35'",
        "'speaker_5': 'years of age. And. Whereas, in 2016, in Denver, 96 persons died from gun violence with suicides claiming 47 lives and homicide another 49. And. Whereas, the Denver metropolitan area has suffered the devastating impacts of mass shootings at Columbine High School in 1999 and the Aurora Movie Theater in 2012.'",
        "'speaker_5': 'And Denver has had Colorado's highest gun death totals with more than 800 residents killed by guns in the 12 years between those two horrific events. And. WHEREAS, research indicates there have been more lives lost from gunfire in America than in all the wars in which U.S. troops have been engaged since our nation's founding.'",
        "'speaker_5': 'Whereas protecting safety in the communities they serve is a city council's highest responsibility. And. Whereas, in January 2013, Hadiya Pendleton, the teacher who marched in President Obama's second inaugural parade and was tragically shot and killed just weeks later should be now celebrating her 21st birthday.'",
        "'speaker_5': 'And. Whereas, to help honor Hadiya and the 96 Americans whose lives are cut short and the countless survivors who are injured by shootings every day, a national coalition of organizations designated the first Friday in June as the fourth National Gun Violence Awareness Day.'",
        "'speaker_5': 'And. WHEREAS, the idea was inspired by a group of ideas friends who asked their classmates to commemorate her life by wearing orange, choosing this color because hunters wear orange to announce themselves to other hunters when out in the woods.'",
        "'speaker_5': 'And. Whereas, anyone can join this campaign by pledging to wear orange on the first Friday in June every year to help raise awareness about gun violence. And. Whereas, by wearing orange on June 1st, 2018, Americans will raise awareness about gun violence and honor the lives of violence victims and survivors.'",
        "'speaker_5': 'And. Whereas, we renew our commitment to reduce gun violence and pledged to do all we can to keep firearms out of the wrong hands and encourage responsible gun ownership to help keep our children safe. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Council of the City and'",
        "'speaker_5': 'County of Denver declares the first Friday of each year, this year, June 1st, 2018, to be National Gun Violence Awareness Day, and the entire month of June to be National Gun Violence Awareness Month and encourages all citizens to support their local communities.'",
        "'speaker_5': 'Efforts to prevent the tragic effects of gun violence and to honor and value human lives. Section two that the Clerk of the city and county of Denver shall attest and fix the seal of the city and county of Denver to this proclamation and it be transmitted to Josie Brady, Colorado Coalition Against Gun Violence.'",
        "'speaker_0': 'All right. Thank you, Councilman Cashman. Your motion to adopt.'",
        "'speaker_5': 'I move that proclamation 18 dash 0594 to be adopted.'",
        "'speaker_0': 'It has been moved and seconded. Your comments. Councilman Cashman.'",
        "'speaker_5': 'Thank you, Mr. President. I first want to start by thanking those in the audience and those at home that are working against extremely daunting odds every day to reduce gun violence in our community. I also want to thank our Office of Special Events, who to honor your work, will be lighting the city and county building in Orange'",
        "'speaker_5': '. The first week in June. But here we are again. We mourn the students and teachers murdered just the other day by a deranged gunman at Santa Fe High School in Santa Fe, Texas. Jared Black 17. Shana Fisher 16.'",
        "'speaker_5': 'Christian Riley Garcia 15. Aaron Kyle McCloud 15. Glenda End Perkins Substitute Teacher. Angelique Ramirez 15. Sabeco Sheikh 17. Chris Stone, 17. Cynthia Tisdale. Teacher. Kimberly Vaughn. Student Age not reported. Since this Gun Violence Awareness Month proclamation was read last year, communities across the land have mourned dozens lost in school shootings, as well as the tens of thousands'",
        "'speaker_5': 'of men, women and children lost in random homicides and suicides. From sea to not so shining sea. CNN lists the following school shootings thus far in 2018. Most won't ring a bell because they don't rise to the level of carnage that we saw in Parkland, Florida, or Santa Fe, Texas.'",
        "'speaker_5': 'May 11th, Palmdale, California A 14 year old boy went to Highland High and began shooting a semiautomatic rifle. A 15 year old boy was struck in the shoulder. April 20th, Ocala, Florida a 17 year old student at Forest High School, was shot in the ankle shortly before students were to walk out as part of the national protest'",
        "'speaker_5': 'against gun violence. April 12th, Raytown, Missouri A man was shot in the stomach at the parking lot of Raytown South Middle School during a track meet. April 9th, Gloversville, New York A student shot another student with a B.B. gun in Gloversville Middle School, March 20th.'",
        "'speaker_5': 'Lexington Park, Maryland. An armed student shot two others at Great Mills High School. The shooter was killed. One of the students, 16 year old Jaylen Willey, was taken off life support two days later, March 13th. Seaside, California A teacher accidentally discharged a gun during a public safety class at Seaside High School, injuring a student.'",
        "'speaker_5': 'March eight, Mobile, Alabama. One person was hospital hospitalized after a shooting at an apartment building on the campus of the University of South Alabama March 7th. Birmingham, Alabama. One student was killed and another critically wounded after an accidental shooting at Huffman High School March seven.'",
        "'speaker_5': 'Jackson, Mississippi A student was shot inside a dormitory at Jackson State University, and it goes on March 2nd in Mount Pleasant, Michigan, February 27, Norfolk, Virginia, February 27. It had been a mississippi February 24th, Savannah, Georgia, and of course, February 14th in Parkland, Florida.'",
        "'speaker_5': '17 unsuspecting students and adults were lost. February nine in Nashville, February 15. Oxon Hill, Maryland. February one in Los Angeles. January 31st in Philadelphia. January 23rd in Benton, Kentucky. January 22nd in Italy, Texas. In January 20th, in Winston-Salem, North Carolina.'",
        "'speaker_5': 'That's this year. We here in Denver rightfully continue to mourn the horrific losses at Columbine and at the Aurora theater shooting and how fortunate we might think that we are that these most recent student shootings didn't happen to us.'",
        "'speaker_5': 'But can we be sure that we were actually spared? Our mayor, Michael Hancock, was born in Fort Hood, Texas. Governor John Hickenlooper came from Narberth, Pennsylvania. Robin Wittgenstein, head of Denver Health, grew up on the East Coast. Dr. Rebecca Chopp, chancellor of the University of Denver, came from rural Kansas.'",
        "'speaker_5': 'Those of you in the audience, please, and my colleagues on the dais. If you'll raise your hand. If you were not born in Denver. So lest you be comforted that these recent shootings haven't torn our community apart, realize that just might be an illusion.'",
        "'speaker_5': 'It might have been our future governor that died in Texas the other day. Or our mayor. Or Council president. Or a future scientist poised to finally find a cure for some hideous childhood illness at the Colorado Children's Hospital, or a mold shattering police chief or educator.'",
        "'speaker_5': 'Or maybe just the kid who grew up to be your next door neighbor or your best friend. I want to thank my colleague, Councilman Espinosa, for picking up the gantlet laid down at one of our public comment sessions and putting through a bill that outlawed bump stocks and reduced our allowable size for high capacity magazines.'",
        "'speaker_5': 'But there is so much more that must be done. We watch with interest to see how the courts will assess Boulder's recent efforts to eliminate assault weapons in their community. But at the same time, we're very aware that the scourge of gun violence goes far deeper than guns alone.'",
        "'speaker_5': 'We must finally make a sea change commitment to mental health care. We must address the widening income gap and the attendant frustration and hopelessness that shows a few having so much and so many having so little. Our children are becoming more and more frightened with every passing week, less and less sure that they are safe in their'",
        "'speaker_5': 'schools. I met last week with DPS security chief Mike Eaton to get an idea about what our public school district is doing to protect our kids. He spoke at great length about what the district is doing as far as infrastructure and process and systems and partnership with the Denver Police Department to change the paradigm.'",
        "'speaker_5': 'But security can only do so much to control the deranged. Again, we must do a better job of healing the sick, repairing the damage. Much of what this council might want to do is preempted by state law. As I've said before, we can't even create a database of gun owners.'",
        "'speaker_5': 'It's against the law. I am prepared to join with my colleagues Mayor Hancock, Governor Hickenlooper and our state legislators to again change that paradigm so that we might create a new Denver, a new Colorado, where kids get an full night of peaceful rest knowing that the worst that might happen to them the next day at school is'",
        "'speaker_5': 'a pop quiz that they weren't expecting. Thank you, Mr. President.'",
        "'speaker_0': 'Wow. Thank you. Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_3': 'I first want to thank Councilman Cashman for bringing this forward and for that very thorough overview of what has become too much of a norm in this country. We cannot accept this being the norm. We have to stand up and keep guns out of the hands of our children and out of the hands of criminals.'",
        "'speaker_3': 'This is just. We should not have to be doing this kind of proclamation. It's time across this country that we all stand up and make our voices heard loud and clear on behalf of our children, on behalf of our communities, that this is not acceptable.'",
        "'speaker_3': 'Not long ago, one of my granddaughters was at school and they they had to shelter in place because there was somebody in the neighborhood not far from here, very close to downtown. Their school is very close to downtown where, you know, this person had a gun.'",
        "'speaker_3': 'And so they wanted to make sure all the students were safe. Kids should. Feel comfortable and they should be safe going to school, going to the movies, going to any public place where they don't have to fear for their lives.'",
        "'speaker_3': 'Because we have too many guns on the streets in this country. Councilman Cashman, thank you for bringing this forward.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Espinosa.'",
        "'speaker_7': 'Thank you, Councilman Cashman, for not only bringing this forward, but the comments you just made tonight. You can probably hear my voice. How moved I am by what you shared. But this is in context with the conversation I had on on on Friday.'",
        "'speaker_7': 'Anyway, the the Second Amendment starts with four words a well-regulated militia regulated being the third word in the Second Amendment. And if you have a well-regulated militia, we don't what we'd have is not a well-regulated militia. When you have this many members of that that militia.'",
        "'speaker_7': 'The people using that part of the the. Of this provision going off and killing people indiscriminately. You have a problem in your. Militia. And so that's where the well-regulated part needs to come in to effect and. What's interesting is then the next line.'",
        "'speaker_7': 'I mean, the next part of that first sentence is being necessary to the security of a free, strict, free state. If you have to have checkpoints at churches and schools in the recommendations, a single entry into that location, that's not a free state.'",
        "'speaker_7': 'That is that is everything that we fought multiple wars against. So there is just a very, very serious disconnect. By logging on to the right, the right of people to bear, keep and bear arms. If you're not doing the first two things, having a well-regulated militia and in maintaining a free state, the security of a free state'",
        "'speaker_7': ', that those guns are not performing the function that they are, that that thinking is pass. It is old. And I am glad that on Friday I got two to it to be part of a panel held by Skinner students Lillie, Rachel and Ada led.'",
        "'speaker_7': 'It led a panel, a very, very capable panel where we learned about what this city in the state is doing. And so the good news is, is that we're making progress on focusing on well-being. I think if we.'",
        "'speaker_7': 'There's a lot that's wrong in America that we can fix. And there's examples in our own past. There's examples worldwide on how we can do a better America and be a more perfect union. And so we're moving towards that.'",
        "'speaker_7': 'If we can work on the well-being of the individual, cover their health, cover their education, make sure that they have all the things that they need so that they're not reaching that point. It probably won't matter how many guns you have.'",
        "'speaker_7': 'But the good news is, is that generation, those middle schoolers, the ones right before them, the Parkland High School students, they're getting it. They're understanding that there's a very big disconnect between a very, very, very vocal and well-funded minority in this country glomming behind a the fourth phrase in the Second Amendment and skipping over the other two'",
        "'speaker_7': 'crucial portions. And they're going to be the change agents. And so the combination. Let's work on the well-being. Let's work on the individuals. Let's work on the community, culture and environment that schools are, that our society is well, this and nurture a new generation that actually sees a free and secure America as being one that's open and'",
        "'speaker_7': 'tolerant and caring for one another. So, I mean, that is what's what what we've done in the past clearly isn't working. And it really frustrating thing is is that. Is that is is as depressing as it is hearing about school shooting over and over and over again.'",
        "'speaker_7': 'The the the I don't know what the total number of middle schools in high schools that were open and closed on that day that didn't experience that. And it's an overwhelmingly large number. The kids that are going to school today.'",
        "'speaker_7': 'Are fearful and I could not shake that out of in that room. I just couldn't I couldn't imagine it wasn't something that I went through in high school. It never occurred to me that we needed to have a school resource officer and metal detectors.'",
        "'speaker_7': 'And I went to school in Colorado, but there were two members of that board that had experienced gun violence in Colorado high schools. And so it's a thing that is affecting them. And until we we we we do the heavy lifting ourselves, nothing's going to get done.'",
        "'speaker_7': 'And until these guys get in charge. And thankfully for us, that's in my lifetime. And I'm looking forward to it. Thanks.'",
        "'speaker_0': 'Thank you. All right, Councilwoman PANITCH.'",
        "'speaker_4': 'Thank you, Mr. President. There's little I can add to the.'",
        "'speaker_1': 'Eloquent words of.'",
        "'speaker_7': 'The sponsor of this, Councilman Cashman.'",
        "'speaker_4': 'But where there's a gap, I like to kind of jump in.'",
        "'speaker_1': 'Which is I think it's really.'",
        "'speaker_7': 'Important to focus on the school shootings because they have been such a.'",
        "'speaker_4': 'Visible symptom of the disease.'",
        "'speaker_7': 'Of guns in our country. But they aren't the only place where moms are losing kids. And I just I have to acknowledge the moms in our city who lose kids every day in individual shootings, in homicides, and many, many women in our city lose their lives at the hands of their intimate partners at the other end of'",
        "'speaker_7': 'a gun.'",
        "'speaker_1': 'And so I worry a little bit.'",
        "'speaker_7': 'That too much of the gun debate has moved to this realm of mass shooting and in some ways has has changed the.'",
        "'speaker_4': 'Debate.'",
        "'speaker_7': 'Where we're often talking about mental illness. And I.'",
        "'speaker_1': 'Think, you know, it is important to bring.'",
        "'speaker_7': 'More attention to mental illness and treatment.'",
        "'speaker_4': 'But if we did our.'",
        "'speaker_7': 'Raising of hands of who here has a mental illness or someone in their close family who suffers from one, I think many of our hands would go up. And so I think that I'm not comfortable with the way the national debate has taken the focus away from guns and tried to put it on mental illness as if'",
        "'speaker_7': ', you know, that is the lethal element here. It's certainly an element where we miss warning signs, where we miss opportunities to intervene. Every piece of those systems should be fixed, but that does not replace the need to regulate guns in commonsense ways to save lives, and not just for mass shootings, but for the many individuals, more more'",
        "'speaker_7': 'individuals than Councilman Cashman read more mothers and more lost kids who lose lose their lives in other types of gun violence. So I think it's just important that those families and those folks be recognized. I don't have a list of their names, but I mourn for them as well and for them to.'",
        "'speaker_7': 'We need to keep this debate focused on the regulatory side. Again, mental health is important. We need to talk about it.'",
        "'speaker_4': 'But not as a.'",
        "'speaker_7': 'Substitute for controlling the lethality of guns. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Lopez. Thank you, Mr. President. I don't have much to add except one Councilman Cashman. That was a very, very well written proclamation, and your comments were right on point. When I think of when you were.'",
        "'speaker_0': 'Speaking. I was just thinking of a conversation I had with my daughter, who is ten years old. Goes to school in DPS. And I was just reflecting on how we were talking about tornado safety and. You know, if a tornado hit, you go to a hallway and you do your drills.'",
        "'speaker_0': 'Those are the drills that I had when I was in elementary school. She taught me something completely different. And she says, Well, we do the shelter in place, lockdown drills and all the lockdown drills. She says, Well. We have to stay away from the windows and we got to go hide and we got to be quiet.'",
        "'speaker_0': 'And I have a special job. And there was a job, me. And she says, I have to make sure that the closet I have to I'm the one that has to go run and make sure that the closet door is open so that the classroom door does not open.'",
        "'speaker_0': 'She was the real close together, and it locks. So nobody can come in bumper. I think to myself, man. Just one of those drills with skills. It scared the hell out of me as a kid. Imagine. I mean, I just imagined myself as an elementary school in her same elementary school, by the way.'",
        "'speaker_0': 'And just being scared for my life. I mean, tornado drills are bad as it is and hiding under the under the desks. You know, for some for some folks that are on the West Coast. That's scary enough as it is.'",
        "'speaker_0': 'Imagine those drills for lockdowns and. And imagine their reality. 20 years from now. Their deep sensitivity. The PTSD is just doing that and how that it would affect our future, our kids, our society. So I think about that then.'",
        "'speaker_0': 'Then I saw an update on CNN and it was a number that said there have.'",
        "'speaker_9': 'Been 2288.'",
        "'speaker_0': 'School shootings since 2009, which was 57 times more than the other six G7 countries combined. It's going to take a heck of a lot more. And it's becoming cliche than. Just passing the buck to hopes and prayers and everybody asking for action.'",
        "'speaker_0': 'It's going to take a culture change, a shift in our culture when we go to the flea market. Although there are four boys to play with and they market it right to the boys are the little plastic guns, the little M-16s, not even cowboy shooters, man.'",
        "'speaker_0': 'These are M-16s that they at their market. You go into any one of these malls in the area. And you can buy guns. And it's not necessarily the the ones that real bullets but they have their airsoft. And here there are replicas.'",
        "'speaker_0': 'Right. So you just think about that and think about our culture. There's so many different ways that we can change and make these shifts, encourage us, encourage other people to make these shifts. And, you know, there are these cultural psyches that that we create for our society.'",
        "'speaker_0': 'And it's it's something that we can do. You don't have to wait on Congress to do it or we don't have to wait on government, whether it be local or state to do it. Right. We can encourage them with our dollars.'",
        "'speaker_0': 'And if I might just add something. I think about growing up in the nineties. In having guns pointed out you are being threatened with weapons because you had a different color on. I those of us who grew up in the nineties just knew how tough that was.'",
        "'speaker_0': 'It was not uncommon to have a weapon in somebody's locker or to have shootings outside. I mean, we got chased around by the CVS outside of West High School with guns. That culture has to shift. And we can't wait for it to be a school shooting.'",
        "'speaker_0': 'And we can't just talk about it in school shootings as an everyday thing that we have to change. So and. I don't know. Maybe this is something that we can look into. I never thought I would come to this point or even say this publicly, but.'",
        "'speaker_0': 'I think it's time to start looking at the metal detectors in our schools, if that's if it means saving people's lives. I folks. My friends that are all the way all across the country, they look at me weird because my high school didn't have a metal detector and.'",
        "'speaker_0': 'So there are small steps I wish we didn't have to cross, but I think we've passed that threshold a long time ago. So thank you, Councilman Cashman, for for bringing this topic up again. I'm glad that we're not just kind of like a one and done council or, you know, we just have one proclamation or one action'",
        "'speaker_0': 'and we forget about it. I'm glad that you brought this forward again. Thank you. Yeah, thank you, Councilman Lopez. And thank you, Councilman Cashman, for bringing this for a lot to think about here. It has been moved in second.'",
        "'speaker_0': 'Madam Secretary, Raquel Cashman.'",
        "'speaker_1': 'I can each Lopez. I knew. Ortega. Susman. Black Clerk Espinoza. Flynn, I. Gilmore, I. Mr. President.'",
        "'speaker_0': 'I. Pluto's wondering in the results.'",
        "'speaker_1': '12 Eyes, 12 eyes.'",
        "'speaker_0': '594 has been adopted. Councilman Castro. And is there anybody you'd like to bring up?'",
        "'speaker_5': 'Yes, Mr. President, I'd like to bring up Jose Brady representing the Colorado Coalition Against Gun Violence.'",
        "'speaker_8': 'Today, I gratefully accept the proclamation from Councilman Cashman on behalf of the Colorado Coalition Against Gun Violence. When I was 13 months old, Columbine happened. 13 people lost their lives that day. When I was nine years old, I was at City Park Jazz and I fled for my life when my friends and I had to run as'",
        "'speaker_8': 'a shooting broke out between two rival gang members. Five years later, Officers Officer Selina Hollis was killed at that same event.'",
        "'speaker_3': 'Seven weeks after she was killed.'",
        "'speaker_8': 'The Aurora theater shooting happened where 12 lives were taken. The next year I was sent home early from I attended East High School and I was sent home early. Classes were canceled that day because there were threats against our school.'",
        "'speaker_8': 'That shooting would happen. And just a few weeks ago, I was working with my friends at Regis University where I now attend, and we were working out homework in a classroom. And we learned that two shooters ran on to our campus from 50th and federal, and we had to barricade the doors with our legs and we didn't'",
        "'speaker_8': 'know what to do. Let's just say I didn't get my homework done that night. What do these all have in common? Well, these are things that have happened in my life, but I'm not alone. I have not felt safe in my schools, in my parks, at my movie theaters, or in my neighborhood.'",
        "'speaker_8': 'Fear has consumed me and many others in my generation across the country. As of five days ago, 943 young people under the age of 18 have been killed due to gun violence in 2018. That's under the age of 18, not even my age group.'",
        "'speaker_8': 'That number does not include the people that have been killed for many years, ever since 1970, when the Arkansas shooting happened. This number includes those 17 year old Ty Martinez who was shot and killed in March at West Colfax in law.'",
        "'speaker_8': 'I initially took this fear and turned it into action. I started a group at East High School to bring in young people to start talking about the issue and what to do about it. I got involved on the national level with Generation Progress to organize young people across the country.'",
        "'speaker_8': 'And as four years have passed, our leaders have done things. But it's not been enough. We have seen how young people are fed up. The parents like the moms and dads here today, which I would like everyone, if you are here working on this issue currently, if you could please stand and recognize you.'",
        "'speaker_8': 'The March for Our Lives was just the beginning. The walkouts were just the beginning. This proclamation is the next step. Next, we need solutions to reduce the disproportionate gun violence deaths of young people, and especially young people of color that are not recognized.'",
        "'speaker_8': 'We should all feel safe in our neighborhoods and our schools. And thank you to Councilman Cashman and to the city council today for sponsoring for you for sponsoring this proclamation, for everyone. Voting yes on this. This population is not the end, though.'",
        "'speaker_8': 'We all have to keep showing up and working to reduce gun violence. We have to. We have to. For everyone who has lost their sons, daughters, brothers, sisters, parents, friends and family members and countless others. Enough is enough.'"
    ],
    "Public Works Week in Denver and Employee Recognition.": [
        "'speaker_0': 'Thank you. Thank you. All right. Thanks again, Councilman Cashman, for bringing that forward. Our last proclamation this evening. Councilman assessment, will you please read Proclamation 595 happily.'",
        "'speaker_4': 'Mr. President, this is designating May 20th or 20 May 26 as public works week in Denver, whereas in celebrating the American Public Works Association 2018 theme of the Power of Public Works, we recognize that Denver Public Works through its 1300 employees is a dynamic force in our community, delivering safe, high quality, cost effective services to the citizens'",
        "'speaker_4': 'of Denver. And. WHEREAS, the services provided by Denver Public Works are an integral part of our residents everyday lives, with programs that include street sweeping, recycling, composting, trash collection, street paving, snow removal and pothole repair. And. Whereas, Denver Public Works is proud to deliver services that enhance the quality of life in our street, in our city, by'",
        "'speaker_4': 'managing and maintaining public infrastructure, including streets, alleys on street parking, drainage ways, sanitary sewers, bridges, traffic signals, street markings and signage, as well as contracting, procurement, cash sharing and permitting programs that meet the needs of the public. And.'",
        "'speaker_4': 'Whereas, Denver Public Works will continue to deliver projects that align with Mayor Hancock's Mobility Action Plan to provide people with more transportation choices and make biking, walking and taking transit easier and more convenient. And. Whereas, Denver Public Works will strive to create safe streets for everyone with improved pedestrian crossings, bike facilities and roadways, ample crossing times and'",
        "'speaker_4': 'improved sidewalk network networks to achieve zero traffic deaths and serious injuries by 2030, as outlined in Denver's Vision Zero Action Plan. And. Whereas, Denver Public Works Vision is to be the ideal public works department in the country and will meet expectations by coming together as a team, investing in our people, operating with discipline, using data to drive'",
        "'speaker_4': 'decisions and delivering results. And. Whereas, City Council specifically recognizes and congratulates the Denver Public Works Employees of the Year for 2017 on their achievements. And I'd like, if they are in the audience, to stand when I call your name.'",
        "'speaker_4': 'These are the Denver Public Works Employees of the Year. LA Nice Garden. Andy Stewart. I don't know if they're here tonight. Okay. Nick Arvydas, Angel Torres. Ruben Urbina, Brendan Marin, Ashley Grace. Marc Abeyta. Scott Smith. Steven Rehaut. Steve Aragon.'",
        "'speaker_4': 'Saul Martinez. Now, therefore, be it proclaimed by the Council of the City and County of Denver, that Section one the City Council designates the week of May 20th through May 26, 2018 as Public Works Week in Denver and congratulates the Denver Public Works 2017 Employees of the Year for their outstanding contribution contributions to the Department and the'",
        "'speaker_4': 'city in section two that the Clerk of the city and County of Denver shall attest, and a fix the seal of the city and county of Denver to this proclamation, and that a copy be delivered to Denver Public Works and the 12 employees listed above.'",
        "'speaker_0': 'Your motion to adopt.'",
        "'speaker_4': 'Q Mr. President, I move that proclamation 0595 be adopted.'",
        "'speaker_0': 'It's been moved in, seconded your comments.'",
        "'speaker_4': 'Thank you, Mr. President. I'm always very delighted to bring this once a year to honor our public works employees. This is the stuff that where the rubber meets the road, if I might say so. It's the kind of face to face.'",
        "'speaker_4': 'City work that's done about our streets are our walkways, our snow shoveling, the things that people will call our offices about and we'll call the city about probably more than anything else. And I have always been so grateful for the kind of responses that I get from the public works department.'",
        "'speaker_4': 'And and some of you even become good friends. And man, I know I call you. And I always worry, Oh, it's that Sussman again. But I but I am so grateful for everything you do for the people of Denver and just keeping our city moving and keeping our city in good shape.'",
        "'speaker_4': 'Really appreciate what you're doing for us.'",
        "'speaker_0': 'Awesome. Thank you, Councilwoman. And thank you for bringing this forward, seeing no other comments. You know, the real reason city council brings this forward to public works. And I want to let you guys know this, is that when we send you those emails about those potholes that need to get fixed in those alleys and I'm just joking'",
        "'speaker_0': '. We love y'all. We thank you so much for your hard work. And I really you know, I think councilwoman really underscored it. But I want to say it. I mean, I don't think that the folks of Denver really know how hard you all work.'",
        "'speaker_0': 'I don't think they really know that Denver moves. This city works because of you. And so thank you so much for your hard work and know that all the complaints and the yelling and the emails that you read, it does not go unappreciated.'",
        "'speaker_0': 'We appreciate how you guys endure all of this and thank you. So, Madam Secretary, roll call.'",
        "'speaker_1': 'SUSSMAN Black high clerk All right. Espinosa Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_1': 'Gilmore, I, percussion. I can eat. LOPEZ All right. New Ortega Hi, Mr. President.'",
        "'speaker_0': 'I please swallowing announce the results.'",
        "'speaker_1': '12 Eyes.'",
        "'speaker_0': '12 Eyes Proclamation. 595 passes. Councilwoman? Yes? Is there anyone you would like to bring up?'",
        "'speaker_4': 'Oh, I think so. I'd like to invite Mr. U.S. likely to the podium our new director of public. Executive Director of Public Works.'",
        "'speaker_9': 'Well, good. Good evening. Good evening. Thank you very much for taking the time out this evening.'",
        "'speaker_0': 'To recognize over 1300 employees. I work hard every day. Thank you, city council for for adopting and approving a proclamation this evening. I've only been.'",
        "'speaker_9': 'Here for for going on five months.'",
        "'speaker_0': 'And I've been so impressed with the staff that exists with our current department structure. I'm impressed with the passion, the dedication, the intelligence, the hard work. These are truly, truly public servants. And the customer base are the people that live and work in the city county of Denver.'",
        "'speaker_0': 'So I couldn't be prouder to be in my specific role as leader of this outstanding and dynamic department. And I really appreciate the.'",
        "'speaker_9': 'Opportunity to have.'",
        "'speaker_0': 'The staff behind me be recognized for all of their hard work. I know we had a couple of folks that weren't here, but we do have additional staff that did come out in support of Public Works Appreciation Week.'",
        "'speaker_0': 'So if you guys can just.'",
        "'speaker_9': 'Raise your hand.'",
        "'speaker_0': 'And so we're in full force tonight because we do really appreciate the recognition and very grateful for working on behalf of the city. So thank you. Thank you. You just glad to see you met Sekou there. He's a he's a regular.'"
    ],
    "Amendatory Agreement with Northeast Denver Housing Center for Rent/Utility Assistance Program.": [
        "'speaker_3': 'I need to call out Council Bill 391 for a vote for the purpose of an abstention.'",
        "'speaker_0': 'Great. Um, Madam Secretary, can you pull up 391? I'm going to go through the. I'm going to do a quick recap of all the bills. Under resolutions, we have nothing called out on a bills for introduction. We have nothing called out on our bills for final consideration.'",
        "'speaker_0': 'Nothing called out. We do have something under pending. Councilwoman Sussman has called out a postponement of Council Bill zero for 12 series of 2018 changes on classification for 4400 North Fox Street in Globeville. So let's let's do 391 first.'",
        "'speaker_0': 'And Councilwoman actually, Councilman Cashman, when you put 391 on the floor.'",
        "'speaker_5': 'Yes, Mr. President, I move that council resolution 391 be adopted.'",
        "'speaker_0': 'Okay. Actually, it's 391 a. Is that a resolution? Yes, it is. Okay, great. Yes, it is on the floor now. Go ahead and make your comment. Councilwoman.'",
        "'speaker_3': 'I sit on the board of a nonprofit organization that is partnering with Northeast Denver housing. And therefore, I will be abstaining from this vote.'",
        "'speaker_0': 'All right. Very well. It has been moved. I need a second dirt. Yes, Dr. Sussman. It's been moved and seconded. Madam Secretary. Rocco.'",
        "'speaker_3': 'Ortega abstain.'",
        "'speaker_1': 'Sussman Black Clarke Espinosa. Flynn I. Gilmore I.'",
        "'speaker_6': 'Cashman I.'",
        "'speaker_1': 'Carnage I.'",
        "'speaker_6': 'Lopez I.'",
        "'speaker_1': 'Knew, Mr. President.'",
        "'speaker_0': 'I. Pluto's voting announce results.'",
        "'speaker_1': 'Sorry one's missing.'",
        "'speaker_0': 'We do have one hanging fire. Thank you.'",
        "'speaker_1': '11 eyes. One abstention.'"
    ],
    "Rezoning of 4400 North Fox Street in Globeville.": [
        "'speaker_0': '11 eyes, one abstention. Three. No one has been adopted. Okay, um, let's see. Councilwoman Sussman, do you want to go head on and make your.'",
        "'speaker_4': 'I think Councilman Kasserine is going to put it on the floor. Yes. Order!'",
        "'speaker_0': 'Yeah. Councilman Cashman, we do have to take this out of order. Can you please put 412 on the floor?'",
        "'speaker_5': 'I'm glad to. I move the council bill 18, dash 041 to be taken out of order.'",
        "'speaker_0': 'It has been moved and seconded. Councilwoman.'",
        "'speaker_4': 'I think we have to do it on this one before I make my.'",
        "'speaker_0': 'Okay. Go ahead. Madam Secretary.'",
        "'speaker_1': 'Raquel Sussman. High Black. Clark Espinosa Flynn Hi. Gilmore Cashman. I can eat Lopez. I knew Ortega. I. Mr. President, I. 12 eyes.'",
        "'speaker_0': '12 eyes. It has been taken out of order. Okay. And Councilwoman.'",
        "'speaker_4': 'Yes, I move. That final consideration of Council Bill eight does show 412 with its public hearing be postponed to Monday, June 18th, 2018.'",
        "'speaker_0': 'And we'll be ordered published. Okay. In. Madam Secretary, we just need to put this back up for a vote.'",
        "'speaker_1': 'Yes, it needs to be moved and seconded.'",
        "'speaker_0': 'It has been moved and seconded. Roll call.'",
        "'speaker_1': 'SUSSMAN. Hi, Black. Clark, I. Espinosa, i. Flynn. I. Gilmore. Cashman. I can eat. Lopez. Hi, new. Ortega. Mr. President.'",
        "'speaker_0': 'I. This was very nice. Results.'",
        "'speaker_1': '12 eyes.'",
        "'speaker_0': 'All right. 12 Eyes. Counsel for 12 new public hearing date is now June 18th and will be ordered published. All right. This concludes all.'",
        "'speaker_1': 'The need to order it published.'",
        "'speaker_0': 'We do need to order and publish. Okay. Can I get an order? Yes.'",
        "'speaker_5': 'What would you like to order, Mr. President?'",
        "'speaker_0': 'You know. You know, right now I'm really hungry. So that in and out burger would be great. Okay. Please order this.'",
        "'speaker_5': 'Publish it. I move the notice of Council Bill 18 041 to a new public hearing date. Be ordered published.'",
        "'speaker_0': 'All right. It has been moved in. Second it secretary.'",
        "'speaker_4': 'SUSSMAN I'm.'",
        "'speaker_1': 'Black. CLARK All right, Espinosa. Flynn I kill more cash than I can eat. Lopez I knew. Ortega, I. Mr. President, I.'",
        "'speaker_0': 'Please. Please close it. ANNOUNCER Results.'",
        "'speaker_1': '12 Ice.'",
        "'speaker_0': '12 Ice. All right. New poll say just 18 minutes. It's now officially order published. Anything else, Madam Secretary?'",
        "'speaker_1': 'Nothing, Mr. President.'",
        "'speaker_0': 'Okay, great. All right, we're moving on. All of the bills are order published. We're now ready for the block. Votes on resolutions and bills and funding consideration. Council members. Remember, this is a consent or block vote. You'll need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call an item for a separate vote. Councilman Cashman, will you please, for the resolution for adoption in the bills and final consideration for final passage on the floor?'",
        "'speaker_5': 'Yes, Mr. President, I move that the following resolutions be adopted and bills be placed upon final consideration and do pass. 18 Dash 048 118 Dash 037 418 Dash 042 918 0437. Pardon me, Mr. President. 18 2043 818. DASH 043 918 days zero four 4018 days 044 118 days 040 218 days zero four or five 418 days 045'",
        "'speaker_5': '518 Dash 047 218 days 04738048 418 days 035 118 Dash 03908047 518 047 718 042 518. Dash 0436.'",
        "'speaker_0': 'All right. Madam Secretary, do you concur?'",
        "'speaker_1': 'Yes, Mr. President.'",
        "'speaker_0': 'All right. It's been moved a second and roll call.'",
        "'speaker_1': 'Black tie, Clark. All right, Espinosa, I. Flynn, I. Gilmore. Cashman. I can eat. Lopez. I knew Ortega. I. Susman. Hi, Mr. President.'",
        "'speaker_0': 'I please close the voting, announce the results.'",
        "'speaker_1': '1212.'",
        "'speaker_0': 'As resolutions have been adopted and bills have been placed upon final consideration and do pass tonight, there will be a required public hearing on as amended Council Bill 323, which amends is only coupled with multiple, sustained, substantive clarification and usability amendments in response to customer and community feedback, which is so nice, and also industry changes and other'"
    ],
    "Zoning Code Amendments.": [
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must director comments to council members and refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual personal attacks. All right, Councilman Cashman, when you put Council Bill 323 on the floor.'",
        "'speaker_5': 'Yes, Mr. President, I move the council bill 18, dash 323, be placed upon final consideration and do pass as amended.'",
        "'speaker_0': 'All right. It has been moved. And second, in a public hearing for three June 233 23 is now open. May we have the staff report? Sara.'",
        "'speaker_8': 'Good evening. I'm Sara White with CPD here to present the staff report for the 2018 Text Amendment Bundle. So as you may be familiar with our bundles of the past, the text amendment bundle is part of our effort to keep these zoning code modern, clear, user friendly and updated, and for us to be able to respond to'",
        "'speaker_8': 'requests for changes to the zoning code. So city staff periodically reviews the code and prioritizes updates in response to customer and community feedback, industry changes and other factors. And we we try to do these bundles of tax amendments roughly annually.'",
        "'speaker_8': 'So the most previous bundle was adopted last spring, in April of 2017. So the bundle is intended to implement several of the comprehensive 2000 plan goals to ensure that the zoning code is flexible and accommodates the current future land use needs.'",
        "'speaker_8': 'It encourages quality infill development that's consistent with the character of the surrounding neighborhood, establishes development standards that encourage positive change and diversity while protecting character and identifying community design and development issues and target specific concerns with appropriate controls and incentives.'",
        "'speaker_8': 'So the bundle allows us to respond to these types of requests as we as we get them, and try to keep the zoning code updated in an annual fashion. So the process so far, we started the scoping of this text amendment last summer and really research and drafted throughout the summer and fall and then started some targeted'",
        "'speaker_8': 'stakeholder outreach in late 2017, early 2018. So even before a public review draft was available, we did want to start the conversation with stakeholders who may be impacted by some of the changes so that we could have the conversation, get the feedback, make any changes that were necessary as a result of that conversation.'",
        "'speaker_8': 'We also presented to the Agency Zoning and Planning Committee for an info item in late January, and then on February 12th was when we released the full public red line and included the full text of the changes and a summary in more plain English.'",
        "'speaker_8': 'Since these bundles tend to be a little difficult to wrap your heads around, this one in particular includes over 80 items that was on our text amendment list. And then when that was released, there was also notice sent to all RINO's and council members.'",
        "'speaker_8': 'As well. We did offer text amendment briefings to all council members during this time. On February 21st, we had an info item at planning board and then we also had an info item at Luti on March 6th. And then March 16th, we had our planning board hearing.'",
        "'speaker_8': 'So for planning board and for city council, we have six letters of comment for the bundle. One was in support of our mis informed changes that are proposed as part of the mixed use two storey districts. One was in opposition to those same changes, saying that they were inappropriate to restrict commercial properties.'",
        "'speaker_8': 'One was asking for restrictions on the location of many storage facilities, particularly close to downtown, which is a topic that this bundle is addressing. One was commenting on the proposed step back that is part of the two and a half story building forms with low sloped roofs.'",
        "'speaker_8': 'This was a comment planning board as well. Generally, some concerns with the number we were proposing to step back to be addressed at one with generally various comments about all of the changes and then an additional letter that was submitted at Planning Board from the Vision Zero Coalition in support of the proposed drive thru restrictions.'",
        "'speaker_8': 'At Planning Board. Planning board voted 7 to 1 to recommend approval with the following conditions. The first condition was that the draft continue to be edited for clarity, and then the next the conditions two and three, where staff recommended conditions.'",
        "'speaker_8': 'So number two was that we clarify the applicability of some of the lighting standard changes and to remove changes to the maximum height for all fixtures. So these were some things that were in the early drafts as part of the lighting changes that as we talked more through them with our internal departments, particularly development services, some concerns'",
        "'speaker_8': 'were brought about about how we might implement some of those and in terms of inspections and that sort of thing. So we clarified the applicability of what types of projects would be subject to these new changes. Number three was that staff removes changes to the side interior setbacks for the max aims to ax districts adjacent to protected'",
        "'speaker_8': 'districts. So those of you who are moody and had individual briefings may remember that one of the changes we're proposing is to increase the rear setback for our Amex to ex districts. And as part of that, we also made a slight change to the side interior setback and we realized that that was actually inconsistent with the intent'",
        "'speaker_8': 'of what we were proposing to do. So we are leaving the side interior setback as is in the code currently, but still proposing the increased rear setback. And then number four was a condition that planning board added, and it was a result of a lot of conversation about the comments, whether the step back for the two and'",
        "'speaker_8': 'a half storey districts was appropriate to be applied at 25 feet or if there was a different number. So Planning Board added the condition that staff further examine and consider in future changes regarding possible unintended consequences of urban house ten foot step back about 25 feet, and possible unintended consequences of low sloped roof definition and complexity of'",
        "'speaker_8': 'compounded slopes. So the one vote of opposition from planning board was due to the fact that the Planning Board member did not agree with adding the fourth condition. It was not that he disagreed with the content of the bundle.'",
        "'speaker_8': 'So we had three speakers at Planning Board, two internally from the city, one from Denver Environmental Health and one from the Vision Zero Coalition, both speaking in support of the drive through restrictions and how they relate to pedestrian safety and actually asking for them to be expanded in the future.'",
        "'speaker_8': 'And then the member that also wrote the letter that's included in your packet spoke about the concerns with the loss of roof definition and the if the step back was proposed at the correct number. And as you see in your packet, he wrote a follow up letter after planning board that conceded that the 25 foot was was'",
        "'speaker_8': 'an appropriate number to apply the step back at. After Planning Board. A City Council had the Luti committee on April 10th, which was a consent agenda item. First reading was the 19th and we are at our public hearing tonight.'",
        "'speaker_8': 'Just a reminder that the bundle is proposed to have a roughly six month grace period for projects that have been submitted before the effective date to align with the end of the slot home's grace period. Which is why I say roughly six months since that Holmes was adopted about two weeks ago, and we wanted to align the'",
        "'speaker_8': 'end of the grace period with their grace period so that our development services staff didn't have to juggle multiple deadlines. And the reason for the grace period is similar to Slot Holmes in that there would be some pretty significant impacts to projects that have already put a lot of time and effort and investment into submittals.'",
        "'speaker_8': 'And we wanted to give them some time to finish up. So because of the process that we've had so far and the fact that we had individual council briefings and we did have an info item for the committee, I'm not going to go into the details of all 80 items that are proposed as part of the bundle'",
        "'speaker_8': '. Those were detailed in your packet. But what I am going to do tonight is I'm going to go through some of the changes that have occurred since you would have heard about it at a briefing or luti. So we continued to correct any errors and translations, continue to improve graphics, cross-references, clarifications, all of those things that the'",
        "'speaker_8': 'bundle is great for related to the many storage and drive through restrictions in SMEs and downtown zone districts and near rail station. So this is not something that has changed. So we did decide to continue to propose that mini storage be not allowed within a quarter mile of rail unless you're in an industrial zone district and four'",
        "'speaker_8': 'drive thrus within a quarter mile of rail to not be allowed unless you're in a suburban zone district with some additional restrictions. I just wanted to highlight this because this topic by far has gotten the most conversation out of anything in the bundle.'",
        "'speaker_8': 'And we've heard a lot of this is great. It should go further. We should apply it to more areas of the city. But we've also heard some this might be a little bit of an overstep. We want to make sure that we're supporting our density and our small units and giving them places to store their stuff.'",
        "'speaker_8': 'So we really think that the proposal, as is in the bundle, is a really good first step for treating these. We have heard a lot that we'd like that there are people who would like to see this potentially expanded to transit corridors or all corridors or all mixed use zoning, which is a really large impact on the'",
        "'speaker_8': 'city transit corridors. The reason that we didn't include them as part of this is because there's there's a lot less policy surrounding our transit corridors right now. There's a lot of planning going on, particularly with the Denver Moves plan.'",
        "'speaker_8': 'So as as that infrastructure fills in and as planning and policy kind of is solidified around those areas, I think there's definitely room to consider something further. But for now we are remaining with the rail station, quarter mile buffer and the downtown zone district changes.'",
        "'speaker_8': 'As I mentioned earlier, we are still proposing to increase the rear setback in our EMS and IMAX to ex districts when they're adjacent to protected districts. And a reminder, the reason for this is because these zone districts are intended to be embedded in residential areas, surrounded by urban houses and duplexes, that they really should reflect that character'",
        "'speaker_8': 'that they're intended to be placed in and not be allowed to build to the zero line and have a really large, hulking structure. And so, as I said, there was just a minor change that was proposed in addition to the rear setback for the side interior setback, we had proposed to increase that.'",
        "'speaker_8': 'But then we when we looked at it again, we realized that that was actually inconsistent with the urban House standards, which is what we were basing it off of. So we decided to keep that that standard at five feet.'",
        "'speaker_8': 'And then some more of the little shifts that we've done. We are still adding some standards to parking lot lighting. We're adding maximum illumination levels for certain uses, we're adding uniformity ratios for safety. Some of the things that we have changed a little bit since we talked with you earlier was some additional clarification on what projects would'",
        "'speaker_8': 'be applicable to these changes. So basically that projects that are submitted from here on out will be required to comply with these and not necessarily projects that are already built because that would be really difficult for our inspections to enforce.'",
        "'speaker_8': 'And then we had also proposed a mounting height limitation for fixtures. There is already mounting height limitation for freestanding lights in the zoning code, and we were proposing to apply that to all lights. But we realize that that could have some unintended consequences.'",
        "'speaker_8': 'It would prevent someone from having a patio light on their third floor apartment, that sort of thing. So that's something that we'd like to look at a little further. This is an additional topic that we've had a lot of conversation about through this bundle process.'",
        "'speaker_8': 'And again, this is kind of a first step for some lighting changes to our code. Our code doesn't have a lot of lighting standards right now. So we want to kind of start with the worst of it and continue to evaluate that through feature bundle changes and such.'",
        "'speaker_8': 'And then for the two and a half story forms of the low sloped roof, we are proposing a ten foot step back above 25 feet to essentially break up the mass of a building from the street. So you probably are aware that our two and a half story building form can result in something that really appears to'",
        "'speaker_8': 'be three stories, which is really out of context with a lot of what's built in the neighborhoods. So this step back above 25 feet is intended to make the building appear to be more consistent with generally the two stories that it's it's built around.'",
        "'speaker_8': 'This is what Planning Board had a lot of discussion about, based on Mr. Farley's comment, asking whether the 25 feet was the right standard and if there are other things that we hadn't considered as part of this. So we did study that number more, and we did come to the conclusion that 25 feet is the appropriate height'",
        "'speaker_8': 'to apply to step back at. And we also got the follow up letter from Mr. Farley agreeing, but we did actually use the unintended consequences portion of the Planning Board recommendation to consider and add the addition of an administrative adjustment for historic structures for this step back.'",
        "'speaker_8': 'So in our code, we already have allowed administrative adjustments for bulk and height for historic structures. And since this is a bulk related item, it was brought to our attention by the Curtis Park neighborhood that this could have some pretty large effects on the historic character by requiring the step back.'",
        "'speaker_8': 'So because in historic districts, there is an additional level of review, there's the design standards, there's L.D. Derby or LPC that has to make these decisions. We were comfortable adding an administrative adjustment that would allow, with the approval of the Landmark Commission, to get out of the step back in historic districts or historic structures.'",
        "'speaker_8': 'So moving on to the criteria that we use to address text amendments. The first is consistency with the city's adopted plans and policies. The first is comprehensive plan 2000, which I went over a little earlier, how the reason the bundle is consistent with adopt a plan, including requiring infill development to be consistent.'",
        "'speaker_8': 'We've done a lot in this bundle about consistent infill and bulk and mass. And then blueprint Denver. We have language in there that says amendments are recommended to implement adopted plans and improve compatibility with existing plans, as well as revise standards to make existing zone districts more compatible, which is what a lot of these mass and form'",
        "'speaker_8': 'changes are doing. It furthers the public health, safety and general welfare by providing clarity and predictability, facilitating planned and desired private enterprise and redevelopment. And it continues to implement adopted plans through regulatory changes. And it results in regulations that are uniform.'",
        "'speaker_8': 'The amendments regulations are uniform in their application to buildings and land uses within each zone district citywide, and it improves greater consistency in zoning regulations and removes conflicting provisions, which improves our ability to administer and enforce the code uniformly.'",
        "'speaker_8': 'So with that I o staff does recommend that the City Council approve the text mama 2018 bundle. I'm happy to answer any questions and talk about any of the topics in the bundle, especially since we didn't go into the details in the staff report.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_0': 'Great. Thank you, Sarah. All right. We have three speakers this evening and asked them to come to the front. We have John Noble, Jesse Paris and chairman say COO. Joe, your first 3 minutes. Good evening, counsel. My name is Joel Noble.'",
        "'speaker_0': 'I live at 2705 Stout Street. First, I just want to say these these bundles are one of my favorite things as a zoning geek, because I get exposed to so many of the the things that end up needing tweaked, whether I hear about it through neighborhood organizations or comes through planning board or hear about something go through'",
        "'speaker_0': 'going through the board of adjustment for zoning appeals that it's always great when it's some time later, it takes a little bit of time. You see a fixed proposal that's been studied and carefully considered and you say, Oh, that's great.'",
        "'speaker_0': 'I knew that didn't work right. I was carrying that around with me and now I know it's getting solved. John Haden, president of Curtis Park Neighbors, sent a letter to council copying CPD last week, thanking CPD for the work on one piece here, which is the change to the administrative adjustment table.'",
        "'speaker_0': 'And he asked that I speak on on behalf of Curtis Park neighbors tonight as an advisory board member just conveying our thanks Curtis Park and perhaps other historic neighborhoods from the same era tend to be tend to have houses that are narrow and tall.'",
        "'speaker_0': 'And this new upper storey step back for low sloped roofs like Italianate structures would require them would actually prevent them from being as tall as they normally are. When we have infill in our neighborhood, that infill should fit in.'",
        "'speaker_0': 'If if a house is built strictly to the zoning code, it would look quite small compared to the historic context. Today we depend entirely on administrative adjustment, which is a great little escape clause in the zoning code that says the zoning administrator may, within certain limits, allow some dimensions to be exceeded or modified in order to fit'",
        "'speaker_0': 'the context better. If it's beyond that limited allowance, it needs to go for variance but within within bounds. And that works very, very well. We go through a landmark review because it is a landmark district and then whatever administrative adjustments are needed have never been denied.'",
        "'speaker_0': 'This new measurement was not available for administrative adjustment, so that that meant that any infill housing in Curtis Park that is as tall as our normal housing is or is our context would have to go all the way for a variance, which is an expensive, lengthy and uncertain process.'",
        "'speaker_0': 'And when we made that case to CPD, they knew exactly what we were talking about. They never react quickly. They want to always want to go away. Study came back within a few days and said, okay, this narrow allowance on the administrative adjustment table where you're in a landmark district and Landmark has reviewed it is the minimum'",
        "'speaker_0': 'necessary to to meet your concerns. And in fact, it is. So thank you to Sarah and thank you to Kyle Dalton and Jennifer Capito. We're thrilled to see this go forward. All right. Thank you, Mr. Noble. Jesse Pierce, you're up 3 minutes.'",
        "'speaker_0': 'Good evening, members of the Council. When I was in Paris, my 2842 Josephine Street and Brookes, District nine. My question is I'm neither for I'm neither for nor against this. I just need clarification on what is a protected district.'",
        "'speaker_0': 'Is that the same thing as a historical district? What is urban house standards? And is this in any way going to increase the already gentrification that is going on in the Curtis Park neighborhood? It seems like you guys have just given leeway to gentrification in historically black and brown communities.'",
        "'speaker_0': 'I just need clarification that this building bundle is not going to. Facilitate that further. Thank you. All right. Thank you. Chairman Seiko, 6 minutes.'",
        "'speaker_6': 'Okay. Here we go. My San Francisco to organize a black star action movement. Social change agency. Voice for the poor. Working poor. Homeless senior citizens and youth. This bundle. To. Pull all of these seemingly minor pieces. There are connected to each other.'",
        "'speaker_6': 'Is a. Good idea. Answers. Anytime you can find common ground with 80 different minor entities. And combined into one big thing. Is part of administration. And of course, a lot of talk about means and explanations that we don't have to go through here in this body today because the work has been done by planning.'",
        "'speaker_6': 'But now let's look at pulling the layers back. Of The Onion to get to the core about what is really driving this. And what are the values behind this theme that allows us to miss the first four trees?'",
        "'speaker_6': 'I mean, we got trees. It. And it's a big thing. But what's really driving this thing? What's really driving? And that becomes a question for the people, because when you do this bundling thing, when you combine all of these things that you do early in the meetings into one vote and in that one vote, there are hundreds'",
        "'speaker_6': 'of millions of dollars down taxpayers money. And they're watching this on television because it means you organize at a time where a rush hour traffic, Jack, they can't come down it. So they get it after the fact. And so one of the things we do with this process is to allow it to become a educational process for'",
        "'speaker_6': 'the people who can be at the meeting for further review. Understanding that there's a time frame that folks got 30, 60 days, whatever that is, to actually implement a change. Now for vulnerable communities. That's not possible because the people are caught up, especially the folks that I represent, and to day to day survival.'",
        "'speaker_6': 'How am I going to pay my rent? What am I going to do about my kids going to school hungry? How am I going to deal with this thing when the food bank is gone and ain't nothing to eat?'",
        "'speaker_6': 'Transportation crazy. I don't have that amount of money to ride bus, so I got to figure out skills I can walk to where I got to go. So caught up in that minutia. So that we don't have the time to look at the overview of the map.'",
        "'speaker_6': 'What are they planning for you now that's going to impact your future? And an outreach doesn't include the future for education processes and to gain them into a better position of being great citizens in a great city. You had no outreach.'",
        "'speaker_6': 'Two high school's student council. Great way to educate them about what we can really do to you. So the outreach has to be expanded into student government zones and universities and colleges who are preparing themselves to be a part of this, not in it, because using it to our nose and to do, but the people of the'",
        "'speaker_6': 'future, the youth are not included in the outreach, so why not invite them to the meeting or had the meeting at a high school where they're at? How about a meeting, too, on a college campus where they're at C?'",
        "'speaker_6': 'And now we're talking about expanding democracy and getting more folks involved in the participation of the future because it's the students then the youth, which are the future right now and their voices need to be done right now.'",
        "'speaker_6': 'So they understand what is like an industrial. See as you blow past it on the leak there. But none of that. And changing from this to that, they don't even have don't even know what this is right now.'",
        "'speaker_6': 'But we missed a golden opportunity to prepare the future leadership through our outreach that can be expanded. See. Also, the youth has to be included in this statement because they're the ones who are going to be sent up here.'",
        "'speaker_6': 'Because at one point you always used. Yeah, but you learn about this in your daughter. How about if she knew this now? What kind of adult citizens would that be? Outstanding. So in this process of having to work to make the dream work, the dream is about now and it's about the future.'",
        "'speaker_6': 'And it's about the children. It's about increasing this empty chamber full of kids who want to come down here and learn how to do this thing. On the taxpayers dollars because they are the taxpayers that are going to be paying for the future.'",
        "'speaker_6': 'Things that are happening at least we can do is educate them now in the state.'",
        "'speaker_0': 'So thank you, Mr. Cobb. Thank you. This concludes our three speakers for this evening. Are there any questions by members of council? Councilman Ortega.'",
        "'speaker_3': 'Thank you, Mr. President. I do have a question about the two and a half stories step back. And what I'm trying to understand is if that is only applicable to the residential zones. Is it specific to historic districts or is it how just help me understand how broadly that is applied.'",
        "'speaker_3': 'Sure.'",
        "'speaker_8': 'So it is applicable to all of our two and a half story residential building forms. Generally in our mixed use districts, we don't have the two and a half story building forms because the height limits are higher. So it's going to be your urban house, your duplex, your two and a half story row house across board.'",
        "'speaker_3': 'Okay. So where the code? Formerly allowed like half of a third story. Does this remove that? Help me understand. What that. Sure.'",
        "'speaker_8': 'So I'll clarify what the half story is, because it's not really a half story. Essentially what it is, is it's a third story that's allowed to be no greater than 75% of the floor below it. And what that was intended to do, I may have slide here.'",
        "'speaker_8': 'So this slide, this image on this slide on the top is from the zoning code. And it was really what the half storey was intended to do. When you have the traditional house with the sloped roof and it's two stories, you have that space under the sloped roof that's technically would be considered a third story and we'",
        "'speaker_8': 'wanted to allow it to be used as livable space. So we called about a half story when it's really 75% of the floor below. It's a third story. And you can see this is a photo example of infill that has used that and you can see it's generally pretty in scale what's surrounding.'",
        "'speaker_8': 'But essentially what's been happening is people take that allowance and when you use a flat roof form or as we're redefining in the bundle, low slope and you push it to the front of the building, it really looks like a full three stories and you can see it towering over the surrounding infill development.'",
        "'speaker_8': 'So what this is intended to do is to push back that third story. We haven't made any changes to the allowance of how much of it, but it's possible that there will be less allow for a allowed floor area if they can't get that full 75% after having to step it back ten feet from the front of'",
        "'speaker_8': 'the building.'",
        "'speaker_3': 'Okay. That's very helpful. Thank you. I have no further questions.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Espinosa.'",
        "'speaker_7': 'Do you want to take a stab at explaining what a protected district is?'",
        "'speaker_8': 'Sure. So a protected district is essentially in practice, a low scale residential district. We have a definition in the code. It's got a list of all of our zone districts that are considered protected districts. It's all of our single unit districts, all of our two unit districts.'",
        "'speaker_8': 'I think all of our House districts and one multi-unit district, EMU, two and a half. And what that means is when you have a mixed use zone district adjacent to something that's considered a protected district, things that are built on that lot have to comply with additional standards.'",
        "'speaker_8': 'Usually it's additional setbacks or additional bulk plan, that sort of thing, to protect the character of the low scale residential that it's adjacent to.'",
        "'speaker_7': 'But the disk we're only talking about the mapped district, the physical map district. It doesn't it's it doesn't matter whether or not the building is a low scale residential building.'",
        "'speaker_8': 'That's correct.'",
        "'speaker_7': 'All right. Hope that helps. Thanks. Thank you. No further questions.'",
        "'speaker_0': 'Okay. Thank you. Seeing no other questions, this concludes the public hearing of 323 comments by members of council. That assessment.'",
        "'speaker_4': 'Thank you, Mr. President. I just want to thank the CPD and the planning board for the work that you did on this bundle. It well, it is a lot of things. It really dives into things that we have had some concerns about that we hear about at committee, that we hear about from neighbors who are worried about'",
        "'speaker_4': 'construction going on next door. Thanks for the explanation of the 2.5 because I too was thinking it's really 75% of the top. But if they can't get the ten foot setback, it may not be 75% of the top of it.'",
        "'speaker_4': 'Right. Okay. And also four in, you know, increasing the setbacks. But but especially for the storage units, mini storage. And I think I have to thank my fellow councilwoman, Kendra Black, who also brought this forward, said this is a very good move, I think, to help us with getting activation around areas of transit and Main Street.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Dr. Sussman. Councilwoman Black.'",
        "'speaker_4': 'I want to thank Sara. You were really great with the Todd. Limiting the storage and the drive thrus. I wanted.'",
        "'speaker_3': 'To go a little further, but I acknowledge it's a good first.'",
        "'speaker_4': 'Step. And I appreciate you reaching out to the Storage Unit Association. We met with them and they were okay with it and the drive thru people never got back to us, so I really appreciate it. My district has five light rail stations and a.'",
        "'speaker_3': 'Lot of storage.'",
        "'speaker_4': 'Facilities and we don't want to have any more near a light rail station. So thank you very much.'",
        "'speaker_0': 'All right. Thank you, Councilman Black Espinosa. Councilman.'",
        "'speaker_7': 'Is there a drive through association? I also want to thank you again, Sarah, and staff for another text amendment. It's always nice to see these changes. I don't think I geek out as much as Joel does, but it is fun to see incremental change to our zoning code.'",
        "'speaker_7': 'The one thing that I you made it very clear that you're you're cognizant that there might be unintended consequences and you're sort of recognizing that there's still the ability for things you haven't considered to come about. And I think in an earlier presentation that sort of opined where I saw sort of something breaking down the so I'm'",
        "'speaker_7': 'going to go back to something I said I think two or three meetings ago, which is, is if staff is is seeing that speak up and let the zoning administrator know that there is this repeated incidents happening that may not warrant a meeting, may rise to an occasion where you're not following the usual text amendment, but then'",
        "'speaker_7': 'bringing it to Brad Buchanan and having him move forward with a quick change. It'll still be a public process. We will still have the ability to discuss it, but let's not wait for a repeated sort of habitual pattern to form and and get so deliberative in.'",
        "'speaker_7': 'If we're already recognizing that one change we've made has unintended consequences, that could be addressed maybe by coupling some form standard with a use exception or something like that, you know. So that's all. Just wanted to make sure that I'm probably going to keep hitting that point.'",
        "'speaker_7': 'Time and time again now, because it's sort of my one thing is how do we more rapidly address things that go south when when we know better? So that's it. Thanks.'",
        "'speaker_0': 'All right. Thank you. Thank you all. Thank you, CPD, for for putting this forward. You know, I think you guys are starting to adjust to the many issues that we're seeing all over the city and really appreciate that everyone does love speed and we want this to be faster.'",
        "'speaker_0': 'But at the same time and I don't want to say but we want it faster, we want more speed. Let's just leave the period there. I will also say that I recognized the macro changes that were happening about this.'",
        "'speaker_0': 'The city and these unintended consequences have happened in my district. They've happened in other districts. And and I understand those are sometimes irreversible. And so I appreciate it. But as long as we can figure out how to turn a little faster on some of these things, it will be very helpful.'",
        "'speaker_0': 'The folks you see up here are on the front lines of dealing with a lot of our land use issues. And and we're getting we have a lot of ideas and so we want to see those things move.'",
        "'speaker_0': 'But thank you for your hard work and know it's very deliberative and we appreciate it. With that. Madam Secretary, it's been moved to a roll call.'",
        "'speaker_1': 'Black clerk. All right. ESPINOSA Hi.'",
        "'speaker_9': 'Flynn Hi.'",
        "'speaker_1': 'Cashman I can eat. LOPEZ All right. Ortega I. SUSMAN Mr. President, I promise.'",
        "'speaker_0': 'What?'",
        "'speaker_1': 'No, we're good.'",
        "'speaker_0': 'Okay. Please close the voting. US results.'",
        "'speaker_1': 'Tonight.'",
        "'speaker_0': 'Ten Eyes Proclamation 323 has passed. Congratulations. Okay. Excuse me. Excuse me. On Monday, June 18, 2018, Council will hold a required public hearing on Council Bill 365. Change the zoning classification of 3880 Holly Street in Northeast Park Hill Erekat Public Hearing of Council Bill for 22 Changing the zoning classification of 421 West Fourth Avenue and Baker and'"
    ]
}