{
    "Proclamation for the Stamp Out Hunger Food Drive.": [
        "'speaker_1': 'We do have two proclamations this evening by Councilman Lopez. Councilman Lopez, will you please read proclamation number 397?'",
        "'speaker_4': 'Thank you, Madam President. Proclamation number 397 series of 2014. This is recognizing the National Association of Letter Letter Carriers and the stamp out Hunger Food Drive on May 10th, 2014. Whereas on the second Saturday of May each year, our intrepid band of letter carriers fan out across the United States, Puerto Rico, the Virgin Islands, Guam and the'",
        "'speaker_4': 'District of Columbia, and carry out an important act of kindness. And. Whereas, on that day, the letter carriers not only deliver the mail, but they also collect food contributed by postal customers as part of the stamp out hunger campaign and drive that in the nation's largest one day food drive and this and distribute the donations to local'",
        "'speaker_4': 'food banks. A total of 1.3 billion over the past 21 years. And. Whereas, 22nd Stamp out of Hunger Drive will be on May 10th this year. And it is one example of how letter carriers make the difference in the communities they serve.'",
        "'speaker_4': 'And. WHEREAS, all food collected in Denver stays in Denver distributed by Food Bank of the Rockies, and greatly helps those in need within our community. Now, therefore, be it proclaimed by those by the Council, the city and county of Denver, Section one.'",
        "'speaker_4': 'Now, the City Council hereby recognizes and thanks the National Association of Letter Carriers. And each of our letter carriers for their hard work year round and for their commitment to stamp out a hunger food drive. Section two at the Clerk of the City and County of Denver Store Test and affix a seal of the city and county'",
        "'speaker_4': 'of Denver to this proclamation and a copy be transmitted to the National Association of Letter Carriers.'",
        "'speaker_1': 'Thank you. Councilman Lopez, your motion to adopt.'",
        "'speaker_4': 'I move that council proclamation number 397 series of 2014 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments by council. Councilman Lopez.'",
        "'speaker_4': 'Well, I can tell you that I don't expect very much opposition. I think a lot of folks like to receive their letters, but I do have to express that. I was contacted by a bunch of dogs out in the neighborhood and they're very displeased with this.'",
        "'speaker_4': 'They do not like the idea of postal carriers being good guys and good ladies who apologize in advance for a lot of those dogs on the west side and only about a foot tall, but they're fierce and they chase the letter carriers around.'",
        "'speaker_4': 'I got to say, most of the people who I have come to know that have not only been very fit and walk fast, but have been very courteous, have been letter carriers. And now that I think of it, some people in my life who are very significant are letter carriers.'",
        "'speaker_4': 'And they've always they've always been very impeccable with their time. They've been a lot of workers, and they've always been cheery. For some reason, I think that's because they walk around so much and they whistle and you see them around.'",
        "'speaker_4': 'And, you know, I know our letter to letter carriers that deliver our route and they're amazing people. They're really cool. And actually, the one thing I got to say about them is they are the eyes and ears of the neighborhood.'",
        "'speaker_4': 'They don't just deliver the mail, but they are a part of the neighborhood. They're a part of neighborhood life. They report, you know, danger when they see it. They report crime. There's been letter carriers that have disrupted bank robbery now bank robberies, house burglaries, things like that.'",
        "'speaker_4': 'We've had instances where people who had not answered their door in a long time because they are in an emergency and are unable to move, have been contacted by or the first time point of contact. And their I guess their life saving point of contact has been a letter a letter carrier.'",
        "'speaker_4': 'There's just a lot of honor in what they do. Anyway, if it wasn't for this campaign, it's really hard work. You know, we complain when it snows three feet of snow here in Denver or if it's a hot day or it's very cold.'",
        "'speaker_4': 'Those letter carriers are out there almost nonstop. For them to be doing this campaign and not only delivering that mail, not only come in to what they do on the job, but to be able to carry canned goods back to their trucks, back to their stations and back to the food bank from our houses.'",
        "'speaker_4': 'I think that's that's that you got to there's something very honorable in that. I think it's a lot of hard work to be able to do that. And it's a lot of commitment. And, you know, there's a lot of people that are still depending on food banks.'",
        "'speaker_4': 'And for some people, this is the only nutrition and the only food they'll get that they can afford. Many of them live in food deserts, and these food banks depend on drives like this. So. Madam President, I am very proud to carry this proclamation.'",
        "'speaker_4': 'I know the letter carriers. I think their local is in Council District three. Right. Right off our Christian shared. And I'm very proud of that. So. Madam President, I support this wholeheartedly. And I saw my colleagues join me and I would ask that folks at home on May 10th leave out some canned goods with their man with'",
        "'speaker_4': 'their mail.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilwoman Kennish, I just wanted to say thank you for what you do. I love that it's.'",
        "'speaker_3': 'Often on Mother's Day weekend and.'",
        "'speaker_1': 'In particular, you know, we had a major federal cut to food stamps this year. And so the food bank demand is really increasing.'",
        "'speaker_3': 'It seems so counterintuitive. Our economy is getting better.'",
        "'speaker_1': 'But it's just not for folks whose wages haven't gone up. And so I just wanted to.'",
        "'speaker_3': 'Say thank you for.'",
        "'speaker_1': 'What you do. And I'm so excited.'",
        "'speaker_3': 'That my.'",
        "'speaker_1': 'Colleague, Mr. Lopez, proposed this and I appreciate his sponsorship of this. Thank you. Thank you, Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you. I also wanted to say thank you and also to let you know that there's a big box in the building that I live in. And so now I'm going to go knock on everybody's door and get some food so that we can help contribute as well.'",
        "'speaker_6': 'But every day when I am either leaving or coming home, my timing is always just right with the letter carrier. And so just the idea that they're sitting there and they're always happy and. They're just whistling and just happy to be alive in and be able to do such a humble service for people is so heartwarming.'",
        "'speaker_6': 'So thank you very much. And I'll be supporting this proclamation.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Nevitt.'",
        "'speaker_4': 'Thank you, Madam President. To quote from the letter carrier's credo, neither snow nor rain nor heat, nor gloom of night stays these couriers from the swift completion of their appointed rounds. That pretty much says it all. And they've been providing this service and we've been relying on them since the founding of the republic.'",
        "'speaker_4': 'So keep it up.'",
        "'speaker_1': 'Thank you, Councilman. Okay, Madam Secretary, roll call.'",
        "'speaker_4': 'Lopez Hi.'",
        "'speaker_3': 'Montero.'",
        "'speaker_4': 'Nevitt Hi.'",
        "'speaker_3': 'Rob. By Brooks Brown. I thought I finished Lehman. Hi, Nevitt.'",
        "'speaker_4': 'I again. Hope you're right.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_1': 'I. Councilwoman Fox and Councilwoman Sheppard. Okay. Madam Secretary, close of voting. Announce the results.'",
        "'speaker_3': 'Tonight.'",
        "'speaker_1': 'Ten Eyes. The proclamation is adopted. Councilman Lopez, do you have somebody you'd like to call up to the podium?'",
        "'speaker_4': 'Yes, I would. I wanted to ask Cindy and she come up to the oh, then you can come as well to come up to the microphone and representing the National Association of Letter Carriers. Private army, an army of letter carriers.'",
        "'speaker_1': 'Go right ahead. Introduce yourself. My name is Cindy Kirby. I'm with the letter carriers and I have some great folks with me today. Introduce themselves individually, however you'd like to. You can introduce them or they can.'",
        "'speaker_3': 'Is Jasmine Lee Robles.'",
        "'speaker_1': 'Hello Jasmine I'm Kelly Robles and I'm I carry out of.'",
        "'speaker_6': 'Aurora Centennial a play.'",
        "'speaker_4': 'My name's Jeff Frye I carry out of Denver branch 47 and downtown where I think your box was put.'",
        "'speaker_1': 'Lovely. Thank you for being here. Kelly. Kelly is our statewide food drive coordinator and Jeff is our branch food coordinator. Both of them are new in their positions and they're doing a fantastic job this year. We're hoping we're doing more advertising to get more and more folks to be.'",
        "'speaker_3': 'Aware of the drives and remember to put the.'",
        "'speaker_1': 'Can.'",
        "'speaker_4': 'In the mailbox.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you. It's nonperishable items.'",
        "'speaker_1': 'Nonperishable items. Okay.'",
        "'speaker_4': 'The canned food out $1 by 5 of food.'",
        "'speaker_1': 'Oh, my. That's a great.'",
        "'speaker_4': 'It's a very, very worthy cause. And it feeds a lot of kids that are just getting out of school where they have to rely on the school lunch programs for their meals and sometimes their only meal during the day.'",
        "'speaker_4': 'So this is critical for to stock the food that's during the summer months.'",
        "'speaker_1': 'Thank you for all you do for our neighborhoods. It just reminds me of Mr. Rogers. And was it Mr. Feely, who was the was speedy.'",
        "'speaker_4': 'Speedy delivery?'",
        "'speaker_1': 'Was speedy delivery or somebody and maybe he was on Sesame Street. But anyway, thank you so much for doing all this. It's really great to have you here. Thank you. Okay. We have another proclamation by none other than Councilman Lopez.'"
    ],
    "Rezoning of 3226 W. 19th Avenue from P.U.D 81 to G-MU-3.": [
        "'speaker_6': 'Thank you, Madam President. I know that Council Bill 154 would be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved. I need a second token. Thank you much. I have moved. It has been removed. And second Ed Constable's 154, 145 and 199 approve zoning map amendments. The Council is required by law to conduct hearings on zoning map amendments and Council's actions are subject to court review in order to provide a record'",
        "'speaker_1': 'for court review. Testimony is recorded and any items presented to the Council are marked as exhibits and become a part of the record. They may be picked up from the council secretary after 30 days or after the conclusion of any court cases.'",
        "'speaker_1': 'Speakers should begin their remarks by telling the council their names and cities of residents, and if they feel comfortable doing so, their home addresses. The public hearing for Councilor Bell 154 is open. May we have the staff report?'",
        "'speaker_4': 'Good evening, Madam President and members of Council. My name is Tim Watkins with Community Planning Development here to present rezoning application 2013 I 53. This is for property located at 3226 West 19th Avenue, located in Northwest Denver Council District one and right at the top of West Colfax neighborhood, just bordering Sloane Lake on 19th Avenue.'",
        "'speaker_4': 'And here the property is highlighted just half block from Halleck Park to the West, two and a half blocks to the east. As Federal Boulevard, we have higher capacity transit, getting folks to towards downtown and other areas of the city.'",
        "'speaker_4': 'This is a carriage lot with alleys on two sides. Here's a shot from 19th Avenue. Looking at the property frontage, you can see an alley on either side. This is a view to the south. Along one of the alleys, you can see the rear facing garages of the residential properties to the east or to the west.'",
        "'speaker_4': 'Excuse me. And this is a neighborhood with a mix of multifamily structures, as well as single family units mixed throughout the neighborhood. This is a property just to the north, just to the south, the other carriage lot, the adjoining carriage lot.'",
        "'speaker_4': 'So the applicant is Abby House LLC, ABC House LLC, represented by Mary Rivas and the representative is here this evening and available to respond to questions. Comments. The request is from PD 81 to GM. You three were general urban multi-unit maximum of three stories.'",
        "'speaker_4': 'PD 81 allows for two additional units in addition to the existing single family home. Here's a map of the district map and PD 81 showing the existing single family home and the allowance for an additional duplex option to the rear of a maximum of 40 feet high.'",
        "'speaker_4': 'The existing contact surrounding the property is you can see the orange colored lots represent multifamily units. These tend to be older structures, one or two story duplexes, some three or four or more units, as well as a number of single family dwellings mixed throughout.'",
        "'speaker_4': 'In fact, this is a neighborhood undergoing quite a bit of transition. The center image, in fact, if you were to go there today, those homes have actually been demolished and there will be a new project built on that property.'",
        "'speaker_4': 'This is an example of some of the newer infill development occurring in the neighborhood just to the west excuse me, just to the east is this single family property. And further up the street to the west, you see some of the new infill development.'",
        "'speaker_4': 'Tivity taking place in the neighborhood. So the public review process has included applicant and R.A. letters and emails to the various groups that you see listed here. There was written notice of receipt of application. There was proper notification prior to planning board.'",
        "'speaker_4': 'There have been no formal responses. Only one inquiry planning board recommended approval on February 19th and there was proper written notification for Ludie and as well as for this public hearing tonight. Legal posting and written notification. So looking at our review criteria, the consistency with adopted plans includes references in Plan 2000, which encourages for sustainable development and'",
        "'speaker_4': 'infill development within sites where services are already in place and meeting the needs of increasingly diverse housing. Now, Blueprint Denver actually calls this an area of stability and single family residential. But I would point out the zoning prior to Blueprint Denver's adoption in 2002 was our two zoning, which allowed for two units and then PD 81, which'",
        "'speaker_4': 'allows for three units, was adopted in 1982, also prior to Blueprint Denver and then in 2010, as part of the comprehensive legislative rezoning, the surrounding properties were re zoned from our two to GMU three. And that's seen here in this zoning map.'",
        "'speaker_4': 'You can see that on all sides surrounding this property, the new zoning is GMU. Three are general urban multi-unit, three storey maximum height. So PD was not free because there were just too many pads during the comprehensive legislative rezoning to examine each each PD individually.'",
        "'speaker_4': 'And so 81 was not re zoned with the surrounding area. So the West Colfax Neighborhood Plan adopted first in 1987 re adopted in 2000 supports infill housing at a slightly higher density than what was allowed in our two zoning.'",
        "'speaker_4': 'And so PD 1881 is consistent with that slightly more dense than our two zoning was prior to 2010. So we find that there is adopted plan support primarily based on the West Colfax Neighborhood Plan. We find that this rezoning would would result in uniform application of district regulations.'",
        "'speaker_4': 'It would further public health, safety and welfare based on implementation of adopted plans. The justifying circumstances would be that this is consistent with surrounding recently zoned property two, GMU three, and that it is an area of investment in infill development where existing services are in place and transit service and that this is consistent with neighborhood contact zoned'",
        "'speaker_4': 'district purpose and intent. And therefore CPD recommends approval based on finding that all review criteria have been met.'",
        "'speaker_1': 'Thank you very much, Mr. Watkins. We have two speakers signed up and I will call on Mary Rivas first. Good evening, Madam President.'",
        "'speaker_3': 'Councilman and councilwoman. I am Mary Rivas, and I live in northwest Denver. And available for any questions.'",
        "'speaker_1': 'Thank you very much. Thanks for being here. Now we call on Mr. Sekou.'",
        "'speaker_7': 'Good evening. Chairman CQ flexed our action movement for Self-defense. Advocate for poor, working, poor and homeless people. Well, tonight we have the honor of standing with Sister Mary Bills and supporting this zoning change for a couple of reasons.'",
        "'speaker_7': 'One, she's outstanding and she's willing to work with us to begin to develop economic units for poor people who can actually own their units through cooperative housing programs that are now existing upon the federal government of $60 million that haven't been accessed by the city yet over the last four years before people own their own unit cooperative'",
        "'speaker_7': 'housing. So we talked to her. She's also have experience of working with organizations like Habitat for Humanity, which allows us to build the people as we build the houses, because out of that, we get people who are trained in painting and plumbing and this and that and the others so they can actually own and pay for the'",
        "'speaker_7': 'unit that they build themselves so that we have no more exodus of poor, working, poor and homeless people, no more excuses of unintended consequences of why we don't get the job done when we have everything to work with other than the political will.'",
        "'speaker_7': 'So we would like for you to approve this. And bottom line is everything else around her is already zoned for this. DMU three And for whatever reasons, not to put any onus on anyone. Things happen. There's unintended consequences.'",
        "'speaker_7': 'She was missed out and she has every right to be included. Thank you so much.'",
        "'speaker_1': 'That concludes our speakers for this evening. Are there questions by members of council and seeing no questions, a public hearing is closed. Comments by members of council. Councilwoman Sheppard is not here. Is there anyone else? Councilwoman Kennish.'",
        "'speaker_3': 'I just as an at large representative, thought it would be nice for you to hear from one of your council representatives and terms of appreciating your willingness to work with our process. We did not.'",
        "'speaker_1': 'Do the.'",
        "'speaker_3': 'PEDs during the overall city rezoning, and.'",
        "'speaker_1': 'We understand that that puts.'",
        "'speaker_3': 'The burden on some individual owners. But it seems well-planned in this case in terms of the matching of the zoning. And so I would urge our colleagues.'",
        "'speaker_1': 'To support it. Thank you very much, Councilwoman Kennish. All right. It looks like we are ready for roll call.'",
        "'speaker_3': 'Kenneth Lehman I Monteiro Nevett. Hi, Rob. By Brooks Brown.'",
        "'speaker_4': 'I fight.'",
        "'speaker_3': 'II. Lopez All right. Madam President.'",
        "'speaker_1': 'I am secretary close of voting. Announce the results tonight. Ten Eyes and the zoning has passed. We'll move on to the next one. Councilman. Councilwoman, first, will you please put council vote 153 on the floor.'"
    ],
    "Rezoning of 1205-1275 Osage Street in Council District 9.": [
        "'speaker_6': 'Thank you, Madam President. I move the council bill 153 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved. I need a second. Second? Thank you, Councilman Brown. The public hearing for Council Bill 155 is open. May we have the staff report? It's Mr. Watkins.'",
        "'speaker_4': 'It's me again. And happy to present rezoning application 2013 I 55 of the property located at 1205 to 1275 Osage. This is located in Central Denver, just a few blocks south of Colfax Avenue in Council District nine and right near the well.'",
        "'speaker_4': 'It's in the Lincoln Park neighborhood, right near the 10th A.H. Station, light rail station. So here is the property highlighted. It is just over two acres, 2.34 acres. There is an existing two storey warehouse building which is currently vacant.'",
        "'speaker_4': 'The property is also vacant. As you can see in this aerial image. The property is located just across from the llama, Lincoln Park and just 2 to 3 blocks from the 10th panel stage station, street light rail station.'",
        "'speaker_4': 'Here's a view of the property from 13th Avenue. Looking south along the property frontage park just to the to the east. Here's a view looking towards the southwest from the park. And you can see the light rail in the background and the vacant warehouse building to the left.'",
        "'speaker_4': 'And here's a view of the property along the building frontage again with the park to the left or to the west. So the applicant is a and j investments represented by Bruce Larson in city architects and others. The owners and representatives are here this evening and available for public comment.'",
        "'speaker_4': 'The requested to rezone from r m u20 with waivers to CMCs five. So ami 20 is a mixed use zone, and the waiver was just simply waiving the right to build any further away than zero feet. So as a zero or a zero foot build to requirement and the request is to see Annex five or urban center'",
        "'speaker_4': 'mixed use. Mixed uses with a maximum of five stories. So the most recent use for this property was warehouse in the existing structure. But as I mentioned, the building and land are currently vacant and it seems to be a prime location for infill development, transit oriented development being just 2 to 3 blocks from 10th in all state'",
        "'speaker_4': 'Osage station and significant amount of development currently underway, including some of the Denver Housing Authority projects that are nearing completion or have been completed. There are also some light industrial uses to the north, an office and multifamily uses to the south.'",
        "'speaker_4': 'So the public review process at present has included extensive applicant outreach to the registered neighborhood, as well as letters and emails to all applicable neighborhoods or organizations as listed here. Written Notice of receipt of application back in January.'",
        "'speaker_4': 'Notification Sign is posted on the property prior to the public hearing at Planning Board and they recommended unanimous approval on February 19th. There were public comments provided and support provided by the Lincoln Park Neighborhood Association and the new said Community Development Corporation, and their letters are contained in the staff report and proper written notification prior to Ludie'",
        "'speaker_4': ', as well as the legal posting written notification for this public hearing this evening. So look at the review criteria, starting with consistency with adopted plans. Comp Plan 2000 encourages infill development and sustainable development, particularly near centers of activity.'",
        "'speaker_4': 'I'd like to point out that there's a particular reference here under land use to work with the Denver Public Schools to preserve and incorporate educational facilities as key elements of healthy neighborhoods. Also changing travel behavior, promoting opportunities that bring people together to build connections between each other.'",
        "'speaker_4': 'Blueprint Denver Conceptually, this is an area of change and mixed use. Feature land use and the recently adopted llama Lincoln Park Neighborhood Plan adopted in 2010, shows this area's transit oriented development and encourages a rich mix of uses including housing, jobs, shopping, parks and other amenities, and with a key goal to provide opportunities for local job training'",
        "'speaker_4': 'and education. Additionally, in the review criteria, this would result in a uniform application of district regulations and further public health, safety and welfare through implementation of adopted, adopted neighborhood and comprehensive plans. The justifying circumstance would be that there is a rail station and surrounding transit oriented development that are rapidly developing and bringing more people living and working'",
        "'speaker_4': 'in the area near transit and that the property is vacant. Both the building and the land area and are ripe for infill and redevelopment or adaptive reuse and also would find CBD also finds that this is consistent with neighborhood context, zoned district purpose and intent, and we therefore recommend approval based on finding all review criteria have been'",
        "'speaker_4': 'met.'",
        "'speaker_1': 'Thank you, Mr. Watkins. We have four people signed up to speak. Let me call on Josh Comfort.'",
        "'speaker_4': 'Okay. Good evening, Madam President. Members of Council. My name is Josh Comfort. I reside at 678 Lafayette Street here in the city and county of Denver. I'm an architect, and I'm.'",
        "'speaker_0': 'Also an owner's.'",
        "'speaker_4': 'Representative this evening here representing the owner of the property between 1205 and 1275 Osage Street. Just as a quick, quick history, because I think we'll all appreciate this as to where this rezoning is headed. My initial two conversations with the owner of this property where back in 2002, 12 years ago, in which as an architect, we prepared'",
        "'speaker_4': 'a number of design concepts for the property.'",
        "'speaker_0': 'We established a vision.'",
        "'speaker_4': 'And for the future of a substantial residential apartment complex over the entire piece of property. And for a period of time, those plans lay dormant. 2007, five years later, after some things calmed down in other areas of the country, in fact, we reengaged on our design process.'",
        "'speaker_0': 'Engaged the local.'",
        "'speaker_4': 'Community, building an architectural firm of VanMeter Williams Pollock to be our architects of record on this.'",
        "'speaker_0': 'We designed the project and by 2009.'",
        "'speaker_4': 'We had permitted two phases of residential construction between 12th and 13th on Osage Street. And we also had proceeded with the demolition of the old.'",
        "'speaker_0': 'Comac paint factory.'",
        "'speaker_4': 'At the north end of the block, which many of you may remember. The owner of the property actually.'",
        "'speaker_0': 'Owned the property since the late seventies.'",
        "'speaker_4': 'He operated the Comac paint factory as a paint factory in the late seventies. So he's been in this neighborhood for a number of different years. 2012.'",
        "'speaker_0': 'We unfortunately.'",
        "'speaker_4': 'Lost our tenant.'",
        "'speaker_0': 'In the warehouse building.'",
        "'speaker_4': 'We had previously lost our financing on the project with the economic downturn and as a result put the park project back on the market. And in 2013.'",
        "'speaker_0': 'We fortuitously came across the Denver public.'",
        "'speaker_4': 'School system in the form of the Emily Griffith Technical College looking for a new home.'",
        "'speaker_0': 'So we have a marriage which we think.'",
        "'speaker_4': 'Is quite effective here. Our process, we feel, has been consistent over the past 12 years, unfortunately, that long.'",
        "'speaker_0': 'In that we have reached out to the.'",
        "'speaker_4': 'Community on a regular basis. We spent time with Councilwoman Monteiro and her office and her staff. We've worked with the Lincoln Park Neighborhood Association with regularity at their meetings and ad hoc basis. We've also coordinated with new said the economic development arm over on Santa Fe Drive, as well as the Denver Housing Authority as they've developed the'",
        "'speaker_4': 'Mariposa Housing Complex just to our south. We've attended.'",
        "'speaker_0': 'A number of meetings.'",
        "'speaker_4': 'We've also been through now this our second rezoning, if you will, by virtue of changes in zoning within the city and county of Denver. The first rezoning was to the RMU tow, which allowed us to build a residential the second.'",
        "'speaker_4': 'Now to do this mixed use project.'",
        "'speaker_0': 'There is a future for this, and that is we.'",
        "'speaker_4': 'Intend to consummate this lease with Denver public school system and we tend to move forward with securing financing then for the balance of the project.'",
        "'speaker_1': 'Mr. Comfort, your time is up.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Very much. Appreciate your consideration.'",
        "'speaker_1': 'Thank you. Should we have that built? She said now or just wait until the speakers come?'",
        "'speaker_3': 'I think it doesn't matter either way. She could just state the proper motion.'",
        "'speaker_1': 'Okay. The council, in fact, has noticed something. Good for you for paying such close attention that she mentioned the wrong build number. So we'll just ask you to put the bill on the floor again.'",
        "'speaker_6': 'Thank you, Madam President. I'm going to withdraw my previous motion and move that council bill 155 not 153 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Second, thank you very much, Councilman, and thank you very much for noticing that. Really appreciate you're watching out for those details. Okay. I will go ahead with the public hearing and I will call up Mr. Jeff Perry.'",
        "'speaker_4': 'Thank you, Madam President. Members of the Council. My name is Jeff Barrett. I reside at 2035 South Clarkson Street, Denver, Colorado. I'm the executive director of Emily Griffith Technical College, and I'm also here representing Denver Public Schools. Thank you for the consideration of the rezoning.'",
        "'speaker_4': 'This is a very important project, I think, not just for Denver Public Schools, selfishly speaking for Emily Griffith Technical College and looking for a new home for our Applied Trades Programs, but also for the neighborhood itself, and looking at creating educational opportunities, job training opportunities, as well as community education possibilities and classes that benefit what's going on'",
        "'speaker_4': 'in the Santa Fe Arts District and all the redevelopment that's happening in that neighborhood as well. I'm currently working on several projects with the and some public private partnerships as well that would strengthen, I think, this location and the types of programs that we offer.'",
        "'speaker_4': 'And I would also like to say that we're excited about the close access to the 10th and Osage light rail station, which I think enhances the TOD operation and the renovation that's currently going on with that neighborhood. We've hosted Lincoln Park Neighborhood Association repeatedly on our campus.'",
        "'speaker_4': 'As for their input and some of the design process looked at our classroom schedule, they're very excited about the training opportunities. I'll be offering a scholarship through Emma Griffiths Foundation to benefit people that live and work in that community to attend in the Technical College as well.'",
        "'speaker_4': 'So I'm here to support this and hope that you support it as well. Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Mr. Garrett. And welcome to the Chamber's Bruce Larson.'",
        "'speaker_2': 'Pardon. But it's just like, how do I do that?'",
        "'speaker_4': 'Excuse me. Thank you. Madam President. Council members. Thank you. My name is Bruce Larson. I'm with Larson and Chidi Architects of 3191, South Fillmore in Denver. I think I wrote my business address on there, which is 1900 was E Street.'",
        "'speaker_4': 'I hope that's okay. I want to talk just a bit about the plans, and I'm trying to get the site plan up here. Thank you. I mean, we're very proud to be a part of this project. We looked far and wide to find a building that would that would fit this program.'",
        "'speaker_4': 'It's about 50,000 square feet of trades programs. And we'll talk about those in a moment. But this is the site plan on your screen. Osage is to the bottom and the light rail is immediately to the upper part or to the west in this case.'",
        "'speaker_4': 'But this will, you know, this require a full development redevelopment of this site, new parking, landscaping. We are parking, you know, off the main street, which is nice, kind of tucked around behind the building. But they'll be great access up and down the street for for pedestrians and people coming to it from light rail and bus drop'",
        "'speaker_4': 'offs. These are the two floor plans. It's a 50,000 square foot building, 25,000 square feet on each floor. The first floor is the upper portion of the screen. It contains auto training for auto tech, auto collision, welding. These are obviously some spaces that needed to be on the first floor.'",
        "'speaker_4': 'And then the second floor contains training areas for mechanical repair of mechanical systems, upholstery, CAD, CAD training and water quality training. These are unique programs and this is just a great fit within this neighborhood. We feel in a great transition.'",
        "'speaker_4': 'I know that the neighborhood is in transition, and I think this would be a a great amenity. We're going to try and give this this whole building some new life architecturally. And we want to be, you know, wanted to be we want to be proud of it.'",
        "'speaker_4': 'The make the students proud and the staff and the neighborhood. So this these are some renderings of the completed project. Thank you.'",
        "'speaker_1': 'Thank you very much, Mr.. Larson Scoop.'",
        "'speaker_7': 'Yes, Chairman Sekou. Bless the action movement. My pleasure to be an advocate for poor, working, poor and homeless people. We are excited about the possibilities of this project and it's moments like this that that makes it worthwhile coming down here and participating for the last three years and meeting such as this.'",
        "'speaker_7': 'And so committee meetings, because every now and then you get an energy boost and you get some hope and you get some faith. And somewhere along the lines, somebody is doing something that I had no idea that it was doing.'",
        "'speaker_7': 'And and I get a chance to meet Josh Comfort as perfect name because I'm real comfortable with him and I'm comfortable with his vision of what he's trying to do and also some things that are coming up possibly in the next couple of years that will provide us with an opportunity to actually have some pilot projects, building'",
        "'speaker_7': 'some economic units that poor people can own as they go to school and retool and get ready to come back up because of unintended consequences of an economy that just went crazy and people lost their jobs, didn't make them bad people, they just got caught up.'",
        "'speaker_7': 'And so the great thing about coming here is you can't get this what I'm experiencing right now, what I'm feeling looking at television, you got to actually come down here and meet these people and they get a part of this thing before we get started.'",
        "'speaker_7': 'So I'm encouraging all of our friends and supporters in the movement that we represent to start coming down to the city council meeting, start making the context now for the projects are going to be built in the future so that we can be included in the bottom of the development and begin being a part of the initial'",
        "'speaker_7': 'conversation so that we can actually say that this is our city and it represents everybody. Thank you very much.'",
        "'speaker_1': 'Okay. That ends our speakers. Are there questions from Council Councilwoman Robb?'",
        "'speaker_5': 'Thank you, Madam President. I thought Tim presented a credible case for the zoning, quoting from the plan about schools and neighborhoods. But I do have a couple questions for the gentleman from DPS. Is it Peterson?'",
        "'speaker_1': 'Barrett.'",
        "'speaker_5': 'Barrett. Oh, okay.'",
        "'speaker_1': 'Barrett.'",
        "'speaker_4': 'Pretty good.'",
        "'speaker_5': 'Where is this training that you described, the auto shop and some of the water treatment stuff? Where is that currently occurring?'",
        "'speaker_4': 'Madam President.'",
        "'speaker_1': 'Yes, go right ahead.'",
        "'speaker_4': 'This is occurring at 1250. Well, the street where we've resided for 97 years.'",
        "'speaker_5': 'And then my second question is, it looks like there's going to be a fair amount of investment to retrofit the building, and it looks great. But did I hear them say that DPS is only leasing the property?'",
        "'speaker_4': 'That's correct.'",
        "'speaker_5': 'Is that common in DPS property management? I mean, what would happen if that were to sell? It's just I know it's more of a school board question than a city council question.'",
        "'speaker_4': 'And I'm not as knowledgeable on DPS practice as your question is asking, but we're entering into a long term lease and anticipate it for many, many years at this project.'",
        "'speaker_5': 'Do you know the length of the lease?'",
        "'speaker_4': '20 years. 20 years?'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you very much. Did you have any other questions, Council?'",
        "'speaker_5': 'No.'",
        "'speaker_1': 'Okay. Thank you, Councilwoman Munter.'",
        "'speaker_6': 'Thank you, Madam President. This is for whoever wants to take it. But it was originally zoned RMU 20. And now can you give me the reasoning for wanting to see a mixed five? Buddy. Anybody?'",
        "'speaker_4': 'I probably should have mentioned that that the rezoning the new zone district would allow for vocational education.'",
        "'speaker_6': 'So that.'",
        "'speaker_4': 'Our new 20 does not.'",
        "'speaker_6': 'Yeah. So this year, mix five allows for vocational or professional services?'",
        "'speaker_4': 'That's correct.'",
        "'speaker_6': 'Educational under an educational category. Okay.'",
        "'speaker_1': 'Thank you. Thank you. Councilwoman Monteiro. Councilman Nevitt.'",
        "'speaker_4': 'Thank you, Madam President. There's a question for Mr. Comfort. I just wanted to hear the rest of the story that got us to today. With respect to the financing and other machinations.'",
        "'speaker_1': 'Councilman, you're very good at that.'",
        "'speaker_4': 'I think you've gotten to 2012.'",
        "'speaker_1': 'So you were going to get a chance to finish.'",
        "'speaker_4': 'I was on Kensington, Madam President.'",
        "'speaker_0': 'It's the rest of the story is very brief. Fortunately, the rest of the story is with the lease going into place and the ability to be able to.'",
        "'speaker_4': 'Utilize the cash flow, etc. from that particular building. It puts our developer in a position to be able to secure financing for the development of his initial phase of residential on the North End. Exactly the way they can enter the property that could happen within a period of about three years is what we're anticipating that that list'",
        "'speaker_4': 'could begin and we intend to build that out fully at the time. And we would be living with a mixed use block for the next 20 years. As we mentioned in the terms of the lease.'",
        "'speaker_0': 'The opportunities after that are obviously in the future and we can't speak to.'",
        "'speaker_4': 'That directly, although we do have contingency plans for a second half second phase, if you will, of residential development on the south half of the block as well. Should that become available for redevelopment in the future? Oh, I see.'",
        "'speaker_4': 'This answer is actually a couple of questions all at the same time. So I had the same question that Councilwoman Robb had about DPS. I mean, 20 years seems like a long time. It's not really a very long time.'",
        "'speaker_4': 'So the the owner didn't want to if I understand if I'm reading between the lines, right. The owner didn't want to sell the property permanently to Denver Public Schools. For Emily Griffith, you have potentially future plans for those parcels.'",
        "'speaker_4': 'You're using a building. That building could come down. You can do more on it. But this is an interim plan to help finance phase one of the the residential, at the same time finding a home for Emily Griffith for the next generation.'",
        "'speaker_4': 'Yes, that's very well put. And certainly in the development world, keeping options open for the future. As development, as economics may, change is a fundamental tenant. That's where what we're doing is keeping our options open for the future.'",
        "'speaker_4': 'But we're certainly locked in at this particular program for the next 20 years. Got it. Okay. Thank you. Thank you.'",
        "'speaker_1': 'And also, I would expect in 20 years that the technology for cars will be quite different and that we'll be having driverless cars. And so 20 years is plenty of time to.'",
        "'speaker_4': '20 years from now, you'll be able to have the auto repair on the second floor.'",
        "'speaker_1': 'And yes, because of our jetpacks that we are going to have. Thank you, Councilman Nevett. Councilman Rux.'",
        "'speaker_4': 'Thank you, Madam President. Councilman Nevitt actually took my question. I wanted to bring up Mr. Comfort to expound upon the in since he got cut off. But I use my time to bring up my current constituent, Jeff Baird, executive director for Emily Griffith.'",
        "'speaker_4': 'I have a question for you. Yeah. And, you know, most of my and maybe some of my colleagues in the thousands of viewers at home that are watching don't know the plans for Emily Griffith and the multiple sites that you'll will be breaking up into.'",
        "'speaker_4': 'So two questions. Can you talk about all those sites that she'll be gone all over the city and then to the number of people from this neighborhood who will have access to this this job, these jobs, this job training opportunity.'",
        "'speaker_1': 'And President, go right ahead.'",
        "'speaker_4': 'Thank you, Councilman Brooks. In 1947, Emily Griffith had a high of its enrollment ever of 37,000 students in the city. You put your head around that. And we were scattered across multiple locations across the city in storefronts doing retail training, you name it.'",
        "'speaker_4': 'We were doing training in church basements, etc. We've been occupying our current campus since 1916. We're rapidly approaching our 100 year anniversary, which is very exciting. We've been in the same location. The original building was raised and the oldest part of the structure is 1926, added on a couple of times, 4756 in the Glenarm building as well'",
        "'speaker_4': '. We have occupied this space which is not allowed is for capacity building. It's an aging facility. And so we've been looking for a new home. Well, since I've been there and before I arrived four years ago, we are currently moving into 110,000 square feet of our.'",
        "'speaker_4': 'In answer to your question of our operation to 19th and Lincoln Street, 1860, Lincoln Street, which is now renamed the Emily Griffith campus in honor of her legacy and will house three of our four colleges, as well as Central, Low or central administration and student support.'",
        "'speaker_4': 'We also will be locating 50,000 square feet to 1205 Osage, which is Applied Trades or college of Trades and industry. And we also have a building that we're renovating, a 209th Street, which will have a video production program and our broadcast studios that we have Channel 22 as part of the PEG funding.'",
        "'speaker_4': 'Thank you for that. For the city. And we also have an instructional service center in partnership with the far northeast of which we have talked about in with the academy at airport way. So we're building capacity and expanding our outreach.'",
        "'speaker_4': 'We serve 8000 students, both credit and noncredit, and are looking at ways in which we can build capacity. So that's the rationale behind what we're doing. Thank you so much. Thank you.'",
        "'speaker_1': 'Thank you very much. Okay. I'm going to close the hearing and ask for comments. Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you, Madam President. As we stated earlier, the primary purpose for the zoning to CMCs five is to allow for vocational training under the under the education category. The most amazing thing about how far you've come is all of the different things we've talked about.'",
        "'speaker_6': 'At one point you were talking about a church in the neighborhood, was worried about parking. And so all of those conversations eventually got us to, I think, a better a better use. And I believe that the neighborhood believes that, too.'",
        "'speaker_6': 'So for many of my colleagues, you've heard me talk about 10th and Osage and you've heard me talk about Denver Housing Authority and Lama Lincoln Park and the Mariposa Program, or that public mixed income housing and that particular housing project is actually on a national list with HUD, which is amazing.'",
        "'speaker_6': 'And so the the fabric of this neighborhood just continues to to strengthen because right at 10th and Osage and on a nearby within a quarter mile is the llama, Lincoln Park, the swimming pool, the Mariposa program. Colorado High School is nearby.'",
        "'speaker_6': 'West High School is a little bit further inner city parish and in the Alamo Lincoln Park Recreation Center. So my point is, is that this is right in the middle of this whole vibrant community that's coming together. And the other part is, is that for students that go to Emily Griffin, they decide that they want to jump'",
        "'speaker_6': 'on the light rail and head over to area campus. It's like 10 minutes away. And so this is an amazing use and I think that it's one of the most compatible that we could have at this site. The neighborhood is completely embracing this particular use because of all the the young, aspiring people that we have within the'",
        "'speaker_6': 'community, especially at West High School and and Colorado High School. And the idea of just being able to not go very far, to go to Emily Griffin and possibly that will open more doors for other things is just an amazing possibility in my opinion.'",
        "'speaker_6': 'So I completely, 100% support this application tonight and would encourage my colleagues to do the same. Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilman Monteiro. Okay. Seeing no other comments, Madam Secretary, roll call.'",
        "'speaker_3': 'Monteiro I never I rub by Greg's eye. Brown I thought I can eat lemon. Lopez All right. Madam President. Hi.'",
        "'speaker_1': 'Madam Secretary. Close of voting. Announce the results.'",
        "'speaker_3': 'Tonight.'",
        "'speaker_1': 'Ten eyes sounding passes now. Councilwoman Fox. Will you please put Council Bill 199 on the floor?'"
    ],
    "Rezoning of 12 South Garfield Street in Council District 10.": [
        "'speaker_6': 'Thank you, Madam President. I know the Council Bill 199 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you very much. It has been moved and seconded. The public hearing for Council Bill 199 is open and will open with the staff report.'",
        "'speaker_4': 'Madam President, Councilor David Jaspers with Community Planning and Development with a MAP amendment to change the zoning at 12 South Garfield Street. This is in Council District Number ten in the Cherry Creek neighborhood in specific Cherry Creek East.'",
        "'speaker_4': 'If we zoom into the lot here, it's a vacant lot on the southeast corner of Ellsworth Avenue and Garfield Street. First Avenue, just a block to the north called Rado Boulevard is just a few blocks to the east of this location.'",
        "'speaker_4': 'Here's a quick snapshot looking towards the southeast on the lot. It is just over 12,000 square feet in size. No structures on it, of course. The property owner, Mag Builders, Representatives Mike and Kim Molnar are here tonight and we're looking to rezone this lot from the existing pretty number 583 to grh3 as the general urban neighborhood context'",
        "'speaker_4': 'row house with three stories as the maximum height. The existing PD 583 was approved back in 2005. Very specific PWD either allowed a four unit rowhouse, essentially one structure, four units. The G RH three would allow two duplexes.'",
        "'speaker_4': 'Still four units. Just two structures. It's surrounded by pods. There is g, rh three in the neighborhood as well as being adjacent to the southeast. It is generally rowhouses and townhouses all around this property. The nearest single family is on the block on the Jacksons street facing.'",
        "'speaker_4': 'There's a on the row house and surrounding it. I have a few visuals here to give you an idea of the scale and context generally 2 to 3 stories in the heights, looking to the northwest and south. And this is just across the alley to the east on the Jackson Street side of the block.'",
        "'speaker_4': 'Planning board unanimously approved this in March. Went from bloody off in March. And we're here tonight for the public hearing typical public outreach process. The Cherry Creek East Association did provide a letter of support, as well as an adjacent property owner, sending an email letter of support for approving this rezoning.'",
        "'speaker_4': 'We looked at the review criteria and focused on the consistency of adopted plans. There's multiple strategies in the plan that show this is consistent with a composite plan. 2000 Blueprint Denver. The land use concept is urban residential. It is an area of stability, but it is a vacant lot.'",
        "'speaker_4': 'The streets are designated as local streets, which are appropriate for residential uses. More recently, the Cherry Creek Area Plan gives us a little more detail in the Cherry Creek East section of that plan. There's a three story building height maximum.'",
        "'speaker_4': 'It has a specific recommendation to rezone old pods when possible and to respect the existing scale. The neighborhood, the G RH three would do all three of those recommendations. So we do find consistency with adopted plans. As I mentioned, there is a grade three in the neighborhood with similar building forms, so there is uniformity of district regulations'",
        "'speaker_4': '. Filling in the vacant lot helps further public health, safety and welfare. Improving the walkability neighborhood. The changing, changing conditions. There's a adopted plan that does recommend redevelopment of the area, and it is consistent with neighborhood context. The zone district purpose intent of the zoning code.'",
        "'speaker_4': 'With that, CPD does recommend approval based on meeting all the review criteria.'",
        "'speaker_1': 'Thank you, Mr. Jaspers. Appreciate that. I'm going to call up Michael Moylan. Do we do that on purpose?'",
        "'speaker_4': 'Good evening, Madam President and Council. I am the representative mag of the property and mag builders. I'm here to answer any questions you may have.'",
        "'speaker_1': 'Okay. Thank you very much, Mr. Moyle. Sorry it gave you such a shock. SACU.'",
        "'speaker_7': 'Yeah. Germans say Ku Klux Klan movement. Advocate for working poor and homeless people. We support the zoning change for a couple of reasons. Although not required by law. When these units are made available and because they're under that ceiling of 29 where they have to include affordable housing, we decided that that is not acceptable and that at'",
        "'speaker_7': 'every turn we, the poor or the homeless, must come together and enroll folks into this process. But even if it's three units. How about consider us have one? Because one more or less makes us one more greater of a city.'",
        "'speaker_7': 'And so we don't want you to be limited by the law, but to speak about a more moral authority of how we have to reach out and help those that got caught up and need to help. Help. And so as we go through this process, we would like to encourage you to consider the opportunities that may be'",
        "'speaker_7': 'available for you to assist in this process so that we can lighten up the load, take a lot of politics out of this deal, and just go on and do the right thing for the right reason, because this really ain't all this and we can make this happen.'",
        "'speaker_7': 'But we've got to start working from the bottom up because I'm not a leader, I'm just a shipbuilder. And we got holes in this boat and this boat is sinking and we're all on it together. And only when we come together can we rebuild a boat.'",
        "'speaker_7': 'A ship where we can put a leader in front of this thing and hopefully we can sail on home with it. And then the true idea of what home is can maybe come to fruition, because maybe that's a place where just a lot of love overflowing.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_1': 'Okay. Thank you, Mr. Sekou. Questions from counsel. Do I have any questions? And seeing none. I know there's one councilman. Never.'",
        "'speaker_4': 'Thank you. I just had a question that may be on everybody's mind is how did you manage to find a vacant lot in Cherry Creek? I mean, are there more than one, really? Okay.'",
        "'speaker_1': 'Did you did you want that answer to that?'",
        "'speaker_4': 'A rhetorical councilwoman Robb is nodding. There is more.'",
        "'speaker_5': 'Answer in comment.'",
        "'speaker_1': 'All right. Go right ahead.'",
        "'speaker_5': 'Oh, well, I was going to wait to my comments, but yes, there are vacant lots, some some of them old pads that haven't been developed. I'm sure there's probably an opportunity there for you, Councilman Nevett. And amazingly, the district with the boom that we've seen in higher buildings, in the commercial buildings, there are a number of new'",
        "'speaker_5': 'row and single family houses going up. If you drive around over there, sort of surprises me. Wow.'",
        "'speaker_1': 'Okay. With that, close the public hearing and ask for comments. Councilwoman Robb.'",
        "'speaker_5': 'Well, you are quick. I didn't even click in yet.'",
        "'speaker_1': 'I knew I.'",
        "'speaker_5': 'Was. Well, I will be supporting this tonight as the letters in the packet indicate. This has been vetted with the neighborhood. There were concerns about drainage and landscaping in meg builders worked with the neighborhood on this. And then my my side note is as many of my colleagues know, they're in Cherry Creek East, which is just east'",
        "'speaker_5': 'of the mall rather than north of the ball. There are a number of puddles because a previous plan had a long list of design guidelines. In fact, a separate document was created, but they were never really passed by planning board.'",
        "'speaker_5': 'So the neighborhood advocated for Pwds to make sure that design guidelines were met. Those design guidelines are still really important to the neighborhood, but as you can see, you have a project here going from four units to four units and you can see the awkwardness of a pad that is so specific it tells how the units are'",
        "'speaker_5': 'to be attached. So in this case, it's good news. They were able to move into 2014 zoning based on our 2010 new zoning code and I'm will be supporting it.'",
        "'speaker_1': 'Thank you, Councilman Robb and I don't see any other comment. So, Madam Secretary, roll call.'",
        "'speaker_3': 'Rob. Hi. Brooks Hi. Brown Hi. But I can eat lemon. Lopez All right. Monteiro Nevett, I. Madam President, hi.'",
        "'speaker_1': 'And Secretary close voting, not the results tonight. Ten Eyes. The zoning is passed. On Monday, May 12th, Council will hold a required public hearing on Council Bill 365, naming the city on building. Located at 2855 Tremont Place, the Elba M Wedgeworth Municipal Building on June 2nd, 2014.'",
        "'speaker_1': 'Council will hold a required public hearing on Council Bill 304, changing the zoning classification of 2000 East 28th Avenue and a required public hearing on Council Bill 305. Changing the Zoning Classification for 3600 East Alameda Avenue 319 South Garfield Street, 301 South Garfield Street and 314 South Monroe Street.'",
        "'speaker_1': 'Any protests against Council Bill three or four are Council Bill 305 must be filed with the Council offices no later than noon on Tuesday, May 27th, 2014. Seeing no other business for this body. This meeting is adjourned to tomorrow.'",
        "'speaker_1': 'Denver 82 New York City.'",
        "'speaker_0': 'Your source Denver eight on TV and online to stay connected to your community. Your city. Your source.'"
    ]
}