{
    "Amendments to the Airport System Supplemental Bond Ordinance.": [
        "'speaker_3': 'It has been moved. We just need a second has been moved in second and comments from members of council Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Mr. President. These are all ordinances relating to a series of bonds, a DEA that are being restructured and much like Groundhog Day. This is the same issue again. We have already had two of these ordinances go through and these six are stretching out the debt another six years.'",
        "'speaker_5': 'So essentially, we can give a package of rewards to United Airlines for 35 million and the other airlines all sharing in 10 million. I didn't like it before. I don't like it tonight.'",
        "'speaker_3': 'Thank you, counsel, in advance. Any other comments or questions from members of counsel's? Well, that same number voted on 95 to 9090 in a block. Madam Secretary. Roll call.'",
        "'speaker_2': 'But no. Can each layman I.'",
        "'speaker_4': 'Monteiro Nevitt.'",
        "'speaker_2': 'Pi.'",
        "'speaker_4': 'Ortega. I Rob Sheppard. I Susman. Brooks Brown. Mr. President.'",
        "'speaker_3': 'Hi, Madam Secretary. Please close the vote. And now the results.'",
        "'speaker_4': '11 Eyes one Name.'",
        "'speaker_3': 'Webinars 1819 985 through 990 have been published in a block. Madam Secretary, can you take up the next one, which should be 1057? Councilman Fox, what would you like for us to do with this?'"
    ],
    "Supplemental Appropriation for Liability Claims Special Revenue Fund.": [
        "'speaker_5': 'Please put it on the floor for a vote.'",
        "'speaker_3': 'Certainly. Uh, Councilwoman Sussman, could you please put 1057 to be ordered published?'",
        "'speaker_2': 'Yes, I move that council bill 1057 be published.'",
        "'speaker_3': 'It has been moved and seconded. Comments from members of Council Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Mr. President. This is an ordinance that moves $6 million from the contingency fund to the settlement fund. And of course, it is in in advance of what will happen next week with a resolution to pay a settlement.'",
        "'speaker_5': 'And it is a settlement to all. Concerning the Marvin Booker case, a few weeks ago, I supported a measure for the city to assume responsibility for punitive damages. In this case, the purpose, as it was explained to me, was to give the city standing and to contest the size of the punitive damages.'",
        "'speaker_5': 'I agreed with that rationale. The city filed a post-trial motion to reduce punitive damages, but that has not yet been acted on by the courts. Instead, the city is planning to settle for the full amount of punitive damages.'",
        "'speaker_5': 'That means that of the other 4.65 million awarded by the jury to the plaintiffs, the state 150,000 of which is company compensatory damages and 4.5 million punitive. Now, that's a 1 to 30 ratio. To me that is not proportional and case law supports requiring proportionality.'",
        "'speaker_5': 'Since this is taxpayer money, I'd prefer to have the amount of punitive damages legally determined so we can have certainty entering into a settlement at this time. While understandable in this emotionally charged local and national climate, gives no legal guidance to this issue of proportionality.'",
        "'speaker_5': 'That's a reason I'll be voting against transferring $6 million, which does include the attorney fees this week and against the actual settlement agreement next week.'",
        "'speaker_3': 'Thank you, councilman. Thoughts, councilwoman, can each.'",
        "'speaker_2': 'Thank you, Mr. President. I don't want to go into too much detail, but I thought it was important since we have a vote and a colleague calling this out to just make a quick comment. As chair of finance, I was asked to approve this bill for filing.'",
        "'speaker_2': 'And my reason for doing so was because of the importance, I believe, for closure. We have a family who lost a loved one who certainly must be ready for closure. And we also, as a city, need to have closure on the past so that we can focus on the very real, very important work we have going forward'",
        "'speaker_2': '. I happen to not just be a council person, but I'm also an attorney. And in both of the oath I took, I have respect for the jury system and we have a jury verdict and we have a very agreed upon settlement regarding attorney's fees tonight.'",
        "'speaker_2': 'And I think that it is time for us to focus on closure of this chapter so that we can do the really, really hard work that we have yet to do. That is where my focus will be. That is where the focus I want of our city attorney's office to be of our sheriff's department and all the'",
        "'speaker_2': 'leaders of this city. And I believe that closing this chapter allows us to put that focus going forward. So for that reason, in spite of the difficulty of this situation, I do hope that all my colleagues will be supporting this financial decision to move these funds so that we can then proceed, as my colleague described, with the'",
        "'speaker_2': 'legal decisions next. Thank you very much, Mr. President.'",
        "'speaker_3': 'Thank you, Councilwoman Kennedy. Councilwoman Ortega.'",
        "'speaker_9': 'My vote on this will be consistent with when we have previously discussed this issue. As I shared, my daughter works for the Denver Sheriff's Department. She was not directly involved in this particular incident, but I feel that it's important to abstain from the vote.'",
        "'speaker_9': 'So I just wanted to indicate that. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Ortega. Are there any comments on 1057? CNN Madam Secretary. Roll call.'",
        "'speaker_2': 'Fights. No carnage.'",
        "'speaker_4': 'Layman Guy Monteiro Nevett I. Ortega.'",
        "'speaker_7': 'Abstain.'",
        "'speaker_4': 'Rob Sheppard. Susman. Brooks. I. Brown. BROWN. Mr. President.'",
        "'speaker_3': 'I. Madam Secretary, please positively announce the results tonight.'",
        "'speaker_4': 'One nay, one abstention.'",
        "'speaker_3': 'And I's one nay, one abstention. 1057 has been ordered published. Madam Secretary can remember the last bill for introduction, which I believe was 975. Councilwoman Fox, what would you like for us to do with this?'"
    ],
    "Ordinance Amendment for Better Denver Bond Project Funding Reallocations.": [
        "'speaker_5': 'Please put on the floor for a vote.'",
        "'speaker_3': 'Certainly can. And Councilwoman Sassaman, would you please have 975 ordered published?'",
        "'speaker_2': 'Yes, I move that council bill nine 7975 be ordered published.'",
        "'speaker_3': 'Been moved in second hand comments from members of Council Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Mr. President. Once again, I feel as if I'm in Groundhog Day. This is an issue that concerns a bond proposal that people voted on. I mean, you had voter approval to build new construction for the better whole.'",
        "'speaker_5': 'And when that did not come about, because the symphony could not come up with the 30 million they had pledged, it was not that I thought we should go ahead and build it. It was that I felt that if we made any changes, we should be asking the voters for approval.'",
        "'speaker_5': 'They approved a specific amount for a specific purpose, and at that point it was not feasible to go ahead with that specific amount or specific purpose. So some time ago we made some adjustments and the committee got together and they decided a bunch of new things to spend the money on.'",
        "'speaker_5': 'And indeed that passed by ordinance. But the vote but the voters were shut out of that process. We never went back to the voters. Okay. So there was still some money set aside for year that you're still isn't ready to be remodeled.'",
        "'speaker_5': 'But there is a rule that if you have if you've gone to the bond market and you have money in hand, that you need to spend it within three years. So guess what? Once again, we're we're putting up new projects on this so we can spend that money.'",
        "'speaker_5': 'I understand where they're coming from. They're in a bind. But it could have been solved, I believe, by going back to the voters and asking for a whole new type of project or simply not letting the bonds all together.'",
        "'speaker_5': 'So I will be voting against this most recent reordering of the bonds, noting that the taxpayers still aren't getting what they have approved.'",
        "'speaker_3': 'Thank you. Councilwoman fights Catwoman Ortega.'",
        "'speaker_9': 'I'd like to ask someone from city staff that is has been working on this if they could please come forward. I see Kent Rice coming forward. Kent, can you explain what this. This is the remaining money that was left from that year that was not transferred to other projects.'",
        "'speaker_9': 'What is it being proposed to be used for?'",
        "'speaker_10': 'Thanks for the question and I'll just affirm the history that Councilman Fox gave. The bulk of the money was redistributed at the beginning of 13. So now we're approaching the end of 14. There are $16.8 million remaining of the original 57 million.'",
        "'speaker_10': 'Some of the 60 million was spent on interim projects to support Bettcher. What we are proposing in conjunction with the Budget Office is to reserve $16.8 million for whatever is decided to be done with. BACHIR When our new executive leadership team makes that decision, which is probably going to be about a year.'",
        "'speaker_10': 'In the meantime, the $16.8 million will be used for two purposes either new construction or maintenance. And those were the two purposes that were outlined in the original bond initiative. And more than half of the money will be spent at the performing arts complex.'",
        "'speaker_10': 'Some of the money will be spent at Red Rocks, and a small amount of it will be spent at McNichols. So we are tackling projects at city owned venues that are in the portfolio of arts and venues management.'",
        "'speaker_10': 'All of these projects would likely be done in the next couple of years anyway. So we're using the bond money as defined legally that it can be used for projects that were on the list. What we're doing is refilling our capital fund account, which was another that was item nine, seven six on the docket tonight with the'",
        "'speaker_10': 'excess money that we have at the end of each year. So that's a I hope not to circular description, but essentially the 16.8 will be spent on new projects and maintenance projects in city owned venues that our agency manages, manages.'",
        "'speaker_10': 'And when we're ready to spend money for better or the arts complex, when the team is looking at that makes a decision, we'll have $16.8 million ready for that purpose.'",
        "'speaker_9': 'So can you tell me how much it's costing to go through that review process of the whole performing arts complex, including Becker Hall?'",
        "'speaker_10': 'I can't because we don't know yet, but we're issuing an RFP or an RFQ, so requests for qualifications, a request for proposal before the end of the year will have to engage a planning firm. And that's in the same way that the NDDC has engaged an outside planning firm to design what is going to happen up there'",
        "'speaker_10': '. So I'm guessing.'",
        "'speaker_9': 'We have a certain amount of money set aside to go through that process.'",
        "'speaker_10': 'We have money set aside for it. I just don't know what the exact amount will be. I'm guessing it's between 100 and 200,000, but until the bids come in, we don't know.'",
        "'speaker_9': 'Okay. And that will not be that will not come out of any of these funds. The bond funds.'",
        "'speaker_10': 'That I had to look to my advisor here know, clarify that they won't.'",
        "'speaker_9': 'Okay. Will any of it be used on 1247 Tampa?'",
        "'speaker_10': 'None of it is slated for 1245 Tampa.'",
        "'speaker_9': 'Oh 45 okay. I think that's all the questions I have.'",
        "'speaker_3': 'Thank you. Can't get you into town, if I may say, introduce yourself.'",
        "'speaker_10': 'For the record, I apologize. I did not write the executive director for Arts and Venues and we manage the city owned venues here that I've been describing. Sorry for that.'",
        "'speaker_3': 'Thank you. Thank you. Councilwoman Ortega. Councilwoman Robb.'",
        "'speaker_8': 'Thank you, Mr. President. While I do appreciate the direction that Councilwoman Potts is coming from, it goes all the way back to the original 60 some million that was reallocated possibly early in this term. If I'm remembering the numbers, right.'",
        "'speaker_8': 'And at that time, the choice that the administration, a committee they set up and ultimately council made was to reallocate those funds. The other alternative, which I gave serious consideration to, was simply to allow that amount of money to go into future bonding capacity.'",
        "'speaker_8': 'And so at some point in the future, a mini bond or citywide bond. And I don't mean mini bond by small bonds, but a small bond list might have come forward. And I gave serious thought to that now.'",
        "'speaker_8': 'Or it could have just waited until the city had even more bonding capacity. And we could go back to the voters for a whole new list of projects. As Councilwoman Potts knows, it will be some time till we have significant bonding capacity in the city.'",
        "'speaker_8': 'Because of the length of the last bonds. I felt that people wouldn't get a chance to look at that amount right away. And if you put it towards one project and by the way, at the time I did have a pet project I was looking at which has since been funded in other ways.'",
        "'speaker_8': 'It would have been. Hard to get a citywide vote on one project because we always look, you know, how best can we serve the whole city, not one council district or one area? So ultimately, I decided that, yes, we should change the funds and impact cents in not only with better, but also probably you would say with'",
        "'speaker_8': 'the McNichols building where some of the funds were allocated with the Museum of Nature and Science, we have made different choices. So I think under the circumstances, we are doing the best with the situation that we did not anticipate happening in the first.'",
        "'speaker_8': 'In the first place. It's not a choice that we love making, but to the point of the voters. I'm wondering, Sean, if you or possibly David Broadwell, I don't know who the right person is, could talk about the requirements for changing projects in our bond ordinance when we pass it issuing new bonds.'",
        "'speaker_0': 'Sean Raab better never bond program. The Councilwoman is quite right as a backdrop, though, that the bond program is brought forward on ten separate occasions. Companion Ordinance Changes Projects Have the Council set up a 10% rule before they started the bond program, such that if a budget was reduced by 10% or was increased by 10%, then it'",
        "'speaker_0': 'was brought forward to this to this council for a vote. So that is the that is as projects get added and deleted. Similarly, we also bring those forward for council consideration.'",
        "'speaker_8': 'And then my point is we also cannot change the funds from category to category. If it's in a cultural area, it remains there. If it's in a parks area, remains there.'",
        "'speaker_0': 'Yes, well stated, Councilwoman. Indeed, there are the purpose there. Eight purposes within the bond program. We have looked at the the the the elegant solution that has been described tonight by Mr. Rice. And we have vetted the projects and they do conform with purpose to an eight and what we're trying to achieve with those.'",
        "'speaker_0': 'We've run those through bond counsel and they have agreed with them as well. So we think we're on good stead there.'",
        "'speaker_8': 'So whether it's technically or whether we're dealing in a matter of perception, what we're saying is very legally and in the way bond issues are laid out, we are within the voter intent.'",
        "'speaker_0': 'That is a true statement.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_9': 'I just wanted to ask, what is the deadline by which these dollars have to be expended?'",
        "'speaker_10': 'It's three years from the date of issuance and the majority of the bonds were issued in the fall of 13 and a smaller portion in the fall of Sort 14, which means all of it has to be expended no later than the fall of 17.'",
        "'speaker_10': 'But the challenge we've had is that the majority of the money has to be spent by the fall of 2016. So two years from now. Okay. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Ortega. You know the comments or questions on nine, seven, five seen on Madam Secretary.'",
        "'speaker_2': 'Roll call at no carnage. Layman Lopez.'",
        "'speaker_4': 'Montero.'",
        "'speaker_7': 'I.'",
        "'speaker_4': 'Nevitt Ortega I. Rob Shepherd I. Susman Brooks Brown.'",
        "'speaker_0': 'II.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Councilmembers Montero and Ortega. Your votes. Thank you, Madam Secretary, please. First of all, you announce the results.'",
        "'speaker_4': '11 eyes one day.'",
        "'speaker_3': '11 eyes one day. 975 has been ordered published. That should have been all the bills for intro. We have one bill for final consideration. 847. Councilwoman Monteiro, what would you like for us to do this?'",
        "'speaker_7': 'Thank you, Mr. President. I would like to call it out for comment.'",
        "'speaker_3': 'A comment. Go right ahead.'"
    ],
    "Property Acquisition for Federal Boulevard Reconstruction Project.": [
        "'speaker_7': 'Council Bill 847 is bill for an ordinance designating certain properties as being required for public use and authorizing use in acquisition through negotiations related to the properties needed for the Federal Boulevard Reconstruction Project. And it's between West Seventh Avenue and West Holden.'",
        "'speaker_7': 'And I just wanted to pull this out because I understand that this Federal Boulevard Reconstruction Reconstruction Project has been in discussion for about 20 years. Yet it was important to me that those properties most impacted by this project were informed.'",
        "'speaker_7': 'So I asked the City Attorney's Office and Public Works to go back and contact the property owners again, to give them ample information about the project so that the property owners could know what to expect and what would happen in the next couple of years.'",
        "'speaker_7': 'General public meetings and notifications were done. But again, I said that extra steps, extra steps be taken to include outreach directly to the properties in my district to make sure that people were aware of the project and its potential impacts, and also to engage them in offering comments about the environmental assessment that was being done.'",
        "'speaker_7': 'It was important to me that this happened. And so my aide, Amanda Sandoval, contacted the potential 11 partial takes in eight full takes and talked with them directly to see that they were informed. Public works also did any necessary follow up.'",
        "'speaker_7': 'And now I feel that we've done all of the communication that we can since the city attorney's office even came back to committee after I asked for it to be held and on television was able to talk to people about their rights as property owners at this stage.'",
        "'speaker_7': 'And so property owners will get a letter of intent in early 2015 that will begin the negotiations with them. One of the concerns that was also heard in the neighborhood was the condition of the federal crossing at Holden Place.'",
        "'speaker_7': 'And we now have a commitment from public works to have the Holden Place intersection included in the final design construction of the project. The project will now include replacing the existing asphalt at Federal in Holden with concrete paving, including the addition of colored crosswalks.'",
        "'speaker_7': 'The other thing that's important in terms of the business owners and property owners in Sun Valley is that the environmental assessment process is also a part of this picture. The comment period was recently closed for Federal Boulevard and the comments have been submitted.'",
        "'speaker_7': 'I want to thank Denver Public Works for putting it on their website and also for the Federal Boulevard Partnership, the Sun Valley Community Coalition, which commented about the need for more landscaping and increased pedestrian safety, and also earthlings who requested an audible pedestrian crossing signal which public works has already committed to have at Holden Place.'",
        "'speaker_7': 'And so I will be supporting this bill. Mr. President. Thank you.'",
        "'speaker_3': 'Thank you. Councilor Monteiro. In the other comments on 847. Seeing none, those were all the bills that were called out. So we are now ready for the Bloc votes. All of the bills are introductions are ordered published. Councilwoman Sussman, would you please put the resolutions on the floor for adoption in a block?'"
    ],
    "Adoption of the Globeville Neighborhood Plan.": [
        "'speaker_3': 'Yes. Council is reconvened. We have one cursory public hearing this evening. Speaker should begin the remarks by telling council their names and cities of residence and if they feel comfortable doing so, their home addresses. If you're here to answer questions only when your name is called, come to the podium, state your name and know that you are'",
        "'speaker_3': 'available for questions of council. Each speaker will have 3 minutes. There will be no yielding time on the presentation monitor on the wall. When the yellow light comes on, you will have 30 seconds to conclude your remarks. And when the red light appears, your time is up.'",
        "'speaker_3': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Speakers are prohibited from using profanity or making personal attacks during their comments. Audience members Please understand that council members do use electronic devices of various kinds to access the materials relevant to the public hearings before us.'",
        "'speaker_3': 'Be assured, however, that by mutual agreement and common practice of the City Council, these devices are not being used for texting, emailing or other communications during the public hearings. All right, Councilwoman Session, will you please put Council Bill 971 on the floor?'",
        "'speaker_2': 'Mr. President, I move that council bill 971 be placed upon final consideration and do pass.'",
        "'speaker_3': 'Waiting for technology to catch up. It has been moved. It has been moved. And second, in the public hearing for council bill 971 is now open. May we have the staff report?'",
        "'speaker_12': 'Good evening, members of Council. My name's Courtland Heiser with Denver Community Planning and Development. And for the past more than two years, I've been project manager on the Globeville Neighborhood Plan. Pleased to present for you tonight a final draft of the plan for your consideration for adoption.'",
        "'speaker_12': 'Just by way of background. The Globeville neighborhood is located in North Denver, shown here in these maps along the western banks of the South Platte River. And a couple of the most famous landmarks within the neighborhood are I-25 and I-70, both of which intersect at the mousetrap.'",
        "'speaker_12': 'Right in the right, in the center of Globeville.'",
        "'speaker_0': 'She's.'",
        "'speaker_12': 'Globeville is also one of the neighborhoods within the North Denver Cornerstone Collaborative Focus and Study Area. And in fact, the Globeville Neighborhood Plan is one of the six identified projects within the North Denver Cornerstone Collaborative. If adopted tonight, it would be one of the first projects to reach the milestone of reaching an adoption and completion.'",
        "'speaker_12': 'Planning efforts are ongoing within the NDC study area, not just for Globeville, but for also the Elyria Swansea neighborhood across the South Platte River to the east and the National Western Center, directly across the river from Globeville. This timeline shows how the three planning efforts are nested together.'",
        "'speaker_12': 'So tonight, on December 1st, we're at City Council for a public hearing on Globeville. Meanwhile, just last week, Elyria, Swansea released their first public review draft of that planning effort. You'll be seeing that on the. It's currently on track to go to City Council on February 9th.'",
        "'speaker_12': 'National Western Center will be releasing their first public review draft of their planning document later this month, and then that's on a track to be in front of council on March 9th. So this is the first of three coordinated, interrelated planning efforts, all covering the the North Denver Cornerstone Collaborative Focus area in North Denver.'",
        "'speaker_12': 'We'll talk now for the rest of the presentation about Globeville specifically. That's the item that's before you tonight. Our public process is summarized in this slide. First and foremost, our steering committee was comprised of a group of very diligent, hard working community members that met roughly every month.'",
        "'speaker_12': 'We missed a few months here or there. If there was a public meeting, perhaps we may not meet that month, but more or less. For the past couple of years, this group has been getting together once a month and sometimes more than once a month and met three or four times.'",
        "'speaker_12': 'In October of this year. In addition to that, we met jointly as needed with the Elyria Swansea Neighborhoods Plan Steering Committee at several key points throughout our planning process. Then there were general public meetings held throughout the planning process, typically every three or four months and seven of those in total.'",
        "'speaker_12': 'And in addition to that, we had targeted outreach to specific stakeholder groups to ensure their participation in the process, including the Spanish speaking community, youth industrial stakeholders. We attended festivals and special events throughout the planning process and coordinated with National Western Center, the DCC and others on tours and other projects and special events.'",
        "'speaker_12': 'In addition to that, there were a few special efforts associated with this planning process that were unique to it. Community Asset Mapping and Oral History Project were two very important efforts that were spearheaded by Councilwoman Monteiro and her office as a component and during our planning process, as well as a health impact assessment, which was conducted by'",
        "'speaker_12': 'Denver Environmental Health and which resulted in a detailed health assessment of Globeville, Elyria and Swansea. And the recommendations from that document were integrated with the draft plan before you. So the Globeville Neighborhood Plan is a product of a more than two year planning process.'",
        "'speaker_12': 'It is built on community input and has been coordinated with concurrent planning efforts. Associate with NBCC, the Elyria and Swansea Neighborhoods Plan and the National Western Center Master Plan in particular. This is a graphic from the first few pages of the plan.'",
        "'speaker_12': 'Sometimes we refer to this as a plan on a page. It's really sort of a graphical table of contents that shows you what is in the plan document. So up top, the vision for Globeville that it's a unique, strong, connected and healthy neighborhood.'",
        "'speaker_12': 'Those were guiding principles that emerged from our public outreach early on in the process. Those principles were identified as being core to the identity of what Globeville is and what it wants to be. They became an organizing element for the plan, and so the first four chapters of the document are related specifically to those guiding principles unique'",
        "'speaker_12': ', strong, connected and healthy. In addition to that, the plan identifies character areas within the neighborhood. There are four of them the residential neighborhood core Washington Street and the Globeville Riverfront, the 41st and Fox station area. And the industrial edges within the neighborhood and within those character areas are one or more catalytic projects, transformative projects that the plan'",
        "'speaker_12': 'goes into some level of detail on with each, and which we'll be summarizing tonight towards the end of the presentation. So first up, we want to talk about each of the guiding principles. A unique Globeville is the first one.'",
        "'speaker_12': 'And these are three recommendations within the unique chapter. Embedded within each of the three are strategies which we won't get into that level of detail tonight. We'll just keep it at the higher level of recommendations. But each of the recommendations has associated strategies that get to the specific particulars of implementing and achieving the intent of the recommendation'",
        "'speaker_12': '. So for a unique Globeville, we have to showcase the history of Globeville to embrace the neighborhood's unique physical attributes, which include some of the things that are considered to be barriers like the I-70 sound wall, for example, or embankments.'",
        "'speaker_12': 'The plan has strategies for celebrating these features and turning them into community assets, and the third one is to reinforce and enhance. Globeville is a unique sense of place. Under the category of strong. Strong is really a collection of many ideas.'",
        "'speaker_12': 'First off, having a land use plan for the neighborhood that balances the needs of all the users within the neighborhood residents, commerce and industry so that they can coexist within the neighborhood. Effectively, managing storm drainage and water quality within the neighborhood is another concept within strong, as well as having an integrated, complete and diverse park system within'",
        "'speaker_12': 'the neighborhood and improving access to jobs, housing, neighborhood services and education. This is the concept land use map that's contained within the strong chapter. And I'll just take a minute now to sort of walk through the general land use strategy that's outlined in the plan.'",
        "'speaker_12': 'So first off, in yellow here in the middle of the neighborhood, this is the residential core of Globeville. It has the the highest concentration of residential uses today. And when people think of the Globeville neighborhood, this is generally the area that comes to mind for most people that is recommended to remain single family.'",
        "'speaker_12': 'But we do have, in addition to that, a recommendation to adjust the zoning as necessary to allow for the implementation of accessory dwelling units. This was an affordable housing strategy that emerged from our conversation with the neighborhood in that there was a lot of support for.'",
        "'speaker_12': 'So the zoning in Globeville today does not allow accessory dwelling units, but the plans direction is that that would be appropriate adjacent to the yellow here on the map you see the darker blue areas and these are recommended for industrial mixed use.'",
        "'speaker_12': 'And the plan strategy is to use industrial mixed use as sort of a buffer between residential and heavier industry. Today, there are many instances where industry is adjacent to across the street from or across an alley from a single family home.'",
        "'speaker_12': 'The strategy here is to introduce industrial mixed use to help provide a better transition between industrial and residential. The lighter blue areas are industrial today and are proposed to remain industrial in the future. And over here in the Forty-firsts and Fox station area, the plans recommendations are really fully consistent with the station area plan that was adopted'",
        "'speaker_12': 'in 2009 for 41st and Fox. So just reinforcing the land use recommendations and really all of the content from that plan is reflected and consistent with the Globeville neighborhood plan. Then here along the Washington corridor into the riverfront.'",
        "'speaker_12': 'The land use recommendation is to transition to mixed use development, and we'll be providing more details as to the rationale for that throughout the presentation. So by the end of the presentation, it should be fairly clear what the opportunities are specific to that transition to mixed use development in that area.'",
        "'speaker_12': 'Yeah. I'm sorry. The formatting looks like it got a little messed up here, but on the connected, global is the next guiding principle, and that is to update the key transportation policies affecting Globeville, such as the Strategic Transportation Plan and Blueprint.'",
        "'speaker_12': 'Denver and Denver moves consistent with the recommendations of this plan. The second one is a connected street network within the neighborhood to have a walkable and bikeable Globeville, as well as one that is well-served by transit and to address traffic operations and roadway maintenance issues that are prevalent within the neighborhood today.'",
        "'speaker_12': 'This graphic shows the proposed Street Network as recommended in the plan. There were just a couple of things that I wanted to highlight here. The first is these dashed arrows here heading across the river. Those indicate potential and recommended multi-modal connections from Globeville into the National Western Center and into the Elyria neighborhood.'",
        "'speaker_12': 'These are two recommendations that arose out of our planning process, where we coordinated very closely with NBCC and the National Western, so that this is an integrated concept that you'll see appearing in all three of these major planning efforts.'",
        "'speaker_12': 'It's in the Globeville plan, it's in the Elyria Swansea Neighborhoods plan, and it's also integrated in the National Western Center Draft Master Plan. The idea of having a strong connection from Globeville and Washington across the South Platte River and into the National Western Center, we believe presents a catalytic opportunity to encourage reinvestment along the Globeville waterfront associated'",
        "'speaker_12': 'with that recommendation within this hatched area. The plan is recommending enhancing the connectivity within that area. Currently, the streets today, they go from Washington, they approach the river, and most of them end in cul de sacs or don't really connect to other streets.'",
        "'speaker_12': 'So North-South connectivity and connectivity along the river are two things that would be needed to realize this vision of having a mixed use waterfront across the river from a revitalized National Western Center. The third thing that I wanted to call out in this map are these connections here to the west, which would go through some of the'",
        "'speaker_12': 'large assembled parcels here. The currently the streets don't connect through here and these circles denotes potential ped bike only connections that would allow people who live in Globeville to have much greater accessibility to Washington Street and then future transit at the National Western Center.'",
        "'speaker_12': 'And we have a few renderings highlighting some of the specific street and infrastructure improvements that are recommended in the plan. This is what Lincoln looks like today as it heads under I-70. For folks that live north of I-70, this is the route that their children take to the elementary school every day.'",
        "'speaker_12': 'There have been some recent enhancements with the murals that you see there. If we take that to the next level with some relatively modest, relatively affordable improvements, you can see how the current underpass could be greatly enhanced into a community amenity building upon the foundation that's already been set by emphasizing public art and murals, improving the lighting'",
        "'speaker_12': 'under the underpass, cutting back the sloped walls, or what engineers refer to as wing walls that currently extend here and narrow the sidewalk. You could cut those back. It doesn't affect the structural integrity of the bridge and you can widen the pedestrian area.'",
        "'speaker_12': 'Similarly at 48th AV under IE 25, we have another overpass that could be enhanced. Our concept here is a little more modest, not relying so much on public art, but very similar in gaining space by cutting back this wall to increase the amount of pedestrian area enhancing lighting.'",
        "'speaker_12': 'Implementing recommendations from this plan for bike connectivity to the west of Globeville neighborhood. Small moves could have a dramatic impact in improving quality of life. Hmm. The third one here is the 44th Avenue Bridge over I-25. This is the Globeville neighborhood's only connection across I-25 to the future station at 41st and Fox.'",
        "'speaker_12': 'In recent years, some improvements have been made to stripe the bike lanes here on the bridge, and a few more improvements related to lighting. Enhancing the pedestrian area. A little bit could go a long way in improving accessibility to 41st and Fox Station when it opens.'",
        "'speaker_12': 'Moving on now to the topic of health. I mentioned earlier that we conducted a health impact assessment as a component of our planning process. That process was led by Denver Environmental Health, and it was really an integrated component of the neighborhood planning process.'",
        "'speaker_12': 'It arose out of our planning process, and the recommendations from this Health Impact Assessment document were incorporated into the Draft Globeville plan and also cross-referenced among the various chapters within the plan. So they appear in the health chapter and then recommendations related to other topics in addition to health, such as connectivity, were referenced in the connectivity chapter'",
        "'speaker_12': '. So within the health chapter, you can see this high level of overlap that the recommendations coming out of the HRA have with the other topics in the neighborhood plan to improve environmental quality, to improve multimodal connectivity, increase access to goods and services, enhance community safety, improve mental health and well-being.'",
        "'speaker_12': 'And then the sixth one, there is a catchall for anything that didn't fit into those above categories. All of the other recommendations are also included within the plan. Moving on to the topic of character areas and transformative projects.'",
        "'speaker_12': 'This was the third category of content from our plan on a page we have for the residential neighborhood core, the Washington Street Corridor and the riverfront, the 41st and Fox station area and the industrial edges. What we'll focus on here is more so than the character areas themselves, the transformative projects that are located within those areas.'",
        "'speaker_12': 'So starting with 45th Avenue as Globeville is Main Street, 45th Ave has a storied past but is underutilized today and has great potential for being an enhanced main street. The plan has recommendations and strategies related to elevating 45th so that it realizes that potential, which includes both some land use strategies and recommendations, as well as some public'",
        "'speaker_12': 'infrastructure. So what you see here is some of these ideas illustrated in maintaining the bike lanes that were put on the street last year celebrating the corridor with banners. This shows here how a parklet or a small public space could be introduced within a single parking space in conjunction with other events such as food trucks, you know'",
        "'speaker_12': ', on a vacant lot or something like that, to bring more activity and interest to the corridor. The next transformative project is related to improving Washington Street. Washington Street is it's a complex corridor and it's a corridor one size does not fit all.'",
        "'speaker_12': 'Here are some sub areas that are located within Washington as it flows through Globeville. At the southern end here. This area was previously improved and is already pretty wide. That was done in conjunction with a freeway reconstruction project in the early 2000.'",
        "'speaker_12': 'But north of 47th, Washington narrows down to 60 feet of right of way and maintains that up to the city line at 52nd Avenue. And so that's the primary area of opportunity for addressing Washington and trying to improve it.'",
        "'speaker_12': 'Any improvements that are made here will need to transition effectively to Adams County's Future Cross section for Washington, which at this time is known to be a three lane section one traveling in each direction as well as a turn lane in the middle.'",
        "'speaker_12': 'As part of our planning process, we identified the community's priorities for Washington that what what was really important to them, what did they want to see? And these were their priorities that were identified first to have sufficient travel lanes to accommodate the traffic that's on the street to have on street parking, which is especially important if it's'",
        "'speaker_12': 'going to be a successful mixed use commercial corridor, having a high quality pedestrian realm, which includes having sidewalks on both sides of the street for the length of Washington. It's a condition that isn't present in the neighborhood today tree lawns and street trees to green up the street and assist with beautifying it.'",
        "'speaker_12': 'Having some sort of enhanced bike facility either on Washington or on a parallel street. That is a quality North-South connection and minimizing the impacts to existing businesses as this vision is implemented. What the plan does is that it presents three scenarios to help advance the conversation about the future of Washington.'",
        "'speaker_12': 'In scenario one, we tried to work within the 60 foot right of way within that constrained section of Washington to show how many of the community's priorities could be met if we didn't widen the right of way. Just working with what we have and what we have is traveling in both directions.'",
        "'speaker_12': 'Turn lanes at intersections where they're needed. Mid-Block There would be the opportunity because you don't have the turn lane to have some on street parking spaces. You get a relatively narrow tree line and pedestrian sidewalk area. All of that fits, but just barely within the 60 feet.'",
        "'speaker_12': 'Scenario two assumes a slightly wider Washington. And in this scenario, we have all of the facilities that were identified in scenario one, plus adding an extra travel lane in each direction. So it's the same concept as in scenario one, but with four travel plans instead of two.'",
        "'speaker_12': 'Scenario three is sort of the unconstrained scenario of, okay, what will it take if we everything everybody says they want in Washington, we try to provide it there. What does the street look like then? And it looks pretty wide.'",
        "'speaker_12': 'If you meet all of the community's priorities, you end up with a very wide cross-section. For Washington, this is the same as in scenario two, but adding protected bike lanes as well. The protected bike lane would be needed on Washington because it does carry a lot of truck traffic.'",
        "'speaker_12': 'So you don't want the situation of having trucks and a normal street bike lane adjacent to each other. You need the the ballers to protect the cyclists. You would have a very wide Washington street and you do fail in this instance to meet the community's priority of minimizing the impact to adjacent property owners.'",
        "'speaker_12': 'Washington improved by itself would be transformative for the neighborhood. But if you want to transform the area between Washington and the riverfront and take advantage of a revitalized, active year round entertainment destination at the National Western Center, you need to address the street great condition between Washington and the riverfront.'",
        "'speaker_12': 'You can see here in this graphic the high level of disconnection of the streets here as they approach the South Platte River. Don't quite get there and in cul de sacs or streets, just sort of loop on themselves and head back to Washington.'",
        "'speaker_12': 'So here as well, we have some scenarios for enhancing the street grid. Each of our scenarios show the two recommended connections to the National Western Center, which are at 49th and 51st, and then they differ in how they treat the street grid within this riverfront area.'",
        "'speaker_12': 'But what we tried to do here was to make use of all of the existing infrastructure. So existing street segments remain and the new segments are introduced to try to enhance the grid and complete it in this area.'",
        "'speaker_12': 'Scenario two is responding to a criticism of the first scenario, which is that. Scenario one doesn't allow for much enhanced green space along the river. Scenario two lays back the street more and allows you to have a much greener edge along the South Platte River.'",
        "'speaker_12': 'Now you would have one regardless, because there is the South Platte River Trail on the side of the river. But if you want to have a larger, truly enhanced greenspace along the river, the scenario accomplishes that while still connecting all of the street segments together.'",
        "'speaker_12': 'And here's how they all sort of stack up. So in the existing condition, you have industrial land uses going right up to the South Platte River Trail and bank in scenario one. It allows for more development potential. There's there are more streets and smaller blocks.'",
        "'speaker_12': 'And in scenario two, this is the shows the the green edge the enhanced park space along the river before you have the street and the opportunity for development. And here's the approach from a different way the existing condition, the scenario one with the detailed grid, and scenario two still with a grid, but with fewer street connections and'",
        "'speaker_12': 'more green space. So the planning board held its public hearing on November 5th for the Globeville Neighborhood Plan. The public testimony was generally supportive. And Planning Board did vote to approve the plan by unanimous vote based on its consistency with Planning Board's criteria, which are plan consistency with adopted plans, inclusive public process, and an appropriate long term'",
        "'speaker_12': 'perspective. So the staff recommendation is adoption of the Globeville Neighborhood Plan as a supplement to the Denver Comprehensive Plan.'",
        "'speaker_3': 'Thank you. We have ten individuals signed up to speak this evening. I'm going to call the first five speakers if you can make your way to the bench here in the front, that will help speed up the proceedings.'",
        "'speaker_3': 'I will start with Tami Dore, Mr. Saca, Justin Croft, Nancy Grandees Jones and Vernon Hill. So if you can make your way to the first pew and Ms.. Door, you can go ahead and begin your remarks.'",
        "'speaker_13': 'Good evening, Council President and Honorable Members of City Council. My name is Tammy Dore and my address is 511 16th Street, Denver and behalf of the Downtown Denver Partnership. I wish to express our strong support for the Globeville Neighborhood Plan, the plan's overall vision elements unique, strong, connected and healthy.'",
        "'speaker_13': 'Combined with the strategic approach of including both large catalytic projects and smaller, more tactical quick wins will provide a strong path to achieve a successful vision for the Globeville neighborhood and the entire North Denver corridor of Opportunity. This vision, as the plan states, provides a unique and historic opportunity to rebuild a connected community and to energize a'",
        "'speaker_13': 'gateway to downtown Denver. These enhanced connections into the center city, thanks to the plan, will include all modes of transportation. We are encouraged by the walkability and likability aspects of the plan, specifically those vital connections from the 41st and Fox station into downtown.'",
        "'speaker_13': 'I want to personally thank and applaud Councilwoman Monteiro and the entire neighborhood for their hard work and dedication to making this neighborhood and the city an even better place. This area of the city is incredibly important to the vitality and the future of this center city overall.'",
        "'speaker_13': 'The partnership will continue to be a collaborative partner and the planning of the North Denver Cornerstone Collaborative, and we're encouraged by this tremendous first step. Thank you for your time and I kindly ask you for your support this evening.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_3': 'Thank you, Mr.. Mr.. Sekou.'",
        "'speaker_0': 'My name is Chairman Sekou, founder organizer of the Black Star Action Movement for Self-defense. Advocates for poor, working poor folks. That just got broke. Poor. And homeless people. We stand opposed to this plan of being connected with a comprehensive plan.'",
        "'speaker_0': 'That has never been implemented as shown on the screens. Give example, we had a add on to the comprehensive plan with the five point plan and guess what happened? The neighborhood was gentrified, poor people were pushed out, and now you have a community that has been totally displaced.'",
        "'speaker_0': 'I am a personal victim of that plan. I'm on Section eight. I have an $800 limit to the Section eight, and I can't find a unit, a studio that I can rent. So I get a worthless piece of paper and they tell me the best I can do.'",
        "'speaker_0': 'After living in the neighborhood for 61 years, I can move to Lakewood. Are you kidding me? But then, you know, unintended consequences happen, Doctor, because when you have no integrity, which means you're going to do what you said you're going to do when you do it, that comprehensive plan that you've attached yourself to.'",
        "'speaker_0': 'HEFFNER And the people that are sitting up here, half of them are going to be gone. So to Montel, who's fought with for this plan with you guys every day and kept the developers at bay to respect you and your neighborhood.'",
        "'speaker_0': 'She's gone and in her place is going to be six different people coming up here. Who's going to take the place? Who you can find to fight for you. Like system to the. You had better get organized. You better bet the next one's going to take her place and hold him to the line to protect this pen'",
        "'speaker_0': 'no matter what. Because I'm gonna tell you flat out, the mayor that you got in office now is not going to do it. He is possible and done.'",
        "'speaker_3': 'Mr. Speaker.'",
        "'speaker_0': 'And that's the reason why I will be your next mayor, because.'",
        "'speaker_3': 'Mr. Sekou, I appreciate your neighborhood. Mr.. Saca Thank you. Justin Croft.'",
        "'speaker_0': 'Good evening, members of the council. My name is Justin Croft and I'm with Zeppelin Development at 345 five Grimsby Court in Globeville. And I'm here to offer our support for adoption of this plan. Unfortunately, Mickey's Zeppelin could not be here tonight, so I'd like to read a statement to your city council members.'",
        "'speaker_0': 'Thank you for considering my letter of support for the Globeville plan. Unfortunately, I'm out of town and cannot personally offer my compliments to the community and city staff for their efforts. The plan represents a balance between preserving the roots of the neighborhood and confronting a transformative future.'",
        "'speaker_0': 'Globeville has struggled for more than 100 years to maintain itself as an independent community. This was despite efforts by the surrounding areas to eliminate it. It was treated as the dumping ground for undesirable city uses. It was the site of junkyards, smelters, sewer plants, industrial uses, dirty air and a polluted river in the 1950s, when the interstate'",
        "'speaker_0': 'highway system was established. Globeville was selected as the site for that highway. The result was a community physically split in half and was subject to major land impositions through land takings for the mouse trap and other vehicle uses.'",
        "'speaker_0': 'With the plan, there is a new opportunity for Globeville to work towards its potential. The plan recognizes that the beginning must be with the people who live and settled there. It provides for improving health, housing, jobs, education, recreation, parks, transportation and connectivity.'",
        "'speaker_0': 'Urge you to approve the Globeville plan. Moreover, please recognize that this area, which has been long neglected, deserve special attention. It demands action by the city to implement the plan. Respectfully, make yourself one. I'd also like to thank Councilwoman Monteiro for her untiring advocacy on behalf B behalf of Globeville.'",
        "'speaker_3': 'Thank you, Mr. Craft. Nancy. Grand Grandees Jones.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_14': 'Council members, and I appreciate this opportunity to speak to you in favor of the plan. I'm a business owner. I am an owner of JJ Properties located at 810 to 870 East 50th Avenue. That's about Washington and 50th.'",
        "'speaker_14': 'My husband purchased the property in 1995. It was a former meatpacking plant. It has over 108,000 square feet and now houses four very successful small businesses, which employ over 60 people in that Globeville neighborhood. When my husband died in 2007, I stepped in to take an active role in the company operations.'",
        "'speaker_14': 'As a business owner, I've made a contribution through paying taxes and invest and making an investment of hundreds of thousands of dollars over the time in keeping that property that was built in 1920. To have to be repurposed for something that benefits the community and it provides good has provide good employment opportunities.'",
        "'speaker_14': 'And I appreciate the benefits that I have derived from having a business in Globeville. I have come to have a passion and respect for the history of Globeville and its people. And that's why I'm coming to speak before you.'",
        "'speaker_14': 'I have been involved in the neighborhood planning process and also have been an advocate for the residents through a significant sponsorship of the Habitat for Humanity build. So I am very committed to advocating for services for the residents.'",
        "'speaker_14': 'By adopting the plan, you have an opportunity to write decades of wrongs and promises broke into the residents of Globeville, but that's only going to be the first step, because we really need to see action in implementing the significant quality of life improvements in that plan sooner rather than later.'",
        "'speaker_14': 'This will result in bringing the residents of global to the minimum standards enjoyed by residents in other neighborhoods. But the vision in that plan is to bring it to something special giving opportunities for education and other quality of life improvements.'",
        "'speaker_14': 'Two factors that I think will determine the successful implementation of the plan is looking at the rezoning and land usage. Globeville right now has has been a the has been a place where marijuana facilities have come to and land is becoming precious.'",
        "'speaker_14': 'As a property owner, I know my property is wanted and I do not want to see what I have there to be used anymore for that I want it to be used for something to benefit the community. Just like when my husband and I sold a property that was transformed into Project Angel Heart.'",
        "'speaker_14': 'Another thing is, I think that land use is going to be very significant in terms of giving the amenities for the residents, including a grocery store. Hello.'",
        "'speaker_3': 'Miss Granderson, I apologize. Your 3 minutes is up.'",
        "'speaker_14': 'Oh, I didn't even see that light. Okay. Use some tax money, marijuana tax money to give the residents amenities.'",
        "'speaker_3': 'Thank you. Next is Vernon Hill. And as Vernon Hill comes up to the podium, I'll call up the next five speakers David O. Lenski, David Portillo, Katie McKenna, Rob Poulet and and Elizabeth. And you can make your way up to the front pew.'",
        "'speaker_3': 'Mr. Hill, go right ahead.'",
        "'speaker_0': 'Thank you. Thank you. My name is Vernon Hill. I'm a managing partner for J.J. Properties. And the reason I'm here probably not as prepared as Ms.. Jones was about this, but I've been involved with the Globeville area since 1984.'",
        "'speaker_0': 'I've been I had a business there since a period of time, and I've gotten to see Globeville go through a number of changes. And I'm very excited at this point and in support of this plan and seeing what's in the future for Globeville.'",
        "'speaker_0': 'I've had employees that have worked for me that lived in the Globeville area, and I've seen the transition from when it was a meatpacking district on down to the point now to where it's beginning to come back. It's been a desert there.'",
        "'speaker_0': 'We've had a food desert as it pertains to no grocery stores. No, no, you know, stores or anything of that nature within the area. And it's been a long time coming. So just in closing, I would like to say that we are in support of this plan.'",
        "'speaker_0': 'And I've talked to a number of businesses within that area, and they still they all seem to feel the same way. And thank you for your time.'",
        "'speaker_3': 'Thank you, Mr. Hill. David O.'",
        "'speaker_0': 'Lenski My name is David Lenski. I'm. A longtime Globeville resident president, Globeville Civic Association. And the first thing I want to do is thank all of you City Council for giving us this plan. Three years ago, we stood here and asked if we could have a plan, and you guys granted it.'",
        "'speaker_0': 'And it's been a long, drawn out, quick process, you know. And Judy, I can't thank you enough. You know, it's just the long hours and late nights, you know, just the the bus trips, you know, everything it took to get this going.'",
        "'speaker_0': 'And and, you know, this plan is needed because we have a lot going on in Globeville between the National Western Club, Swansea, Elyria, 41st light rail and I-70. You know, this isn't the plan isn't needed in time. It's needed now.'",
        "'speaker_0': 'And we need to implement it as quick as we can. We can't put it on the shelf, you know. And that's why I'd like to ask, you know, we've put a lot of planning in changing a lot of property zoning, and that's where we're going to need, if you could, an executive order to start that planning process'",
        "'speaker_0': '. Now with the zoning, that will stop a lot of the grow houses. It'll stop a lot of junkyards. But it's going to be it's going to take a while to get that. And we need that. We need that plan.'",
        "'speaker_0': 'We need to implement it as quick as possible. And there's a number of us that are going to be in a committee. And we want we don't know where to go. I don't know where to go from here.'",
        "'speaker_0': 'And we're going to need your help. I hate to see you to be leaving in May, but maybe Debbie and Robin, you guys can help us out. And when they're when they start putting up bond money, don't let them.'",
        "'speaker_0': 'Let's leave Globeville out. We need our cut. You know, we need our share, and we don't want to be forgotten anymore. Anyway, all I can say is thank you for letting me be part of the neighborhood and part of these plans.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you, Mr. Lasky. David Portillo.'",
        "'speaker_0': 'Hi. My name is David Thiel. I work at the Denver Foundation. I live at 3522, wind up. And I thank Councilman Monteiro and Norma Gayle for inviting me today. I'm very proud of the work of with all of the leaders.'",
        "'speaker_0': 'And I'm so glad that David let ski and applied for a strength in neighborhoods grants to the Denver Foundation. I invite all city council members to make their leaders aware of the strength of the neighborhoods program for economic visioning, for leadership development.'",
        "'speaker_0': 'What do leaders usually apply for? Childcare, interpretation? Food. So again, these meetings can be or can be as inclusive as the global one as you look at work coming forward and opportunities that might be taken or missed. So again, thank you to to all of them.'",
        "'speaker_0': 'I also wanted to point out that the role I think both of the city councilwoman and and her staff was key in terms of both taking leadership by stepping back. So again, could leaders write the application? Could they manage the funds?'",
        "'speaker_0': 'So we think they can. And and we look forward to funding other processes to engage your resident leaders of all the city council areas. Thanks.'",
        "'speaker_3': 'Thank you. Katie McKenna.'",
        "'speaker_2': 'Hi. My name's Katie McKenna. Thank you so much for having us here tonight. I live at 4438 Sherman Street in the Globeville neighborhood, and I also work at Habitat for Humanity. And I'm here today to thank all of you, particularly Councilwoman Monteiro, for all of your help getting the neighborhood plan this far.'",
        "'speaker_2': 'I can't agree with Dave more. So many late nights and just above and beyond to make this possible. From Habitat for Humanity standpoint, we have been building in the Globeville neighborhood for the past four years and are really looking forward to continuing our work in the neighborhood and to continue to see this plan come to fruition.'",
        "'speaker_2': 'It is such a great thing for a wonderful part of the city. So thank you.'",
        "'speaker_0': 'Thank you. Robbo, let. Hi, I'm Robert and I live at 4785 Logan Street. For about the past four years or so, I've been involved on and off with the the plan developments, but it's been great and kind of just kind of checked in to see how it was going.'",
        "'speaker_0': 'I haven't had time, but the steering committee, everyone has done a great job. I think the plan is really it's now in the head for a lot of it and the sooner the better. So thanks. Thank you.'",
        "'speaker_3': 'And Elizabeth.'",
        "'speaker_1': 'Where's this light? I really need to know where it is. The time light over here. So is that a warning? And then it's a is.'",
        "'speaker_3': 'Also on the screen.'",
        "'speaker_0': 'Oh.'",
        "'speaker_2': 'First of all.'",
        "'speaker_1': 'I want to thank Judy Montero for one thing in particular, which was in the first meeting in June of 2012, I believe it was the concept of breaking down the silos between the departments in the city was put on the table as part of what would be a reflected success of this plan.'",
        "'speaker_1': 'And I feel that what emerged was some good work relative to the City Planning Department and the Environmental, Health and Parks and Rec.'",
        "'speaker_7': 'Working and working.'",
        "'speaker_1': 'Together. But I feel like there's a long way to go. I put that I was a speaker in favor of the plan with a caveat. And the caveat for me is the plan is like a false summit. The real work is the implementation that we have, the opportunity with everything that's going on to create a dynamic economy'",
        "'speaker_1': 'that is no longer a subsidized economy, that is no longer an economy that is dependent on the good graces. The graciousness of nonprofits, which we do love. Habitat for Humanity in particular, has been phenomenal. They've helped people improve their property and therefore have a greater means of staying in their property.'",
        "'speaker_1': 'We are still in jeopardy on the basis of keeping the families together that are traditionally the families of of Globeville. I'm, in some sense, a newcomer I've been involved with. Globeville lived over there for about eight years now, maybe seven.'",
        "'speaker_1': 'But I have never been so embraced by a neighborhood that understands that people are what we are and we all want the best for ourselves. And we all, in all of our imperfections, go forward to find that in a neighborhood is an extended family.'",
        "'speaker_1': 'So I would just like to prevail upon the city council and us, as in the neighborhoods, to recognize that the work, the hard work is beginning now. Yes, there have been many plans that have been placed on shelves and many of the the the the economic vitalization issues that need to be brought to fruition in Globeville are'",
        "'speaker_1': 'shared with many neighborhoods in in Denver and in the country. But to me, the most important thing is to recognize that this is an organic and living document that we want to it is an aspirational document in one sense, but that we still have to keep ourselves vividly aware of how the neighborhood is being impacted and make'",
        "'speaker_1': 'sure that it's a peer ship with the forces that are moving with the corridor of opportunity, as the mayor calls it. And to me, that has a lot to do with matching development, with jobs, bringing in education and making sure that the generations of folks that want to call this their place for eternity are brought into the'",
        "'speaker_1': 'flow of the prosperity that's coming to the area through education, jobs matching. And I would support a greater mitigation from the marijuana industry in the neighborhood as well. If there's any way to compensate, to support the folks that are getting prosperous in that way, to make it an either an even healthier and happier.'",
        "'speaker_1': 'And one last thing I would ask the city council to activate a relationship with with the Connect Denver Foundation and Connect as a potential source of direct resource development into helping the Globeville El-Erian, Swanson neighborhoods get the funding they need to accelerate infrastructure improvements and many of the things that make it a connected and mobile multimodal neighborhood'",
        "'speaker_1': '. Thank you.'",
        "'speaker_3': 'Thank you, Miss Elizabeth. That concludes our speakers, this time for questions of members of council. Councilman Brooks.'",
        "'speaker_6': 'Yes, so I just had a question around. You know, I was on a bike in Globeville two weeks ago, and Lord have mercy for anybody riding a bike in that neighborhood. And so I love seeing seeing the plans and seeing some protected bike lanes, but just making sure with all our plans that no street call for any'",
        "'speaker_6': 'SROs, which means for folks who don't know to share or has shared bike lanes with cars at our vehicles at all.'",
        "'speaker_12': 'It's. Okay. So this this shows the recommended bike facilities map. Yep. Which is in the connected chapter. I'm not sure on which page. There are some spaces where the share is recommended, the reason being that there isn't room otherwise for a bike facility.'",
        "'speaker_12': 'But wherever possible, we have more robust bike facilities recommended, and this was developed in coordination with public works and the team that works on Denver moves.'",
        "'speaker_6': 'Yeah. You know, and I'll just say this just to continue to push us, I think it's always unacceptable, especially when we're talking in a multimodal environment for we know that 60% of folks who don't ride bikes who would otherwise if they if they had a protected space, if there was dedication, they would ride.'",
        "'speaker_6': 'And so we need to do whatever we can to make that happen. My real question and Councilman Materials done a great job with this as as and just alluded to in breaking down the silos and you know was great that we got, you know, the health impact assessment done.'",
        "'speaker_6': 'The other thing that I was looking at was economic development. We know that this community really is is is looking for economic empowerment and multisector kind of focus, not just nonprofit, but was there any kind of conversation around jobs, offered opportunities for the plan and going forward on a on a larger perspective for community planning and development'",
        "'speaker_6': ', I think how do we really take these other agencies and bring them into a plan? I think it's a great example of how we can do that in the future. And if you guys have been kind of thinking about that.'",
        "'speaker_12': 'Yes, definitely. So the first question was about economic development and jobs. Yeah, we do have a series of strategies specific to that. On page begin on page 44, it's B 13 A through D, and they are about expanding job growth within the neighborhood, providing job training and workforce development, keeping industry and jobs in Denver.'",
        "'speaker_12': 'And there's a recommendation that's about it's called Jumpstart the Local Economy. And those are strategies taken directly from Jumpstart 2014. So in terms of our collaboration with other departments, we do work with them directly in developing these plans.'",
        "'speaker_12': 'And so that includes always public works. Office of Economic Development, Parks and Recreation and then other city departments as needed, if they're topic specific to those. But the three that I listed are involved in every planning effort and in on the city team that's coordinating and working on these plans.'",
        "'speaker_12': 'So these recommendations are vetted through those agencies before they appear in the plan.'",
        "'speaker_6': 'Great. So it's pretty broad. There's there's not a lot of specificity to it or is there? Because I don't have a plan.'",
        "'speaker_12': 'Right. In terms of the recommendations themselves, they they are broader. They're consistent with, you know, more specific policies that have been developed by OED, for example, like Jumpstart is its own, you know, lengthy document, which is mostly referenced here.'",
        "'speaker_12': 'And they need to remain relevant, you know, for decades into the future for the plan.'",
        "'speaker_3': 'Okay. Thanks. Thank you. Councilman Brooks, Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. I have a couple of questions. Most of them are focused around transportation issues. The first one is looking at just the most multimodal conversation about the connections at 47/51. Actually, I think the map shows 49th and 51st, if I remember that correctly.'",
        "'speaker_9': 'I don't know if you could pull that up. Yeah.'",
        "'speaker_12': 'Just trying to find the best one as you talk.'",
        "'speaker_9': 'Okay. So what I'm wanting to know is in some of the conversations that I've participated in related to National Western, the connection that's supposed to go across at 47 or the furthest Southern street was originally going to go straight through National Western.'",
        "'speaker_9': 'And then there was talk about closing the ST during events which are going to be a lot more frequent in the way that National Western has been planning their future use of the property. And so I just want to see how that was addressed in the Globeville neighborhood plan to ensure that the connectivity is something that is'",
        "'speaker_9': 'consistent, reliable for the residents of the neighborhood so that we don't have the same problem that happened before where, you know, 46th Avenue used to be shut down. The neighborhood couldn't go through the site until the new the bridge was built that connected them underneath 46th Avenue.'",
        "'speaker_9': 'I want to make sure that that connectivity is is secure and reliable. So can you speak to that?'",
        "'speaker_12': 'I can and I can speak to it in particular with where these connections are made in Globeville. So 47th is the existing one that exists today. You sort of cross Washington, go behind the Pizza Hut and curve over towards National Western and end up largely underneath I-70.'",
        "'speaker_12': 'The additional recommended connections at 49th and 51st, we recommended them at those locations because of where they land in Globeville, that at the locations at 49th and 51st, you have the best opportunity for redevelopment of property that's located along there.'",
        "'speaker_12': 'They're evenly spaced along the Globeville riverfront, so the 47th connection remains. Then you add on the odd numbered streets, 49th and 51st, you have a nice even spacing of those connections across the river, and then you have three of them instead of just one.'",
        "'speaker_12': 'So it is true that 49th, which should be the one that would go most directly through the National Western Center, they do envision having to close that to vehicular traffic, depending on the event and the marquee event being the stock show itself.'",
        "'speaker_12': 'And January is the one where they're pretty certain that they would need to close it to traffic, but you would still have the other two connections if all of these recommendations are implemented.'",
        "'speaker_9': 'The other two, meaning.'",
        "'speaker_12': '47th and 51st.'",
        "'speaker_9': 'Okay.'",
        "'speaker_12': 'And 51st. If I could just conclude is an important connection, because that's the one that most directly connects the Globeville neighborhood to the future station right on the north metro line.'",
        "'speaker_1': 'Okay.'",
        "'speaker_9': 'So I want to talk for a minute now about 48th Avenue, the bridge that connects Globeville to the West. I don't remember if that's a four lane bridge or a two lane bridge. And the picture shows a bike lane on each side.'",
        "'speaker_9': 'And I just want to clarify that, that the width of that bridge is wide enough to accommodate bike traffic.'",
        "'speaker_12': 'So are you speaking of 44th, this image here?'",
        "'speaker_9': 'I'm talking about 48th Avenue Bridge, the one that goes over the railroad tracks over to Pico Street.'",
        "'speaker_12': 'Oh, okay. Right. So this the recommendation that's here is is actually at 40th under I-25. So the bridge that you're speaking about is not directly addressed by this recommendation.'",
        "'speaker_9': 'I thought that's what? That bridge.'",
        "'speaker_12': 'Oh, okay. Okay. Sorry.'",
        "'speaker_9': 'All right. And then lastly. So the widening of Washington Street, you had two scenarios, two and three that looked at doing widening. And I want to know if both of those scenarios involved having to take properties to be able to accommodate both of those.'",
        "'speaker_12': 'Yes, they would. The with the 60 feet of right of way, there isn't an opportunity to have a wider cross-section like this without the need to take a property on either side of the street. How that property is taken would be something that would need to be the focus of a follow up study that's recommended in the'",
        "'speaker_12': 'plan, because there may be a way to reduce the impacts to adjacent property owners in because of the the setbacks, very on the west side of the street, the buildings tend to be much closer to Washington Street, whereas on the east side of the street they tend to be set a little further back.'",
        "'speaker_12': 'So there would be considerations like that to take into account with a follow up study.'",
        "'speaker_9': 'And, Mr. President, if I may, I just have one last question. Go right ahead. And this is about the funding commitments to address any of these improvements that are needed. We know that there was money put into the 2015 budget, and I'd like to know if you can elaborate on whether any of these projects in this plan'",
        "'speaker_9': 'are scheduled to be funded with any of the dollars that were approved in the 2015 budget.'",
        "'speaker_12': 'In terms of scheduled? I don't believe so, but I do not know for certain. I think that there is the a clear opportunity for it with an adopted plan and with the existence of the DCC in particular as a group that could help coordinate partnerships, funding and some of this implementation.'",
        "'speaker_9': 'Okay. Thank you. I have no further questions.'",
        "'speaker_3': 'Thank you. Councilwoman Ortega. Councilman Monteiro.'",
        "'speaker_7': 'Thank you, Mr. President. This question is for Gretchen. Because the issue of marijuana grow facilities was brought up several times, and I would just like for you to share with us that was one of the comments that was made in the health impact assessment as well as others.'",
        "'speaker_7': 'So could you talk about that a little bit? Yes, it was. I'm Gretchen Armijo with Denver.'",
        "'speaker_2': 'Environmental Health.'",
        "'speaker_7': 'Department. One of the issues raised during the community input and engagement in the health impact assessment was the strong odors emanating from the.'",
        "'speaker_4': 'Marijuana grow houses. There are a number of grow.'",
        "'speaker_7': 'Facilities in Globeville and residents reported in our assessment.'",
        "'speaker_2': 'Headaches, watering.'",
        "'speaker_7': 'Eyes, throat irritation. So we documented that those impacts from residents. We recommended in the health impact assessment that further study be done.'",
        "'speaker_2': 'On whether there were any.'",
        "'speaker_7': 'Toxic components of those emissions that could be causing any more than a nuisance impacts like temporary.'",
        "'speaker_2': 'Sore throat or watering eyes. But we just don't know.'",
        "'speaker_7': 'So we did receive input from residents that they felt negative impacts from the odors when the grow houses do their venting.'",
        "'speaker_2': 'And we recommended.'",
        "'speaker_4': 'That there be further.'",
        "'speaker_7': 'Study about the health implications. What could you also just generally recap what the top things were as you were writing the health impact assessment and talking with the residents? Yes, the the major health concerns that residents raised through the process were related to environmental quality, particularly air quality odors.'",
        "'speaker_7': 'And then noise and.'",
        "'speaker_2': 'The odors were not only from marijuana grow.'",
        "'speaker_7': 'Facilities, but the other heavy industrial uses in the neighborhood. And then noise primarily from the freight trains and truck traffic and from industrial users. The connectivity and mobility was a big concern, and this plan obviously addresses a lot of those connectivity.'",
        "'speaker_4': 'Problems.'",
        "'speaker_7': 'That cause everything from increased number of accidents or lack of access to transportation. Public transportation, access to goods and services was the third area. And as it has been mentioned tonight, no grocery store in a community of almost 10,000 people.'",
        "'speaker_7': 'When you include Elyria, Swansea, a neighborhood as well, and a range of other daily neighborhood services and needs.'",
        "'speaker_4': 'For.'",
        "'speaker_7': 'Community safety, both actual crime and. Safety and then perceptions of safety based on civil instabilities and poor lighting and vandalism and factors in the neighborhood that could be addressed through enforcement or improvements to the built environment. And then finally, mental wellbeing.'",
        "'speaker_7': 'Mental health and wellbeing was a factor that because of all these other factors, you know, the constant onslaught from the built environment really impacts people's ability to go about their daily business, go to jobs, go to school. And so a lot of the recommendations we included in the plan could help reduce those mental health impacts and improve'",
        "'speaker_7': 'mental well-being. And how, as a policymaker, can we utilize the health impact assessment with the plan? What can we do so that it doesn't sit on a shelf? Absolutely. Well, I think.'",
        "'speaker_2': 'We are so grateful for the opportunity to have partnered with community.'",
        "'speaker_7': 'Planning and development and really broken down those silos and.'",
        "'speaker_4': 'Work.'",
        "'speaker_2': 'Together so that our.'",
        "'speaker_7': 'Recommendations.'",
        "'speaker_2': 'Are.'",
        "'speaker_7': 'Part of this plan. And we worked very closely to dovetail the health implications and how these recommendations to improve the built environment really could improve health. And we added the evidence basis to this plan. So we're grateful that that we could do that.'",
        "'speaker_7': 'I think implementation of this plan, of the recommendations in this neighborhood plan, which is what a lot of other commenters have talked about tonight, will really be key to realizing improving community health and also reducing the health disparities that this neighborhood experiences at a higher rate than other neighborhoods in the city.'",
        "'speaker_7': 'So by bringing the built environment up to the standards that many other neighborhoods in the city enjoy, the residents can really, you know, improve their daily quality of life and ultimately improve their health. Thank you.'",
        "'speaker_3': 'Thank you. Councilwoman Monteiro, are there any other questions for members of council? Seen on a public hearing is now closed. Time for comments from members of Council Councilwoman Monteiro.'",
        "'speaker_7': 'Thank you, Mr. President. And thank you, Cortland, for that for that amazing presentation. You did it really well because there was so much stuff that we needed to talk about. But you did it in all the graphics and it was just amazing.'",
        "'speaker_7': 'And you've been above and beyond in terms of advocating and fighting for this process. So thank you. And and also to Michelle and Sam and Steve for being there with us. Thank you, Nancy. Gladys Jones and Vernon Hill and David.'",
        "'speaker_7': 'Let's Ski. And Katie McKenna and Elizabeth Jones up in I don't know where he is, but I'm sure that he's here in spirit. Justin Kraft, thank you for coming. And and, Rob, thank you for coming. We're going to really need you to help move all of this forward as we get this done.'",
        "'speaker_7': 'It's been quite a journey working in global on this neighborhood plan for over two years now. I've gotten to know the Globeville streets and the people in the neighborhood, their history and the day to day reality in a whole new way.'",
        "'speaker_7': 'Many invested neighbors and stakeholders have been a part of this process, and I really loved hearing about the plan in their own words. And for all of you to hear, this has meant what this has meant to the neighborhood and to the leaders.'",
        "'speaker_7': 'Globeville is a neighborhood full of really strong, tenacious people with a deep rooted love and respect for this community. The neighborhood planning process has really brought people together in a powerful way that I hope will have stopped making me cry.'",
        "'speaker_7': 'Will have lasting effects through the implementation and ongoing connections between the neighborhood leaders. I am so honored to have been able to work alongside with you and I'm really asking you with all your might to work and to continue to fight, to live with the resources that you're going to need in this community.'",
        "'speaker_7': 'And I would say that everyone here has always been amazing. All of my colleagues on on city council have been great. And they've all fallen in love with Globeville as well, even though it's a little bit difficult. You guys are a little bit, you know.'",
        "'speaker_7': 'But we've all fallen in love and want to embrace and continue Globeville to go forward. I remember when we first started talking about the Globeville neighborhood plan with community planning and development, and it was actually Councilwoman Ortega and myself that wrote a letter to Mayor Hancock asking him, you know, this this neighborhood has been so dissected in'",
        "'speaker_7': 'so many ways and there's been so many different plans that have been talked about, written, and have been put on the shelf. And so our plea to more Hancock was to find a way to thread everything together so that it would be a heavy lift, but we would all lift together.'",
        "'speaker_7': 'So thank you, Councilman Ortega, for helping me with that. And as a result, Mayor Hancock heard our call and directed a lot of his energy and intention into the North Denver Cornerstone Collaborative. So, you know, we have six catalytic projects and I keep saying I'm pushing for seven and you're going to need to push for seven two'",
        "'speaker_7': '. And that's the redevelopment of Washington Street. As Cortland had said, one of our next one of our next jobs is to get a plan going for what the vision for Washington Street is in the future. So nothing, nothing, nothing.'",
        "'speaker_7': 'Nothing has been typical about this planning process beginning. Our office in the neighborhood had asked for a different approach and to modify how this planning would be. And I always talk about how we, even as someone that's looked at maps and we talk about planning and zoning, how it's so difficult for me to walk into a room'",
        "'speaker_7': 'and there's the maps and it's looks like a big plate of spaghetti to me. And so we talked about how we would, you know, how we would do it different and what kind of values we would have that go along with lifting communities and doing community development and what the values were that we wanted to adhere to'",
        "'speaker_7': ', including environmental and social justice values, economic and employment, revitalization, culture and historic relevancy. And at the core of our land planning would be the health disparities. And I really believe that without the lens of these values, you can't even begin to have a conversation about land use and community development because it leaves the culture and the values'",
        "'speaker_7': 'of the people, and it takes preference over other things like cars and zoning. That isn't always compatible for this neighborhood, and so for community planning and development to listen to us and to help us, we all sort of grew together and even in doing we even went so far as to do a history documentary with the neighborhood'",
        "'speaker_7': 'elders and leaders on Channel eight. And for some folks in here, we actually went third place national and a little national award on the documentary that we all just thought, Hey, let's try this. We learned a lot about global identity, how it thrived and how it suffered with the strong, strong presence of industry, including the smelters, meatpacking'",
        "'speaker_7': ', meatpacking plants and large scale factories. The Globeville smelter factories made the steel and metal that built the foundation of the city of Denver and enabled Colorado commerce to move forward. Yet the smelters also polluted the area and left residents with questionable soil and concerns about their health.'",
        "'speaker_7': 'Living in their neighborhood industry and residents have had a love hate relationship in Globeville. They started intertwined with people making a living and have since grown apart and become in conflict with residents. Healthy living. The neighborhood plan, really, in my opinion, address this tension and will create new pathways on how to move forward.'",
        "'speaker_7': 'That includes buffering between residential, industrial and industrial MC use mixed uses that can be lighter industrial uses next to residential. You can also see a major change in the plan. How the neighborhood thinks about the river and the recognition of its assets and it becoming a transformative part of the neighborhood.'",
        "'speaker_7': 'Globeville is always been such a tight knit neighborhood and everybody really does care with care for each other. Every. But don't get me wrong, it's not peace. It's it it's it's a neighborhood where it's give and take, but it's a neighborhood where everybody's opinion counts in a in a very big way.'",
        "'speaker_7': 'And it's one of those relationships that people have their opinions. They can dig their heels in, but it it's all going in the same direction. And it also strengthens the neighborhood. Immigrants from many countries have called Globeville their home.'",
        "'speaker_7': 'Yet regardless of the differences, they create a vibrant neighborhood culture in the day to day life in Globeville, churches, shops and schools. I believe this Globeville culture will continue to the direction of this neighborhood plan through things like the historic 45th Street beautification, through art enhancing alley streets, creating unique neighborhood destinations and interpretive signs, historical markers included'",
        "'speaker_7': 'in this plan. We've had lots and lots of great accomplishments that have been talked about, and I've placed them on your desk if you would ever like to read them. Many of my colleagues have heard I think many of my colleagues know so much about Globeville.'",
        "'speaker_7': 'And Charlie, when Garth Brooks came and, you know, Habitat for Humanity and when Clinton came and all of that. But it's an amazing, amazing neighborhood. I appreciate all the efforts, again, that all the city people have made. Gretchen Armijo, Doug Link, Hart, Jean Hook on the Health Impact Assessment, Cortland, Michelle Sam and Steve who listened and worked'",
        "'speaker_7': 'with the community members. And we all learned and grew together and we all just really need to continue to listen and plan forward. I want to thank the Denver Foundation for your generous contributions to our to our child care, our food, our food, because we really like to eat for the interpretation and for all of your help'",
        "'speaker_7': 'and and for being open to help us with that Grant and David Lenski and NOLA for writing the Grants and Spirit and Nancy and Vern and also for taking the time to organize the the merchants on Washington Street that you really felt disenfranchized, even though they were paying paying a large portion of the taxes.'",
        "'speaker_7': 'And so now it's on you also to be able to carry that forward so that you can see what you would like there. So moving forward, if I could have a if I could wish anything for Globeville, it would be that they carry on, that you carry on your strong spirit into this next period of history in'",
        "'speaker_7': 'the neighborhood, that those who live and work in Globeville now and in the future, the children going up there, even the developers that come in, that they know the history of the neighborhood and carry on its culture, evolving it to the changes around, but maintaining its integrity, its grit, and finding a new healthy balance with industry and'",
        "'speaker_7': 'benefits that the neighborhoods will be proud of and will have a healthy community again. So I would just I took a long time. Did you count that, Charlie? That was 4 minutes and 55 seconds. So thank you so much.'",
        "'speaker_7': 'And I urge the support of my council members for this neighborhood plan.'",
        "'speaker_3': 'Thank you, Councilman Monteiro. Councilman Brooks.'",
        "'speaker_6': 'Thank you, Mr. President. And I just want to I want to thank Councilwoman Monteiro. You know, I think as being on council for 12 years, not me, but her seeing this Globeville plan finally come to its completion is incredibly satisfying for even us who who are cheering her on.'",
        "'speaker_6': 'But so it must be incredibly satisfying to you. And thank you so much for representing the district. And it's also so great to hear folks in the community that have been at many of the meetings that I have attended be in such incredible support of this plan.'",
        "'speaker_6': 'And we. Expect to see great things. Also want to want to thank our mayor. Mayor Hancock, who you know, in my mind when I think about Westwood, when I think about Globeville or Swansea, I think about Welton. These are all neighborhoods who have been pretty forgotten for the last 30 years, and they're getting a significant planning documents'",
        "'speaker_6': 'upgrade investment into their neighborhoods. And so that's that's incredible. And in Cortland. Cortland Cortland did the Northeast Downtown Neighborhoods plan. And I can tell you, this plan is going to take off. There's going to be a lot of incredible resources that come around it, because I've seen it happen with the Northeast Downtown Neighborhoods Plan that you put'",
        "'speaker_6': 'together in 2011. So thanks for your work on this. I guess my my encouragement in this and I think Councilwoman Monteiro and Nolan and her office have been working on this to really bring break down the silos. And I think we can continue to get better at that.'",
        "'speaker_6': 'I think a neighborhood plan should really invest in and go deep into some key areas in this health impact assessment was a great example of that. That document is thorough, right? It's a guiding document for those who are going to be doing work in the neighborhood.'",
        "'speaker_6': 'But what's the guiding document for economic empowerment? What's the guiding document for a housing plan for that area specifically? What's the guiding document for the educational system in that area? And so, you know, while I am celebrating this, I think as a city and as community planning and development, like coming together and putting these neighborhood plans together'",
        "'speaker_6': ', especially for neighborhoods that have been overlooked, we can do a deep dove into some of these other areas that I think have been have been overlooked. And so this is exciting. And I just also want to encourage everyone, because I did this a couple of weeks ago and I didn't drive through Globeville.'",
        "'speaker_6': 'I rode on my bike. I got off and walked around the neighborhood. Go do that. Sometime in the next couple of weeks, you will see that this is a hidden treasure in our city. I think you'll enjoy it.'",
        "'speaker_6': 'So congratulations, everyone.'",
        "'speaker_3': 'Thank you, Councilman Brooks. Councilwoman Cohen. Each.'",
        "'speaker_2': 'Thank you, Mr. President. I will be very brief first to just say well done, well done in taking leadership as current residents for a future of individuals who haven't yet arrived. Because without that care for the next generation, no good change gets managed.'",
        "'speaker_2': 'Well done for not turning your back on the hard things, right? Mental health. I mean, folks in this neighborhood do experience stress from the environment in which they live and you know, to have a planning document acknowledging mental health right after our Denver Post series about how we have turned our back on that aspect of health and'",
        "'speaker_2': 'also affordable housing, you know, the the the accessory dwelling units, right? That's in my time on council. It's the first time I've had a new neighborhood take that on and say, we have a legacy of affordability and we're not turning our back on that.'",
        "'speaker_2': 'We're embracing it. And so, so well done. And then, you know, just to say, I got your back, Councilman Monteiro, till the day you leave office, I got you back. And to these residents, I've already not taken no for an answer when it comes to important work in Globeville.'",
        "'speaker_2': 'And I will be there with you and, you know, with my colleague, I'm sure if we're able to grace these seats, you know, to continue to make sure that implementation is as celebrated as this plan is. So I'll be there with you and good luck and stick with us.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you. Councilwoman Monteiro. Your comments were very well stated. It covered the gamut. I just want to mention a couple of things and not try to be redundant. I want to congratulate the neighborhood, both the businesses and the residents, for just the tenacity it takes to get through the process of putting together a neighborhood plan and the'",
        "'speaker_9': 'involvement of Councilwoman Montero's office in, you know, saying to the planning of this, this is a priority. We need this to be front and center of all the other work that's going on in the community. I want to congratulate her, her staff, I think.'",
        "'speaker_9': 'Nolan's still here. Amanda for for their work with the neighborhoods as well for all of the city staff that were involved from Cortland to your colleagues, folks from Environmental Health, I know Public Works is very involved in many of the discussions about the traffic issues.'",
        "'speaker_9': 'I have a concern and that is that we just learned today that the I-70 project may be completely different than what has been discussed and proposed based on the whole of taxpayer bill of Rights and the lack of.'",
        "'speaker_9': 'Right now, there's a $200 million gap on the project. And so they're now talking about the fact that the CDOT commissioners will be discussing whether or not, you know, they're going to continue to try to find the dollars through a public private partnership, whether they're going to look at scaling back the project, just doing patchwork on it'",
        "'speaker_9': '. And so, you know, that project alone has major effects on this neighborhood and in the adjacent neighborhoods. And, you know, the opportunities that we're going to present itself for jobs and potential economic development and replacement housing, which right now we don't know how that would be affected.'",
        "'speaker_9': 'But I think we all need to really pay attention to what's happening with that project and look at what that means, because the neighbors today just learned about this, this very information that I'm sharing with you. The other concern that I have is that there's a big focus on national Western.'",
        "'speaker_9': 'It's a big project. It's been very important to the city. It generates a lot of money. You know, in January, when oftentimes our sales tax dollars are flat and there are some pretty grandiose plans being looked at for that complex.'",
        "'speaker_9': 'And I think we as a body will need to be, you know, very thoughtful and careful in looking at what is brought forward, particularly if it is looking at public financing to address how, you know, the new national western is going to look and feel and ensuring that it's not done to the exclusion of things that the'",
        "'speaker_9': 'neighborhoods have fought for in the neighborhood, plans for Globeville and for Swansea and Elyria to ensure that there's some balance between what happens with National Western and whatever that new look is and the needs of these neighborhoods, and that they not be short changed.'",
        "'speaker_9': 'And I just want to assure you that that's one of the things that I will work very hard at and ensure that, you know. As a city, we're trying to do our collective part to address that balance between all of the needs in this quadrant of the city.'",
        "'speaker_9': 'So, again, congratulations to all of you for the hard work that you've put into this. Now, the real work begins in in terms of the implementation, and I'm just committed to continuing to work with your community and helping to ensure that the implementation will will follow.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilwoman, are there any other comments from members of Council c none. Madam Secretary.'",
        "'speaker_4': 'Rocco Monteiro.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'Nevett i.'",
        "'speaker_4': 'Ortega Rob Shepherd. Sussman. Brooks. Hi. Brown.'",
        "'speaker_2': 'Hi, Fats. I can each.'",
        "'speaker_4': 'Layman.'",
        "'speaker_0': 'Hi.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_3': 'Hi, Madam Secretary. Please close the voting venue, announce the results.'",
        "'speaker_4': '12 Ice.'",
        "'speaker_3': '12 Ice. 971 has been placed on final consideration and does pass. No other business before this body. This meeting is adjourned.'",
        "'speaker_2': 'Denver eight TV. Your city. Your source.'",
        "'speaker_1': 'Denver. Eight on TV and online. Stay connected to your community, your city, your source.'",
        "'speaker_2': 'You are watching Denver. Eight TV's Your City, your source.'"
    ]
}