{
    "Proclamation for Indigenous Peoples Day.": [
        "'speaker_0': 'Happy birthday. That's correct. I hear that later. Might be you might be heading to Cosmo. Anita is what I hear. So happy birthday. Thank you very much. That concludes our announcements. There are no presentations and there are no communications this evening.'",
        "'speaker_0': 'We do have several proclamations on consent, but we have one that is being read aloud this evening. Councilwoman Torres, will you please read Proclamation 1082.'",
        "'speaker_4': 'Thank you, Mr. President. It's my honor to read Proclamation number 19 1082 in observance of the fourth annual Indigenous Peoples Day in the city and county of Denver. Whereas the Council of the City and County of Denver recognizes that the indigenous peoples have lived and flourished on the lands known as the Americas since time immemorial, and that'",
        "'speaker_4': 'Denver and the surrounding communities are built on the ancestral homelands of numerous indigenous tribes, including the southern ute and the Ute mountain ute tribes of Colorado. And. Whereas, the tribal homelands and since seasonal encampments of the Arapaho and Cheyenne peoples along the banks of the Cherokee Cherry Creek and the South Platte River confluence gave bearing to future'",
        "'speaker_4': 'settlements that would become the birthplace of the Mile High City. And. WHEREAS, Colorado encompasses ancestral homelands of 48 tribes, and the city and county of Denver and the surrounding communities are home to descendants of approximately 100 tribal nations.'",
        "'speaker_4': 'And. WHEREAS, on October 3rd, 2016, the Council of the City and County of Denver unanimously passed Council Bill 16, Dash 801, officially designating the second Monday of October of each year as Indigenous Peoples Day in Denver, Colorado. And.'",
        "'speaker_4': 'Whereas, the Council of the City and County of Denver continues to recognize and value the vast contributions made to our communities through indigenous peoples knowledge, science, philosophy, arts and culture. And through these contributions, the City of Denver has developed and thrived.'",
        "'speaker_4': 'And. Whereas, the indigenous drum and song are integral to indigenous identity and remain an essential avenue for Indigenous people to maintain their connection in contemporary society. And. Whereas, Indigenous singers and drums carry their traditional teachings and stories on to future generations are essential elements in cultural gatherings, prayers and celebrations like the annual Denver March Powwow, Community Honoring'",
        "'speaker_4': 'and Community Community Memorials and are featured in a local film, Voices of the Drum and the accompanying art exhibit exhibition Voices from the Drum and Osage Collection, all of which promote indigenous cultural resiliency in Denver. Now, therefore, be it proclaimed by the Council of the City and County of Denver that the city and County of Denver celebrates'",
        "'speaker_4': 'and honors the cultural, foundational contributions of indigenous people to our history, past, present and future, and continues to promote the education of the Denver community about these historical and contemporary contributions of indigenous people that the city and county of Denver, Colorado does hereby observe October 14th, 2019, as Indigenous Indigenous Peoples Day, and that the Clerk of the'",
        "'speaker_4': 'city and county of Denver shall attest and a the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the Denver American-Indian Commission and the Colorado Commission on Indian Affairs.'",
        "'speaker_0': 'Thank you, Councilwoman Torres. Or motion to adopt.'",
        "'speaker_4': 'So moved.'",
        "'speaker_0': 'All right. It has been moved and seconded. Thank you. Comments by members of Council Councilwoman Torres.'",
        "'speaker_4': 'Thank you so much. It is such an honor to sit in this seat, having been on the other side of the street when this day was being debated and proclaimed and passed and celebrated. And it was an honor of mine for many years to work with the Denver American-Indian Commission.'",
        "'speaker_4': 'And watching, I think, as this made its way through a number of conversations and to the reflection point that it's out now. So I thank you all for your perseverance in making sure that Denver was leading on this particular observance.'",
        "'speaker_4': 'I also want to recognize my predecessor, now clerk and recorder Councilman Paul Lopez, clearing record of Paul Lopez for championing, along with you and this council, the official recognition of Indigenous Peoples Day. I remember a conversation because this was not a simple or easy day to create, and I remember a conversation with resistance who said Designating holidays'",
        "'speaker_4': 'doesn't save lives. And I beg to differ. What we have in front of us and what we're a part of. I think every day and what you help reinforce in the community is visibility and an honoring of things that have been attempted to genocide.'",
        "'speaker_4': 'So I thank you so much for all the work that you do and the community, and I'm just happy to be a part of it.'",
        "'speaker_0': 'Thank you, Councilwoman Torres. Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. I'd love to have my name added to the proclamation and also acknowledge Councilman Lopez for his role in helping bring the initial proclamation forward. I think when you look at the history of Colorado and the fact that we have a commission on Indian affairs at the state level that was done in the seventies'",
        "'speaker_5': ', really lends to the acknowledgment of the presence of our native community that has been part of this state since the beginning. I had the pleasure of working in that office when the in the lieutenant governor's office, when that office was created and was involved in a peace treaty signing ceremony between the Utes and the Comanches down in'",
        "'speaker_5': 'the Four Corners. And I think when you just look at the contributions that have been made to our community by our Native people from Colorado, I mean, they're ingrained in our Latino culture, right? The the the arts, the colors, the music, the dance, the powwow.'",
        "'speaker_5': 'If you have never been to the march powwow, it is just amazing to see the floor just filled with every age of native dancers from across the globe. I mean, they're not just people from the United States. They're from other countries that come and dance and sing and share that culture with the Denver community.'",
        "'speaker_5': 'And it's it's just so inspiring. And then you see just the crafts and just incredible part of that culture that's been shared with the rest of us. So I am happy to sign on to this and just want to thank Councilwoman Torres for bringing it forward.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Ortega. And and my thanks to Councilwoman for bringing this forward. Excited to vote yes on it this evening, Madam Secretary.'",
        "'speaker_3': 'Raquel Torres I. Clark I CdeBaca I. Flynn, I. Gilmore, I.'",
        "'speaker_0': 'Herndon High.'",
        "'speaker_3': 'High High. Cashman High. Kenny Ortega Sandoval, I. Sawyer, I. Mr. President.'",
        "'speaker_0': 'I am Secretary. Please close the voting. Announce the results.'",
        "'speaker_3': '13 Eyes.'",
        "'speaker_0': '13 Eyes Proclamation 1082 has been adopted. Councilwoman Torres, is there someone you'd like to bring up to accept?'",
        "'speaker_4': 'There is indeed, actually four people I'd like to invite. Donna Christian, chair of the Denver American Indian Commission, Shinhwa Crochet, Patterson, Danielle Walker and Walt Poirier.'",
        "'speaker_3': 'Cappy you ha Tonto I stand Apaches AP Donna Chris Johnny Match AP Castro Hi. Good evening. My name is Donna Christian. I am see Django and Donna. I am a Denver native. Thank you very much for this evening and for the proclamation.'",
        "'speaker_3': 'I want to make sure that we get everybody to say thank you and then Walt. Well, I'll close this out. Thank you. Okay. You need Diana Cousineau, a grocery Patterson. This is my third, fourth year with the commission and my first term as a co-chair.'",
        "'speaker_3': 'I am very feeling very happy about this today, and I really appreciate all of you. So thank you. Pillar, Maya, for the proclamation this evening. My name is Daniel C Walker. I'm from the Standing Rock Sioux Tribe in North Dakota, and I am on the Denver American-Indian Commission as well.'",
        "'speaker_1': 'Okay. Please stand.'",
        "'speaker_2': 'I. Oh, hey. Hey. Oh. Oh, well. Hey. Hi. Hi. Hi. How are ya? Hi. Hi. Hi. Hi ya. Hey, hey, hey, hey, hey. It's all about. Ha ha ha ha la garbage on. Hey Charlie are guy back at Josh McSorley up all your high junk and go oh yeah I know.'",
        "'speaker_2': 'I. I know. They are. Oh, hi. And. Hi. Hi. Are you all. Haha. Hi. Hi. Hi. Hi. Hi. Are ya. Hi. Hi. Hi guys. Cybercrime. I thought I copied Chana her head to ask. Hey, Pekka. Hey, Josh McSorley on point.'",
        "'speaker_2': 'Hi. I don't care where it you. Hey, hey, hey. Na yellow. Hey, hey, hey, whoa.'",
        "'speaker_1': 'Bella Tonka. Oh, it's you to me darkly. I see.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you very much. All right. That concludes our proclamation to be read aloud this evening. Madam Secretary, will you please read the bill for introduction.'",
        "'speaker_3': 'From Finance and Governance? 1022 A bill for an ordinance approving a proposed easement between the city and county of Denver as Grantor and Cherry Tree Estates, LLC, as grantee for use of certain city owned land at South Quebec Street and East Colorado Avenue for access to certain land owned by Cherry Tree Estates, LLC from Land Use, Transportation'"
    ],
    "Proclamation Honoring Denver Urban Gardens.": [
        "'speaker_0': 'Thank you, Madam Secretary. We also do have a late filing this evening. Councilwoman Ortega will need a motion to suspend the rules of council to allow for the introduction of a late filing.'",
        "'speaker_5': 'Thank you, Mr. President. I'm not sure I have the actual filing number.'",
        "'speaker_0': 'It looks like it's 19 dash one one, one, two. All right. You have the motion in front of you that we need.'",
        "'speaker_5': 'Looking for it on page.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'Mr. President, I move for the rules of procedure to be suspended to allow for the introduction of Proclamation 19 dash 111 to honoring Denver Urban Gardens, which would move forward on the consent calendar.'",
        "'speaker_0': 'Thank you, councilman. It has been moved and seconded comments from members of council councilwoman ortega.'",
        "'speaker_5': 'Thank you. I this is a proclamation that i was asked to do for Denver Urban Gardens that I will be presenting on Thursday at their dinner. Unfortunately, there was some miscommunication between our office and theirs, and we didn't get the information until today.'",
        "'speaker_5': 'So that's the reason for the late filing.'",
        "'speaker_0': 'Thank you, Councilwoman.'",
        "'speaker_5': 'I appreciate everyone's support because this does require unanimous support.'",
        "'speaker_0': 'Yes, I was just to remind everyone that in order for this to be for the late filing to be allowed, it will need unanimous approval for this motion. So see no other comments. Madam Secretary.'",
        "'speaker_3': 'Raquel Ortega. Hi, Black Eye CdeBaca. Hi, Flynn. Hi, Gilmore. I.'",
        "'speaker_0': 'Herndon, i. I.'",
        "'speaker_3': 'Cashman. I can teach. Sandoval. I. Sawyer. I. Torres. I. Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting. Announce the results.'",
        "'speaker_3': '13 Eyes.'",
        "'speaker_0': '13 Eyes. Proclamation 111 to maybe introduce. So, Madam Secretary, will you please read the proclamation title into the record?'",
        "'speaker_3': 'A proclamation honoring Denver Urban Gardens.'",
        "'speaker_0': 'Thank you, Madam Secretary. All right, councilmembers. This is your last opportunity to call out an item. Councilwoman Black, will you please make the motions for us this evening?'"
    ],
    "City Council Appointment of Jane Feldman to the Denver Board of Ethics.": [
        "'speaker_0': 'Thank you very much. I'll do a quick recap. Under resolutions, no items have been called out under bills for introduction. No items have been called out under bills for final consideration. Councilman Flynn is called out 1014 for a comment and under pending, no items have been called out.'",
        "'speaker_0': 'Did I miss anything? All right, Madam Secretary, if you please, with the first item on our screens and Councilman Flynn, if you want to go ahead with your comment on 1014.'",
        "'speaker_1': 'Thank you, Mr. President. I wasn't planning on calling this out until I saw that our appointee, not only is our appointee here, but fellow who also serves on the nominating committee. Jane Feldman is the person who was selected for this vacancy for a vacant term on the Board of Ethics.'",
        "'speaker_1': 'And she's accompanied by Mike Lopez, who was was my nominee for the new nominating committee system that we set up for these appointments. And I just wanted to take the occasion to point out how successful this has been that that the with Mike on the committee and and vetting the nominees resulting in the appointment of Jane and'",
        "'speaker_1': 'the ones that we've done before this that this has been a very successful model. And I just wanted to take the opportunity to call that out for the comment and and point this out to everybody. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn. All right. That does conclude the items to be called out this evening. All bills for introduction are ordered published and we're now ready for the block vote on proclamations, resolutions and bills on final consideration.'",
        "'speaker_0': 'Council members remember that this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call an item up for a separate vote. Councilwoman Black, will you please put the proclamations and resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_6': 'I move that proclamations and resolutions be adopted and bills and final consideration be placed upon final consideration and do pass in the block for the following items. They are all series 19. The first is 1081 1080 31112 1024 1020 709570958 1012 1013 1018 1021 1000 1014 0959.'",
        "'speaker_0': 'Thank you, Councilman. It has been moved and seconded. Madam Secretary, roll call black.'",
        "'speaker_3': 'I. CdeBaca I. Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Gillmor, I.'",
        "'speaker_0': 'Herndon High.'",
        "'speaker_3': 'Heights. High. Cashman High. Kenny Ortega, I. Sandoval, I. Sawyer I. Torres, I. Mr. President.'",
        "'speaker_0': 'I. I'm secretary. Please. Because voting in results.'",
        "'speaker_3': '1313.'",
        "'speaker_0': 'Eyes. The proclamations and resolutions have been adopted and the bills have been placed upon final consideration and do pass. Since there are no public hearings this evening, Council will not take a recess and see no other business before this body.'"
    ]
}