{
    "Zoning Change for 3700-3746 Gaylord Street and 3701-3749 York Street in Cole.": [
        "'speaker_0': 'It has been moved and seconded before we go into the public hearing. Councilman Brooks, is there something you need to address before we go in?'",
        "'speaker_2': 'Yeah. Thank you, Mr. President. I just wanted to remind my council members that this is the third rezoning that I have sponsored. This is a council initiated rezoning. So I will be abstaining from the vote today, but will be available for questions.'",
        "'speaker_2': 'And so I just want to let it be known.'",
        "'speaker_0': 'Thank you. Thank you, Councilman Brooks. The public hearing for Councilman 18 Dash 1543 is open. May we have the staff report?'",
        "'speaker_6': 'Good evening, council president and members of council. My name is Liz White, going with community planning and development and I will provide the staff report. So this is a map amendment for 3700 through 3746 Gaylord Street and 3701 3749 York Street from you are age 2.5 to your x three and your x five.'",
        "'speaker_6': 'It is located in Council District nine in the Cole neighborhood. Here is an aerial of the site. The rezoning would propose to rezone the western 60 foot five feet of the property to your x three and the remainder to you are x five.'",
        "'speaker_6': 'And it's approximately a two acre site. It's it's vacant currently. It did formerly have multi-unit residential on it. And this, as Councilman Brooks said, this is a council initiated rezoning and it would facilitate redevelopment of the site with affordable housing.'",
        "'speaker_6': 'Concurrent with the rezoning, the applicant has also facilitated a voluntary, affordable housing agreement to be recorded by the property owner. The agreement would apply to this portion of the site proposed re rezone to your ex-wife. Per the agreement, 20% of the residential units would be affordable to households earning no more than 60% of the area.'",
        "'speaker_6': 'Median income for rental units and for for sale units that would be affordable to those earning no more than 80% of area median income. The applicant proposes to rezone the site to your ex three and your x five, which are residential mixed use districts in the urban neighborhood.'",
        "'speaker_6': 'Context this these districts promote a mix of active pedestrian skilled uses up to three and five stories. They're intended to be primarily residential. Retail and commercial uses are permitted on the ground floor, while upper stories are reserved for residential or lodging uses.'",
        "'speaker_6': 'The site is currently zoned your H but 2.5, which is a rowhouse district that allows row house, tandem house, duplex and single unit building forms on the surrounding properties are single unit districts you Youssou want to be one and also light industrial to the north, to the east and northeast, a site that was recently zoned to APD'",
        "'speaker_6': ', which is based on your max three and I am x three districts. I'm sorry. I think I didn't actually say that this is that you are between 38th and 37th Avenues. Just to give you a little context there, the subject property is currently vacant.'",
        "'speaker_6': 'As I noted, it's generally surrounded by industrial uses. To the north is the Coca-Cola distribution plant office to the northeast and a mix of residential to the west, south and east. Here's an area of the site in the surrounding context.'",
        "'speaker_6': 'Looking north, you can see the multi-unit structures that were on the site which have since been demolished. To the south. You can see the predominantly residential uses and the industrial and office uses to the north of 38th Avenue.'",
        "'speaker_6': 'Again, these photos show the site, the top right with the former structures and the immediate context, including low scale industrial office and residential uses. The applicant team hosted three community meetings in April and October. We received letters of support from both the Equal Neighborhood Association and the Clayton United R.A. We also received two emails in support, and'",
        "'speaker_6': 'the applicant submitted a letter of support that was signed by 58 neighboring residents of the subject site. The application also went to a planning board in December, where they voted unanimously to recommend approval, with the further recommendation that the housing agreement be recorded or executed concurrent with the MAP amendment.'",
        "'speaker_6': 'As you know, the Denver zoning code puts forth five criteria for review when evaluating map amendments, which I would go over. First, a map amendment must be consistent with adopted plans. There are three adopted plans that apply to this area in addition to a comprehensive plan in 2000 and Blueprint Denver.'",
        "'speaker_6': 'I will also cover the Housing and Inclusive Denver plan, which was adopted by City Council in 2018. The government is consistent with several strategies of comprehensive plan 2000. Most of these relating to encouraging quality, infill, mixed use, transit oriented development, and the development of housing that meets diverse needs.'",
        "'speaker_6': 'In Blueprint Denver, the site has a concept land use of single family duplex, which is described as moderately dense areas that that are primarily residential with some small, complementary commercial uses. These areas also have a mix of housing types from single family houses to small apartment buildings.'",
        "'speaker_6': 'In Blueprint Denver, this was described also as an area of change, and York Street was identified as an enhanced transit corridor. Both places where we were looking to encourage growth. There's further direction in blueprint about transitions, particularly between areas of change and areas of stability and also between residential and industrial uses.'",
        "'speaker_6': 'We do find that the district the districts proposed are consistent with this because it would allow a small level of commercial uses but be primarily residential and provide that transition between the residential uses and the industrial to the north.'",
        "'speaker_6': 'The Housing Inclusive Denver Plan was not adopted as a supplement to the comprehensive plan groups, but the plan was adopted by city council has a number of goals, including creating more affordable housing in vulnerable areas, preserving affordability, promoting equitable and accessible housing, and stabilizing residents at risk.'",
        "'speaker_6': 'Our call was identified as a neighborhood having a wide variety of culture and diversity, where sharp increases in rents and home prices have made residents vulnerable to displacement. And one strategy the plan outlines is a recommendation to promote the development of new mixed income housing stop stuck, which you do find concurrent with the concurrent affordable housing agreement'",
        "'speaker_6': 'that this rezoning would facilitate the development of mixed income housing in vulnerable neighborhood. With regard to review criteria number two. The proposed rezoning would result in the uniform application of zone, district, building, form, use and design regulations. It would also further public health, safety and welfare by implementing our adopted plans and facilitating additional housing opportunities and the'",
        "'speaker_6': 'development of building firms that would promote pedestrian or improve the pedestrian environment and enhance walkability. The application identifies changed or changing conditions as justifying circumstance. This includes nearby investment in a 39th Avenue Greenway and the inner city health center to the east of the site.'",
        "'speaker_6': 'Increasing housing cost costs and adoption of the Housing in Inclusive Denver plan and the long standing, vacant and underutilized condition of the site. A staff agrees that these are appropriate, justified, justifying circumstances for the proposed rezoning. Lastly, the requested zone districts are consistent with the urban neighborhood context, which is primarily consist of single and two unit residential'",
        "'speaker_6': 'uses with small scale multi-unit and commercial areas. The residential mixed use districts themselves are intended to enhance convenience, primarily accommodate residential uses and improve transitions. This these zoned districts would facilitate a transition in height from the I8 district to the north and in use from the mixed and industrial uses to the north and east of the site'",
        "'speaker_6': '. The districts are intended for local and collector streets, thereby York Street as a arterial makes this an appropriate location to apply this district based on finding that all review criteria have been met. CPD does recommend approval of the Map Amendment application.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you very much. We do have seven individuals signed up to speak this evening, so I'm going to call the first five. If you could come up to this front bench so that we can get through everybody quickly.'",
        "'speaker_0': 'If you want to move on up here for Sandra Douglas, Jesse Parris, David Roybal, Joanna Gonzalez and Kevin Hall, we're two homes. If you want to come up to the front. And Sandra Douglas, your first.'",
        "'speaker_7': 'Good evening, President Clark and members of the Denver City Council. I'm Sandra Douglas. I live almost directly across the street from from this site. I've been over there for about 35 years plus. And most of those years it has been a blighted area, riddled with crime.'",
        "'speaker_7': 'And just it seems as though.'",
        "'speaker_2': 'In the.'",
        "'speaker_7': 'For the first few years, we had to call in to the city just to get the lawn mowed. It was it was so horrible. And the opportunity we have now to provide affordable housing is just more than I can even imagine.'",
        "'speaker_7': 'To get the rezoning done for the Clara Brown Commons project is just so wonderful. One of my neighbors who lived on the corner, I'm at 37th and and York and Gaylord and one of my neighbors who has passed away said he was a caretaker of that property, that he had been over there like 55 years.'",
        "'speaker_7': 'And he talked about how wonderful it was, beautiful families, greenery, and it just turned into a totally blighted area. And we as residents, especially in that around that block, have just lived under those conditions for so many years.'",
        "'speaker_7': 'So now with this opportunity, we are just so excited and hope that you do consider the rezoning of this property. Thank you so much.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_8': 'Jesse Peppers, represented for Denver, home of Out Loud, Black Star Action Moment for Self-defense and Positive Action A Commitment for Social Change. And I am a at large candidate for the May 2019 election ballot drop April 15 and I reside in Albert Brooks, District of District nine.'",
        "'speaker_8': 'It's good to see that there is. Consistency from this council on affordable housing. But the issue here is not affordable housing. The issue here is attainable housing, actual housing that we can afford. When I hear 60% aim to 80% AMI.'",
        "'speaker_8': 'That is not affordable to me. That is not affordable to the people in this neighborhood. I've been born and raised in this neighborhood. I stay ten blocks from this from this site, literally ten blocks from this site. And I see nothing but rapid gentrification all around me.'",
        "'speaker_8': 'I do not feel safe in my neighborhood. I do not feel like I am in place in my neighborhood. I feel like I am an outsider in my own neighborhood that I was born and raised in. So I like to state that for the note, because you guys like to say, Oh, this is affordable.'",
        "'speaker_8': 'This is actually going to be inclusive for the community. I want to know exactly who is going to be staying at this property. Why isn't this property being used for a tiny home village? Since we do have a housing crisis, we need 26,000 homes built to actually.'",
        "'speaker_8': 'Attempt to solve this housing problem. 7500 homes isn't going to get it in homes at 60 to 80%. Ami isn't going to get it either. So we need to sweep the council like this, sweep the homeless every night.'",
        "'speaker_8': 'We need to get candidates in to actually care about the plight of the people that are suffering in this town. Vote May 7th. Thank you.'",
        "'speaker_0': 'Thank you. Next up, David Roybal.'",
        "'speaker_9': 'David Roybal reside at 742 West Night, west side of Denver. I'm also writing candidate for West Denver. It's good to see affordable housing, but how much people is going to get chucked in, moved around? And the thing about when you move people around to other communities which has caused damage to the Sun Valley is now you move'",
        "'speaker_9': 'rival gang members to another rival gang territory. None of this is brought up in its decisions, affordable housing or where people can go. It's already happening in West Denver, already predicted we're going to have a high crime in West Denver, already see it rapid.'",
        "'speaker_9': 'So you see the lady already mentioned the crime with this affordable housing. Is there anybody that is keeping that in mind of the new gangs, rival gangs, families that are moving and people are tired? People are being moved in and out, Chuck, to the side.'",
        "'speaker_9': 'And one thing within this redevelopment, are you doing like the Sun Valley? Are you putting all the poor people in just one area? Come on, now. Well, we keep hearing inclusiveness. I don't see no inclusiveness. I see no unity in my community whatsoever.'",
        "'speaker_9': 'Just like Jesse, I walk around Denver. I'm a threat to people born and raised here, walk in culture and history. And I don't get no love support now. But I work at showbiz and I'm proud of that. So I know how to serve the people, you know?'",
        "'speaker_9': 'And I'm hoping that we get some more businesses like showbiz there and opportunities because there's been a lot of people that have been moved away ten blocks from all the I-70, from the homes that's been closed and businesses are be took.'",
        "'speaker_9': 'I hope that those people can still remain. And they and and they could still be parked here because if you see this area and Sun Valley ain't that much different, we both have human service locations. We both got a good ramp in line.'",
        "'speaker_9': 'And hopefully the people that are watching this, they got a reason to watch because now somebody is talking their language that they could understand, too. And to say is this is is this going to be a benefit of the community to bring us together, or is it just going to keep pushing this around and causing unwanted consequences'",
        "'speaker_9': 'and more dividing? And no matter what happens, we got to organize, organize, organize, lower class, middle class, higher class, no matter no class. We got to organize as a city because what is say across the web building? What is a city but the people?'",
        "'speaker_9': 'What is the city but the people. And that's what we need. We need people that would be elected, that know the people. They're going to bring the people here. And we hope to see this if one of us get elected, that working together and the people that care, we hope to see this city hall packed and come'",
        "'speaker_9': 'on. It's pretty outdated. We got a Facebook Live. We could get public comment live streaming here. This is our date is 2019. We should be having people call in from their home. Nobody can make it. I just came off work, came here.'",
        "'speaker_9': 'And we hope that with the this new council, we can get more technology oriented and get public comment out there because it's hard for people to come at 5:00 during traffic. Thank you.'",
        "'speaker_0': 'Thank you. Next up, want to Kansas.'",
        "'speaker_3': 'When I started. Let me know when I Gonzalez I we weren't that enticing consequently.'",
        "'speaker_7': 'Love her yet yesteryear keep her up yet in el proyecto kp and so.'",
        "'speaker_3': 'Kasturba when nephew Sierra thought that la.'",
        "'speaker_7': 'Communism they were cautious and look of some company. Yes.'",
        "'speaker_8': 'Would you like translation?'",
        "'speaker_0': 'That would be.'",
        "'speaker_5': 'Precise as.'",
        "'speaker_8': 'Juan Gonzalez and she lives at 35th and Reyes Street and she's here to support this project. And I didn't get everything word for word, but she is here to support this project and especially the building of low income housing in this area.'",
        "'speaker_7': 'Even 11, he.'",
        "'speaker_3': 'Said that.'",
        "'speaker_8': 'This is really going to benefit the community, especially those with lower resources.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Kevin, how are the homes?'",
        "'speaker_8': 'Good evening. My name is Kevin Howard. Hummus and I live at 36th and race about two blocks from the property. Thank you for listening to us this evening. I've lived in Cole for the last 11 years. It's been a pleasure to live in such a vibrant and diverse neighborhood.'",
        "'speaker_8': 'Ironically, some of the first folks I met when I moved into coal are in this room. Sandra Douglas. I don't know if she remembers, but I was at a campaign event for her house in the 2008 election, right across the street from the property.'",
        "'speaker_8': 'Jeff Johnson, who's also here tonight, was one of the first folks I met in Cole. And there was a guy also named Albert Brooks who lived right across the alley from me. And in those meetings, we often asked what is going on with a property at 37th and Gaylord and can't something be done about it?'",
        "'speaker_8': 'And all we ever really found out was who owned it and that nothing could be done. Since long before I moved in the neighborhood, as Sandra described the property at 37th and Gaylord had been neglected and was not a safe or viable place for the few families who did live in the existing structures.'",
        "'speaker_8': 'In the 11 years that I've lived nearby, we've been witness to crimes committed on the property, ranging from vandalism to crimes much more severe. We've often lamented how a full city block that could seemingly be used so effectively could sit derelict for so long.'",
        "'speaker_8': 'In these past 11 years, the need for more affordable housing in core has only grown larger. Currently work as the director of Twin Parishes Food Bank, a program of Annunciation Church right there in Cole. In that role, I pretty much interact with all the low income residents in our community, and I've seen many clients forcibly moved out'",
        "'speaker_8': 'of the neighborhood due to rising rents. I know that's a problem. You're all aware of the fact that Mile High Ministries, under the leadership of Jeff Johnson, have gained control of this property and plan to build affordable housing on it is a cause for huge celebration in the Cole neighborhood, as it undoubtedly will allow many long term'",
        "'speaker_8': 'residents of Northeast Denver to remain in the neighborhood. That is not only good for those residents, it's also positive and healthy for the entire community. I volunteered for programs of mine ministries for many years and I'm 100% certain they have the know how and the care and concern for neighborhoods and the residents that reside in them to'",
        "'speaker_8': 'carry out a project of this scope. I strongly urge you to pass the rezoning and allow the wonderful plans for the Claire Brown Commons to move forward. Thank you.'",
        "'speaker_0': 'Thank you. And our last two, if you want to come up to the front bench here. And first up, we have Donald Egan.'",
        "'speaker_4': 'Good evening, counsel. My name is Donald again and I am a coal resident. I live at the corner of 37th and York and since 2010 and I moved in across this location and was very I always wondered about its past and its history, but it was also excited about its future.'",
        "'speaker_4': 'And in my time there, I've seen drug use, drug trafficking, squatters, transient and homelessness. I've seen illegal dumping, juvenile and adolescent behavior such as gunfire and graffiti. There have been two arsons and sadly, two homicides on this property.'",
        "'speaker_4': 'And that's really tough to see when you live directly across the street. So I'd like to say a few things about the rezoning and the proposed project of the site. As you probably know, the Cole subdivision was established in 1874 and is considered one of the older neighborhoods of the great city of our great city.'",
        "'speaker_4': 'Unfortunately, it has the reputation of being the armpit of Denver and I believe the site has been one of the main contributors to that reputation. In my near decade in the neighborhood, I have enjoyed the diversity of the neighborhood and I have been actually anxiously hopeful for the future of this site and the developing of the coal'",
        "'speaker_4': 'community. And I believe in the potential of the coal neighborhood. I believe in the rezoning for this site is a reasonable request that would bring a mixed use income and other community resources to the neighborhood without exploiting the limits of rezoning request.'",
        "'speaker_4': 'So I am concerned about a footprint and they're not asking for like a ten, 12, 2018 building, they're asking for a five storey, and I think that is reasonable. I also believe this project will become the face and the future of coal, which I believe will bring a sense of pride to the neighborhood, the community, and facilitate'",
        "'speaker_4': 'the transformation and the future of the coal neighborhood. It is my hope that the Council will see this positive impact and potential of this rezoning, that the Council will support the rezoning and support the future of this project now and in the future, not only for the whole community and neighborhood, but for the greater good of the'",
        "'speaker_4': 'city of Denver. On a personal note, I am of color. I was raised rural and poor, and I've worked very hard in my life. I'm an average American. I fight for my bills every month. I am currently unemployed.'",
        "'speaker_4': 'I absolutely love living in diversity, which is why I actually moved into this neighborhood. So I hear the concerns of people from the neighborhood. We're not trying to rezone the entire community of coal. We're asking for a two and a half acre plot to be a positive and a positive resource to the community.'",
        "'speaker_4': 'And I understand the controversy of maybe it isn't fitting within the realm of the income appropriate, but we're not asking for the whole entire community and zone. We're just asking for that area. So thank you for your time.'",
        "'speaker_0': 'Thank you. And last up, Jeff Johnson.'",
        "'speaker_5': 'Good evening, council members. I'm Jeff Johnson. I live at 2842 Vine Street and I'm here to speak on behalf of the rezoning of this property. I work for Mile High Ministries, which is a small, faith based organization that has been serving low income families in our city for 30 years.'",
        "'speaker_5': 'We're leasing the property in question for $1 a year from a very generous new landowner. And our intent is to build approximately 75 units of housing, nearly all of it affordable at different income levels. We do plan to have ten market rate units in the on the property, but all the rest of it will be affordable for'",
        "'speaker_5': 'people making 60% of AMI or lower. We're calling the community Clara Brown Commons, named for one of our heroes who is a philanthropist and a caregiver and an activist and a woman of faith. And one of the pioneers of our city.'",
        "'speaker_5': 'A little over 15 years ago, almost 17 now. I started walking around this piece of property and praying, and my prayer was that God would liberate the property from its landowner. And that part finally has happened. And I'm really grateful, grateful to Councilman Brooks, but to the whole council for decisions that you've made that have indeed liberated'",
        "'speaker_5': 'that property from a landowner, that it neglected it to the detriment of the neighborhood for a long time. So now it's time to do the next part, and that is to build some affordable housing. And to do that, we simply have to rezone the property so that we can build higher than 2.5 storeys, so that we can'",
        "'speaker_5': 'serve more families on the property. We've been really encouraged by the participation and the support of our neighborhood. The whole neighborhood is special and and people there are concerned about the changes, the fast changes in our city and in their neighborhood.'",
        "'speaker_5': 'And yet they've been really supportive of our efforts to build something that will make it possible for people who don't have a lot of money to spend on rent, to stay in their neighborhood, and some other people to move to our neighborhood who don't have a lot of money to spend on rent.'",
        "'speaker_5': 'And so over the last few months, lots of our neighbors have come out in support of this project, and we've been really encouraged by their voices and their input. So I want to thank the Council for considering our project and for a rezoning that will help make all this possible.'",
        "'speaker_0': 'Thank you. Thank you. That concludes our speakers. Are there questions from members of Council Councilwoman Cannick?'",
        "'speaker_10': 'Thank you, Mr. President. I was going to ask Jeff if you could come back up before you get too comfortable, please. Thank you for being here. I wanted to ask if you could expand a little bit. We have to sometimes do the same education over and over as different members of our community come into the chambers.'",
        "'speaker_10': 'And so there's always a kneejerk reaction to 60 and 80% area median income. And folks may not know about the history of your organization serving those who are homeless and about the potential to accept vouchers that bring in folks with lower incomes.'",
        "'speaker_10': 'So can you talk a little bit about your work with homeless folks exiting homelessness in the past and then about your practices of accepting vouchers that might make units affordable to lower income folks?'",
        "'speaker_5': 'Yes, that's right. You know, we work with families are exclusively with families who have experienced homelessness and many of them, when they graduate from our programs and they've spent a couple of years working hard at rebuilding their lives, they're probably in that 30% of area median income level.'",
        "'speaker_5': 'So it does require a considerable subsidy for them to be able to afford to live anywhere really in our city. And that's where the vouchers come in. But the thing I want to point out is that the people who work for our organization, so social workers and counselors and youth directors, people like that, people who work for'",
        "'speaker_5': 'nonprofit organizations, that's who that 60% of area median income is often. So they're people who also don't have very much money to spend on rent and need a subsidy.'",
        "'speaker_10': 'Thank you. Can you just clarify really quickly, though, that you will accept vouchers for those 60 and 80% of AMA units? Should you have either an exiting member of your own program or someone who came from another program?'",
        "'speaker_10': 'If they they they could come and live in those units with the voucher paying the difference.'",
        "'speaker_5': 'Yes, that's correct.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each Councilman Espinosa.'",
        "'speaker_2': 'Hi, Jeff. Can you stick around? Sorry, I'm looking at. Did you provide this document?'",
        "'speaker_5': 'The. Yes, we did. Yeah.'",
        "'speaker_2': 'I'm glad to not see a lot of any opposition, really. But do you know why there are no addresses on the 3700 block of Gaylord included in here in support?'",
        "'speaker_5': 'No, I guess. I don't know. I don't know. Levi, if you could speak to that.'",
        "'speaker_2': 'Good evening, counsel. My name is Levi Johnson. I've been up with some of the community outreach. So what we did for the community engagement process was we opened it up. We didn't want to go essentially kind of pick certain places that we wanted to get input from.'",
        "'speaker_2': 'So you'll see a map on the back. But we did do was we personally notified all of the.'",
        "'speaker_5': 'Folks within 200.'",
        "'speaker_2': 'Feet. We had the three community meetings. And then also there are some people who voiced their support, came to the meetings, but just simply didn't do a letter of support who are still part of the process. Okay. It's just it's a concern because when I.'",
        "'speaker_2': 'One of the things that always next is more comment. But I always worry about people who are not directly impacted, sort of influencing people who are directly impacted. So I really would have liked to have seen, you know, really encourage those people across the street from the development to signed on as well.'",
        "'speaker_5': 'Yeah, well and two of those people who live across the street are here among our speakers.'",
        "'speaker_2': 'Well, to the south, though.'",
        "'speaker_5': 'One to the south and one to the west.'",
        "'speaker_2': 'Okay. Sorry, I missed that. The. There's no ID agreement in the packet. Do you know if the cities if the city is going to execute that agreement?'",
        "'speaker_5': 'We're in this process on that.'",
        "'speaker_2': 'Very.'",
        "'speaker_6': 'Yes. Both the city will execute the agreement and then it will be recorded should the rezoning be approved.'",
        "'speaker_2': 'Okay. Once again, one of those things that I can't consider. But I really do consider it. And sue us if you want the commitment to I mean, so you've talked about commitment to 75 units and different income levels.'",
        "'speaker_2': 'Do you have a commitment to multi bedroom units to, you know, percent of twos and threes?'",
        "'speaker_5': 'Yes. We want to have a higher than normal number of two and three bedroom units, because what we've been doing for 30 years is serving families and the families we work with when they go to look for housing, of course, a one bedroom just won't do it for them and often a two bedroom on either.'",
        "'speaker_2': 'Oak because that's crucial. And you know this based on your work in the past, if people are talking about having diversity in this, you know, in this in this development, that bedroom type is what's going to drive larger households and lower incomes into this project.'",
        "'speaker_2': 'So and is there any plan for the city to include bedroom counts as well?'",
        "'speaker_6': 'The agreement says basically that the units have to be.'",
        "'speaker_2': 'Just the same.'",
        "'speaker_6': 'Or relate to what the market rate ones are as well. So if it is a mercury development that has a multi bedroom, then the affordable units would also have to have more type bedroom. But there's not a specific requirement in the agreement.'",
        "'speaker_2': 'And the tough thing there and you guys can certainly still codify this differently, right. Is the market right now is once again in studios. And so it's easy to do a market study to support your your request that only shows ones and twos or less.'",
        "'speaker_2': 'And so to stretch and hit threes, it's going to have to be something that you are committed to regardless.'",
        "'speaker_5': 'Yeah. And that's the only thing I can tell you is it's it's a passion for us because it's who we are and what we do. Okay, sir.'",
        "'speaker_2': 'Families, thank you. All right.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. I have a couple of questions for you as well. Can you speak to the fact as to whether or not you all plan to do any kind of open space given the amount of units that will be on this site?'",
        "'speaker_5': 'Did you say open space? Yes. Yes, we do. I mean, I think we have we have room to create some green space and some playground space. And, yeah, we do have an intention of that.'",
        "'speaker_7': 'Okay. And then for your rentals, are you all relying on charter for tax credits?'",
        "'speaker_5': 'Yes. We'll be applying in June for a 9%.'",
        "'speaker_7': 'Okay. And then. The agreement that would be executed. That's an agreement between the developer and the community.'",
        "'speaker_5': 'The affordability agreement.'",
        "'speaker_7': 'It was the agreement that Councilman Espinosa just talked about, I guess some of the issues that were discussed with the neighborhood.'",
        "'speaker_5': 'Yes. I don't know. Liz, could you speak to that?'",
        "'speaker_6': 'That is an agreement that's been signed by the property owners or the foundation that owns the property, and it'll be signed by the city as well. So what if they come back for a request from the city for a tax credit project to some or some sort of that there would be an additional agreement and discussion with'",
        "'speaker_7': '? Well, this is interesting, because I just had a conversation today with folks from the mayor's office about the tiny home village. And they said, we cannot sign an agreement. It has to be between the neighborhood and the developer.'",
        "'speaker_7': 'So in this case, with the city executing it, I guess I'm just curious about how that is being done, where we can do that on one site, but we can't do it anywhere else in the city. Adam, help me out here.'",
        "'speaker_4': 'Hello, Councilwoman. Adam Hernandez, assistant city attorney. This is just purely a voluntary agreement between this developer and the city that provides affordable units that are above and beyond what would be provided in the linkage fee. Unfortunately, I'm not privy to what's going on with a tiny home village in that discussion, but I could just talk about what's'",
        "'speaker_4': 'going on with this.'",
        "'speaker_0': 'Agreement right now.'",
        "'speaker_7': 'Okay. And it'll be filed as a covenant on the land with the property.'",
        "'speaker_4': 'Correct. So this agreement will go through the regular city contracting process. And once the developer is ready to pull building permits, covenants will be imposed on the land.'",
        "'speaker_7': 'Okay. And back to the developer. If you could just answer whether or not this is proposed to have the 60 year commitment that is being asked of all developers creating affordable units?'",
        "'speaker_5': 'Yes, that's correct.'",
        "'speaker_7': 'Okay. And I think that concludes my questions.'",
        "'speaker_0': 'Thank you. Thank you, Councilman. Or take a councilman.'",
        "'speaker_4': 'Thank you. Excuse me. My voice is not very. And. It's hard to hear today, so I apologize. I lose. In the staff report, the owner of the properties listed his Gaylord Community LLC. But in the assessor's records there are two different owners, one of whom purchased a parcel just three months ago called Sterling Consultants.'",
        "'speaker_4': 'Can you clarify? So who is the owner and the applicant here?'",
        "'speaker_6': 'So the applicant is Councilman Brooks and the property was in.'",
        "'speaker_4': 'Who's the owner.'",
        "'speaker_6': 'Of.'",
        "'speaker_4': 'Property owner?'",
        "'speaker_6': 'Right. The property was in receivership for some time and I believe it was only in the last month about that it was transferred to the foundation that purchased it and that's Gaylord Communities LLC, who is who has signed the affordable housing agreement.'",
        "'speaker_6': 'I think the assessor's records have not yet.'",
        "'speaker_4': 'Stated that's enough. Yeah. Okay. Thank you. That's all I have, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Flynn, Councilman Espinosa, Rebeca. Yeah.'",
        "'speaker_2': 'Yeah. Sorry. I have the same thing Kevin does. Now, just a couple of phone questions. So I'm glad that through this item, tax amendment, we captured the townhouse form in our zone districts. That is so. But I just want to clarify a couple of things.'",
        "'speaker_2': 'We have maps up principally on the CDOT headquarters site on Arkansas. We have mapped multiple zone districts to a single zone line. And we did that to to modify height, essentially. And that's what this appears, right? We have an x five and our x three.'",
        "'speaker_2': 'The argument then was that you could use you know, you would it had the same form standards in those in the district, but then different height requirements. You could see CPD prepared could could an applicant. Do two forms in this situation a townhouse form and a storefront form in the same structure.'",
        "'speaker_6': 'Um. I think you'd have to choose a building form for your structure, but if they have more than one building on the site and could meet all the building form standards, they could certainly have different forms. They could choose part of the site to be townhouse and part of the site to be a shopfront building for them'",
        "'speaker_6': '. But I certainly don't see you want a candidate. I don't believe that you can have a different you have one building. You have to choose a building form for that building.'",
        "'speaker_2': 'Because those stand to deliver affordable housing affordably having a single building with common corridors and a common stair and elevator and all that makes sense. So you'd probably want to stick to the bricks. The difference has considerably different physical impacts to the adjacent neighborhood across Gaylord.'",
        "'speaker_2': 'Then, then the current RH or the townhouse form. The townhouse form has a ten foot setback. Townhouse form has a 38 foot versus a 45 foot height limit, different transparency requirements, different entry requirements. And so, you know, you know, so one is a better transition as far as I'm concerned.'",
        "'speaker_2': 'One is a better transitional form into a single family neighborhood than than a street or shopfront form. So it's interesting I'm asking that question because. You know, one development pattern would be a hybrid of forms. Another one would probably be and maybe this is where this applicant will probably end up, is that you're ten market rate units'",
        "'speaker_2': 'or something like that would be townhouses along Gaylord using the townhouse form and then transition into a separate shopfront form. But you're saying you cannot connect the two if you chose to. To design something that way, you'd.'",
        "'speaker_6': 'Need to choose the building form that you're using and meet those standards that would that would be what they do when they come in for the site development plan. We have a request was made for your x three and your x five.'",
        "'speaker_6': 'And as we said through our analysis, we do feel like those districts are intended as a transition district. The height differential also helps accomplish that. So we did feel that this meets our criteria.'",
        "'speaker_2': 'But if he so if an applicant though, just to confirm what I believe you just said twice now, if an applicant came in with a building that used the shopfront form but had a ten foot setback along Gaylord, and it would it would essentially be denied for not meeting the setback requirements.'",
        "'speaker_6': 'I, I can't go through all the hypotheticals of what's in the, the, the building form standards. But again, they would have to what typically happens when you come in for your site development plan, as you say, which building form you're using for this site and you need to meet all those standards for that.'",
        "'speaker_6': 'So if it's one large building on the site, they would need to show that they can meet those standards for the building form that they choose.'",
        "'speaker_2': 'All right, then. Thanks. I, I think they could do it. So but it's going to be I don't I don't want to be stymied at CPD, at the at the review desk if they're trying to do right by Gaylord residence and our own form standards somehow end up in the way.'",
        "'speaker_2': 'So to the applicant, do you know already do you intend to build something of a sort of more street facing, you know, form along Gaylord.'",
        "'speaker_5': 'Along Gaylord. We do intend to build townhomes.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'Yeah. Facing increasing Gaylord and then a four storey building facing York street.'",
        "'speaker_2': 'Problem solved. Awesome. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Seeing no other questions. The public hearing for Council 18 Dash 1543 is closed. Comments by members of Council Councilwoman Ortega.'",
        "'speaker_7': 'I'm sorry, I was just clicking my screen because it went blank. Oh.'",
        "'speaker_2': 'Right.'",
        "'speaker_7': 'So since you did call on me, I just want to say I think this is a great application. This property has been vacant for way too many years. This property owner or previous property owner owned several properties in the city and the city tried to get him into court many, many times to clean up these various properties'",
        "'speaker_7': 'that he had. And so I'm excited to see that number one is going to be redeveloped. Number two, we're going to see affordable housing on the site. Number three, the neighborhood's excited about the changes that are coming. So I think all the way around this is a good deal for the community.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. See no other comments. I'll just add to add this property is not in my district, but it's a property I'm very familiar with because it has been a nuisance to the community for a long time.'",
        "'speaker_0': 'And so to see something going forward is fantastic. Oh, there are more comments now. They're popping in. So I was just going to say thank you to staff for the presentation. I think this meets all the criteria for rezoning and I'll be supporting it.'",
        "'speaker_0': 'But a few others have jumped in. Councilwoman Cannick.'",
        "'speaker_10': 'Thank you, Mr. President. I'm sorry my butt didn't click in time, so I apologize for chiming in after you, which is not our custom. I just wanted to take a minute to thank the community. You all had to fight hard to get attention from the city.'",
        "'speaker_10': 'And so for those who wonder if there are property rights in Denver, the answer is yes, because property rights are partially why this took so long, because unfortunately, you don't just get to take someone's property immediately when they don't take care of it.'",
        "'speaker_10': 'You have to work with them and try and try and try again. Councilman Brooks, I know, has poured in dozens of hours. He can't speak on this zoning. And so it's always risky to speak for someone else. But he spent dozens and dozens of hours on this property long before we were here today, trying to clean it'",
        "'speaker_10': 'up, trying to make it safer, trying to address the concerns that folks have. And I know you were frustrated. He was frustrated, but ultimately everyone stuck with it. And I just want to acknowledge that because this is an amazing outcome.'",
        "'speaker_10': 'But I'm sure some of you didn't trust it would happen. And I know that it wasn't easy. So without knowing all the work that it took, I just want to thank the community for never giving up and holding us accountable and asking us to use all the tools we had to hold this property accountable.'",
        "'speaker_10': 'I want to thank Councilman Brooks who led that fight, and I want to thank Mile-High Ministries for stepping up and really, frankly. Bold project. This is not. You do have a ton of experience and at the same time, this is you really taking on a big new thing.'",
        "'speaker_10': 'And that's not easy either for boards and for all the other people who have to sign off. So I just I want to thank you all for that, and I wish you the best of luck.'",
        "'speaker_0': 'Thank you. Councilwoman, can each Councilman Espinosa.'",
        "'speaker_2': 'Yeah, I can imagine just dealing with things that we try to deal with of a similar nature that how much work Councilwoman Brooks must have done in this situation. And then and then I can also imagine, because I have seen once the city makes a decision to finally act on something.'",
        "'speaker_2': 'How many resources actually has to come into play? How many things have to be coordinated? And how much effort? How many iterative steps it takes to get to that finish line? So thank you for your patience. Thank you for the pressure.'",
        "'speaker_2': 'And then thank you, Councilman Brooks, for then responding to to those outcries and then holding the city, you know, to task, to sort of follow through on our own laws. None of that was easy. So I appreciate all the things that I asked that are outside of the criteria.'",
        "'speaker_2': 'Right. Because yeah, the case for the criteria short of the Cole plan saying something other was going to be difficult to say it wasn't acceptable. And I do believe it meets all the criteria that you the things that you added sort of give me.'",
        "'speaker_2': 'You know, they give me a lot of I don't know. I don't know what the words are. I'm just really happy because I have driven by this thing for a decade. For four years, it feels like decades. It could be decades.'",
        "'speaker_2': 'And you sit there and go, why or not? Why? Why isn't somebody rehabbing these things and making them occupied? Because, you know, we have a housing crisis. You know, these things are viable. You know, they were at some point in time, you know, they've just been ignored, ignored, ignored for far too long.'",
        "'speaker_2': 'And so for somebody to come through with the program and plan that that that, that, that it sounds like you've already articulated here and that you've testified to is exactly doable and exactly what this community would benefit from.'",
        "'speaker_2': 'So thank you for all that additional information and thanks for staff for bringing it forward. Now I will be voting in favor. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. See no other comments, Madam Secretary. Roll call on Council 18. Dash 1543.'",
        "'speaker_2': 'Brooks staying.'",
        "'speaker_3': 'Black. All right, Espinosa. Hi, Flynn.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Gilmore. I Herndon. Cashman.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Lopez.'",
        "'speaker_0': 'Hi.'",
        "'speaker_3': 'Ortega. Hi. Assessment, Mr. President.'",
        "'speaker_0': 'Hi. Madam Secretary, please close voting in those results.'",
        "'speaker_3': '11 eyes, one abstention.'",
        "'speaker_0': '11 I is one abstention counts for 18. 1543 has passed. Councilman Brooks, now that you have very patiently stayed out of our process.'",
        "'speaker_2': 'I just I just want to say a couple words, first of all, to the community. One of the reasons I had to abstain is in our process, we were in a quasi judicial state, and you cannot advocate for rezoning and could not be in a quasi judicial state for something we've been working on for 30 years in'",
        "'speaker_2': 'this community. So I had to go on the other side and advocate for this, but I just want to say prayer works. So, I mean, Jeff Johnson, I mean, I remember you literally 15 years ago walking around this property, going to all of these neighbors homes, saying, we're going to get this property one day.'",
        "'speaker_2': 'And if everybody's wondering what property this is, I will say it because I think this man, this person, Douglas Bruce, disrespected my community for over for several decades. And it's the number one. It's what?'",
        "'speaker_7': 'Not just your community.'",
        "'speaker_2': 'Yeah, many of them, but it's the number one call for service in the whole community. This place right here. And so there's a lot of emotion with the community of of why we get to take this back and do something that's great.'",
        "'speaker_2': 'And so I just want to thank everybody that worked so hard. And I've never not you know, Councilman Espinosa passed this deal where you have to notify folks within 200 feet. And so we walked we walked every house and everybody's like, Why.'",
        "'speaker_4': 'Are you coming to us? Asking, Yes, go hurry up. Rezone this thing.'",
        "'speaker_2': '100%. So we're excited to get this thing moving forward and amazing that you guys are calling it. Clair Brown comments a former slave who, I mean, just had the vision to be an advocate and became a millionaire and gave back to their community.'",
        "'speaker_2': 'And that's such a great example of what we should be doing. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Brooks. All right. Next up, Councilman Espinosa, will you please put Councilman 128 on the floor?'"
    ],
    "Zoning Change for 999 Jasmine Street in Montclair.": [
        "'speaker_2': 'I move that council will series 19 zero one to be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 19 0128 is open. May we have the staff report?'",
        "'speaker_7': 'Teresa Lucero with community planning and development. This is another rezoning. It is 4999 Jasmine Street, and the request is to reason from a Chapter 59 PD number 223 to urban edge mixed use three stories. So it is in Council District five in the Montclair neighborhood.'",
        "'speaker_7': 'This just gives you an idea of the location of the property. It is about a quarter of an acre, 11,700 square feet. It is an existing three story office building. Again, the proposal is to rezone from an old code PD to urban edge mixed use three stories and the request is to move the remove the beauty standards'",
        "'speaker_7': 'so existing zoning surrounding the site is urban edge single unit to the north and east well north of the R three, which is a Chapter 59 multi-unit zoned district. And then to the south is the urban edge. Mixed use two story.'",
        "'speaker_7': 'So land use, it's an existing office building. There is multi-unit to the north, commercial to the south and west and then multi-unit to the to the west and south west. It's kind of gives you an idea of the area that there is a six story residence, multi-unit residential directly across 10th Avenue and then commercial on the lower'",
        "'speaker_7': 'left directly west of the property, and then single family upper right, directly across Jasmine Street. And then another two storey building and two storey multi-unit residential directly south of the property. So the urban edge context is that blend between suburban and urban, primarily single and two unit residential, small scale multi-unit commercial embedded in our in the residential'",
        "'speaker_7': 'areas. And it's intended to promote pedestrian scale, diverse areas that enhance the convenience of walking, shopping and public gathering. So informational notice on this application went out in September of 2018. The planning board was posted properly for their public hearing on February 6th of this year, and they unanimously supported this rezoning.'",
        "'speaker_7': 'And then Luti committee passed this forward and public hearing is tonight and it has been properly posted. We do have a few R and O's in the area. No R.A. has commented on this application. We do have one letter of opposition from a resident of the multi-unit across the street.'",
        "'speaker_7': 'And the concern there is parking issues in the neighborhood. So you know, the criteria, the plans that apply our current plan 2000 and Blueprint Denver there is no small area plan. Staff believes this conforms with several strategies and current plan, speaking to the re-use of existing buildings, expanding the diversity of business in the area, and infill development'",
        "'speaker_7': 'that's in character with the neighborhood. And on the Blueprint Denver map, this is in an area of stability and a neighborhood center concept, land use. These are small shopping areas embedded in neighborhoods that mix the services in the neighborhood.'",
        "'speaker_7': 'And Jasmine Street, as far as street type, is an undesignated local street providing local access and as well as 10th Avenue is a non-designated local street staff believes this does conform with our adopted plans that by using a standard zone district where it is consistent and uniform in our application of zone districts, by implementing our plans and'",
        "'speaker_7': 'allowing some re-use of an existing structure, we're furthering the public health, safety and welfare and justifying circumstances, our changed conditions and the rezoning of a former Chapter 59. There is some new multi-unit to the southwest of the site.'",
        "'speaker_7': 'There's new multi-unit at ninth and Colorado, just a few blocks to the east, there was a redevelopment of Rose Hospital campus. There's some redevelopment on Colfax Avenue. So there is some recent changes in the area. And staff believes this is consistent with the zone district purpose and intent.'",
        "'speaker_7': 'The proposed zoning is consistent with the urban edge context and the intent of the three AA to promote those safe, active, diverse, pedestrian scale neighborhood shopping areas. So with that, staff recommends approval.'",
        "'speaker_0': 'Thank you very much. We have two individuals signed up to speak on this. So if you signed up to speak on this one, if you want to come up to the front bench. And first up is Paul Wilkinson.'",
        "'speaker_0': 'Yes. Hello, my name is Paul Wilkinson. I am the owner of the building.'",
        "'speaker_4': 'My law firm occupies the building and I am here to answer any questions that anyone might have.'",
        "'speaker_0': 'Thank you very much. And our next speaker is Jesse Pearce.'",
        "'speaker_8': 'He's just in Paris representing for Deborah Holmes of Low Black Star. It's a moment for self defense and positive commitment for social change. And I'm an at large candidate for the May 2019 election. I'm on top of the ballot, and I reside in Albert Brooks District, a District nine.'",
        "'speaker_8': 'I was at the city subcommittee meeting for this. Already know you're going to approve this. There's nothing I can say that's going to change your mind on this. So I'm just going to let you do what you do.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of Council on this item? All right. Seeing no questions. A public hearing for Collinsville 128 is closed. Are there comments from members of council council on assessment?'",
        "'speaker_3': 'Yes. This is actually the the neighborhoods didn't have any particular feeling one way or the other, because we're just moving this from Chapter 59 to what is. No, it's not a question. It's just a comment, a moving of chapter from a PD to a what it would normally have been assigned as it is, and it has there'",
        "'speaker_3': 'is no intention of changing the use of it. It is going to continue to be an office building. So just wanted to mention that.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Seeing no other comments, I'll just say thank you to staff for all your work on this. I think this clearly meets the criteria and I'll be voting to support it this evening. Madam Secretary, roll call on Council Bill 128.'",
        "'speaker_3': 'SUSSMAN Hi. Black I froze. I. Espinosa I slid. I. Gilmore I heard it, I.'",
        "'speaker_4': 'Cashman All right.'",
        "'speaker_3': 'Lopez.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Ortega. Like Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close voting and note the results. 12 hours, 12 hours. Comfortable 19 0128 has passed. On Monday, April eight, eighth, Council will hold a required public hearing on Council Bill 246 regarding the service plan for Denver International Business Center, Metropolitan District Number one.'"
    ]
}