{
    "Ordinance to Update Open Meeting Laws for Electronic Participation and Methods.": [
        "'speaker_0': 'Thank you, Councilmember Sawyer, and your leadership in this regard as well. And I'm glad we got through this first process. And so. All right, thank you. The next item we have up is Council Bill 572. Councilmember Flynn, would you please put Council Bill 20 1-0572 on the floor for publication?'",
        "'speaker_1': 'Yes, Madam President, I move that council bill 20 1-057 to be ordered published.'",
        "'speaker_0': 'Thank you. It has been moved. And we've got the second by Councilmember Herndon Councilmember Sayed Abarca. Your motion to amend.'",
        "'speaker_4': 'Thank you. I move that council bill 21, dash 570 to be amended in the following particulars on page five, straight lines five through eight and remember sections two through five accordingly. And on this one.'",
        "'speaker_0': 'Yep. We're going to go ahead and if we could get a second on this amendment.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Okay. I think I got Councilmember Torres on the second questions or comments by members of Council Councilmember CdeBaca.'",
        "'speaker_4': 'Thank you. This amendment is specifically designed to remove the exception for collective bargaining conferences. I think it's important we heard throughout our collective bargaining sessions throughout this last year that people wanted some more transparency, and this amendment is designed to achieve that.'",
        "'speaker_0': 'All right. Thank you. Council members say. Next up, we have council member Sawyer.'",
        "'speaker_4': 'Thanks, Madam President. It's my understanding that Councilwoman CdeBaca is offering two amendments to the ordinance this evening, and I won't be supporting either of them. The mayor's office, the city attorney's office, a number of agencies and I collaborated extensively in order to draft the changes to this ordinance.'",
        "'speaker_4': 'There was also a significant external stakeholder process so that residents of the community can share their feedback as well. That process included two meetings with every council member to gather feedback on the changes that were made. Neither of these two amendments were discussed until the final draft of the ordinance was brought to committee.'",
        "'speaker_4': 'The proposed amendments haven't been subjected to the same level of scrutiny by Denver residents or the members of boards and commissions that they would affect. This is an ordinance. It can be changed by a vote of council at any time.'",
        "'speaker_4': 'So if these changes are something Councilwoman CdeBaca would like to pursue, I'd be happy to help her with the stakeholder in process at that time. But as of today, I don't feel that that work has been done. So I ask my colleagues to vote no on both amendments and vote yes to publish the ordinance as written.'",
        "'speaker_4': 'Thanks, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. Next up, we have Councilmember Flynn.'",
        "'speaker_1': 'Thank you, Madam President. I don't believe that it is good public policy to allow our conferences on collective bargaining strategy to be open to the people with whom or negotiating. I don't want to sit in the PAs weidner room with the mayor and the council and have the police union sitting there hearing us discuss how we're going'",
        "'speaker_1': 'to approach their negotiations. I think that's bad public policy and I urge a no vote. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Flynn. Looks like I double checked the hands raised. Council member Pro-Tem Torrence.'",
        "'speaker_3': 'Thank you so much. I'm hoping to get a legal response on a question that I have.'",
        "'speaker_0': 'Okay. We can go ahead and make sure that we have John Griffin or Kirsten Crawford here in the queue. Okay. We've got John Griffin. Go ahead, Councilmember, with your question.'",
        "'speaker_3': 'Thank you. Jonathan or Kirsten. Does removing this clause from the exempted areas mandate that it be open or just give the option for it to be open? And what would then be that process for opening it? Who would it be up to?'",
        "'speaker_1': 'Alex Pearson. Take this. And she.'",
        "'speaker_0': 'Okay. We'll have Kirsten Crawford. Go ahead and respond.'",
        "'speaker_4': 'That evening. Council members. I am actually going to pull. The draft so it it carves out the five through eight carves out from open means requirements collective bargaining. My guess although I'm playing up the change is we we would maybe need to make some other.'",
        "'speaker_4': 'Changes if we wanted to mandate that it occur in open session. But I am looking at that. I wonder if you might want to table that question for a minute and let me come back to it just to make sure.'",
        "'speaker_3': 'And just to be clear, Kirsten, I'm not advocating that they be open, just wanting to make sure I'm understanding that what removing that exemption, what it does and it sounds like in that you can come back in a little bit with an answer, but I don't see any other questions in the queue.'",
        "'speaker_3': 'If I if it's removed without any other language, it doesn't automatically mandate that they're open without additional work put into the ordinance.'",
        "'speaker_4': 'Okay. So I'm looking at the language now. Any collective bargaining conference is not considered a meeting subject to these requirements, but I guess in order to get very granular about who's in the room and when it constitutes a meeting, I suppose we probably do need more clarity.'",
        "'speaker_4': 'Your your question is a very good one. And, and one I'm not totally comfortable just answering on the fly right now. I just need a little bit more time to think about that. But I think that you're right.'",
        "'speaker_4': 'My hunch after playing up the language is that it wouldn't mandate because we don't know exactly who would be the body, the public bodies, so to speak, that would need to be convened with respect to. And I'm backing my way into that, into the answer, because when we look at this code provision, we list the public bodies'",
        "'speaker_4': '. So for one, we don't list. What the definition of the body is for collective bargaining. So I suspect we might need a little bit more of definition if we wanted to mandate that.'",
        "'speaker_3': 'So just eliminating the that section. About collective bargaining doesn't mandate that it's open, but put it leaving it in mandates that it be exempted.'",
        "'speaker_4': 'It makes it very clear that it's not subject to our opinions without action.'",
        "'speaker_3': 'Yes. Okay. Got it. Thank you for that.'",
        "'speaker_0': 'Okay. Thank you. Councilmember Pro-Tem Torres, council member Abarca.'",
        "'speaker_4': 'Thank you. Just wanted to clarify that that Councilwoman Torres is the goal of the amendment. It's to not necessarily create the mandate at this point, but to remove that exception will allow us to decide later if we choose to mandate it or choose to outline a process of how that should work.'",
        "'speaker_4': 'But this is to make sure that we don't close the door on that option for later.'",
        "'speaker_0': 'All right. Thank you for that clarification. Council members say to Barca and now we have others back into the queue here. And so Council Member Torres, did you have a follow up or is that okay since you've been up to to move on?'",
        "'speaker_0': 'Okay. All right. Great. Thank you. New in the queue, then we have Councilmember Herndon.'",
        "'speaker_1': 'Madam President, I just want to echo what Councilwoman Sawyer said. I mean, she did a deliberate, thoughtful engagement process with stakeholders, and this amendment is anything but. So I will be voting no, and it is an ordinance so we can bring it back later if.'",
        "'speaker_2': 'We actually have a transparent process to.'",
        "'speaker_1': 'See how these changes would actually impact it. But to do this at the 11th and a half hour, I think is bad policy. So I'll be running. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Herndon. Next up, we have Councilmembers Sawyer and Flynn in the Q and I haven't heard from Councilmember Hines yet. And so I'd like to allow him to go. Go ahead, Councilmember.'",
        "'speaker_2': 'Thank you. Council President. I, I, I kept putting my hand up and down and it was probably because people kept asking the same question that I was intending to ask. So, you know, pro tempore, is this question about whether this is a mandate, I think is an important distinction.'",
        "'speaker_2': 'I know that I am not a member of the United Food and Commercial Workers, but I attended a bargaining session where you have S.W. did bargain with some with their employer. I also did attend bargaining for the Denver Classroom Teachers Association.'",
        "'speaker_2': 'And and so there are there are labor unions that do have a public process. And and and it seemed like that was more transparent. I do absolutely hear what Councilmember Sawyer said about how this we could have added this to the stakeholder process and and councilmember heard into but we did not and and so I just wanted'",
        "'speaker_2': 'to just throw out my my thought process. Thank you. Council President.'",
        "'speaker_0': 'Thank you, Councilmember Hines. Next up, we have council member Sawyer.'",
        "'speaker_4': 'Things about a president. I just wanted to quickly pop into weigh in again on this, that frankly, whether this is a good idea or or not a.'",
        "'speaker_3': 'Good idea.'",
        "'speaker_4': 'Isn't. What's up for discussion here? You know, what is up for discussion here is that we don't know what the consequences are. We haven't been out to the community to have a discussion about this. We haven't been in conversations with the the organizations that we bargained with to get their feedback on it.'",
        "'speaker_4': 'And so that's why we think it's irresponsible for us to make this change right now. Like I said, it's an ordinance that can easily be changed moving forward, and I'm happy to help engage the stakeholders to do that.'",
        "'speaker_4': 'If that's something Councilwoman CdeBaca wants to do. But I don't think it's appropriate to do that at this stage.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. Next up, we've got Councilmember Flynn.'",
        "'speaker_1': 'Thank you, madam. I just want to clarify and partially in response to Councilman Hines, that this amendment has literally nothing to do with opening up the actual bargaining sessions, with the with the unit, with the police, with the firefighters or with the sheriffs.'",
        "'speaker_1': 'It apply it simply removes the exemption for our meetings with the administration to discuss what our bargaining position will be when we go to the table. And for that reason alone, I think it's very bad public policy and it's not a necessary step to making a change to opening up bargaining sessions.'",
        "'speaker_1': 'At some later point, it's simply a bad move right now to signal and have Nick Rodgers sit in the room while we're negotiating, while we're discussing with the mayor how we want to bargain with the police. I don't think that's I think that's quite obviously on its face a bad policy.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Council member Flynn. Up next, council members say to Barker we have you back up.'",
        "'speaker_4': 'Thank you. Just wanted Kirsten to clarify, because I discussed this with her.'",
        "'speaker_5': 'That the collective.'",
        "'speaker_4': 'Bargaining conferences encompasses all of the collective bargaining according to what carers and confirmed for me when we had this discussion. So it's not just when we're deciding our positions, it doesn't it's not just about that. It's about collective bargaining in general as public meetings.'",
        "'speaker_4': 'Kirsten, can you confirm or clarify?'",
        "'speaker_1': 'Kirsten had to step away. So I'm able to speak on that. I need to be back with her to further discuss this. But that is not the way that I read this.'",
        "'speaker_2': 'It's exactly what counts. But one step. This is about internal conferences.'",
        "'speaker_1': 'But we would need to circle back.'",
        "'speaker_2': 'She obviously has a wealth of knowledge on the subject, but that is not the way that I read it.'",
        "'speaker_0': 'So. Okay, I'll go ahead.'",
        "'speaker_4': 'Never mind. Go for it.'",
        "'speaker_0': 'I was just going to I was going to ask Councilmember CdeBaca if she was had anything more to add. Okay. All right. Thank you. Next up, Councilmember Flynn.'",
        "'speaker_1': 'Thank you, Madam President. And, too, I'm going to take on what John Griffin just said. The collective bargaining sessions themselves, the ones that John and Rob Ness for go into the room with unions are not subject to in the open meetings.'",
        "'speaker_1': 'There goes my clock again. Not subject to the open meetings. Requirements are in our code in the first place. So this removing this exemption does has absolutely nothing to do with that. It's simply this paragraph that it would be deleted by this amendment simply refers to our conferences with the administration on our strategy going into those bargaining'",
        "'speaker_1': 'sessions. So that's that's why I think it's bad public policy. I don't want them in the room when we're trying to hash out what we're going to offer them and what our alternatives might be.'",
        "'speaker_0': 'All right. Well, thank you. Councilmember Flynn and I haven't weighed in yet on this. And then we'll go ahead and do the roll call, vote on it. Councilmember CdeBaca, you still had your hand up. Did you have. Okay.'",
        "'speaker_0': 'All right. Great. I'll go ahead and weigh in. Geez. Have been working on this since last July when I was elected as city council president, really trying to shore up this process. And we created initial guidelines that we sent over to all of you that you've reviewed.'",
        "'speaker_0': 'And then, in addition to that, have worked since January to develop a memorandum of understanding with the administration as well, outlining what the steps would be if we got to an impasse at any point during this process. And honestly, having worked very closely with Jonathan Griffin as our council representative.'",
        "'speaker_0': 'I'm not sure how we would strategically be successful in our bargaining if we had it open at this point in time, because I don't believe that we have heard from all of the many different stakeholders that we would need to talk to about how this would actually get set forth.'",
        "'speaker_0': 'And so I am of the mindset, if it is something that is the will of a majority of this body, we can definitely do that stakeholder process and open this ordinance up and address it at the appropriate time.'",
        "'speaker_0': 'And so I will not be supporting either one of the amendments this evening as well. Madam Secretary, roll call on the First Amendment we have. And to clarify, this amendment eliminates the exception for collective bargaining conferences. Roll call, please.'",
        "'speaker_3': 'CdeBaca, I. Claire?'",
        "'speaker_1': 'No. Flynn No. HERNDON No.'",
        "'speaker_2': 'HINES No.'",
        "'speaker_4': 'Cashmere?'",
        "'speaker_1': 'No.'",
        "'speaker_3': 'Can each.'",
        "'speaker_4': 'No.'",
        "'speaker_3': 'Ortega? No. Sandoval No. So here now. Torres? Nope. Black. No. Madam President.'",
        "'speaker_0': 'No, Madam Secretary, close the voting and announce the results, please.'",
        "'speaker_3': 'When I 12 name.'",
        "'speaker_0': '12 nays. The amendment to 20 1-0572 has failed. Council members say to back your second motion to amend, please.'",
        "'speaker_4': 'Thank you. I move that council bill 20 1-5 72 be amended in the following particulars on page five line one strike means and replace with means and recordings of meetings shall be posted on the city's website.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you. We have it moved and we have a second by Councilmember Hines. Questions or comments by members of council. Council members say to Barker.'",
        "'speaker_4': 'Thank you. This amendment requires all virtual meetings subject to this ordinance to be archived on the city's website. I think that's important because not all open meetings are archived, and with the many meetings that are occurring, sometimes the residents have to choose which ones they attend and they should be able to go back and watch the ones'",
        "'speaker_4': 'that they couldn't attend in person and archiving would enable that ability.'",
        "'speaker_0': 'Thank you. Next up, we have council member Sawyer.'",
        "'speaker_4': 'Mr. President, just wanted to weigh in here to just say again, with the stakeholder in process, we haven't had a conversation with tech services about what archiving that kind of information might look like, what storage space we would need to pay for, how much it would cost, whether we would need to have FTE is added to mail'",
        "'speaker_4': 'in something like this, etc.. So again, while I think it might not be a bad idea at some point in the future, it's not something we discussed in this process and it is something that we need to reach out to our stakeholders and find out more information about before we can responsibly vote on something like this.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_0': 'Thank you. Council member Sawyer. Up next, we have Council Member Hines.'",
        "'speaker_2': 'Thank. Thank you. Council President. I think that I certainly agree with the spirit of this amendment that we should have recordings for for everything that's that is a part of our city process. With I also am somewhat concerned about the stakeholder process.'",
        "'speaker_2': 'I know when I served on the Denver Commission for People with Disabilities, the it was difficult to find a venue. The Webb building changed some of the requirements for having holding meetings in the Webb building. We ended up finding a space in the Denver Museum of Natural Science next to a yoga session, a regular, you know, monthly'",
        "'speaker_2': 'yoga or at least monthly, that every time we were meeting there was yoga immediately outside. And, you know, I don't know how we would have necessarily met the requirement for open meetings in that venue. Maybe it's possible. I don't know.'",
        "'speaker_2': 'And I don't want the Commission for People with Disabilities to be unable to meet because they have to meet this regulatory hurdle. Maybe they could. Maybe they couldn't. But again, I think that's what the stakeholder process would do.'",
        "'speaker_2': 'Thank you. Council president.'",
        "'speaker_0': 'Thank you. Councilmember Hines. Councilmember Flynn.'",
        "'speaker_1': 'Madam President, I like this amendment very much. But like Councilman Sawyer, I think it needs a little bit more data behind it so that we can understand the costs. I would like to see it. I'd like to see this come forward at some point as an amendment to this part of the code.'",
        "'speaker_1': 'But I'd like to know, for instance, everybody that I've tried to see, recordings of meetings I've been able to find. So I know that we already archive a lot of them. I don't know what is not being archived.'",
        "'speaker_1': 'So maybe, Councilwoman CdeBaca, we could work together to figure out who isn't reporting and and why not, and can we get them to do that? I think it's an excellent resource that we do need to provide. I don't know that it's soup yet to put it in this up, to amend it into this ordinance.'",
        "'speaker_1': 'But I'd like to come back and have that done, for instance, if I can ask Councilwoman CdeBaca. Madam President, do we know? Would this applied to in-person meetings that are not broadcast on Zoom once we go back to in-person, if there is simply meeting in a in a room in the web building and it's not broadcast on'",
        "'speaker_1': 'Channel eight, where are you talking about? Like audio recordings of meetings and things like that as well. So to do.'",
        "'speaker_4': 'That, that would actually make sense. I think through COVID, what we've recognized is the potential of always having this alternative for for a virtual participation. And we know that it's easier to listen to a meeting than it is to read the meeting minutes.'",
        "'speaker_4': 'And so in 2021, I think that we should always default to recording meetings, whether it's a zoom recording or a voice recording that gets uploaded somewhere. It just makes more sense to have that as the standard rather than just your written minutes.'",
        "'speaker_1': 'Thank you. Madam President, I agree. And I think perhaps we could ask our staff to gather the data on what boards and commissions that are listed in this ordinance, and there's a ton of them. What is their current practice?'",
        "'speaker_1': 'Do they record now? If they do, do they archive it? Do they make it available on the website? I think that's that's something we should pursue immediately after this. But I don't think that we should put it in the code right now because we don't have the answers to these questions.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilmember Flynn. And, you know, would be open to learning more about that, but likewise, would like to see that stakeholder process so that we're making sure we understand the intended and unintended consequences of our actions and we not seeing anybody else up in the queue.'",
        "'speaker_0': 'Madam Secretary, roll call on the Second Amendment, which would require all virtual meetings subject to this ordinance to be archived on the city's website.'",
        "'speaker_3': 'CdeBaca, I. Claire?'",
        "'speaker_1': 'No. Flynn No.'",
        "'speaker_3': 'Herndon?'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'HINES No.'",
        "'speaker_3': 'Cashin?'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'Kimmich? No. Ortega. No. Sandoval.'",
        "'speaker_4': 'No.'",
        "'speaker_3': 'Sawyer. No. Torres now. Black? No. Madam President.'",
        "'speaker_0': 'No. Madam Secretary, closed the voting and announce the results.'",
        "'speaker_3': 'When I tweeted this.'",
        "'speaker_0': 'When I 12 nays the second amendment to 20 1-057 excuse me 0572 has failed council bill 20 1-057 to is currently on the floor for publication. Questions by members of Council on Council Bill 20 1-057 to. CNN. Madam Secretary, roll call on Council Bill 21, dash 057 to please.'",
        "'speaker_3': 'Black. I. See tobacco. I. Clark.'",
        "'speaker_2': 'All I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_2': 'I. Hi. Hi.'",
        "'speaker_1': 'Cashman and I.'",
        "'speaker_3': 'Can each write. Ortega like Sandoval, I. Sawyer. I mean Torres. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_3': '30 nights.'",
        "'speaker_0': '13 Eyes Council Bill 20 1-0572 has been ordered published. All right. Next up, we have Council Bill 516. Councilmember Flynn, would you please make a motion to take Council Bill 516 out of order, please?'"
    ],
    "Rezoning of 10353 East Mississippi Avenue from B-1 to S-MX-3.": [
        "'speaker_0': 'Council Member Flynn Will you please put Council Bill four or four on the floor for final passage?'",
        "'speaker_1': 'Yes, I will think about present. I move the council bill 20 1-20404 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 404 is open. May we please have the staff report? And I believe we have it here.'",
        "'speaker_8': 'Yes. Hello? Can you hear me all right?'",
        "'speaker_0': 'Mm hmm.'",
        "'speaker_8': 'All right. I will pull up. My presentation. All right. Thank you very much. I'm Ellis TV, and I am here to present the proposed rezoning at 1035 three East Mississippi Avenue. All right. So we are in Council District five in the Windsor neighborhood.'",
        "'speaker_8': 'The subject property is on Mississippi Avenue between Geneva and Havana, just north of Arapahoe County. It's a little less than two acres and has a vacant drive thru ATM. The proposed rezoning is to annex three, so the suburban neighborhood contact's mixed use up to three stories and that is to facilitate redevelopment of the site as an x'",
        "'speaker_8': 'three allows a mix of users including light automobile services with limitations. So before we jump into existing context, I want to touch on a little background on rezoning requests on this site. So this application is the third rezoning application that CPD has received on this site.'",
        "'speaker_8': 'The first was in 2018. At that time, the previous version of Blueprint was the adopted plan. Guidance Staff recommended approval and planning board recommended denial. The applicant withdrew. The second was in 2019. This time, under the current version of Blueprint, staff, recommended approval and planning board had a split vote of 3 to 3, meaning that the board'",
        "'speaker_8': 'made no recommendation. The applicant withdrew shortly before the city council hearing. After withdrawing that second time, the applicant, the property owner and the neighbors began mediation, which I'll touch on again later in this presentation. So the current zoning is B one with a condition which I'll talk about on the next slide.'",
        "'speaker_8': 'Be one is a former Chapter 59 Limited Office district intended to form a transition between more intense commercial and lower intensity residential land uses. Other than banking and financial services, retail uses are not permitted. It's adjacent to Sue I and Max five and then Arapahoe County to the south.'",
        "'speaker_8': 'So the condition of the zoning is to adhere to the 1993 site plan, which allows for eight drive thru ATM stalls surrounded by surface parking and landscaping. So that means that without a rezoning on this site, the only allowed use is the auto oriented ATM service that is no longer needed by the adjacent bank and therefore vacant'",
        "'speaker_8': '. So the land use map here says commercial. But as I just said, it is vacant and it's adjacent to a single unit, residential and commercial uses. So the third image down outlined in red shows the subject property on Mississippi Avenue.'",
        "'speaker_8': 'And the other three images are some residential and commercial buildings nearby. The Planning Board voted 5 to 3 to recommend approval of this rezoning on April seven. So the applicant, the property owner and the neighbors were in mediation from May 2020 through March 2021.'",
        "'speaker_8': 'While all parties were able to come to agreement on almost all issues, they were not able to reach agreement on operating hours. This impasse in the discussion effectively ended the mediation with no agreement in place, and the mediation summary is included as an attachment to the staff report.'",
        "'speaker_8': 'So on the application is before you. Today we received 16 letters to and support from Holland and Hart attorneys representing Belco Credit Union and 14 letters in opposition to from attorneys representing the neighborhood organization and the remaining 12 from neighboring residents.'",
        "'speaker_8': 'We also received a letter from the Range View Neighborhood Association with 97 signatures in opposition to the rezoning and the proposed redevelopment, stating that the request is not consistent with adopted plans and the site should become residential. These issues raised focus on the impact of on the residential character of the surrounding area traffic and environmental and health'",
        "'speaker_8': ', concern over a gas station and a convenience store next to a residential area. We know that it is hard to separate the rezoning from a potential project, but that's exactly what our analysis calls for. We're not looking at a specific development proposal.'",
        "'speaker_8': 'We're looking at whether the proposed zone district meets the review criteria. So as the staff report detailed, our analysis found that the proposed max three zone district is consistent with the review criteria as a mixed tourism mixed use district that is intended to provide a transition to lower intensity uses such as single unit, residential traffic and environmental'",
        "'speaker_8': 'issues are addressed through different processes separate from rezoning. We also heard concerns over questions whether there were other zoned districts that would be more appropriate on the site. But as part of the official rezoning application, staff evaluate only the zone district that an applicant lists on their application.'",
        "'speaker_8': 'Okay, so now we can jump into the review criteria. So we have just the two citywide plans to to review in this location. So the proposed map amendment is consistent with several strategies from Comprehensive Plan 2040 listed here and detailed in the staff report.'",
        "'speaker_8': 'In Blueprint 2019. The future neighborhood context is Suburban, which has the most varied development in Denver's neighborhoods. It is largely single unit, but also higher intensity residential and then commercial development focused along main corridors and centers bordering these residential areas.'",
        "'speaker_8': 'The future place of this area is called Community Corridor, which typically provides some mix of office, commercial and residential in heights of generally up to five stories. Mississippi Avenue is a residential arterial, so arterials are designed for the highest amount of three movement blueprint lists, small retail nodes and other similar uses as appropriate uses adjacent to residential'",
        "'speaker_8': 'arterials. According to the Blueprint Growth Strategy, the site is within community centers and corridors. These areas are anticipated to see 25% of new housing growth in 20% of new employment growth by 2040. The proposed MAP amendment to S-Max three will focus low scale, mixed use growth in a community corridor in an appropriate context, which blueprint identifies as'",
        "'speaker_8': 'an AI done as a intended location for this kind of growth. Blueprint also has policy language around rezoning properties from the former Chapter 59 zoning code and out of custom zoning such as the site plan specific condition on the subject property.'",
        "'speaker_8': 'Therefore, staff found that the proposed rezoning is consistent with Blueprint Denver. Their proposed rezoning will result in uniform application of district building, form, use and design regulations, and it furthers public health, safety and welfare through the implementation of adopted plans.'",
        "'speaker_8': 'The current zoning allows only a drive thru ATM and proposed ATM. X-ray facilitates increased density in a variety of building forms. This analysis considers the proposed as an three district not a specific development proposal. That said, we have heard residents concerned about the location of gas tanks as permitted by some x three.'",
        "'speaker_8': 'Those tanks are regulated by the Department of Public Health and Environment and the Fire Department rules to ensure public safety. This rezoning would bring the property out of a former Chapter 59 zoning into the Denver zoning code. And such a change is listed in the zoning code as an appropriate, justifying circumstance.'",
        "'speaker_8': 'Be requested secretary is consistent with your neighborhood contacts description the under strict purpose and intent. So based on finding all review criteria have been met. CPD recommends approval. Thank you and I will stop sharing my screen, but I am happy to reshare later on if it would be helpful to have some visual.'",
        "'speaker_8': 'But first I have to get my computer to let me do that.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Very good. Thank you. I appreciate it. Tonight, counsel has received six written comments on Council Bill 404. There are no submitted comments in favor of the application and six submitted comments in opposition of the application. All members of Council that are present have certified that they've read each of the submitted written comments.'",
        "'speaker_0': 'Do members do any members need more time to read all of the written testimony that was submitted? Scene one. Council Secretary, please let the record reflect that all written testimony, both in favor and in opposition of Council Bill 404 has been read by each member of Council and all written testimony will be submitted to the official record'",
        "'speaker_0': 'of the hearing. And this evening on Council Bill 21, Dash 404, it looks like we have 19 folks signed up to speak this evening, and so we will go ahead and get started here. And our first speaker is Bethany Gravel.'",
        "'speaker_4': 'Hello. I'm here on behalf of Belco credit union. I am available for questions.'",
        "'speaker_0': 'All right. Thank you, Bethany. Our next speaker this evening is Jim Irwin Sobotka.'",
        "'speaker_2': 'Same as Bethany. I'm here on the Belco team and available for questions as well.'",
        "'speaker_0': 'All right. Very good. Thank you, Jim. Our next speaker is David or Mancini. Or I'll let you go ahead and correct me, David, on your last name spelling. Your last name pronunciation. You can go ahead with your comments, David.'",
        "'speaker_5': 'All right.'",
        "'speaker_0': 'We'll get David into the queue here. Call them on the phone. It seems like. There you go, David.'",
        "'speaker_1': 'I also.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_2': 'With your phone. Yes, my name. My name is David Maroney, and when I signed up, I also hit.'",
        "'speaker_1': 'The box that I'm available to answer questions for the Belco team. And the speaker for us is actually Doug Kirby with Belco. If he should be on your list.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'All right. Yep, he is. Thank you, David. All right. Our next speaker this evening is Jeff Wieder.'",
        "'speaker_2': 'I'm going to stay with that same trend. I'm with Delko here to answer any.'",
        "'speaker_5': 'Questions you may have.'",
        "'speaker_0': 'All right. Thank you. Our next speaker is Terrell. Coral.'",
        "'speaker_1': 'Thank you. This is Terrell Gural. I'm the attorney for BALCO here. Ready to answer questions.'",
        "'speaker_0': 'All right. Thank you for being here with us. The next speaker is Doug Kirby. If you want to. Go ahead, Doug. Oh, there you go.'",
        "'speaker_2': 'There we go. Hello? Can you hear me? Mm hmm.'",
        "'speaker_0': 'We can. We can.'",
        "'speaker_3': 'Just. Good evening. I'm Doug Kirby, vice.'",
        "'speaker_2': 'President, business, technology and Administration at Belco Credit Union. Thank you for this opportunity to speak with you tonight. Belco was founded in Denver in 1936. Today we have over 345,000 members with the majority living and working in the Denver metro area.'",
        "'speaker_2': 'Giving back to our community is top priority for Belco, which is showcased through our partnerships with the Latino Leadership Institute, the Denver Art Museum and Denver St Patrick's Day Parade. Our property of 10353 Mississippi has sat unused for the past five years because our current zoning only allows us to build and operate a 24 hour, eight lane'",
        "'speaker_2': 'drive thru banking facility, which is now an obsolete use for the site. Without rezoning, this location would remain unused and unproductive. Our application strictly adhere to the direction of Blueprint Denver 2019 and the Comprehensive Plan 2040, and we have the support.'",
        "'speaker_3': 'Of planning, board.'",
        "'speaker_2': 'And city staff.'",
        "'speaker_3': 'In pursuing estimates three zoning.'",
        "'speaker_2': 'We're simply asking for the same zoning regulation and opportunity afforded other commercial properties across the city. We've been engaged in.'",
        "'speaker_3': 'Mediation with the range.'",
        "'speaker_2': 'Of your community for over a year, and we're successful in finding numerous areas of agreement. For example, the neighborhood asked and we agreed that there be no access to the site from Geneva. The neighborhood asked, and we also agreed to use neutral colors on the building exterior facing north and west neighborhood, asked for substantial and important buffers'",
        "'speaker_2': 'for the neighboring properties. We agreed to maintain 50% of the property as landscaped open space. We agreed to plant mature trees, install landscaping berms and screening walls. And we committed to maintain our high standards for site site maintenance and landscaping.'",
        "'speaker_2': 'After Planning Board vote to recommend approval of the application before you tonight at the recommendation of Planning, board members Belko and Murphy, USA reach back out to arrange you. In an earnest effort to find agreement on hours of Operation Range, you had requested operating hours of 6 a.m. to 10 p.m., which Murphy could not commit to.'",
        "'speaker_2': 'However, Murphy did agree.'",
        "'speaker_3': 'To greatly shorten.'",
        "'speaker_2': 'Their original request to 4 a.m. to 1 p.m. by 3 hours per day, now offering 5:30 a.m. to 11:30 p.m.. Similar to various businesses.'",
        "'speaker_4': 'Operating within.'",
        "'speaker_2': 'This community. Please know that Belco is also a neighbor to this site. We've been in business at this location for over 25 years. We chose to partner with Murphy because of their outstanding record of safety and security. Like Belco, they're committed to giving back to our community through their partnerships with Boys and Girls Club and United Way'",
        "'speaker_2': '. We ask for your fair consideration of this rezoning request on the merits of compliance with all plan guidance consistent with six lane are through your corridor staff and planning board recommendations for approval. I sincerely thank you for this time this evening.'",
        "'speaker_0': 'Thank you, Doug. Our next speaker this evening is Lawless Jackson. And if I mispronounce your first name, go ahead and correct me. It's okay. Go ahead.'",
        "'speaker_3': 'Can you hear me? Thank you. Can you hear me?'",
        "'speaker_0': 'Yes, we can.'",
        "'speaker_3': 'Okay. My name is Lawless, A.C. Jackson, and I'm here with my husband, James Allen Jackson. We live at 920 South Elmira Street in Denver, Colorado, 80247. We live I mean, we're against the rezoning request for 21 404 before you this evening because we felt this would not be the best and highest use of the property.'",
        "'speaker_3': 'It would, number one, it would adversely affect the property values it immediately abutting the property in our name and our neighborhood. Number two, we suspect there to be potential for harm to the water supply in our area. We, as do many of the neighbors, in fact, have wells which we rely on for our domestic water and irrigation'",
        "'speaker_3': 'use. I do not want to see any increases in toxins in the water table in this area. Number three, there's no need for an additional gas station at the site as there are at least three within one block radius.'",
        "'speaker_3': 'And we already have a new Murphy station, in fact, at Parker and Iliff, which is perfect. It does not abut any residential properties. Number four added exhaust fumes will generate in such a concentrated location, such as ours will adversely impact the quality of the air we breathe and may lead to increased disease and sickness due to carcinogens'",
        "'speaker_3': 'in our air. Additional emissions in our air are not what we need. The intersection of Mississippi Avenue and Havana expr extremely congested with traffic and we simply do not need high traffic business at this location. The traffic levels would increase unnecessarily, leading to increased speed through our neighborhood, which is already horrendous.'",
        "'speaker_3': 'There are plenty of locations where a new gas station can be built. This is not one of them. I do also want to speak directly to the rezoning request. I know that this is a rezoning request, but we but we believe that if this rezoning request is approved, then it opens the door for the intended purpose.'",
        "'speaker_5': 'Of the sale from.'",
        "'speaker_3': 'Belco to Murphys of a gas station. And so that's what we are here to prevent. Thank you.'",
        "'speaker_0': 'All right. Thank you for your comments this evening. Our next speaker is an architect. And please, Aaron.'",
        "'speaker_2': 'Hi there. Can you hear me?'",
        "'speaker_0': 'Mm hmm. Go ahead.'",
        "'speaker_2': 'Okay. Thank you. My name is Aaron Atkinson. I represent the Range View Estates Association, which is a registered R.A. directly adjacent to this particular property. I just wanted to touch on a few of the points that I made in my correspondence, which you sent in on behalf of the association who objects to this particular application and urges'",
        "'speaker_2': 'the Council to deny it. The reason is that the applicant has failed to present sufficient evidence that this, should the use of this parcel, should be dramatically increased in intensity and the two tenants from the zoning code that should be particularly noteworthy to council or division 3.3 of the different zoning code, which states that the development application'",
        "'speaker_2': 'must improve the compatibility with existing neighborhoods. The second is Article three that states stating that the development application should improve the transition from commercial to residential. Given what you have seen in the protest petition and you will hear in the testimony tonight, this these two elements have been failed by the application.'",
        "'speaker_2': 'Regarding compatibility. The existing use is simply a more compatible use given the situation in the location of this parcel. This parcel abuts range view. Single user homes on two sides. Which means that it is essentially the last gate between the more intense uses at Mississippi and Alabama to the very residential single user homes to the west of'",
        "'speaker_2': 'this parcel. So to allow this the zoning of this particular parcel to be dramatically increased in intensity to S-Max three is incompatible with those residential uses directly to the West. The fact is that to change from be one with conditions as it had been used by belco to a a use that can be 24 hours in nature'",
        "'speaker_2': 'is simply too much on this adjacent neighborhood and it does not improve the transition between those two uses. In fact, it defeats it. At this point, you would only highlight the stark differences between the highly intense commercial uses of the East Side with the highly residential uses to the West.'",
        "'speaker_2': 'And it would serve it would be a disservice to that community greatly. The existing application has to show they meet the Blueprint Denver and the comprehensive plan and it has failed that both the authenticity of neighborhoods point regarding the modes of transportation as well as the climate aspects of the comprehensive planning blueprint.'",
        "'speaker_2': 'Denver The applicant can't simply rely on the fact that this was governed by Chapter 59. To succeed, they have to prove that they meet these other criteria, but they fail to do so. So on behalf of my client ranch, you request that you deny this application.'",
        "'speaker_2': 'And thank you.'",
        "'speaker_0': 'Thank you. Our next speaker this evening is James Jackson.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'This is James Jackson. I'm at 920 South Elmira Street. I listen to Aaron and I listen to my wife and they pretty much made my same point. So I don't think I need to add anything to it. Thank you for taking the time to listen to us.'",
        "'speaker_1': 'Have a good day.'",
        "'speaker_0': 'All right. Very good. Thank you, Mr. Jackson. Appreciate it. Our next speaker this evening is Peggy Stall.'",
        "'speaker_3': 'Can you hear me?'",
        "'speaker_0': 'Hello. You can go ahead. Taking.'",
        "'speaker_8': 'Okay. I'd just like to thank you for this opportunity to speak with you tonight. And, um, I live directly behind this area where they want to rezone it to fmx3.'",
        "'speaker_3': 'And I have a few reasons why. I'm a nurse. I work at night. And for this a busy of an area.'",
        "'speaker_8': 'Because Murphy Gas Station wants to buy purchases. Gas stations are known for not being quiet and we have to sleep during the day, which leads to challenges on the sound. And the noise of a gas station would be very make it very difficult to sleeping.'",
        "'speaker_8': 'Another thing that really bothers me about having a gas station in my backyard, basically, is the odors that it would bring. And there's nothing you can do that can take the stench away like trees or a fence or a wall or anything.'",
        "'speaker_8': 'The stench of the gas station is bad, and Geneva Street is not set up for extra traffic. That would come with busy business.'",
        "'speaker_3': 'Such as a gas station or the S-Max three.'",
        "'speaker_8': 'There's no continuous sidewalk on this street and we see many people walking and riding bikes in which heavy traffic would put these people at risk for accidents. And I urge you to vote against this at and sorry, x three.'",
        "'speaker_8': 'Thank you for letting me speak.'",
        "'speaker_0': 'Thank you, Peggy. Our next speaker this evening is Maria AusLink. Go ahead. My name's Mia.'",
        "'speaker_8': 'My name's Maria Aisling. I live on Geneva Street. My husband built our home in 1986. I'm in Aurora, but where the sidewalk.'",
        "'speaker_3': 'Ends.'",
        "'speaker_8': 'In front of my house starts Denver. This proposed gas station will literally be in people in my neighbor's backyards. We have residents.'",
        "'speaker_3': 'From Windsor Gardens.'",
        "'speaker_8': 'That come through on in.'",
        "'speaker_3': 'Wheelchairs, scooters, bicycles and walking to.'",
        "'speaker_8': 'Pick up their groceries from King Soopers. We have no sidewalks continuing on Geneva, and it would put their lives at risk. We lost a senior citizen earlier this year on Havana and exposition.'",
        "'speaker_3': 'He was on a bicycle.'",
        "'speaker_8': 'And yeah, there's no. No sidewalks past my house. That's where it stops.'",
        "'speaker_5': 'This would put them at risk because.'",
        "'speaker_3': 'This will bring more vehicle.'",
        "'speaker_8': 'Traffic to our neighborhood. Please, if you wouldn't put a gas station in your backyard.'",
        "'speaker_3': 'Please don't put one in our.'",
        "'speaker_0': 'Thank you. Thank you. Our next speaker this evening is Pamela EADS. We're going to have to have you go ahead and meet yourself, Pamela. All right.'",
        "'speaker_3': 'There you go. Can you hear me now?'",
        "'speaker_0': 'Yeah, we can. Go ahead. Thanks, Pamela. Thank you.'",
        "'speaker_3': 'My name is Pamela EADS, and I live in a wonderful, unique and diverse neighborhood called Range View States, which encompasses both Denver and Aurora. I want to let you know that I am not against development and I would support a compatible use for this property.'",
        "'speaker_3': 'However, this particular s-max rezoning and gas station use is not a compatible use next to a neighborhood which this property abuts on two sides. Nor does it promote our quality of life in any way. I do not understand why this business use has been repeatedly suggested for this property.'",
        "'speaker_3': 'This is the third time we've been faced with this type of development, which would not be something anyone would deem a desirable neighbor. I urge you to vote as if you're living right next door to this property. Vote no on this particular development and rezoning change.'",
        "'speaker_3': 'There must be a better use so we can all figure out for this redevelopment one that would be beneficial for both business and residents. Please keep range view a place where people want to live and enjoy their lives.'",
        "'speaker_3': 'This incredible neighborhood is one of the most unique places in Denver. Thank you for your time and careful consideration of this issue, which is very important to your neighbors.'",
        "'speaker_0': 'Thank you. Our next speaker is Keith Singer.'",
        "'speaker_2': 'Thank you. Thank you. Counsel Thank you. Cohen Murphy In the process, I'm the vice president of the R.A. I also live at 923 South Geneva Street and the range view neighborhood in the Aurora side. Perfectly clear we are not opposed or ever have been opposed to development.'",
        "'speaker_2': 'That's never been the issue with us. We've had a great relationship with Murphy and all we're looking for is something that would act as a transition. Why they put the bank on the corner, which is where the gas station should go and why we have the busy thing by the residents.'",
        "'speaker_2': 'I don't know. It doesn't matter. That's the way it is. I'm going to go off roading here and I may be a little bit weird in talking and I apologize, but my mother died last night and I'm here.'",
        "'speaker_2': 'But one of the things that happened in the process of that was over the last six months, we wanted to keep my mom at home. Why? Quality of life. What did we do? We had to fight with hospice.'",
        "'speaker_2': 'We had to fight with nurses. We had to fight with a bunch of people in order to have quality of life. And what does that mean?'",
        "'speaker_9': 'That means being at home. That means being able to.'",
        "'speaker_2': 'Celebrate the moments that you have every day, whether it's barbecues, kids playing and so forth. And. Putting a gas station next to your house. I sent pictures over and I hope you've got them. We're talking of there's a house.'",
        "'speaker_9': 'That their backyard is 15 feet from the property.'",
        "'speaker_2': 'Line.'",
        "'speaker_9': 'That's not quality of life. And quite frankly.'",
        "'speaker_2': 'Tonight is what you're voting on is our quality of life.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_2': 'There's a statement and I'm going to say it's a quote. Nobody likes to or wants to live next to a gas station. Now, you would expect us to say that. The truth is, it came from your board, your planning board member during taken from the transcripts of the public hearing.'",
        "'speaker_2': 'The same board member continues. Maybe we should take a hard look at our zoning districts and how they defined areas like that. Another board member said, quote, There's no part of me that would want to see a gas station in this location, unquote.'",
        "'speaker_2': 'And continues with, quote, I really hope that that that there will be a different use on the site period. Another board member also said in the same meeting and these are from the transcripts. Does there need to be a change to the zone district's question mark?'",
        "'speaker_2': 'We think there does. This is not right. You shouldn't have to do this. We should be able to do something that works for everyone and we're willing and, you know, stepping up, we will work with Belco to come up with something that works.'",
        "'speaker_2': 'Okay. Our future is in your hands. Vote like you live here. Vote like your family lives here. Vote for quality of life. Vote no. And give us an opportunity to do something that is much better for all parties.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Keith. Our next speaker this evening is Joni Larimer.'",
        "'speaker_3': 'Hello. My name is Johnny Lerma. I live at.'",
        "'speaker_4': '1010 South Geneva Street.'",
        "'speaker_3': 'I am right behind the bank.'",
        "'speaker_4': 'One thing I.'",
        "'speaker_3': 'Didn't like about the.'",
        "'speaker_4': 'Proposal was the the pictures. If they took accurate pictures for the proposal, you would have seen my trampoline and playground in the backyard there right next to the fence, because it's a safe place right now.'",
        "'speaker_3': 'And as a good neighbor.'",
        "'speaker_4': 'I look out for my neighbors, kids.'",
        "'speaker_3': 'When they come over and play, which happens multiple times a week. And I don't feel that.'",
        "'speaker_4': 'Close actually caring for the children in our community because they want to do this X and x three. And really, there is.'",
        "'speaker_3': 'The gas station and you could.'",
        "'speaker_4': 'Talk about it being other things that there is the.'",
        "'speaker_3': 'Gas station and that's their goal. If it was maybe a five story building, I would say the same thing. I appreciate what he was.'",
        "'speaker_4': 'Saying about the quality of life.'",
        "'speaker_3': 'I want my son to be able to play.'",
        "'speaker_4': 'Without worries of having someone come over to this fence and talk to him. Right now we know like the bank is pretty secure their security there.'",
        "'speaker_3': 'I'm not worried about my child safety right now and I don't want to have to be. And then just it.'",
        "'speaker_4': 'Has been touched on. Our neighborhood doesn't have continuous sidewalks. I know my son will go out, will go out bike riding and stuff and take walks or just really walk just really walk on the street and are relying on people's goodness in their driving.'",
        "'speaker_4': 'But when you bring in like other people.'",
        "'speaker_3': 'From not in the neighborhood.'",
        "'speaker_4': 'That won't be the case. And so it's really a safety issue, too, about bringing people about safety of this poor man dying.'",
        "'speaker_3': 'So that is all I have to say.'",
        "'speaker_0': 'All right. Thank you, Johnny. Our next speaker this evening is William Friedman.'",
        "'speaker_2': 'Hi. Can everybody hear me?'",
        "'speaker_0': 'Mm hmm. Go ahead.'",
        "'speaker_1': 'All right, great. So I believe I'm the.'",
        "'speaker_2': 'Newest member in the neighborhood. I actually purchased our.'",
        "'speaker_1': 'Home at 1051 South Geneva on April 15th of this.'",
        "'speaker_2': 'Year and.'",
        "'speaker_1': 'Moved in on May 15th of.'",
        "'speaker_2': 'This year.'",
        "'speaker_1': 'Shortly thereafter, a one of my neighbors came to our.'",
        "'speaker_2': 'Door and told me, you.'",
        "'speaker_1': 'Know, the lot directly across Geneva from your property, across your front lawn, there are plans to turn it into three zone it.'",
        "'speaker_2': 'And they had insight that I did not have previously.'",
        "'speaker_1': 'They're planning on putting in a gas station in there. Had we known that that was the plan, we would have significantly offered a different amount of money. We would have significantly looked at the area a little bit more.'",
        "'speaker_1': 'And I you know, I'm speaking incredibly informally. I was not as prepared as everyone else. I would like to echo what.'",
        "'speaker_2': 'Keith Singer said.'",
        "'speaker_1': 'What the Jacksons said.'",
        "'speaker_2': 'And I would just like to read.'",
        "'speaker_1': 'A couple of statistics I did in one hour of research about the health.'",
        "'speaker_2': 'Concerns.'",
        "'speaker_1': 'Of living within 500 feet of a gas station. Mind you, I'd live less than 50 feet from gas station. I'm sitting in my home office right now.'",
        "'speaker_2': 'Which overlooks my front lawn. There's the street, and then there's the lot.'",
        "'speaker_1': 'There's nothing in the way right now. If there is a gas station across the street, my family has an eight times increased risk of developing cancer. According to the Colorado School of Public Health, a study done in 2018, there's ten times the amount of benzene is released compared to previous estimates.'",
        "'speaker_2': 'That was.'",
        "'speaker_1': 'These estimates were used to create EPA guidelines.'",
        "'speaker_2': 'On where gas stations can.'",
        "'speaker_1': 'Be. Let's see. And I'm sorry if I'm kind of rambling. I was not as.'",
        "'speaker_2': 'Prepared as everyone else. Leaking fuel tanks.'",
        "'speaker_1': 'Incredibly common. And the venting of these fuel tanks happens at night. When I'm at home, my fiancee is at home. We would be breathing this air. It is incredibly, incredibly problematic to our health. Gosh, I just you know, I'm I'm incredibly concerned about the opportunity or the potential of a gas station going in directly across the street'",
        "'speaker_1': 'from my first home that we bought together. I urge you and beg you to really consider and vote as though you live in this neighborhood because it is you know, our lives are at risk and we're not against development, as everybody said.'",
        "'speaker_1': 'I would love for there to be stores, shops, whatever over there. Just not something that impacts my health negatively. Thank you. Have a great night.'",
        "'speaker_0': 'Thank you. Our next speaker is Don Stal. We'll have you. Go ahead and McDonald. There you go.'",
        "'speaker_1': 'Ahead. Yes, I'm at 1010 South Geneva Street. We live right next to the proposal that they want that they want to put the gas station in. When we bought this property, it was fine. It was great because they used it for free for the bank.'",
        "'speaker_1': 'This change that they are proposing is a dramatic change from what it would have been when we moved here. It was quiet. And there's no way that they that a gas station or anything like that would be the type that you would want to live by, or that is something that's right by your house.'",
        "'speaker_1': 'We already have a gas station in our little community here just down the block. That was the and and we have you would have two of them now within a quarter mile of each other in the same subdivision.'",
        "'speaker_1': 'If you look around the town of Aurora and Denver, you just don't see that it's hard to find a gas station that is by a community like that. The only one I know of is here one way down on Cherry Street and then over by Colfax.'",
        "'speaker_1': 'I see another one. It seems like that that Belco would be better served to look at other zoning proposals or to add a different venue to to to make it so that there's some other use of that property than a gas station.'",
        "'speaker_1': 'And we've urged them for three years now look for something else. Use your energy to look for another type of development from this. And they're stuck on this gas station. And I don't see why they cannot change and go say no, let's use this for something that would be more in line, that you wouldn't have these petitions'",
        "'speaker_1': 'and other people who would who are saying, no, we do not want this. And so I urge you, this is not right that we'd have such a dramatic change right next to it. I could smell I'd be able to smell the fumes from that gas station in my yard.'",
        "'speaker_1': 'If there were fumes there, I'd smell. Thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker is Daniel Grossman.'",
        "'speaker_1': 'I would. Huh?'",
        "'speaker_0': 'And I'll go ahead. And, Daniel, you'll have to. A new place.'",
        "'speaker_1': 'Good evening, counsel Daniel Brotman. I live at 1001 South Geneva Street, immediately adjacent to the proposed gas station. Again, as I mentioned earlier, your own planning board said, we don't want to look behind a gas station. No one does, and they shouldn't have to.'",
        "'speaker_1': 'And we are talking about a gas station for a very specific reason. Estimates three allows fast food restaurants and they allow the proposed gas station. It hits close to four years ago, Belco came to the neighborhood with the idea of a gas station with a fast food drive through.'",
        "'speaker_1': 'The neighborhood was adamant in saying, No, we don't want that. You heard earlier staff talking about how many times this has come to planning. The planning board and was rejected prior to this. They finally got past that. It was rejected prior to this at at the council's subcommittee level.'",
        "'speaker_1': 'Somehow it got through this time and now we're to cancel council and council needs to send a firm message of no a gas station if it's allowed, underestimates it. Three So it's fast food. Those are not appropriate uses for the residential neighborhoods to the west and to the north of this property.'",
        "'speaker_1': 'So on two sides you have residences. This is the corner of our neighborhood and it's just not appropriate. There was a conversation about immediate the failed mediation. And I have to tell you that what that was about was a whitewash on what was going on at all points.'",
        "'speaker_1': 'We have ask that, you know, we we maintain the burning. We maintain the landscaping. We don't want access onto the residential street, which is Geneva. Those are all conditions of B1, B1 as great. And the conditions that are on the current zoning takes care of the residents through the B1 and the conditions.'",
        "'speaker_1': 'Now they said those are great. We would have agreed to those. They haven't agreed to those. That's not before you tonight. That's not what's before this board. What's before this board is zoning that could back up to a six foot privacy fence.'",
        "'speaker_1': 'They can take out the vermin. They can take out the landscaping. They can put through an access to Geneva over the current Denver public school bus stop. All of those are being reserved. That's inappropriate. Again, I submitted a written piece on.'",
        "'speaker_1': 'They don't meet the conditions. Clearly, they don't meet health, safety and welfare. That is the primary condition that they don't meet again. The request is denied this and do more than deny. Tell the tell BALCO. Come to the table.'",
        "'speaker_1': 'Talk about real zoning. That should be allowed.'",
        "'speaker_0': 'Thank you, Daniel. Time. We have a lot of. All right. Our next speaker our last speaker this evening on this topic is Roger Miller.'",
        "'speaker_7': 'Oh. Oh, oh.'",
        "'speaker_5': 'Roger, I.'",
        "'speaker_0': 'Hi. Around here. I think something's going on with your audio, perhaps.'",
        "'speaker_5': 'No.'",
        "'speaker_0': 'We were having trouble hearing you.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'We're having some trouble. Hearing from Roger. So we'll go ahead and. Oh, there you go. Roger, are you there?'",
        "'speaker_1': 'I'm. I'm here. Are you there? Very like they are.'",
        "'speaker_0': 'Yes. I don't know what exactly happened there, but go ahead, please.'",
        "'speaker_1': 'Well, thanks. I just wanted to address you on the rezoning issue, as other people have talked about from being one to X three. I'm the current president of the Range, the R.A., and I've been in that position since before Belco proposed the first rezoning several years ago, and I kind of want to reaffirm some of that historical'",
        "'speaker_1': 'perspective. The parcel was originally residential and approved would be one of the limitations, so that business could be inserted with a very minimal impact to the immediate neighbors and the neighborhood at large. That first request from a Dallas developer that wanted to have a 24 hour fast food restaurant as part of the property.'",
        "'speaker_1': 'We met with them and said that we would greatly oppose their plan because the R.A. felt that any 24 hour operation abutting single family homes was just inappropriate. But they moved forward to the planning board phase and it was approved.'",
        "'speaker_1': 'However, as you heard earlier from LRO, a short time after that, they pulled the application and didn't pursue that. The further rezoning efforts the second time was again with this developer for a multi pump gas station convenience store and a separate drive thru coffee shop.'",
        "'speaker_1': 'They were looking for extended hours that were not appropriate for the proximity for our residents. Again, only a few feet would separate the businesses from working families, some with small children. Once again, the plan went to the planning board and was forwarded, but this time with a tie vote 3 to 3.'",
        "'speaker_1': 'Yet another zoning request was pulled and we thought this seller finally saw that the proper zoning was not going to be smacked through. Several months passed and we were informed that the gas station rezoning was back on the table, but this time without the separate drive thru coffee operation.'",
        "'speaker_1': 'Even though the small outbuilding was not going to be there, we still believe that any zoning should not include a 24 hour operation, which estimates 3 hours. A good neighbor like Belco shouldn't continue to try and force this issue over several years.'",
        "'speaker_1': 'We have a gas station and convenience store, as we mentioned earlier, on our east boundary, thanks to the city of Aurora. We were told we would not see negative impacts, but how wrong they were. Increased traffic, including multiple large delivery trucks, are daily occurrences through the neighborhood.'",
        "'speaker_1': 'It is Force One neighbor immediately next to it to uproot his family and move after several years. He said it was just way too noisy with all the cars and could not get restful sleep and could not enjoy his yard outside.'",
        "'speaker_1': 'Please, I implore you, don't be like Aurora. Don't force us to have another 24 hour operation across the back fence from our homes. We're not opposed to commercial development, but make it an appropriate zone. Not so much story as they suggested.'",
        "'speaker_1': 'Would you like to have a 24 hour operation outside your back yard? We don't either. Please help.'",
        "'speaker_5': 'Us.'",
        "'speaker_0': 'That's the time we have available. Thank you for joining us this evening. And that concludes our speakers questions from members of council. On Council Bill 404. Council member Sawyer.'",
        "'speaker_4': 'Thanks, Madam President. So before I get started, I also just quickly want to send my condolences to Mr. Singer on the loss of his mother. Our thoughts are with you and your family during this time. And we really appreciate your willingness to be here tonight to give testimony anyway.'",
        "'speaker_4': 'So a couple of questions or I guess probably start with for Ella. You is a protected district. So what is that? What? What exactly does that mean?'",
        "'speaker_8': 'Oh, yes. Few the adjacent single unit residential districts are protected districts. So that means that a mixed use district, like a smack three being adjacent to those, has some slightly more restrictive building form standards around that. Um, so I can, I can pull up the exact specifics, but I think in the case of us, Annex three, the'",
        "'speaker_8': 'side and rear set backs are a little bit higher when that property is adjacent to a protected district.'",
        "'speaker_4': 'Okay. So in this example, the adjacent properties are, as you see, I think there's a.'",
        "'speaker_8': 'Yeah. Yeah. And those are all a few are protected district. So so the the proposed rezoning would have different standards. It would have higher setbacks on the sides that were abutting those few properties than it would on the Belco side, which is not a protected district.'",
        "'speaker_3': 'Okay. But so the.'",
        "'speaker_4': 'You mean the Belco side that is currently the bank still.'",
        "'speaker_8': 'Correct. So what if it's a little it's the protected districts are the adjacent districts, but the impact is on the the proposed rezoning site. So the they would have the higher setbacks on the sides that face the two protected districts, and that wouldn't apply on the side that faces the Belco side because the Belco site is at'",
        "'speaker_8': 'that next five.'",
        "'speaker_4': 'Okay. Got it. So then it's safe to say that there's a in order to have mixed use there, there needs to be a transition. And we heard a couple of people talk about that in their testimony. Is that is that right?'",
        "'speaker_8': 'Um, yeah. I mean, the transition is that kind of situation is contemplated by the zoning code. But in its inclusion of things like protected district setbacks, where it says you have to be farther away from something because it is a low density residential.'",
        "'speaker_4': 'Okay. Got it. So what were the other potential zoned districts that were appropriate? I know that there was some testimony. I know you said CPD only looks at the the zone district that is applied for, which is obviously understandable.'",
        "'speaker_4': 'But there were a couple of other zone districts that have been considered. This has come through before. So what what were those other zone districts and why did they not work out?'",
        "'speaker_8': 'Well, I think it's a hard, hard question to answer if we say considered. But I would want to take that over to the applicant team just because I actually went through all the notes for all the pre APS and all you know, for all of the times that we've seen this case.'",
        "'speaker_8': 'And each time the conversation was at least what I could find detailed in the record was already landed on the slate. So I'm not sure whether or not the property owner really considered other zone districts, and I just don't want to speak for them because those were conversations had without me from CPD side.'",
        "'speaker_8': 'I think just I mean what we do is look through the, you know, the plan guidance is we kind of the the biggest tells you point in the right direction. So we would look through what the language of community corridor in the suburban district what what ten zone districts align with that.'",
        "'speaker_8': 'And there would probably be other annex districts that you know, there are the two to a2x, there are some other options there that I think and again, having as you as you noted, not having done that analysis here, because that's not what the application was.'",
        "'speaker_8': 'But I think it's probably likely that you could make an argument that some of those other ones are are consistent as well. One, just to share one kind of conversation around this, that planning board and planning board member to ask like would six five meet the plan direction?'",
        "'speaker_8': 'And it does say up to five storeys. But we also are looking at context. So I think there are as with many, many sites in Denver, there isn't just one district that makes sense. But in terms of what was contemplated and what worked and didn't work, I would want to defer to the applicant and not not speak'",
        "'speaker_8': 'for them on that one.'",
        "'speaker_4': 'Okay. Does the applicant want to jump.'",
        "'speaker_3': 'In here and respond?'",
        "'speaker_0': 'We can go ahead. And I believe we need to get Jim Irwin back in. So there we go. Sabella. Go ahead, Jim. Or Doug, whichever wants to respond.'",
        "'speaker_2': 'I'll have Jim and I can speak.'",
        "'speaker_0': 'Okay. Jim, did you want to respond to Councilwoman Sawyer's question?'",
        "'speaker_2': 'Sure I can start it. Just let me rejoined. I came in right when you were talking. Sorry to cut you off there, but yet. Councilman Sawyer. So when you look at when we were looking at the as you know, the suburban zone districts, you know, we really kind of landed on and obviously the residential ones out the'",
        "'speaker_2': 'window. And so we're looking at the, you know, the commercial ones here. So we have the SCC, which is the commercial corridor and the S-MAX. And then also there's the M.S., which is the main street. So, you know, the main street one, we we didn't feel like we met the intent and the purpose of those of of'",
        "'speaker_2': 'that zoned district. So then it kind of boiled down to looking at the snacks in the SCC zoned districts. And so that commercial corridor district, you know, it's very it has much less restrictive standards as far as setbacks, you know, building flexibility in the building circulation, the parking lot layout, the building form.'",
        "'speaker_2': 'And so the most restrictive suburban zoned district ended up being s-max. And then when we looked at the transition with the properties along Havana there, there S-Max five, and then we kind of stepped down in building height and went to the S-Max three and then you get into the residential.'",
        "'speaker_2': 'So if you look at the residential, the SS, you next steps in the S-Max three building heights, they're very close to within a I believe about five feet apart from each other. And so we felt that the step down from the S-Max five to the SS, you know, it landed on the estimates three was the most restrictive'",
        "'speaker_2': 'zone restrictive that's at least.'",
        "'speaker_4': 'Okay. Great. And I think maybe back to a question for Ella then, is if this is some x three, the surrounding ones are some x five in blueprint s and x three is not appropriate for arterials, right?'",
        "'speaker_8': 'Um, I think the language around, um, let me just pull up the, um, the language around what is appropriate along arterials. Um, that section doesn't, it doesn't give specific guidance on the street type, doesn't give specific guidance on building heights because it is meant to go hand in hand with the future place type, which does.'",
        "'speaker_8': 'So it's kind of looking at a combination of the two, but it does talk about, um, arterial streets, um, tend to support a higher level of adjacent development intensity than collector or local streets and that, that this particular type.'",
        "'speaker_8': 'Um, let's see. Sorry, I'm trying to pick out the, the right language here that can help. Uh, yeah, it says typically contains commercial uses, including shopping centers, auto services and offices. So, um, yeah, I think that the S-Max three is one of the zone districts that we found to be appropriate around in arterial, in this location.'",
        "'speaker_4': 'Okay, great. Really appreciate that clarification. Um, I know that in other rezonings where we've had some, some a lot of contention, sometimes the property owner has gone to host and executed an agreement for affordable housing, a commitment for affordable housing on that land, even if affordable housing is not meant to be built there.'",
        "'speaker_4': 'Did that happen in this situation?'",
        "'speaker_8': 'That did it. And I honestly, I'm trying to remember the timeline of when that became kind of standard this this pre up might have been before that and that is that is voluntary and yeah, so I, I can't remember because I actually didn't do the pre-op for this one, but I'm not sure if that came up.'",
        "'speaker_8': 'But that is the applicant's choice. Always. It's always voluntary.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': 'Yeah, absolutely voluntary. I was just curious whether it had happened here or not. And then finally, what what issues caused the mediation to fail? I know that there was the talk of the hours of operation. Were there other things or was that really kind of the sticking point?'",
        "'speaker_8': 'So my understanding and I am limited to the the summary that's in the staff guide, you know, that it was important. That was, um, it was important for me to stay neutral and for that to stay neutral. So I was not part of those conversations.'",
        "'speaker_8': 'But I think there were a lot of very difficult topics that that were slowly worked through over time. So I think there was a lot of there was a lot of challenge, but my understanding was that the rest of them were eventually worked through.'",
        "'speaker_8': 'And there was some agreement and it was in writing, but then it was the hours of operation that they just finally, after, you know, ten months of actively, officially in mediation, were able to reach an agreement on it.'",
        "'speaker_4': 'Okay. Thank you so much. Really appreciate it. Thanks, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. Next step, we have Councilmember Sandoval.'",
        "'speaker_4': 'And I am pregnant and can give you different. Can I go in December?'",
        "'speaker_0': 'Yes, we can. Go ahead and come back to you. Councilmember Black.'",
        "'speaker_4': 'Thank you, Madam President. And thank you, Ella, and everyone who is here tonight. This is a great example of why customized zoning is a problem. I think if I recall, this is from 1994 and our city has changed a lot since then.'",
        "'speaker_4': 'I have some questions for Nate Lucero, who is the city attorney, who is our zoning expert. Nate, are you here tonight?'",
        "'speaker_0': 'We can bring Nate up into the queue here. Okay. There you go. Councilwoman Black, you can. Nate's in the queue.'",
        "'speaker_4': 'Go ahead with your pick. Nate. Nate, I have a few questions for you, so I think every person who is opposed to this zoning is actually opposed to a gas station. And either almost everyone or everyone who's opposed to it mentioned that someone on the planning board said that no one wants to live next to a gas'",
        "'speaker_4': 'station. So can you please remind us what Planning Board's role is? And do they evaluate the same criteria as Council?'",
        "'speaker_2': 'Good afternoon. Members of Council Nate Research Assistant City Attorney. Councilwoman Black, thank you for the question. So the Planning Board's role is to evaluate and make a recommendation on these rezoning applications. The recommendation to this body, whether or not to approve or deny rezonings.'",
        "'speaker_2': 'And and they evaluate the exact same criteria that this council does. And they do not evaluate particular projects. But I realize that there was some commentary by some of the planning board members. But ultimately the reason that this particular application garnered a recommendation of approval was because of the fact that the board, in its opinion, felt like'",
        "'speaker_2': 'this application for this particular zoned district met the criteria that you are reviewing this evening.'",
        "'speaker_4': 'Okay. So to be clear, neither the planning board nor council approves actual development projects like whether it would be a gas station or a coffee shop. It's just the zone district. And if we meet the criteria to approve that zone district.'",
        "'speaker_2': 'Yes, ma'am. That's correct.'",
        "'speaker_4': 'And what about the Good Neighbor Agreement? I know that a lot of time was spent trying to negotiate a good neighbor agreement. Is that one of the criteria for either planning board or council's criteria approval?'",
        "'speaker_2': 'No, it is not good. Neighbor agreements are private agreements between property owners and in this case it might be between the property owner of the proposed rezoning and the existing neighborhood. But there is no role for the city to play in good neighbor agreements, whether it comes to the negotiation of those agreements or more so the enforcement'",
        "'speaker_2': 'of those ingredients, the enforcement would be up to the individuals that are parties to that agreement.'",
        "'speaker_4': 'So is there any situation that would get this city to get involved to further regulate what might go on that property? So if CPD felt like Smoke three was the appropriate zone district, is there a waiver or something that could be attached to that that might somehow further restrict what would be?'",
        "'speaker_4': 'What could go on that property.'",
        "'speaker_2': 'There are opportunities for customizing zoning, whether that's through a waiver or condition or APD, which is what exists currently on the property. But. Under today's code, you have to meet very strict criteria in order to have a PD on property and you want to come forward with an application with waivers and conditions.'",
        "'speaker_2': 'The the policy of CPD is that we we ought to try and look for standard zone districts that work opposed to customizing zoning districts. And, you know, for the reason that you pointed out earlier, which is, you know, it's difficult to administer these things over time.'",
        "'speaker_4': 'And so if this story was approved by council, does that guarantee that a gas station would go there or does it just mean it's that zoned district and there's any variety of things that could go there?'",
        "'speaker_2': 'It would be the latter. S-Max three has different uses that could potentially go into that zone district. So no, you're an approval of this zoning request tonight would not would not mean that 100% a gas station is going to be erected there.'",
        "'speaker_4': 'Okay. Thank you, Nate. Council President Gilmore. I had a few more questions that I can continue to ask. That's fine, if you prefer.'",
        "'speaker_0': 'No, that's fine. Go ahead.'",
        "'speaker_4': 'Okay. I have a question for I think his name is Mr. Bronson or Botsman. Sorry if I didn't write your name down. Right.'",
        "'speaker_0': 'Mm. Daniel Botsman I believe so. Will try to get Mr. Botsman back in the queue here. All right. We've got him here. Go ahead, Councilwoman.'",
        "'speaker_4': 'Thank you. Thanks for being here, Mr. Brotman. You talked a lot about mediation and your desire to work with Belco. Did you attend those mediation sessions over those many months?'",
        "'speaker_1': 'Absolutely. I actually from four years back, we've we've been we've been talking with Belco and requesting a zoning other than one that allows a gas station. There's no guarantee that there's a gas station. However, this zoning that's being requested allows a gas station.'",
        "'speaker_1': 'So if you don't approve it, they can't have a gas station. They can't have fast food. They can't have a five storey building. So if you if you say no tonight, it denies a gas station.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'Think the reverse is not true. They don't have to build a gas station, but for four years, they have pushed a gas station on this site.'",
        "'speaker_4': 'Okay. Thank you. All right. I understand that. But my question is for you. You said you attended all of the mediation sessions.'",
        "'speaker_1': 'Or the other one? Yes.'",
        "'speaker_4': 'In the past, you attended all of them but one.'",
        "'speaker_1': 'Yes. And again, this is not about just the time that's talking about. We've been.'",
        "'speaker_4': 'Asking.'",
        "'speaker_1': 'People on the request of the the gas to push away from as.'",
        "'speaker_4': 'As my friend Councilwoman Sandoval sometimes says, this is our opportunity. Okay. And and how many homes are adjacent to this property that we're discussing?'",
        "'speaker_0': 'Are you asking Ella?'",
        "'speaker_3': 'A back door batsman. Oh.'",
        "'speaker_0': 'Go ahead, Mr. Brodtmann. We'll have to have you go ahead and unmute, Mr. Brosnan, to answer Councilwoman Black's question. There you go.'",
        "'speaker_1': 'Immediately touching this property there, seven, eight. The residential district, as you saw from the petition, has hundreds of.'",
        "'speaker_4': 'My question was, how many how many houses are adjacent to this property?'",
        "'speaker_1': 'Again, seven or eight.'",
        "'speaker_4': 'Okay. So I'm looking at a map and I think there's two.'",
        "'speaker_1': 'So I can tell you I'm across the street. There are two houses.'",
        "'speaker_4': 'Across the street to the south. It's not adjacent. But there are numerous people tonight said that they were adjacent to the property. And I just don't quite understand it. When I look at the map, there's actually two that abut it and then there are two across the street.'",
        "'speaker_4': 'So that would.'",
        "'speaker_1': 'So so the ones across the street are still within, as you heard the testimony earlier, within that zone of gas station fumes. That's going to cause.'",
        "'speaker_4': 'They're not just the way they're not adjacent.'",
        "'speaker_1': 'Directly across the street. I mean, the only the only barrier is a street that.'",
        "'speaker_0': 'That's fine, Mr. Botsman, but could you please answer the question? How many homes are directly adjacent next to the property in question?'",
        "'speaker_1': 'Okay, the back fence has like about four or five houses, but again adjacent to meaning four adjacent. Sorry, my legal mind gets going and adjacent, certainly across the street. My house is adjacent. I'm sorry, it's, it's across the street, but.'",
        "'speaker_1': 'But I'm going to have the full view of this gas station.'",
        "'speaker_4': 'Okay. Well, I. I hope that all my council colleagues are looking at a map because there's two houses that are adjacent to the property and there are two there across the street. And how many homes are in the neighborhood.'",
        "'speaker_1': 'And I believe the president of the association would be better answer to answer that. Obviously, more than 97 out there are at least 97 that have opposed this. So all of those.'",
        "'speaker_4': 'Okay. And then I think the neighborhood president is named Mr. Miller. Mr. Miller, can I ask you a couple questions, please?'",
        "'speaker_0': 'All right, we'll need to get Mr. Miller back into the queue. So we'll have the staff do that. All right. Mr. Miller, did you hear Council Member Black's question or would you like her to repose it?'",
        "'speaker_1': 'Re posted if you would, please.'",
        "'speaker_4': 'Thank you, Mr. Miller. How many houses are in your neighborhood organization?'",
        "'speaker_1': 'We have approximately 142.'",
        "'speaker_3': 'And our assumption.'",
        "'speaker_1': 'Preventative.'",
        "'speaker_4': 'Are some of them in Denver and some of them are in Aurora. Is that correct?'",
        "'speaker_1': 'Yes, we have 66% in Denver and 33%, 34% in Aurora.'",
        "'speaker_4': 'And how many signatures did you have to get to get a protest petition?'",
        "'speaker_1': 'According to the instructions, we had to obtain those signatures from the properties that were listed in an approximate distance from the proposed plot, which would be the two, three houses across the street and. What for? Houses. I think there are four houses that are to the north of that proposed property.'",
        "'speaker_4': 'And so how many signatures did you have to get? For the protest petition.'",
        "'speaker_1': 'We got one, two, three, four, five, six. We had to get seven and we got all seven.'",
        "'speaker_4': 'Uh huh. And I think you were the person who talked about noise in the neighborhood. I live west of you, but I live very close to Hampton and I hear Hampton roaring every night. And I know a lot about Hampton and I know in my neck of the woods, there's about 90,000 cars a day.'",
        "'speaker_4': 'How far away is your neighborhood from Havana, which for those of you who know south, the southeast part of our metro area. Hampton turns into Havana.'",
        "'speaker_1': 'We are one building lot away from Havana.'",
        "'speaker_4': 'Mm hmm. So I think had even. Yeah. Hampton or Havana in Mississippi? At Havana. At Mississippi, I think is nine or ten miles wide. Okay. Those are all the questions I have for now. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Black. Next up, we have Council Pro Tem Torres.'",
        "'speaker_3': 'Thank you and thank you, Councilwoman Black. Some of the questions that I also had, I do have an additional one, I think, for Ella, just so I can understand arterials and connectors. Is there any distinction when it comes to those of gas stations drive thru services?'",
        "'speaker_3': 'Do those speak to those street types at all? Is there any language that intersects them?'",
        "'speaker_8': 'You Blue Blueprint doesn't get that specific, but generally it does. Talk about arterials are a little more intense than collectors, so they have more through traffic. And the way that blueprint talks about that is how that informs the appropriate level of adjacent development intensity.'",
        "'speaker_8': 'So by that measure, arterials would support the would be adjacent to higher levels of development intensity than other than than collectors or local.'",
        "'speaker_3': 'Okay. Who who can speak to the the good neighbor agreement that was attempted.'",
        "'speaker_8': 'Well, the the applicants and then the the the neighbors and the R.A. were all all part of that.'",
        "'speaker_3': 'Let me start with the applicant. Wherever that might be. Doug. Doug. Hi, Doug. Hi. Can you tell me just a little bit more about the hours of operation where you are sticking to a 24 hour operation and no movement off that?'",
        "'speaker_2': 'No. When it started that, we actually started with we we didn't request a 24 hour operation at all. What happened initially when we we talked about it, the initial of operation that we we requested was four in the morning, two one in the morning.'",
        "'speaker_2': 'So 4 to 1. After we had some more discussion, we came back. And I want to make sure I tell you this correctly. We had during the actual meeting, we looked at.'",
        "'speaker_3': 'Going from.'",
        "'speaker_2': 'That.'",
        "'speaker_0': 'Time period to.'",
        "'speaker_2': 'Offering opening at 530 in the morning or setting a time at 530 in the morning and then closing by 1030 that same or I'm sorry, 1130 that same day. So like, like I said in my Talk to you, that was a three hour difference within the day period that we compromised even further.'",
        "'speaker_2': 'So but we never did. To your question, we never did push for a 24 hour operation.'",
        "'speaker_3': 'Okay. Got it. Thank you. No further questions. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. Councilmember Torres. Councilmember Flynn.'",
        "'speaker_1': 'Thank you. Madam President, let me follow up on Council Torres's line, because we heard a lot of talk about how this zone district allows 24 hour operation, but there apparently is an agreement. And the agreement was supposed to go from, I think, 3 a.m. to 1 a.m., but it was then pulled back to 530 to 1130 because'",
        "'speaker_1': 'someone clarified that for me. Would that be done? Can do that?'",
        "'speaker_2': 'Yes, absolutely. First of all, we were not able to reach an agreement. So there's not a per se agreement in place. But what we attempted to do was, like I said, four in the morning, two that one, four in the morning, two one in the morning.'",
        "'speaker_2': 'And then we moved it again to 530 to 1130.'",
        "'speaker_1': 'That's what I heard. But that's just a voluntary commitment that you've made to no one in particular in any agreement, but just a publicly stated commitment.'",
        "'speaker_2': 'Yeah, we. Yes, sir. We attempted to go to a good neighbor agreement through our mediation, and that was definitely a part of the mediation discussions. I think that answers your question.'",
        "'speaker_1': 'Yes, it does. Thank you. So absolutely there's nothing to hold you to that. There's no written agreement and there's no waiver or condition, certainly in your application, that would commit you to that as part of the resolving.'",
        "'speaker_2': 'Correct. Correct. Correct.'",
        "'speaker_1': 'Okay. Ellen, would that would that have been an appropriate thing to include in the the rezoning the as MH three with waiver of operating hours.'",
        "'speaker_8': 'Well. So the the use limitations for all of our youth. I mean, it's a whole chapter in the zoning code. They vary based on the youth. So I think it's a little bit tricky to assign a blanket limitations that would apply to all uses if they were really created for a specific one, because the code already builds'",
        "'speaker_8': 'in more, more flexibility than that. So we you know, we do. There you could pursue a waiver or conditions. In this case, it would be waivers, conditions to limit that. We tend to you know, as we're talking about the beginning of this hearing, we we tried to do custom zoning for good reasons because they they leave us'",
        "'speaker_8': 'stuck in the future. So CPD does try to explore other options first, but we do, as you guys know, you see cases come through with waivers and conditions. They do happen and they do need to be initiated by by the applicant.'",
        "'speaker_8': 'So we don't ever imposed them on them.'",
        "'speaker_1': 'Maybe this this might be slightly unfair. If you can't do it, just let me just tell me. But there were three members of the planning board who who voted not to recommend this. And I know we discussed it briefly in some other questioning, but do you recall any of their specific citations to any of the criteria by'",
        "'speaker_1': 'which they on which they based their vote?'",
        "'speaker_8': 'Yeah. So in the conversation, it was a long hearing with a lot of a lot of different topics covered. And it wasn't. The three people who voted against it weren't didn't very explicitly say, you know, I'm sure they had their their criteria based reasons, but they didn't explicitly state that.'",
        "'speaker_8': 'So I am reading a little between the lines. I think that there was a lot of discussion around the public health, safety and welfare criteria. And and I think just a little on the questions that we had earlier on about the the adjacency and how the zoning code deals with that.'",
        "'speaker_1': 'So basically the same thing we're hearing tonight, and I and I did read that in the staff report, at a high level, they talk about health, safety and welfare. It almost makes me wonder whether we ought to be looking at the at the permitted uses that allow gas stations as a use by.'",
        "'speaker_1': 'Right. Maybe have that with with some some other restrictions, because that seems to be the basic problem here. But apparently the planning board made its recommendation not on the criteria, but they were considering the actual project that was going to be done.'",
        "'speaker_1': 'A gas station is what I'm hearing you say.'",
        "'speaker_8': 'I didn't mean to communicate that. I'm sorry if I said that. I mean, I don't I think that they the conversation was, you know, it's with the testimony like gas station came up. But the people who were I think the people who were more uncomfortable with it were more along the lines of a zone district that allowed'",
        "'speaker_8': 'a gas station.'",
        "'speaker_1': 'Exactly. And that's my point, is that they were they were judging it based on the specific project, the specific use that was being proposed by the applicant. If it were just, hey, I'd like to come in and come into the Denver zoning code out of Chapter 59, former Chapter 49.'",
        "'speaker_1': 'I'd like to do some x three and I'll decide what I want to do later. This probably would have sailed through through the planning board, but because the gas station was mentioned. That seems to be what the whole discussion was around.'",
        "'speaker_1': 'And that's precisely where we're not supposed to be making our decision on what the project is. Right. So this this merits a lot a lot more discussion. I have just one more question. L I don't know if you can answer this or, or maybe me, but since this is on the future place under Blueprint, which is the'",
        "'speaker_1': 'only plan that guides us here other than 2040, the future place type is commercial quarter, correct. And so where other districts considered that are in the CC category rather than mix.'",
        "'speaker_8': 'So it's the community corridor and blueprint, and I think that The Notebook has a lot of alliteration. The applicant, Jim Aaron Sabato, was talking earlier about that. He mentioned the C.C. district option when when we adopted this blueprint, there is a lot about improving the the urban design and the pedestrian realm.'",
        "'speaker_8': 'And given that kind of whole of the guidance from Blueprint, it's a little harder to find consistency with the CC districts, especially as there are some kind of from from those perspective, some better options with the M.S. and X.'",
        "'speaker_8': 'So we don't see a lot of CC rezoning for that. For that reason, just because they're they were they were intended to provide a Denver zoning code version of a lot of what we were seeing on the ground.'",
        "'speaker_8': 'But they're not really aspirational.'",
        "'speaker_1': 'And that's kind of confusing, though, given because if blueprints that are says that the future place type here is community corridor. But but we have a hard time finding consistency with any of the CC zone districts. That seems like a disconnect and it seems like there could be a reason to say that this is not consistent with'",
        "'speaker_1': 'the with the planning for the area that that particular criteria. So it is very confusing for me. Thank you. I'm happy to listen to the rest of the debate. Thank you all.'",
        "'speaker_0': 'All right. Thank you, Councilmember Flynn. Next step, we have Councilmember Hines.'",
        "'speaker_2': 'At the council president. I want to thank CBD and applicants for all this. This has been going on and the neighbors that's been going on for a long time. So thank you for your for your patience tonight and over the last numerous years.'",
        "'speaker_2': 'I one of the neighbors testified that that they used well water is I don't know I heard or at least that's what I heard. And I want to verify if if that is actually what I heard. Is is there are there addresses immediately adjacent to this proposed rezoning that uses that use?'",
        "'speaker_2': 'Well, water. I don't I don't really know who to ask.'",
        "'speaker_0': 'I don't know. Ella, do you know the the answer to that question?'",
        "'speaker_8': 'I don't, unfortunately. And I also don't know who might have said that to help you figure out who to promote, but maybe someone.'",
        "'speaker_0': 'Yeah, we have the the Jacksons, James and Lawless Jackson. And so we can see if either one of them are. There we go. Go ahead and.'",
        "'speaker_2': 'Yes, welcome back.'",
        "'speaker_0': 'Uh huh. Go ahead.'",
        "'speaker_3': 'Hi. We are not adjacent. We are two streets over. But yes, we do use well water. And there's several homeowners in the neighborhood who use well, water for domestic and irrigation.'",
        "'speaker_2': 'Okay. Thank you. I think that's the only question that I have. But thank you for confirming that that you and other neighbors use. Well, water for for your own use and for irrigation use.'",
        "'speaker_3': 'Correct.'",
        "'speaker_2': 'So it's both or some use one of the three. Some use it for both.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_2': 'It's something that some use it for both. Some use it for.'",
        "'speaker_3': 'One or the other. But there's several of us.'",
        "'speaker_2': 'Yes. Okay. Thank you for both. All right. Thank you. And thank you. Thank you. Council president.'",
        "'speaker_9': 'Sure.'",
        "'speaker_0': 'All right. Thank you. Next up, we have Councilmember Ortega.'",
        "'speaker_9': 'Thank you, Madam President. I just wanted to ask someone associated with the ownership of the property. I don't know if that's Mr. Kirby or who that should be, but my question is. Is is there currently an option contract on the property that is contingent on the rezoning passage?'",
        "'speaker_2': 'Yes. We're looking to sell the property. Murphy Oil.'",
        "'speaker_9': 'Okay.'",
        "'speaker_2': 'So I think that's I believe that's your question.'",
        "'speaker_9': 'Yeah. Yeah, that that was. And is it intended to be a convenience gas, a convenience store, gas station, or is it just simply a gas station?'",
        "'speaker_2': 'It's against gas station and convenience. But we can let somebody from Murphy or another group talk if they want to answer that differently.'",
        "'speaker_9': 'That would be great if you've got someone from Murphy that can answer the question.'",
        "'speaker_0': 'All right. And Doug, who would that be that we want to bring up into the queue?'",
        "'speaker_2': 'I think either Jim or David.'",
        "'speaker_0': 'Okay. We've got Jim here in the meeting already, so. Go ahead, Jim. Yeah.'",
        "'speaker_2': 'There was the question just is there a convenience store aspect with the fuel station?'",
        "'speaker_9': 'Yes. And then I was going to ask a question about the the size, because I heard in earlier testimony that half of the property would be made available. That would include green space and. Those such users on this are not users, but improvements on the site.'",
        "'speaker_9': 'Is that accurate?'",
        "'speaker_2': 'Yeah. Generally speaking.'",
        "'speaker_9': 'Go ahead.'",
        "'speaker_2': 'Yeah. Yeah. So generally speaking on the green space comment, there's a shared detention pond between this parcel in the Belco parcel to the east. And so if you look at it, you know, an aerial view, your view on the west side, you'll see that a third of the property is is currently a detention pond with adjacent landscaping'",
        "'speaker_2': 'around it. So, you know, when you look at just this property in itself and take that existing greenspace into consideration, you're left with about 50% of that. That parcel will be, you know, strictly.'",
        "'speaker_9': 'Building and parking.'",
        "'speaker_2': 'You know, uses it. You need degrees. You know, you're required to have detention for both sides. So you must use it, modify it. I mean, that would stay that was.'",
        "'speaker_9': 'The remainder would just be building in parking. Do you can you just sort of give an idea of the number of parking spaces that would be anticipated?'",
        "'speaker_2': 'Typically for for a fuel state, you know, a property of this size, it's probably in the realm of, you know, 8 to 10, I believe is is the number of installs.'",
        "'speaker_9': 'And that is that pretty consistent with the same size convenience store gas station.'",
        "'speaker_2': 'Yeah. Yeah. Yep. I'd say that's pretty consistent when you when you look around Denver proper for this size parcel and in the in the building that they're looking at.'",
        "'speaker_9': 'Okay. Those are all my questions. Thank you so much for answering them. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Ortega. We've got Councilmember Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. I have a question for Mr. Kirby or Kirby. So when Denver resigned in 2010, part of your parcel was reason to miss five or S Amex flights, and the other portion was left as the B-1.'",
        "'speaker_4': 'Can you explain why that was done?'",
        "'speaker_2': 'Yeah. We ended up only using the front half of that piece of property to build our full service branch. So the rezoning occurred to do that full service branch.'",
        "'speaker_4': 'Really interesting. When was the property reason to expire? Do you know the history of that?'",
        "'speaker_2': 'I do. It's going to take a second to pull that up. Bear with me. I'm sorry.'",
        "'speaker_4': 'No problem. Take your time.'",
        "'speaker_0': 'And I don't know if Ella maybe has that answer. I'm.'",
        "'speaker_8': 'I'm also trying to cover it up.'",
        "'speaker_5': 'Okay.'",
        "'speaker_8': 'It was loads.'",
        "'speaker_3': 'All right. It was round.'",
        "'speaker_2': '2016.'",
        "'speaker_4': 'So in 2016 you re zoned in the front portion of the property to modify, then you left that other portion to be won. Is that what I'm hearing correctly?'",
        "'speaker_2': 'Correct. And it's what it is today.'",
        "'speaker_4': 'Can you explain to me why you didn't resign your whole entire parcel? Because you're if I if I understand correctly, you're the you were the property owner of the entire parcel, is that correct?'",
        "'speaker_2': 'Correct.'",
        "'speaker_4': 'So what was the what was the why would and I'm a bit confused if this was old zoning and it's the whole entire parcel that you own. And one of our justifying circumstances is to get full zoning into new zoning.'",
        "'speaker_4': 'Why was this allowed when Castle allowed to stay in the Old Zone District? How is that decision made?'",
        "'speaker_2': 'I don't know that answer. I just know that what we did was we zoned the front part of the property. And I don't believe and if this is false, I apologize. But I don't believe anybody asked us that question or pushed us on that.'",
        "'speaker_2': 'So any thoughts?'",
        "'speaker_8': 'Yeah. So I pulled up our our zoning map and also our rezoning map, and I'm actually not seeing a rezoning on that site. So I'm wondering, Doug, and this might be a limitation of the data that, you know, how far back our data goes, but I believe this had all the rezoning.'",
        "'speaker_8': 'So that leads me to think that maybe what happened in I think you said 2016 was such a different like a building permit or some other city process. I know there are a lot of them and they are confusing.'",
        "'speaker_8': 'And so I'm wondering if perhaps the the Belco credit union site, the other building was just in the old code and it got re zoned as part of the 2010 rezoning. And this one got left behind in that citywide process because it had a condition because when the the parcels that were left behind were because they had'",
        "'speaker_8': 'some kind of custom zoning attached to them. So that and from what I can see, might, might be the history.'",
        "'speaker_2': 'And that's only possible. I'm, I'm more than willing to research that for you. Um, so, but I, however, we were able to build our building. We were I mean, that's but I apologize for not only.'",
        "'speaker_4': 'The question for you. Can you talk to me about who hired Galloway in your who put together your application. It's it looks like on the public record it's by Galloway did you pay for that or did the petroleum.'",
        "'speaker_4': 'I can't remember the name. So it had a major regulator.'",
        "'speaker_2': 'It's Murphy. Murphy USA.'",
        "'speaker_4': 'Murphy USA, who paid for Galloway to put together this rezoning application.'",
        "'speaker_2': 'Murphy, USA.'",
        "'speaker_4': 'So you did not have the owner of the property. You had the person who's currently under contract. They paid for Galloway to put together this particular application for your property. Is that correct?'",
        "'speaker_2': 'Correct. And we we were involved from all of the mediation, I mean, from start to finish. So we worked directly with Galloway throughout the process.'",
        "'speaker_4': 'So how come you haven't in the years that you own this property and you haven't been working, how come you, as Belco didn't pay for someone to assess and do a rehab application and instead had the person under contract do that?'",
        "'speaker_4': 'Can you explain that to me?'",
        "'speaker_2': 'And I mean, I don't know, I guess maybe not following your question, but we work directly with Galloway to. Breeze on the property along with Murphy Oil Main. It was it was a joint endeavor. I and we we did.'",
        "'speaker_4': 'Okay, let me rephrase my question so I can ask it in a different way at any time since you run the property, since you had the ability to reason on your property. Correct? Correct. Correct. And so you only are interested in rezoning the property once you had it under contract and you allowed the person who you have'",
        "'speaker_4': 'it under contract to lead the rezoning and pay for the consulting group to put together the rezoning package. Is that correct?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'Okay. So my question for you is, why is a property owner in a business? Why did you not re zone the property prior to having it under contract?'",
        "'speaker_2': 'I'm not sure there was a requirement to do that.'",
        "'speaker_4': 'There is. I just find it interesting that I find it interesting. It happens often, but I find it interesting that you have been paid for this, that someone who has your property under contract is paying for all of this.'",
        "'speaker_4': 'So that's my question. So, Ella, I have a question for you about the Annex three Eastern District. So in the intent of the in section 3.2.4 of the zoning code under a suburban neighborhood context criteria three says the mixed zone district standards are also intended to ensure you develop contributes positively to established residential neighborhood and character and'",
        "'speaker_4': 'improves the transition between commercial development and adjacent residential neighborhoods. So my question for you is, in Blueprint Denver, it talks about low, low density, like, you know, how you have the scales.'",
        "'speaker_3': 'Of.'",
        "'speaker_4': 'And it talks about low, right? Which low can be 1 to 3, 1 to 3 stories. My question is, why does CPD not analyze these sites more? I know. I know we're probably going to get into this more in this Thursday.'",
        "'speaker_4': 'Why doesn't CPD take a more active approach and and and do analysis when these kind of rezonings come through? Why is it property driven? Right. If we are the experts in the planning department are the experts I really believe you are who have led all of these neighborhood plans you've read, led the comp plan, you led Blueprint'",
        "'speaker_4': ', Denver. How come more analysis doesn't go into these sites to figure out what the Zone District would fit best in that area?'",
        "'speaker_8': 'I think it's really it's really just responding to the the structure of rezonings in the zoning code and that they are applicant led. So in those which we try to do as much filtering and redirecting in the pre-op stage as possible.'",
        "'speaker_8': 'And and perhaps can just go a couple different ways. Sometimes people come in and they're like, Hey, I've got this weird old zoning and I want to do something else. And that that's when we'll kind of talk through how to think about it and point people in the right direction and be like, Hey, these are these are'",
        "'speaker_8': 'some zoning districts that are likely to meet the criteria. And sometimes people come in with very specific here, I want to build X, Y, Z, so then we'll talk about, all right, well, here are some options that meet planning criteria and also would allow that.'",
        "'speaker_8': 'And then sometimes people come in and they're like, I want to build X, Y, Z, and I want this zone district to do it. So then the conversation does tend to be around how that might go. And I mean, not surprisingly, in the preoperative conversation for this third time, there was caution around like we don't see a'",
        "'speaker_8': 'lot of a difference in the conversation from the previous time, but we did urge, urge the applicant to at least let the mediation play out. And so they they did continue to think they were supposed to have a planning board in February, but we're still in conversations and opted to push it out to let those wrap up'",
        "'speaker_8': '. Unfortunately, they wrapped up without an agreement, but they were, at least at that time, final. So that is kind of been the bumpers that we have. And so but in short, it is really to just respond to the fact that it is an applicant led process.'",
        "'speaker_8': 'And we tried to insert our our guidance where we can.'",
        "'speaker_4': 'Thank you. I have one more question for the property owners. So in 2018 that you or whoever, whether you or it was someone who had the property under contract, applied for some X three in 2019, you or whoever, whoever led the application applied for msmx3.'",
        "'speaker_4': 'When you put this property up for sale again, did you talk to whoever you had it under contract with and tell them that this type, this exact zone district has failed twice and that you might want to go through the drawing board and you might want to sit down with CPD and do a charrette and figure out'",
        "'speaker_4': 'a different zone district that might be more compatible with the neighborhood. Is that something that you, you and whoever have you have this under contract, had those discussions.'",
        "'speaker_2': 'Yes. And we actually sat down with Councilwoman Sawyer and did have discussions about what we were talking about doing and and through talking to l.a. Councilman sawyer. And we felt mediation was the best direction we could go with that and have more conversations around it.'",
        "'speaker_2': 'The first time that it fell through, the buyer removed themselves. And and so the second time it came through was with the group we're talking to today.'",
        "'speaker_4': 'So if I'm hearing you correctly. This same buyer has. This is the second time that they're trying to rezone the property.'",
        "'speaker_2': 'And I guess we withdrew to further mediation. So that gave us more time to chat with the homeowner's association. And David, if you want to talk to that, and I think you can do it and I'm not giving you all the information.'",
        "'speaker_2': 'And I apologize if I'm not.'",
        "'speaker_4': 'So then who? Who hired Holland and Hart?'",
        "'speaker_2': 'That would be Belko.'",
        "'speaker_4': 'So Belko hired. When did you hire him? In part.'",
        "'speaker_2': 'I don't know the exact date, but we've had them for roughly the last 6 to 8 months and I could I don't know the date. So.'",
        "'speaker_4': 'And were they part of the relay part of the mediation process?'",
        "'speaker_2': 'They were in the last. Were they in the last mediation? Maybe not. I don't remember if they were in on that or not. Kerry may have an idea of that. I can I can chime in. They were in Holland.'",
        "'speaker_2': 'Holland and Hart was not involved in the pre. Thank you. There were a lot of people involved. I apologize.'",
        "'speaker_3': 'And I'll just.'",
        "'speaker_0': 'Get another question. I'll go ahead. Jim and Claire, I was.'",
        "'speaker_2': 'Just going to add that, you know, a big reason back in October of 2019 that it was withdrawn was because of, you know, obviously the public outrage. Right. And so a big thing we focused on in early 2020 was reaching out to a the public and via the council staff, specifically, Councilman Sawyer.'",
        "'speaker_2': 'But we did I think we met with almost all of the council members or at least whoever we could. It was during the beginning of the pandemic. And I believe we did meet with you, Councilman Sandoval, back in March of 2020.'",
        "'speaker_2': 'Just to go through it, because there is history on this that's it's not a normal site. You know, it has a lot of a lot of hair and obviously 100 topics every.'",
        "'speaker_4': 'Okay. I just have one more question. Thank you. And I know I'm talking super slow.'",
        "'speaker_3': 'So I'm so sorry about that.'",
        "'speaker_4': 'And if I talk any faster, I won't be able to.'",
        "'speaker_0': 'You're good.'",
        "'speaker_4': 'Thank you. So to the owner. How long have you had the property up for sale and how many potential buyers have you worked with?'",
        "'speaker_2': 'So the property's been up for sale. I believe since around 2016. As far as potential buyers, I can't tell you how many. People made offers on the property or put in bids on the property. But to my knowledge to.'",
        "'speaker_4': 'Okay. That's it. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sandoval. And seeing no other questions. The public hearing is closed. Comments by members of Council on Council Bill 404. Councilmember Sawyer.'",
        "'speaker_4': 'Thinks that I'm president. There's clearly a lot of history on this site. I want to thank the residents of Range View and Belco and Murphys, as well as our mediator Steve Charbonneau, for the hard work and the attempts to find a resolution on what to do with this property.'",
        "'speaker_4': 'You all worked really hard and I'm sorry that you couldn't come to some sort of positive conclusion on that. I do have a number of concerning concerns about this rezoning. So let's talk a little bit about the criteria to start.'",
        "'speaker_4': 'I don't believe it's consistent with adopted plans. Councilman Flynn touched on this a little bit in his questioning. There is no neighborhood plan for the area, so you have to look at blueprints and the whole lot in question.'",
        "'speaker_4': 'Is designing this community corridor suburban context? The description in blueprint of a community corridor clearly states and I'm quoting here, buildings have a distinctly linear orientation along the street with narrow setbacks and give active ground floors along community corridor to create interest and engage patrons as they walk by, end quote.'",
        "'speaker_4': 'Most importantly, another quote here Transitions between corridors and low scale residential are important and quote here There is no transition between the community corridor and the single family homes immediately adjacent to this parcel, which are designated residential low in blueprint.'",
        "'speaker_4': 'This parcel is being turned into that transition. Additionally by their very title drive thru services do not create interests and engage patrons as they walk by their automobile heavy users and they discourage walkability and ground floor activation, which blueprint Denver specifically calls for in this area.'",
        "'speaker_4': 'On this cell lines, I know we're considering zoned district and not the use in this situation.'",
        "'speaker_3': 'But this zone.'",
        "'speaker_4': 'District allows all sorts of potential forms, including drive thrus and gas stations. In short, it's not consistent with blueprint. Additionally, the proposed district does not promote the uniformity that's required. So Councilwoman, seeing the ball brought this subsection three point, 2.4.1 of the Denver zoning code says, and I'm quoting here, Section A The mixed use zone districts are'",
        "'speaker_4': 'intended to promote safe, active, pedestrian, scaled, diverse areas and enhance the convenience and ease of walking, shopping and public gathering within and around the city's neighborhoods. And Section D, the mixed use zone district standards are also intended to ensure new development contributes positively to established residential neighborhoods and character, and improves the transition between commercial development and adjacent'",
        "'speaker_4': 'residential neighborhoods. End quote. Again, I know we're considering the zoning district and not the use in this situation. This zone districts allows potential forms like drive thrus and gas stations by possibly, possibly allowing a gas station on this parcel, which is allowed under the S-Max three zoning.'",
        "'speaker_4': 'We are not being consistent with the suburban neighborhood context and the zone district purpose required by criteria is again, a car centered use doesn't promote walkability or public gathering, and a gas station certainly doesn't contribute positively to the established residential neighborhood right next door.'",
        "'speaker_4': 'Other zoning would look better into the context of this neighborhood and would have made sense with regards to the transition to low density residential in the adjacent neighborhood. But this isn't it. Finally, and I think most importantly, this rezoning doesn't further health, safety and welfare.'",
        "'speaker_4': 'Again, I know we're considering this own district and not the use in this situation. But this zone district allows all kinds of potential forms, including drive thrus and gas stations. And the potential for these uses on this property is a threat to the health, safety and welfare of the community members.'",
        "'speaker_4': 'It's the causal link between benzene emissions from gas stations and health impacts such as cancer has been debated historically, but many cities have recognized the significant concern to residents on this issue and taken steps to address it. We heard testimony earlier this evening.'",
        "'speaker_4': 'Many of these residents are using well water, according to the 2015 front porch article quotes examples in other cities where zoning mandated spacing exists to protect homeowners from the negative health impacts of gas stations are Milford, Connecticut, where gas station cannot be within 300 feet of housing.'",
        "'speaker_4': 'Raleigh, North Carolina, where a city level approval must be obtained if a gas station will be within 400 feet of housing. And Chicago, Illinois, where neighbors within 150 feet must give approval before a gas station can be built within that distance.'",
        "'speaker_4': 'Denver doesn't have any language in our zoning code that would require setbacks of any distance between a gas station and housing. And frankly, I think what we've identified here is an opportunity to correct that issue. Nevertheless, we have an ethical responsibility to ensure that any infill development we approve will not adversely harm the health of our residents'",
        "'speaker_4': '. And I don't believe that we can affirmatively say that in this case. Additionally, the hours of operation of any potential drive thru or gas station facility would adversely affect this community. We heard testimony that most of the residents concerns in mediation could be overcome, but the gas station hours can't be shortened enough to fit the applicant's business'",
        "'speaker_4': 'model and work for the neighbors. It's not unreasonable for the community to ask for more than a few hours without the noise and pollution coming from a gas station. I can name at least one other site in District five where there is a vehicle oriented service adjacent to housing, and my office regularly receives noise complaints on that'",
        "'speaker_4': 'property. Those residents have been able to clearly show that the use has negatively impacted their quality of life. And the same thing will happen here. By approving this rezoning, we are asking residents to take on potential health and quality of life burdens that they never imagined and never agreed to when they purchased their homes.'",
        "'speaker_4': 'It's also something city planners specifically designed against in our adopted plans and in our zoning code. So, Madam President, I don't support this rezoning. I'll be a no tonight, and I would urge my fellow council members to do so as well.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Sawyer. Next up, we have council member Black.'",
        "'speaker_4': 'Thank you. Council President Gilmore. I know a protest petition was filed and in controversial rezonings. It's really difficult to overcome those. I do have some issues with the protest petitions that I will bring up at another time, but all I can say that this is a really great example of why spot zoning is a problem.'",
        "'speaker_4': 'No fault of the property owner. The current zoning basically prohibits any use of that property. They don't need it to be there for a drive thru. They have no need for that and so there actually is no use to it, which actually makes it without value.'",
        "'speaker_4': 'And so there. Put in a terrible position again at no fault of their own. And so there the area sits, just unused asphalt radiating heat, which is not a good thing and is definitely not good for our climate or for our health and safety and welfare.'",
        "'speaker_4': 'I'll again say that council does not approve development plans and we don't decide whether a gas station or a coffee shop or a dental office is built. We approve zoned districts and our job is to make sure an application meets the criteria.'",
        "'speaker_4': 'And I think CPD did a great job showing us that some x three does meet the criteria. Of course, I do understand why neighbors care what goes on this parcel. But what I heard loud and clear is that they're opposed to the use, not to the zone district.'",
        "'speaker_4': 'But again, neither neighbors nor council get to decide what a private property owner does with their property. As long as the laws are met. We've had in my time on council quite a few rezonings similar to this that are on a commercial street but adjacent to a residential neighborhood.'",
        "'speaker_4': 'And the neighbors objected because they didn't want, you know, higher intensity use or any use adjacent to their neighborhood. But in many of the cases I'm thinking of, and in this case, the parcel wasn't actually in the neighborhood, it's adjacent to the neighborhood.'",
        "'speaker_4': 'And this, I guess, part of the good neighbor discussions was that they weren't even going to have any access to the residential street was owned only on Mississippi. As I said earlier, I live near Hampton and I also live near Colorado Boulevard.'",
        "'speaker_4': 'And while commercial development is not appropriate in my neighborhood, I do think that commercial development is appropriate on those streets that are adjacent to the neighborhood. And our plans do encourage that. As a next three is recommended by CPD and is a lower intensity use.'",
        "'speaker_4': 'And again, we are not being asked to approve a gas station but a zone district. So adhering to the role that council has, which is to evaluate the criteria, I do believe that the criteria has been met. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Black. Next up, we have Councilman Cashman.'",
        "'speaker_1': 'Thank you, Madam President. Yeah, I. Councilman Sawyer pretty much said exactly what was on my mind. Recognizing that our job is not to assess a particular project, to assess the appropriateness of the zone district. I think a zone district.'",
        "'speaker_2': 'That.'",
        "'speaker_1': 'Includes allowance for uses.'",
        "'speaker_2': 'That are a threat to the health, safety and welfare of the adjoining neighborhoods.'",
        "'speaker_1': 'Is not the appropriate zone district.'",
        "'speaker_2': 'Unfortunately for the applicant.'",
        "'speaker_1': 'That's the case with this zone district. And so.'",
        "'speaker_2': 'I will.'",
        "'speaker_1': 'Also.'",
        "'speaker_2': 'Be voting against this evening.'",
        "'speaker_0': 'Thank you, Councilman Cashman Council Pro Tem Torres.'",
        "'speaker_3': 'Thank you so much. So it's been interesting to kind of layer some of what we're talking about with blueprint and community corridors as they are experienced in this part of Denver versus how they're experienced in in the west side in West Denver.'",
        "'speaker_3': 'Federal Boulevard is the community corridor. Alameda, Colfax, Sheridan are community corridors. These are not local corridors, which I think of when I when I think of 32nd and Lowell, where you do have much lower intensity kind of shop at districts kind of boutique locations.'",
        "'speaker_3': 'When I think of Federal Boulevard, I'm a little envious that this might be the only circumstance that folks kind of speak to when they talk about possibly living next to a gas station or an auto service location. That is all we have on Federal Boulevard.'",
        "'speaker_3': 'So that brings up for me some of the health and safety issues that I think some of the residents rightly mention. Maybe we don't need more new gas stations and we've got to regulate that out, but we don't have those kinds of regulations in place just now.'",
        "'speaker_3': 'And it's definitely something that I think if we are serious about climate goals, it could be something that we look to in and starting to eliminate kind of our proclivity to approving rezonings that allow for drive thrus for gas stations, for a variety of different things within context where you can get a lot of other things like'",
        "'speaker_3': 'a mixed use development. But I am swayed, I think, by the strict criteria and what this is looking like and the zone district itself, and we'll be voting in favor of it. All right.'",
        "'speaker_0': 'Thank you, counsel. Pro Tem Torres. Councilman Herndon.'",
        "'speaker_1': 'Thank you, Madam President. I appreciate the time we have taken to go through these conversations. I do feel that the criteria has been met and so I will be supporting vote in support. I just I'm bothered by the language that has been used by some of the applicants.'",
        "'speaker_1': 'And I just really feel the need to just to state this, you know, we don't need to.'",
        "'speaker_2': 'Exaggerate.'",
        "'speaker_1': 'Your case just in a state the reasons why you in support an opposition and that's fine. Everyone can't be adjacent to the gas station next to. And I, I just feel the need to say that. And, you know, my son is in kindergarten.'",
        "'speaker_1': 'Lucy is one of his classmates. She lives across the street from our house. That's not a Jason. Just just state the case. I just wish we wouldn't do those things. And hearing things about property values and crime, about who you think is going to use this gas station, I think gets to the conversations about privilege that we're'",
        "'speaker_1': 'having. And I just want I want people to hear what they're saying. And I don't know if my other colleagues were struggling with some of the things that people were saying. It just really didn't sit well with me, has nothing to do with why I believe I'm in support.'",
        "'speaker_1': 'I do believe that criteria has been met, but I just I want to encourage people to hear what they are saying. Sometimes we have conversations. And then lastly, just on a side note, I appreciate Councilwoman Sawyer bringing up the front porch article because we had an exhaustive conversation in the Central Park neighborhood about gas stations.'",
        "'speaker_1': 'And I know so much more about benzene than I ever thought I would want to know or should, because there was a question about where they should be built in Central Park. And I felt and not not felt, but all my conversations with Didi, because they did build a gas station off of North Shore Boulevard and then'",
        "'speaker_1': 'one an East Bridge that were across the street, not adjacent to household residents. And there was no reason to believe that there were additional health concerns. And so I'm very familiar with that. And so hearing about health concerns, I from my conversations with the health experts, that was not an issue.'",
        "'speaker_1': 'Just a sidebar. I want to bring that up since Councilwoman. So I referenced the front porch from Central Park, so I will be in support. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Herndon, we have Councilmember Ortega up. And just a quick reminder, we have two more public hearings after this one as well. Go ahead, Councilmember Ortega.'",
        "'speaker_9': 'Thank you, Madam President. I'll be brief. Many of my comments have been made on both sides on this issue, and I just wanted to highlight that we've been having a conversation about health, safety and welfare with many projects that have come in and been resolved and are built next to railroad tracks.'",
        "'speaker_9': 'That store in many cases because there are cars that sit on those tracks, many types of hazardous or hazardous materials slash flammable liquids. We're getting really close to bringing something before council. We've been doing extensive research from the only place where standards actually exist, and it's in cities in Canada.'",
        "'speaker_9': 'So where we're talking about real potential for impact from proximity to genuine hazardous materials. We have no standards and it is our responsibility under homeland security. There is an expectation not just not just a responsibility, but an expectation of local government leaders to address where our vulnerabilities are and to have things in place.'",
        "'speaker_9': 'And so I'm bringing that up because when we talk about comparisons of how we look at how zoning is applied across our city, it's it's almost as though at times we have a double standard. And I believe on this particular application, the criteria has been met and I will be supporting it tonight.'",
        "'speaker_9': 'But I just want to give you a heads up to be looking forward to the draft ordinance that we'll be bringing. We're going to be meeting with a couple key city agencies before we bring that forward. But this is.'",
        "'speaker_9': 'A long overdue issue that will help address part of the inequities that often exist when we deal with our rezoning applications. So thank you.'",
        "'speaker_0': 'Thank you, Councilmember Ortega, and appreciate the time that we had community members here and that we had our discussion as well and really looking at the criteria that we need to evaluate this on. It is the zoned district and I do believe that the criteria has been met and I agree with Councilmember Ortega.'",
        "'speaker_0': 'Sometimes it does seem like we live in two different cities. Quick example from my home in Montebello, where I live. I did a quick Google search. I have over 25 7-Eleven. In the surrounding area right from my house in Montebello.'",
        "'speaker_0': 'So I am concerned about the equity that we are actually talking about when we talk about the end use versus the zoned district. And so given that I believe all the criteria has been met, I will be voting in favor of this tonight as well.'",
        "'speaker_0': 'And a quick reminder, council members, since community planning and Development has determined that the requirement for a legal protest has been met, ten affirmative votes instead of the standard seven affirmative votes of council are required to pass this bill.'",
        "'speaker_0': 'And so we are going to go ahead and. Madam Secretary, roll call, please.'",
        "'speaker_3': 'Sawyer.'",
        "'speaker_4': 'No.'",
        "'speaker_3': 'Torres. I. Black I. See tobacco. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Hines.'",
        "'speaker_2': 'Now.'",
        "'speaker_1': 'Cashman No.'",
        "'speaker_4': 'Can I?'",
        "'speaker_3': 'Ortega. I. Sandoval.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_3': 'Nine eyes, three days.'"
    ],
    "Denver Zoning Code Amendments and Restatement.": [
        "'speaker_0': 'Nine Eyes Council Bill 20 1-0404 has failed. We're going to go ahead and move on to our next item here. We need to do a point of clarification. Tonight, council voted to postpone final consideration of Council Bill 20 1-0516 and it looks like a motion was inadvertently skipped and so is a point of clarification.'",
        "'speaker_0': 'For the record, the previous and last vote on Council Bill 21, Dash 0516 will be reconsidered so that the minutes can correctly reflect and be corrected the intended action accurately. And so Council Member Flynn, we're going to go ahead and do this now before we get into the next two public hearings.'",
        "'speaker_0': 'And so would you please make a motion to reconsider the last vote on Council Bill 21, dash 516 for us, please.'",
        "'speaker_1': 'Certainly, Madam President, I move the council bill 20 1-0516. Be reconsidered. If I get.'",
        "'speaker_0': 'Thank you. We've got the motion and the second. Any questions or comments by members of council? All right. Seen none. Madam Secretary, roll call on the reconsideration of Council Bill 21, dash 20516.'",
        "'speaker_4': 'Black I.'",
        "'speaker_3': 'Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Hines. I guess.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Can I? Ortega. I. Sandoval. I. Sawyer. I. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_3': '12 Eyes.'",
        "'speaker_0': '12 Eyes. Final Consideration of Council Bill 21, Dash 516 will now be reconsidered. Councilmember Flynn, can we get you to please put Council Bill 516 on the floor for final passage as amended?'",
        "'speaker_1': 'I think I can be persuaded into that. I move the council bill 21, dash 20516 be placed upon final consideration and do pass as amended.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you. Thank you. We've got the motion. And I believe I got that second from Councilmember Herndon. Councilmember Herndon, your motion to postpone.'",
        "'speaker_1': 'Yes. Now that I move that final.'",
        "'speaker_2': 'Consideration, the council bill 21 to.'",
        "'speaker_1': '0 516 with its public hearing be postponed to Monday, June 28th, 2021.'",
        "'speaker_0': 'Very good. We've got the second, I believe, by Councilmember Flynn, questions or comments by members of council. Councilmember Herndon.'",
        "'speaker_1': 'Yes, ma'am. Apologies to my colleagues. We are doing this because I failed to do the motion earlier when I was looking at the wrong line on the script. So my apologies. Thank you.'",
        "'speaker_2': 'Marcus, for trying to correct me my mistake earlier, but we need to do it over. So I got it right the second time. Thank.'",
        "'speaker_0': 'All right. Thank you, Councilmember Herndon. We've got the postponement for final consideration to the meeting posting requirements, and I don't see any other hands raised, so. Madam Secretary, roll call on the postponement, please.'",
        "'speaker_3': 'Herndon, I. Hines.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Cashmere.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Can I? Ortega, I. Sandoval. Hi, Sawyer. I. Torres I. Black I. Clark.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'So I.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce results.'",
        "'speaker_3': '12 eyes.'",
        "'speaker_0': '12 eyes. Final consideration of Council Bill 21, Dash 516 with its public hearing is postponed to Monday, June 28. All right, we got that one all taken care of. And so now we are moving on to our second public hearing.'",
        "'speaker_0': 'And a reminder, we have one more after this. And Councilmember Flynn, would you please put Council Bill four or six on the floor for final passage, please?'",
        "'speaker_1': 'Yes, Madam President. Thank you. I move that council bill 21, dash 0406 be placed upon final consideration and do as.'",
        "'speaker_0': 'Thank you. We've got the motion and the second the required public hearing for Council Bill 406 is open. Maybe please have the staff report and we have Scott Robinson here, I believe. Oh, let me see. Scott, your audio doesn't seem to be working for us.'"
    ],
    "Rezoning of Property in City Park West.": [
        "'speaker_0': 'No. Go on it. No. Okay. We're going to go ahead. We have had this issue before and so Scott's going to go ahead and get back in and join us so that he can do the staff report. And so if our legislative analysts can be looking for Scott as he returns.'",
        "'speaker_0': 'Let's check your audio now, Scott.'",
        "'speaker_2': 'Can hear me now.'",
        "'speaker_0': 'Yes, we can hear you now. So. All right. Go ahead with the staff report, please.'",
        "'speaker_2': 'All right. Thank you. Sorry about that again. Scott Robinson with plenty in development. And share my screen here. This is a request to rezone 2101 and 2105 North Humboldt Street from student over 74 to UMC to Property is located in Council District nine in the City Park West neighborhood.'",
        "'speaker_2': 'It is at the northwest corner of Humboldt Street and 21st Avenue, just north of the Uptown Hospital District. Property is about half an acre in size, and it is currently home to the Gerri's Nut House business, which is a business that manufactures packages, distributes and sells nuts and other snacks.'",
        "'speaker_2': 'And so the applicants are requesting a rezoning to allow the addition of a hardware store to a portion of the building. The building would remain, and the jury's that house business would remain in a portion of the building and a portion of the building would be converted into a hardware store.'",
        "'speaker_2': 'Here you can see the existing zoning. I won't get into what the puta says on the next slide, but you can see it's surrounded on three sides by the u t u v zoning. That's two unit residential zoning with a mixture of some.'",
        "'speaker_2': 'You mix two and two x nearby and then the hospital zoning across 21st Avenue to the south. The Peabody was adopted in 1982, and it allows basically the existing business retailing, selling, processing and packaging of food in the existing building as it is built.'",
        "'speaker_2': 'No additions or changes are allowed over the TV. But you can see the existing language says the jury is not. House business comes off as industrial, surrounded by a mixture of single unit two unit and multi-unit residential with some mixed use, commercial civic uses and other industrial uses mixed in north of 21st Avenue and then again south'",
        "'speaker_2': 'of 21st Avenue. Our hospitals and medical uses. You can see the property in the photo in the bottom. Right. And then some of the surrounding property in the other photos. The proposed zoning is you. Me too. Which is urban context.'",
        "'speaker_2': 'Main Street zoning with a two storey maximum height. It would allow a range of commercial, residential and civic uses in the town house drive thru services, drive thru restaurant and shopfront building forms with a maximum height of two stories for 30 feet and would require buildings to be built up to the street within a dot to requirement'",
        "'speaker_2': 'and also includes transparency requirements to create a walkable urban environment. This application went to planning board on March 31st of this year, received a unanimous recommendation of approval by two members of the public spoke. They raised concerns about the impacts on parking and the impacts on.'",
        "'speaker_2': 'Sailing along buildings to the north. This went to the Land Use Transportation and Infrastructure Committee on April 15th. You have in your packet letters of support from three registered neighborhood organizations Capitol Hill. United Neighbors. City Park. West. In October on the Hill.'",
        "'speaker_2': 'In order to approve a rezoning, the city must find that these five criteria have been met. The first criterion is consistency with adopted plans. There are three adopted plans that apply to this property. First is Comprehensive Plan 2040, as described in the staff reports test on its proposed rezoning, consistent with multiple strategies from efforts at Plan 2040'",
        "'speaker_2': ', including these which are related to supporting small businesses and appropriate infill development. In terms of equity, Stephane supposed resulting consistent with these strategies for the equitable, affordable and inclusive vision element of company in 2040 relating to providing services and amenities in neighborhoods and supporting small businesses.'",
        "'speaker_2': 'And in terms of climate stuff, I'm suppose presenting consistent with these two strategies from the environmentally resilient, the resilient vision element of plan 2040, again relating to install development and mixed use development. The second plan is Blueprint Denver from 2019.'",
        "'speaker_2': 'The future context designation for this property is urban, which calls for a mixture of mixed use and commercial embedded into residential neighborhoods, which is consistent with the proposed rezoning and consistent with the proposed new urban neighborhood context of the US two zone districts.'",
        "'speaker_2': 'The future place designation is low residential, which calls for predominantly single and two uses, but with limited mixed use where commercial uses are already established, which is the case here, and heights up to a maximum of two and a half storeys, which the proposed running up to two.'",
        "'speaker_2': 'Both 21st Avenue and Humboldt Street are local streets, providing local access to the property. The future growth strategy in this first priority is all other areas of the city intended to accommodate 10% of new jobs and 20% of new housing by 2040.'",
        "'speaker_2': 'These are consistent with the proposed rezoning and blueprint. Denver also includes other strategies and recommendations, including Policy three Strategy A relating to rezoning properties out of former Chapter 59 into the Denver zoning code, which this proposed rezoning would do.'",
        "'speaker_2': 'The third plan is the new central area plan adopted this fall. It has the same urban context and low residential place designation, which again calls for liquid and mixed use where commercial uses have already been established, which again is the case for this application.'",
        "'speaker_2': 'It also calls for promoting and protecting small businesses in the area north of 21st Avenue in the City Park neighborhood, which is where this property is located. And the proposed rezoning would help facilitate that and would also help maintain appropriate small scale, mixed use zoning in these areas with the appropriate building forms and set back requirements.'",
        "'speaker_2': 'So staff finds the proposed rezoning consistent with the adopted plans and the first criterion. The second criterion is uniformity of district regulations. That finds the proposed rezoning would result in uniform application of the units to zoned districts. The third criterion is to further the public health, safety and welfare of the city.'",
        "'speaker_2': 'Staff finds the proposed rezoning would do so by implementing the city's adopted plans, allowing for expanded uses to serve the community in this area and also requiring building form and design if the property is at some point in the future redeveloped.'",
        "'speaker_2': 'The building would be brought up to the street with transparency, creating a pedestrian friendly and safe environment. Loading, walkability and health will serve. The fourth criterion is justifying circumstances. Staff finds the proposed rezoning justified by the change for changing conditions in the area.'",
        "'speaker_2': 'First, that the property is retained over Chapter 59 zoning, and this is done into the zoning code and also newly adopted plans in the area. The sex area plan, as I mentioned, was adopted just last year and calls for strengthening this commercial zoning, mixed use zoning, inappropriate locations at City Park West.'",
        "'speaker_2': 'The fifth criterion is consistency with neighborhood context, zone history, purpose and intent. Staff finds the proposed rezoning would result in development consistent with the urban neighborhood context, description and the purpose and intent of the movements to zone districts.'",
        "'speaker_2': 'And with that staff finds all criteria have been met and recommends approval of the evidence to answer any questions.'",
        "'speaker_0': 'All right. Thank you, Scott, for the staff report. And tonight, counsel has not received any written testimony on Council Bill 21, Dash 0406. And we have two individuals signed up to speak this evening. And our first speaker is Steve Farris.'",
        "'speaker_0': 'And you're going to have to go ahead and unmute, Steve. All right, we've got Steve in the queue, but Steve, we need you to go ahead and move, please. All right. Well, unfortunately, we might have had. Steve. Oh, there you go.'",
        "'speaker_0': 'Are you with us, Steve?'",
        "'speaker_2': 'Oh, well, I'm Steve and Julia. I'm also signed up to speak. I. Owned and operated Jerry's Nut House at 21st. And Campbell so I'm happy to speak if I'm a head of Steve now.'",
        "'speaker_0': 'Yeah, we had Steve Ferris and then Steve and Julian, we've got you both up on the screen as Steve Ferris. So go ahead.'",
        "'speaker_2': 'Sorry about that. So my name's Steven Julia. I own and operate Jerry's house. I'm a third generation of my family to operate it. My grandfather started over there on the same site in 1948, and to be honest, I'm just trying to find a way to continue my family business in that area and add something as I look'",
        "'speaker_2': 'over in coal. And, you know, over time, the neighborhood's evolved a lot and it doesn't totally suit what we can afford that Jerry's not house based on the space and the property taxes. So I'm after a long thought, I thought about adding a retail use that would be useful for the neighborhood and frankly for me myself living'",
        "'speaker_2': 'in the neighborhood and my wife and I settled on Ace Hardware. And that's really why we're trying to change the zoning. And we have been working on getting some additional parking in the area for additional employees and customers.'",
        "'speaker_2': 'We historically have had a parking agreement with Campbell Chapel across the street, so I'm hoping will rekindle that with us so we can have additional parking right across the street. If not, we'll find some more elsewhere. But yeah, I mean, I just want to stay there.'",
        "'speaker_2': 'I grew up there. I still live in the area and I want to keep my family. So that's why I'm asking for rezoning. I'm happy to answer any other questions. Thank you.'",
        "'speaker_0': 'All right. Great. Thank you, Stephen. We appreciate that. And not seen the actual seafarers in the queue here. And I looked in the attendee so we don't have him in there either. We will go ahead and close. The public hearing comments by members of Council on Council Bill 406, please.'",
        "'speaker_0': 'Give it a moment here. Councilmember Hines.'",
        "'speaker_2': 'Thanks, Madam President. Excuse me. Thank you. Council President. I think the council member for this district isn't here. But I used to live just a few blocks west of this for a long time. And I used to use this route to I used to go right by Jerry's nuthouse when I went to the doctor and when I'",
        "'speaker_2': 'moved to Uptown and in 2008, my dog was very active. She was a passenger, and I would take her to City Park every day using that route along 21st. And so I think that this meets the criteria. But but I also wanted to give a plane for for Jerry Scott House and being an institution in the in'",
        "'speaker_2': 'the community. I also want to want to say that there is a dearth of hardware stores in this area, particularly considering the amount of people who have moved into both City Park West and Uptown and, you know, and Capitol Hill, for that matter.'",
        "'speaker_2': 'And the closest hardware store is on 12th, I think, which is an ace, but it is not wheelchair accessible. I'm not sure how they're able to remain in business, but without being accessible. But either way, I think that there is there's certainly an opportunity for, you know, for Mr. Ferris excuse me, not Mr. Ferris, but Jerry's no'",
        "'speaker_2': 'house to accommodate a hardware store. And I think that the neighbors would love it as well. Again, we're considering the rezoning, not the not the use side, but but I'm really excited for for this opportunity. Thank you, council president, for letting me pinch hit for District nine.'",
        "'speaker_0': 'All right. Well, thank you, Councilmember Hines. And not seeing anybody else with their hands raised as far as comments. I do agree that this does meet all of the rezoning criteria and I'm happy to support it this evening.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 406, please.'",
        "'speaker_4': 'Black I.'",
        "'speaker_3': 'Claire.'",
        "'speaker_2': 'All right.'",
        "'speaker_3': 'Flynn. I earned it.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Hines.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Can I?'",
        "'speaker_3': 'Ortega. I. Sandoval.'",
        "'speaker_4': 'I. Sawyer, I.'",
        "'speaker_3': 'Torres. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the Iranian announce the results.'",
        "'speaker_3': '12 Eyes.'"
    ],
    "Zoning Change for 2162 South Grant Street in Rosedale.": [
        "'speaker_0': '12 Eyes. Counsel Bill 20 1-0406 has passed. We are now on the homestretch. Our final public hearing tonight. Councilmember Flynn, would you please put Council Bill 424 on the floor for final passage?'",
        "'speaker_1': 'Yes, Madam President. Thank you. I move that council bill 21, dash zero 4 to 4 be placed upon final consideration and do pass.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The required public hearing for Council Bill 424 is open and I see we have Libbey here for the staff report.'",
        "'speaker_4': 'Yes. Can you hear me?'",
        "'speaker_0': 'Mm hmm. Go ahead.'",
        "'speaker_4': 'Okay, great. I'll share my screen. Okay. So I'm Louisianans with community planning and development and I'll be presenting the Map Amendment application at 2162 South Grant Street. This application is located in Council District six in the Rosedale neighborhood.'",
        "'speaker_4': 'The applicant is requesting to resign from UCC to YouTube, which allows the Urban House building for a duplex tandem house and then as well as accessory dwelling unit accessory building for the site is located on Grant Street, just in the block south of Evans Avenue.'",
        "'speaker_4': 'As stated previously, the existing zoning is urban single unit C, so this allows for the Urban House primary building form on a minimum zone, lot size of 5500 square feet. You can see it just on the west side of Grant Street.'",
        "'speaker_4': 'The zoning is YouTube. And then when you move to the east side of Grant, it's mostly us. You see, with the exception of the property directly north, which was rezone from UCC to YouTube in 2020. The Washington Park View Plan is applicable to the site with maximum heights between 95 and 98 feet, and which will impact any'",
        "'speaker_4': 'future development as that's greater than what the proposed YouTube would allow. Existing land use is single unit residential. And you can see this area is kind of a mixture of single to unit and then multi-unit residential. This slide shows the existing building form and scale with the subject property on the upper right hand side.'",
        "'speaker_4': 'This is one of those sites where the building was constructed on the very back portion of the lot. AS That's why you can't really see it in the picture. And then it just south there's a single unit home and then one of the duplexes across the street.'",
        "'speaker_4': 'This application was complete in the middle of January, and a postcard notifying neighboring property owners within 200 feet of the site was sent out on January 22nd. The planning board heard this application in early April and unanimously recommended approval on the consent agenda.'",
        "'speaker_4': 'And to date, staff has not received any public comment letters. The Denver zoning code has five review criteria that must be met in order for rezoning to be approved. The first is consistency with adaptive plans, and there are three that are applicable to the site.'",
        "'speaker_4': 'The proposed rezoning meets several of the strategies in the comprehensive plan. It will increase development of housing close to transit and encourages quality infill development where infrastructure and services already exist. And Blueprint Denver The future neighborhood context is urban.'",
        "'speaker_4': 'These areas are mostly single and two unit residential areas with some multi-unit and mixed use embedded throughout. There's regular block patterns with alley access. The future place type is low residential and these are predominantly single and two unit residential uses on smaller lots.'",
        "'speaker_4': 'And then Grant Street is a local street, which is also also most like mostly characterized by residential uses. Blueprint also provides further guidance on when it's appropriate to rezone from a single unit, stone district to a two unit zone district.'",
        "'speaker_4': 'And this request depends upon three things small area plan guidance, neighborhood input in existing zoning patterns. So I'll discuss the small area plan guidance in a bit. And the applicant received mostly support from neighboring property owners, which you can find in the application that was submitted.'",
        "'speaker_4': 'And then we've discussed that there is a pattern of the two unit zoning in this area as it's all along the western side of great and then directly north of this street. And there's also more criteria for when you're proposing to rezone to a district with a smaller minimum zone size.'",
        "'speaker_4': 'So in this case, going from the C size to the B size. And for that and there needs to be a pattern of smaller lots with similar uses. So this map shows kind of the average lot size in the area.'",
        "'speaker_4': 'And you can see that it is mostly smaller than what the C district is and maybe more consistent with a B. And then the growth area strategy is all other areas of the city. This is where we anticipate to see 20% of new housing and 10% of new job growth by 2040.'",
        "'speaker_4': 'And so a rezoning to a two unit district would allow for a minimal amount of growth in density consistent with this growth area strategy. This area is a half a mile from the Evans Light Rail Station and it's also included in the Evans Station area plan.'",
        "'speaker_4': 'So while the actual site is not on the map, the urban residential concept area in the plan does include the area that goes all the way between the alley, between Grant and Logan Street. And so that would include this eastern half of the block along the eastern side of Grant Street.'",
        "'speaker_4': 'To the western half of that block. And it describes urban residential areas as appropriate for single family duplex accessory dwelling units and row houses. So a rezoning to a two unit district to allow a duplex would be consistent with the urban residential guidance in the EP and station area plan.'",
        "'speaker_4': 'Star finds that the Arizonan meets the next two criteria. It will result in uniformity of district regulations and will further the public health, safety and welfare primarily by implementing adaptive plans and allowing greater density in close proximity to a light rail station.'",
        "'speaker_4': 'There's also a justifying circumstance and changing conditions. I mean, the guidance and blueprint Denver on when it's appropriate to rezone to a two unit district with a smaller minimum zone that size, as well as changing conditions in the area, including new development near the Evans Light Rail station, as well as the rezoning just next door directly north'",
        "'speaker_4': 'of this site to a two unit sound district. And lastly, staff finds that the proposed rezoning is consistent with the urban neighborhoods context, the residential zoned districts purpose and then the specific intent of the You TV Zone district.'",
        "'speaker_4': 'Therefore, staff recommends approval based on finding that all five criteria have been met. And that concludes my presentation.'",
        "'speaker_0': 'All right. Well, thank you, Libby. And thanks for folks staying with us with us this evening. And counsel has not received any written testimony on counsel Bill 21, Dash 0424 and we have one individual signed up to speak this evening and we will go ahead and go to Nathan Keebler Slingo.'",
        "'speaker_2': 'Nathan Keebler Slingo. I am the applicant. I own the property at 2162 and currently lives here since 2004. And I appreciate and agree with everything that Libby is presented. And available for questions. Thank you.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'All right. Thank you, Nathan. That concludes our speakers this evening. Questions from members of Council on Council Bill 424. All right. Councilmember Flynn.'",
        "'speaker_1': 'Libby. This is about 6/10 of a mile from Evans Station. So what are what is the proximity to transit criteria being gauged on? Is it the Broadway bus corridor? Is that are we saying that people will now walk 6/10 of a mile to to a light rail station?'",
        "'speaker_4': 'Yeah, that's a great question. You know, I think usually within the half mile buffer. So a quarter mile is like the comfort level for typically walking. But a half mile is something that I think we do consider. You know, it's not as close as a half mile is a five minute walk there, but it may be definitely'",
        "'speaker_4': 'walk or a shorter or a longer bike ride. You could say.'",
        "'speaker_1': 'Mile, half mile is usually about 1012 minute walk. Mhm. This is like this is just a little greater than a half mile. And I'm also concerned that you use the Evans Station plan even though technically this parcel is not in the Evans Station plan area.'",
        "'speaker_1': 'You said something about the half block between Graham and Logan. Can you explain that again?'",
        "'speaker_4': 'Yeah. So even though it's not in the map in the Evans Station area plan, if you read the description of the urban residential area, it describes that area as encompassing everything up until the alleyway between Grant and Logan Street, which would include this property.'",
        "'speaker_1': 'Okay. Okay. I did pull the Evans Station plan up while you were talking, so I'll look at that if there are any other questions. Although I don't see any other questions, so maybe I don't have time to do that.'",
        "'speaker_1': 'All right. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Flynn. And not seen any other hands raised for questions. The public hearing is closed. Comments by members of Council on Council Bill 424. Councilman Cashman.'",
        "'speaker_1': 'Thank you. Council President.'",
        "'speaker_2': 'I do believe this application meets the zoning criteria as well as fits well into the existing community context.'",
        "'speaker_1': 'So I'll be supporting this application this evening.'",
        "'speaker_0': 'All right. Very good. Thank you, sir. Councilmember Flynn.'",
        "'speaker_1': 'Hey, Madam President and Councilman Cashman. I concur. It appears to meet the criteria, although I'd quibble about conformity with districts, with area plans when it's not in the area plan itself. But I just want to express an ongoing concern with UPS zoning in single unit neighborhoods to two unit of zoning.'",
        "'speaker_1': 'When I looked at this particular neighborhood, I have seen where duplexes have gone up, prices have gone up. We are not preserving affordability by adding density in these neighborhoods. It's just not happening and it's very troubling. I think the assessed value on this particular parcels, about $450,000, the duplexes across the street are assessed at 600 and $700,000'",
        "'speaker_1': '. Some of the older homes built in the thirties, forties that are on these blocks in Rosedale are some are on Zillow for, you know, 400 or 500 middle 500. But the new duplexes that are taking their place and they're gentrifying the neighborhood are selling in a six and seven hundreds.'",
        "'speaker_1': 'And it's a troubling trend that is displacing displacing neighborhoods. I agree that it meets the criteria, but I think sooner or later we're have to come to grips with the displacing factor of this scrape and building expensive duplexes in their place.'",
        "'speaker_1': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn, and seen no other hands raised. I do believe that this does meet the rezoning criteria and I'm happy to support it tonight. And I guess the only other thing I would throw out, Councilmember Flynn, is that increase in price, though, also houses more people in our city, which we know is a necessity as'",
        "'speaker_0': 'well. And so much more conversation I believe we need to have, especially with host involved, to determine when we are up zoning, what that really means for the broader community. And so with that, Madame Secretary, roll call on Council Bill 424, please.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Can each. I. Ortega. I. Sandoval.'",
        "'speaker_4': 'I. Sawyer. I.'",
        "'speaker_3': 'Torres, I. Black. I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Heinz.'",
        "'speaker_2': 'I. Hi.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '12 Eyes.'",
        "'speaker_0': '12 eyes. Counsel build 20 1-0424 has passed. There being no further business before this body this evening. We appreciate everybody staying with us. This meeting is adjourned.'",
        "'speaker_5': 'Hey.'",
        "'speaker_7': 'It's so good to be back.'",
        "'speaker_5': 'You sit and you try to figure out what's going to succeed. No. Sees a. It is time.'",
        "'speaker_7': 'To seize this. Does. I didn't realize he had given me.'"
    ]
}