{
    "Proclamation for National Peace Officer Day and National Police Week.": [
        "'speaker_0': 'Thank you, Councilwoman Ortega. All right. Seeing no other announcements, we'll move on. There are no presentations. There are no communications. But we do have three proclamations this evening. Councilwoman Black, will you read Proclamation?'",
        "'speaker_7': '555 Thank you, Mr. President. Proclamation 80555 Declaring May 15 as National Peace Officer Day and the week of May 15th is National Police Week. Whereas in 1961, President John F Kennedy issued an executive order declaring May 15th National Peace Officer Day and the week of May 15th as National Police Week.'",
        "'speaker_7': 'And. Whereas during the 159 year history, the over 10,000 individuals who have comprised the Denver Police Department has played an essential role in safeguarding the rights and freedoms of the citizens of Denver, Colorado. And. WHEREAS, during the 159 year history, 72 men and women have paid the ultimate sacrifice by giving their lives in service to protecting the'",
        "'speaker_7': 'citizens of the city and county of Denver. And. WHEREAS, the Denver Police Department and the Denver Police Museum have undertaken a project to place memorial signs to honor our fallen heroes at the locations where they fell. And. WHEREAS, the Denver Police Department and the Denver Police Museum will honor the following fallen officers this coming year with memorial'",
        "'speaker_7': 'signs including Detective Pasquale Si Marinaro, who lost his life on April 17th, 1936. Patrol Patrolman Allison E McCaslin, who was the first motorcycle officer to die in the line of duty on May 28th, 1935. John, FDR and George P Schneider, who were both killed during a burglary on February 11th, 1933.'",
        "'speaker_7': 'And. WHEREAS, the Denver Police Department and the Denver Police Museum also plan to hold special memorials ceremony to mark the 30th anniversary of what Robert Wallace sacrifice. And this is going to be a really long, long days. Whereas the Denver Police Department and the Denver Police Foundation have recognized the following active officers for outstanding service this past'",
        "'speaker_7': 'year, including Officer Joseph Stadler and Detective Rachel Eid, who both received the Medal of Honor. Detective John Metronomes. Detective Kenneth Manzanares. Officer Kevin Burke. Officer Michelle Cooper. Officer Michael Clark. Officer Robert Greaser. Sergeant Robert Stack. Officer Kevin Kirby.'",
        "'speaker_7': 'Officer Jared Tennon. Officer Jose Diaz who all received the Medal of Valor Officer Jeremiah Wright. Jeremy Arthur Technician John Lewis Houser. Officer Hosey Griggs. Officer Eric Cardenas Officer Craig Minor Officer Timothy Luke. Officer Jimmy Sheppard The Third Officer John Crowe.'",
        "'speaker_7': 'Officer Bryce Jackson who all received the Distinguished Service Cross Officer Benjamin Austin. Officer Brett Lake. Sergeant Damon Belzer Officer Randy Yoder Officer Edward Mejia. Corporal William Bastian The Fourth Sergeant Gary Ayers. Corporal Daniel Filkins who all received the preservation of Life Medal and Officer Preservation of Life Medal and Officer Aubrey Thompson.'",
        "'speaker_7': 'Officer Andrew Grob who received the Purple Heart. Detective Adam Golden Detective Luis Estrada who both received Officer of the Year. Sergeant Karla Harvard. Who received the award for Above and Beyond. And finally, forensic scientist Amy Williams, CSA Employee of the Year.'",
        "'speaker_7': 'And. Whereas, this year has been a particularly difficult year for law enforcement here in the state of Colorado, we honor the officers who have lost their lives earlier this year, including Deputy Sheriff Michael Affleck of El Paso County, Deputy Sheriff Heath McDonald of Adams County and Deputy Sheriff Zachary S Parrish, the third of Douglas County.'",
        "'speaker_7': 'And. Whereas, it is important that all citizens know and understand the problems, duties and responsibility of their police department and the members of our police department recognize their duty to serve the people by safeguarding life and property, by protecting them against violence or disorder, and by protecting the innocent against deception and the weak, against oppression or intimidation'",
        "'speaker_7': '. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council Council declared the week of May 15th as police officer, peace officer, Memorial Day and Police Week to honor the active, retired and deceased members of the Denver Police Department who have faithfully perform their duty to protect'",
        "'speaker_7': 'and serve the citizens of the city and county of Denver. Section two that the clerk of the city and county of Denver shall affix. And it's a test and a fix the seal of the city and county of Denver to this proclamation and that a copy be transmitted to the Denver Police Department.'",
        "'speaker_0': 'Thank you. Councilwoman Black, your motion to adopt.'",
        "'speaker_7': 'Thank you, Mr. President. I move that proclamation 18 dash 0555 be adopted.'",
        "'speaker_0': 'It has been moved and seconded. Comments by members of Council. Councilwoman Black.'",
        "'speaker_7': 'Thank you, Mr. President. I am honored to have been asked to sponsor this proclamation, recognizing our law enforcement officers. They are the people who we all call when we need help or when we're in danger. And they risk their lives every day to keep us and our city safe.'",
        "'speaker_7': 'Today, their jobs are more dangerous than ever, and every day they are in harm's way. Too many have made the ultimate sacrifice. As I read in the proclamation, we've got three deputy sheriffs in the metro area who died in the line of duty this week.'",
        "'speaker_7': 'This year. I want to thank Michael Hess, who's with the Denver Police Museum and the Denver Police Foundation for working so hard to honor our officers and keep their memories alive. I had the honor to attend the memorial for Officer Willie O'Steen this winter at Riverside Cemetery.'",
        "'speaker_7': 'Officer Steen was a World War One veteran and the first African-American officer to be killed in the line of duty in Denver. He was buried in an unmarked grave after nearly 100 years. A gravestone was finally installed because of the police museum to mark his grave after almost 100 years.'",
        "'speaker_7': 'I also want to thank our current law enforcement officers. My district is in District three and I am in awe of our extraordinary commander, Meghan Dodge, and all of her team in District three. So I wanted to shout out to them.'",
        "'speaker_7': 'And also I'd like to acknowledge Chief White, who will be retiring as chief after serving our city since 2011. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I wanted to first ask that my name be added to the proclamation and also extend my thanks and appreciation to the families of the deceased officers who were named, as well as to all of the officers who were named that have received honors and to those who currently serve to protect our communities every'",
        "'speaker_6': 'day. I have a couple of grandkids that have gone into the Navy. They both signed up to be military police officers. I have a grandson in law who is a police officer in Wisconsin. So this profession, you know, hits very close to home and really understand the the sacrifices as well as just the day to day.'",
        "'speaker_6': 'I don't know. I guess uncertainties, for lack of a better word, that the families have to deal with everyday, just praying and hoping that their loved one is going to come home safe. And so for all of you who wear that uniform to protect the city and to just pay tribute to those who have come before you'",
        "'speaker_6': ', I just say thank you very much for your service to our city. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Flynn.'",
        "'speaker_8': 'Thank you, Mr. President. I am reminded every time we do proclamations like this of the officers who have paid the ultimate price, made the ultimate sacrifice, and to particularly remember the 30th anniversary of Detective Bob Walsh's death, I remember that one clearly.'",
        "'speaker_8': 'The entire metropolitan area, I think, watched that because I think it was the Channel four helicopter that was following that suspect. And he had carjacked a man and. I remember seeing Bob get hit by that car and. It was a terrible, terrible day in Denver.'",
        "'speaker_8': 'And. I it's just an honor to be able to say. 30 years later that we remember him as we remember all of these and as we remember the officer that Councilwoman Black mentioned who was not forgotten after more than 100 years.'",
        "'speaker_8': 'Our thanks. Go to the Denver Police Museum and to the Denver Police Department for making sure that they are not forgotten ever. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Lopez.'",
        "'speaker_4': 'Thank you, Mr. President. I also wanted to just give my gratitude and thanks to the men and women in uniform, especially in our police department. I think there's some folks that are on a daily, daily basis. I run into them all the time.'",
        "'speaker_4': 'I see them. And every time I have the opportunity, I say thank you. And I think, you know, with. When you when you're a public servant in the capacity of these peace officers, are you going to see the.'",
        "'speaker_4': 'Too often you get you see the you see kind of like the bad attitudes that are out there in the public. You see, you deal with the rudeness. You deal with the things that a lot of people. Don't deal with on a daily basis unless you're in customer service.'",
        "'speaker_4': 'However. You know, it's so important for us to be able to and I encourage everybody in the public to do this. If you're watching this, either here in the chambers or on Channel eight, is to go up and say just to say thank you, thank you for your service to our city and go in there and stay'",
        "'speaker_4': 'safe. Right. And to be able to do that means a lot. And I know that because some of my two of my best friends in high school are are now in uniform. And I see them all the time.'",
        "'speaker_4': 'And I always think to myself, Man, I knew you were going to be a cop. You were pretty bossy, but. You always had a good year. And it's just there's no other way to sum up that public service, like like the men and women that wear that badge.'",
        "'speaker_4': 'Right. And I think there's something special there. And when the ones who have, you know, gave their last breath to protect the public and the safety of the public. And, you know, it's always important that we never forget them.'",
        "'speaker_4': 'I'm glad that we are. You're marking the places where the men and women have, you know, took those last breaths in that uniform and on our behalf. It's important. So thank you for doing that. I think that's super important that you do that for us.'",
        "'speaker_4': 'I think a lot of us in the west side of that, the memory and the celebration of the life of people who have gone before us is a big deal. Right. And so I think, you know, so kudos to that.'",
        "'speaker_4': 'Councilwoman, thank you so much for for bringing this proclamation forward. And, Madam Secretary, if you can add my name along with it as well to I don't think I responded in time. So thank you. Thank you, Councilwoman. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. See no other speakers. I'll just wrap us up by saying I can't say it any better than my colleagues have already. And I just want to add to all of our officers. Thank you. Thank you for everything.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_1': 'Black Eye.'",
        "'speaker_4': 'Flynn I.'",
        "'speaker_2': 'Gillmor, Herndon High Cashman. Lopez. I knew Ortega. SUSSMAN Hi, Mr. President.'",
        "'speaker_0': 'All right. Madam Secretary, please close the voting and announce the results. Tennis tourney is proclamation 555 has been adopted. Tell someone black. Is there someone you'd like to bring up to receive the proclamation?'",
        "'speaker_7': 'Yes, I would. Deputy Chief Matt Murray, please. And Michael Hess with the Denver Police Museum.'",
        "'speaker_4': 'I asked Mike to come up. I just think everybody sort of said it. But I want everybody to see that they have done some amazing work and been incredibly supportive and very, very busy week for Mike and for the foundation.'",
        "'speaker_4': 'And if you also notice tonight, the City-County building will be blue. And that's also a lot of their work and work for the city. But let me just start by saying this Chief White couldn't be here tonight. He is at the dentist.'",
        "'speaker_4': 'And, you know, I wouldn't normally point that out, but as council person Black said, he is retiring. And believe it or not, it's related to this that I want to bring that up. He was struck in the face as a young police officer in Washington, DC had lost many of his teeth and he's had dental problems for'",
        "'speaker_4': 'the rest of his life. And so there are many officers who, you know, carry the scars and the and the memories and the pain and the suffering that come with not just dying on the line of duty, but being injured in the line of duty and having to do that job.'",
        "'speaker_4': 'And Chief White's been the police officer for 46 years. So I do think we owe him gratitude. And I know he appreciates all of you and told me to not go too far with this because he wants to speak to each one of you before he leaves.'",
        "'speaker_4': 'And I'm sure he will do that. But for the department, I want you to know how much we appreciate it. I want to echo something Councilperson Lopez said. You know, this was a tough year. I would I had the honor to attend all three of the funerals for the deputy sheriffs.'",
        "'speaker_4': 'And you know, they were right in a row. It was really difficult. I won't lie. It's very hard. And these were all really young men early in their careers. And one of the things that struck me was just how good they were.'",
        "'speaker_4': 'Have you just left the funeral with a sense that there's a hole in this community because of the people we lost. All three were husbands. Two of them were fathers, very young, very energetic, and people that said the most amazing things about them.'",
        "'speaker_4': 'I mean, I would want all three of them to work in our department in a heartbeat. So we appreciate it. But but something Councilman Lopez said that I think is important as I left Colorado Springs and I talked about this this weekend, we it took an hour and 45 minutes to leave the parking lot.'",
        "'speaker_4': 'There were so many people. And so your thanks just means the world to us. I cannot tell you. It's far greater than any award, far greater than somebody buying you lunch. Somebody that comes up like a man did to me on the way down to that funeral and just says thanks just means a lot.'",
        "'speaker_4': 'It really means a lot. So I want to thank you for saying that, because that is true. That that's that's the greatest currency for a police officer. And then the last thing I wanted to mention is Councilperson Black talked about the different awards this year.'",
        "'speaker_4': 'And I do want to point out, because some people don't know and especially people at home, we instituted a new year award two years ago. Chief White did called The Sanctity of Life. And that gets missed. And I don't think a lot of people understand what that is, but it's part of this major cultural change that we've'",
        "'speaker_4': 'undergone. And it's a focus on preserving life and not awarding somebody for a heroic act where a life was lost. And, you know, not to say that that doesn't matter, but we want to focus on times that you could have used deadly force and you didn't.'",
        "'speaker_4': 'And there were eight people this year, given that award and that if you think about it, every one of them, their life was in danger when they chose not to use their service weapon and take a life. And so in Denver, we have some really good things happening.'",
        "'speaker_4': 'And I want to make sure people know that and tell you thank you so much for this proclamation and for for your continued support and for honoring the police department. So thank you very much.'"
    ],
    "Proclamation for Hepatitis Awareness and Testing Days.": [
        "'speaker_0': 'All right. That brings us to our third proclamation. Councilman Lopez, will you please read Proclamation 572?'",
        "'speaker_4': 'Thank you, Mr. President. Proclamation 572 Series of 2018 recognizing May 19th as hepatitis testing day and July 28 as World Hepatitis Day. Whereas May 19th is National Hepatitis Testing Day, and July 28th is World Hepatitis C Oversight World Hepatitis Day.'",
        "'speaker_4': 'Hepatitis C is recognized as the most common blood borne viral infection in the United States, whereas mortality due to hep C is increasing in Colorado, particularly among people born between 1945 and 1965 and over 19,000, hepatitis C related deaths occur annually in the United States.'",
        "'speaker_4': 'And. WHEREAS, Hepatitis B accounts for almost 2000 annual deaths in the United States, there are currently about 15,436 people living in Colorado with chronic unresolved hepatitis B infection, and fewer than one third of people with chronic hepatitis B are aware of their infection.'",
        "'speaker_4': 'And. Whereas, Hepatitis B and C cause an estimated 61% of liver cancer. Hepatocellular carcinoma HCC in the U.S. and. WHEREAS, the opioid opioid epidemic is fueling an increase in HPV h. Sorry. HB In HCV positive cases. And. WHEREAS, Hepatitis C has infected an estimated 73,935 Coloradans, as many as 5.2 million American residents, and more than 130 million'",
        "'speaker_4': 'people worldwide. And is a leading cause of cirrhosis, liver cancer and liver transplants in the U.S.. And. WHEREAS, Hepatitis C can be prevented. Testing can identify existing infections and early diagnosis and treatment can save lives, money and resources.'",
        "'speaker_4': 'And. WHEREAS, A Liver Health connection is available as a statewide resource for education testing, linkage to care, patient navigation helpline and other support services. Now, therefore, be it proclaimed by the Council of the City and County of Denver.'",
        "'speaker_4': 'Section one of the Denver City Council agrees that preventing and treating viral hepatitis as an important public health initiative that will improve the quality of life for Denver residents affected by the virus. Section two The Denver City Council proclaims May 19th as hepatitis testing day and recognizes July 28th as World Hepatitis C, Section three that the clerk'",
        "'speaker_4': 'of the city and county of Denver shall a test and affix the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to Nancy Steinfurth, executive director of Liver Health Connection.'",
        "'speaker_0': 'Thank you. Councilman Lopez, your motion to adopt.'",
        "'speaker_4': 'Thank you, Mr. President. I move that proclamation 572 series of 2018 be adopted.'",
        "'speaker_0': 'It has been moved and seconded comments by members of council. Councilman Lopez.'",
        "'speaker_4': 'Thank you, Mr. President. I carry this proclamation every year. One, because I think it's absolutely critical and important that, you know, that this information be out there. And second, because this is something that that's near and dear to my heart.'",
        "'speaker_4': 'I lost my grandfather in the year 2000. To complications from Hep C, which he was which he got when he was in the Army, and he was hurt in Germany and he had a blood transfusion. And that's where I mean, they didn't test for it, the screen for it.'",
        "'speaker_4': 'And that's where he was infected. He passed away almost a year and two weeks ago. Oh, not a year. 18 years. Two weeks ago due to complications from that. From cirrhosis and liver cancer. Now have had we had had the medical advances 18 years ago.'",
        "'speaker_4': 'My grandfather probably still be with me. It's just kind of one of my colleagues was the person that's supposed to carry this at the time. Garcia. And he did. And I said, Well. Would you like to carry on?'",
        "'speaker_4': 'First thing I thought about was my grandfather said, absolutely. If you can spend more information about this far and wide in our communities, especially boomer baby boomer age. And it is, folks, just to have general awareness I think is absolutely critical.'",
        "'speaker_4': 'Folks didn't shy away from testing. As a matter of fact, it can save lives. So I wanted to highlight that. I know Nancy will come up and talk a little bit more about the details of some of the activities and the events that's going to happen on May 19.'",
        "'speaker_4': 'So. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Lopez. And thank you for bringing this proclamation forward. Madam Secretary, roll call.'",
        "'speaker_2': 'Lopez. I knew Ortega, I. Black.'",
        "'speaker_7': 'Hi.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Gilmore, I. Herndon.'",
        "'speaker_2': 'Cashen.'",
        "'speaker_8': 'Hi.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting and announce the results. Nine Ice nine ICE Proclamation. 572 has been adopted. Councilman Lopez, is there someone you'd like to bring up to the podium to.'",
        "'speaker_4': 'Receive the proclamation? I would like to invite Nancy Steinfurth, who is the executive director of Liver Health Connection, formerly the hep-C Connection.'",
        "'speaker_9': 'Thank you very much for this opportunity to speak with you. And I'm really excited that I've been able to get so much support from Denver City Council over many years. So thank you for once again supporting this proclamation.'",
        "'speaker_9': 'I can't read anything without my glasses. So here we go. We're going to miss Councilman Lopez because he's been such a champion for this cause and for our organization. So I just want to give him a little special recognition because he's been so wonderful and so passionate about the personal effects that this disease has had on him'",
        "'speaker_9': '. I know of many, many stories and we could go on for hours, but that is not going to that's that's not going to fly this evening. The nation, Colorado and Denver are in the midst of an opioid crisis.'",
        "'speaker_9': 'And this crisis is leading to a second epidemic of infectious disease transmission. In fact, it's been called this endemic because hepatitis B, hepatitis C and HIV are all on the rise as a result of shared syringes among injecting populations.'",
        "'speaker_9': 'At the same time, as the community is responding to the opioid epidemic, we are still working to find baby boomers with undiagnosed hepatitis C, for example. We also go to the VA center. One of my staff members, RECA goes and tests there, so she's going to bring some dog food and some other goodies for you guys to'",
        "'speaker_9': 'have for this Saturday. Homeless veterans are one of the really hard to reach populations. And so excuse me, the VA and our organization is working to partner and collaborate with groups to figure out where we can locate those folks and link them to care.'",
        "'speaker_9': 'These baby boomers have had the disease for a longer time period, and it's now leading to serious consequences like liver failure, transplantation and liver cancer. In 2017, Liver Health Connection was able to provide almost 3000 hepatitis C antibody tests at homeless shelters, community correction programs, methadone clinics, pride fest, and many more events.'",
        "'speaker_9': 'Every person with a positive test result is provided active navigation through all of the steps in the process so that no one is designed denied access to a cure. I'm happy to say that the Colorado Department of Corrections will begin providing hepatitis treatment to almost 700 offenders per year beginning July one.'",
        "'speaker_9': 'That was a $16.5 million increase to their appropriation, and it was earmarked only for hepatitis C. So that's a big deal with our state budget. It's pretty tough. We work with over 100 local partners, including Denver Public Health, National and Worldwide Partners, to find the missing hepatitis B and hepatitis C millions.'",
        "'speaker_9': 'We thank thank you for your commitment to support this important cause and hope you can join us at 10 a.m., May 19th in Confluence Park, where we're going to be testing anyone and everyone for hepatitis C runs from 10 a.m. to 3 p.m..'",
        "'speaker_9': 'And we would love to have you stop by now. Granted, perhaps someone from the marathon could come over. Swing by. We're going to word have some water. We might have some snacks. It's a beautiful area. I love the park.'",
        "'speaker_9': 'So that's one reason to come on by as well as testing. And and we're going to we're going to be there for most of the day.'",
        "'speaker_0': 'Thank you so much. Thanks. Thank you very much. All right. That concludes our proclamations. We're moving on to resolutions. Madam Secretary, please read the resolutions.'"
    ],
    "Zoning Code Amendments.": [
        "'speaker_0': 'Thank you. Now, I'll do a recap on the resolutions. No items have been called out under bills for introduction. Those items have been called out under bills for final consideration. No items have been called out under pending. Councilwoman Sussman has called out for a Technical Amendment Council Bill 8.0323, which amends the zoning code.'",
        "'speaker_0': 'Madam Secretary, can you please put that item up on our screens? And, Councilwoman Blackwell, you put Council Bill 323 on the floor.'",
        "'speaker_7': 'Yes, I move that council bill 18, dash zero 3 to 3 be taken out of order.'",
        "'speaker_0': 'It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_2': 'SUSSMAN All right.'",
        "'speaker_7': 'Black I.'",
        "'speaker_2': 'Flynn. I Fillmore. I Herndon. I Cashman. Lopez. I knew Ortega. Hi, Mr. President.'",
        "'speaker_0': 'Hi. Madam Secretary, please close voting. Announce the results.'",
        "'speaker_2': 'Tonight.'",
        "'speaker_0': 'Ten eyes comfortable. 323 may be taken out of order. Councilwoman Sussman, your motion to amend.'",
        "'speaker_5': 'I move that council bill 1803 to 3 be amended in the following particulars on page four, line ten strike. Fill in and replace with May 24th, 2018.'",
        "'speaker_0': 'It has been moved and seconded. Any questions by members of council? All right. Any comments by members of Council Councilwoman Sussman?'",
        "'speaker_5': 'Thank you, Mr. President. This amendment fixes a misprint in the bill by including the code of effective date in Section three, as similarly cited throughout the remainder of the bill. If the amendment passes, it will not require a delay in the scheduled public hearing.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Seeing no other comments, Madam Secretary. Roll call.'",
        "'speaker_5': 'Sussman Black eye.'",
        "'speaker_2': 'Flynn, I Gillmor. Herndon. Cashman. Lopez. I knew Ortega, I. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please cast voting in no results tonight. Tonight's Council Bill 323 has been amended. Final consideration of amended council bill 323, which with its public hearing, will be Monday, May 21st. That concludes the items to be called out.'",
        "'speaker_0': 'All their bills for introduction are ordered published. We're now ready for the block vote on resolutions and bills on final consideration. Council members remember that this is a consent or block vote and that you will need to vote.'",
        "'speaker_0': 'Otherwise, this is your last chance to call an item out for a separate vote. All right, Councilwoman Black, will you please, for the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_7': 'Yes, Mr. President, I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in the block for the following items. All Series 18 019904040430043104320433043404350389042004110426008703970403. 02820395040004130414. And that's it.'",
        "'speaker_0': 'All right, Madam Secretary, it looks like we got them all. Do you concur?'",
        "'speaker_2': 'Yes, Mr. President.'",
        "'speaker_0': 'All right. It has been moved and seconded. Madam Secretary. Roll call.'",
        "'speaker_2': 'Black eye Flynn. I could go more. I turned in Cashman. Lopez. I knew Ortega. I assessment. Hi, Mr. President, I.'",
        "'speaker_0': 'I'm secretary. Please. Cause voting in Nassau results tonight. Tonight, the resolutions have been adopted and bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 325, changing the zoning classification for 2391 South Sherman Street in Rosedale.'"
    ],
    "Zoning Change for 2391 South Sherman Street in Rosedale.": [
        "'speaker_0': 'On the wall you'll see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to the Council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilwoman Sussman, will you please put Council Bill 325 on the floor?'",
        "'speaker_5': 'Gladly. Mr. President, I move that council bill zero 3 to 5 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 325 is open. May we have the staff report?'",
        "'speaker_8': 'Thank you, Mr. President. And Council. Scott Robinson with Community Planning and Development. This is a request to rezone 2391 South Sherman Street from U.S. Sub one to You Tube. The property is located in Council District six in the Rosedale neighborhood.'",
        "'speaker_8': 'It's at the corner of Wesley Avenue and Sherman Street, across from Rosedale Park. And the vacant Rosedale Elementary School property is 6250 square feet, and there's currently a single unit house on the property. The request is to rezone from U.S. sub one, which is urban neighborhood context single unit zoning with a 4500 square foot minimum lot size'",
        "'speaker_8': 'and in one indicates that accessory dwelling units are allowed on the property and the request is to rezone to the YouTubes Zone District, which is still urban neighborhood context to unit zoning with the same 4500 square foot minimum lot size.'",
        "'speaker_8': 'And the request is to allow for the construction of a duplex on the property. As you can see, the property is surrounded by the same UCB one zoning except for the park across the street, which is OSA. But if you notice, one block to the north and one block to the south are the requested YouTube zoning.'",
        "'speaker_8': 'You can see in the surrounding area, it's mainly single unit houses, but there are a mix of two unit and multi-unit residential properties immediately around it as well. And then you can see the mixed use development on Broadway, two blocks to the west.'",
        "'speaker_8': 'The subject property is the top left photo here. Then you can see some of the other surrounding houses and the park and school playground across the street. This went to the planning board on March 21st, where it received a unanimous recommendation of approval.'",
        "'speaker_8': 'There was one member of the public speaking. I went to the Land Use Transportation Infrastructure Committee on April 3rd, and we received no other public comment on this application. In order to approve a rezoning, the city must find that these five criteria have been met.'",
        "'speaker_8': 'The first criterion is consistency with adopted plans. There are three adopted plans that apply to this property. First is Comprehensive Plan 2000, as described in the staff report. Staffers found that the proposed rezoning consistent with these four strategies from the plan relating to infill development and providing a variety of housing types in neighborhoods which the proposed YouTubes'",
        "'speaker_8': 'and districts would be compatible with. Blueprint Denver from 2000 to has this property with a concept land use of urban residential, which calls for a variety of housing types, from single family to townhouses to small or large apartment buildings.'",
        "'speaker_8': 'Consistent with the proposed two unit zoning, there is also designated as an area of stability, which calls for maintaining the existing character while accommodating new development. As I mentioned earlier, there is a mix of single unit two unit and multi-unit in the area, so the proposed rezoning would be consistent with the existing character.'",
        "'speaker_8': 'Both Wesley and Sherman Street are designated locals, which are appropriate for the requested zoned district. The Evans stationary plan is from 2009. It also designates the property as residential, which again calls for a mix of housing types, including single family duplexes and row houses, again consistent with the requested zoning of two unit.'",
        "'speaker_8': 'The plan also calls for an increase in the amount and variety of housing, which the proposed rezoning would do by allowing a duplex on the subject property. So staff finds that the first criterion is met. The second criterion is uniformity of district regulations.'",
        "'speaker_8': 'The proposed rezoning would result in the uniform application of the YouTube Zone district. The third criterion is to further the public health, safety and general welfare of the city. Staff finds that the proposed rezoning would do so by implementing the city's adopted plans and facilitating additional housing in the area which is needed.'",
        "'speaker_8': 'The fourth criterion is justifying circumstances. Staff finds that the proposed rezoning is justified by the changed and changing conditions in the area. There's been investment along Broadway. The city has invested in new streetscape elements along Broadway, and there's been significant private investment along Broadway and in the larger Avenue Station area that has changed the character of the'",
        "'speaker_8': 'area and increased the need for additional housing, which justifies the proposed rezoning. And the fifth criterion is consistency with neighborhood context, zone, district purpose and intent. The proposed rezoning would facilitate development consistent with the urban neighborhood context, description and the purpose and intent of the YouTube zoning district.'",
        "'speaker_8': 'That staff finds all five criteria have been met and recommends approval. I'll be happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. We have two individuals signed up to speak this evening. So if you could make your way to this front seat. And first up, we have Will Cryer, followed by Chairman Sekou.'",
        "'speaker_4': 'Everyone.'",
        "'speaker_8': 'We just wanted.'",
        "'speaker_4': 'To come up and kind of.'",
        "'speaker_8': 'Give a little background.'",
        "'speaker_0': 'So could you introduce yourself, say your name for the record. Thank you. Sorry.'",
        "'speaker_4': 'My name is Will Crier. We are. And my wife, Kelsey Crier, where.'",
        "'speaker_8': 'Residents at 2391.'",
        "'speaker_4': 'South Sherman Street, Denver, Colorado. I just wanted to say kind of thank you. We appreciate that this process exists and we had the option to even pursue changing the zoning on our property to kind of pursue something that would help our family.'",
        "'speaker_4': 'We've I've lived there since 2012 and she's moved in since we got married. And we love the neighborhood that we're in and are hoping to stay there for a long time and think this would kind of enable us to to make that more of a longer to term solution.'",
        "'speaker_4': 'And one of the things, Scott, in the Planning Department, for all the help from the Pre-Application process all the way through to today, and that was really merit. So thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou. Yes. Good evening.'",
        "'speaker_8': 'My name is Sherman Sekou. I represent the Black Star Action Movement for Self-defense, focusing on poor, working, poor, homeless, senior citizens and youth. We support this ordinance change and. You know, it's moments like this that I really am encouraged and excited about the process of how we go about doing these changes.'",
        "'speaker_8': 'This because we sit here and we do the corporate changes for the corporate folks and you know, that's an enduring process because there's a lot more unions involved. And then we have every day for regular folks, working folks that want to improve their property, that will have an effect, that will improve the neighborhood and to help us'",
        "'speaker_8': '. Attack this housing shortage thing. Even if it seems small, it's significant. It really is the small ones that when you add them.'",
        "'speaker_1': 'Up are.'",
        "'speaker_8': 'Really more inspiring because they come from.'",
        "'speaker_1': 'The hearts.'",
        "'speaker_8': 'Of the people who not only want to change their property, but they still want to live there. Why they make it open to invite other people to enjoy that space. So we want to thank the leadership of Councilman Cashman, and I'm not going to do it like I did Ben Franklin down there where he has to do'",
        "'speaker_8': 'a disclaimer. But thank you so much for bringing this forward and leadership for bringing this forward. I just have one question. And that would be for smaller projects, housing projects like that. It seems to be there should be an expedited process that they can go through that ain't.'",
        "'speaker_4': 'As onerous.'",
        "'speaker_8': 'As those of the corporations who are built building bigger units so that we can get this thing on the table, move it forward, and then they can begin the process of having that satisfaction, of seeing the project underway without having to spend a whole lot of money before you even put one shovel of dirt in there to'",
        "'speaker_8': 'get this thing done. And so I would ask that city council kind of look at that in the subcommittee meeting and see how we can cut some of the red tape for the smaller folks so they can move the project forward.'",
        "'speaker_8': 'Last but not least. We have a special guest tonight, my cousin Gregory. He's a security guy, so he's came here. This is his second assignment. I forgot to mention he was here with my family and outstanding young man, and he's been helping me to watch the clock.'",
        "'speaker_8': 'So he's my official clock timer. So I'm going to quit now. And Gregory, thank you so much for being here and get to know these folks because they're outstanding citizens and they are worthy of your protection. Thank you very much, everybody.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there questions from members of council? Councilman Cashman.'",
        "'speaker_8': 'Thank you, Mr. President.'",
        "'speaker_0': 'I think your microphone might be off.'",
        "'speaker_8': 'Thank you, Mr. President. Thank you very much. So how far does the the radius of the Evans Station plan extend? I believe this property is just inside the boundary. Is that correct? Yes, it is towards the edge of the boundary of the even stationary plane.'",
        "'speaker_8': 'Okay. Do you have any idea how far does it extend up the hill to to grant? No, I do not believe it does. I think this is basically the edge of it right at Grant, actually. Okay. The other question I have is so this is a corner site, the current residence, while it has the Sherman Street address'",
        "'speaker_8': ', has its primary entrance facing. Is it westerly there? Yes. Does it matter to CPD how the units would be situated on this site? No. When they go through the building permit process, they would work with our development services division to meet the code and situate the the building on the property.'",
        "'speaker_8': 'But I think it could face either Wesley or Sherman. All right. And then there was one once the speaker at the planning board. What was. Yeah, it was a neighbor who lives in the neighborhood. He said he was not necessarily opposed, but was concerned that some other neighbors may be.'",
        "'speaker_8': 'They have concerns when the 2010 rezoning went through. There was, according to the speaker, pretty significant discussion with the neighborhood about the appropriate zoning. And he was concerned that some members of the neighborhood may feel like the zoning was settled in 2010 and would be concerned about a change at this point.'",
        "'speaker_8': 'And he said he was not personally concerned and we haven't heard from any of the other neighbors at this time. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Seeing no other questions, the public hearing for Council Bill 325 is closed. Comments by members of Council Councilman Cashman.'",
        "'speaker_8': 'Thank you again, Mr. President. And I do need a disclaimer for our previous speaker that this was no leadership from council. This was brought forward by the applicants themselves. The reason I ask about the the Evans Station plan is for me that was an important part of this for my colleagues.'",
        "'speaker_8': 'If you.'",
        "'speaker_0': 'Drive.'",
        "'speaker_8': 'Lincoln and Sherman between Evans and Yale, Duplex is not an unusual use at all. There are literally dozens on those blocks, including several on the block that the applicants on which the applicants live. However, I don't take up zoning lightly.'",
        "'speaker_8': 'And so it was the the fact that this remains in the the Evans Station plan that that tilted it for me. So as I say, there's plan support. It's a common use in the area. I appreciate the fact that it adds additional housing to to our stretched inventory and also.'",
        "'speaker_8': 'I would just put forward that for those who might be thinking in that neighborhood of extending the duplex use and onto blocks that which it's not a common use, I would think that plan support would be more questionable.'",
        "'speaker_8': 'So I do plan on supporting this this evening. I appreciate the staff's report. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Councilman Lopez.'",
        "'speaker_4': 'Thank you, Mr. President, I. I'm supportive this I have something very similar in in my district and I can speak to this in 2010 when we did the rezoning, a lot of the angst, a lot of these properties, especially ones like this with this two unit zone district people were very wary because of the time and because'",
        "'speaker_4': 'of the era that we were in. We were just coming out of a recession, of moving to them, graduating, taking it to a two unit. And so and because also because people didn't know what the form was going to look like, they didn't know if we were going to bounce out of the recession in order to do'",
        "'speaker_4': 'this. They thought it was going to probably very expensive to do. Tune in. So what they did is they said, well, maybe we should do the ADA use. And I think that B one is the ability to do an EDU in the back and they're nodding.'",
        "'speaker_4': 'Those ideas are just as expensive as building another unit. And so in a lot of ways, it was a lack of foresight on Nas. But but also because it was new in the conversation. Had this been the case?'",
        "'speaker_4': 'Now what we know now, if we knew then what we know now, some of these designations, these these B ones, these D ones did end up being ada2 unit because they are, in fact, another unit. It accomplishes the same thing here, except the fact that but the need to you at least the property owner would have to'",
        "'speaker_4': 'live in one of them or the one or the other. So this allows that this zoned district is absolutely appropriate for that area. I remember seeing the map in that area, Councilwoman, and it's a lot like mine and it's a if I can think of that.'",
        "'speaker_4': 'BLOCK It's very similar to some of the ones that are in my district where we haven't seen those ideas come to fruition because they're actually pretty expensive to build. You could enter to build, build, say, to say to unit, and it's almost the same cost and you're able to do a lot more with it.'",
        "'speaker_4': 'So and then it fronts the street. So anyway, I'm supporting for that reason.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Seeing other comments, I'll just add that, you know, I appreciate, Councilman Cashman, you focusing in on the plan support. I think, you know, based on the information presented, this this application does meet the criteria.'",
        "'speaker_0': 'We're lucky that the Evans stationary plan hits this part, and I don't know the rest of Rosedale because that's not my district. But right across the street in both directions is and there is no neighborhood plan in Plot Park.'",
        "'speaker_0': 'And the neighborhood plan in Overland is over 20 years old. And I think it really highlights the need for us to continue to put funding and effort towards getting every single neighborhood in our community a neighborhood plan. Because if you're not within that circle of that, there isn't that, you know, low that real low micro planning effort'",
        "'speaker_0': 'that's happened. And I do think that that could lead to a lot of confusion when there is a plan here and across the street there there isn't. So but again, tonight, I think it's been demonstrated that the criteria been met and we'll be supporting this.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_2': 'Cashman. Lopez. I knew. Ortega. Sussman, I. Flynn, I. Gilmore, Herndon. Hi, Mr. President.'",
        "'speaker_0': 'Hi. Madam Secretary, please close the voting, announce the results.'",
        "'speaker_2': 'Nice. Nice.'"
    ]
}