{
    "Social Impact Project Presentation by Hive Industries.": [
        "'speaker_0': 'Chauncey Billups. So it's going to be an incredible time, and I just wanted to share that because it's been a long time coming. All right. Presentations tonight, we have a presentation from Stephen Jones of The Hive Industries to present a social impact project out in Council District nine.'",
        "'speaker_0': 'So. All right. Go right ahead, Stephen.'",
        "'speaker_6': 'Well, first off.'",
        "'speaker_8': 'Thanks, Councilman Brooks, for inviting us. My name is Steven Jones as my partner Tim Arquilla. And we're here representing Hive Industries. This is a nonprofit event, space and resource center that we've developed over the last four years. Now finding it's home at 725 West 39th and the Fox.'",
        "'speaker_8': 'Fox, what is it, Fox Island near here. But so our concept is based off social capitalism. We think social capitalism is a real thing. And we've created an ecosystem where every entertainment dollar that comes into our building, a portion of that goes to supporting nonprofits and community organizations.'",
        "'speaker_8': 'So as well as artists and musicians. So as a five points Denver native, a product of Denver public schools. The. Sorry my heart is pounding. First time public speaking exactly. A product of Denver. Denver School of the Arts.'",
        "'speaker_8': 'You know, we wanted to create an ecosystem and a organization that supported artists and young community organizations. So that's what the hive industry is. The event center is called the Fox Street Compound. We offer nonprofit consulting program, Incubation Resource Exchange, all in this four acre event field, the old power rental building.'",
        "'speaker_8': 'So but one of the wonderful things that we've created is called Give Back Tickets that sits on top of our nonprofit resource space. It's a social impact platform. It sells tickets, but just like it says, give back tickets, a portion of those service fees go to community benefactors, which is really cool because, you know, obviously everybody pays'",
        "'speaker_8': 'service fees with tickets, but how can we yeah, how can we help organizations? See what else we got here. We have office space, so currently we house five nonprofits, all very young nonprofits. One is Plant the Seed, a project that we'll be producing this summer is the ugly food farmer's market at our event center.'",
        "'speaker_8': 'So every Wednesday we'll have a farmer's market of basically that ugly food, food that doesn't make it to the store shelves of King Soopers and everybody else. So uptake I think growers organic plant the seed and the factory compound.'",
        "'speaker_8': 'We'll be providing that service within our community, servicing the Swansea Globeville district and the Sunnyside area there. We also have a community garden space up on 38th and Sheridan that we've had for about four years and have fostered many great programs with, you know, developing youth and and growing.'",
        "'speaker_8': 'So we're just here to share our vision and say hello, basically.'",
        "'speaker_0': 'Great. And see what can you show us at one site that shows how many thousands of people come to this site?'",
        "'speaker_8': 'Yeah. So our biggest fundraiser brings 25,000 people to the site over a two day period. It's called the Denver Taco Festival and.'",
        "'speaker_6': 'Tacos, right? Yeah.'",
        "'speaker_8': 'Yeah. And so that event itself started in the Reno district and has moved from the 32nd and Larimer block over to this area. And over the four years that it's been running, we've raised over $300,000 for nonprofit organizations, and we have a handful of other events coming to great.'",
        "'speaker_0': 'And I wanted you know, this council sees many rezonings in this Fox Island area, but few people really know what's actually going on in the existing infrastructure and how that existing infrastructure is being used. And so I thought it was important that folks here on council in the city understands that there are folks who are making the'",
        "'speaker_0': 'existing infrastructure work for the community, for folks who are there right now. So that's great.'",
        "'speaker_8': 'Well, thanks so much.'",
        "'speaker_0': 'Well, thank you again. I appreciate it. All right. All right. Madam Secretary, do you have any communications.'"
    ],
    "Sale of 1701 Platte Street to The Nichols Partnership Inc.": [
        "'speaker_11': '12,694,000 some dollars and for just 150 days. And so I've asked the airport to try to come up with, you know, how that happened, to escape attention. But when they give us descriptions of contracts, it be very helpful if they can be very scrupulous about getting the amounts correct.'",
        "'speaker_11': 'The contract itself does have the correct amount. Thank you.'",
        "'speaker_0': 'Great. Thank you, Councilman Flynn, for pointing out that detail. Okay. Can you please bring up Council Bill 259? And Councilman Herndon, we please put that on floor.'",
        "'speaker_7': 'Yes, Mr. President. I move the council bill 18 0 to 5 nine be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved. And second, it comes from the council. Councilman. No, go ahead. Yeah.'",
        "'speaker_12': 'Thank you, Mr. President. This bill has been really difficult issue for me. You know, the we're we're selling this property, and half of it is going to be going toward expanding our affordable housing fund. You know, several years ago, when we approved the Affordable Housing Fund for $15 million a year, several of us thought it was enough'",
        "'speaker_12': 'money. And and now we're saying, yes, that's correct. It's not enough money. And we've and finance has come up with an excellent proposal we heard this morning about expanding the affordable housing fund from 15 to $30 million a year and doubling the unit production over the next five years, which is really great news.'",
        "'speaker_12': 'The issue I have with is, is this piece of property is a vacant piece of property the city owns is basically, you know, we're going to sell this property. You know, he's basically valued at nothing, dollar a square foot.'",
        "'speaker_12': 'And we're going to sell it for about $400 a square foot to a good developer. But the main thing is especially free land. When we talked about this affordable housing expansion, the Denver Housing Authority, a wonderful organization, is helping us provide, you know, affordable housing and for low income citizens, is going to talk about expanding to 25'",
        "'speaker_12': 'projects, about 2 to 3 acres per project. That's about 50 to 75 acres of land. This land, they're going to have to buy that land. Part of the affordable housing fund will be that $50 million that they're going to do with a bond issue to buy land.'",
        "'speaker_12': 'And they're saying that land will be back 45 to $50 per acre that they're going to try to buy. And here we have a piece of property that's basically free and a dollar per square foot, you know, that we could be using for a start up for affordable housing.'",
        "'speaker_12': 'But no, we're going to sell it for first can be done for commercial development, which I you know, I appreciate commercial development. Nothing wrong with that. But the main thing is we just need to make sure we understand how we're using our city owned properties.'",
        "'speaker_12': 'In the past, we've asked for an inventory of city owned properties or I believe we have and and if we haven't, I'm asking for it now of what city properties we own so we can make a decision of how we use those properties, especially when we have such a need for affordable housing.'",
        "'speaker_12': 'This is going to be for this affordable housing expansion, be from 0 to 30 AMAYA The low income. But we've got workforce housing, we've got all kinds of housing issues around the city. And so I'm just really troubled.'",
        "'speaker_12': 'I won't have this money from the proceeds. The sale will go to help fund the the affordable housing. But I'm just convinced with a $1.5 billion, you know, general fund budget that we have this year, we could have found seven and a half million dollars from our general fund and use this plan to to jump start affordable'",
        "'speaker_12': 'housing development. So that's the dilemma. I mean, and and but I don't want to take away from the excellent plan that they put together this morning. I'm so happy that we're going to go from 15 to $30 million a year for affordable housing and expand our production.'",
        "'speaker_12': 'And I definitely want to finish by saying I want to thank the All in Denver organization. They're the catalysts that really encouraged us to expand this affordable housing fund and that community citizen driven effort really did a wonderful job.'",
        "'speaker_12': 'So I'm going to vote against this tonight. I know it'll probably it'll pass, but I'm going to vote against it tonight because I think we should you should be using this land for affordable housing development. And I think we could take the seven and a half million dollars that we need for affordable housing out of the general'",
        "'speaker_12': 'fund. Thank you, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilman. New Councilwoman.'",
        "'speaker_9': 'Thank you, Mr. President. I want to thank my colleague, Councilman Yu, for raising some questions about this property. I just want to share, I guess, for transparency sake, some of the conversations that I had. And I believe Councilwoman Ortega was also involved in these conversations.'",
        "'speaker_9': 'We in the city, you know, there's an executive order that helps to guide how the city disposes of additional land. And it's, you know, signed by the mayor. It's not subject to council approval. And I think that what we learned as we, you know, kind of dug into that a few years ago is that it does not'",
        "'speaker_9': 'require the use of excess land for affordable housing. It at the time when this parcel first came up, I think it basically said, like, we'll check with OED. It was very, very light requirement and it might not have even been housing people who actually looked in, determined whether land could be used.'",
        "'speaker_9': 'And so through the process of asking questions and pushing the administration, thinking about whether we could or should do an ordinance, the charter was a barrier to having us legislate higher standards on this. We certainly can look at that again.'",
        "'speaker_9': 'But but the administration did change the executive order to at least create a much clearer process of how land would be evaluated for affordable housing. So we took a step in the right direction, but it simply just doesn't require land that could be used for housing to be used for affordability.'",
        "'speaker_9': 'And I will I just want to, you know, share your concern that many cities do say that San Francisco, many others say if this land can be used for housing at all, then it should be used for housing and it should be used for affordable housing and or for homeless housing.'",
        "'speaker_9': 'So so it is possible and other cities do have stronger requirements. We do not. I will say I spent a lot of time learning about the projects and I'm not sure there were a number of parking requirements that we placed on this property.'",
        "'speaker_9': 'I we the size of the property shrank throughout the process. And so as I shared with the media, I can't be 100% sure that it would have been appropriate for affordable housing at the end. I don't know that, but I certainly agree that we should have had and in can have and the mayor has the power to'",
        "'speaker_9': 'do an executive order that says flat out we won't do this kind of sale if we can do affordable housing and we'll do that first and only if we can't do that, then do we move on to commercial or other uses.'",
        "'speaker_9': 'So so I think it's an important conversation to raise. I thank you for raising it, but because I can't necessarily guarantee the ins and outs of how this would have turned out and because I do believe that the resources are being dedicated appropriately, not just to affordable housing, but the other another portion of these funds are going'",
        "'speaker_9': 'to go back to some some funds that provide homeless emergency services. To me, I feel like this is a project worth going ahead and approving at this point. But with the important caveat that we could have a stronger policy and the executive order could be strengthened even further.'",
        "'speaker_9': 'We may or may not be able to legislate that, but it's certainly an option opportunity and many cities have much stronger standards than we have. So with that, I will be voting for it today, but with, you know, appreciation for the important issues being raised.'",
        "'speaker_0': 'Thank you, Councilwoman Canete. Seeing no other comments for this body, Madam Secretary, roll call.'",
        "'speaker_6': 'New York.'",
        "'speaker_1': 'ORTEGA Minus a reluctant eye.'",
        "'speaker_4': 'SUSSMAN Eye.'",
        "'speaker_5': 'Black eye.'",
        "'speaker_4': 'Clark, I. Flynn i Gilmore I Herndon I Cashman.'",
        "'speaker_6': 'Know.'",
        "'speaker_1': 'Can each.'",
        "'speaker_6': 'Lopez, I.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'I believe so is voting and thus results.'",
        "'speaker_4': 'That's right. Tonight's tune is.'"
    ],
    "Text Amendment to Denver Zoning Code to Address Slot Home Development.": [
        "'speaker_0': 'Tonight's two nays to 59 passes. All right. We have one other. Please bring up three or six. Madam Secretary, Councilman Herndon, will you please make a motion to take counsel about three or six out of order?'",
        "'speaker_7': 'Yes, Mr. President, I move the council bill 18 days 306 to be taken out of order.'",
        "'speaker_0': 'It has been moved and second in this motion is non debatable and will require an affirmative majority vote. Madam Secretary, roll call.'",
        "'speaker_4': 'Herndon. I Katherine Kinney. Lopez. I knew Ortega. Sussman. My black eye. Clark. All right. Espinosa. Flynn i. Gillmor, i. Mr. President, I.'",
        "'speaker_0': 'All right, we have to. Sorry, Madam Secretary, do you want to tell us we have total votes?'",
        "'speaker_4': 'Total vice.'",
        "'speaker_0': 'All right. We have 12 ICE Council Bill. Three of six is now taken out of order. Councilman Herndon, will you put Councilman three or six on the floor?'",
        "'speaker_7': 'Yes, Mr. President, I move council bill three or six be placed upon final consideration and do pass.'",
        "'speaker_0': 'All right. It has been moved and second it. Councilwoman Sussman, your motion to amend.'",
        "'speaker_9': 'Thank you, Mr. President. I move that on page one. Line 27, strike the number 2018, dash 0130 and replace with 218 0130-001 on page one line 28 Strike the date April 4th, 2018 and replace with April 11th, 2018.'",
        "'speaker_0': 'All right. Question. Questions by members of council. Columnist, member of the Council, Council on assessment.'",
        "'speaker_9': 'Yes, the purpose of this amendment is to make reference to a corrected version of the text amendment filed with the clerk. The previously filed text amendment incorrectly stated in five locations that certain dwelling units located within 20 feet of the side street zone light line shall be oriented to the primary street zone light line.'",
        "'speaker_9': 'The language in these five sections should have stated that the dwelling units shall be oriented to the side street zone lot line.'",
        "'speaker_0': 'All right. All right. Madam Secretary, roll call on the amendment.'",
        "'speaker_1': 'Susman I.'",
        "'speaker_4': 'Black Clerk Espinosa Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_4': 'Gilmore, I. Herndon, I. Cashman, High Carnage Lopez. I knew Ortega. I. Mr. President.'",
        "'speaker_0': 'I. Plus Kosovo police. Kosovo bringing us.'",
        "'speaker_4': 'Results. 12 Eyes.'",
        "'speaker_0': '12 eyes. Constable through a six has been amended. Final consideration of the meant the amended council bill were bill 306 with this public hearing will be on May 7th. All right. This concludes all the other items and needs to be called out.'",
        "'speaker_0': 'All of the bills for introduction of order published. We're now ready for the block vote on resolutions and bills on final consideration. Council members remember this is a consent or block vote and you will need to vote. You'll need a vote.'",
        "'speaker_0': 'Otherwise this is your last chance to call it a separate item for a vote, because we heard it. Will you please put the resolutions for adoption of bills on final consideration? Final passage on the floor.'",
        "'speaker_7': 'Yes, Mr. President. I move that the resolution to be adopted and bills on final consideration be placed on final situation and do pass in the block for the following items. All Series 2018 unless noted. 333 334 286 311 329 328 to 96 324 326 three 3355 303 zero nine.'",
        "'speaker_0': 'All right. Well done, Councilman Herndon. Madam Secretary, do you concur?'",
        "'speaker_4': 'Yes, Mr. President.'",
        "'speaker_0': 'All right. Madam Secretary, roll call.'",
        "'speaker_4': 'Black. Hi, clerk. Hi, Flynn. Hi, Gilmore. Herndon. Cashman. Canete. Lopez. I knew Ortega. Guy Sussman. Mr. President.'",
        "'speaker_0': 'I please cause voting in US results 1212. The resolutions have been adopted in the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 18 Dash 0169 Cheese Zoning Classification four 3122 Marion Street in Whittier and required public hearing for Council Bill 18 Dash 0171 Changes on'",
        "'speaker_0': 'classification four 4401 Just Fine Street in Elyria, Swansea and a required public hearing for Council Bill 18 Dash 017 to change zoning classification for 301303 and 327 South Harrison Street in Bel Caro. Anyone wishing to speak on any of these matters must see the Council Secretary to receive a speaker's clerk to fill them out and return to'"
    ],
    "Zoning Change for 3122 Marion Street in Whittier.": [
        "'speaker_6': 'On the presentation monitor. On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_6': 'Councilman Herndon, will you please put Council Bill 169 on the floor?'",
        "'speaker_7': 'Yes. Council Bill 2018 0169 be placed upon final consideration. Andrew passed.'",
        "'speaker_6': 'It has been moved and seconded. The public hearing for Council Bill 169 is open. May we have the staff report?'",
        "'speaker_1': 'Good evening. I'm Sarah White with CPD here to present the staff report for the rezoning request at 3122 Marion Street. The request is to rezone from USC to B1 to USA A1. The subject property is in District nine in the Whittier neighborhood.'",
        "'speaker_1': 'As you can see here, it is in the far northwest portion of the Whittier neighborhood. It is on Marion Street between Martin Luther King Boulevard and 31st Avenue. It is one block east of Downing Street. The property is a little over 7300 square feet total and there is a single unit structure on the property and the request'",
        "'speaker_1': 'is to allow the development of a second single unit house here. So the current zoned district you as you B1 has a minimum zone lot size of 4500 square feet and the request is to rezone to Youssou A-1, which is a single unit district that has a minimum zone that size of 3000 square feet, which would allow'",
        "'speaker_1': 'the applicant to create two zone lots out of the existing lot here. The surrounding zoning is all U.S. sub one. And further to the north you can see there's some grow three zoning, which is a residential office district, some USA one to the northeast.'",
        "'speaker_1': 'And then as you would expect along the Downing Street corridor, there is some main street zoning. And I included this slide. This is a slide that shows the previous old code zoning here because it's a little interesting to show kind of the context of how this zoning came into place.'",
        "'speaker_1': 'So you can see that this a couple block and a half in the northwest portion of Whittier here actually was are for zoning, which was a very high density residential zoned district. And then the rest of the surrounding residential was are two, which allowed for multi-unit.'",
        "'speaker_1': 'So the translation here from the higher intensity residential, particularly in this two blocks, two and a half blocks that was kind of uniformly brought into U.S. US sub one. It's a little just a little interesting context here. So the site is currently a single family home.'",
        "'speaker_1': 'The surrounding block is a mix of single unit two unit and multifamily structures. And this is really a reflection of that previous zoning that allowed multi-unit development. And then, as you would expect along the west, to the west, along the Downing Street corridor, there is a mix of residential and retail.'",
        "'speaker_1': 'Here we have some photos that are just images of the surrounding context. The top image, there is an image of the subject property and you can see it has that large side yard there that would be split off, which would be allowed to be split off with the proposed zoning.'",
        "'speaker_1': 'The picture to the bottom is an example of the large single family lot across Marion Street. And then these are images of the character, generally of the multi-unit structures that you see in this area. So there's quite a few there, generally low scale kind of garden court or low scale real house type of structures.'",
        "'speaker_1': 'So what's interesting about this rezoning? Some of you may remember last year as part of last year's text amendment bundle, there was a portion of that bundle that removed the minimum area requirement for rezonings. So previously rezonings like this, you would have had to have had a minimum area to even request the rezoning, whether it was an'",
        "'speaker_1': 'entire block or an acre. And what we did as part of that bundle was remove that minimum area requirement because we were seeing requests that made sense and were supportable by plans and all of that sort of thing.'",
        "'speaker_1': 'But applicants couldn't request them because of the minimum area requirements. So this request is really the first one of these kinds of requests that has come through since we removed that provision. So just keep that in mind where we're learning how to evaluate these along with you guys.'",
        "'speaker_1': 'So this map here is a estimation map of parcel sizes. So, you know, that development in the city of Denver is based on zone lots. And as you as the request is, the the minimum zone lot size is what is part of the zone lot.'",
        "'speaker_1': 'So USDA has a minimum zone lot size of 3000. U.S. B is a minimum zone, lot size of 4500. However, we don't have zone lots mapped. Denver has this weird thing where we've got zone lots and we've got assessor parcels and a lot of times they are the same, but they don't have to be.'",
        "'speaker_1': 'And because we don't have zone lots mapped, but we do have assessor parcels mapped. We can use the assessor parcel mapping as a general estimation of what the zone, what's in the area might be. So keep that in mind while while I talk through these examples, they are our best estimate of what the zone sizes in these'",
        "'speaker_1': 'areas are. So you can see here I've got it's colored based on the minimum zone lot as equivalent zone district. So the green you see here are the zone lots that are upwards of 6000 square feet. So greater than even the current zoning would require.'",
        "'speaker_1': 'And then these are also the lots that would have enough square footage to split if they were to go to a smaller zone, lot size. The Yellow Zone. Lot sizes are really the the zone lots that are most consistent with the current zoning in place.'",
        "'speaker_1': 'So the UCB one with the meeting that zone minimum between 4500 square feet and 6000 and then the orange here are the zone lots that would be more consistent with the requested zoning. So the U.S., A-1, the 3000 square foot minimum and then the red lots are zone lots that are substandard that basically wouldn't meet any zoning'",
        "'speaker_1': 'requirements. And so this is where that kind of complication of the Celsius parcels versus the zone that's comes into play. So you can see, for example, the lot that is just a couple south of the subject property. You can see that looks like row houses, those are split and they're showing up as red because it's the ownership'",
        "'speaker_1': 'parcel. So, you know, with a row house and with a condo, they split up the ownership of the land. And so it's showing up as very, very, very small ownership parcels, whereas the zone that in that case would be comprising all of those ownership parcels.'",
        "'speaker_1': 'So that's just an example of where this analysis needs to be taken with a grain of salt when you're comparing it with the zone. What? So the process so far, we saw this matter at planning board on February 7th with a unanimous recommendation of approval.'",
        "'speaker_1': 'It moved forward through Luti committee on March 6th. All of the appropriate notification has been done. Signs posted. An aunt was notified and one letter of opposition was received from a neighborhood resident. And that's been included in your packet.'",
        "'speaker_1': 'Aren't you the five criteria? We do have several plans to evaluate here. We have plan 2000 and Blueprint Denver, which are the city wide plans as well as two neighborhood plans, the Northeast Downtown Neighborhoods Plan from 2011 and the Whittier Neighborhood Plan from 2000.'",
        "'speaker_1': 'This. This request is consistent generally with several goals in comprehensive plan 2000, mostly related to promoting infill development, promoting development where services are already in place, and promoting infill development that is consistent with the character of the surrounding neighborhoods.'",
        "'speaker_1': 'Blueprint Denver calls this area a single family residential area of stability. So the proposed zone district is a single unit zone district, which is generally consistent with the intent of a single family residential area to be a area with a single family residential predominant residential type, and then it being an area of stability.'",
        "'speaker_1': 'We know that that means promoting some reinvestment, but generally conserving the character of an area. And as I'll explain in in a bit, we do find this request is consistent with the character of the area and is consistent with the purposes and intent of the area of areas of stability.'",
        "'speaker_1': 'The Northeast downtown neighborhood plan from 2011 also calls this area a single family residential and generally has recommendations for low intensity development in these residential areas to maintain the current mix of low skill building forms such as urban house, duplex and row house, and allow new development to replicate existing development patterns, including small lots, shallow setbacks and'",
        "'speaker_1': 'high building coverage with parking access in the rear of the alley. So again, we do find this request consistent with the goals of this plan as it is still a single unit zone district. And we do think that it allows the existing pattern to be replicated.'",
        "'speaker_1': 'Finally, the Whittier Neighborhood Plan from 2000 does not have specific land use recommendations for certain areas, but it does identify that the maintenance of a strong, diverse, low density residential neighborhood is the central goal raised by residents. And it also acknowledges that the neighborhood is almost fully developed as is, and that as change occurs, additions to the'",
        "'speaker_1': 'neighborhood should complement the existing character. And again, because the proposal would allow a zone district that would allow the replication of an existing pattern, we do find it consistent with these goals. The request would result in the uniform application of the USA to a one zone district, and the proposed MAP Amendment furthers the public health, safety and'",
        "'speaker_1': 'welfare of the city through the implementation of adopted plans. Additionally, it would allow the development of additional housing near downtown, which places people in close proximity to employment and services, which also furthers the public health, safety and welfare.'",
        "'speaker_1': 'The identified justifying circumstances is that the lander, its surrounding environs has changed or is changing. There is development happening very close nearby, in downtown, as well as at the light rail station and 30 at 30th and Downing. And all of these are catalysts to reset multifamily development.'",
        "'speaker_1': 'And as such, the proposed rezoning will allow the development of small single family houses, which will help to maintain housing diversity near downtown. And then finally consistency with neighborhood context, zone, district purpose and intent. So this is where we take another look at generally the lot pattern in the area.'",
        "'speaker_1': 'So this map is a little different than the one that was shown earlier. The one that I had earlier on the slide was just all of the lot sizes in the area. What this map is showing is the lot sizes for the single family development only.'",
        "'speaker_1': 'So basically this is removed, all of those multifamily low scale parcels so that we really can compare like for like we're looking at generally what size zone lots do single unit houses have in this area. And so you can see here there's a significant amount in the surrounding area that is actually more consistent with the proposed usou'",
        "'speaker_1': ', a one zone district as well as some additional surrounding that are consistent with the block size. And given that this pattern is in existence here of small, single family zoned lots, we do find that a rezoning request to usou a one is consistent with the neighborhood context in the zone district purpose and intent.'",
        "'speaker_1': 'So given that all five criteria have been met, would you recommend approval?'",
        "'speaker_6': 'Thank you very much. We have three individuals signed up to speak this evening. I'll call you up and you've come up to the podium for your time. First up, we have Matt Morgan Sky. Matt Moore, Jen Psaki, Denver, Colorado.'",
        "'speaker_6': 'And three. One, two, two. Marion. I'm available for questions if needed. Great. Thanks. Next up, Jesse Parish.'",
        "'speaker_14': 'Good evening. Members of council. My name is Jesse Paris. I'm a member of Black Star Action Movement for Self-defense and Denver Homeless out loud. I am against this proposal. This is becoming a recurrent theme. You change the zoning of this hood, historically black and brown communities, so you can continue to gentrify these areas.'",
        "'speaker_14': 'This is not acceptable and we are not going to stand for this anymore. These properties in question. Who is this really going to benefit? He said I should working for an inclusive Denver, but it's really an exclusive Denver.'",
        "'speaker_14': 'The so-called affordable housing you guys keep talking about is not going to be for those that were in these neighborhoods for generations. This is for these transplants that are moving in because of. The legalization of marijuana and other factors in the past few years.'",
        "'speaker_14': 'This is not going to benefit those that have lived in these neighborhoods for generations. I myself am one of those people. So I'm definitely against this. It can keep changing the zoning all you guys want. But the fact still remains this is gentrification and there's no way around that.'",
        "'speaker_14': 'This is not going to benefit people of color, specifically black people and brown people. This is going to gentrify this benefit, gentrification, white folks that are moving into these neighborhoods. So I am once again against this access. You do a further study of these properties in question because.'",
        "'speaker_14': 'At the end of the day. Got to follow the community. The community is not okay with this. Those that have been in these neighborhoods for generations are not okay with this. You are in the back caucus of these business developers.'",
        "'speaker_14': 'I understand it has become apparently clear. So I would ask that members of this council look further into this study, these properties and actually come up with. A sensible. The season.'",
        "'speaker_6': 'Thank you. Thank you. And our last speaker is Chairman Sekou.'",
        "'speaker_2': 'But even council. My name is Chairman Sekou, representing the National Action Movement for Self-defense. Client base of Homeless Youth. Senior citizens. Poor. Working class folks. And the folks that are voiceless, scared to come down here. Because it's intimidating and I have no experience with this.'",
        "'speaker_2': 'And so we kind of minimize that by coming down and being the voice so that this can be simply explained. So that they are encouraged to know that you guys are human beings. And then you open minded to hear things.'",
        "'speaker_2': 'And even if the council doesn't agree, at least they can consider poor folks who are voters in this town and tax payers about their concerns about how we do what we do down here. That's it. Anybody mad? Nobody.'",
        "'speaker_2': 'And we can work it out now. I'm for this. And as you can see, even inside our organization, there are various opinions on this thing. So we don't squash the opinion, we share it and then let you know how we feel.'",
        "'speaker_2': 'And the constitution of the organization that we represent, because we are down for freedom of speech. So we're down for this. And I'll tell you why. First of all, it fits all the criteria which folks are the considerable work and research and thinking about how are we going to do this thing called residents and how they do'",
        "'speaker_2': 'and empowered with the land that they pay for to development according to human necessities and needs. Now, my man, he's a preacher. He has a moral standing in the community. He is not the enemy of corporations that come in here and do this.'",
        "'speaker_2': 'This is a little guy has come to church. He's not a corporation. He's not the enemy. He is not down to just justification. And he needs to have the right to have the flexibility so that he can expand on his property and create the housing that poor people need.'",
        "'speaker_2': 'Now, of course, this criteria that we do with the LWD dude plans and this and that and other is down board has been voted on it in place. That's it. Now the question becomes your moral obligation us to do the right thing for the right reason.'",
        "'speaker_2': 'I'm trusting you.'",
        "'speaker_6': 'And I'm with you. Could you please take secure comments towards council?'",
        "'speaker_2': 'Oh, I'm sorry. You know, sounds good. So I'm holding him to his code of conduct. You know, I'm sad that somewhere along the way we got to begin to trust one another that you do what you say you're going to do.'",
        "'speaker_2': 'Now, if he don't do it, I'll be the first one up there in his church asking him what happened. So the pressure is on us to make them do what they say they're going to do. And it's only through the organization or the masses of the people will be able to do this.'",
        "'speaker_2': 'Is too much work for the few? We need many to get involved.'",
        "'speaker_6': 'Thank you very much. Time's up. All right. That concludes our speakers questions from members of council. The public hearing for Council bill 169 is closed. Comments from members of Council. All right. No questions. No comments. Um, takes us then, Madam Secretary.'",
        "'speaker_6': 'Roll call.'",
        "'speaker_4': 'Black Clark.'",
        "'speaker_6': 'All right.'",
        "'speaker_4': 'Sorry, Flynn.'",
        "'speaker_6': 'No.'",
        "'speaker_4': 'Gillmor Herndon High Cashman can each. Lopez. I knew Ortega.'",
        "'speaker_1': 'By.'",
        "'speaker_4': 'Sussman. I Mr. President.'",
        "'speaker_6': 'All right, Madam Secretary, please close voting, announced results.'",
        "'speaker_4': 'Sorry, but I'm going to make sure everyone is in ten eyes. One nay.'",
        "'speaker_6': 'Ten eyes, one nay accountable. 169 has passed. Councilman Herndon, will you please put Council Bill 171 on the floor?'"
    ],
    "Zoning Change for 4401 Josephine Street in Elyria Swansea.": [
        "'speaker_7': 'Yes, Mr. President. I move the council bill 2018 0171 to be placed upon final consideration and do pass.'",
        "'speaker_4': 'Sorry. Just looking at the.'",
        "'speaker_6': 'List up here.'",
        "'speaker_4': 'We say.'",
        "'speaker_6': 'Can I get a second on the screen? Thank you. It has been moved and seconded. The public hearing for Constable 171 is open. May we have the staff report?'",
        "'speaker_10': 'Thank you. Scott Robinson with Community Planning and Development. This is a request to rezone 40 4001 Josephine Street from e t u v to urh3. A property is located in Council District nine in the Elyria, Swansea neighborhood. It is at the corner of 44th Avenue and Josephine Street.'",
        "'speaker_10': 'Property is about 11,000 square feet and is currently vacant. Request is to rezone from A2, which is urban edge neighborhood context to unit zoning with a 4500 square foot minimum lot size to you are h3a which is urban neighborhood context rowhouse zoning with a three storey maximum height and A indicates that additional building forms are allowed, including'",
        "'speaker_10': 'the small apartment building for on certain corner lots such as this one. The applicant is requesting this rezoning to allow for the construction of such a small apartment building. The surrounding zoning is E2 B to the north, south and east, and then high A to the west, which is late industrial zoning.'",
        "'speaker_10': 'The surrounding land uses are a mix of single unit two unit and multi-unit residential. Again to the north. South and east. And industrial. To the west. And you can see the subject property is the top left picture. And then some of the surrounding property, the industrial property just to the west is the bottom left and then the'",
        "'speaker_10': 'variety of of residential types in the other photos. This went to planning board on February 7th. I received a unanimous recommendation of approval. There was no public comment at that meeting. I went to the Land Use Transportation and Infrastructure Committee on March 6th, and we received no other public comment on this application.'",
        "'speaker_10': 'As you know, in order to approve a rezoning, the city must find that these five criteria have been met. The first criterion is consistency with adopted plans. There are three plans that apply to this property, the first being comprehensive plan 2000 has described in the staff report.'",
        "'speaker_10': 'Staff's found that the proposed rezoning is consistent with these four strategies from campaign 2000 relating to infill development, brownfield development and providing a variety of housing options. The second plan is Blueprint Denver. From 2000 to Blueprint, Denver designates this property as single family duplex, which calls for a mixture of housing types single family duplex, townhouse and small'",
        "'speaker_10': 'apartment consistent with what would be allowed under the new RH three zoning. Property is also designated as an area of stability, which calls for maintaining the existing character while accommodating new development, which is consistent with the proposed rezoning.'",
        "'speaker_10': 'Josephine Street is an industrial arterial. The arterial classification is consistent with the somewhat higher intensity proposed for the site. The properties in this area are not actually industrial, so the industrial designation, that sense does not have that much bearing on it.'",
        "'speaker_10': 'And 44th Avenue is a non-designated local intended for supplying local access. The third plan is the Elyria and Swansea and Neighborhoods plan from 2015. This plan again designates the property as single family duplex, which, similar to Blueprint. Denver, calls for moderately dense housing areas and a mix of housing types, single family duplex townhouses and small apartment buildings'",
        "'speaker_10': '. Again consistent with the proposed you are age three. Zoning property is also designated a traditional residential area which again calls for this mix of housing types, single family duplexes and small apartment buildings. Again, consistent with the proposed zoning, the plan recommends a maximum height of two and a half storeys, which is slightly lower than what the proposed'",
        "'speaker_10': 'zoning would allow at three stories. However, there's not a zoned district that really meets all of the requirements of the plan. Plan calls for urban neighborhood context, calls for this mix of housing types and a two and a half storey maximum height.'",
        "'speaker_10': 'There's no zoning district that meets all three of those. So this zoned district, while slightly exceeding the height, the real difference is about three feet, 35 feet for two and a half storeys versus the maximum height of 38 feet for the apartment form.'",
        "'speaker_10': 'In the proposed you RH three. So staff believes that the proposed request is consistent with the recommendations of the Elyria, Swansea and Swansea Neighborhoods Plan and finds the first criterion met. The second criterion is uniformity of district regulations.'",
        "'speaker_10': 'The proposed rezoning would result in the uniform application of the new RH three zone district. The third criterion is to further the public health, safety and general welfare of the city. Staff finds that the proposed rezoning would do so by implementing the city's adopted plans and facilitating the redevelopment of a vacant parcel.'",
        "'speaker_10': 'The fourth criterion is justifying circumstances. Staff finds that the proposed rezoning is justified by the changed and changing conditions in the area. There's been a significant amount of change still going on in the Elyria, Swansea neighborhood with the redevelopment of the the stock show site, the addition of the RTD line and other significant other changes in the'",
        "'speaker_10': 'area that have increased the need for housing in the area and justified this rezoning to allow additional housing development. And the fifth criterion is consistency with neighborhood context, zoned district purpose and intent. The proposed rezoning would allow developments consistent with the urban neighborhood context and the purpose and intent of the new RH three AIDS on district.'",
        "'speaker_10': 'Therefore, staff finds that all five criteria are met and recommends approval and be happy to answer any questions.'",
        "'speaker_6': 'Thank you very much. We have three individuals signed up to speak this evening. When I call you up, please come up to the podium. First up, Casino Williams.'",
        "'speaker_1': 'So I'm not seeing a Williams applicant. I live in Denver and I'm available for questions.'",
        "'speaker_6': 'Great. Thank you very much. Next up, Jesse Pierce.'",
        "'speaker_14': 'Um. Yeah. This should be under further consideration. So I'm down for.'",
        "'speaker_6': 'And I know I know you spoke last time, but could you just say your name for the record for this one?'",
        "'speaker_14': 'Jesse Pierce.'",
        "'speaker_6': 'Thank you very much. And our last speaker for this one, Chairman Sekou.'",
        "'speaker_2': 'Yes. My name is Chairman Sekou. Explorer Action Movement representing poor, working, poor homeless people and voiceless youth. We are excited. About this approval of this ordinance change. I've been coming down here for almost 12 years and another 12 years.'",
        "'speaker_2': 'I've seen a sister, a brother from a neighborhood come up here and ask to be a part of this process. And that's a beautiful thing because that's what keeps me coming back, because I got hope for real. And I have faith in this body to make a decision that is unanimous because it fits every criteria for everyone'",
        "'speaker_2': 'else who have gotten this change. And to deny her that would be straight up racism and class. And that ain't your steady job. It's one of the issues we got going down here as it is. People don't get to know you on the television.'",
        "'speaker_2': 'I keep telling them, look, come on down here. General Clark, ain't that bad. Ben Franklin, these go with it. And then we got.'",
        "'speaker_6': 'To refer to the council as a whole.'",
        "'speaker_2': 'I'm Cooper poor. I'm taking them no more time. You already know it's already there. And we ain't got to talk about it no more because it's the right thing to do, period.'",
        "'speaker_6': 'Thank you. That concludes our speakers. Are there any questions from members of council? Kathleen Flynn.'",
        "'speaker_11': 'Thanks, President. Scott, could you the townhouse form allows apartments as well, three up to three stories.'",
        "'speaker_10': 'In the townhouse form. The units have to be side by side. They do and have to each have their own entrance. So it'd be the apartment for them to build an actual apartment building. And the townhouse form is limited to two and a half storeys and 35 feet in the proposal or three.'",
        "'speaker_11': 'But this is a corner lot, right? Correct. And in the in the code, it says a part one. You RH three apartments are allowed up to three stories on certain corner lots, correct?'",
        "'speaker_10': 'Yes. Yes. So an apartment could be built on this property in the apartment building form.'",
        "'speaker_11': 'Okay.'",
        "'speaker_10': 'Yes.'",
        "'speaker_11': 'All right. Thank you. That's all.'",
        "'speaker_6': 'All right. Any other questions? All right. Seeing none. The public hearing from House Bill 171 is closed. Are there any comments by members of council? It's a quiet group this evening. All right, Madam Secretary, call.'",
        "'speaker_4': 'Black eye. Espinosa. Flynn.'",
        "'speaker_6': 'Hi.'",
        "'speaker_4': 'Gilmore. Herndon Cashman. Kenny Lopez. I knew Ortega Susman. Mr. President.'",
        "'speaker_6': 'I. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_4': 'Ten Eyes.'"
    ],
    "Rezoning of Property at South Harrison Street in Belcaro.": [
        "'speaker_6': 'Let's see, 11 up on one. All right. 11 eyes counts. Bill 171 has passed. Councilman Herndon, will you please vote caliber 172 on the floor.'",
        "'speaker_7': 'Mr. President, I move the Council bill through 2018 017 to be placed upon final consideration and to pass.'",
        "'speaker_6': 'It has been moved to get a second. Thank you very much has been moved and seconded. The public hearing for Carlsberg 172 is open. May we have the staff report?'",
        "'speaker_1': 'To Sally Sara with community planning and development. This is another map amendment. It is for property located at 3013303 and 327 South Harrison Street. The proposal is to rezone from before with waivers. You are one and you are two to urban center mixed use five and urban center mixed use eight.'",
        "'speaker_1': 'Property is located in City Council District ten in the Belle Carrero neighborhood. It is about 31,000 square feet, a little, almost 32.7 acres. Currently a car wash and vacant property. Again, the proposal is to rezone from an old code zone district b4 with waivers.'",
        "'speaker_1': 'You are one is the adult use overlay and you go to is the billboard overlay to urban center mixed use five stories and urban center mixed use eight stories. The purpose is to redevelop the property. So again, zoning current site and a lot of the surrounding properties are that before with waivers you will want a new oh'",
        "'speaker_1': 'two. To the north is GMU five general urban multi-unit five stories South and west. Before with waivers, you were one you own to an east on Colorado Boulevard urban edge mixed use three with the other one and you own two overlays.'",
        "'speaker_1': 'So again, the land use is a carwash and vacant property to the north, multi-unit to the south, another vacant property, but then a multi-unit structure to the east commercial on Colorado Boulevard to the west, an office building. So this gives you an idea of the scale of the area and the location of the property.'",
        "'speaker_1': 'It is relatively at the Alameda and Colorado Boulevard intersection, and this gives you an idea of the scale of structures in the area. The center top is the property itself. The property to the north across Alameda is top right.'",
        "'speaker_1': 'And then the property on Colorado Boulevard is a gas station that's to the east. And then lower left is the apartment building to the south of the property, and then upper left is the office building to the east, to the west of the property.'",
        "'speaker_1': 'So urban center mixed use is just that mixed use. The commercial and multi-unit residential are generally the use types. They are pedestrian oriented, diverse areas and are meant to be improve the transition between commercial and residential. The process for this one, it came in in October of 2017, an informational notice went out to council and the registered'",
        "'speaker_1': 'neighborhood organizations. The planning board hearing was held in February of this year and there was a unanimous vote to recommend approval. And then we cleared the committee in February of this year, and at last week's city council hearing, this matter was postponed until this evening's public hearing.'",
        "'speaker_1': 'So the rhinos in the area have not commented on this and nor have we received any other letters on this application. So, you know the criteria. There are three plans that are relevant in this area. Current Plan 2000 Blueprint Denver and the Cherry Creek Area Plan from 2012.'",
        "'speaker_1': 'And staff believes that this application conforms with our current plan in 2000 strategies as detailed in the staff report. This is in on the Blueprint Denver map, an area of change, the areas of the city where we want to channel growth.'",
        "'speaker_1': 'It is called a regional center as part of the Cherry Creek area, where you want to balance retail, employment and residential and have many uses concentrated in a small area. Street classifications for Harrison Street and other designated local street.'",
        "'speaker_1': 'East Alameda is a mixed use arterial and an enhanced transit corridor. Those, of course, arterials are our major streets connecting the whole city and the enhanced transit corridors are where we want to concentrate, hopefully transit, supportive uses and policies.'",
        "'speaker_1': 'Colorado Boulevard is a commercial arterial south of Alameda and a residential arterial north of Alameda and is also an enhanced transit corridor in the Cherry Creek Area plan. There is a framework plan that talks about Cherry Creek in general and basically says that we should acknowledge that to prosper, Cherry Creek needs to grow and change.'",
        "'speaker_1': 'Cherry Creek Plan Did Update Blueprint Denver. You can see on the maps in front of you that the map on the right is the update and the this property remains in an area of a change. The Cherry Creek Plan also did modify some land use and zoning regulations and design guidelines for the area, hoping to have positive'",
        "'speaker_1': 'change for the area within the sub areas of the Cherry Creek Plan. This property is called part of the Cherry Creek Triangle. Where there is it is does remain an area of change and where we want to have growth and reinvestment and new development should continue to be a mix of land uses should should respond to surrounding'",
        "'speaker_1': 'conditions of parkways and greenways and other development, and should transition to the neighborhoods adjacent to Cherry Creek. So in the Cherry Creek area plan this these maps show that it is part of the regional center and the height recommendations out of the Cherry Creek Plan are five and eight stories.'",
        "'speaker_1': 'So staff believes that this application is consistent with the three plans that govern the area or recommend the area, and that by using standard zoned districts, we are being consistent in our zoned districts. And so there is a uniformity of our district regulations and that by allowing this redevelopment and changing conditions that we are furthering the public'",
        "'speaker_1': 'health, safety and welfare changed circumstances is of course lots of change happening in Cherry Creek area and staff believes this is consistent with the urban center context, very pedestrian oriented, very mixed in uses both vertically and horizontally. So with that, staff recommends approval.'",
        "'speaker_6': 'Thank you very much. We have three individuals signed up to speak this evening. When I call you up, please come up to the podium to make your remarks. First up, Mark Johnson. Mr. President, members of the council, my name is Mark Johnson, a month old post development company, where at 999 18th Street here in Denver.'",
        "'speaker_6': 'And I'm the applicant and available to answer any questions you may have in our rezoning request. Thank you. Thank you. Next up, Jesse Paris.'",
        "'speaker_14': 'She has a Paris like star action moment. Under further consideration, I renounce my opposition to this bill. We know that. We know it's the people's champion. So we are for this.'",
        "'speaker_6': 'Thank you. And our last speaker tonight, Chairman CQ.'",
        "'speaker_2': 'German say God bless the Irish and movement for self-defense. Representing poor, working, poor, homeless youth and senior citizens. I take great pride. And this project happening, especially in council the news district. We honor his work that he is done to make sure that folks who are out the loop are included in the loop, especially when it comes'",
        "'speaker_2': 'to contracting and jobs. He is headed up many subcommittees around this issue. He's got in your support on these things. And so because we know him personally, talk to him any kind of day, he'll pick up the phone, he'll talk to me.'",
        "'speaker_2': 'And because of that, I can talk to others and tell them honestly. He has never, ever lied to me, even when we disagree. So. We know that this already is the criterion. We know that. Hands down. Nothing special, nothing slick going on here.'",
        "'speaker_2': 'It's the way they do what they do. And we know that CAZENEUVE Manu's going to hold them according to what has been happening because he makes the extraordinary effort after the zoning changes to be there for us to find out what are you doing, what this is going to do?'",
        "'speaker_2': 'Are they including us? Are there jobs for people? One, two, three, ABC. We can get that from him. And he's a sterling example of what a city councilman needs to be about, whether it's male or female. People call, make sure they can pick up the phone and talk to a person, not a machine.'",
        "'speaker_2': 'And that creates the bonding. Because the truth is. It takes teamwork to make the dream work. And you're the only team I got. I'm just going to talk about straight up. You all I got you all the people got.'",
        "'speaker_2': 'Because we voted for you all to be here and all that opposition and people talking about you about this and that. And we'll do voodoo. Hey, they don't do what you do. They don't have no clue about how this works.'",
        "'speaker_2': 'So the name of this game is this. This is for the masses of the people and all those folks who got opinion about what you do. No investigation, no right to speak, because you have no data to back it up and you're spreading chaos.'",
        "'speaker_6': 'And Chairman Jim Insecure, can you can you stay on on the topic of this?'",
        "'speaker_2': 'That's all it.'",
        "'speaker_6': 'Thank you. That concludes our speakers. Are there any questions from members of Council Councilman New.'",
        "'speaker_12': 'Well, first, I want to thank Sharon. Thank you for those kind words. But I didn't hire him as my public relations service. Anyway, thank you. I would like to see Mr. Johnson. Next question, please. Thank you. Thank you for developing this property first thing.'",
        "'speaker_12': 'Looking forward to it. Could you tell a little bit to council a little bit about the uses which you're going to be developing there?'",
        "'speaker_6': 'Yeah. So what we're proposing as a senior housing project will be mostly independent living and assisted living units 148 total. It'll be eight storeys. We'll have an amenity deck up on the eighth floor to take advantage of the views to the West.'",
        "'speaker_6': 'There'll also be some activated spaces on the first floor facing Alameda with restaurant and bar area for the residents. We're going to have roughly 67 car parks below grade one level, and we'll have another eight spaces on the first floor level.'",
        "'speaker_6': 'And the operator is Soltero. There are group out of Phenix, Arizona, but they also operate a facility down in Castlerock. They currently on and manage about 950 units, so they're very seasoned and experienced in this product type. We plan to get started, hopefully this August with construction and we had complete in February, March of 2020.'",
        "'speaker_12': 'Thank you very much. Senior housing is very needed. So appreciate what you're doing. Thank you very much.'",
        "'speaker_6': 'Thank you, Councilman. New Councilman Flynn. Thank you, Mr. President. Mark, on the.'",
        "'speaker_11': 'Rezoning application, you are the owner, the representative of the owners of the property. Correct. Which are Shea and Kwame and Joseph Mix-A-Lot put on the suit. I'm sorry, but on the third page where the owners are supposed to verify that you are their representative, you signed as the owner.'",
        "'speaker_11': 'Also, can you explain due to I'm just trying to make sure that we have the consent of the owners of the property.'",
        "'speaker_6': 'For that one of the owners is here so. Okay and I'm sure he would you would.'",
        "'speaker_11': 'That would be helpful.'",
        "'speaker_6': 'If you're going to be come on up to the podium to answer Councilman Flynn's question.'",
        "'speaker_2': 'My name is Joseph MC Sood. I'm the owner and I totally approve of this project. I think it's excellent. I've been waiting for this for almost 40 years. When I built the car wash. So I think it's time.'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_11': 'Okay. You built. You built a car wash instead of a senior living. Okay.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_6': 'And is someone here from Shea? Who. Who is Shea? And and and Shea Properties owns a small portion, I think it's about 6000 square feet. The vacant parcel, you know, they're a large honored developer based in California, but they have an office here in Denver.'",
        "'speaker_6': 'Right. They've been in support of this from day one. So I'm surprised that they're not here.'",
        "'speaker_11': 'Okay. Thank you.'",
        "'speaker_6': 'You know.'",
        "'speaker_11': 'Just. Teresa, can you. Can you explain, you know, the page I'm looking at where it says if you're the owner's representative, you have to have the owners sign that you do represent them.'",
        "'speaker_1': 'Right. And so further back in the application, there should be letters from the owners authorizing Mr. Johnson to represent them.'",
        "'speaker_6': 'Okay.'",
        "'speaker_1': 'In this matter.'",
        "'speaker_11': 'Thank you. I will look for that. I didn't immediately see it. Thank you. That's all, Mr. President.'",
        "'speaker_6': 'All right. Thank you, Councilman Quinn. Are there any other questions? All right, Zenon. Public hearing for Council Bill 172 is closed. Comments by members of Council Councilman New.'",
        "'speaker_12': 'Thank you, Mr. Chair. We look forward to the development of this property. The senior housing is such an important issue in that whole area around the city as well as especially Cherry Creek. So. So I really appreciate what they're doing with this property and look forward to your starting up this project as soon as possible.'",
        "'speaker_12': 'Thank you very much.'",
        "'speaker_6': 'Seeing no other comments, Madam Secretary, roll call.'",
        "'speaker_4': 'New Ortega.'",
        "'speaker_1': 'Like.'",
        "'speaker_4': 'Sussman I Black Flynn, I Gilmore, I Herndon, I Cashman can eat Lopez.'",
        "'speaker_6': 'Right.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_6': 'Hi, Madam Secretary. Please close the voting, announce the results.'",
        "'speaker_4': 'Lebanese two days.'",
        "'speaker_6': 'I think we have.'",
        "'speaker_4': 'To absent.'",
        "'speaker_6': 'Two absence of 11 eyes, zero nays, zero abstentions, two absent councilwoman 72 has passed. On Monday, May 14th, 2018, Council will hold a required public hearing on Council Bill 18 0325 Changing the zoning classification for 2391 South Sherman Street in Rosedale.'",
        "'speaker_6': 'Any protest against Council Bill 18 0325 must be filed with Council officers no later than Monday, May seven, 2018, saying no other business before this body. This meeting is adjourned.'"
    ]
}