{
    "Proclamation for National Lights on Afterschool Day.": [
        "'speaker_1': 'So I did forget to announce that. Kudos to the airport. All right. Proclamations. We have two this evening. We'll start with Proclamation 758 sponsored by Councilman Lopez. Will you please read Proclamation 758.'",
        "'speaker_5': 'Thank you, Mr. President. I will. Proclamation number 758 Series of 2015 Celebrating Denver Afterschool Programs and the 2015 Annual Nights I'm Sorry National Lights On After School Day. Whereas the Denver City Council recognizes that after school programs make a lifelong difference for kids and their parents.'",
        "'speaker_5': 'And. WHEREAS, Denver is home to over 93,000 school age youth, producing a significant need for afterschool programs to support their academic, social and physical development. Those engaged in high quality afterschool programs outpace their peers in academic growth, have better school attendance, and have better behavior in school while staying on track to graduate high school.'",
        "'speaker_5': 'And. Whereas, high quality afterschool programs provide students with access to academic support, music, arts, sports, leadership, development, conflict resolution and more. Building many important 21st century skills that inspire increased confidence, making connections to future education and career opportunities.'",
        "'speaker_5': 'And. Whereas, the demand for after school programs far outweighs the availability for every one student enrolled in a quality after school program, there are two students just waiting to get in, and national studies show parents with regular after school care for their children missed eight more days of work per year than their peers whose children are in'",
        "'speaker_5': 'regular school after regular afterschool programs. Revealing the importance of these programs and supporting working families the economic strength of our great city. And. Whereas, The Denver Afterschool Alliance, a collaboration among the city and county of Denver, Denver Public Schools and many of Denver's funding and community based organizations helps improve program quality and increase afterschool access for all'",
        "'speaker_5': 'of Denver's youth. And. WHEREAS, The Denver Afterschool Alliance provides tools and resources to help providers improve program quality and measure outcomes, creates a long term collaborative, collaborative plan addressing the need for high quality afterschool programs across Denver and maps programs citywide, addressing gaps in availability and helping parents fight the right or find the right program excuse me'",
        "'speaker_5': 'for their child. And. Whereas, every $1 invested in afterschool programs saves $9 by reducing crime and welfare costs, improving kids performance at school, and increasing kids earning potential. Whereas the Denver City Council pledges to support afterschool programs so that Denver's children and families benefit from quality afterschool programs that help close the achievement gap and prepare young people'",
        "'speaker_5': 'to compete and succeed. Now, therefore, be it proclaimed by the Council, the city and county of Denver, Section one, that the Denver City Council recognizes the outstanding leadership of the Denver Afterschool Alliance for their innovated afterschool programs for Denver children and recognizes the 2015 National Lights on Afterschool Day.'",
        "'speaker_5': 'Thursday, October 22nd, 2015. In Section two that the clerk of the city and county of Denver shall a test and a a seal of the city and county of Denver to this proclamation and transmit it to the Office of Children's Affairs.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Your motion to.'",
        "'speaker_5': 'Adopt. Thank you, Mr. President. I move that council proclamation number 758 2015 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilman Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. This is just a great program. Eight years ago, I traveled with MAXINE Quintana and leaders from our Denver Public Schools, inner city to Washington, D.C., to make sure that we fight for funding for this program and actually to grow the program now.'",
        "'speaker_5': 'It was excellent then, but it is even more impressive now. And when I hear about this program, I think other colleagues on this Dias have had this experience of reading this proclamation. And I'm just glad that we're able to do it and bring it back home.'",
        "'speaker_5': 'It's great to see this kind of success. And I just am I can't emphasize more just how important that return on investment is. $1 saves nine. And far too long and far too much. In this city, we seem to be too focused on correcting adult behavior rather than creating amazing children and not having to build jails, but'",
        "'speaker_5': 'instead build schools. So until we get to that day, I think we're going to take your lead and these great kids who are here dressed in orange. And especially the kid at the Broncos hat. I think we really have a great thing going.'",
        "'speaker_5': 'Mr. President, thank you.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilman Brooks?'",
        "'speaker_6': 'Yeah, I think, Mr. President and Madam Secretary, please. I mean, to this this proclamation has a sponsor. Councilman Lopez, you've you've been on a roll two weeks in a row. Four excellent, excellent proclamations. I feel like we need to do a proclamation to you.'",
        "'speaker_6': 'But I want to just just talk real quickly about the just the importance of public investment and private investment. Public private partnerships into afterschool programs, I think is incredibly important. I grew up as a latchkey kid, so I grew up in these programs.'",
        "'speaker_6': 'And my professional career started leading these programs. And so as I look in, I see the the youth leaders and folks here, I want to thank you for your investment into these young people. And there's an ROI that you cannot count from a fiscal perspective.'",
        "'speaker_6': 'And it's a changed life. You can't count that. And that's what so many adults did for me. And that's what I got a chance to do for for so many young people. And now those young people are 25 and 35 and they have kids and and they are now leading in this city.'",
        "'speaker_6': 'And I just hope that the young adults who are leading here can one day see these young kids who are in a city council meeting. For goodness sakes, I'm so sorry. You you can see their lives in the next five, ten years and see them as transformed.'",
        "'speaker_6': 'And so we need more and more of this all throughout our community. And we can never stop investing in our young people. You want to know what Denver looks like? I tell people this all the time. You don't know what Denver looks like.'",
        "'speaker_6': 'You look at these orange shirts because that's our future and that's where we need to be investing in, too. So I proudly support this, and I would proudly support any budget amendment to put more money into afterschool programs.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilman Clark.'",
        "'speaker_5': 'Thank. Thank you, Mr. President. And thank you, Councilman Lopez, for bringing this up, this proclamation. I'm very excited to support this tonight. There is no better investment than we can that we can make in the future of our city that investing right here and all of you see the future of our city, future city council people.'",
        "'speaker_5': 'Although after tonight, you might think this is a little boring for what you want to do. Future mayors, future leaders of our city. And I love that on your shirts that says after school matters because I matter. So if you'll indulge me for just a second, I'm gonna count to three.'",
        "'speaker_5': 'And all of you out there in those shirts, I want you to yell as loud as you can. I matter on three. You think you can help me out? That I can't hear you? Can you help me out of that?'",
        "'speaker_5': 'That's more like it. One, two, three. Thank you all for being here. You are the future of our city, and it's fantastic whenever we can do anything to support you. So when you guys need something, you call us, okay?'",
        "'speaker_5': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Clark. There's no better way than. And on that note, Madam Secretary, roll call.'",
        "'speaker_2': 'Lopez I knew Ortega I assessment I black brooks I matter. Clark, i Espinosa. Flinn, i gilmore i cashman. I can eat. Mr. President, I.'",
        "'speaker_1': 'Well, interestingly enough, Councilman Lopez, we were waiting. Got it. Madam Secretary, please call the voting. Announce the results. 3939. 785 has been 758. Excuse me. Has been a Dr. Catherine Lopez. Don't suppose there's someone in the audience you like to invite to the podium to receive the proclamation?'",
        "'speaker_5': 'Yes, I do. There's a couple of great people. First is MAXINE Quintana with the Denver Office of Children Affairs and she has a guest, too. I want to welcome to the microphone. It's Arabi, Mohammed. Welcome.'",
        "'speaker_3': 'Thank you, Councilman Lopez. Thank you guys are for letting us be here tonight and for this wonderful proclamation again and just getting to bring our young people here in city council chambers to see what you guys do as the leaders of our city everyday.'",
        "'speaker_3': 'So thank you. I'm not going to speak long. I really want to give Aubrey a chance to say a few words. But in my role not only as the director of Out-of-School Time Initiatives for the Office of Children's Affairs and as a member of the staff team for the Denver Afterschool Alliance, you guys all have additional information'",
        "'speaker_3': 'about the Denver Afterschool Alliance in your packets. I just want to reiterate again the importance and the need for afterschool programing. And again, as Councilman Lopez said in the proclamation, for every one child in a program, there are at least two waiting to get in.'",
        "'speaker_3': 'I want to thank City Council for the support that we as a city already provide for afterschool programing through our dedicated funding for Measure two A and the marijuana tax revenue funds that we get in our office. That again goes right back out the door to serve program during the after school hours.'",
        "'speaker_3': 'And while again it's meeting some need, it's still not meeting enough. And so we in the Office of Children's Affairs and the Denver Afterschool Alliance are continuing to leverage our resources and to bring more stakeholders to the table so that we can ensure that every child in every neighborhood in Denver has an after school program that they'",
        "'speaker_3': 'can benefit from. So I want to introduce Aubrey. Hello.'",
        "'speaker_2': 'Hello. My name is. I have a moment. After school programs have made a very amazing impact in my life, especially at the Bridge Project and Boys and Girls Club after school at the Bridge Project and Boys and Girls Club give you a safe place to complete homework and to be able to experience new opportunities.'",
        "'speaker_2': 'At the Bridge Project I have experienced being able to work with kids that have different abilities than me. I have also experience being able to speak out on my voice and say my opinions and thoughts throughout the public.'",
        "'speaker_2': 'I've also been able to speak at the voice of educator and education and prove to the educators that Davis Elementary School should stay open at the Boys and Girls Club. I have experience being able to run for Youth of the Year, which is a program that you have to explain what the club means to you and why'",
        "'speaker_2': 'you go to Boys and Girls Club. I have also experience being able to attend Easter Parade, which is which is a program that you get to create your own Easter and walk down the red carpet after school programs, give us kids opportunities to have a chance to experience new things and to be able to meet new people'",
        "'speaker_2': '. Afterschool programs also give us kids a chance to make strong relationships with kids and stuff. Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Lopez, for bringing that forward. And thank you all for coming. I can't imagine you want to stay. So thank you all so much. All right. We've got one more proclamation. And what do you know?'",
        "'speaker_1': 'Sponsored by Councilman Lopez 779 We read please read proclamation 779.'"
    ],
    "Proclamation of Choose to be G.R.E.A.T. Week in Denver.": [
        "'speaker_5': 'Oh. Councilman Brooks, you got your wish, man. Council Proclamation 758 series of 2015. Well, I know. I'm sorry. Sorry. Scott Shire Council Bill. Our Council Proclamation 779 six of 2015 proclaiming the week of October 19, 2015 to October 23rd, 2015, as Choose to be great week in Denver, Colorado.'",
        "'speaker_5': 'Whereas the city and county of Denver is committed to ensuring the safety and security of all its residents and visitors. Whereas, youth violence, delinquency and bullying are concerns both locally and nationally. And. WHEREAS, the Gang Resistance, Education and Training Great Program as an evidence based gang violence prevention program built around school based law enforcement and officer instructive'",
        "'speaker_5': 'classroom curricula. Teaching youth to say no to gangs, drugs and crime. And. WHEREAS, the great program offers a continuum of components for students and their families that focus on providing life skills to help youth avoid bullying, delinquent behaviors and violence.'",
        "'speaker_5': 'And. Whereas, GREAT has now served over 6 million students nationally and internationally since its inception in 1991 and since 2011 has been taught to over 5000 students in the Denver Public Schools in partnership with the Denver Juvenile Probation Department, Denver Police Department, the Denver Sheriff's Department, in coordination with the Gang Reduction Initiative of Denver or.'",
        "'speaker_5': 'Great. Now, therefore, be it proclaimed by the Council, the city and county of Denver, Section one, that in the pursuit of reducing youth violence and bullying while fostering a better relationship between youth and law enforcement officers, the Council of the City and County of Denver does hereby proclaim the week of October 19, 2015 through October 23rd, 2015'",
        "'speaker_5': ', as Choose to Be Great Week. Section two that the Council of the City and County of Denver encourages all students to sign the great pledge. Quote unquote. I pledge to use my great skills to reduce violence in my community, work to resolve conflicts, conflicts peacefully, and stop bullying whenever I see it.'",
        "'speaker_5': 'Section three that the clerk of the city and county of Denver saw attest and affixed the seat, the seal of the city and county of Denver to this proclamation, and that copies be transmitted to the executive director, Paul Callan, and the Gang Reduction Initiative of Denver Chiefs Chief Sean Cone of the Denver Juvenile Probation.'",
        "'speaker_5': 'Chief Robert White of the Denver Police and Sheriff Patrick Furman of the Denver Sheriff's Department.'",
        "'speaker_1': 'Thank you. Councilman Lopez, your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. I move that council proclamation 1779 2015 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilman Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. I had the great privilege. Not only to watch this program take place in our schools and to see all these young people involved in this program, but to see some of the results as well, too, in an area that I know we've had a huge problem with youth violence, in an area that I'",
        "'speaker_5': 'know and a lot of people who would walk around years ago and say that this was a rough neighborhood and you felt afraid in it. Well, that's no more. It's a different feeling in the neighborhoods, and there's a lot of things that attribute to that.'",
        "'speaker_5': 'Even. Rec center and library hours. Attribute to that or paved streets and sidewalks. Attribute to that it's a big thing but. The one thing that we can't discredit or look past is this program and these efforts. And it's it's a it's an amazing program and it's part of a great initiative to reduce gangs in Denver and not'",
        "'speaker_5': 'by simply trying to arrest our way out of a situation of this problem. We can't. And it forces us to look at other measures and and focusing more on preventing violence rather than reacting to it. And so the last thing I will say is, you know, in its inception, I actually had the great pride and privilege to'",
        "'speaker_5': 'that, to be a co-chair of the other group. And they've done great work. They've done great work, and they continue to do great work. So being that, I'm using the word great a lot. Thank you, Mr. President. It's been a great proclamation.'",
        "'speaker_1': 'Thank you. Councilman Lopez, in other comments, seven, seven, nine. Councilwoman Ortega.'",
        "'speaker_4': 'Thank you, Mr. President. I just wanted to just acknowledge the great work that Deborah Garcia Sandoval has been doing as the leader of this great program for a number of years. And I don't know if you all know this, but this program was actually not proposed to have funding last year as we were looking to do the'",
        "'speaker_4': 'budget for this year. And, you know, I know some of us made phone calls to the mayor's office and said, you know, this is such an important program and it's such a small amount of money in comparison to dollars that are earmarked for other programs.'",
        "'speaker_4': 'And it makes such a huge difference for the lives of our young kids. And I was so pleased that the mayor continued funding this program and had an opportunity to go to one of the graduations and learn a little bit more about, you know, the coursework that the young folks participate in throughout the year.'",
        "'speaker_4': 'And, you know, this ties in perfectly with the proclamation that we did earlier, because having positive outlets for our young people is so important to ensuring that they continue to leave, lead their lives in the right path. And this program really has has just made such a difference.'",
        "'speaker_4': 'And so I just wanted to put my $0.02 in thank Councilman Lopez for bringing this forward and just want to see it continue because it really is helping make a difference. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Any other comments? 779. Routine. UN Madam Secretary, welcome.'",
        "'speaker_2': 'Lopez Hi, new Ortega. Sussman Black Brooks. Clark. Espinosa. Flynn. I Gilmore. Cashman. I can eat. Mr. President.'",
        "'speaker_1': 'Hi, Madam Secretary. If we first announced the results. 3939 779 has been adopted. Councilman Lopez, someone you'd like to invite to the podium to receive the proclamation?'",
        "'speaker_5': 'Yes. Thank you, Mr. President. There are three individuals who I'd like to come up to the to the podium recognizing. First, I wanted to ask and recognize our chief probation officer, Sean Cohen, Deborah Garcia Sandoval, who was the the great probation officer who worked with us on the proclamation, who works daily with the program.'",
        "'speaker_5': 'And then a woman who I always would get her emails or she'd get mine somehow. And I hear about this this p lopez. Denver Pearl Lopez from the Grid Project, who also worked on this proclamation, has been serving our city in a variety of capacities for a while.'",
        "'speaker_5': 'So welcome.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_6': 'I wasn't prepared to say anything. Our program director from GRID, Mr. Paul Callan, did here in the back row. I think he was the one that was.'",
        "'speaker_5': 'Going to get over here with.'",
        "'speaker_6': 'The goggles.'",
        "'speaker_5': 'The cameras are on you now, so you got to get up.'",
        "'speaker_6': 'So I would just like to say thank you from the bottom of my heart that I have the privilege to live in a city and to work in a city that supports programs such as Great and the Grid Project, the Gang Reduction Initiative of Denver.'",
        "'speaker_6': 'And I also want to be extremely thankful that I work in a department where I have a chief probation officer that is so visionary and thinks out of the box. That allows me, a probation officer, to be on special assignment to the city, to go into these schools and to teach the kids to say no to gangs'",
        "'speaker_6': ', drugs, crime and violence, and to say yes to a great future. Great is an awesome program that's been around. You heard since 1991, we've served over 6 million kids. It's international. It's in Central America. They're going gangbusters over there, no pun intended.'",
        "'speaker_6': 'But it's it's just really awesome that I get to be a part of all of this. And if we would really focus on putting the dollars on prevention, I think that we would like my chief probation officer said, probably work ourselves out of a job and we would be happy with that, wouldn't we?'",
        "'speaker_6': 'Yes. So I'm going to let my chief say a few words.'",
        "'speaker_3': 'The only comment I would want to make is that this is such a true collaboration between state and the city and county of Denver. And I came from Adams County, worked 15 years in state probation there, and was very difficult to break some of those barriers and gaps when you're talking about county funding versus state funding.'",
        "'speaker_3': 'And really, I think that we have put forth an effort to serve really the the children and families of Denver, regardless of whose silo they fall into. And so this has been a really enjoyable experience to work alongside with city employees and the Denver public schools to reach out to probation are to young people before they hit'",
        "'speaker_3': 'our door. And I know state judicial was very apprehensive about allowing a probation officer to do this type of work because it really is outside of our scope. But to me, it makes the most sense is that if we can prevent people from entering the justice system at any level, we're doing a good job.'",
        "'speaker_3': 'So I appreciate it. Thank you. Hi. I just want to say thank you also to Denver Public Schools for allowing us to be in the schools and to teach great to the elementary and middle school students. We're very welcomed in the schools.'",
        "'speaker_3': 'And again, we've taught over 5000 students in Denver up to this point. So thank you again for the proclamation and for the students really acknowledging this this whole week. And we've made videos. Officer Garcia has done a lot of work in really highlighting this whole week.'",
        "'speaker_3': 'So again, thank you. Thank you very much for the proclamation.'",
        "'speaker_5': 'And Mr. Khan, why don't you come up? I made a big mistake. My I. I read this wrong. I read the highlighted part, and I forgot. So I want to make sure you know that you are also in Colorado, just my right here.'",
        "'speaker_5': 'So without further ado, the executive director.'",
        "'speaker_6': 'Again to Councilman Logan Lopez and the rest of the council. Thank you for support of the great program. It is the anchor program of the city's gang prevention efforts. It's a program that truly exemplifies the coordination and partnerships that go into reducing gang violence in this city.'",
        "'speaker_6': 'In addition to police officers, sheriff's deputies, probation officers that teach the program starting in January 2016, we'll also have U.S. marshals and U.S. attorneys teaching the program alongside their probation officers and the police officers that are teaching the program.'",
        "'speaker_6': 'It is a program that has shown positive results in Denver on building relationships between law enforcement and youth and teaching kids the skills to stay away from violence and gangs. So, again, thank you very much. And there is funding for the next two years for the program.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Captain Lopez, for those two proclamations. All right. We are on to the resolutions. Madam Secretary, please read the resolutions.'",
        "'speaker_2': 'From business development 724 Resolution for an unbiased First Amendment between City and County of Denver and ThyssenKrupp Elevator, Inc. concerning a maintenance agreement at Denver International Airport 726 resolution approving any proposed Second Amendment to hotel management agreement. The Westin Denver International Airport to City and County.'",
        "'speaker_2': 'A different West India Operator, LLC. Related Development of an airport hotel at Denver International Airport 727 A resolution approving proposed airport use and cargo facilities. Lease agreement between Atlas Air Inc. City and County of Denver. Related Lease Space at Denver International Airport from Governance in Charter Review 696 A resolution approving the mayor's appointment of the Denver Community'",
        "'speaker_2': 'Corrections Board from Infrastructure and Culture 623 A Resolution Little Change Party to the city, streets and Bars Magnolia Street, its intersection with East Colfax Avenue 630, a resolution laid out opening a step change part of city streets as a marshall Plan and Martin Luther King Jr Boulevard and Central Park Boulevard at Stapleton filing number nine 640 a'"
    ],
    "Contract Approval for Brighton Boulevard and Montclair Creek Area Improvements.": [
        "'speaker_6': 'Uh, this this contract. One of the things that gives me pause, but it's not it's not really our purview at this point is that the team that's going to be managing this contract has not been sort of forwarded.'",
        "'speaker_6': 'I don't even know if it's been created yet. I've asked that specifically out in DCC. And so it's a legitimate concern. On May 25th of 2015, we passed the date that the VA was supposed to open, and as we all know, that's a joint venture by Cuit and Turner.'",
        "'speaker_6': 'And so this this leads directly to how well those contractors are led by our side. And so it's very concerning to me that we don't know who this contract from our side. And I would really like to have that information going forward and things.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Councilman Cashman.'",
        "'speaker_8': 'Thank you, Mr. President. I have no major problem with this resolution in and of itself. I have a similar concern with Councilman Espinosa that the oversight team be well formed. I'd love to see a direct council involvement in that.'",
        "'speaker_8': 'My problem is that it's my understanding that this bill, in part, involves projects that facilitate the future reconstruction of I-70 East. And I'm at a position where I'm not comfortable that the current proposals that CDOT is making for environmental mitigation for homeowners in the near reaches to I-70.'",
        "'speaker_8': 'I'm concerned as to whether they're sufficient or not. And until I can get comfortable with that, I'm going to be unable to vote for anything that moves in any part. The I-70 project along. Now I am in conversation with see that and it may be an understanding on my part of their position or it may be in'",
        "'speaker_8': 'substance. And I expect to know that in short order. But for a night out for tonight, I'll be unable to vote for this resolution.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Councilman Brooks?'",
        "'speaker_6': 'Yeah, thank you, Mr. President. I just wanted to call someone from the administration. Kelly, would you be the appropriate person to answer questions? And I wanted to give you the opportunity to talk about the lead on this on this deal with.'",
        "'speaker_6': 'Q with the question that councilman that's been asked.'",
        "'speaker_7': 'Sure. Thank you. My name is Kelly LEED, and I'm the executive director of the North Denver Cornerstone Collaborative, just as a base of context, you know. So we have six portfolios within the NDDC, one of which are Brighton Boulevard and a variety of projects in River North or better known as Rhino.'",
        "'speaker_7': 'And for each of those six portfolios, we we have a two overarching structure, one that we've worked on. So again, we've been at this since 2013. We have been what we call our steering committee, which is made up of all the key agencies that are working on these efforts.'",
        "'speaker_7': 'That group meets every three weeks, and that group deals with kind of strategic resource issues, policy issues, you know, the management of the six projects as a whole to make sure that those projects move forward and that we are coordinating across all the agencies and all the various interests, be them environmental, be them more construction related, be'",
        "'speaker_7': 'them financing related. So we've been at this now for a couple of years as we dial down to specific projects. So as an example, I'll use Brighton and that's a big enough project where we actually have a project lead out of public works.'",
        "'speaker_7': 'The contract specifically calls for a point of contact within public works to administer the contract, but we will continue to have a team that works again cross-functionally to make sure that the projects delivered on time and on budget and it's coordinated with all the other projects in the region.'",
        "'speaker_7': 'One of the benefits of this contract is that typically the city would issue multiple contracts to do work in this part of the city, and that in and of itself can be an administrative challenge. So in this case, we have one contractor that becomes our partner in a CMG, C, a construction management general contractor sort of relationship'",
        "'speaker_7': 'that works. And in collaboration with us, they act as an extension of the city to deliver what is a whole series of small projects in this area. So, you know, our intent and I'm happy to bring forward a specific org chart.'",
        "'speaker_7': 'You certainly started to see some of that during our budget hearing. Todd Winckowski, if you recall and I can resend this, started to walk through how this how the projects are organized and how we are coordinating those efforts.'",
        "'speaker_7': 'But I think on the point and this gets to Councilman Cashman's question is it's our full intent and we've been very transparent. I think another benefit of the way we're we're managing our budget as an example is normally agencies would make individual requests for all the different projects that they're responsible for within the DCC.'",
        "'speaker_7': 'In this case, the NBCC compiles all those schedule requests or our funding requests, and we make one request through the NBCC. Those dollars get pushed back out to the respective agencies to implement. But we, the NHBC, will do all the reporting so that you have one point of contact.'",
        "'speaker_7': 'The public has one point of contact. And we've been, again, really deliberative with both the agencies and in council. So it would be fully my intent as we actually get into implementing these projects, that we have an oversight structure that includes council and all the appropriate eyes, so that both the public and city council knows what we're'",
        "'speaker_7': 'doing, how we're doing it, and should an issue arise, how we're resolving it.'",
        "'speaker_6': 'Kelly, when when do we break ground on some of this kind of improvement for the Montclair Basin and Park Hill Basin, things like that.'",
        "'speaker_7': 'So the the the Early Action Drainage Project, which is the part that happens in the Coliseum parking lot that is tied back to our the idea was see that we have to have a functional system in place by December of 2017 or 20.'",
        "'speaker_7': 'So we have to break ground by 2017. So, you know, our intent is to break ground actually this next year in 16 after the stock show, because we have to have a functioning system in place by December 17.'",
        "'speaker_7': 'The other probably equally important is that we want to coordinate that work, that storm drainage work with what's going to happen in Brighton Boulevard itself. So, you know. Q It will help oversee as the CMG see that project and having the benefit of them both doing pre-construction services but also construction coordination will help make sure that all'",
        "'speaker_7': 'those different components get aligned as we start to get into Brighton. So our goal in Brighton as an example is that a design will be done before the end of this year and then there's an official handoff to curate to start the project of implementing that project.'",
        "'speaker_7': 'So our hope is that we're, you know, in the ground with, with Brighton early this next year and that's about an 18 month, 20 month project that will probably start with utility relocates first. So over the course of what would be 16 and 17 will be rebuilding Brighton and then coordinating the drainage with it.'",
        "'speaker_6': 'And we, we can expect that accountability, looking at change orders and things like that will be the oversight will be within DCC. Yeah.'",
        "'speaker_7': 'That is correct. I mean again, I think the beauty of having an entity like the NDC that is working with all the agencies, rolling up, reporting, rolling up how we manage schedule. And then when you have a really complicated project or a large project like I-70 or the National Western, you'll have an executive oversight committee or another'",
        "'speaker_7': 'structure in place that helps manage that project from the day it starts to the day it ends.'",
        "'speaker_6': 'Got it. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilman New.'",
        "'speaker_7': 'Thank you, Mr. Kelly. I share some, I guess, gasoline, cash funds, concerns about I-70. And just can you tell me what the relationship is of this project? Is it you're referring to the drainage project? Yes. So, you know, for a long time, this part of the city and when I say this part of the city, we're talking'",
        "'speaker_7': 'specifically about Globeville. Areas once here and parts of Park Hill have been susceptible to flooding when we have any amount of significant rain. And, you know, the way the city typically solves those drainage solutions is incrementally we based on money we have through our capital fund, or if we're lucky enough every ten years or so to do'",
        "'speaker_7': 'a bond project, we might make some larger improvements. And what one of the things that happened out of you know, out of the whole effort of creating the NBCs was how do you strategically align the planning and the implementation of these six projects?'",
        "'speaker_7': 'How do you leverage the opportunity that will accrue as a result of these projects? So, you know, obviously I-70 has a planning effort and we're coordinating that with CEDA, the Department of Transportation, which is leading that effort. We, the city, had an interest in figuring out how to solve no longer solved incremental solutions around drainage.'",
        "'speaker_7': 'But how do you really leverage the fact that you've got five other big projects happening in this region, in the city, and what could we do around drainage to solve that? So one of the things that has come out of this collaboration is an idea with CDOT to have these complementary solutions, one of which protects more of'",
        "'speaker_7': 'our neighborhoods by pushing a drainage solution we're interested in farther south of the highway, but at the same time acts as a redundant system to protect the highway structure that see that also has to protect. So this is a project of of complementary features and one that provides us an opportunity to solve a significant drainage solution while'",
        "'speaker_7': 'we're doing all this other work in this part of the city. You.'",
        "'speaker_1': 'Thank you, Councilman. New. No. Councilman Espinosa Okay. If I go to Councilwoman Ortega, she they to chime in.'",
        "'speaker_4': 'Councilwoman Ortega Thank you, Mr. President. Kelly Would you let us know what the thinking and timing is for the governance structure for the National Western Center? I know we're waiting to get past the November election, but what is the thinking of where we're going with the governance structure for that?'",
        "'speaker_7': 'So, you know, we're actually in the process of trying to get briefings scheduled with council around governance. And again, you know, governance isn't just starting. We've actually been overseeing this project now since the decision was made for the stock show to stay in Denver.'",
        "'speaker_7': 'Right now, we have an interim governance solution in place called an executive oversight committee that's made up of nine members, five of which are from the city. One of those city representatives includes Councilman Brooks, along with representatives from the Colorado State University and the Western Stock Association.'",
        "'speaker_7': 'So that Executive Oversight Committee has been meeting for now a couple of months. I think we've had four meetings. We're on our fifth. And the idea there is that we're advancing the master plan in these early phases. And then the ultimate is intent is based on some due diligence, is to look at the creation of a public'",
        "'speaker_7': 'authority. And our intent is to go through a process, you know, from the administration perspective of we're actually working on bringing outside counsel on to help us think about the legal components of how you build that authority. Again, looking at all the different authorities from around the country that are applicable.'",
        "'speaker_7': 'The reality is there's no one entity that exists today that actually meets the exact interests of this very unique place we're going to create. So Council will help us come up with some suggestions because you'll have multiple revenue streams, you'll have multiple tenants on the campus, lots of kind of complicated things that we have to work through'",
        "'speaker_7': 'and we want to make sure we do it right legally. So this in the interim, we have an executive oversight committee again that's helping us work through some of this early work. And then we'll ultimately bring forward the idea of a public authority at some future date.'",
        "'speaker_4': 'So other than the approval of that in any land acquisition, what are some of the additional approvals that this legislative body would be asked to be dealing with?'",
        "'speaker_7': 'So the first will be land. I mean, you know, the intent is to bring forward a land acquisition ordinance to council for the campus within the campus boundaries. The other will be, obviously, as we bring those individual parcels forward virtually via purchase and sale agreements.'",
        "'speaker_7': 'We will also, as you'll recall, with the previous council, we stood up the initial new zoning for the campus, the National Western Center Center, campus zoning. So as we bundle and acquire parcels, we'll come forward again to council to roll those new parcels into the new zoning because we can't fulfill the vision of the campus without the'",
        "'speaker_7': 'new zoning in place. And then there will be a variety of probably other things. Will there be environmental remediation or things that require because we'll be using city contracts to do all that work. So the extent we hit thresholds under our procurement rules, we would be bringing things before Council for their approval as they're required.'",
        "'speaker_7': 'There's a lot of work to do.'",
        "'speaker_4': 'Thank you, Kelly.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Espinosa, you're.'",
        "'speaker_6': 'Not just because you brought up the specific project of, I mean, I-70 drainage down Brighton Boulevard. One of my questions that I had early on in our discussions was and it couldn't be answered clearly at the time, and hopefully it can be now is we're building we're underneath Brighton Boulevard.'",
        "'speaker_6': 'We're going to be putting in 100 year drainage for I-70 while we're putting new roadway. Our new storm inlets going to tap into that or they're going to be separate.'",
        "'speaker_7': 'You know, I'm probably not the right one to answer that. I can because I'm not a drainage engineer. But what I can tell you is we are coordinating both the needs for Bryant Boulevard itself, which will have a drainage system along with running sea.'",
        "'speaker_7': 'That's pipe in a portion of Bryant Boulevard. But we can certainly have one of our drainage engineers get back to you with that solution. I'm not the right one to answer that question.'",
        "'speaker_6': 'Because I really looking at those sort of things as sort of opportunities to to provide sort of savings to the you know, to sort of improve the efficiency of what we're putting in. In your.'",
        "'speaker_7': 'Question.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_7': 'I can tell you that, again, one of the underlying objectives of the INDC and the four goals the mayor laid out is to strategically align the implementation and the planning of these projects, which includes how you leverage the investments that will accrue and how we leverage those investments to get things done and to the extent we can'",
        "'speaker_7': ', through coordinated efforts, create savings and buy more program for the benefit of a part of the city that seen no infrastructure investment for 30 years. We're absolutely going to do that.'",
        "'speaker_6': 'And so that's my goal. And that's why I'm so concerned, is I want to, with this matter what these millions of dollars I really want to capture as much program as we possibly can. And if we already have numbers that have generated this $140 million, we already have an estimate on what this initial project is going to'",
        "'speaker_6': 'cost, but yet we don't actually know what the scope is. And so that's sort of that's where my concern. Right.'",
        "'speaker_7': 'So the project councilman lays out a process by which projects actually come forward. We still if you read the contract, it lays out a process. Right. Which Q it as the see them as an extension of the city brings forward those projects are we can bring forward those projects.'",
        "'speaker_7': 'So as an example it contemplates a 100% design, right? And then we would bring forward 100% design for the scheme to kick in and start to do the work pre-construction services and then ultimately lead an effort to procure the development of that project.'",
        "'speaker_7': 'So there are a variety of flexible opportunities within this agreement for the city to engage. Q8 As our partner in the delivery of these projects and certainly focusing on maximizing the opportunity, both in terms of schedule and savings, are a key part of everything we're doing in this part of the city and certainly a part of this'",
        "'speaker_7': 'contract.'",
        "'speaker_6': 'But I don't want 100% design to be one. That's not a good solution. And so how what is the process to actually that's, you know, who's.'",
        "'speaker_7': 'Doing it now? That's a different question. Again.'",
        "'speaker_6': 'That's why I'm confused if we don't know it.'",
        "'speaker_7': 'Actually, this is you couldn't ask for a more or a better best practice in terms of, I think, the flexibility we've created within this contract to recognize that the world of construction is not so prescriptive. I mean, that's part of the challenge sometimes of contracts as we make them so perspective, prescriptive, you don't get the benefit of'",
        "'speaker_7': 'of opportunities that.'",
        "'speaker_6': 'I'm not asking you to do a prescriptive contract. I'm asking you to tell me what the process is to sort of vetting the solution.'",
        "'speaker_7': 'So that's that's what I'm trying to get to. And I think I'm trying to describe to all of council and the public who's watching this is that we've laid out an agreement with it that allows a lot of flexibility for us to drive best practice solutions, be them drainage, be them delivery of a road or other infrastructure'",
        "'speaker_7': ', and again, a region of the city that has a lot of challenges. So, you know, I've offered a variety of times to come visit with you, and I continue to make that offer to walk you through. I think the due diligence we've put in place to not just deal with this contract, but how we're managing the whole'",
        "'speaker_7': 'effort of these six portfolios for the benefit of the citizens in this part of the city.'",
        "'speaker_1': 'I think that we've kind of gone off the current resolution, but certainly good questions for a broader dialog. I know infrastructure and culture will be a great avenue to have that should Councilman Clark find time in the schedule and there's a council need for that, as well as just doing one on one on off lines as well'",
        "'speaker_1': '. But I'd certainly wanted to make sure we kind of came back to Resolution 720, not to say the questions are unimportant. Let's just make sure they're asked and answered in the correct forum. So anything on on this particular resolution any more, Councilman Espinosa?'",
        "'speaker_6': 'No, thank you.'",
        "'speaker_1': 'All right. Thank you. Thank you, Kelly, for that.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'We've got one more, I believe 692.'",
        "'speaker_2': 'This one's a vote.'",
        "'speaker_1': 'Oh, I apologize. I was calling for a rewrite. Yet there are no other comments or questions. 720. Thank you, Madam Secretary, for that correction. See? Nine. Madam Secretary, roll call Cashman. No.'",
        "'speaker_3': 'Can each.'",
        "'speaker_2': 'Lopez New Ortega I Assessment by Black Brooks I Clark I Espinosa.'",
        "'speaker_6': 'Pass.'",
        "'speaker_2': 'Flynn I. Gilmore, I. Espinosa.'",
        "'speaker_6': 'Abstain.'",
        "'speaker_2': 'Mr. President. High.'",
        "'speaker_1': 'Madam Secretary, please. First of all, you announced the results.'"
    ],
    "Ordinance to Allow Parking Protected Bicycle Lanes.": [
        "'speaker_2': 'For Lebanese, one nay, one abstention.'",
        "'speaker_1': 'The Lebanese one day, one abstention, 720 has been adopted. All right. Now we're on to the next one. 692 Councilman Flynn bills for introduction. What would you like for us to do with this? Thank you, Mr. President. Just had a comment.'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_6': 'Thank you. With regard to the buyback program.'",
        "'speaker_1': 'And the expansion and the addition of protected parking.'",
        "'speaker_6': 'Protected bike corridors, I'm very excited about this. And I want to ask that public works.'",
        "'speaker_1': 'As we move into this and as we expand them to take advantage of the opportunity to take measurements. Now.'",
        "'speaker_6': 'As far as vehicle traffic speeds and the impact on this expansion, on vehicle traffic speeds, because I believe that this can be one of our vehicles, if I can.'",
        "'speaker_1': 'Use a pun for a moment.'",
        "'speaker_6': 'For calming traffic in our not just in the central business district, but out in our neighborhoods as well. And as as the City.'",
        "'speaker_7': 'Council's.'",
        "'speaker_1': 'Newest.'",
        "'speaker_5': 'B cycle.'",
        "'speaker_6': 'Account holder, I would certainly appreciate that information.'",
        "'speaker_1': 'Thank you. That's all. Thank you, Councilman Flynn. All right. I believe that was it. So we are now ready for the block votes. All other bills for introduction are ordered published. Council Assessment. Will you please put the resolutions on the floor for adoption in the block?'",
        "'speaker_3': 'Certainly, Mr. President, I put the following resolutions of in a block for the option series of 15 resolutions 724 726 727 696 623 636, 46, 93, six, 94, six, 95, seven, 21 and 734.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. Seen no comments. Madam Secretary, Roll Call.'",
        "'speaker_2': 'Clerk I Espinosa Flynn i. Gilmore i.'",
        "'speaker_6': 'Cashman i.'",
        "'speaker_3': 'Coinage i.'",
        "'speaker_2': 'Lopez. New Ortega. Assessment by Brooks. Hi, Black. Hi. Mr. President, I.'",
        "'speaker_1': 'Madam Secretary, please. West Virginia announced the results.'",
        "'speaker_2': '3939.'",
        "'speaker_1': 'As resolutions have been adopted in the block. Councilwoman Sussman, would you please put the bills on final consideration on the floor for final passage in a block?'",
        "'speaker_3': 'Yes, Mr. President. I move that the following bills be placed upon final consideration. And do pet be and do pass in a block. Council all series of 15 council bills 668 673 674 675 684 671 686, 97 698 699 700 7017027037047057067077087097 ten 711 712 713 and 556.'",
        "'speaker_1': 'Thank you. One I also make sure we get it 668 as amended because we did them in that last week so got them all just want to know it. Six, six, eight as amended. It has been moved and seconded, seeing no comments.'",
        "'speaker_1': 'Madam Secretary, welcome.'",
        "'speaker_2': 'Brooks Clark. Hi, Espinosa. Hi, Flynn. Hi, Gilmore. Hi, Cashman. Kenny Lopez. Hi. New Ortega Sussman. Hi, Black. Hi, Mr. President. Hi.'",
        "'speaker_1': 'Madam Secretary, please close the voting out the results. 3939 The bills on final consideration have passed since there are no public hearings and if there are no objections from members of council, we will not take a recess. However, one German announcement Monday, November 2nd.'"
    ]
}