{
    "Proclamation for the Denver St. Patricks Day Parade Committee.": [
        "'speaker_0': 'Thank you, Councilwoman Gilmore and I have a quick announcement. Councilwoman Black's birthday was this past Friday, March 8th, and Councilman Brooke's birthday was yesterday, March 10th. So happy belated birthday to you both. See no other announcements. We are going to move on.'",
        "'speaker_0': 'There are no presentations and there are no communications. But we do have three proclamations this evening. One is going through on consent and the other two will be read out. So, Councilman Brooks, will you please read Proclamation 142?'",
        "'speaker_3': 'Mr. President, I am happy to read Proclamation 142. But first, before I read this, can we have a little. All right. Thank you. Thank you all. Thanks for playing. It's always feels like somebody should be marching in here.'",
        "'speaker_3': 'I want to play that. So I'm rereading Proclamation 142 congratulating Denver St Patrick's Day Parade Committee on this occasion, the 57th Annual Parade on March 16, 2019. Whereas Denver has the largest cultural parades in the United States and the largest Saint Patrick's Day parade this side of the Mississippi.'",
        "'speaker_3': 'And. WHEREAS, this year's theme, Share the Luck, honors the 57th annual of the parade. Whereas, Denver St Patrick's Day Parade exemplifies a peaceful celebration, along with a community of diverse citizens who gathered together with a glance of the Celtic past and look towards the future.'",
        "'speaker_3': 'Enjoying Irish culture fanfare. Pipe drum bands like we just heard Irish step dancing, honoring all the divisions of the military of the delight of 300,000 spectators. Last year we had 400,000 spectators and over 10,000 entries in the parade.'",
        "'speaker_3': 'We're asked congratulations and thanks to all our volunteers for Denver St Patrick's Day Parade Committee, including many who have passed on but are still remembered for their endless hours of never ending commitment, which makes this celebration possible. And we're, as we hope, the Colorado Sun, everybody hopes the Colorado Sun comes out on that Saturday and the mile'",
        "'speaker_3': 'high air lifts the spirits of all them all who march or attend the 57th Annual Parade on Saturday, March 16th, 2019. And we hope that the warm wind at our backs to celebrate the Irish culture in the great state of Colorado.'",
        "'speaker_3': 'Now, therefore, be it proclaimed by the Council, the city and county of Denver, Section one, that the Council hereby congratulate the Denver St Patrick's Day Parade Committee, a volunteer organization, a well-organized, peaceful, spirited gathering at the 57th Annual Event in Section two.'",
        "'speaker_3': 'The Clerk of the city and county of Denver shall attest in a to the seal of the city and county of Denver, and to proclaim to this proclamation that a copy be transmitted to the Denver St Patrick's Day Parade Committee.'",
        "'speaker_3': 'President Teresa muller Agnew.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Your motion to adopt.'",
        "'speaker_3': 'Yes I move the proclamation 140 to be adopted.'",
        "'speaker_0': 'It has been moved and seconded comments by members of Council Councilman Brooks yeah.'",
        "'speaker_3': 'So this is exciting to once again have the St Patrick's Day parade. This is, you know, in my district is one of the most important events that we have. And what I love about our district is that we get a chance to host all of these different type of parades, the the MLK parade, the LBGT parade that'",
        "'speaker_3': 'we have, and also this St Patrick's Day parade. And as I said before, over 400,000 folks came to this incredibly peaceful event last year and we had 10,000 entries. And I just hope that if you have kids, you come down and have a good time.'",
        "'speaker_3': 'I would invite you to ride a bike or walk or carpool on down because there's going to be a lot of people. But we want to make sure that this event is open for everyone, that it's inclusive of all of Denver and that you come down and have a great time.'",
        "'speaker_3': 'I also say I'll be I'll be marching in the parade as well. So the fine District nine will be represented. And we we ask that folks from all parts of Denver and even outside of Denver come and have a good time.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. President. I made note that during the medley that the the musicians played was the rising of the moon. My wife and I had the pleasure of spending a couple of weeks in Ireland last year, and we were in a pub down in Killarney in County, Kerry in the far southwest, in Free Ireland, and I'",
        "'speaker_7': 'requested the musicians to play the rising of the Moon and was told that under no circumstances would they perform that since 1998 and the Good Friday Accords that brought peace to the sectarian violence in Northern Ireland. So as a gesture in in the Republic, they no longer play that call to arms for the liberation of of Ireland'",
        "'speaker_7': '. I was always told that the Irish invented the bagpipes, Mr. President, and we gave them to the Scots as a joke, and they never caught on. So. But is that is that true? I got a club, got a thumbs up on that.'",
        "'speaker_7': 'So let me let me just leave you with this traditional Irish blessing. Bless your little Irish heart and every other Irish part. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn and Councilman Brooks, thank you so much for bringing this word. Certainly know how to make an entrance with your proclamations here. Madam Secretary, roll call. Oh.'",
        "'speaker_2': 'Brooks.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Black Eye Espinosa.'",
        "'speaker_10': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Gilmore, i. Herndon, I. Cashman.'",
        "'speaker_6': 'Hi.'",
        "'speaker_2': 'Lopez.'",
        "'speaker_1': 'I knew.'",
        "'speaker_6': 'I.'",
        "'speaker_2': 'Assessment. Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close voting. Announce the results.'",
        "'speaker_2': '11 Eyes.'",
        "'speaker_0': '11 Eyes. Proclamation 142 has been adopted. We do have 5 minutes for a proclamation acceptance. Councilman Brooks, go ahead and call up whoever you'd like and then we'll start the timer.'",
        "'speaker_3': 'Mr. President, I like the little timer thing. Let me just say this real quick. I want to tell everyone to add a little green. On council members. I don't want you be embarrassed and not having green on in front of an hour St Patrick's Day.'",
        "'speaker_3': 'But you have a little thing in your little, little lapel here. So we're going to bring up Theresa milano. I don't know if I said that room. So sorry. Okay. Okay. Who is just doing an incredible job organizing this event.'",
        "'speaker_3': 'And so thank you.'",
        "'speaker_1': 'Thank you, Councilman Brooks, Council President Clark and all the council members, thank you very much for your support of the Denver St Patrick's Day Parade and for your amazing work for the city of Denver. We have very special guests coming.'",
        "'speaker_1': 'Actually, the government of Ireland has selected Denver as the city of choice to celebrate St Patrick's Day. The Department of Foreign Affairs is sending four dignitaries that we will host. We will have a foreign minister, Mary Mitchell O'Connor, Adrian Farrell, counsel General Allen.'",
        "'speaker_1': 'Wallace Really? WALLACE Linda McQuade from the Department of Education and Skills. So we're thrilled that they will be joining us today in our council chambers. We have with us Queen Coleen, Brigid Sylvie. And we also have the very Irish, Mr. Shamrock CAIDEN Vaughan.'",
        "'speaker_1': 'I would like to recognize and thank Belco credit union. They have been our sponsor for 14 years. They presented the parade with such a love of the community of Denver and the opportunity to give back. Thank you. Belco Credit Union.'",
        "'speaker_1': 'Well, the very first Denver St Patrick's Day parade was organized by Mr. Jim Eakins, and he gathered floats and bands and clowns and pipe bands, and he wanted to have a local hero as a grand marshal. Well, this year is no different.'",
        "'speaker_1': 'Our local hero is Mr. James Arsenault, the CEO of the Seattle Fish Company. He has his benefactors and you can see his benefactor and all over the city. He gives back and his charity of choice is cooking matters.'",
        "'speaker_1': 'One in six children go to bed hungry in Colorado, and we are putting the pride of the Irish behind that. And we are going to gather and we are going to help and we have donation text to donate already set up.'",
        "'speaker_1': 'You can text cooking to 91999 and make a donation to cooking matters. Again, we want to say thank you for your support and we hope that you will join us on Saturday. We have a special ticket for you, for all of our councilmen to say thank you to join us in the Dublin house on Saturday.'",
        "'speaker_1': 'Thank you again for this proclamation. We appreciate you very much.'",
        "'speaker_0': 'Thank you. All right. Before we move on to our second proclamation, unfortunately, due to fire code, we can't have anyone standing in the back there. That back aisle is ingress and egress. So if everybody could scoot together and make room so that we can make room for all these folks, there's also overflow right next door.'"
    ],
    "Proclamation for the National Chicano Youth Liberation Conference and the West High Blowouts.": [
        "'speaker_0': 'And for 32, if you're here for one of the public hearings, that won't happen till after recess. And you can go watch on TV and 432 and come on back in when when that is there. Thank you very much.'",
        "'speaker_0': 'All right. That brings up our next proclamation. Councilman Lopez, will you please read Proclamation 233?'",
        "'speaker_5': 'Thank you, Mr. President. Proclamation 233 series of 2019 commemorating the 50th anniversary of the National Chicano Youth Liberation Conference in Denver and the West. High blow out. Whereas, led by two young Chicanos, Ginny Perez and Priscilla Martinez, students at West High School walked out of class on March 20th, 1969, in protest of discrimination and institutional racism by'",
        "'speaker_5': 'faculty and administrators. And. Whereas, the students, supported by their families, community members and the Crusade for Justice demonstrated and were met with police batons and tear gas canisters. And. WHEREAS, The Crusade for Justice, founded in 1965 and led by Rodolfo Corky Gonzalez, was a community based organization focused on providing employment, legal defense, education, civil rights, political action'",
        "'speaker_5': ', immigration, cultural and recreational services. And. WHEREAS, weeks later, the first National Chicano Youth Liberation Conference was held here in Denver on March 27th through the 30th, that the Crusade for Justice, where students and leaders from across the country gathered to create and plan a spiritual.'",
        "'speaker_5': 'Aslan and a plan to Santa Barbara, a Chicano plan for higher education, both of which gave rise to the Chicano movement here and throughout the country. And. Whereas, these events helped create a National Movimiento that inspired and gave rise to today's Mexican-American leaders in the arts, business, community, education, government, law, literature and medicine.'",
        "'speaker_5': 'And. Whereas, nearly one in three persons in Denver and one out of every four children in Colorado is a mexican of Mexican-American descent, still faces discrimination in the classroom, workplace and in public life, resulting in high poverty rates and growing disparities of access in education, health care, income, justice and political representation.'",
        "'speaker_5': 'And. WHEREAS, the week of March 19 through the 30th, 2019 will mark the 50th anniversary of the West High Blowouts and the National Chicano Youth Liberation Conference in Denver. Now, therefore, be it proclaimed by the Council of the City and County of Denver.'",
        "'speaker_5': 'Section one. At the Council of the City and County of Denver Honors Colorado, Colorado's Mexican roots Chicano history and recognizes the values and rich contributions to science, philosophy, arts and culture to the history of our state. Our city, our state, and our country.'",
        "'speaker_5': 'Section two that the Council of the City and County of Denver continue to promote equality and justice for all people and opposes discrimination in our city. Section three. At the clerk of the city and county of Denver shall attest and affixed the seal of the city of County of Denver to this proclamation, and that copies be transmitted'",
        "'speaker_5': 'to the Denver Agency for Human Rights. And Community Partnerships, the Denver logo for Corky Gonzalez Branch Library. Denver West High School. And the Colorado History Museum.'",
        "'speaker_0': 'Thank you. Councilman Lopez, your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. I move that proclamation to 33 series of 2019 be adopted.'",
        "'speaker_0': 'It has been moved and seconded. Comments by members of council. Councilman Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. It gives me quite a feeling of pride to say this in our in our council chambers. And I'm sorry. I don't know why I'm all emotional here, man. Uh huh. My voice cracks because you know how far it's taken us and how long it's getting it's gotten for us, and how long this path'",
        "'speaker_5': 'has been to come into these chambers with these words and in this with this proclamation. It means so much to me. And there's a lot of folks here in the chambers and in our community and folks who are at home and watching this because for so long.'",
        "'speaker_5': 'In a land that that that we hope the name. And found. And so the. The the. And for so long that we have not been welcome. And now, especially now in this era, it means it means so much to be able to read these words and talk about this proclamation, especially in this area.'",
        "'speaker_5': 'Right. There are two events and there are a lot of them. We have a lot of different things that have happened in our history that have helped steer the course of our history in Denver. But there are two young women, Priscilla Martinez and Jeannie Perez, who at West High School were ridiculed.'",
        "'speaker_5': 'Were all this her or her students? The rest of the students, the rest of the Chicano students at West High School ridiculed for speaking Spanish. They were told it was an inferior language. They mispronounce their names and when they corrected their names to the teacher in this one, Mr. Schafer.'",
        "'speaker_5': 'He would reiterate. And they would deal with this every single day in class. That's institutional racism. And. With the help of the folks in the community. Now with the crusade for justice and the different movements that were happening throughout our city.'",
        "'speaker_5': 'They walked out. You were trained through the Freedom School. They protested. Community met them outside. Welcome. Even in the face of batons and gas masks. And being chased down the street away from their school for peacefully demonstrating. I only learned about this.'",
        "'speaker_5': 'Sadly when I was already in college. Through an organization called Matcha, which I belong to the Chicano Student Movement. Up until then. I had the same kind of experience when I was in first grade. A lot of folks don't realize I had to go through first grade twice.'",
        "'speaker_5': 'My teacher would put me up in class after I would correct her about a Spanish word Konerko She would call it Conejo. And I said, Don't miss. I think this this name is I think the Rabbit's name in the Southwest.'",
        "'speaker_5': 'The book that you're reading to us is Conejo. And I was proud to actually know that she got me up in front of the class and told me, Mr. Lopez, only clowns speak Spanish. And you're not a clown, are you?'",
        "'speaker_5': 'In front of my whole class. That broke my spirit. I did not want to be Mexican. And it wasn't until I started learning about the Chicano movement and learning about who we were and the history in this state and the celebration of one's own culture.'",
        "'speaker_5': 'And it doesn't require the contempt of another. Right. So which is what Cesar Chavez would say, though? That walkout meant a lot and that walkout was a starting point. The National Chicano Youth Liberation Conference was also another starting point is when our community started becoming organized by students.'",
        "'speaker_5': 'The L.A. Line really the this the spiritual set of goals and cultural goals for us as a community to start feeling pride in a land that we we are usually not the the of Santa Barbara which talked about Chicanos and higher ed and how we got to go to college and graduate and not be the only ones'",
        "'speaker_5': '. And to this day, there are a lot of firsts in our community, and some of us aspire to be the first in a lot of different things. But what these documents with this proclamation really reiterates for us as a community.'",
        "'speaker_5': 'Is that while it's important to be the first sometimes. It's much more important never to be the last in. And that's what this is about. I know that there are so many distinguished guests here tonight in the council chambers.'",
        "'speaker_5': 'What I have here to my left is the original Chicano students demands at West High School that I was able to get a hold of through an FBI file that had been released and made public. The other thing that was very interesting to me is that right after the walkouts, I discovered, you know, somebody had alluded to'",
        "'speaker_5': 'a proclamation that the council took a proclamation. The council took a resolution at that time about the walkouts. And so I started looking and I asked the clerk in recorder's office, as I can, you find these documents and this is the beautiful thing about, about, about that office is that our history is written in our history, saved'",
        "'speaker_5': 'in that office. Right. This is a proclamation, a resolution in 12 of 1969, recognizing and commending the Denver police and the fire departments and members thereof. Whereas in the past week, civil disorders, disturbances and demons demonstrations have been occurring in the city and basically praising for using the tear gas and the baton and handling the use of'",
        "'speaker_5': 'force. My how times have changed because when there's a demonstration, when we had all these kids walk out recently, they did not respond that way. So I do this. I thank you, Mr. President. Thank you for the time.'",
        "'speaker_5': 'Colleagues. This was just this is a very excuse. My my my lengthy discussion here. But it's just it means so much to me in this council chambers and to us as a community to do this. And we'll bring some folks up in a second.'",
        "'speaker_5': 'But, uh, with that. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Councilman Brooks. Yeah.'",
        "'speaker_3': 'I just want to I want to say this because this is happening in our community right now and just stand in solidarity with my brother, Councilman Lopez. And and I say this is happened in our community is there is and has been black and brown violence.'",
        "'speaker_3': 'But the reality is we stand in solidarity as the as we used to always talk about this Councilman Lopez, the African Aztec Alliance, because we've gone through the same struggle as African-Americans in northeast Denver. And so I just want to say that I want to say that publicly and through issues that are happening in our community today'",
        "'speaker_3': ', we still and leaders should say this at every outset that we still stand in solidarity and we're we're bigger than the issues that are that we're facing today. So. Thank you, Councilman Lopez.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilman Lopez.'",
        "'speaker_5': 'Rebeca, I forgot to mention. So, Mr. President, we do have somebody in our in our chambers that may not be up here earlier. But I wanted to also recognize state representative said and Gonzalez Gutierrez said enough. You want a state representative you can stand up represent northwest and.'",
        "'speaker_5': 'I meant to thing you earlier, but she, in fact, is not just our wonderful state representative, my state representative, but also the granddaughter of Adolfo Corky Gonzalez.'",
        "'speaker_0': 'Thank you, Councilman Lopez, and welcome, Councilman Lopez, thank you for bringing this forward and thank you for sharing your story and your words. And I think with that, we're ready to take a vote on this. So, Madam Secretary, roll call.'",
        "'speaker_2': 'Lopez.'",
        "'speaker_5': 'Si, se puede. Hi.'",
        "'speaker_2': 'Black Eye Brooks. Hi, Espinosa. Flynn.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Gilmore, i.'",
        "'speaker_5': 'Herndon, I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'Hi, New.'",
        "'speaker_2': 'Testament. Hi, Mr. President.'",
        "'speaker_0': 'Right. Madam Secretary, please close the voting, announce the results.'",
        "'speaker_2': '11 Eyes.'",
        "'speaker_0': '11 eyes proclamation to 33 has been adopted. We do have 5 minutes allocated for proclamation acceptance. Councilman Lopez, who would you like to bring up?'",
        "'speaker_5': 'There are two individuals that I wanted to bring of three. I'm sorry. So first. The incomparable Jerry Garcia Gonzalez, the wife of Corky Gonzalez. Dr. Antonio Esquivel. And then in on Gonzalez Gutierrez, our state representative, the honorable.'",
        "'speaker_6': 'Good evening. I'm Dr. Antonio Scoville. I'm an emeritus professor and former member of the Board of Trustees of Metropolitan State University. I'm also the former chair of La Scala Theater, also the Crusade for Justice, Good of the Service by Gonzalez.'",
        "'speaker_6': 'I'm also a long time associate and friend of the Gonzalez family at the request of Jerry Gonzalez. I have been asked to say a few words and elected. Just make five real quick points. I want to talk about the crusade for justice.'",
        "'speaker_6': 'Second, I want to talk briefly about the West High School blowout. I want to talk about the first National Chicano Youth Conference. I want to talk about the influences of those three events. And then I want to talk about the event that you're honoring today, the 50 year tribute to the crusade for justice.'",
        "'speaker_6': 'You know, Chicano movement of the 1960s and eighties arose in an era when Mexican-Americans vowed to create a better world. They called themselves Chicanos and Chicanos. Terms that reflect the history of conquest and that deprive people of their Mexican and indigenous roots.'",
        "'speaker_6': 'And characterize Mexicans as inferior. My first topic, The Concern for Justice was founded in Denver in 1965. It was the most active, best known, most controversial of all Chicano organizations, and it garnered the most media attention. Its leader would also Coco Gonzalez was a boxer, poet, playwright, lecturer, politician, activist, community organizer and publisher.'",
        "'speaker_6': 'The Crusades, a militant activism, generated not only strong support, but strong opposition, especially from law enforcement. The Crusade for Justice is a full blown, comprehensive civil rights and human rights organization. It provided a full array of community services, community services and employment, legal defense, education.'",
        "'speaker_6': 'Civil rights, political action. Immigration and recreation. The Crusade for Justice Building on 1610 Downing had a bookstore, curio shop, a large lunch room, a boxing gym, a 500 seat auditorium, 24 classrooms, several offices, a lounge, an art studio and a print shop.'",
        "'speaker_6': 'It housed Bartlett, Chicano, the Athlon and the theater group, and throughout the Pachuco it housed as Collateral, which starred students from preschool to graduate to undergraduate school. It also housed the La Raza Junior Party. My second topic is the worst high school blowout of 1969 and 1969.'",
        "'speaker_6': 'A social studies teacher at West High School made anti-Mexican remarks in class and this incident that West High School walkout. The teacher reportedly said All Mexicans are stupid because their parents are stupid and their parents before them are stupid.'",
        "'speaker_6': 'And he said, if you eat Mexican food, you're going to look like a mexican. That's what caused the walkout. You know, this walkout, another walkouts by Chicano students. A number demanded curriculum reforms in schools, primarily the inclusion of history, culture and a key contribution of Chicanos.'",
        "'speaker_6': 'They also demand an end, mostly for the students who walked out. You know, I guess a lot of people like to a lot of people and it looked like us Mexicans because they eat a lot of Mexican food.'",
        "'speaker_3': 'That.'",
        "'speaker_6': 'You know, my third topic is the crusade for Justice is housing those three national Chicano youth conferences in 1969, 1970 and 1971, from their very first conference of one year honor. Today we and which were celebrated this Saturday, was held on March 27th through 30th of 1969, 50 years ago.'",
        "'speaker_6': 'Out of that came that plan the spiritual the Aslan which set the goals for the Chicano movement. Over 1500 participants participated in the conference. They came from all over the country. So that conference and the West High School walkout, as we call it, the West High School blow out, put the Chicano in Denver and a crusade for'",
        "'speaker_6': 'justice on the national map. This conference created a renaissance, a revival of Chicano literature, art, music, dance, poetry and theater. It inspired and motivated generation to write, to get themselves involved in improving the condition of us in this country.'",
        "'speaker_6': 'It inspired and inspired Chicano studies programs on college campuses and student groups. My first topic is this influence that these events had on our community. They inspired today's Chicano and Chicano writers, poets, artists, musicians, dancers, actors, politicians, lawyers and educators.'",
        "'speaker_6': 'Colorado influential leaders who were influenced by this by these events include Ken Salazar, the former secretary of interior. Federico Pena, the former mayor of Denver. And the lieutenant governor who's now the president of the community college system, Dr. Joe Garcia.'",
        "'speaker_6': 'The activists of the 1960s and seventies set the stage for the social justice activities of today. Corky Gonzalez influenced a generation of Chicanos and Chicanos to get involved politically, including today's young politicians like Lisa Calderon, who is running for mayor and Cristante Cristante that run the former speaker of the House who is now running for U.S. Congress'",
        "'speaker_6': '. So in spite of these events, Chicanos and Latinos of today, Latinos and Chicanos and Latinos of the day are addressing the issues of voter rights, access, criminal justice, economic development, housing, education, energy, environment, human and health services, immigration, and the LGBTQ issues not only with our community, but outside of our community.'",
        "'speaker_6': 'My fifth topic and I'll end here is that we'd like to invite you to help us celebrate the 50 year tribute to the Crusade for Justice being held this Saturday at 530 at South Rialto on seventh in Santa Fe.'",
        "'speaker_6': 'There will be food, more presentations and discussions on the topics that I've just barely touched on this this evening. So we hope to see you there.'",
        "'speaker_0': 'All right. Thank you very much. And thank you, Councilman Lopez, again, for bringing that forward this evening. That concludes our proclamations that are called out. We will have one more going through and consent. But that brings us to the bills for introduction.'"
    ],
    "Minimum Wage Protections for Workers Associated with City Contracts Ordinance.": [
        "'speaker_0': 'President. Thank you very much. I'm going to do a quick recap on the resolutions and items being called out under bills for introduction. No items have been called out, but under bills for final consideration. Councilman Cashman, you'd like to call 163.'",
        "'speaker_0': 'Under pending, no items have been called out. And so that is our only item. Madam Secretary, if you could put 160 up on the screen and Councilwoman Gilmore, if you could put 163 on the floor for a final passage.'",
        "'speaker_1': 'Happy to. Mr. President, I would like to place Council Bill 0163 on the floor for final passage.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. It has been moved and seconded comments by members of Council Councilman Cashman.'",
        "'speaker_9': 'Thank you, Mr. President. I very much appreciate your letting me shift gears and get this on the agenda. As I mentioned in my announcement and my reading the statement from Councilwoman Kennedy, this bill had had not been scheduled to be called out.'",
        "'speaker_9': 'But I'm sitting here on this dais looking out at a room filled with working men and women of Denver. I see the familiar T-shirts of Unite Here, the purple sweatshirts of SEIU 105 and who have made the fight for $15 an hour minimum wage, a rallying cry and a mission for a good number of years.'",
        "'speaker_9': 'And while my colleagues made wonderful comments last week that I don't need to repeat along with a councilman, can each his remarks in view of the hard work that these folks have put forth over the years and in light of the importance of this bill, which will change lives of Denver families, I thought they deserved to hear'",
        "'speaker_9': 'us place our vote and give them the opportunity to express whatever satisfaction they may have. So with that, that's my comment.'",
        "'speaker_0': 'Thank you, Councilman Cashman. So last week we sent this through on concert to send a statement. And today, though, we're going to give you an actual vote that's not in the Bloc so that there can be some celebrating, I think.'",
        "'speaker_0': 'Councilman Espinosa.'",
        "'speaker_3': 'I'm actually just chimed in so I could filibuster for a little bit, because if we're going to take a vote, this is one that Paul Lopez definitely needs to be on the dais for. Anthony, could you grab Paul and let him know that we're going to take a vote on the minimum wage?'",
        "'speaker_3': 'So I apologize to both my colleagues and everyone in the pews here, but I thank you all. If you've been paying attention, at least on my time on council, you know how important this issue is to Councilman Lopez.'",
        "'speaker_3': 'So thank you all for your deference in this matter. Anybody else want to chime in?'",
        "'speaker_0': 'I will admit, Councilman Espinosa, I expected you to be better at filibuster than that. But, yeah.'",
        "'speaker_6': 'I'll left back in the chamber as the councilman breaks.'",
        "'speaker_0': 'Anything you say before we vote.'",
        "'speaker_3': 'You know, all I have to say, if if that's filibustering from Espinosa, he can filibuster all day long on this dais. But I just I'll seriousness aside, I just want to say to those folks who who work so hard and bring this forward, there's a lot of things on the on the executive side and those of us'",
        "'speaker_3': 'who are on the legislative side. But but those of you in the pews got this done. And so I want to thank you for all your hard work. And if you're watching this today, this is a proud moment because it's government working for those folks who are pushing hard and calling us out.'",
        "'speaker_3': 'So I appreciate you guys work.'",
        "'speaker_0': 'Thank you, Councilman Brooks, Councilwoman Gilmore.'",
        "'speaker_1': 'Thank you, President Clark. I just want to say a huge thank you again. This is all of your work. It's your community organizing. It's you continuing to push this forward. And just had the opportunity to meet this morning with another group of SEIU folks to share concerns.'",
        "'speaker_1': 'And I know there's much more that we need to work on together, but tonight is a night for celebration. Congratulations again and looking forward to our work ahead. Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. Councilman Lopez.'",
        "'speaker_5': 'Yes. I'm so sorry. Oh, thank you for making sure I was a part.'",
        "'speaker_0': 'You missed one heck of a filibuster.'",
        "'speaker_5': 'Heck of a filibuster. I wanted to congratulate all of you who worked so hard organizing. Organizing each other, taking risks. I know what it's like. I know how organizing goes. I know how it works. And I know how hard it is to get something.'",
        "'speaker_5': 'Like, I mean, just to get a union contract as is is hard in and of itself, but to fight and for your workplace and for your colleagues. Right. But to fight for everybody is something that is next level.'",
        "'speaker_5': 'And you all have achieved next level. And you all have not just proved that the labor movement and that you and workers organize together. They don't just organize to support each other, but you organize and you change an entire city.'",
        "'speaker_5': 'And I think this is this is something that attest to this. So I just wanted to thank you for your work. I I'm absolutely ecstatically supportive of this as it moves forward. So.'",
        "'speaker_0': 'All right. Thank you, Councilman Lopez. We have everybody in the room. We've got this called out. Let's vote. Madam Secretary, roll call.'",
        "'speaker_6': 'Freshman High.'",
        "'speaker_2': 'Black Eye Brooks.'",
        "'speaker_3': 'Imam.'",
        "'speaker_2': 'Espinosa Flynn, i Gilmore I Herndon I Lopez t.'",
        "'speaker_5': 'Whether I.'",
        "'speaker_2': 'Knew.'",
        "'speaker_5': 'The.'",
        "'speaker_1': 'Assessment.'",
        "'speaker_2': 'I Mr. President.'",
        "'speaker_0': 'I Madam Secretary, please call the voting announced results.'",
        "'speaker_2': '1111.'",
        "'speaker_0': 'I is 163. Hey. All right. Thank you all for being here. And thank you, Councilman Cashman, for calling that out. That does conclude the items to be called out. All bills for introduction are ordered published and we are now ready for the black vote on resolutions, proclamations and bills on final consideration.'"
    ],
    "Rezoning of 805 West 38th Avenue in Globeville from Industrial to Urban Center Mixed-Use.": [
        "'speaker_0': 'Council is reconvening. We have two public hearings this evening. Speaker should begin the remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses. If you're here to answer questions only when your name is called, come to the podium.'",
        "'speaker_0': 'State your name and note that you are available for questions of council. Speakers will have 3 minutes and there is no yielding of time on the presentation monitor. On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members.'",
        "'speaker_0': 'Please refrain from profane or obscene speech structure comments the Council as a whole, and please refrain from individual or personal attacks. Council Gilmore Will you please put Council Bill 19 0042 on the floor?'",
        "'speaker_1': 'Yes, Mr. President. I move that council bill 19 dash 004 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for council will 19 0042 is open. May we have the staff report?'",
        "'speaker_6': 'Thank you, Mr. President. And Council Scott Robinson with Community Planning and Development. This is a request to rezone 805 West 38th Avenue from I.B. oh two to see Annex 22 property is located in Council District nine in the Globeville neighborhood in the 41st and Fox station area.'",
        "'speaker_6': 'It's just north of 38th Avenue, although it does not have direct access to 38th Avenue. It's about two and a half acres, and it's currently used as rental and storage of heavy equipment. As I said, the request is to go from I.B. to which is heavy industrial with the Billboard Use overlay to see an x 2002, which'",
        "'speaker_6': 'is urban center neighborhood context mixed use with a 20 storey maximum height and it would retain that billboard use overlay that you go to. The applicant is requesting the rezoning to position the property for redevelopment. The property is surrounded on two sides by the same Ibey you go to the south and the west to the north is'",
        "'speaker_6': 'see an x 20 of the same as being requested and to the east is seems 12. The current use on the property is industrial and the surrounding area has a mix of industrial, commercial, mixed use and residential. You can see the.'",
        "'speaker_6': 'Don't have it up on the screen. The this. Thanks. Thank you. So you can see the subject property in the bottom right photo there and then some of the other surrounding properties in the surrounding photos. This went to planning board on January 9th, 2019, received a recommendation of approval by an 8 to 1 vote.'",
        "'speaker_6': 'There was no public comment and meeting went to the Land Use Transportation and Infrastructure Committee on January 29th of this year, and there's been no other public comment on this application. In order to approve a rezoning, the city must find that these five criteria have been met.'",
        "'speaker_6': 'The first criterion is consistency with adopted plans. There are four adopted plans that apply to this property. First is Comprehensive Plan 2000. As described in the staff report, staff finds the proposed rezoning consistent with these six strategies from comprehensive thousand, mostly relating to infill development and mixed use development, especially near transit stations.'",
        "'speaker_6': 'The second plan is Blueprint Denver from 2000 to the concept land use for this property. In Blueprint, Denver's transit oriented development, which calls for a balanced mix of uses at mid to high densities. And it's in an area of change, which is an area where the city wants to direct additional growth.'",
        "'speaker_6': '38th Avenue is a mixed use arterial, which calls for higher intensity and mix of uses. Although, as I mentioned, the property does not have direct access to 30th Avenue. So even though there's no access there, access is provided by 39th Avenue, which is a non-designated local meant to connect the property to the larger streets, including Fox Street'",
        "'speaker_6': ', which is also a mixed use arterial which connects down to 38th Avenue, Park Avenue and IE 25, which is all consistent with the proposed Sea Annex 20 zoning. The third plan is the 41st and Fox stationary plan from 29.'",
        "'speaker_6': 'The land use designation in that plan for this property is mixed use office residential 3 to 20 storeys, which calls for housing and employment base a significant amount of development and pedestrian friendly development, all of which is consistent with the proposed C Annex 20 zoning.'",
        "'speaker_6': 'The fourth plan is the Globeville Neighborhood Plan from 2014. It mostly just reiterates the recommendations of the 41st and Fox stationary plan in this area, again calling for 20 storeys, a diverse, transit supportive neighborhood with a mix of jobs and residential.'",
        "'speaker_6': 'Consistent with the proposed SIMEX 20 zoning system finds, the first criterion is met. The second criterion is uniformity of district regulations. Steph finds the proposed rezoning would result in the uniform application of the C annexed 20 zone district.'",
        "'speaker_6': 'The third criterion is to further the public health, safety and general welfare of the city. Staff finds the proposed rezoning would do so by implementing the city's adopted plans and facilitating the redevelopment of the property in a pedestrian friendly and transit oriented manner appropriate for the area.'",
        "'speaker_6': 'The fourth criterion is justifying circumstances. Staff finds that the proposed rezoning is justified by change in changing conditions, including the Globeville Neighborhood Plan adopted in 2014 and the recent investments in the area. The construction of the 41st and Fox Station.'",
        "'speaker_6': 'Even though the G line is not operating yet, and there has been some new redevelopment, including just a block to the east along Foch Street, there's some new commercial development changing the area and making the proposed rezoning justified.'",
        "'speaker_6': 'The fifth criterion is consistency with neighborhood context, zoned district purpose and intent. Staff finds that the proposed rezoning would result in development consistent with the description of the urban center neighborhood context and the purpose and intent of the C Annex 20 zone district, which is intended to apply to areas or intersections served primarily by major arterial streets'",
        "'speaker_6': 'where buildings scale 3 to 20 storeys is desired. As pointed out in the plans, this area is intended for 3 to 20 storeys, and while it does not have direct access to a major arterial, it is one block away from Fox Street, which is a arterial and then a block south to 38th Avenue, Park Avenue and I-25'",
        "'speaker_6': ', which are major arterials. So staff finds the area served by those major arterials. And the fifth criterion that of that staff finds all five criteria are met and recommends approval. I'll be happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak on this item this evening. First up is Jean Schaefer.'",
        "'speaker_1': 'Go ahead. Good evening. My name is Jeannie Schaefer. I'm with Groundwork Entitlement Services. I am the owner's representative for this application, and I don't have a presentation prepared tonight, but I am here to answer any questions that you might have.'",
        "'speaker_0': 'Thank you very much. Next up, Chairman Sekou.'",
        "'speaker_1': 'Oh.'",
        "'speaker_7': 'My name is Chairman Suku.'",
        "'speaker_0': 'Founder, organizer of Black Star Action Movement for Self-defense.'",
        "'speaker_7': 'Also the next mayor city of Denver, 2019.'",
        "'speaker_11': 'On the surface.'",
        "'speaker_7': 'This zoning for this particular area, we've had several zoning this year appears to be a good thing. It's going to provide economic activity, is going to provide housing and is on an arterial where we're talking about density and 20 storeys going up.'",
        "'speaker_7': 'And yet as you peel the layers of the onion is crying time. Because now we've got to get to the nitty gritty of the details, like how many units are going to go to folks who can afford it.'",
        "'speaker_10': 'Not affordable.'",
        "'speaker_7': 'That who can actually pay.'",
        "'speaker_11': '30% or less.'",
        "'speaker_7': 'But their medium income for the state. Now, anybody who's paying more than 30% for housing. Is it an abomination? You can't get no mortgage loan on that. Unless you're making megabucks. So where is the 30% or less units in this thing for people who can afford it, whether they are low income or middle income?'",
        "'speaker_7': 'Where is that? And how many units.'",
        "'speaker_10': 'Is in that? Or is this another.'",
        "'speaker_7': 'Scheme to provide housing made and pushed by developers who are paying the political bills? Politicians. So I can't go for this. After coming down here for a decade or more and seeing more and more and more of this is the law.'",
        "'speaker_7': 'But so was slavery, the law. But we do obey that law today because it's the law, or you stand up.'",
        "'speaker_11': 'For what's right.'",
        "'speaker_7': 'It was human. And as you paint yourself in this corner. Martin Luther King once said, and I'll close with this. You showed me a man and woman who's not committed. To the advancement of human life other than themselves, they're not fit to live.'",
        "'speaker_7': '1957 City Park. On that statue, Montgomery Bus Boycott. That's the history. And that's the man who we celebrate every year. And we desecrate his legacy by not doing the right thing. As soon as the day is over. That's like going to church on Sunday and the busses starts.'",
        "'speaker_0': 'I'm sorry, but your time is up. Next up, Jesse Pierce.'",
        "'speaker_8': 'Jesse Pierce, who represented for Denver, home of Salo Black, starts a moment for self defense and positive commitment for social change. And I'm also an at large candidate for the 2019 May election. We are against this.'",
        "'speaker_11': 'As this is just business as usual. This neighborhood is already being ran to rapidly gentrified like all parts of the city, and there seems to be no stop, no end in sight. You guys keep. Passing these rezonings in a community is telling you they do not want these things.'",
        "'speaker_11': 'They're being forced to accept these things. I have several questions.'",
        "'speaker_8': 'I want to know exactly what is the RMR.'",
        "'speaker_11': 'Level.'",
        "'speaker_8': 'For this rezoning. I want to know exactly who is going to be occupying these spaces. And I want to know.'",
        "'speaker_11': 'How long it's going to take for this construction to happen. And also. Why? You just keep pushing through these rezonings with no care in sight. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there questions from members of Council on this item? All right. Seeing. No question. Oh, Councilman Lopez.'",
        "'speaker_5': 'Yeah, I have one question. Can I can have you come to the microphone really quick? I wanted to ask about the rail and how close this is to the Union Pacific rail yards.'",
        "'speaker_6': 'The rail track is directly to the east. So the property abuts the the rail. It's the RTD tracks first and then RTD tracks first. Thank you.'",
        "'speaker_5': 'Then I'm not Union Pacific. Sorry. BNSF. Are there any buffers? I mean, I know that this question always comes up, and especially when it comes to to emergency management. Whenever we have rail, anything like that, what are the are there any were there any kind of conversations in terms of protocol, noise, spill, things like that?'",
        "'speaker_5': 'What are some of the conditions that that have been satisfied this to continue?'",
        "'speaker_6': 'Yeah, not as part of the rezoning. Those items were all addressed as part of the site development plan. So when this property does come in for redevelopment, they will look at it and address all those concerns about its proximity to the rail.'",
        "'speaker_5': 'I appreciate that. And I know that my colleague, Councilman Ortega, would probably ask that question as well to I've been to the same kind of program to the emergency management. I think it's it's always important. I mean, whenever we have heavy rail with a lot I mean, literally all you got to do is sit there and just'",
        "'speaker_5': 'watch it go by. You put a time lapse camera, you see airplane fuselages, you see coal, you see liquid, you see so much coming through there with a lot of population as we're building up, I just hope that in the development plan we address that in as any kind of mitigation should something God forbid it doesn't happen'",
        "'speaker_5': 'so.'",
        "'speaker_0': 'Thank you. Thank you. Guzman-Lopez Councilman Flynn.'",
        "'speaker_7': 'Thanks, Mr. President. SCOTT This is the Wagner rents building. And I recall some discussion a few years ago not related to this rezoning, but in another context, something I was working on, in fact actually the Gold Line commuter rail that there might be that that building might be eligible for historic landmark designation.'",
        "'speaker_7': 'Was there? Maybe. I'm sorry, I forgot your name. The owner representative could speak to whether we you have applied for demolition or what the future of that building is.'",
        "'speaker_1': 'Ginny Schaefer We did apply for a certificate of non historic status and were granted that for all of the buildings on site. But currently we have no plans for demolition or re-use of those buildings.'",
        "'speaker_7': 'Okay. But you do have the certificate? Yes. Good. For five years. Correct. Okay. There was the property posted.'",
        "'speaker_1': 'Yes, it was.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_1': 'You're welcome.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'That's all I'm asking.'",
        "'speaker_0': 'Thank you, Councilman Flynn. See no other questions. The public hearing for Council Bill 19, just zero zero for two is closed. Are there any comments by members of council? All right. Seeing none. I just think staff for the comprehensive staff report, I think that this one clearly meets the criteria and we'll be supporting tonight.'",
        "'speaker_0': 'Madam Secretary, Roll Call.'",
        "'speaker_2': 'Black Eye. Brooks Espinosa. Hi, Flynn.'",
        "'speaker_7': 'Hi.'",
        "'speaker_2': 'Gilmore. I Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Cashmere.'",
        "'speaker_6': 'Hi.'",
        "'speaker_2': 'Lopez. All right, new. Assessment. Hi, Mr. President.'"
    ],
    "Zoning Change for the 3600 Block of Downing Street in Cole.": [
        "'speaker_0': 'Hi. Madam Secretary, please call the voting and announce the results. 11 nice Lebanese country on 19 20042 has passed. Councilman Lopez, will you please put Council Bill 19.0058 on the floor?'",
        "'speaker_5': 'Thank you. Mr. President, I move that council bill council vote 58 series of 2019 be placed upon final consideration, do pass.'",
        "'speaker_0': 'It has been moved and seconded before we go into the public hearing. Councilman Brooks.'",
        "'speaker_3': 'Yeah. Thank you. Mr. President, I want to notify the public that I will be abstaining for this vote. We have the opportunity, as city council members, to do a council initiated rezoning that's much different than a legislative rezoning, where there's multiple properties on council initiated rezonings.'",
        "'speaker_3': 'We've been advised from our legal counsel to abstain. Full disclosure, I live in this neighborhood. I have been a part of this area for over 20 years, and we've been advocating for community serving businesses like grocery stores, affordable grocery stores and things like that.'",
        "'speaker_3': 'And so I've gone. Councilman Espinosa initiated an ordinance where we send it to to send notifications to residents that live within 200 feet of this location. I've gone door to door and talk to residents about this rezoning. I've done personal meetings with residents.'",
        "'speaker_3': 'I've attended community meetings around this. And so I wanted to let my colleagues know that I'm available for questions, but I will not be voting on it. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Brooks. And with that, the public hearing for council will 19 005 is open. May we have the staff report?'",
        "'speaker_13': 'Thank you. Jeff Hurt with media planning and development. So this is the rezoning request for all of one block and a portion of another block. And it's there's a lot going on in the site. So bear with me as a as I go through it, I'll try to be as concise as possible.'",
        "'speaker_13': 'So the site is in Council District nine. In the cold neighborhood. And so the request area is about 2.6 acres. And the purpose is to accommodate redevelopment of a mixed use project in a transit oriented development area. And the applicant, as Councilman Brooks said, is Councilman Brooks.'",
        "'speaker_13': 'And so the request is, I think, best shown visually, even though it's still complicated in this map. But essentially, the request is to rezone. Now, I try to get my laser pointer here. And it doesn't work. Oh, it does.'",
        "'speaker_13': 'So the request is you look at the the the yellow the orange font here, that's the existing zoning. So the request is to go from before with waivers. You are one and you oh two and I'll explain what that means.'",
        "'speaker_13': 'And that's for this portion of the site. And so the existing zoning is you assume a one for this portion of the site. And then south of 36th Avenue is Cemex three. You are one, you have two. And the request is to go to see a five year 102i01 deal seven I'll explain all that means that's for'",
        "'speaker_13': 'the western half of this block and then the same sort of overlay districts and design incentive overlay district with CMC's three on the eastern half of this block. And I'll explain the funkiness here in terms of billboard overlays, I don't use overlays, but the request south of 36th Avenue would be to go to CMC five.'",
        "'speaker_13': 'So, so Urban Center, Main Street, five stories. And so the existing context is varied, but looking really in all directions. But to the east and the south you have mostly nonresidential zoning with a variety of building heights allowed.'",
        "'speaker_13': 'Along Downing Street, you see mostly five stories on the east side of Downing where the subject site is, and then west of Downing and transitions to higher, higher heights, in some cases up to eight storeys. And they're looking straight east and south of the site.'",
        "'speaker_13': 'It does transition to US-EU, A-1. So that's a single unit zone district and there's overlays all over the place here. And we'll talk a little bit about those. So the existing zoning is.'",
        "'speaker_3': 'Before.'",
        "'speaker_13': 'With waivers and conditions, and that's for most of the 3600 block that has the zoning. And that's an old former Chapter 59 zone district that is a business mixed use zone district, the maximum building height. So the maximum building height in the area currently with the zoning is actually regulated by a floor area ratio of 2 to'",
        "'speaker_13': '1. And so that's an important point to note that they could conceivably get actually more than five storeys under the current zoning without building height allowance. The waivers and conditions that's the the custom zoning component of the zone district for the B4 area does have some land use restriction, so certainly and uses are prohibited.'",
        "'speaker_13': 'This includes liquor stores, gun shops, tattoo shop, some light industrial uses are prohibited and of note as well in the waivers and conditions, there are affordable housing requirements built into the waiver, both for rent and for sale, and that does require an affordable housing plan for any residential development.'",
        "'speaker_13': 'So commercial development, we don't have to meet any of these standards. And this is something that was common before the city adopted the the inclusionary housing ordinance in 2002. And then largely that was supplanted by a citywide policy with the 2016 Affordable Housing Fund.'",
        "'speaker_13': 'You'll see in a minute here there's an even greater layer of affordable housing regulation on the site through the incentive overlay. So while that provision was in place and staffs from south perspective, it's largely been replaced through multiple iterations of both citywide and localized affordable housing policy.'",
        "'speaker_13': 'And there's a formal housing component of the developer's proposal I know, on the site. So the existing zoning so that's but that was before waivers and conditions so the portions that have usou a one year you a one and so that is this area, the southeast corner of the site.'",
        "'speaker_13': 'And I'll talk a little bit about what that area is, but it's essentially remnant C dot right away that's serving currently as a median with green space. That's USDA one. That's a single unit zoned district that does allow for accessory dwelling units, the U.'",
        "'speaker_13': 'Oh one zone district. And so that includes all of this area to the west of the Lawrence House, Laurent Street, as it traverses the site, as the adult use overlay zone district you go to has the same boundaries.'",
        "'speaker_13': 'That's the Billboard Use Overlay district and there are three existing billboards on the site. The applicant is looking to carry forward all of those designations, I would say primarily due to legal reasons, but happy to talk about that as well.'",
        "'speaker_13': 'So existing zoning. This is the area south of 36. This is the Cmax three. We already talked about where you are one and you have two mean C-Max three is commercial as a mixed use on district allows up to three stories and 45 feet in height.'",
        "'speaker_13': 'There are build to and transparency requirements for primary streets for those in district. Okay. So a couple of slides here on what's happening with Lawrence Street as it traverses the site. This is important context. So this map on the screen is an image from the 30th and flake stationary plan.'",
        "'speaker_13': 'So that's from 2000 sorry, 2016, I believe. And so the recommendation out of that plan was to actually eliminate Lawrence Street as it traverses the site. So if you look at the map, the red dotted area is Lawrence Street and that was explicitly recommended to vacate or eliminate that area and essentially square off these two blocks.'",
        "'speaker_13': 'And that's kind of where the applicant in development or the developer team is headed toward. So a little bit of the history in terms of how we got to that point. So the plan recommended the vacation of the Lawrence swoop, as we call it, but some of the history is that actually originally it was out right of'",
        "'speaker_13': 'and an old state highway and that was put up for sale or put on the market for purchase. And the development team has purchased that right of way. And so that includes Lawrence Street as it traverses the site and it includes the adjacent median areas that are part of the of the right of way that currently serve'",
        "'speaker_13': 'as greenspace. And so this is a bit unusual in that the development team is actually that's part of the rezoning is actually working with the city to fund and implement these changes as opposed to waiting on the city to do it, to implement the plan.'",
        "'speaker_13': 'And I will say just last slide on this, that, you know, we see a lot of recommendations like this in plans that need to be further vetted and studied. This is one in particular where public works looked at Lawrence Street as it traverses the site and concluded from a technical traffic sort of functionality standpoint that it would'",
        "'speaker_13': 'be beneficial to the overall system to eliminate Lawrence Street as it traverses the site and again, square off these blocks and set those new boundaries, reflect those on district request. So the existing context in terms of land use is varied.'",
        "'speaker_13': 'You see mostly nonresidential along the Downing Street corridor and then transitioning east to more residential. This is an image we've already seen, but just highlighting the proximity to the commuter rail station that is about two blocks to the subject's site.'",
        "'speaker_13': 'So a very walkable distance wise from the subject's site. And so images are the subject property. This is from Downing Street, looking east at some of the existing buildings. Downing Street is an old streetcar corridor. So this is also the subject property.'",
        "'speaker_13': 'A Most of the structures on the site are late 1800s, early 1900s. This is the late 1800s single family structure on some kind of the northeast portion of the site. And so this is looking at one of those median slash greenspace areas, one of two that are part of the subject zoning request subject site.'",
        "'speaker_13': 'And this is the other one. So this is looking North Downing Street on the left hand side of the screen and one of those median greenspace areas. And again, looking at the subject site, you see just some of the existing buildings in use as a wide range.'",
        "'speaker_13': 'Several buildings have been demolished, but some of it is vacant as well. So this is looking at surrounding properties. This is looking west across downing, west, northwest and sort of the or industrial nature of the area. Looking toward the rail tracks and this is looking northwest from the subject site across Downing Street.'",
        "'speaker_13': 'Again, you see just kind of a mix of land uses and a very much a transitional area. And so this is looking south. So this is the start, I believe, of the Lawrence swoop. But you can see an existing gas station and some commercial along Downing here as well.'",
        "'speaker_13': 'And so this is looking east across Marion Street. And also a mix of uses, even though it's zoned single unit residential. There is an existing church here. And then on this corner, the southeast corner of 36. And Marion is actually some office uses, some nonresidential uses as well.'",
        "'speaker_13': 'And this is looking north of the subject property, looking at some more commercial uses, long downing and looking north as well. East side of the block. You see, it's certainly transitional in this area. Okay. So on to the requested zone districts and a little bit about what that means.'",
        "'speaker_13': 'So C-Max five and three, the three and five denotes the number of stories allowed. So again, the requests will be to go to CMC's five on the western half of this block, C-Max three on the eastern half of this block, with all the overlays that does allow 45 feet and 70 feet in height, three and five stories'",
        "'speaker_13': 'accordingly. And the build two requirements are they're essentially stating that 70% of the buildings must be pushed to the street. So pushed along Downing within zero and 15 feet. There are transparency requirements for streets, meaning some visual interest along the street level.'",
        "'speaker_13': 'And there are also street level active use requirements. So see and S5. So that was CMC's mixed use and that's the area north of 36 area south of 36 is proposed to be CMC five, so it's Main Street five and that's essentially to match the existing CMS five that this would line up with if re zoned.'",
        "'speaker_13': 'And CMS is very similar to C index in terms of land uses, but it does carry with it a higher built to requirement and higher levels of transparency, more of that Main Street feel. So the Iowans own district districts.'",
        "'speaker_13': 'This is part of the rezoning request for areas north of 36 on the subject say. So this is the 38th and Blake incentive overlay. And so this is essentially a requirement for affordable housing and other community benefits if development exceeds a base height.'",
        "'speaker_13': 'So you'll see on this map, I know it's kind of hard to see north of 36, the site is included in that overlay and this is in the code and does establish a maximum height of five stories. And I'll hone in on the specific height guidance.'",
        "'speaker_13': 'And what that means for this site. But they are asking again for C-Max, five on the eastern western half, six three in the eastern half. Oh, and I should also mention that this in a subsequent slide, there are there is a requirement in the code that you can't ever exceed three stories along Merrion Street.'",
        "'speaker_13': 'So there's a built in transition along Mary Ann Street of 35 feet from that street where you can never go above three stories. But I'll hit that in a subsequent slide. Okay. So the d07. And so this would also apply to properties north of 36.'",
        "'speaker_13': 'That's the river north design overlay. And so the incentive overlay and the design overlay are intended to work in tandem with each other in terms of the boundaries and the applicability of them. But essentially what this overlay does is provide enhanced design, mandated enhanced design above and beyond CMCs and CMS.'",
        "'speaker_13': 'So there's things like a minimum first floor height to kind of promote adaptability of buildings over time and of higher transparency requirements and other standards relating to parking lot, location setbacks, maximum residential things like that. So you see a higher level of design when you bring sites under the deal of seven.'",
        "'speaker_13': 'So this is the process to date. Follow the normal rezoning process leading to tonight. I will note that Planning Board recommended approval of the rezoning unanimously on January 9th. So the public outreach has been extensive and there's numerous registered neighborhood organizations.'",
        "'speaker_13': 'And so there has been letters of support from three registered neighborhood organizations, from Cole, Curtis Park and the Reno Arts District for the rezoning. Additionally, there's a total of 130 Non-nano comments with 120 128 of those supporting the rezoning.'",
        "'speaker_13': 'And there's also two comments within that, representing four properties in the area that support the rezoning, but only for the existing commercially zoned areas and in opposition to rezoning the median greenspace areas. These are the criteria that staff use to evaluate rezonings or go through them.'",
        "'speaker_13': 'So there's a number of plans applicable here. You have the citywide plans and 30th and Blake is really what provides the most specific neighborhood planning guidance. So I'll go through each one of these. So in terms of what the comprehensive plan says.'",
        "'speaker_13': 'Staff cited a number of comprehensive plan policies that support the rezoning, mostly related to conserving land by promoting infill development at sites where services and infrastructure already exist. This being in a transit oriented development area and well connected to the city's mobility network.'",
        "'speaker_13': 'That is the case in a number of other policies to support redevelopment and transit oriented development sites. So staff does find the request consistent with the Conference of Plan 2000, which I know is about to change, but that's what's on the books today.'",
        "'speaker_13': 'So in terms of Blueprint Denver, the site is in an area of change. And so those are areas that the city believes that new growth can best be accommodated, areas new transit. This certainly is the case. And in terms of the future land use concept, it is shown as transit oriented development, just being two blocks from the'",
        "'speaker_13': 'light rail, from the commuter rail station, that is certainly the case. So staff does find it consistent with these designations. And overall, does staff does find the request consistent blueprint in Denver, mostly because of the location of the site being in a transit orient development area.'",
        "'speaker_13': 'Also that the rezoning would eliminate a former Chapter 59 custom zoned district, which is also related to blueprint policies. Okay, so 38 and Blake Plan was originally actually adopted in 2009. In 2016, the 30th and Blake Station area height amendments were adopted.'",
        "'speaker_13': 'This is the most focused, neighborhood specific plan guidance. So we'll focus on this the most. So the subject site in terms of the future land use concepts, this is future land use concept has it split between mixed company street and urban residential.'",
        "'speaker_13': 'And so both of which support the idea of a mix of land uses and to activate the public realm. And then in terms of the stationary height amendments, this is really specific height guidance for the subject site and surrounding sites.'",
        "'speaker_13': 'And I'll explain this really quickly. But and this this explicitly in that document does supersede all height guidance and other plans. So this is really the rule that is on the books for the site. So and it does only apply to portions of the site north of 36th, south of 36 is not mapped.'",
        "'speaker_13': 'But essentially what this map says is that what the numbers say is the maximum base height that would be supported by the plan. So again, that is what is being matched by the applicant's request. CMA x three cm x five.'",
        "'speaker_13': 'The green is the maximum incentive heights. That's the maximum height you could go if you provide affordable housing or other community benefits. And so that's only actually applicable to areas on the eastern half of the subject block because they've already with five storeys, there's no incentive height on the western half of the block.'",
        "'speaker_13': 'So you would be able to go from 3 to 5 if you meet the affordable housing requirements. This blue strip on the map is indicating what I mentioned before, which is the transition that's required, where you can never go above three stories within 35 feet of Marion Street and intended to transition to the to the surrounding neighborhood'",
        "'speaker_13': '. So staff does find the request consistent with things like stationery plan and Hyde Amendment policies for a variety of reasons. One that the based on District Heights precisely match those in the Hyde amendments, but also that CMCs and CNS both allow a mix of land uses, which is supported by both the transitory development, mixed use and urban'",
        "'speaker_13': 'residential future land use designations. And then moreover, by bringing in the design overlay idea of seven, that will require enhanced design mostly, you know, related to the public realm and the sites interface with the commuter rail station. And the rezoning would also support redevelopment along Downing Street, which is identified as a main street to support investment in'",
        "'speaker_13': 'the 30th and Blake plan. So I won't go into the other plans in much detail because three of them. Blake And sort of supersedes those. But the Elyria, Swansea Neighborhood Plan and the Northeast Downtowns Plan also apply to this site.'",
        "'speaker_13': 'So kind of grouped them together for this presentation at least. And so both plans in terms of plan consistency. Santos find the rezoning request consistent with both plans in terms of policies related to supporting development in transit aurion development areas and infill in these areas.'",
        "'speaker_13': 'And the building height recommendations are kind of moot in these documents because they're replaced by 38 and Blake. So again, the rezoning request is consistent with these plans because the requested zoning does allow a mix of land uses supported by both of these plans and the future land use concept and both of those plans for the subject'",
        "'speaker_13': 'site. And all of these layers combined support many plan recommendations related to promoting development in this area, being close to the commuter rail station. So the second criteria uniform, your district regulation staff does find the request consistent with that criteria.'",
        "'speaker_13': 'Happy to talk about that. Staff does find the request consistent with the third criteria, which is to further public health, safety and welfare, primarily through implementing adopted plans that we just went through related to land use design and building height from a variety of plans really that support redevelopment on the site.'",
        "'speaker_13': 'In terms of justifying circumstances. And this is basically saying that the rezoning is justified because of changed or changing conditions in the area. There's multiple things that staff cites in the staff report. One being that there's been multiple adopted plans since 2010, which is the site's original zoning and then certainly the 30th and Blake commuter rail station'",
        "'speaker_13': 'openings or changed conditions that support a rezoning from spouse staff's perspective. Last criteria consistency with the description of the neighborhood context and the zone district being proposed. Staff does find the request consistent with that criteria because it promotes mixed use development, where an adopted plan supports transit oriented development with excellent multimodal access.'",
        "'speaker_13': 'And then when you bring in the Doe seven in the Il1 zone districts, those are explicitly mapped to the site. So it's consistent with that in that sense. So that concludes my presentation. Happy answer questions. We also have some other staff, city staff here as well, depending on the questioners.'",
        "'speaker_0': 'Thank you very much. It looks like we have 16 individuals signed up to speak this evening. So in order for us to get through this in a timely manner, I'm going to call the first five up at five at a time, up to the front bench.'",
        "'speaker_0': 'And then when I call your name, please step right up to the podium as your time will start. So the first five Keith Pryor, chairman, say COO Ty Baldock, Jessie Parris and John Young. Keith Pryor, you are first up.'",
        "'speaker_5': 'Hi, my name is Keith Pryor. I am at 2418 Champ Street, but I have a property that's at 3361 Lawrence, which is just literally two blocks away from this project. I'm in huge support of, as Andrew has done a great job.'",
        "'speaker_5': 'This is clearly stated in the Northeast Area plan of what was to be done with this property. The reconfigurations that the streets and putting the grid back is crucial to implementing the plan and executing that. And we worked very hard on getting that plan done and adopted and then just that, you know, having the retail, having a'",
        "'speaker_5': 'mixed use, having the affordability, this checks every box that you want to be as a part of your community. It's walkable, it has bike, it's bikeable. We're working on putting the bike lanes back on Marion and making that a community neighborhood street from what it is today.'",
        "'speaker_5': 'It's one of the most dangerous in the city with that curve and we're putting back in the tree line. So that one spot you're having that is going away as a median, we're actually adding significantly more trees, we're adding significantly more open space and greenspace.'",
        "'speaker_5': 'And also the developer is working. I am the chair of the Curtis Park Design Design Committee and they're working with us on making sure that it's going to have a really nice design, have some really interesting kind of like a signature element where it comes in there at Larimer Street and 36th Street so that you can see'",
        "'speaker_5': 'it from the station and really draw you in to that project. So, you know, I'm in huge support. I think that this rezoning is appropriate. It actually does everything that it needs. The current zoning, they could do a lot more.'",
        "'speaker_5': 'And so I think that they've really worked well with the community at Curtis Park and the other neighbors call and also Whittier and you should support this. It's just really well thought out and executed. So I hope you do support this tonight.'",
        "'speaker_5': 'Thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_7': 'Chairman Seiko.'",
        "'speaker_10': 'Founder, Chairman Blackstar. It's a movement of self-defense advocates for poor.'",
        "'speaker_7': 'Working, poor homeless students. Elderly folks. The voiceless. The want to have no power. Especially sitting in this body here, you have no poor people representing nothing up there. And I am going to be the next mayor. The first poor person who is currently at the poverty level that's going to be elected.'",
        "'speaker_7': 'And that doesn't exist nowhere in this country.'",
        "'speaker_10': 'For 400.'",
        "'speaker_7': 'Years. This. Project. On every level. Does not qualify to be approved. Council has got to see the results of their work when they do these zoning changes. As soon as you approve zoning building starts happening. But you go around those sites and you'll find not one black person working on the site.'",
        "'speaker_7': 'Brown and white? No black. That is against federal law to systematically exclude a group because of race. And when you look at the developers who do this, they have no diversity inside their organization. It's all quite box. So then who is this for?'",
        "'speaker_7': 'Who is it for? The resegregation of our neighborhood. Where they come inside our neighborhood. And they get the political support and they get the zoning changes. And now it's only popcorn because now we are not. Being considered at all.'",
        "'speaker_7': 'And then in those rooms, we have a few folks.'",
        "'speaker_11': 'Like flowers and.'",
        "'speaker_7': 'Buttermilk. Who feel intimidated. By the majority of the people there because they see their voice and their vote don't mean squat. Because it's already decided. So therefore, we're just. Window covering like a mannequin in a department store and the window with nobody in there working.'",
        "'speaker_7': 'But the mannequin is.'",
        "'speaker_0': 'I'm sorry, but your time is up. Next up, tie builder.'",
        "'speaker_1': 'Good evening. Take this down here. Good evening, council members. My name is Taobao Waldock, and I've worked in rhinos since 1999, and I've lived in Whittier since 2008. Large construction crews have become the norm in our ever evolving corner of the city.'",
        "'speaker_1': 'I personally welcome the change as well, as well as recognize the growing pains associated with this progress. We have an opportunity to address an imperative need brought about by this growth. I support and welcome the addition of a healthy, affordable and convenient grocery option to our backyard.'",
        "'speaker_1': 'As a kid growing up in Ohio, I remember bagging groceries at Lee Williams meets. This experience taught me the value of hard work. The satisfaction of making my own money. And the responsibility of contributing to an organization whose sum is greater than its parts.'",
        "'speaker_1': 'All things that I still hold sacred in my family business today. I believe this new grocer will allow our community to pass along the same work ethic to our youth, who are our next generation of community leaders and entrepreneurs.'",
        "'speaker_1': 'Our current grocery options include Downing Super, a place that has limited, unfortunately oftentimes expired inventory or masks, a locally owned option that has superior meats but isn't always accessible for many middle class Tamil families. And finally, my go to Safeway on 20th Avenue.'",
        "'speaker_1': 'Recently, though, the Safeway was remodeled and a large portion of its floor plan was given to Starbucks. Now, don't get me wrong, I have to have my morning coffee too, because I can't function without it. But this remodel has resulted in a smaller produce section and an entire aisle devoted to sugary soft drinks.'",
        "'speaker_1': 'It's no wonder that lower income neighborhoods are at a higher risk for diseases such as obesity and diabetes. This new grocery will bring us an improved option that other neighborhoods in the city have benefited from for years, such as the salad bar, a homeopathic supplement section, and a cheaper bulk grain option.'",
        "'speaker_1': 'Our neighborhood deserves this just as much as the residents of Cherry Creek, who benefit daily from the beautiful Whole Foods on First Avenue. In addition, there are limited, healthy, affordable, grab and go options for lunch in the working district of Reno.'",
        "'speaker_1': 'My coworkers would relish the opportunity to jump on a scooter and go to the new grocer for lunch. My business Erica Motorsports is surrounded by hundreds of new residents from the new Madeira Project on Blake to the Hartley Flat Building on Walnut, with other residential projects breaking ground daily.'",
        "'speaker_1': 'These new residents have already been given grocery options to include the new new King Soopers and Whole Foods near Union Station. Yet our neighborhood, which have been the backbone of downtown Denver for years, are still left.'",
        "'speaker_0': 'I'm sorry, but your time is up. Okay. Thank you very much. And I apologize for mispronouncing your name. Next up, Jesse Pierce.'",
        "'speaker_5': 'Jesse Pierce.'",
        "'speaker_8': 'Represented for Denver Home, a sellout Black Star action moment for self-defense and Positive Action Commitment for social change. And I'm also an at large candidate for May 2019 election. We are against.'",
        "'speaker_11': 'This.'",
        "'speaker_8': 'I attended numerous of these meetings with the community.'",
        "'speaker_11': 'The community voiced their concerns. Their concerns were parking traffic.'",
        "'speaker_8': 'The fact that I-70 is going to be shut down and there's nowhere for this traffic to go except to their neighborhoods. You want to change a one.'",
        "'speaker_11': 'Way street into a two way street? All of this.'",
        "'speaker_8': 'Change is happening while our neighborhoods are being gentrified.'",
        "'speaker_11': 'Where we are being rapidly displaced.'",
        "'speaker_8': 'From these neighborhoods.'",
        "'speaker_11': 'I grew up in the whole neighborhood.'",
        "'speaker_8': 'I've been here longer than congress out.'",
        "'speaker_0': 'Councilman Alvin Beasley for your comments to the body.'",
        "'speaker_11': 'I. Am against this.'",
        "'speaker_8': 'You need to vote no.'",
        "'speaker_11': 'On this seriously. And you really take into consideration what the community wants, not what these transplants want. And these people have just been here 5 minutes ago. We need to listen to the concerns of the people that have.'",
        "'speaker_5': 'Been here for 20, 30, 40, 50.'",
        "'speaker_8': 'Plus years, for generations. This is why we need a new council.'",
        "'speaker_11': 'Because you do not listen to the concerns of the people in these neighborhoods. You only listen.'",
        "'speaker_0': 'To them on the topic of thank you. Thank you. Next up, John Young and I'm going to call in the next five up to the front row, Dara Watson, Andrew Feinstein, John Haydon, Eric Clancey and Glenn Sibley. Go ahead.'",
        "'speaker_5': 'Hi.'",
        "'speaker_8': 'My name is John Young. I live at 3639 Ray Street. I've been in the whole neighborhood for almost 11 years and I'm going to speak in support of the project. I think it's going to provide the neighborhood with a few key positive benefits.'",
        "'speaker_8': 'The biggest is the two way street. If you're standing on 37th trying to cross Miriam's Street, the Warren Street is a has a bend in it and you can't see around the corner and cars just fly because it's a one way street.'",
        "'speaker_8': 'They come around that corner, they're going really fast. So straightening out the grid, reproducing the street grid, having two way traffic will greatly improve pedestrian and cyclist safety. The next is it's going to provide detached walks and shade trees.'",
        "'speaker_11': 'There is one.'",
        "'speaker_8': 'Tree in this whole block and all of the walkways are attached and right up against the curb, or you're just right up against all the cars. And last, it's going to provide a full service grocery store that's actually walkable.'",
        "'speaker_8': 'When I first bought the house 11 years ago, I this is the one thing I hoped we would finally get. And with this project, we're going to actually get something that's walkable that you can actually get to. It's affordable and quality.'",
        "'speaker_8': 'And then the last thing is density. It's two blocks from the light rail stop. And this area is mainly a surface parking lot. With no residents in providing that much density is going to really improve that whole light rail area and station area.'",
        "'speaker_8': 'That's it. Thanks for letting me speak.'",
        "'speaker_0': 'Thank you. Next up, Darryl Watson.'",
        "'speaker_8': 'Good evening, members of council. My name is Darryl Watson. I'm a deep, dark chocolate brother, 30 year resident of.'",
        "'speaker_0': 'City Council District nine.'",
        "'speaker_8': 'And a 23 year resident of the great Whittier Neighborhood.'",
        "'speaker_5': 'Association. And I stand.'",
        "'speaker_8': 'Here tonight in favor of this rezoning and in favor of this development. I have three points I wanted to share. First. Affordable housing as well as having an affordable grocer. I remember 1998.'",
        "'speaker_7': 'When the Whittier Neighborhood Association, we did our neighborhood plan.'",
        "'speaker_8': 'And it was one of the first plans, neighborhood plans that was attached to the comprehensive plan for the city county of Denver. And one of our.'",
        "'speaker_6': 'First priorities was to have an affordable.'",
        "'speaker_8': 'Grocer.'",
        "'speaker_5': 'In.'",
        "'speaker_7': 'The Whittier neighborhood or adjacent to the Whittier neighborhood.'",
        "'speaker_8': 'And that was in 1998. We support all of the current grocery stores that currently are around and in Cole and Whittier. But having this as an addition doesn't take away from those. It just provides different opportunities for folks.'",
        "'speaker_8': 'As far as the affordable housing piece, that's a plus.'",
        "'speaker_7': 'Knowing that within District nine.'",
        "'speaker_8': 'We have some of the largest communities of low income.'",
        "'speaker_5': 'Section eight.'",
        "'speaker_8': 'And affordable housing.'",
        "'speaker_7': 'I am for all of the above.'",
        "'speaker_8': 'The more affordable housing, the more low and low income housing, the more section that we can have, the more folks we can support. I know my mother lives in Curtis Park. I won't share her.'",
        "'speaker_5': 'Business, but she lives in a rent an apartment based on her income.'",
        "'speaker_8': 'She loves it. She's been there for almost 15 years. She can possibly walk to this grocery.'",
        "'speaker_5': 'Store.'",
        "'speaker_8': 'From her residence that she lives right now. I think the other things that I think is important are the jobs. I think we're going to have a mixed used.'",
        "'speaker_5': 'Grocery store that's going to allow for folks in the neighborhood. And I can tell you, I've known Andy Feinstein for a good clip. Him and his team have done a remarkable job in reaching out to all of the neighborhoods that surround this grocery store.'",
        "'speaker_5': 'But I also know every business, as Andy has in our neighborhood, in our community. He hires folks from.'",
        "'speaker_8': 'Within the communities that they serve. That's one of his priorities and that's one of the reasons why I support him and the work that his team does. So thank you very much, members of council. My name is Darryl Watson and I.'",
        "'speaker_5': 'Support this rezoning.'",
        "'speaker_0': 'Thank you. Next up, Andrew Feinstein.'",
        "'speaker_8': 'Good evening, Council President. These mikes are never high enough. You're tall. You should make them taller for all of us. Tall guys. Good evening. Council President Clark, members of city council. My name is Andrew Feinstein. Thank you, Daryl, for the very kind words.'",
        "'speaker_8': 'I'm a fifth generation Denver aide and I'm located at 3535 Larimer Street. You might know me more familiar lately as the owner of the Tracks nightclub and the next event center, which does hire locally immediately catty corner to this site in question.'",
        "'speaker_8': 'I'm also the lead developer on this project and our group has owned this property, the bulk of this property since 2005, except for the seed portion which we were able to acquire last year. Jeff did a great job.'",
        "'speaker_8': 'Jeff from a CPD staff did a great job of walking you guys through all of the neighborhood plans, and I believe he made a good case for why this is consistent with those plans. As someone who's been in this neighborhood now for ten years, I've been in all of those public meetings.'",
        "'speaker_8': 'So whether it was the 2008, 2009, 30th in Blake Station area plan, the 2011 next step study the northeast downtown neighborhood plan the 30th and Blake design and height overlay that we passed last year. I went to all of these meetings, every single one of these meetings, and the one thing we kept hearing in all these meetings'",
        "'speaker_8': 'was four needs from the community. Number one, you know, we live in a food desert and we need an affordable grocery store that we can walk to. Number two, we need more affordable housing. Number three, we need local jobs in the neighborhood.'",
        "'speaker_8': 'And number four, I don't feel safe when I bike or walk around these one way streets and these dangerous intersections. So we're really here tonight because we have an opportunity with this rezoning to not only comply with all of those neighborhood plans that have been adopted by council going back ten years now.'",
        "'speaker_8': 'But we can finally meet the needs, the felt needs of our neighbors and fulfill the vision that we all set forth as a city and as a community. When we went through these planning processes, going back again ten years, unfortunately, our sites, including the Lawrence Street swoop that Steph mentioned and the medians we required from Seedat to'",
        "'speaker_8': 'complete the block while they were included in the 30th and Blake design overlay, they were not included in the ordinance. So in order for us to meet those community needs again, eliminate a food desert, provide affordable housing, which, as you'll see in the booklets we've given you, we are committing to making 10% of all the units we'",
        "'speaker_8': 'build to be affordable at 60%. Am I? Even though the ordinance only may require one or two units at 80%, am I provide local jobs and create a safer pedestrian experience? It's all covered. If we get this rezoning done.'",
        "'speaker_8': 'So we have three letters of support from Curtis Park, from Cole and from Rhino, and we have over 150 individual support letters from our neighbors. So I would encourage you all to consider passing this this evening, and I'm available throughout the evening if you have any questions.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, John Hayden.'",
        "'speaker_3': 'Good evening, counsel. And I like the short term. Thank you very much.'",
        "'speaker_1': 'So.'",
        "'speaker_3': 'John Hayden.'",
        "'speaker_1': 'I live at 2418 Champ Street for 24 years.'",
        "'speaker_3': 'And I was President Kerr's park neighbors when Andy and.'",
        "'speaker_14': 'His team brought this before our.'",
        "'speaker_3': 'Neighborhood for asking for our support. It was at our November regular meeting, and there were 48 neighbors present for that meeting. So there were a lot of people who came out and Curtis Park neighbors did vote to support this rezoning.'",
        "'speaker_3': 'Our community expressed several concerns having to do with having to do with the design of the building and having to do with making sure that the property, the grocery store was accessible by bike and pedestrian access. And we were happy to say that the developer worked very well with the neighborhood on that and addressing those concerns.'",
        "'speaker_3': 'We feel very comfortable with Andy and his team because they've been in our community for so long. I think in fact their family started the synagogue at 24th and Curtis over 100 years ago. So it's this really does feel like a a development that's happening from within our community by someone that we trust and that.'",
        "'speaker_3': 'And so that is why you see support here and not a ton of people here angry about it.'",
        "'speaker_10': 'So I.'",
        "'speaker_3': 'Am.'",
        "'speaker_1': 'Particularly excited about.'",
        "'speaker_3': 'This because of the taking the Lawrence Street swoop out and restoring our street grid. There were a number of places. Many of you know that I'm a big advocate for pedestrians and bikes in our city, and this is to me, riding.'",
        "'speaker_1': 'A wrong that was.'",
        "'speaker_3': 'Done to the five points in Cole neighborhoods many years ago.'",
        "'speaker_1': 'When they thought.'",
        "'speaker_3': 'We should be paved over and become an expressway into downtown. This is a rare.'",
        "'speaker_1': 'Opportunity.'",
        "'speaker_3': 'To take one of those pavement scars and reintegrate it back into our neighborhood. And so I hope you will support this. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Eric Clancy.'",
        "'speaker_11': 'Good evening, everyone. My name is Eric Clancy. Excuse me. And I live in the neighborhood that this project is proposed for. And I actually also own a business in the neighborhood. It's a gym. So my primary reason for being here is speaking up in favor of it is safety for my gym members.'",
        "'speaker_11': 'A lot of the workouts that we do require us to run in and around the neighborhood and the one way streets that a lot of the previous speakers have mentioned are unsafe for my members, just due to the fact that the cars travel really quickly on those roads.'",
        "'speaker_11': 'So I think that by the rezoning and moving some of the roads into the two ways will be a lot safer for my gym members, which is the primary reason that I'm here speaking in favor of the project.'",
        "'speaker_11': 'And also we desperately need a grocery store in the neighborhood. I have to travel far too far to go get food and it would be great to have something in the neighborhood where I can just walk to take my bags and then walk back home, too.'",
        "'speaker_11': 'Thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Glen Sibley and I will invite the last six people. So if you haven't been up yet, but you signed up this evening to please come up to the front bench. Good.'",
        "'speaker_6': 'Good evening, President Park. My name is Glenn Sibley. I live in 14 a live in Wayne Koop. I've lived in Denver since 1946, off and on. They call in five points. They would have long been a food desert, dating back to the time when my father used to drive me downtown and turn towards downtown three or five'",
        "'speaker_6': 'points just to bloggers on this side. There's more and more bougie retail in the Rhino cool neighborhood. You only need to go to consumers and 20 that just have to be convinced of that. It's packed their night. The development of a full service grocery store between 36 and 37.'",
        "'speaker_6': 'Downing of benefits going 5.7. Curtis Park. Globeville. Elyria. Swans. Here they were to the north, none of which enjoy a food full service grocery store today. It's a much needed amenity with community benefits. If it goes, you sort of provide a valuable social and neutral meeting place for all ages and genders, social services, etc. Those are obvious'",
        "'speaker_6': 'place for kids to get jobs. Learn the work ethic that we need in this community. The office workers that are occupied, they soon open or plan projects that are on 38th and like 30 of 3500 bike projects would benefit from easy pedestrian access for their needs and the work day and on the way home from work.'",
        "'speaker_6': 'Lastly, the developers proposing ten times the affordable units normally required. Verizon, if I understand correctly, and further supposing those at 60% rather than 80% as regarding the zoning. This choice has real economic concerns for the president, Obama has added, although the team is taking this approach to the project.'",
        "'speaker_6': 'We support it. Thank you very much.'",
        "'speaker_0': 'Thank you. And I apologize for mispronouncing your name. Isaac Dominguez.'",
        "'speaker_11': 'Hi. My name is Isaac Domingue. I live at 1113 33rd Street. I live and work in the district and am in full support of the grocery store development. About a month ago, I sold my car and I have never understood the need to have a store so close to me.'",
        "'speaker_11': 'Then over the last couple of months, walking to work, walking to a grocery store is something that is very it's very important to me being able to go somewhere in the neighborhood that I live and work in as well.'",
        "'speaker_11': 'Not having to Uber or take a bike to get healthy groceries is is something that's extremely needed in the area that we're in. And then lastly, just as I ride a bike or as I scoot. This street is very dangerous, especially the area that is under this.'",
        "'speaker_13': 'Particular zoning.'",
        "'speaker_11': 'Would be very, very.'",
        "'speaker_13': 'Beneficial to have it with a bike lane or something that.'",
        "'speaker_11': 'Adds the two way street so that we can get to places safely. Thank you.'",
        "'speaker_0': 'Thank you. And I'm striking out on names. I apologize. The next couple, I am going to apologize ahead of time. Noah Mouse.'",
        "'speaker_8': 'Manos. Hmm. Good evening. My name is Noah Mannose. I own a property adjacent to the proposed redevelopment site at 3700 Marion Street, which is on the northeast corner of 37th. And Marion. I've lived in the Whittier and City Park neighborhood for almost 15.'",
        "'speaker_3': 'Years.'",
        "'speaker_8': 'And I currently live at 2228 Ray Street. I wanted to come and speak today on behalf of those who are pursuing the zoning amendment, because I believe this initiative is a legacy, a legacy to mine minded development that will have a great and lasting benefit to the neighborhood, which I believe is evidenced by the support of Councilman'",
        "'speaker_8': 'Brooks. I am the co-founder and principal of a design build company in Denver called Paper Airplane. The mission paper airplane is to produce sustainable and high performance buildings using passive house design, philosophy and building methodology. We're focused on producing projects with significantly reduce carbon footprint through the use of low embodied, mature energy materials.'",
        "'speaker_8': 'We're dedicated to creating buildings that don't rely on fossil fuel consumption and buildings that are up to 90% more efficient than what is required by the current building code. Our mindset is to create an enduring benefit for Denver residents through our projects and to create a positive trajectory and for the general health of the neighborhood.'",
        "'speaker_8': 'I have completed one project nearby at in five points at 2256 Washington Street, which was acknowledged by the Denver Post and 50 to 80 magazine for its unique approach to sustainability. I met Andrew in 2016 and learned about the proposal of the coal market redevelopment.'",
        "'speaker_8': 'I was immediately excited by the idea and how it could cultivate a meaningful, positive change in the neighborhood. Previous to meeting him, I was aware of Andy's involvement in the community through Trax and XTO. As a neighborhood resident, I've observed how his entrepreneurship was making a positive impact on the neighborhood.'",
        "'speaker_8': 'And there are several ways that I believe this project is legacy minded. First, the proposed redevelopment will provide a fundamental service that will improve the lives of families and community members that live in coal and rhino. This is a new this new resource will have also have a positive effect on outlying neighborhoods like Swansea, Skyline, San Rafael'",
        "'speaker_8': 'and City Park West. I believe there is a simple underlying formula at work in this redevelopment, which is access to healthy food equals a healthy community. The neighbor neighborhoods of northeast Denver have been historically underserved through limited access to quality food, and the coal market redevelopment project will change that.'",
        "'speaker_8': 'The second way I believe this project is legacy minded is through its focus on affordable housing. Affordable housing is critical as a critical issue in Denver and addressing it as essential to the health and long term viability of the neighborhood and for our city at large.'",
        "'speaker_8': 'We need affordable housing to encourage diversity, to support working families, to support a young, creative class that will continue to make Denver an interesting and exciting place to live. In 2005.'",
        "'speaker_0': 'Your time is up. Thank you very much. And next up, I'm going to go to Jennifer and I'm going to let you say your own last name. I'm going to cut my losses before I even start.'",
        "'speaker_1': 'You did a really great job with the first name. Thank you. Good evening. My name is Jennifer Kubert, and I'm a homeowner in the whole neighborhood. I've been a homeowner in call neighborhood for eight years. And I've watched it grow, expand, improve and gain a new life.'",
        "'speaker_1': 'The rebirth of Larimer Street and all of its restaurants has helped Cool Neighborhood. You also have the Railway Railway running to Union Station and then out to the airport, which has also improved our neighborhood. And now I see this project as another breath of life for the neighborhood, one we desperately need.'",
        "'speaker_1': 'We have restaurant shops and some parks, but that this will help us come closer to a goal of becoming self-sufficient within our own community. I would welcome a grocery store two blocks from my own house, one that my husband and I can easily walk to and shop for groceries, for dinners, or our barbecues or our evenings with'",
        "'speaker_1': 'friends and neighbors. Driving to Safeway, which is 18 blocks from my house or over to Union Station for a Whole Foods, is a waste of my time, and it's usually just adds to more traffic on the streets. Along with self-sufficiency, this project will provide affordable housing that will allow our community to grow and continue on a positive'",
        "'speaker_1': 'and diverse direction. And it can provide jobs for people who actually live in the area. But most importantly, it will improve the roads and the intersections along Marion and Downing. These are dangerous roads and in eight years I have never felt comfortable crossing the street.'",
        "'speaker_1': 'The cars speed through during the day and on the weekends. But at Rush. Our the congestion is overwhelming and you have cars zooming in and out constantly. With this rezoning, we can make the roads safer and hopefully with a little less congestion and we will gain safe crosswalks and bike lanes to those who commute by bike scooter'",
        "'speaker_1': '. So as a long time resident of the neighborhood, I welcome this rezoning and positive change to our neighborhood. And I thank you very much for your time. Have a good night.'",
        "'speaker_0': 'Thank you. Next up, Stephen Sampson.'",
        "'speaker_5': 'Hey, my name is Steve Samson and I live across the street and work across the street from the proposed development. I think the case has been pretty well made. So I will say that the streets are indeed dangerous and the food is definitely scarce.'",
        "'speaker_5': 'So I think those are both good things. I've been to many of the community meetings for all of the all of the proposed developments for the.'",
        "'speaker_3': 'Whole neighborhood.'",
        "'speaker_5': 'And specifically this. And I think that some of the concerns are valid. But given that I have not seen anyone propose an alternative plan that offers anything of any real benefit. I am in support of this.'",
        "'speaker_0': 'Thank you. Next up, Tracy, while.'",
        "'speaker_11': 'Good evening. How's everybody tonight? Thank you so much, city council, for hearing us out. My name is Tracy while and I've been a resident of the Five Points neighborhood for 18 years. I'm also the president and co-founder of the Rhino Art District.'",
        "'speaker_11': 'This particular project was brought to our board and gained full support, as you'll see in your letter. I live in a food desert. When I first moved to the area, my closest food source was the gas station. Over the years, there has been more access to restaurants in this walkable area.'",
        "'speaker_11': 'But it wasn't until recently that there was a natural grocer built off of Brighton Boulevard. This has been an amazing addition and now it's so much easier to buy healthy food and produce in it an addition of another market.'",
        "'speaker_11': 'Within walking distance would be another great addition. With another store, I will now be able to shop and compare prices and find the food that I really want. We deserve access to fresh, healthy food. I was also thrilled to hear that as part of this project that 10% of the units being created will be affordable at 60%'",
        "'speaker_11': 'AMI. While this won't solve our affordable housing crisis, it is at least a step in the right direction. The developer has deep roots in our community and generally cares about our neighborhoods. This is a model I wish more developers were doing in our community.'",
        "'speaker_11': 'I encourage City Council to support this much needed projects project as it will create over 100 jobs for our community, provide needed healthy food access and will provide much needed affordable housing in the area. Thank you for your consideration.'",
        "'speaker_0': 'Thank you. And last up, Jonathan Kaplan.'",
        "'speaker_14': 'Hi. Good evening and thank you for taking the time to listen to us this evening. My name is Jonathan Kaplan and I've lived and worked in this area for the past 12 years. I'm a property owner as well as a business owner, and I have seen these neighborhoods grown exponentially since I've been here.'",
        "'speaker_14': 'The neighborhoods of Cole River, north five points, Elyria, Swansea and Globeville. It's a food wasteland. It's a food desert. We need an affordable grocery store. And the proposed zoning change will move this project forward. And not only will it help create a grocery store, but it will include over 100 jobs, a 10% affordable housing counterpart.'",
        "'speaker_14': 'And finally, the realignment of streets to provide a safer vehicle and pedestrian experience. I have an incredible amount of confidence in Andrew Feinstein and his team. They are neighborhood centric, they're community oriented. And I urge city council to approve this change of zoning.'",
        "'speaker_14': 'Thank you for your time.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there questions from members of council? Councilman Brooks, I see you up. Good.'",
        "'speaker_3': 'Yeah. I just have a question real quick. First of all, Bell Dog didn't get a chance to finish. You didn't get a chance to finish your speech. Did you want to finish that or.'",
        "'speaker_2': 'I'm thinking of your grocery store.'",
        "'speaker_5': 'All right.'",
        "'speaker_3': 'Okay. I have my questions for Jeff. Jeff, can you come on up and just clarify this? Because this has been a point of questioning for a lot of folks in the neighborhood and and even folks. Yeah. And it's the the 35 foot buffer from the protected district.'",
        "'speaker_3': 'Yes. You said it's a 35 foot buffer that can go up to three stories. Can you just explain that maybe you want to put the slide on and work in the five story start.'",
        "'speaker_13': 'Yeah.'",
        "'speaker_3': 'So just give us a little step up.'",
        "'speaker_13': 'Okay, so the. The code allows just looking at the eastern half of this block. So it would allow a base height of three stories and an incentive height up to five stories. So if you provide affordable housing or other community benefits, you could get up to five, however, within 35 feet of Marion Street.'",
        "'speaker_13': 'You can't use that incentive. It would only be three stories or 45 feet. I believe in height would be the maximum. So there's essentially a no go area. That is the the buffer intended to transition to the neighborhood.'",
        "'speaker_3': 'So I just want to make that clear because it sounded as if you said you can't go to three stories within the 35 feet. But the reality is you can go because they will be doing the incentive, the affordable housing.'",
        "'speaker_3': 'They will start their five stories in the three.'",
        "'speaker_13': 'That they could. They could if they meet all the requirements.'",
        "'speaker_3': 'Okay. I just I just want to be very clear in making that clear to the folks who are here. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Brooks. Councilman Flynt.'",
        "'speaker_7': 'Thanks for president. Jeff, maybe you can help me understand, as I looked at the staff report and I looked at the 30th employee stationery plan, when Lawrence is taking when the diagonal, the swoop is taken out, will 36th Avenue cuts through there right now in the middle of the block, basically, doesn't it, between Marion and Downing?'",
        "'speaker_13': 'Yes.'",
        "'speaker_7': 'Okay. Will 36th Avenue be maintained as a right of way?'",
        "'speaker_13': 'Yes, that's my understanding. It would be squared off and 36th Avenue would maintain. It's easy to go.'",
        "'speaker_7': 'Continue to go through. So the triangular parcel at the bottom of that will be separated from the main block to the north. Okay. I just want to make sure I understood that correctly. At the committee, there was some talk when this was a committee a while back about open space and the fact that those triangles, even though'",
        "'speaker_7': 'they're in the middle of traffic nightmare, provided some green space. And we had heard some we had some input that there was concern about loss of green space. Can you tell us how this rezoning, how it handles the open space and green space?'",
        "'speaker_13': 'Yeah, I mean, it's a challenge because those two areas are one, they're in private ownership now and they were previously set right away. So the city has never really own them or controlled them.'",
        "'speaker_7': 'I didn't mean to imply that it's that it should be green of. It just happens to be open because there's nothing else you can do with them.'",
        "'speaker_13': 'Right. Right. So so absent any zoning guidance or any plan guidance, saying it should be open space or a green space or a park or anything, and the fact that it's in private property ownership and was put on the market and went through that process, we have really limited options in terms of what zoning can do.'",
        "'speaker_13': 'But I know the applicant and if they want to submit it could speak to it has been looking at ways to mitigate that.'",
        "'speaker_7': 'Okay, Andrew, could you come up and address that? And also, while he's coming up, does the triangular parcel when we take out the Lawrence swoop, does do the parcel boundaries abut the other private property to the south of that does?'",
        "'speaker_8': 'I think you have to ask me about the tollbooth we were going to put up on the road. So no, so jokes aside, this this property, if you look at the map that just provided here. Yes. And you take this right now, this this this city block exclusive of that median has zero greenspace and very few trees'",
        "'speaker_8': '. Yes. When we square off this entire block and we remove the Lawrence streets, where we are going to dress or adorn is the right word. But we're going to address the entire perimeter of this site with a brand new tree line on the Marian side.'",
        "'speaker_8': 'Our intention, if public works will allow it, is to make that a localized street. And we're going to have a 15 to 17 foot tree line all the way along Marion, which it does not have today. So we're actually going to double the amount of total green space and triple the amount of trees as far as the'",
        "'speaker_8': 'triangle to the south of 36. That is adjacent to our neighbor to the south, which is a gas station. And we play nice, we get along great, and we're going to own our triangle and they're going to own their gas station.'",
        "'speaker_8': 'And and we've had some preliminary discussions about reserving that as open space, but it remains to be seen what we're going to do with it specifically.'",
        "'speaker_7': 'Okay, great. Thank you, Mr. President. That's all.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Councilman Espinosa.'",
        "'speaker_3': 'I'm looking at the the 99 plan for a mid 2000 plan, really, for Whittier, which is not referenced in the in among the plans. Is there a reason for that?'",
        "'speaker_13': 'Uh, if it is in the plan area boundary, um, which I'm not sure that it is.'",
        "'speaker_3': 'After the site. Definitely is, yeah. Okay. The northwest, the northeast corner and the triangle parcels.'",
        "'speaker_13': 'Okay. Well, that may be an oversight by staff's part, but we certainly have more recent guidance with the 30th in place.'",
        "'speaker_3': 'And this is going to be more related to my comments. But does anyone know the demographics of the neighborhood of Whittier now? Because back then it was 75, while 76% African-American and 15% Latino. So. So over 90% or over?'",
        "'speaker_3': 'Yeah, a lot. And I can do math again. Over 90% minority. Do you know what that is?'",
        "'speaker_13': 'I don't know. Um. Okay.'",
        "'speaker_3': 'Okay. I was gonna look at it. Slide 42.'",
        "'speaker_11': 'Please.'",
        "'speaker_3': 'Uh oh. You're already there. Awesome. So that blue band of three story is. How do you begin?'",
        "'speaker_13': '35 feet from Marianne Green.'",
        "'speaker_3': 'And then slide 50 as well.'",
        "'speaker_13': 'Uh. Uh, I only have 49.'",
        "'speaker_3': 'Okay. How about 38? 30? Yeah. I'm looking for.'",
        "'speaker_13': 'A movie off.'",
        "'speaker_3': 'Yeah. It's different than what's on here because it's 50 slides on here. I'm looking for the slide with the euro two boundary.'",
        "'speaker_13': 'That the billboard is so. Oh, yeah. There is a hidden slide. Sorry, there is a hidden slide. Which is. Yeah, I apologize. I'll get that unhidden. I see that comes up. Yeah.'",
        "'speaker_3': 'Yeah. So there is language in the plan that contemplates this idea that one day the economic forces would redevelop this area and maybe, you know, put less emphasis on revenue generation through billboards. It is interesting to me with the reconfiguration of the street that the Marion Parcels would be more of the residential fabric that the rest of'",
        "'speaker_3': 'the neighborhood to the east is and less in certainly with fewer car trips than what Lawrence configurations supports today. Was there any discussion about altering the boundary of the euro, too, so that it actually didn't go all the way into the to the single family, sort of, you know, adjacent and maybe subdivided?'",
        "'speaker_3': 'I mean, split it among the zone lot.'",
        "'speaker_13': 'Yeah. I mean, we we had discussions about that. And it's one of those things where both with the euro one and the euro two, we were advised to keep it exactly how it is, basically. And I could have the city attorneys come up here and speak more to that, but especially with having existing billboards on the site'",
        "'speaker_13': 'and creating issues with that. So it is a little funky, but we we did land the living in exactly the way it is.'",
        "'speaker_3': 'I'm not too worried about it because I did scour all the plans and there's very, very minimal discussion. And it's only in Arapahoe Square, actually in the downtown neighborhoods plans where they even talk about existing billboards. So so as far as I'm concerned, the plans don't recommend anything.'",
        "'speaker_3': 'Yeah, the but the plans do talk about travel said study has a travel said study prior to the reconfiguration. Is the travel study been done?'",
        "'speaker_13': 'I am not sure if I know that there is extensive a next step study to look at squaring off this block. And I don't know if a travel shared study was a component of that analysis. I don't.'",
        "'speaker_3': 'Know if you could if there is one, could you just looks.'",
        "'speaker_13': 'Like.'",
        "'speaker_3': 'Oh, great.'",
        "'speaker_13': 'Good, get Luke up here from public works to copy.'",
        "'speaker_12': 'Hi. I'm Luke Korpi with Public Works. No travel said study wasn't done, but public works that examined when we began to work with the applicant on this project, the actual traffic volumes of the adjacent surrounding streets and worked on these street improvements and operational improvements to accommodate the traffic associated with the removal of the worn swoop.'",
        "'speaker_3': 'I'm sort of not worried. I'm just going to sort of welcome this neighborhood into the problems of Northwest Denver because it's already really congested at times over there. I can't imagine with the reconfiguration how that necessarily is going to work other than to put more traffic in neighborhood streets.'",
        "'speaker_3': 'You know.'",
        "'speaker_12': 'It's not particularly designed to accommodate more traffic than is currently using the streets, but it is designed to accommodate the traffic throughput that is currently contained on the lawns swoop and average it out to the surrounding streets 36 Marion Downing 37th, while at the same time improving bicycle and pedestrian conditions.'",
        "'speaker_3': 'As public works. So one of the things is, is in my choose, my two statistical neighborhoods that are closest to the urban core and closest to transient has the most connectivity to downtown, also has the greatest increase in population and single occupant drivers.'",
        "'speaker_3': 'This public works have a plan because there's so much transit infrastructure over here to basically really make sure that this is this is an area that actually, you know, readily accepts and adopts the alternative means of transportation because there's probably no area in the city that is more primed for it.'",
        "'speaker_12': 'I think some of that is is delving into policy issues that I'm at a staff level not quite able to address. But certainly, you know, we're cognizant of the density, is supportive of the increased density around the stations and in this transit rich area.'",
        "'speaker_12': 'So we're certainly wanting to encourage high density but less vehicular oriented development, the idea being that we're really not in a position to be able to redesign or reconfigure the streets in any kind of substantial way to carry more traffic volume.'",
        "'speaker_12': 'But what we're interested in working toward is mode shifts to transit, bicycles, pedestrians and certainly, you know, we're supportive of the higher densities in this neighborhood because of their adjacency to the transit opportunities.'",
        "'speaker_3': 'Do you think that that is something that we should introduce in this? So, you know, we did land use decisions with the incentive overlay and other sort of creating the conditions for density and minimal parking. Do you think we should have established some requirements in the site development plan process so that actually public works wasn't just looking'",
        "'speaker_3': 'at access, ingress and egress, but actually sort of compelling multi-modal use?'",
        "'speaker_12': 'I think that's a very good question. I think I think it's a it's a policy discussion that should potentially be pursued and encouraged in my position. I'm not really able to speak on how we may want to proceed with implementing those goals.'",
        "'speaker_12': 'But I can certainly say that in my role primarily as a development review engineer, that examining everything and putting everything on the table to accommodate the transportation needs of development and the community is a good thing.'",
        "'speaker_11': 'You know, great.'",
        "'speaker_3': 'Those are really lead up to I have questions for the ownership as well. But I can skip if you if there is any that is lined up, I'd probably.'",
        "'speaker_0': 'Put just you.'",
        "'speaker_3': 'Right now. So is it Andy or just you alone or. Okay, so the community spoke about a conversation that you had with respect to them on design and amenity in the project. You know, I'm big on codifying these things, even though they're not a requirement of your zoning.'",
        "'speaker_3': 'You know, when you have these conversations with community, they start to establish certain expectations, but the zoning doesn't actually compel any of that. So what are you what mechanism are you pursuing to actually compel the outcomes that you're having that you're sort of pitching to the neighborhood?'",
        "'speaker_8': 'I'm concerned that you're questioning my taste, Councilman. Well, first things first. You know, when we when we and I helped, I was on the steering committee and I attended all 34 meetings that helped draft the 38th and Blake design and height overlay.'",
        "'speaker_8': 'We debated this extensively. If we want to have formalized design review yes or no, we ended up saying no. That said that the design overlay itself does have a lot of good. In it, including active ground floor use a certain height for the first floor setback requirements.'",
        "'speaker_8': 'Setback requirements. A lot of you know, we did have a what do you call hydro parking lot provisions where you can't just have a parking lot that's exposed to the street. So I think there's a lot of good tenants in there.'",
        "'speaker_8': 'You know, as Keith Prior from Curtis Park mentioned earlier, we've already engaged with him, with our architect, to talk about what what might work from a design standpoint, from the opinion of Curtis Park and the perspective of Curtis Park.'",
        "'speaker_8': 'Certainly as we get our massing going and we get our design going, should we be fortunate enough to have our zoning approved? We'll be meeting with the rhino team as well, rhinos in the process of reconfiguring its design review team and there will be meeting with them as well.'",
        "'speaker_8': 'So we will engage with the neighbors. But I'm very confident in our team. We've done other projects in this area before. I think we do great work. We're not out of town speculators. We're here for multi-generation, not just myself, but my partners as well.'",
        "'speaker_8': 'And I think that this will be a project that the whole community can be proud of because we're intending on owning it forever, so we better be proud of it.'",
        "'speaker_3': 'So at ludy committee discussion about pocket parks and the possibility of a pocket park sort of as a replacement for the the lost open space, I, I commented that it's a quarter of an acre of open space land in those two triangles, about 11,000 square feet.'",
        "'speaker_3': 'And it wasn't your commitment, I understand, but the commitment was made to capture open space. Has open space been a part of that discussion with the community?'",
        "'speaker_8': 'It has, especially with the whole neighborhood. I think, again, as I mentioned in my in my my answer to Councilman Flynn, we believe that by addressing the east side of city, west side of Marion, east side of our project with potentially a 17 foot tree line and turning Marin into a local ice street, we can actually double'",
        "'speaker_8': 'the amount of green space that is currently open, space that is currently there, and triple the amount of trees on the site. You know, those to call those pocket parks are of colors. Open space is. I just respectfully disagree with the description.'",
        "'speaker_8': 'I've been located right across the street for a decade now. I have never stood in either of those pocket parks and had a picnic or done anything whatsoever. They're medians and just because they happen to have grass on their medians.'",
        "'speaker_8': 'And so I think that, you know, there's going to be some cost benefit here. There's some things we've got to do in order for us to square up this block and improve and improve both a pedestrian and cycling, but also vehicular safety around there, you kind of can't have it all.'",
        "'speaker_8': 'So we're trying to explore maintaining that southern triangle as a pocket park. But we engaged with parks and they weren't interested in taking it on. And I don't want to be in the parks business and I don't think you want me in the parks business.'",
        "'speaker_8': 'So that's something we're working on, but we'll see how it goes. Yeah, I'm.'",
        "'speaker_3': 'Under no illusion that those are pocket parks, but what was contemplated was actually something more of a true pocket park as part of the development. But those are just those are spare parcels, you know, as you know, as you acquire them.'",
        "'speaker_3': 'Then the last question is on the 17 feet along, Marion, do you is that where your your property line is? If not, are you going to seek a variance to further your build to requirement? Or do you need us to already put an encumbrance on that?'",
        "'speaker_8': 'And I'm kind of speaking out of turn there. I can't answer that intelligently. But again, my understanding is we're going to work with Luc's team in public works. Maybe maybe staff can help answer that question. But again, we're trying to make Marin a local street, and that's important for two reasons not just to have an extended tree'",
        "'speaker_8': 'line, but also to have no commercial activity on Marion. As you know, this site is a bridge between the residential side of the neighborhood and the commercial side of the neighborhood. The residential side is on the east, which is coal, and the commercial side is on the west, which is right now.'",
        "'speaker_8': 'And so that's where we have all of our commercial facing West and all of our residential facing East, which is why we believe that's the best opportunity to have an extended tree line. Yeah.'",
        "'speaker_3': 'The reason I ask is I've seen other developers basically not want to battle with the city to do sort of what you're talking about, which is the right thing when you can just do what you're allowed to do.'",
        "'speaker_8': 'Well, too, I think that we all the of the boats are going in the same direction here, meaning we have alignment with Curtis Park, Rhino and coal. I think we're a pretty feisty bunch. And I think we have a we have a terrific councilman who has helped move this project forward.'",
        "'speaker_8': 'And I think that we have a good team, and I think that we'll have good conversations with the city. And I look forward to having those to figure out how we can produce as much open space as possible.'",
        "'speaker_3': 'Right. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Seeing no other questions, the public hearing for Council 19 0058 is closed. Comments by members of Council Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. President, as I look at this. This plan and this rezoning, it brings to mind sort of an urban disaster that could have been the the Lawrence Swope the providence of that stems from the original Hyde Park subdivision in 1918 81, when the state put state Highway 33 through from 40th Avenue Smith Road and 40th'",
        "'speaker_7': 'Avenue on down into downtown Denver. It came in on Lawrence and Larimer, so they needed to acquire that mid-block between Downing and Marion and sort of destroyed the neighborhood and could have destroyed it much further because I believe that State Highway 33 was designated because of the the city's construction of the Lawrence Street Viaduct in 1957, when'",
        "'speaker_7': 'they paired it with Lawrence and made a one way couplet. This was during the time in the fifties when the city was was doing one way couplets all through all through town. However, in the mid-sixties, the voters of Denver approved the Skyline Urban Renewal Project, which included plans for a freeway.'",
        "'speaker_7': 'Believe it or not, this block that we're rezoning today would have been the eastern end of a freeway from what's now the Urrea Parkway, or formerly the Lawrence Larimer Viaduct, straight through lower downtown, which would have been obliterated and up through the Upper Larimer area and connecting onto Smith Road.'",
        "'speaker_7': 'And I when I see rezonings like this, Mr. President, which I support because I believe it meets all of the criteria. It just reminds me of many bullets that we've dodged in the past. Thank you.'",
        "'speaker_0': 'Thank you. Kels. Councilman Flynn. Councilman.'",
        "'speaker_6': 'Yeah. Andrew, I just want to.'",
        "'speaker_0': 'Thank you so much. You can't believe we've been for the last three years. We've been talking about grocery.'",
        "'speaker_6': 'Stores.'",
        "'speaker_0': 'And affordable housing. And you're putting that whole plan together. Is is is very admirable. And so really appreciate you and your partners and all of us to bringing this whole project together. It's going to be great and thank.'",
        "'speaker_6': 'You for all the leadership with Rondo as well.'",
        "'speaker_0': 'So thank you for everything you're doing. Thank you. Thank you. Councilman new Councilman Espinosa.'",
        "'speaker_3': 'Yeah, I just I would just make comments. I think I think if you guys get the outcomes that you guys are talking about, it'll be great for this community. And so with that, I'll be supporting the rezoning because it's, you know, it's what's needed to sort of get these two even going close or take a whiff at'",
        "'speaker_3': 'these outcomes. That said, I'm going to call on you all. That spoke about the need for grocery over here to to be vigilant in getting that outcome on this development or others opportunities in the area. But don't ignore the fact that this problem has been persistent in this neighborhood for a really, really long time.'",
        "'speaker_3': 'And with this gentrification that is in fact happening and with affluence coming to the area that, you know, these food deserts are more attractive for grocers to move into because there's some disposable income that they can tap. And but it is a problem and is a problem that the city voted to start to address to the tune'",
        "'speaker_3': 'of $8 million a year. And this this city could budget and have helped address this problem sooner rather than now. I hope and I assume that OPD or somebody may partner with you to sort of help you make sure that this outcome is is is received or.'",
        "'speaker_3': 'But and so but there are other communities that don't have your resources that are in a dearth of a food desert. And so when you hear that, please, because this section of this binder is the comments, individual comments of people supporting this this rezoning.'",
        "'speaker_3': 'And almost I mean, the vast majority talk about the grocery aspect of this development. And so that is a genuine need for you all. It will benefit everybody here and a whole bunch of other people in the surrounding areas that are there and will be there as part of the other developments of the 30th and Blake Station'",
        "'speaker_3': '. But there are other parts of this city that are just as in dire need. And let's not lose focus of that. And I hope you champion that whenever you get a chance. Thanks.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. Councilwoman Sussman.'",
        "'speaker_2': 'Thank you, Mr. President. I just want to congratulate the.'",
        "'speaker_1': 'Neighborhood and the developer.'",
        "'speaker_2': 'For thinking through what is going to be, I suspect, a wonderful microcosm of tackling the complexity of the issues that we are.'",
        "'speaker_1': 'Facing in Denver.'",
        "'speaker_2': 'You are you're tackling the affordable housing that a place.'",
        "'speaker_1': 'More places for people to live in really.'",
        "'speaker_2': 'Terrific neighborhoods. You're tackling the the traffic calming issues that we need to have you're tackling that need to have people maybe not.'",
        "'speaker_1': 'Have to be in their cars all of the.'",
        "'speaker_2': 'Time. You're you're tackling the.'",
        "'speaker_1': 'Walkability of.'",
        "'speaker_2': 'The neighborhood. You like doing both the transit, the traffic and the housing situation all in one place. And you're providing a density of experience, not just density of people, but a density of experience, a way to be able to enjoy greenery.'",
        "'speaker_1': 'Enjoy trees.'",
        "'speaker_2': 'Enjoyed, go shopping, have some other things that you.'",
        "'speaker_1': 'Can do where you live and where you work. And I think this is a really good example of of meeting this problem from all kinds of different angles. And I appreciate that the work that you did and with the work that the neighborhood did to bring.'",
        "'speaker_2': 'Something like this forward.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Seeing no other comments, Madam Secretary, roll call.'",
        "'speaker_3': 'Brooks abstained.'",
        "'speaker_2': 'Black. Espinosa by Flynn I. Gilmore. I turned in. I Cashman. Lopez I knew. Sussman Hi, Mr. President.'",
        "'speaker_0': 'By I'm secretary. Please cause voting in those results.'",
        "'speaker_2': 'Ten Eyes, one abstention.'"
    ]
}