{
    "Agreement with Norwegian Air Shuttle ASA for Air Service Incentive at Denver International Airport.": [
        "'speaker_0': 'I will do a quick recap under resolutions. Councilman Flynn, looks like you have called out Resolutions six, ten and 11 for questions and comments. All right. Okay. Under bills for introduction, no item has been caught out under bills for final consideration.'",
        "'speaker_0': 'No items have been caught out and under pending. Nothing's been caught out. Madam Secretary, would you please put six? Ten. Go ahead, Councilman. Ask your question.'",
        "'speaker_9': 'Thank you, Mr. President. Angela, are you going to. Angela, Kasey is from the airport, is going to address this. We had some email exchanges last night over this, and I did get most of my answers, but I wanted to do this briefly in public so that folks could understand Norwegian Air is conducting this Denver to Paris service'",
        "'speaker_9': ', and they just started about a month or so ago. So I came in April, in April, and we have an agreement with them. This is the agreement we have with them, the incentive for having initiated that service. And one thing I want to make get clear is am I correct in when airlines begin a service to a'",
        "'speaker_9': 'new market that is not currently served, typically the airport will engage in an incentive program to to seed that service. Is that correct?'",
        "'speaker_4': 'Yes, that's it.'",
        "'speaker_9': 'So this is not an unusual thing. What's unusual about this situation, though, is that after they started service, they have they announced yet that they're reducing service?'",
        "'speaker_4': 'I believe so.'",
        "'speaker_9': 'They have it now. Okay. Norwegian is not going to conduct year round service now. They've decided to do only seven months of the year. My question last night and what I want to get on the floor here is that this agreement is reduces the total number of payments geared to the amount of service.'",
        "'speaker_9': 'So by eliminating five months of the year and that's I think from late October through early March when they will not fly, when they found little less demand for travel between directly between Denver and Paris, there is no reimbursement.'",
        "'speaker_9': 'So the $4 million that is complicate comp company contemplated so I generated myself is won't be paid if they only conduct seven months of service.'",
        "'speaker_4': 'That's correct.'",
        "'speaker_9': 'And in fact, it's about $30 per employment.'",
        "'speaker_4': 'Rate per person rate.'"
    ],
    "Marketing Air Service Development Incentive Agreement with Norwegian Air Shuttle ASA.": [
        "'speaker_9': 'Per person on the plane. Okay. And then the companion resolution 611 is a marketing agreement. And that is also a standard action that the airport takes for any airline to conduct, say, service to a new market. And that is a straight reimbursement over their promotional materials.'",
        "'speaker_4': 'Yes.'",
        "'speaker_9': 'Okay. And the only thing the only other question I had, Mr. President, is they're conducting this service with the Boeing. 787, the Dreamliner.'",
        "'speaker_4': 'Race.'",
        "'speaker_9': 'Great. And okay. Because the $4 million seemed a little high based on the capacity for two flights a week over two years. But it works out to about 320 passengers per flight. Right. Okay. And that's 787. Does that?'",
        "'speaker_9': 'Yes. Great. All right. Thank you, Mr. Brett. That's the only questions I had.'",
        "'speaker_0': 'All right. Thank you. And thank you, Angela. Looks like this concludes. Unless you want to say yes, to say, okay, this concludes all of our.'",
        "'speaker_7': 'I have a summons up and I'm up.'",
        "'speaker_10': 'Oh, and you missed me, too. Did we miss you? Disappeared.'",
        "'speaker_0': 'Okay, Angela will do. Dr. Sussman, go ahead.'",
        "'speaker_4': 'Thank you, Mr. President. I also thank you for bringing this up. Councilman Flynn, I also wanted to clarify, because I received an email about this of a concern of spending taxpayer dollars on these kind of incentives. But I want to make it very clear that these are not taxpayer funds paying into the incentive fund or the reimbursement'",
        "'speaker_4': 'for marketing, which I could be correct. Yes. These are Denver airport funds that are not tax supported. Thank you.'",
        "'speaker_0': 'All right, Councilman Cashman.'",
        "'speaker_7': 'Yeah, Angela, I was just wondering, is this with every new nonstop or some or how is this applying?'",
        "'speaker_4': 'The these are for new airlines, new international service and new domestic service.'",
        "'speaker_7': 'Okay. Do you know the last time we used this, by any chance?'",
        "'speaker_4': 'We have used this for the Lufthansa to Munich. We've also used it for Air Canada to Montreal. We have some new ones coming online. We have Edelweiss to Zurich. And so this is.'",
        "'speaker_8': 'A common.'",
        "'speaker_4': 'Practice, not only with Denver International Airport, with most.'",
        "'speaker_10': 'Airports.'",
        "'speaker_7': 'Thank you very much. Thanks, Mr..'",
        "'speaker_0': 'Prime. Councilman Andre, I missed you earlier because you plugged in. Do you want to go in?'",
        "'speaker_10': 'It's on a different bill, so I can wait.'",
        "'speaker_0': 'Oh, okay. Councilman Espinosa? Yeah. I just would like to request, if possible, that the airport provide sort of offline, sort of accounting for the last five years for this type of incentive. Because to to my colleague's point, this is airport money.'",
        "'speaker_0': 'But there are other things, other issues that are labor related and stuff like that, where we're also talking about simply airport money and yet we don't have money for those things, but we do have money for incentives like this.'",
        "'speaker_0': 'So I'd like to really understand the sort of magnitude of what we've been giving to the airlines.'",
        "'speaker_4': 'I mean, I just want to make note that this is this particular flight is something that we've been working on for the last decade. And these are really.'",
        "'speaker_8': 'Economic.'",
        "'speaker_4': 'Generators for not only for our city, but for Paris. And so they generate hundreds of millions of dollars of tourist income and that sort of thing. So it's we definitely get a return on investment on these.'",
        "'speaker_0': 'Yeah. And so when we have, if we ever have that important that, that, that, that employment argument, I would fully expect the, the airport to be to be able to articulate why it's more important to have airlines than than than than, you know, increased compensation for people that work for those airlines.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thanks. All right. I think we're done here. Councilwoman Ortega, did you have another?'"
    ],
    "Contract with Hensel Phelps Construction Co. for National Western Center Campus Horizontal Portfolio.": [
        "'speaker_10': 'But I just wanted to make a comment on Council Bill 587 on page eight.'",
        "'speaker_11': 'Can you pull that up.'",
        "'speaker_0': 'Madam Secretary? Five what?'",
        "'speaker_10': '587.'",
        "'speaker_0': '587. Okay. Go ahead.'",
        "'speaker_10': 'Thank you. This is the horizontal contract for National Western Center. And I just wanted to state that. There have been several of us on the States who have been working on ensuring that we have a targeted hire program that will put people to work who live along the corridor, but also try to get them connected to apprenticeship'",
        "'speaker_10': 'opportunities. These are livable wage jobs that have a career path. Many people in this neighborhood, in this area of town are being displaced as a result of a lot of construction activity. And for those who can take advantage of higher paying jobs, can have the choice to stay in their neighborhood as opposed to being displaced.'",
        "'speaker_10': 'So I just want to say thanks to the national western team and folks in the mayor's office for ensuring that we have a solid commitment to a local targeted hire program. Not only on National Wester, but we will see the same thing on our bond projects and hopefully eventually on the build out of the gates at the'",
        "'speaker_10': 'airport, in the build out that will be seeing at the Great Hall. So I think it's it's critically important. The other piece of this is they have committed to a community benefit agreement as part of the National Western Project with the adjacent neighborhoods there.'",
        "'speaker_10': 'I'm serving on a committee that's working on the 1909 building, which is the oldest building on the site. Folks from the neighborhood are very engaged in that process. They have a consultant that has talked about a public market.'",
        "'speaker_10': 'And one of the most critical pieces of that is they've got to be they have to have that community not only involvement, but play a role in many of the businesses and whatnot that make public markets successful around the country.'",
        "'speaker_10': 'When you supplant them with private sector businesses and you have, you know, your chains and chain businesses and whatnot, they are not as successful. And any of you who traveled around the world and around this country know that the public markets that are successful, like Pike's Market and Faneuil Hall in Boston, are what they are because of'",
        "'speaker_10': 'that community role. So I just want to say to all the folks who have been working on this that this is an important element of the work that's moving forward with National Western. As they begin to start the construction will see the site prep happening.'",
        "'speaker_10': 'But as we start seeing buildings come out of the ground, these pieces become really important for the folks in the adjacent neighborhoods. So thank you, Mr. President.'",
        "'speaker_0': 'Yeah, thank you. And thank you for talking about that. And, Councilman, commit yourself. You guys all have been working hard on that. And I want to thank the National Western team for putting that together. We feel like this is going to have an impact for the next decade to 20 years of folks in our neighborhoods.'",
        "'speaker_0': 'And so thank you all so much for your hard work. Okay. I think this concludes. Am I missing anything? Going once. Going twice on the dais. All right. Great. This concludes all the other items that need to be called out.'",
        "'speaker_0': 'All of the bills for introduction and order publish. We are now ready for the black vote on resolutions and bills. On final consideration, council members. Remember, this is your last. Remember, this is a consent or block vote. You will need to vote.'",
        "'speaker_0': 'Otherwise it's your last chance to call an item for a separate vote. Councilwoman, can we please put the resolutions for adoptions and the bills for final consideration from final passage on the floor?'",
        "'speaker_8': 'Yes, Mr. President, I move that the final following bills and be placed on final passage and the resolutions be adopted. 18 All series of 2018 7282 539 five 4581 606 ten 611 527 534 538 559 five 6569 607 525 526 536 537 587 590 7603606609 352 523 524 529 five 3532 533.'",
        "'speaker_8': '535 565 568578 584. 580 5601602. 442 428. 471. Four. 85. 427. And that's the last one.'",
        "'speaker_0': 'All right. Madam Secretary, I think we just missed one. Is that correct? Just the 42?'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Okay. You just said 82. That's okay. Just for the record, for 82. But we are ready. It's been moved and seconded. Madam Secretary, Roll Call.'",
        "'speaker_2': 'Clark. Espinosa. Flynn. Gilmore. Herndon. Cashman. Can each I. Lopez. New Ortega assessment. Mr. President.'",
        "'speaker_0': 'I fully support voting in as results.'",
        "'speaker_2': 'Actually. 11 eyes.'",
        "'speaker_0': 'Yes, 11 eyes. The resolutions have been adopted as bills have in place upon final consideration and do pass tonight. There'll be a required public hearing of Council Bill 366 changes on the classification for 2065 South Cherokee Street in Oberlin and require a public hearing for council before 2021.'",
        "'speaker_0': 'Change zoning classification of properties bounded at 38th Street, Walnut, 40th Avenue and Union Pacific RTD right away in Elyria. Swansea. A one hour courtesy public hearing on Council Bill 561. Amend the Downtown Area Plan by establishing updated plan policies for the Central Platte Valley Area District.'"
    ],
    "Zoning Change for 2065 South Cherokee Street in Overland.": [
        "'speaker_0': 'The Council members please refrain from profane or obscene speech. Direct your comments the Council as a whole and please refrain from individual or personal attacks. Councilwoman, can each we please put Council Bill 366 on the floor?'",
        "'speaker_8': 'Yes, Mr. President. I move that council bill 18 0366 be placed upon final consideration and do pass.'",
        "'speaker_0': 'All right. It has been moved in second it. All right. The public hearing for Council Bill 336 is open. May we have the staff report?'",
        "'speaker_8': 'Thank you, Mr. President and council.'",
        "'speaker_4': 'I'm Liz Weigel.'",
        "'speaker_8': 'With Community Planning and Development.'",
        "'speaker_4': 'The map amendment before you today is for a 2065 South Cherokee Street.'",
        "'speaker_8': 'It's located in Council District seven in the Overland neighborhood.'",
        "'speaker_4': 'And the request is to go from IAU oh two, which is an industrial district to Sierra eight, which is a residential mixed use district. It's located just north of Evans Avenue on Cherokee Street.'",
        "'speaker_8': 'And it's approximately 31,000 square feet.'",
        "'speaker_4': 'It's occupied currently by two industrial buildings, but is vacant, and the rezoning would allow redevelopment with a mix of residential.'",
        "'speaker_1': 'And commercial uses.'",
        "'speaker_8': 'Again, the request is for six eight, which is.'",
        "'speaker_4': 'In the urban center neighborhood context. It's a residential mixed use district that allows us to eat stories. This district allows a mix of uses on the ground floor, but the upper stories are reserved for residential and lodging. The existing zoning is I.A., which is a light industrial district.'",
        "'speaker_4': 'It also has the YOU oh two overlay, which is for billboard uses. There are no billboards currently on the site. It's generally surrounded by a year or two. There is also some residential zoning to the east and south and commercial zoning and mixed use zoning on Broadway.'",
        "'speaker_8': 'And near the Evans station. Here is land use map.'",
        "'speaker_4': 'As I mentioned, the subject property is currently vacant. There industrial office and parking uses surrounding it and a brewery just across the street. And there are mix of residential uses again in following the zoning districts to the east and south in commercial uses along Broadway.'",
        "'speaker_4': 'These images show the site and the uses around it. Generally low scale industrial.'",
        "'speaker_8': 'Buildings and open parking areas. There is a view playing the Washington Park Mountain View playing in the area.'",
        "'speaker_4': 'Though the height that would be allowed here is above 110 feet. That is allowed by the eight story district. The the rezoning went to planning board in April, where they voted unanimously to recommend approval. And we also have a letter of support from the Overland Park Neighborhood Association, which is included in the application.'",
        "'speaker_4': 'There are five review criteria that the zoning code puts forward. The first is consistent consistency with adopted plans. There are five adopted plans.'",
        "'speaker_8': 'In this area.'",
        "'speaker_4': 'And I'll go through those. The first is comp plan 2000, and there's a number of strategies that this would be consistent with. Most of these recommend infill and mixed use development. Excuse me. Secondly, we have Blueprint Denver and the.'",
        "'speaker_8': 'Land use concept here is transit oriented development, which recommends a balance.'",
        "'speaker_4': 'Of mix of uses and basically mid to high density.'",
        "'speaker_8': 'Development close to transit, which.'",
        "'speaker_4': 'We have the seven station here. It's also in an area of change which is recommended for it for places that we should direct growth. Blueprint. Denver includes street classifications cherokees and designated local and even station is a mixed use arterial.'",
        "'speaker_8': 'And an enhanced transit.'",
        "'speaker_1': 'Corridor.'",
        "'speaker_4': 'The proposed rezoning is consistent with the Blueprint Denver recommendations. We also have three neighborhood plans. The first is from 1993, which is the Overland Neighborhood Plan. It recommends that commercial industrial businesses see more investment. This area was still at the time identified as an industrial area.'",
        "'speaker_4': 'It also recommends supporting light, rail and neighborhood access to it. The Shattuck District plan was from 2003. It has a vision for a mix of housing, employment and services and also recommends putting these older commercial industrial parcels into more productive uses, which would be consistent with what this district would allow.'",
        "'speaker_8': 'The Evans stationary plan is our most.'",
        "'speaker_4': 'Recent plan, and that's from 2009. It has a vision for transit oriented development around light rail. It really recommends thank you. Transformation of this area from industrial and commercial to more of a mixed use community with active and pedestrian oriented uses.'",
        "'speaker_4': 'It specifically calls out this area as mixed use residential for the primary uses intended to be residential and office and retail it would be allowed. So consistent with what that CRT district would allow. You have a primary residential use with mixed use as allowed on the ground floor.'",
        "'speaker_4': 'It recommends a mix of housing types and a more active ground floor in urban form. Seven Stationary plan also recommends heights, and this area is recommended for a height of eight stories, and it's specifically calls out that the area is adjacent to the rail tracks would be more appropriate for taller buildings.'",
        "'speaker_4': 'And this is consistent with what is proposed with the Sierra X8 district. So the CPD does fine with the adopted plans. The rezoning is consistent with all five of those. Further, the the district would result in uniformity of district regulations and would further public health, safety and welfare by adopting or by implementing our adopted plans.'",
        "'speaker_4': 'The application identifies and staff agrees with that. There are several change or changing conditions in the area. This includes new residential units and some commercial revitalization that both demonstrate the emerging mixed use character that was envisioned in the neighborhood plans.'",
        "'speaker_4': 'Further, we find that the rezoning is consistent with the urban center neighborhood context and the mixed use, the residential mixed use zone district intent. So with that, CPD recommends approval based on finding that all the review criteria have been met.'",
        "'speaker_0': 'All right. Thank you. Thank you, Liz. Excellent presentation. We have four speakers this evening and I'm going to ask I know we have staff on this first row here. I'm going to ask you all to. Find another seat, please.'",
        "'speaker_0': 'Did I do that politely? Okay. All right. In four speakers. Come on up. Steve KURTZ, Bob Breck, Jesse Paris and chairman say coup. Mr. KURTZ, you are first with 3 minutes.'",
        "'speaker_7': 'Thank you. Council members, thank you for hearing us tonight. My name is Steve KURTZ and with LCP Development and I'm here with an associate Bill Breck, and we'd like to answer any questions you guys may have later on.'",
        "'speaker_0': 'Great. Thank you. Thank you. All right, Mr. Bob. Eric.'",
        "'speaker_9': 'My name's is Brick. I'm here.'",
        "'speaker_7': 'With Steve. I'm available to answer any questions you guys have.'",
        "'speaker_0': 'Great. Thank you. Jesse Paris.'",
        "'speaker_13': 'Good evening. Members of council. My name is Jesse Paris. I'm with Black Star Examiner for self-defense in Denver Homicide Law. I have two questions about this development. How many of these units are actually going to be affordable? Between zero and 30% am I?'",
        "'speaker_13': 'And this was planned out 15 years ago. So this seems like another gentrification move by way of city council and the business planners. So I just need clarification of how many of these units for this development are going to be affordable.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Paris. Chairman Sekou.'",
        "'speaker_9': 'Yes, my name. My name is Chairman Sekou National Action Movement, founder, organizer representing poor, working, poor, homeless, senior citizens and youth of the city. We enthusiastically support this. Ordinance change. For our folks that we represent. It is our hope as these projects go forward that we're included in the construction and also in terms of sub contractors being'",
        "'speaker_9': 'able to come up in this and partner with major corporate merger contracts and also jobs, jobs, jobs, jobs, jobs, jobs. We need jobs. Now the city is doing great in its unemployment rate, so it seems. But in the black community, we have chronic unemployment up to 60% for the last 15 years.'",
        "'speaker_9': 'Folks have looked the other way. And if that was applied to the white community, it would be a crisis. But yet things go unsaid and undone down here. And we get lip service about change that never happens. Because I know as well as everybody else knows, this is a very slow, grinding process over a long period of'",
        "'speaker_9': 'time, especially when folks don't want to do it in the first place. So I'm counting on General Patton here. For the clerk to marshal us in and make this a project that the city and all the communities can take pride in.'",
        "'speaker_9': 'And I know that, Councilman. New has been a champion in advancing the cause of minority black subcontractors and women and brown people. So in closing. It takes teamwork to make this dream work. And without your. We don't stand a chance in this thing.'",
        "'speaker_9': 'Because you are the ones we're counting on to carry our interests forward. So thank you very much for your time and. Good luck.'",
        "'speaker_0': 'All right. This concludes our speakers questions by members of council. Councilwoman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. I just wanted to ask the applicant, when you came to the city, if you were asked a question about the proximity to rail, was that a question on the application form you were asked to fill out?'",
        "'speaker_10': 'And have you had any conversations about the the close proximity to rail and whether or not you're expected to do anything to address buffering or whatever? I see there is a site to the West and I'm not sure, you know, if you own that or if somebody else is proposing to develop on that site at some point'",
        "'speaker_10': 'in time in the future. So can you just speak a little bit to that?'",
        "'speaker_7': 'Sure. Councilman Ortega We have considered that from a marketability standpoint of the site, there is a building planned. Not at the moment, but the site to the west of us will have an eventual structure on it, probably about the same size.'",
        "'speaker_7': 'We also have some experience in Inglewood developing along the tracks in Inglewood, where we have actually employed acquisitions or sound consultants to look at the noise that's generated from the rail and Santa Fe Drive in that area too tends to be a little bit more constant than rail is through that analysis.'",
        "'speaker_7': 'We've designed or specified windows that have a higher STC rating or a sound transmission resistance. So at this point in time, going through the specifications of the project, we're looking at alternatives and window manufacturers to address that issue for the residents who live in the building.'",
        "'speaker_10': 'Okay. So when you came to the city, did they talk to you at all about just mitigating that if there were to be an incident on the rail lines that carries cargo? And as you know, there's a lot of petroleum products that travels on that corridor.'",
        "'speaker_10': 'Very much the same as some of our other corridors in the city. Right. This is something the city is starting to address. And I'm just trying to find out if they've had conversations with you. You know.'",
        "'speaker_7': 'We did not. Okay.'",
        "'speaker_5': 'Specifically to that.'",
        "'speaker_10': 'All right. And it may be that the site to the west is far enough that you don't need to do it with this property. But if you're looking to build on that site to the west, they may ask you to address it.'",
        "'speaker_10': 'Okay. When you get ready to do something with that site.'",
        "'speaker_1': 'Thank you. Okey doke. Thank you. Thanks.'",
        "'speaker_10': 'I think that addresses my questions. Thank you, Mr. Wright.'",
        "'speaker_0': 'Yeah, thank you. Oh, Councilman, you.'",
        "'speaker_7': 'Ought to thank Mr.. Oh, ask the.'",
        "'speaker_0': 'Question. Applicant. Yeah. What do you guys want to.'",
        "'speaker_7': 'Just wanted to give you an opportunity to tell Mr. Parrish his question about the affordability of the project. Could you talk a little bit about how that's going to be raised? Absolutely.'",
        "'speaker_9': 'So we do not have any units that are. Income restricted so that there won't be any units available in.'",
        "'speaker_7': 'The 0 to 30% army range. As far as affordability.'",
        "'speaker_9': 'Goes and what we're doing to address some of those concerns is we are certainly participating in the affordable housing linkage.'",
        "'speaker_5': 'Fee. This project's a little bit.'",
        "'speaker_9': 'Over 100,000 square feet.'",
        "'speaker_7': 'The fee is a dollar 50 per square foot, so it's $150,000 will be paid to the city into that fund. And we're proud to participate in that. Other affordability actions that.'",
        "'speaker_9': 'We're taking, as we've designed a number of units in this building to be small.'",
        "'speaker_7': 'Studios. So we have units ranging from about 437 square feet to 570 square feet that comprise nearly 50% of the entire project. And we're doing that with the goal in mind to be able to allow residents to achieve a more affordable gross price point.'",
        "'speaker_13': 'And still have their own apartment and a well, amenities.'",
        "'speaker_7': 'Building close to transit, etc.. Thank you very much.'",
        "'speaker_0': 'All right. Thank you, Councilman. Counselor Flynn.'",
        "'speaker_9': 'Thanks, Mr. President. Let me also ask, was there a study done of the soil conditions there because there was a tin manufacturing facility. Is this site suitable for residential development? Have you been able to certify that?'",
        "'speaker_7': 'Yes. As you're familiar, the Shattuck project was just to the north. A lot of uranium byproducts on it. We've done quite an extensive study on the site from an from a commercial and residential suitability standpoint. And miraculously, it is very clean.'",
        "'speaker_7': 'Actually, it surprised all of us when we went through the study. I can drill into the detail for you, but there was a little bit of chromium on the site which exceeded a residential level. But none of the site right now is going to be below grade and all of the residences are going to be three stories'",
        "'speaker_7': 'above grade. So there's very a lot of isolation between the soil. We're not going to excavate a lot of the soil, and.'",
        "'speaker_0': 'It's.'",
        "'speaker_7': 'Clean by all standards for residential commercial development.'",
        "'speaker_9': 'Okay. Thank you. That's all.'",
        "'speaker_0': 'Okay. Councilman Espinosa. Beau I sort of want to follow up on councilman news question mostly because this is an area that is sort of outside the urban core a little bit and may or may not have the demand I mean, the demand for rental rates that some other areas of town and maybe I don't know, I'm starting'",
        "'speaker_0': 'to ascertain that because of where it's at. Do you have a sense about what that 437 square foot unit would go for right now?'",
        "'speaker_5': 'We believe.'",
        "'speaker_7': 'You know, we can rent that 437 square foot unit for around 1300 dollars a month.'",
        "'speaker_9': 'We built some similar units in a project.'",
        "'speaker_7': 'Up at 35th and Larimer, and those units were.'",
        "'speaker_9': 'Actually as small as 335 square feet. They were our most affordable units in the project we were leasing in 2016. We started leasing those at $1,050 per month, and they were the first.'",
        "'speaker_7': 'Units.'",
        "'speaker_9': 'To lease.'",
        "'speaker_0': 'Okay. I appreciate the candor in that response, because that's that's not a number that's easily swallowed by a lot of people here in the city that are looking for affordable housing. But I think it does speak to the level of the problem that we've been consistently trying to face.'",
        "'speaker_0': 'And that's not that's not on you. That's on our success as a city. So thank you. All right. Seeing no other questions. Public hearings now closed. Comments by members of council council president pro tem Jillian Clark, please.'",
        "'speaker_7': 'Thank you, Mr. President. You know, I think thank you to staff for laying out how this meets the criteria. I think it does meet it and I will be supporting it. I think, you know, this part of town is facing, as all of Denver is, but this is a part of town that is near and dear to'",
        "'speaker_7': 'me, is facing intense development pressure that is leading to a lot of things happening right in our neighborhoods, whether they're historically designated or they feel historic and they're not designated. A lot of angst, a lot of things going on.'",
        "'speaker_7': 'And this is one of those areas where the community has really come around a vision and a plan for where we can fit more housing and we can fit the demand of the 10,000 new people who are coming to Denver every year.'",
        "'speaker_7': 'And yet it has taken a little while for it to take off. But when you look at the big picture here, this is right next to what was the most polluted piece of land in all of Denver. And because the community worked really hard to get that cleaned up, now we have soil that is clean enough to'",
        "'speaker_7': 'build residential, not just on on your property that was next door to it, but on the actual Shattuck site that those are coming out of the ground and leasing right now. And now looking at not only housing, but the density of housing, you are one block to the light rail station and you don't have to cross EVANS'",
        "'speaker_7': 'You walk underneath it and you'll be one and a half blocks from the Jewel Bridge that voters approved for funding for in the bond that will then connect to the entire South Platte River Trail system, to the Ruby Hill Pavilion and Ampitheater and Ruby Hill, our third largest regional park.'",
        "'speaker_7': 'This is an area that can really accommodate more people, and I think it's exciting to finally start to see some of those pieces come together. I also really want to thank the applicants for working very closely with the neighborhood.'",
        "'speaker_7': 'I know that there were multiple parcels around here and on this block where different things were were contemplated. And at one point there was a proposal to go higher than what we had an adopted plan for. And while our overall plan hearkens back to 1993, which begs the question of is anything in there still relevant for today'",
        "'speaker_7': '? And we have across the street, across Broadway and Platte Park, no adopted neighborhood plan. We do have a stationary plan that is relatively recent that the community did work very hard on. And and so to have someone go to the community and be open to listening to that versus the other proposal that wasn't you guys came forward'",
        "'speaker_7': 'that that was kind of pushing that I also appreciate because again there is an opportunity for density here that the neighborhood is very supportive of, that the community is supportive of putting it here. That really is could not be better situated for a place to live.'",
        "'speaker_7': 'And so working with the community to make sure that that still fits within what they want and staying true to, you know, one of our criteria here, which is being directly in line, I mean, it is it's not every day that we get a rezoning where it specifically has a map that not only calls out the kind'",
        "'speaker_7': 'of zone districts that should be here, but the exact it doesn't even give a range. It doesn't say this should be between five and 12. It says eight stories right there. And so to come forward with an application that's in line with that not only means that it meets the legal criteria, but I also appreciate the effort'",
        "'speaker_7': 'to work with the community and to help deliver on the vision that the community has come up with at exactly what they were asking for. So I will be supporting this tonight, and I hope that my colleagues will as well.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Thank you. Council president, pro tem. All right. See, Councilman Espinosa. Yeah, I just I don't think I brought it up on this particular rezoning in Ludie, but I do want to say, I think I brought it up here and I do want to say it again that the entitlement to go from industrial a to.'",
        "'speaker_0': 'Our X8 is a considerable amount of an entitlement that is granted for the fee that we charge, which is very minimal, $1,000 per acre or roughly there. There's some calculation based on square footage plus whatever you pay your architects and and zoning consultants to go through this process, which is not very much in the grand scheme of'",
        "'speaker_0': 'things. And so to get that entitlement, additional entitlement is a very, very low bar or cost. The good news here is that hopefully it's it's the person that speculated on the land some four years ago that will develop it and that value that is now going to be if this gets through, that value doesn't get siphoned out'",
        "'speaker_0': 'of the site and actually gets put into a project. But this is. This is this is the ongoing frustration that I have had since I've been on council, particularly for my 41st and Fox area. 41st anchor is my side, the sunny side side in an area that I represent which is massively gentrified and and what with this'",
        "'speaker_0': 'level of investment that we have made at these tods that is your public dollars. And Councilman Clark just explained how much more public dollars are going into bond projects surrounding this parcel. Your dollars, this is a considerable amount of public investment that will benefit the owners of these properties.'",
        "'speaker_0': 'And what I have been trying to articulate from day one is that we need better tools, better steaks and better carrots to get to address the affordable housing concern, which is now a legitimate concern for an area that was also like a lot of northwest Denver, very affordable for a long period of time.'",
        "'speaker_0': 'It now seems seems very clear at more than $3 a square foot for rental. It is not as attainable as it once was. And so I have spent two years trying to articulate a different way to address gentrification that would be pro-development, pro-development, and allow greater flexibility by the developer on a way to accommodate that plan is'",
        "'speaker_0': 'in the hands of Brad Buchanan as of a month ago. And I want everyone to know that that it is getting pushback because it is different. It is getting pushback because it is not the way we have done things historically.'",
        "'speaker_0': 'But I can tell you that I've spoken to developers and I'm going to reach out to you regardless of whether how this vote goes. Not for you to voluntarily take this on, but to vet this idea to see if there is, in fact, a way that developers could reasonably accommodate some of the help, address the concerns in'",
        "'speaker_0': 'a way that is more significant than a buck 50, a square foot. That's no laughing matter. That's $150,000 out of your pocket that you would not have had to spend two years ago. I get that. But that is not going to address our problem.'",
        "'speaker_0': 'And so where we have done great infrastructure investment in public infrastructure, I think we have the ability to look at this delta between what is it zoned for now? What is it planned for in the future? And how do we use that ability, that delta, that that capacity that we're planning for and building for to to drive'",
        "'speaker_0': 'more inclusive development because market rate. Is what the market is. You know, it will build the sort of neighborhood that it can support now. And if it declines, it will be that sort of neighborhood in the decline. And so how do we actually build more healthy, vigorous communities that are placemaking?'",
        "'speaker_0': 'Use this investment to to do that and to spur sort of a better sort of mixed economy that is healthier that you see in in the healthiest parts of our of our city. So that said, that is I want to be articulating that here because this is the exact sort of rezoning and scenario where this sort of'",
        "'speaker_0': 'idea makes the most sense is not apply to this rezoning. These are tools do not exist, so we can't ask. But I do want you to know that we should be and could be working on those things as a city.'",
        "'speaker_0': 'And we are not. And so with that, I will still I respect that the criteria has been met and it is as we face it today, I just wish we had better tools to address definite concerns in this city.'",
        "'speaker_0': 'Thanks. All right. Thank you.'",
        "'speaker_7': 'Councilman Clarke Tatum is president. I just want to you know, Councilman Espinosa brings up some really great points. I've I've had the opportunity to see some of these ideas in his office. I think they're really exciting. But I want to, you know, bring it back to again, not lose in that because that was kind of taking it'",
        "'speaker_7': 'to a macro level. But lose again, the micro in this where this community put forth this vision and not that we can't do other things there, but this is not displacing current homes. This is an industrial building that's currently vacant that will create more housing, which we desperately need at all income levels.'",
        "'speaker_7': 'But it also, again, this is a community that rallied around a piece of property that the company left and would have been completely unusable forever. And they rallied to work to clean this up with a vision that someday it would be clean enough and vibrant enough and have finally a public investment in things like rail and these'",
        "'speaker_7': 'bridges when it had been overlooked for so long that it could be a walkable community. And now you're going to have an eight story residential building across the street from Declaracion Brewing, one of the coolest places to hang outside on a patio and have a beer and eat, you know, something from a food truck.'",
        "'speaker_7': 'And that seemed impossible to the residents of Overland who have been involved with that neighborhood association for years and years. And so this will we continue to evolve what we need to do from a macro citywide and have more tools.'",
        "'speaker_7': 'This today does represent the fulfillment of the biggest. Best seemed impossible dreams that this community had 20, 25 years ago. And I just don't want to lose track of that, because as we as we go to these big picture things of what's happening right here.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_0': 'Yeah. All right. We got some more folks in the queue. Ortega and Lopez.'",
        "'speaker_10': 'Thank you, Mr. President. I can remember when we started development in the Central Platte Valley. The city built parks and opened the access to the floor of the valley by taking down our viaducts and putting in new roads.'",
        "'speaker_10': 'And we had this same conversation back then, and we created an ordinance that gave us the opportunity to ensure that we were getting affordable housing and developments across the city that became our inclusionary housing ordinance. We started by just doing them as one offs because we had developers doing the same thing, looking at industrial land and working'",
        "'speaker_10': 'to increase the density and the investment the city made was to attract part of that development because we wanted to expand downtown. Fast forward to today. We did not anticipate that we would be seeing the rapid investment in this city and the rapid gentrification that's occurring as well, which, you know, has resulted in many people not being'",
        "'speaker_10': 'able to afford to live in the city, both as homeowners and renters. And we have to be very intentional, and we have to look at the tools that we need to bring forward. We are the legislative branch, and we can do this.'",
        "'speaker_10': 'We know that Telluride exists, but at the same time, we know there are some things that we can do. And I think this involves having a serious conversation with our development partners in this city to look at how do we make that happen so that we, in fact, are a city that everybody can afford to enjoy and'",
        "'speaker_10': 'live in when we have service workers in this city who have to move as far away as Henderson because they can't find a place not only in Denver, but in some of our neighboring counties that have also become very expensive.'",
        "'speaker_10': 'Then we have to look seriously at how do we make this happen so that we are, in fact, a city for everyone. And so I would just commit to work with whoever is interested in helping us be part of the solution in a way that allows us to look at what those right tools are, that ensures that'",
        "'speaker_10': 'we do have that affordability and that we don't have service workers who at some point will choose to work closer to where they live. And then we're going to be struggling with how we keep doors open of some of the the businesses that rely on service workers from our hotels to our restaurants.'",
        "'speaker_10': 'We already know our restaurants can't get enough workers. Right. And I'm really concerned that as soon as Gaylord opens and we get ready to open the Great Hall at DIA, whether we can find those service workers to work at in the Great Hall.'",
        "'speaker_10': 'So these things are real and it impacts everybody. And so I just think it's an important conversation where we all need to roll up our sleeves and figure out what those right tools are that allow this to be a serious conversation that truly makes us a city for everyone.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. I really appreciate the dialog here. I think, you know, a lot of this just, you know. We can't vote in on a rezoning with a lot of the land based on a lot of these issues.'",
        "'speaker_5': 'Legally, we have to really look at it just as a zone district. We get that. There are criteria that we have to follow and there are criteria that, you know, ensure the due process of the applicants and the public and the hearing.'",
        "'speaker_5': 'That doesn't mean that. Folks cannot go above and beyond. Just because that's the bar, it doesn't have to be so low. In Denver. It is cliche. For us now certain to say we have an affordable housing crisis. We have a lot of crisis in the crisis is our everyday working people and especially people of color, can no'",
        "'speaker_5': 'longer live in the city where they were born and raised. And that is a crisis. And Denver, is it? There's development. Yes, development will happen. A development cannot happen irresponsibly. And I think, you know, as as we consider all of these on this this particular area and I think we've we've really looked at.'",
        "'speaker_5': 'Opportunities to really create smart urban centers and neighborhoods and really think of connectivity. You know, the neighborhood in which Councilman Clark speaks of is a neighborhood we'd all like to think our neighborhood would have access to. But it is only we can only go so far on council.'",
        "'speaker_5': 'The charter allows us only to go so far. And so that's why I'm asking the applicants and the public to make sure. You don't operate just when you hear the conversation in the dialog in this in these chambers and that they're not empty words.'",
        "'speaker_5': 'Now, we do have a crisis and it involves all of us, right? It's easy to say that no single drop believes it's to blame for the flood. But we can really, really, truly make something happen together if we have commitments.'",
        "'speaker_5': 'And that's what we're asking. I think that's what's coming out of these chambers is we're asking for commitments, even though it's not legally, we can't do a vote based off of it. These are just the issues that are at the mine and it really helps.'",
        "'speaker_5': 'To hear that on the front end and that kind of commitment. It eases the worries of the public and the council. I look forward to seeing something happen here that is that embodies that responsibility and development. Right. That that social aspect of it, that commitment to it.'",
        "'speaker_5': 'So with that, I know we have something else in the queue that is on the agenda, but uh, to, I just, I just, I just wanted to be able to say that, Mr. President, I think that's, that's, you know, it is a commitment that we all want to hear.'",
        "'speaker_5': 'Right. We look forward to seeing.'",
        "'speaker_0': 'Thank you. All right. Okay. See no other comments. This has been moved in second. Madam Secretary, roll call.'",
        "'speaker_2': 'Clarke Espinoza. Flynn Gilmore Cashman.'",
        "'speaker_4': 'I can eat.'",
        "'speaker_2': 'Lopez. I knew Ortega like Susman. Mr. President.'",
        "'speaker_0': 'I PCOS voting announce the results.'",
        "'speaker_2': 'Two are missing.'",
        "'speaker_0': 'You know, we have people hanging fire. See one more. There we go.'",
        "'speaker_2': 'Again. 11 eyes.'",
        "'speaker_0': '11 eyes, 366 as past. Congratulations. All right, Councilwoman, can you put 421 on the floor?'"
    ],
    "Zoning Correction for Properties near 38th and Blake RTD Station.": [
        "'speaker_8': 'Mr. President, I move that council bill 18 to 0 4 to 1, be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has.'",
        "'speaker_2': 'Sorry.'",
        "'speaker_0': 'A little slow here on the uptake. It has been moved and seconded the public hearing for council. Fortunately, one is open when we have the staff report. Andrew Webb.'",
        "'speaker_7': 'Mr. President, members of the Council, thank you. I'm Andrew Webb from Community Planning and Development here with a short presentation on this request for an error correction to a recent MAP amendment. This request is in Council District nine.'",
        "'speaker_7': 'It's in the coal neighborhood. This is the map from Rezoning Proposal 2017 0122, which was adopted on February 12th as Ordinance 2018 0015. This was the the base district rezoning for the 38th and Blake project. So it established the incentive overlay and the River North design overlay and it also updated some of the base zone districts so'",
        "'speaker_7': 'that they would work correctly as intended with the overlay after that. And I want to highlight here that that's shown in red here on this map. Is the is the subject property for this request. Right after the adoption of the of that ordinance, it was discovered that an incorrect notation on a legal description exhibit that went with'",
        "'speaker_7': 'that request had caused for one chunk about 8% of the total base district rezoning to be given the the wrong the wrong base zone district. So it's a zone district not intended. This proposal would rezone approximately 13 acres right there at essentially at kind of Blake and 38th from C annex eight that's urban center mixed use eight'",
        "'speaker_7': 'storey with the you oh two billboard overlay and then the incentive overlay and the design overlay would rezone this to IMX eight that is industrial mixed use with an eight storey base height and the and the same overlays would be applied.'",
        "'speaker_7': 'This request would essentially correct an error that was made and the process. This request was referred directly to the Land Use Transportation and Infrastructure Committee. It was approved as part of the consent agenda on May 1st. This is the process allowed for in the zoning code for errors that on the zone map that occur as a result'",
        "'speaker_7': 'of a of a rezoning 21 day posted notification was provided at the site. We also reached out to all RINO's associated with the area and we also reached out to property owners and have not received any public comments on this proposed rezoning in terms of review criteria.'",
        "'speaker_7': 'The original staff report to request a 2017 EIS 00122 is was included with your staff report and consistency with the review review criteria can be presumed by the Council's findings in the original rezoning case from February. So with that, CPD recommends approval of this correction ordinance based on a finding that all conditions have been met.'",
        "'speaker_0': 'All right. Thank you. All right. We have two speakers this evening. Turman Sekou, you're up first. 3 minutes.'",
        "'speaker_9': 'Okay. Chairman Sekou. Black Star Action Movement for self-defense. The issue with correcting this error. Is that it doesn't even begin to address. What is really taking place. It's more of a dot and cross in the two. And so you can't argue with.'",
        "'speaker_9': 'What is taking place here. Can't do it. And as Paul said. This thing that we got going on now is complex. Yes, very simple. And reminds me of a grandfather analogy that he gave me called The Breakfast of Champions Nest Egg in Eggs.'",
        "'speaker_9': 'And then that process of building that breakfast plate, the chicken made a contribution by putting the egg on the plate. And the cow had to die and put his ass on the plate in order for us to have an excellent value meal deal so that we would be fulfilled.'",
        "'speaker_9': 'So the question becomes, is city council chickens or are they cows? Are you going to put your ass on the plate for what you believe in, or are you going to be a chicken and go for the ultimate thing?'",
        "'speaker_9': 'Can we all get sick? Sekou. So in the process, don't interrupt me because I understand what you're getting ready to say.'",
        "'speaker_0': 'No, actually, I can't interrupt you. Don't. Don't cuss in here. Go ahead.'",
        "'speaker_9': 'That wasn't the cuss word. Yeah, it was. Which one was it? What I say. Or to my bad. Okay. So I thought it was in the Bible. You could use it. So here we go. What are we going to be about?'",
        "'speaker_9': 'Councilman Ortega has already made it clear we've been struggling with this state for a long time. But now we got some new fresh blood in now. And we've got other folks out now because this is it for them.'",
        "'speaker_9': 'This is it. So what's coming? What's really come? More of the same old, same old. Or something fundamentally different that will restore the faith in this body by the people. If we allow this process to continue and keep playing semantical legislative language games, we are guilty of the betrayal of the masses of the people who deserve a'",
        "'speaker_9': 'better way of life. And it's our job to eliminate that suffering and make it possible. So this city is for all of us, especially for the ones who've been born and raised here, who are systematically being excluded. There is no excuse to continue this process at all other than you are in bed.'",
        "'speaker_9': 'With the developers. And that you have agreed to a standard.'",
        "'speaker_0': 'Thank you, Mr. Speaker.'",
        "'speaker_9': 'Thank you. Jessie Pearce, the struggle of liberation.'",
        "'speaker_0': 'Jessie Pearce, you're up next. Thank you.'",
        "'speaker_13': 'But Jesse Paris. Black Star Action Movement for Self-defense in Denver homicide law. Because what has already been stated. We have a crisis. Denver, not so much an affordability crisis.'",
        "'speaker_0': 'Can you can you stay focused on this book right in front of you?'",
        "'speaker_13': 'That's that's the focus of this. Housing, this building code. My whole thing is if you're going to change the building code. Once again, how many of these units are going to be affordable or anywhere even close to affordable?'",
        "'speaker_13': 'Because affordable doesn't even seem to be in the language of these business developers. So this 1300 dollars for a 450 square foot apartment seem reasonable to you? Honestly, who can afford that? Think about that and then think about the rapid gentrification that is going on in all areas of the city.'",
        "'speaker_13': 'Now, somebody really needs to take a stand on this. So like cycles already stated are just going to keep allowing this to keep continuing to happen and happen continuously. So we have to keep coming to these meetings and keep asking the same questions.'",
        "'speaker_13': 'Where is the housing? Where is the affordability? You want to change these building codes, then make these neighborhoods where people that have been in these neighborhoods can afford to live in the neighborhoods instead of having to be pushed out, having to live in a whole different other city, different county, because they can't even afford to live in'",
        "'speaker_13': 'the neighborhoods that they work in. It's ridiculous. This this building code change is so they can put in a 16 storey building. Again, how many of the units in a 16 story building are going to be affordable? That is my question to the city council.'",
        "'speaker_13': 'Can I please get a straight answer from somebody? Thank you.'",
        "'speaker_0': 'Thank you. All right. Questions by members of council. Councilman Espinosa Yeah, I was looking at it and it was confused because the incentive overlay would apply to either zone district. So I'm assuming it has to do with the existing use.'",
        "'speaker_7': 'That is correct. So the the C-Max and the IMX districts were were proposed in this area based on current adopted plan policy for future land uses in these locations and also existing uses. And there were considerable existing industrial uses happening in these this 13 acre area.'",
        "'speaker_0': 'And that explains it. Thank you. Thanks. Councilman Ortega.'",
        "'speaker_10': 'Can you tell me how we found out that this was an error?'",
        "'speaker_7': 'Absolutely. So we worked our our department worked with our survey team on putting together the exhibits for this rezoning. And as you may recall, they were pretty extensive, many pages long. And after the adoption, our staff was going through and making sure that they were applying the correct zone districts to all of the affected properties and noticed'",
        "'speaker_7': 'that. And you'll see it in the in included with the staff report there's actually a copy of the of the exhibit that has the error. And it's it's one letter essentially in a sentence that that essentially resulted in that chunk of properties being given the wrong base zone district.'",
        "'speaker_10': 'Okay. Thank you, Mr. Council President. I don't know if you're going to speak to what the overlay did, but I thought that might be important too.'",
        "'speaker_0': 'Yeah, actually, I don't know if you want to.'",
        "'speaker_7': 'Sure. Yeah. I'm glad you asked about that. Councilwoman Ortega, the overlays actually address seek to address affordability by establishing base heights and then allowing additional height above that base height in return for some community benefits, one of which is increased number of affordable housing units included with the development.'",
        "'speaker_7': 'Great.'",
        "'speaker_0': 'Thank you. All right. Thank you, Councilman Ortega. All right, see in no other questions before this body. Go to comments by members of council. I'll start since this is the project that never gets completed and I'm just talking we we've been working on this for a long time and you guys have been doing an incredible job.'",
        "'speaker_0': 'And this is, you know, folks didn't know that we actually do have incentive incentives for affordable housing in our zoning code. But this is the first to actually, you know, increase that incentive. And so there was a question as a 16 storey building, how many affordable housing units will be in there with no money from the city'",
        "'speaker_0': '? There's actually a 16 story building being built now, and it's going to be between 27 and 35 units. And so really excited about that. Without this incentive, that building would have no affordable units would be all market rate.'",
        "'speaker_0': 'So I'm excited about this and excited to see if it's, you know, in the future how impactful it is, but also that we have great staff to to catch mistakes. And so I'm glad you guys were able to catch this.'",
        "'speaker_0': 'Councilman Espinosa, I'm trying to understand that. So we're they're building a building with 27 to 35 units with no subsidy. Yeah. Which project is that? It's the Mcwhinney project. Okay. Yeah, I have an address because I was going to give you a straight answer and say no, because it's always going to be cheaper to buy out to'",
        "'speaker_0': 'get eight stories. But maybe I stand corrected. I will research the Mcwhinney project and confirm that it in fact does not have any subsidy going into it whatsoever. The because those public dollars are your dollars, whether they're coming from through your income tax and back through HUD or through.'",
        "'speaker_0': 'Now the new property tax that we charge all Denver residents or through, you know, indirect routes as well. So my I just wanted to comment because I'm a little bit torn here. I did not vote in support. I voted in support of the 38th and Blake incentive overlay.'",
        "'speaker_0': 'But I did not support in in favor of the rezoning, the massive rezoning, because I thought it once again raised it squandered an opportunity for that to to truly value capture that difference between the industrial land uses and this now 16 storey capacity.'",
        "'speaker_0': 'This is different because this is. This is an error. It probably should it never should have been CMCs because it's industrial use on this. So I am torn because I would not have supported. But we don't have the option to go back to its original zoning.'",
        "'speaker_0': 'We're only optioning between a correct zoning for the uses or CMCs. So if you see me vote in support, it's because I'm correcting the error, not because I still think that was a good idea. Thanks. Yeah. And Councilman Espinosa, just want to make this clear, because I think in our public hearing, when we had this on February'",
        "'speaker_0': '12th, it was unclear. You can't really buy out of residential. Some of the buyout functions are in the commercial aspects. And so we're excited about this project to be right across the street from the the rail station and should be coming soon.'",
        "'speaker_0': 'So. It's been moved to the Second Amendment. Secretary, roll call.'",
        "'speaker_2': 'Clark.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Espinoza, I. Flynn, I. Gilmore I can connect. Lopez. I knew Ortega. I. Susman. Mr. President.'",
        "'speaker_0': 'I flew scores voting in US results.'",
        "'speaker_2': '11 eyes.'"
    ],
    "Update Downtown Area Plan Policies for Central Platte Valley - Auraria District.": [
        "'speaker_0': '11 eyes. 421 passes. Thanks for your hard work on this. Now we got it. Got to. Right. Okay. For the last bill of the night. 561 Councilman, can you please put it on the floor?'",
        "'speaker_8': 'Yes, Mr. President, I move that council bill 18 20561 be placed upon final consideration and do pass.'",
        "'speaker_0': 'All right. It has been moved. And second, it hasn't. The one hour courtesy public hearing for council Bill 561 is open. May we have the staff report live? Thank you.'",
        "'speaker_4': 'Hello. Good evening. Members of City Council and Louisianians from Community Planning and Development. And I'm joined here today with my colleagues a barge, Sarah Course, Ellis TV and Steve Nally. We are here to present to you the downtown area plan amendment.'",
        "'speaker_4': 'This amendment is to the 27 downtown area plan, which covered the area outlined in Dash Purple. However, the 2000 area plan provided limited guidance for future development of Central Valley Area District, which is the area highlighted in yellow and is bounded by Area Parkway, Speer Boulevard and Interstate 25.'",
        "'speaker_4': 'There are also two additional small area plants that encompass portions of this plant area. Those are their area west stationary plant of 29 and the Jefferson Park neighborhood plant of 2005. The Downtown Area Plan Amendment will supersede these plans for the coverage of Central Valley Area District.'",
        "'speaker_4': 'Only the dominant existing uses within the plan area are the Pepsi Center, which is separate from village gardens by the consolidated main line and the light rail. There we have the two light rail stations and also along Water Street there's a downtown aquarium, the children's museum.'",
        "'speaker_4': 'And throughout this plant area there are a few commercial buildings, two residential buildings, and of course, the South Park River, shown in blue, an adjoining park shown in green. This plan area contains over 60 acres of surface parking.'",
        "'speaker_4': 'And on a more satirical note, in 2017, Denman won a national award for the worst coverage of surface parking, which of course, is not an award we care to receive as a city and to provide. To prove this point, the Street Blog USA use an aerial of this portion of the city.'",
        "'speaker_4': 'And this is an aerial of 1933 for the plant area. And you can see a multitude of train tracks here. You're shown here. You can see the the roundhouse railways roundhouse here. And what's probably the most interesting is that along Seventh Street, which is right here, what you see is a span, a bridge that span across the'",
        "'speaker_4': 'Hudson River and the train tracks connecting Water Street to Colfax. And so within this plan area, we've had an extensive 12 month planning process which included seven steering committee meetings, three public meetings, one public design charrette and two online surveys.'",
        "'speaker_4': 'In addition to, we've held multiple meetings with neighboring R.A. plan area residents, various boards of the downtown Denver partnership with the Area Campus Higher Educational Board and with the Urban Land Institute, just to name a few. We've also had numerous, numerous publications in our community planning a development newsletter and multitude of social media blasts, including Instagram, Twitter'",
        "'speaker_4': 'and Next Door. Throughout our public outreach, people told us that the assets of this plan area were the South River light rail stations and being part of the downtown. The public was, however, concerned that about this area's lack of connectivity to surrounding neighborhoods.'",
        "'speaker_4': 'Therefore, creating an opportunity for a great downtown neighborhood with an efficient and well-connected multimodal network was identified as one of the top priorities, and due to its industrial past, environmental contamination was identified as a threat to future development.'",
        "'speaker_4': 'And though the public saw this area as an opportunity for development of a great downtown neighborhood, they were also concerned that the future development may not realize to areas full potential. With each public outreach. There were a few common themes that came up time and time again.'",
        "'speaker_4': 'People told us that what they want to see are active streets with lots of retail activity, that is, cafes and retail spillover, as well as active public spaces and interactive features. And what we heard from the public was not only to activate the streets with ground floor activity, but also the riverfront.'",
        "'speaker_4': 'People want to see restaurants with outdoor seating along the river, as well as pedestrian plazas and promenades. And when we asked what would attract families to live downtown, we were told that access to affordable housing and access to daycare and elderly childhood education and two grocery stores were highly important regarding what new development should embody throughout this'",
        "'speaker_4': 'plan area. The main common themes were well connected pedestrian promenades and distinctive and iconic design and architecture. So these common themes and all other public feedback were then categorized into the five vision elements which were established in the 2007 Downtown Area Area Plan.'",
        "'speaker_4': 'Those vision elements concentrate on creating a prosperous, walkable, diverse, distinctive and green downtown Denver. The original focus topics under each vision element remain standing and appropriate to this plan area, and those are highlighted are in gray. But in addition to those, we've included new topics that are specifically applicable to this plan area which are shown here in'",
        "'speaker_4': 'bold. My colleagues, Ellen Sara, will dove into the vision elements in more detail as they go through the vision elements. They will be showing a series of mapping diagrams. And these programs show one potential scenario of how to implement the recommendations within this plan.'",
        "'speaker_4': 'They're intended to be illustrative, as many of them would require additional detail, study and master planning. I'm Alice, Stevie, and I'm going to talk about the first two vision elements. So the prosperous vision element is about increasing access to opportunity and a great quality of life in a neighborhood adjacent to the downtown core.'",
        "'speaker_4': 'So the main recommendation here is for mixed use development. So this provides a variety of everyday needs all in one area. So the red color on the map here is the downtown land use, which is mixed use. So the plan recommends a variety of uses that create an active neighborhood with active uses focused along the river and'",
        "'speaker_4': 'along particular streets, which we're calling active corridors. And those are shown in yellow hashing. So the amendment also promotes access to economic opportunity by creating an environment that encourages a range of businesses to flourish. So the walkable vision element is about creating a robust transportation network that prioritizes walking, bicycling and transit and is connected to the surrounding'",
        "'speaker_4': 'neighborhoods. To do that. It recommends extending the existing street grid from the surrounding neighborhoods. Then it recommends filling in those connections to create an intimate, walkable street grid. So the plan also recommends providing new connections to and within the plan area, including, you can see a new North-South connection here across the consolidated main line, the river and'",
        "'speaker_4': 'I-25, and then an east west connection over the river and I-25. So this diagram, as Lily mentioned, is an illustration of intent of a 20 plus year vision rather than a specific master plan. But one thing that I want to point out on here.'",
        "'speaker_4': 'So the Pepsi Center is likely to remain at this location. However, if it does ever relocate at some point in the future, this diagram indicates that the small block size that the amendment recommends should extend through the existing footprint.'",
        "'speaker_4': 'So some of the key streets and connections in this 20 year vision already exist, but they need to be updated to reflect the desired character and function of streets in the plan. So these include I won't go through all of them, but improvements to the 22/23 Avenue.'",
        "'speaker_4': 'So from conversations with the community, the amendment prioritizes improving this bridge over age 25, particularly for bikes and pedestrians. And that's shown in letter and on letter A here. It also recommends similar improvements to Water Street. Shown letter B and then it talks about a lot of general improvements to the streets themselves as well as the crossings'",
        "'speaker_4': 'of spirit in an area. So the vision for the amendment is to have a comprehensive pedestrian network with comfortable and convenient sidewalks and crossings on all streets. On top of that, there would also be enhanced facilities with additional right of way that's dedicated to things like pedestrian wayfinding, safety and esthetics.'",
        "'speaker_4': 'And these would be along key routes that we're calling priority pedestrian connections. So you can see there's a North-South connection here, and then two East-West connections, one on either side of the consolidated main line. Similarly, the plan recommends a company recommends comprehensive bicycle facilities throughout the plan area that are safe and comfortable for riders of all ages'",
        "'speaker_4': 'and abilities. And finally, transportation demand management or TDM. So TDM is a suite of strategies that aim to reduce automobile trips by incentivizing people to use other modes of transportation. Implementation of an extensive and effective TDM strategy is going to be a critical element of the success of the plan area.'",
        "'speaker_4': 'There will need to be a whole suite of TDM strategies. But I want to mention two key ones here today. So the first is removing minimum parking requirements and replacing them with parking maximums. And the second is providing excellent transit.'",
        "'speaker_4': 'So that means in this case, increasing transit service to and through the plan area. And it also means creating mobility hubs, which is a type of transit oriented development around existing light rail stations. So as these two examples illustrate, TDM includes a very broad range of strategies and they and they will have equally broad implementation approaches.'",
        "'speaker_4': 'For example, something like parking maximums will be implemented through zoning, while excellent transit will involve RTD, public works and the private sector. So part of implementing TDM will be figuring out how and where those efforts are coordinated. So that wraps up walkable and I'm going to pass it off to Sara to talk about diverse.'",
        "'speaker_11': 'Hello. I'm Sarah, of course. And I'll walk through the next three vision elements. So the next one is a diversity vision element, and it has the goal of creating affordable, equitable and diverse communities. This vision element has recommendations for providing affordable and market rate housing.'",
        "'speaker_11': 'Throughout the planning process, we heard it should be a priority to provide affordable housing and especially within the plan area. To achieve this, the plan goes above and beyond current affordable housing policies by recommending strategies that include allocating affordable housing within the plan area and encouraging the duration of affordable housing to go beyond the current time frame'",
        "'speaker_11': 'typically required. We also heard from the community that equitable locations of affordable housing should be encouraged to achieve this. The plan recommends dispersing affordable units so they are appropriately located throughout the plan area and to especially avoid any concentrations along the consolidated mainline or the Cmll or I-25.'",
        "'speaker_11': 'In addition to this, there was an expressed need to provide a variety of housing types to accommodate different household types. The plan recommends that future development should accommodate different household types by providing a variety of unit types and sizes.'",
        "'speaker_11': 'Lastly, the diversity of Vision Element recommends providing services, facilities and amenities to support families, seniors or those with disabilities. The next vision element is a distinctive city. The distinctive city vision element has a goal of creating distinctive places with unique characteristics and qualities that can be expressed through the built environment.'",
        "'speaker_11': 'Throughout the planning process, we heard it was important for future development to include a variety of building types and sizes, including higher intensity development, while also creating a comfortable public realm. To accomplish this, the plan provides recommendations for a variety of building intensities, which could be a combination of different building heights, mappings and forms to achieve a'",
        "'speaker_11': 'comfortable and human scale environment. To achieve this variety, the plan recommends new or updated zoning standards. For example, a new zone district could be created to implement the plan specific recommendations and to achieve the desired building intensity. The plan also gives direction for appropriate locations of higher or lower building intensities.'",
        "'speaker_11': 'The highest building intensity is more appropriate, closer to the consolidated mainline and near the two light rail stations. And the lowest intensity of buildings is recommended in areas that are adjacent to or near the South Platte River and existing buildings, especially those buildings along Aurora Parkway and Water Street.'",
        "'speaker_11': 'The plan encourages a variety of building intensities and densities, and in return for higher density, the plan recommends community benefits to be negotiated. The distinctive city vision element also provides recommendations for high quality design and through adopting design standards and guidelines.'",
        "'speaker_11': 'A well-designed urban environment is desired in this plan area, and design standards and guidelines will help achieve this. Some of the strategies that are encouraged in the plan include promoting a pedestrian oriented street frontage, promoting distinctive and human scale building design, minimizing visual impacts associated with vehicles, and creating streetscape landscape and public space standards that contribute to'",
        "'speaker_11': 'the character of the public realm. Lastly, the distinctive city vision element recommends future development to foster a relationship with the Southport River and to respect the riverfront. The Green City vision element has the goal of utilizing the plan areas, undeveloped space and mile of riverfront for the opportunity to create a precedent setting public space network.'",
        "'speaker_11': 'The plan recommends creating new parks and public spaces, enhancing existing parks, and ensuring those spaces can accommodate a variety of activities and programs year round. The existing plan area currently lacks vegetation outside of the river's open space, so the plan recommends creating a green public realm through enhanced tree canopy coverage and landscaping.'",
        "'speaker_11': 'Throughout the planning process, we heard it was important to provide and promote a variety of public spaces. To accomplish this, the plan recommends a combination of active and passive public spaces to be located throughout the plan area and especially along the riverfront.'",
        "'speaker_11': 'The plan also has a variety of recommendations for protecting the river as a natural resource, addressing stormwater and implementing green infrastructure. Lastly, the Green City Vision element provides recommendations for resilient infrastructure and environmental conditions. The plan recommends efficiently using resources, reducing waste, using resilient materials, and to build development with an enduring life cycle.'",
        "'speaker_11': 'Also, given the industrial past of the plant area, there are recommendations for the mitigation of contaminated soil, addressing noise and air pollution associated with the consolidated mainline or I-25, and strategies for best practices for mixed use development along the freight rail.'",
        "'speaker_4': 'All right. Just a few more slides. The amendment ends with the Moving Forward section, which lists the plans priorities that can be achieved through regulatory strategies, public infrastructure strategies and or partnership strategies. Lastly, within the moving forward section, the plan addresses community benefit priorities and these concentrate on environmental remediation of contaminated land and rivers.'",
        "'speaker_4': 'Inclusion of affordable housing throughout the plan area. Improvement to existing mobility and connectivity networks while providing new connections across the plan area. As well as improvements to existing public parks and trails while providing new parks and public spaces.'",
        "'speaker_4': 'Community benefits. Benefits also include activation of retail corridors and nodes and creating an equitable community that supports a variety of households. The Community Benefits Section is an important tool that will be used by the city in order to move in order to inform new zoning and or development agreements.'",
        "'speaker_4': 'We have three criteria for adoption of plants. The first is a plant consistency. As noted in your staff reports, the downtown area plant amendment is aligned with Denver Comprehensive Plan and with Blueprint Denver. The second criteria is that the plant is developed through an inclusive public process, which I address earlier in this presentation and which was covered'",
        "'speaker_4': 'in more detail in your staff report. And last and third criteria is the plant has developed a long term view and this plan intends to guide the development of this plant area for the next 20 years. We recognize that the implementation of this plan may take shape over many years and in multiple phases.'",
        "'speaker_4': 'And finally, we believe that the plan meets all three criteria and we recommend the plan for adoption. Thank you.'",
        "'speaker_0': 'All right. Thank you. This is a one hour public hearing, but we we only have six speakers. And I'm going to call them up to the front here and say COO, Jesse Paris, Devin Buckles, Peter Loewy, Tammi Dore and Reese Duggins.'",
        "'speaker_0': 'I called six of you. All of you can come up if you want to turn and say who? Your first 3 minutes.'",
        "'speaker_9': 'Sure. Mosaku Black Star Action Movement for Self-defense. Representing poor, working, poor homeless people, senior citizens and youth. Pray for me. Okay. And I'm a work with. This. Has a stamp on it. That says White only. Rich. Only poor.'",
        "'speaker_9': 'Not welcome. That thing is happening down by one of the largest educational institutions in the city, a rarity. Nobody sought to enroll any of the student government in their understanding of what is going on or their opinion. So when you tell me, you talk to people.'",
        "'speaker_9': 'What people? The people that are in the pictures on that screen.'",
        "'speaker_13': 'Look sick of all.'",
        "'speaker_0': 'What are people sick of? No, no, no. Who are you? Talk. Don't do. Don't do it. I'm doing it. This is the council. You address us. Go ahead.'",
        "'speaker_9': 'Addressing the Cats read Nick Plan. That's all it is. And you've got the head of the red necks here tonight, Denver Partnership. When you ask how many black businesses are downtown now? How many? When you ask how many black contractors participated in building downtown, how many angles take too long to get the mathematics and hold them accountable'",
        "'speaker_9': 'to bringing you the stats so you know what you're voting for in terms of the plan. Because if you cosign on this, in the words of Dr. Martin Luther King, you showed me any man or woman that has nothing they're willing to fight for.'",
        "'speaker_9': 'They're not fit to live. It's on the statue, 1957 out of City Park. And you're real good at quoting Dr. King, but doing nothing when it comes to being king, because you are a servant of the king. His name is Michael Hancock.'",
        "'speaker_9': 'Your man. Now, are you going to stand here and let him run this city and then make you surrogates to it? Are you going to stand up as the people's representative and fight for the right thing to do?'",
        "'speaker_9': 'If you approve this, then you have gotten in bed with the bed books. And if you get bit for real in 2019, it's your fault. Don't let them get away with this. Send a message to the mayor and send a message.'",
        "'speaker_9': 'Thank you. Thank you, Mr. Beaucoup. Comes to Jesse.'",
        "'speaker_0': 'Jesse. Pierce, you're up.'",
        "'speaker_13': 'Jesse Paris Black Star Action Moment for Self-defense. Denver Homeless out loud. Again. This is just blatant, just non concert and considerate. Just no thinking on any of you guys. This part. This is straight up gentrification, communist side, ethnic cleansing.'",
        "'speaker_13': 'For the record. Oh, where are you? Campus used to be housing. Before it was a campus for collegiate. That was tore down and built into what is now the Aurora campus. So on the same around the same area.'",
        "'speaker_13': 'Now, you guys are planning on building more luxury housing that nobody can afford or very few people can afford. And you actually think this is a logical thing? There's no people of color here. There's no black people. There's no Hispanic people.'",
        "'speaker_13': 'No, no, none of those people are in the pictures. So if you are really trying to build inclusive housing and inclusive community and inclusive neighborhood and all this other jogging, I'll keep going around, at least get the pictures right.'",
        "'speaker_13': 'And then you have. The head of the downtown Denver Partnership behind us. The same people are behind enforcing the urban camp. A ban and passing in the first place. Yeah, this is nuts. Nothing about this that's inclusive. This is straight up saying white only.'",
        "'speaker_13': 'This is straight. They stay.'",
        "'speaker_5': 'Focused.'",
        "'speaker_13': 'They focus on the deal. Not you stay focused. Presidents stay focused. Stay is stay focused. You had a sold out and that you are in bed with these business developers. So are you city planners?'",
        "'speaker_0': 'Are you done? Are you going to be you're going to be focusing?'",
        "'speaker_13': 'Before I was really interrupted. This is blatant gentrification in 2019. We need a change. Seriously, we need to change. Everybody listening. We need a change. Current City Council is currently in bed with the business developers and the city planners and they have no quarrels or conscious about it.'",
        "'speaker_13': 'They're being bought and paid for. I say enough is enough of this and be ready for us in 2019. Thank you.'",
        "'speaker_0': 'All right, Devin Buckles.'",
        "'speaker_2': 'Good evening, Devin Buckles with the Greenway Foundation. Our executive director, Jeff Shoemaker, was planning to be here this evening, but he needed to attend a memorial service for a dear family member. So I'm here instead to share our message.'",
        "'speaker_2': 'Members of Denver City Council almost 150 years ago, settlers who were becoming permanent residents of then Denver City and the area felt that the adjacent waterways were of such importance to their lives and their future that the corps grid for the streets was platted to align with the waterways.'",
        "'speaker_2': 'Just over 50 years ago, these previously vital urban waterways had been abused and forgotten to where they were as polluted as the South Platte and Cherry Creek were, to the point where they were lethal to consume and dangerous to touch.'",
        "'speaker_2': 'There were no parks, trails, fish or trees, but there were 12 land landfill dumpsites along their banks, as well as the remnants of a coal tar processing plant located within the very site before you here today, the ghost of which, as we all know, recently raised its head at the very birthplace of our city.'",
        "'speaker_2': 'Today, over $500 million of environmental, recreational, flood control and water quality improvements. Excuse me.'",
        "'speaker_0': 'Excuse me. Can you guys have a conversation outside? Thank you. Go ahead.'",
        "'speaker_2': 'Okay. Have been invested into the South Platte River watershed, allowing it to once again be known as our community's greatest natural resource. As a result of this investment, within a half a mile on either side of the South Platte River and Cherry Creek and Denver.'",
        "'speaker_2': 'Property values within these boundaries are 40% higher than the property values outside the boundaries. This is just one indicator that investing in our waterways produces a significant return on investment for our entire city and its residents. This generational plan before you clearly speaks to these environmental and economic realities and has one common denominator a confirmation that we'",
        "'speaker_2': 'all love our river, our communities desire to maximize its engagement with our river has never been greater. I applaud the countless hours invested in the creation of this plan by all involved city staff, direct stakeholders, Neighborhood Act advocates, everyone.'",
        "'speaker_2': 'I applaud the plan's vision to connect downtown to the river and vice versa in new and innovative means. I applaud the plan's vision to pave the way for dramatic and much needed additional improvements to the South Platte flood plain protection measures, additional habitat enhancement and recreational opportunities.'",
        "'speaker_2': 'And finally, I applaud the new and bold and previously under realized vision for this mile plus of prime riverfront property that will further increase the opportunity for our river to once again be the best place to live and work and play in Denver.'",
        "'speaker_2': 'Thank you for the opportunity to speak before you this evening and thank each of you for your service on City Council. The service may be under-recognized, but it is not underappreciated by the Greenway Foundation. Thank you.'",
        "'speaker_0': 'Thank you. Peter Lowy.'",
        "'speaker_5': 'Got to go. Peter Louis 215 Kearny Street. I put against on the card. But I want to be clear, I'm against. I have a lot of problems with the process and not with the product that's listed. Yes, absolutely.'",
        "'speaker_5': 'Those parking lots need to be redeveloped. I, however, don't have faith in the city and county of Denver of doing it in a way that would be as I think we don't have the tools to do it. And as a council, Lopez said earlier, this would be completely irresponsible.'",
        "'speaker_5': 'So. There. I read the entirety of the 96 page PDF. It's pretty interestingly written. There's a text part and there's a technical part, and the technical part is really well done. That was clearly done by CPD. And then there's the text part that was clearly done by the Downtown Denver Partnership, and it's really weird.'",
        "'speaker_9': 'It throws around a lot of buzzwords.'",
        "'speaker_5': 'It is in many times it contradicts what the technical part is saying. It's it's it's clearly written by two people who are going for two different things. Which and and this brings me to kind of the most important part.'",
        "'speaker_5': 'You open up the PDF page one. It says Downtown Denver Area Amendment. Prepared by the city of Denver community planning and development. And in the.'",
        "'speaker_6': 'Lower right hand corner, it says, in association with the Downtown Denver Partnership, which is a lobbying.'",
        "'speaker_5': 'Organization, I don't think it's just or equitable or something that an important city in the world or a city that wants to be important in the world does to have their largest lobby write the plan with them and then put and if you read the entirety of the report, there is something in the emphasize talks about implementation'",
        "'speaker_5': 'that says that this may require public private partnerships. So we have a plan in front of us that says that was written by a group whose partners you will invariably hire in order to do it. That's weird. I have no problem with that.'",
        "'speaker_5': 'I mean, I've worked in in.'",
        "'speaker_9': 'A number of of.'",
        "'speaker_5': 'Countries that we tend to call.'",
        "'speaker_0': 'Very, very corrupt.'",
        "'speaker_5': 'And this is probably the legal barrier of it. But I don't think that's the way that we're going to develop the Denver that we need. There was a couple of interesting points in the staff report that I hadn't seen.'",
        "'speaker_5': 'How would you get someone to move to downtown? They listed. Well, it needs to be affordable. You need to have child care groceries. However, in GDP's report on who actually lives in the current downtown, it is primarily white, it is primarily wealthy and is primarily single or childless.'",
        "'speaker_5': 'And so you have okay, we're going to turn this into downtown and then we're going to get all of the people already living don't to move there, which is, again, not the kind of people who came to the meetings.'",
        "'speaker_5': 'It's not the kind of people, look, we need these amenities and you're not going to get the kind of development that we need with a plan like this. Yes, absolutely. By all means, redevelop eventually. But you have to address structural inequalities in the city first.'",
        "'speaker_5': 'Then I'm okay with.'",
        "'speaker_0': 'All right. Thank you, Tammy Dorr.'",
        "'speaker_4': 'Good evening, Mr. President. Members of the City Council. My name is Tammy Dore and I serve as CEO of the Downtown Denver Partnership and the Office of Partnership. I'm here to express support for the proposed Downtown Area Plan Amendment.'",
        "'speaker_4': 'We have worked closely with the city on this planning process since 2017. I served as co-chair of the steering committee process when the partnership worked in 2007 with the city and over 3000 individuals to create the 2000 720 year plan.'",
        "'speaker_4': 'The future of this area was unclear. There was no impetus for development and no clear direction on what was possible. The development of our city, the advancement and growth of our population has allowed for opportunities here, and it served as a catalyst for a development plan.'",
        "'speaker_4': 'This amendment is timely and it directly complements the previously approved 2007 plan. I'd like to highlight and commend a few key plan component components. Lily already discussed the outreach process, which included the area, campus, neighborhoods, a wide array of stakeholders from every sector.'",
        "'speaker_4': 'Suffice to say, it was quite extensive and more detail is available on that. If you would like that from Lilly, I'm confident connectivity. This is a centrally located area, yet it lacks good connections to surrounding areas, in large part due to the South Platte River, I-25 and major thoroughfares, Spire Boulevard and the Aurora Parkway.'",
        "'speaker_4': 'The plan emphasizes the importance of enhanced connections for all modes of transportation, including emphasis on bike linkage as a key to success for the next 20 years. Density. Denver's rapid growth in the past decade has put development pressure on neighborhoods across the city.'",
        "'speaker_4': 'This amendment recommends significant dust density with a variety of building uses, types and heights to accommodate the growth. This is a growth in a smart and attractive way with two light rail stops in this area. It represents a smart growth site.'",
        "'speaker_4': 'Parks and Open Spaces. The amendment recognizes the importance of open space, particularly along the South Platte River, preserving and improving linear open space along the river. Enhancing current open space and adding new space enhances the overall network. Now, most importantly, I want to talk about housing.'",
        "'speaker_4': 'This plan emphasizes the importance of affordable and accessible housing in a high density area. Plan recommends going above and beyond the current city regulations. It proposes affordable and accessible units be spread out in different buildings and mixed with housing options.'",
        "'speaker_4': 'Varied housing options. The density proposed allows for greater housing opportunities for the city to address it again in a smart growth way. We ask for support and adoption of this plan by city council this evening. Thank you.'",
        "'speaker_0': 'Thank you. We stuck it.'",
        "'speaker_9': 'Good evening. Reese Dugan, president and CEO of Invesco Properties. We are an owner and managing member of Ilitch Gardens, which is in the plan area, and I just wanted to commend staff. I won't take a lot of your time.'",
        "'speaker_9': 'I want to commend staff for the hard work that we all did together for, I think about six months on this plan and not only staff, but our neighbors. I'm always amazed by the energy that neighbors and RINO's have in these processes, and it was six months of hard sledding for sure.'",
        "'speaker_9': 'So thank you all for that. Contrary to what some other speakers have mentioned tonight, I think those who do read the plan will see truly there is something in this plan for everyone. I live about a quarter of a mile from the site.'",
        "'speaker_9': 'So as a neighbor who lives close to this site, I'm excited for what this plan holds. I think it speaks to affordability. It speaks to diversity. It speaks to opening up the river. It speaks to Densify and Denver in a new way that I think we need to do if we're going to accommodate the future growth of'",
        "'speaker_9': 'this city. So with that, I'm going to wrap it up and I'm available for questions.'",
        "'speaker_0': 'All right. Thank you. This concludes our speakers questions. By members of Council Councilman, new mayor Tammy Ho.'",
        "'speaker_5': 'Question Tammy. Tammy, right next door.'",
        "'speaker_7': 'First, I just want to say I want to thank you for your leadership, for the downtown development. It wouldn't be half what it is today without you being there and the leadership you've given with all the people who represent the Downtown Denver Partnership.'",
        "'speaker_7': 'You've done a wonderful job, and I want you to know that we think you so highly of what you've been doing.'",
        "'speaker_4': 'Thank you, Councilman.'",
        "'speaker_7': 'Question on connectivity has been a big issue and and I see this as a natural expansion of downtown is really exciting. And we've talked about connectivity across some of the your areas. But I think one of the areas we've talked about in the past is is Spire Boulevard.'",
        "'speaker_7': 'And could you talk a little bit more about what I know we got a light rail going across it, but but with all of the residential growth near use gardens and what's going to happen there, how do we promote safe pedestrian traffic across Speer?'",
        "'speaker_7': 'Was that discussed as part of your group?'",
        "'speaker_4': 'This was discussed as part of the plan, and I might defer to Lily for that, for a technical answer. But what I would say is that we did discuss it in depth. In particular, I want to commend the plan in terms of how it actually talks about in more detail the descriptions of the street grid and how'",
        "'speaker_4': 'the streets will flow. It really helps paint a really strong picture of how you cross beer, what that feels like and looks like. But just as importantly, once you get across those thoroughfares, how it actually ties together because those connections can be smooth.'",
        "'speaker_4': 'But if as soon as you get to the other side, it it breaks up in terms of accessibility and intuitiveness. It's not going to be effective. Okay. There is a slide on that, I believe so.'",
        "'speaker_7': 'It will be safe. Improvements will be made.'",
        "'speaker_4': 'Yes. Okay. I just think that that the visual is really helpful. There's a there's an image that I think will very directly answer your question. Thank you. So do that. Just to be very specific, B-6 C does talk about the updates to the existing facilities that will need to happen so that the roads that already are there'",
        "'speaker_4': 'meet the character and function. So we call out Speer as basically to to have Speer function as a multimodal, a comfortable street for all users. There would need to be changes both along the street itself in terms of like wider sidewalks, sidewalks and addressing the feeling of walking right next to that kind of vehicle traffic.'",
        "'speaker_4': 'And we'd also need to the plan also calls out very particular attention to the crossings themselves. It needs to be there needs to be good, protected, safe ways that are convenient to cross, or we find people crossing against the lights or mid-block, which are both really dangerous situations for for everybody.'",
        "'speaker_4': 'So so the plan talks generally about how how streets should look and feel and intersections should look and feel. And that does apply to the streets that are within or adjacent to the planned area that already exist and end with many things.'",
        "'speaker_4': 'This will require further study to get into this very specific engineering drawing level type detail.'",
        "'speaker_7': 'That sounds very sorry. Mr.. Mr.. BLAIR Sure. What about the connectivity? We've heard a lot about the development of the commercial area near the Bal High Stadium and what's going to happen over there. Is this going to be a connectivity to what we're talking about, the downtown area plan expansion?'",
        "'speaker_7': 'I mean, it's not part of the expansion, but it seemed like a natural flow of of activity there.'",
        "'speaker_4': 'Yeah. But what we're proposing is, is basically a connected street grid throughout. So it will be connected to, you know, throughout the plan area. But then obviously Mile High Stadium is just outside of it. So one of the recommendations that we make to existing infrastructure is that Walnut Street connection that that is pretty, pretty tough to walk'",
        "'speaker_4': 'along from.'",
        "'speaker_2': 'The the light.'",
        "'speaker_4': 'Rail station to the stadium. And actually Public Works is already working on a project to do some short term improvements to make that better as soon as possible.'",
        "'speaker_7': 'My last question is on, Mr. President, the the timeline and the cost of such a development like this. Has there been discussion about that or is that discussion to come or.'",
        "'speaker_0': 'Yeah, I think that's a do you want to answer that? Yeah. The. Do you want to answer that question? The timeline about the development when this can happen.'",
        "'speaker_9': 'Good question. I wish I knew the answer to that. Really? I think a 20 year horizon is probably accurate. On the glitches site, we've committed to keep the park there for the foreseeable future. I think we are contemplating a phased development of villages that makes better use of the surface parking lots in the short term.'",
        "'speaker_9': 'And then I think probably 20 years to get this project to completion.'",
        "'speaker_7': 'The reason why I got you last night is I think when the last time we talked, you said you really were committed for workforce housing in an affordable way. So I just wanted to make sure that I wanted to emphasize that.'",
        "'speaker_7': 'And that was what you're thinking about?'",
        "'speaker_9': 'Yeah, we're excited about it. As we all know, there is no silver bullet to solve the affordability crisis that's going on not only in Denver, but in every major city in America and North America. We think we've got some good ideas that we can bring forward and discuss with you, though.'",
        "'speaker_7': 'All right. Thank you very much. And thank you, Mr. President, for your participation on the group, too.'",
        "'speaker_5': 'Yeah, thank you.'",
        "'speaker_0': 'Thank you, Councilman. New Councilman Cashman, you're up.'",
        "'speaker_7': 'Thank you, Mr. President. Reese. If you don't mind, I'm following along with Councilman. Whose last question? I almost had a bit of a stroke in our our last hearing. I know the people who are involved in the whole Shattuck rehabilitation, and I don't think their dreams or the dreams of the neighborhood plan in 1993 were 350 square'",
        "'speaker_7': 'feet for 1300 bucks. So. The one slide that showed that 62% of the people and not only were interested in affordable housing, but were interested in child care and early childhood education, tells me that they're thinking about something other than 350 square feet.'",
        "'speaker_7': 'So if you can go as far as you're able to in your concepts right now, talk a little bit more about affordability and median income levels and just. As best you can do in 2018.'",
        "'speaker_9': 'Yeah. I mean, I don't want to hijack the area plan amendment discussion and focus on our plan, but I can tell you that I think you'll be pleasantly surprised by what we bring forward. I hope you will be.'",
        "'speaker_9': 'I think we will go well above and beyond what's been done in the city previously. Unit mix is important. I can talk for hours about this, but I'll try to be really succinct I think. I grew up in Vancouver and I watched Vancouver grow up as a city and it wasn't a really successful city until it accommodated'",
        "'speaker_9': 'a large cross-section of the population. My canary in the coal mine story that I use is when I would wake up in downtown Vancouver and you'd see young families pushing a stroller down the street, and obviously they're not going to live in 300 square feet or 350 square feet.'",
        "'speaker_9': 'So I think we need to be inclusive, not only income wise, but demographically as well. And in addition to affordable housing, I think we need to focus on how do we really create complete communities. And I think the area planning, aside from affordability focus is a lot on this and what kind of amenities do we need to'",
        "'speaker_9': 'bring to downtown? So we're not building a downtown Denver for just millennials, but we're building it for a much broader cross-section. So I hope that answers your question.'",
        "'speaker_7': 'It's getting closer. Yeah, it's 20 year build out and. We need three bedrooms and four bedrooms. You know, as long as we keep building to a limited demographic, as you're saying, then we get what we build for. And while I understand that there's a market for that limited demographic, apparently, because I don't think people would be building'",
        "'speaker_7': 'for what's not there. We also need to build to attract other elements of the housing market. And I believe what you're saying to me and this council may have an.'",
        "'speaker_6': 'Opportunity.'",
        "'speaker_7': 'To address specific zoning on these parcels, may be future councils. As far as the timeline you're talking about. But I really hope to see a truly diverse downtown with army levels all over the map.'",
        "'speaker_9': 'So thank you for that hope. You're welcome. I will confess, I'm not an expert in affordable housing and becoming one. But more importantly, I'm surrounding myself with good people, including Denver Housing Authority, who will hopefully partner with us and bring forward a good proposal that we can all support.'",
        "'speaker_7': 'Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Yeah, thank you. Councilman Catron, Councilor Flynn.'",
        "'speaker_9': 'Thank you, Mr. President. Lily maybe or whoever can answer this. There are a number of historic structures along Old wasI Street, which is now a very a parkway, some of them built in the late 1890 through the early teens.'",
        "'speaker_9': 'What does the plan have to say about the fate or the status of those?'",
        "'speaker_4': 'I'm just going to switch to this to the slide here. And we, particularly through our meetings with the very residents who are also here today, addressed that by really speaking to lower intensity and potentially the the plan recommends having a height limit in that area, while it doesn't speak to height limit throughout anywhere else in the plan'",
        "'speaker_4': 'area. So this particular area here and then this this corner water street that that is next to Jefferson Park, we do talk about sort of limiting height and and developing new buildings that respect the existing context.'",
        "'speaker_9': 'Doesn't anticipate preservation or adaptive reuse or anything of that nature of those some of those buildings.'",
        "'speaker_4': 'The particularly along area, I think most of those buildings are already already.'",
        "'speaker_9': 'Functional scattered ownership, too. I don't I don't believe they're owned by.'",
        "'speaker_4': 'I mean, what we could tell is that they're in good standing as it is. They've been restored and they're being occupied and used. So there wasn't any language about additional preservation.'",
        "'speaker_9': 'Okay. There were two blocks that I saw in the presentation that were sort of they had a green asterisk on them because they were going to be a proposed park are open space. What's the total acreage and what is that acreage compared with the anticipated number of residents?'",
        "'speaker_9': 'Future reserves, I think the standard is ten acres per is a ten acres of open space per thousand residents is what we strive for.'",
        "'speaker_4': 'I don't know if I can answer to you in terms of specific numbers. We did not get to the detail of calculating that specifically, but there are sort of this is a large block here that is specified as potentially an area for for a park, a park that opens up to the river.'",
        "'speaker_4': 'Right.'",
        "'speaker_9': 'And there's one on the south side of the.'",
        "'speaker_4': 'Right in addition, somewhere along that area. And then we have sort of a green corridor that would connect those two parks together.'",
        "'speaker_9': 'Okay. And that that quarter crosses state, it would allow people to cross the sea at the consolidated main line, correct?'",
        "'speaker_4': 'That's right. And I just want to turn to my colleague, Sarah, to see if she. Yeah, there she is.'",
        "'speaker_9': 'Okay. Do we know the acreage of those two parcels?'",
        "'speaker_11': 'So we don't have a necessary acreage? We do have suggested park types within it. And we also suggest to follow the kind of guidance with the outdoor downtown plan. And some of the guidance is a requirement of a walking distance to certain sizes and types of parks, which is what we also recommend.'",
        "'speaker_11': 'And that will also be studied with kind of future development and the amount of people. We do have a recommendation in the plan that talks about that as far as how many people and park space per that. But there is no specified very specific acreage at all.'",
        "'speaker_11': 'But there's a lot of recommended recommendations about how we want to have parks throughout the whole area, a variety of parks and kind of what's going on within them.'",
        "'speaker_9': 'So there could be there could be more open space than is shown on those assets.'",
        "'speaker_11': 'Yes, I would say this diagram just has sort of two larger asterisks to show the largest designated parks. But there will be, I will say, many more other spaces, either designated parks or privately owned open space.'",
        "'speaker_9': 'Okay. Because we do fall short of that standard in a lot of parts of the city. Here's an opportunity to get it correct. And also, I was very intrigued by that 1933 aerial photo because of the the the comments during public hearing by some of the speakers about displacement and gentrification.'",
        "'speaker_9': 'But this has always been railyard and industrial property has never been where the images and Pepsi Center did not displace any residential. They replaced the the Chicago the Colorado and Southern or the rice yards rather. And all the railyards that were in there, correct?'",
        "'speaker_9': 'Yes. Okay. And I hate to bring up elegies again, but it's it's the source of source of summer employment and seasonal employment for so many young people in the city. So I am concerned and I've had some constituents contact me about what is the long term plan for Ilitch is.'",
        "'speaker_9': 'And I don't know if you can. With what degree of specificity you can talk about that. But I know that people look forward to how many kids have worked there over the years. Yeah, like I've said repeatedly, we're committed to keeping it there for the foreseeable future and I think our phased plan can accomplish that and make'",
        "'speaker_9': 'better use of our surface parking lots. I can tell you that my partner is quite as am I quite committed to looking at a relocation plan when the time comes to move it. The relocation plan to Northwest to where?'",
        "'speaker_9': 'To get a site. You can't say city and county of Denver or center central city or or the hinterlands. Yeah. The fact is. An amusement park by today's standards requires about 125 acres of land. We sit on about 62 today.'",
        "'speaker_9': 'And so it's tricky to get an urban amusement park. And there's a reason why there's not very many of them in the world. So you're saying we're unique? I'm saying that finding a great site within metro Denver will be challenging, but we're committed to looking at it for sure.'",
        "'speaker_9': 'All right. Thank you, Mr. President. That's all.'",
        "'speaker_0': 'All right. Thank you, Councilman Flynn, with those leading questions. Okay. And I just want to remind our council members, you know, let's stick to the question. You'll have plenty of time and comments as well. Uh, Councilwoman Ortega, Europe.'",
        "'speaker_10': 'Thank you. I have several questions, so I'm going to first start with the railroad issue. So when we started the conversations on the Central Valley, everybody assumes the railroad, the central mainline was going to be moved and the railroads were not part of our conversation at that time.'",
        "'speaker_10': 'And we later found out that they didn't want to move. So we had to revise the plan to ensure that the central main line stayed. And so I want to know what kind of railroad involvement was part of this plan.'",
        "'speaker_10': 'And, you know, we've had many conversations with the folks that live in East West Partners Development in the Central Valley. And these residents are very concerned, excuse me about the volume of petroleum products that travel through this city, not to mention other types of hazardous materials that not only travel through the center of our center of our'",
        "'speaker_10': 'city, but oftentimes are staged right downtown, right next to the most populated area in the entire state. And I want to know what kinds of conversations were had about the compatibility and and what kind of buffering are we talking about that ensures the protection of the masses of people that are going to be attracted to this area'",
        "'speaker_10': '. So can someone help me understand how that was addressed as part of the planning?'",
        "'speaker_0': 'Really, I think, you know.'",
        "'speaker_4': 'Um, as far as we know, the seamless here is here to stay for the foreseeable future. But throughout this plan we acknowledge the presence of Consolidated Mainline as well as light rail. We address it in walkable as a physical barrier and that needs to be to bridge to portions of this plan area one through an old mode'",
        "'speaker_4': 'connection along Seventh Street, and then with two additional connections for pedestrians and bicycles. We also address email in the drivers housing focus topic, where we have recommendations to avoid concentration of affordable units along C.M. and Interstate 25, Interstate 25 and under environmental conditions focus topic through recommendations that speak to implementing best practices that address downtown skill development'",
        "'speaker_4': 'along freight rail. This amendment leverages on the 2016 Mayor's Railroad Safety Working Group report and further recommends reduction of train speed throughout the downtown context restricting parking of hazardous, toxic or flammable goods throughout the downtown context. And one of the common reasons we did our research for freight accidents, we found, was due to lack of maintenance to'",
        "'speaker_4': 'freight rail lines. And so we also have recommendations that encourage more frequent checks of rail lines within the downtown context.'",
        "'speaker_10': 'Given the fact that we are considered what is known in the Railroad World Railroad World as a two tier of high urban traffic area, the the speeds are already reduced through the city. So, you know, I think that's that's the good news for Denver.'",
        "'speaker_10': 'Right. You know, they can't travel through here at high speeds where that would cause an incident. But the fact that, you know, they come through here and it makes us vulnerable as a city, especially given the high volume of of people that are concentrated in our downtown.'",
        "'speaker_10': 'So I just wanted to know how that was addressed and specifically to the the interface or or what may be seen as the incompatibility, right of, you know, the rail lines with high density housing that would be concentrated next to the the rail lines.'",
        "'speaker_10': 'That's one of the things I, I heard said pretty loud and clear is the the density would be more concentrated, closer to the rail. And as you go through the process with our planning department, the kind of buffering will will absolutely be part of how we address this.'",
        "'speaker_10': 'Let me move on to my next issue. One of my colleagues talked about open space. Can you tell me if any of the land along the river is considered as part of that open space? Or is are we talking about new land that does not include the river?'",
        "'speaker_4': 'Yeah. I'm going to defer to my colleague Sara to speak to that.'",
        "'speaker_11': 'So the plan definitely addresses current parks along the river. There's a few parks that are already there, including open space. And so there are recommendations to look at maybe possibly improving current parks. In addition to that, providing new parks and public space throughout the entire plan area.'",
        "'speaker_11': 'There was quite an expression to kind of enhance the riverfront as well and possibly improve trails and open space along the river. And so there's a lot of different recommendations that sort of speak to that. I guess does that answer the question?'",
        "'speaker_10': 'So I think it's important to include that interface with the river because it's a really critically important asset. But I want to make sure that we are including more park land in this area. I mean, the Central Valley had three new parks because, you know, this North Denver was park deficient.'",
        "'speaker_10': 'Those parks were actually built to serve part of North Denver, but they also happened to be serving the Central Valley as well. And so to do this area and not have any definitive amount of acreage that's being added as new park land is concerning to me that that we have no no details of how much more new'",
        "'speaker_10': 'park, land or open space we get in this new development. I think we're talking about 70 acres, is that correct?'",
        "'speaker_7': '66 years.'",
        "'speaker_0': 'But can can I just. Yeah, I want to just set the tone here a little bit because we're getting down into details. And this is this is the plan. This is the plan vision. This is the 30,000 foot.'",
        "'speaker_0': 'And so we're not going to have those kind of details at this level, particularly because we're not just talking about one property. You're talking about an area plan. And so I just want to encourage that.'",
        "'speaker_10': 'It I got it. It's part of the deficiency in the redo of how City Council sees the detail that we used to see. Having been here before, when we did the Central Valley Plan, we had a whole lot more details that were approved by City Council.'",
        "'speaker_10': 'So I get your point. So let me let me move on to flooding. Okay. So in your environmental issues, it's very clear in one of the picture shows the area within this this property that is being flooded. So how will that be addressed?'",
        "'speaker_10': 'Are we looking at bringing a bunch of a bunch of soil in and building up the site? Help me understand how that would be addressed. And I don't know if you want to speak to that very quickly.'",
        "'speaker_11': 'And then I'll let some my other colleagues speak to it as well. So one thing that I didn't mention earlier that I just want to mention as well is that this diagram is showing an enhanced river, enhanced green zone along the river.'",
        "'speaker_11': 'And we heard very strongly that people really want to see new parks in public space along the river. And that's why we also show a green asterisks adjacent to the.'",
        "'speaker_10': 'Riverfront, now adding to and green space.'",
        "'speaker_11': 'So we would hope to add parks and public space to the river. In addition to that, some of the recommendations that go along with this enhanced Green Zone goal. They speak about how to address flooding adjacent to the river and sort of how are we going to use sort of Brazilian green infrastructure systems maybe adjacent to the'",
        "'speaker_11': 'river? How are we going to look at adaptable spaces that can adapt to kind of a moving waterway? And in addition to that, we have some other recommendations across the plan area that we're trying to look at how to mitigate and accommodate flooding within development and within the plan area and how to filter and drain water before'",
        "'speaker_11': 'it gets to the river and before it gets to a pipe. Also led one of my other colleagues speak to that if they want.'",
        "'speaker_10': 'And let me just as you're coming up, who's ever going to address that? I just want to make sure that it it addresses it for the site without pushing the problem further down to areas that are already in a flood zone or are already experiencing flooding, like the Globeville neighborhood, for example.'",
        "'speaker_4': 'I'm going to add one. Just before Restocks we we worked closely with some of our other city colleagues who can speak to the specifics of that much more. This is obviously a very complicated problem. So what the plan talks about is what it needs to accomplish.'",
        "'speaker_4': 'And it's exactly that it needs to address the flooding both both in terms of the development adjacent to the river. And there's some in river improvements that can happen. So so our plan talks about kind of what how that needs to end up looking.'",
        "'speaker_4': 'But if race is thought a lot more about he's the one, he's going to be one of the people having to solve that problem. So he could speak more to the specifics.'",
        "'speaker_10': 'I'm an optimist.'",
        "'speaker_9': 'I'm looking forward to bringing a rezoning before you all, because as we're starting to flesh out, there's a lot of issues. Hopefully we can do that soon while it's fresh in all of your minds. We have been working closely with urban drainage and the city and county.'",
        "'speaker_9': 'As some of you may be aware, there's a long term regional plan for this reach of the river to solve the floodplain problem. And we've taken that on as part of our challenge to expedite that and implement that regional solution that hopefully solves the floodplain problem, not only for this site but for a number of others.'",
        "'speaker_9': 'Reaching all the way I think we're looking at the rich area is roughly from Speer upstream to about eight through 11th Avenue. So a pretty significant regional improvement project.'",
        "'speaker_10': 'Okay. Thank you. I have two more. Do you want me to continue or do you want to put me at the end? Yeah.'",
        "'speaker_0': 'You know what? Let's let's jump on to the others and then we'll come back. Okay. Thank you. All right. Thank you, Councilwoman Canete.'",
        "'speaker_8': 'Thank you, Mr. President. Some of my questions may be hard to understand where I'm going because I'm not trying not to do my comments first. So but please be patient with me. I think it's overall, there's some really good language in the plan, but I have a couple questions and there's a couple of places where I think'",
        "'speaker_8': 'it falls short. So I want to start by asking about the the process that you see going forward. So I'm in particular reading the section and implementation and I guess I'm concerned. I see partnership priorities for Housing Listing.'",
        "'speaker_8': 'Economic Development. Office of Economic Development. I see the community benefits, including a bunch of city departments. And so I guess my first question is just process wise, how many meetings did you say where the idea of diversity, affordable housing inclusion came up like, you know.'",
        "'speaker_8': 'A few most dozens.'",
        "'speaker_4': 'How do I say most meetings?'",
        "'speaker_8': 'Okay. So we'll talk in dozens of meetings.'",
        "'speaker_4': 'I mean, I can pull up the slide that.'",
        "'speaker_8': 'We use rough. I'm just trying to get it.'",
        "'speaker_4': 'We had three public meetings. I would say at each one of those public meetings, there were questions about you know, there were comments about that.'",
        "'speaker_8': 'And then there were some of these surveys and things. That's right. And so how many of those meetings was the Office of Economic Development present and participating in the conversation?'",
        "'speaker_4': 'Um. They were not present at the public meetings, but we did have workshops with them, multiple workshops with them, multiple meetings internally with them.'",
        "'speaker_8': 'But were they ever in communication with the community that was raising these concerns, as far as you know?'",
        "'speaker_4': 'No. And I would say. Probably the mature note I'm truly thinking about a majority of the concerns and providing affordability push came from the steering committee.'",
        "'speaker_8': 'Yeah, there were some steering committee. Does the steering committee include city agencies or does it include community folks?'",
        "'speaker_4': 'It does, but this did not include anyone from OED.'",
        "'speaker_8': 'But it did include community people, but it did not include OED. That's right. Okay. So you can imagine where my comments are going to head. I see no mention of the community in either of the implementation sections about the affordable housing or about the community benefits.'",
        "'speaker_8': 'Nor do I see any mention of city council. So I guess I want to understand how it is that you feel or and this is a planning question in part because, you know, again in my comments, I'm going to get to the trust gap between what's in this plan and then what gets negotiated by city agencies.'",
        "'speaker_8': 'Because we have another project coming forward in a week or two that has shown us how big the gap can be between the plan and what city agencies negotiate when they're alone with developers and they don't have the council and they don't have the community.'",
        "'speaker_8': 'So I want to have a sense of why those parties weren't mentioned in the implementation section about who's going to be working on the detail build out of this.'",
        "'speaker_4': 'Sure. Yes.'",
        "'speaker_7': 'A barge with the Department of Community Planning and Development. Thanks for the question, Councilwoman. There may be a little bit of an oversight in the language about who should be involved in the moving forward, because I would definitely understand your point.'",
        "'speaker_7': 'You do, because this is just setting the high level policy. We don't know exactly how this happens yet. We just have the priorities in place. But looking forward, we can start to see some paths forward. The plan talks about new or updated zoning that would apply, and it does even talk about potential incentive systems like we saw'",
        "'speaker_7': 'at 30th and Blake. And one of the things that we're looking at is a fairly set method for translating the the high intensity of development that's going to happen here into community benefits, like leveraging the increased land values.'",
        "'speaker_7': 'And that may mean that what we're negotiating with the community and with city departments involved are set formulas for the requirements that will apply to all of the development in the area moving forward. So that's a more transparent upfront negotiation before the developments are formally proposed.'",
        "'speaker_7': 'They're set requirements that they'd have to meet, if that makes sense.'",
        "'speaker_8': 'Okay. I think on that, I want to ask you about the you started to talk about the idea of regulatory approaches, and I definitely saw what I called nods to the 38th and Blake inclusionary, you know on site performance right higher performance on site but at pretty high aims.'",
        "'speaker_8': 'It's pretty much a workforce tool. The plan makes one mention of low income, but low income at the levels of like 30% of area median income is often not provided through that traditional route. It can be sometimes, but it's not as often we we more often are thinking about other types.'",
        "'speaker_8': 'It's typically, for example, financed in a building that leverages other resources, maybe not spread across. And so I guess I wanted to just clarify, when you say the word low income, what is your definition in this plan of low income?'",
        "'speaker_5': 'Thank you. Yeah, the plan does not.'",
        "'speaker_7': 'Specifically define it in several places. It says low to moderate income or low income and workforce. The but it also really talks about a variety of housing for a variety of people and requirements for that. And so one of the criticisms of the 30th and Blake strategy is that the housing that's required is affordable at 80% or'",
        "'speaker_7': 'below AMI because that's been the approach in the city wide linkage fee for building housing instead of paying the fee. I think we have direction here to look at something more nuanced with the affordability levels at which housing is provided or if, you know, in some cases, as you as you likely know, it may not make sense'",
        "'speaker_7': 'for housing to be provided by the developers at very low AMI, but could make sense for them to pay for the housing strategies to be accomplished through some other mechanism.'",
        "'speaker_8': 'Right. Or to provide land. So I guess where I want to go, I want to respect the idea. This is a vision plan, but I also want to make sure that there are no gotchas hidden in here where people are going to say to me that things are foreclosed.'",
        "'speaker_8': 'And so, for example, when you use this regulatory approach that works well for a linkage fee on site performance, a density bonus is designed for buildings. It's really not a substitute for an area plan for housing. And I think one of the problems we're having in the city is somewhere along the line, folks thought that a fee'",
        "'speaker_8': 'for a building was somehow a substitute for doing planning. So I want to just clarify, it talks about dispersal. Do you believe that anything in this plan forecloses the creation of a dedicated, affordable housing building for rental, for example, for 30% or 50%, since that would be one building.'",
        "'speaker_8': 'It may there may be for sale, affordable somewhere else. There may be workforce rental somewhere else. But I just want to clarify, when you see this word in here and I can give you a page number if it's important, but it talks about not dispersed that the housing has to be dispersed.'",
        "'speaker_8': 'Do you see anything foreclosing the creation of an affordable building in one place in this plan?'",
        "'speaker_7': 'I would I would say no, as long as it was clear that that was not going to meet the entire requirement for a variety of housing throughout the area.'",
        "'speaker_8': 'Got it. That's encouraging. Then the second question is, you know, there's this mention of regulatory approaches, which, again, I think work well for buildings may not work as so. Is there anything in your mind that forecloses the dedication of land, for example, for affordable housing, which wouldn't be something that could be accomplished necessarily.'",
        "'speaker_8': 'It might it might satisfy a linkage fee, affordable housing plan. We particularly put an affordable housing plan option in the linkage fee. But I just want to clarify that we weren't we are not relying only on density bonuses, that there could be other strategies that that are used to achieve the affordable housing.'",
        "'speaker_7': 'The plan doesn't foreclose other strategies. As we get into implementation, there'll be a lot of things to balance the the predictability of the formulas versus what you could get through more negotiated solutions. That might include a whole range of options, like setting aside land or doing really comprehensive planning for a large development like the one that Mr.'",
        "'speaker_7': 'Duncan anticipates.'",
        "'speaker_8': 'Okay. So we could have an affordable housing plan for this site. That is not. And I just want I want to know which doors are open, which are closed. I'm skeptical about a formula necessarily achieving the variety of aims and the variety of goals this plan sets out.'",
        "'speaker_8': 'So could this plan be achieved with an affordable housing plan that is negotiated and may include a variety of these things that don't all fit a regulatory zoning code ordinance?'",
        "'speaker_7': 'That door is not closed.'",
        "'speaker_8': 'Okay, that's really helpful. Thanks for allowing me to be so detailed. Just two more questions then. This one's a little different. It might be more for you, Reece, but on housing types, you guys have a lot of very broad language in here about variety of units and things like that.'",
        "'speaker_8': 'But I think and I know I was quoted in the media about this, so you may have read it, but there is a lot more to, I think, making housing attractive to families than the number of bedrooms. And I've continually tried to point folks to this idea that, you know, when you have five and seven year olds'",
        "'speaker_8': ', you can't send them to the river by themselves and you can't cook dinner with them at the park. So, you know, the idea of internal courtyards in areas that create safe, enclosed play. Are you looking at anything that's beyond just telling me you're going to do bedrooms but really creating spaces that are designed around families?'",
        "'speaker_8': 'And then I have one more question about public input. So. Just signaling to the president so he doesn't steal may make.'",
        "'speaker_9': 'Sure that there is. Yes, you may have heard my response to Councilman Cashman about. I'm a believer in God. Constructing a complete community. And that's. That's what I meant to speak to. And I used my canary in the coal mine test.'",
        "'speaker_9': 'Right. The for me, the the test of a healthy city is when you wake up and you see families pushing strollers in your downtown core, I think that means we're healthy as a city. And what does that mean?'",
        "'speaker_9': 'Everyone in this moment in time wants to talk about affordable housing. I mean, that's all anyone wants to talk about, it seems. I like to broaden the discussion more about that. And I think the plan speaks to this as well, is, like you say, it's not only three bedrooms, but it's a daycare to send your kids to'",
        "'speaker_9': '. It's a school to send your kids to so you don't have to move out to the suburbs. It's a library. It's a recreation center. And I think what's really fortunate about a lot of the land covered by the plan is that it's under large ownership parcels, which is really, really unique.'",
        "'speaker_9': 'And I think I anticipate we're going to have more of a discussion around this at the time of rezoning, but it creates the ability to deliver a lot of the elements in the plan a lot more easily than if the ownership was fractured.'",
        "'speaker_9': 'And so that's what excites me. And I look forward to having those discussions because I do truly believe you just can't put people in bedrooms and expect to call it a family neighborhood.'",
        "'speaker_8': 'So you may want to take this last question to then. So in terms of you've heard my questions about getting beyond just apartments to including voices and you know, other speakers and folks have mentioned the question of racial inclusiveness, which I think is, you know, not one that's easily designed in a physical realm exercise.'",
        "'speaker_8': 'And I guess one of the questions I have is what is the ongoing way that you as a developer are going to be engaging community and knowing that the nearby neighborhoods don't include necessarily the racial diversity that you want this site to, to reflect how you are going to seek out those perspectives.'",
        "'speaker_8': 'Because our traditional planning process is, you know, you have a committee that you kind of report to and and it includes representatives of all the nearby neighborhoods. But if you do that, you might be missing the voices that, you know, many of us are concerned about, feeling included.'",
        "'speaker_8': 'And so I'm just curious if you have given some thought to how you're going to do that inclusive planning and sound boarding as you move forward outside the rubric of the planning department running things.'",
        "'speaker_9': 'Yeah. For those of you who know me, you know, I'm pretty accessible. My cell phone's always on. It's kind of a 24 seven job. And so I talk to an awful lot of people and constituents in that role.'",
        "'speaker_9': 'I think I'm open to ideas on that for sure. I think, you know, we're we're bringing Michael Wolff to a portion of the site. Some of you may be aware of that, which is an exciting and a very exciting artists group.'",
        "'speaker_9': 'I think they have a really good model. They came in to our site, which they're use as a use by. Right. And they said, that's great, we don't need to consult, but we're going to go out wide into the artists community, into the neighborhood communities and really seek that input.'",
        "'speaker_9': 'And I think that's a really good model. But like I said, I don't have the all the names and addresses and the answers, so I'd be open to that discussion.'",
        "'speaker_8': 'Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'All right. Kathryn Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. Some of my questions have been asked by Councilman Ortega and Councilwoman Kenney specifically in regards to affordability and and racial diversity. I do want to bring something I think is the city. So those from simply from CPD.'",
        "'speaker_5': 'On that very note, I want to continue that note. By inclusivity and making sure. And here's some ideas. Looking at the steering committee district three borders the area. Right. Moran. I'm looking at that map.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_5': 'Was there a reason why we were invited to this. Steering committee table? I mean, we were visited. We, you know, I think with the reset, Reese and his team came to visit and meet with me and took a lot of our input.'",
        "'speaker_5': 'And they met with Sun Valley. They got into LaMonica Park. The city is the driver here. This is a city plan. This is a CPD document. I'm looking at the steering committee and the folks involved. Two things pop out to me, and one is that Council District three was left out.'",
        "'speaker_5': 'We had brought this to the attention of the CPD before. And the only thing that neighborhoods to the just in the spirit of achieving this diversity and making this whole neighborhood. The neighborhoods southwest to the site. Are very diverse immigrants, refugees, Mexican-Americans.'",
        "'speaker_5': 'And when I look at the steering committee. Espinosa. You're the only guy that represents. Those communities. There's a huge population. So I wonder why we I mean, if if that ever got pinged on on on by the city.'",
        "'speaker_5': 'I know that the team had reached out to me, but I was surprised that the city hasn't had saw that or. Figure that out. You have three council people there and.'",
        "'speaker_4': 'I am not sure if I am qualified to speak to why District three wasn't included in the Steering Committee. But through our first and second public outreach, we realized that through sort of our CPD newsletters and our social media blast, we were not getting La Alma and Lincoln Park community at the public meetings.'",
        "'speaker_4': 'So we've reached out to them and we met with them separately.'",
        "'speaker_5': 'All Sun Valley as well too.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_5': 'I think that is a little bit of one of my concern is I just want to know if there was is it. Is it a is it a 200 foot radius thing? Or what was the factor that that made that I.'",
        "'speaker_4': 'I don't know if I could speak to that because I was not involved in that process.'",
        "'speaker_5': 'Okay. And I know you're the messenger, but I think maybe I just addressed this to the administration in in making sure I want to know from from the executive level why that's the case. We had issues with notification before from the office, from the executive office in terms of, you know, things happening right in our own backyard'",
        "'speaker_5': '. Right. And when I think of downtown and I know this is forgive me for not making this form of a question, but. I guess I guess it is a question, right? We only live about 6 minutes from downtown.'",
        "'speaker_5': 'Why are we not considered downtown? Anybody who visits Denver. And goes to the West Side. They think we live in downtown by any other city's measure. We live in downtown. But Denver's measure there's a line. So I want I so I want later on.'",
        "'speaker_5': 'Yeah. Just moments right now. Councilman.'",
        "'speaker_0': 'You know, this is this is this is the district I represent. And I think I was involved in conversations. And I think that's a that's an oversight. And I think moving forward, there's going to be a, you know, going to talk about this in my comments.'",
        "'speaker_0': 'You know, the devil is about to be in the details in this rezoning, and we want you to be at the table. So I think that's a I think that's a oversight. And we want to make make sure it's clear going forward.'",
        "'speaker_5': 'I appreciate that, Mr. President. Look, I just wanted to bring that attention. Sure. I may be term limited. I may not be at that table, but I may not be going anywhere for the foreseeable future.'",
        "'speaker_0': 'We I can I can guarantee you this, Councilman Lopez, that this is happening in the next six months. So you'll be here, okay? Councilman Espinosa. Yeah. Just put a tiny bit of fear into me hearing that we're we're six months away from a rezoning, and I know nothing about it but conversation for a reason.'",
        "'speaker_0': 'That's, you know, that's that. That'll be part of my comments. I did want to but along those same lines to councilman news question about the Station Stadium Plan Committee, I can tell you that there's a public meeting that's going to be happening coming up very soon.'",
        "'speaker_0': 'I have pointed this out. There has been day one was a lot of talk about connection to these to Sun Valley, to Sloan's Lake and to this area. And yet it has gotten very narrow. And we're not actually talking about those connections.'",
        "'speaker_0': 'We're really focused on those two blocks that they really want to develop. And I have made I'm supposed to be a champion and like be a cheerleader for that effort. But I do have serious concerns about the the lack of connectivity, especially when Wolf was just mentioned.'",
        "'speaker_0': 'That's the that's the link to that other state when I want to get to those questions. So this is really a question for the city attorney sort of addressing my colleague, Councilwoman CNOOC's comments that we could have prescriptive language.'",
        "'speaker_0': 'Um, my understanding is we can write prescriptive language into our plans and that would then in fact be legally binding. And that's been upheld by the Colorado Supreme Court. If we wanted to have some language that we shall establish regular, regular reviewed set of requirements for vertical development developments regarding affordable housing or, you know, minimums or something'",
        "'speaker_0': 'like that, we could have very prescriptive language, and that would in fact be legally binding. Is that true? Sorry I did this to broadwell once too. Good evening. Members of Council Navy Sir Sir Anthony Jasmine Espinosa. Typically plans are just that.'",
        "'speaker_0': 'We don't write prescriptive language into our plans. We save that for our regulations and our Denver zoning code. Yeah, and I recognize that. But this goes back to my history with Devin Buckles when she was a member of CPD.'",
        "'speaker_0': 'We had prescriptive language in plans and that became when a developer wanted to do something that deviated from those plans that were supported by community. That became the issue. And we then got involved in very, very aspirational and recommendations that don't have any sort of level of specificity to avoid that.'",
        "'speaker_0': 'But yet, when we have conversations with community, it's always very clear that this is what they want. But we never write plans to that effect. But if I hear council saying that we heard this, I mean, if I hear a plan committee say we heard this and I hear council saying we want to address this, we could'",
        "'speaker_0': 'actually just say, look, take it back to your committee. The idea that we want to be more prescriptive in this element and it's something that we could write. Correct. So to your point, I think Councilman Brooks or President Brooks addressed this earlier when when he mentioned that this is sort of a 30,000 foot view, and then what'",
        "'speaker_0': 'will likely come is a text amendment to the zoning code. And I think that's where council has the ability to put some teeth to this plan. But then that gets back to my colleague, Councilwoman Ortega's comments, which is who's involved?'",
        "'speaker_0': 'Right. The process is different now. So we're having this 30,000 foot view and discussion where if she doesn't articulate it now, the people that are actually writing these play, these these zoning might not know that that's even sitting in the in the members on council's mind if that conversation is happening only by an applicant and CPD staff'",
        "'speaker_0': 'members of the executive and maybe Councilman Brooks. President Brooks. You know, this is a conversation where I felt welcome at this conversation. I can speak to the fact that the diversity conversation came up early and not by me, but by other members of that task force.'",
        "'speaker_0': 'And in in in. So if there is a desire to to somehow capture affordability, capture some sort of regulatory conditions, that that might involve sort of more pocket parks and open space or some sort of diversity. It's inherent in the development language.'",
        "'speaker_0': 'How would we know that until it comes forward as a as text amendment or map amendment? Text amendments are purely legislative and they're not applicant driven. And so again, I would just reiterate that that's council's opportunity to give this plan some teeth.'",
        "'speaker_0': 'Okay. So that to me, colleagues, that is the sort of wide open thing that when a tax amendment comes forward, if you want to see change to it, please use that opportunity to start negotiating and asking for change.'",
        "'speaker_0': 'Because what comes forward and has by the time it gets to us, which has already been through public process and planning board. We still have the capacity to instigate change. The problem is, is by then it has gotten through our whole gantlet of support and to sort of say that, oh well what you guys all agreed to'",
        "'speaker_0': 'needs needs some sort of core level adjustment. I think we need to be. So I just, you know, I'm getting into comments now and you can save that for that. I just wanted to see if you have any more questions because I got Ortega.'",
        "'speaker_0': 'Okay. Thanks. Okay. Councilman Ortega.'",
        "'speaker_10': 'Okay. I'm going to continue from where I left off. I appreciate the questions that were raised by my colleagues about the affordable housing piece. The most critical part of this is we need different price points of housing that will serve varying income levels of people in our city.'",
        "'speaker_10': 'If we want to have the diverse city that we have historically enjoyed, much of which we're losing these days. I also appreciate the ethnic diversity being raised as one of the questions. I think having the socioeconomic diversity in our city is what has made us a great city.'",
        "'speaker_10': 'It's what makes any city a great city and ensures that you have people that can work at different income levels and do that kind of stuff. I want to ask about the point that was raised by Peter Lowy about the contradiction of sections in the plan and how we expect to address that moving forward.'",
        "'speaker_10': 'And I think part of that gets addressed with who sits at the table that shapes the details moving forward. So I don't know who wants to speak to me.'",
        "'speaker_0': 'I don't know if you want to.'",
        "'speaker_4': 'Yeah, I'll stick to diverse diversity as well. Well, we have a whole, whole vision element that dedicated to diversity. It's also addressed in a variety of forms and recommendations throughout almost all vision elements, in diverse vision, in we speak to affordable housing that would attract variety of income levels, that it also provides a variety of family sizes'",
        "'speaker_4': 'from single person to multi-generational family living. There are also recommendations to provide affordable childcare, community gathering spaces and the units, and that these units are closely located to transit fresh food parks and schools. We also address diversity through amenities and design elements that are cater to seniors and people with disability, such as incorporating universal design throughout and'",
        "'speaker_4': 'providing health care facilities and proper and prosperous vision element. We address diversity through downtown mixed use that provides complimentary uses to support downtown living, such as grocery stores, pharmacies, playgrounds, and other civic and community uses such as libraries, schools, community recreational centers.'",
        "'speaker_4': 'The plan also speaks to creating tools to attract a wide variety of employment opportunities and requiring the development of new, multifunctional public spaces are accessible to all and walkable. We address diversity through well connected and integrated public transit system and small walkable blocks and through tedium, by providing discounted or free eco passes and employees to employees and'",
        "'speaker_4': 'to low income residents. And in green, we address diversity by providing a variety of open spaces environments from natural habitat to playgrounds to areas that provide outdoor work or workout equipment to all. So I think we we do touch upon sort of creating that economic equity and socially social economic inclusivity.'",
        "'speaker_4': 'In regards to Peter's comment. I will say that while Downtown Partnership has been on the steering committee, that this plan is solely written by community planning and development. So I'm not exactly sure what the where those differences lie.'",
        "'speaker_4': 'The recommendations at the end of the plan that speak to a variety of different ways to achieve plan recommendations which include private partnership, public partnerships. This is a very common way to develop cities. Very often there's funds used from the city to help realize projects, but also sort of incentive tools created to create that TPP, whether and'",
        "'speaker_4': 'you know, I can name cities in like New York and Portland, for example, with their dedication of parks. So they work with developers to build the parks and allocate their own properties to parks. And that's the kind of pep kind of strategies that we we speak to in this plan.'",
        "'speaker_10': 'Okay. Well, it's not unusual for us to have adopted plans that have conflicting sections. The Garden Court is a great example of that, where we had to come back and. Make some major changes to that. So so have you all looked at and identified where we do have conflicting sections in that that we can then address moving'",
        "'speaker_10': 'forward in the details that will come later.'",
        "'speaker_4': 'I. I do not know what those conflicting sections may be.'",
        "'speaker_10': 'Okay, Peter, maybe you can highlight those and we can share those. Not not right at this moment. But last question is about looking at the cumulative effect of. The redevelopment of village's 60 plus acres. Sun Valley. How many acres do we have in Sun Valley?'",
        "'speaker_10': 'And then now we're talking about the Broncos. All of this in the same geographical area. We know that we've got traffic congestion everywhere in our city today. And, you know, the hope is that people will live close to where, you know, transportation is and they won't need a car.'",
        "'speaker_10': 'But until we have our first mile, last mile figured out in this city, everybody's going to use their damn car. And they do. And so what is being done to look at the long term viability of our city so that we're not just looking at jamming everything wherever we can build, just for the sake of of seeing'",
        "'speaker_10': 'more people come to our city? Can you help me? Understand whether or not the cumulative effect of these three major developments was looked at as part of this, or is that being done right now collectively? And who's part of that?'",
        "'speaker_10': 'Who's part of that process?'",
        "'speaker_4': 'Yeah, I mean, I would my initial response would be that's the sort of conversation that we're having with public works and sort of orchestrating, coordinating that those plans do come together and they're not piecemeal. Especially in such a close proximity.'",
        "'speaker_10': 'And that can't just be happening within the city. It has to include community.'",
        "'speaker_4': 'Right?'",
        "'speaker_10': 'Because the cumulative effect is what creates problems. I mean, we started this with the 38th and Fox area where we keep getting reason applications brought to us. Nobody was talking about the infrastructure impact that was was going to happen.'",
        "'speaker_10': 'And once, you know, staff sat down and started looking at how much density we were improving, approving through this body, they realized, gee, we only got one road into this site. How are we going to handle even more applications coming forward?'",
        "'speaker_10': 'So a couple bills that were on tonight's agenda, you know, ensure that the developers are contributing towards how we address that infrastructure. So we have to look at the big picture and not just be looking at these projects piecemeal.'",
        "'speaker_10': 'So I want to make sure we're we're having that.'",
        "'speaker_0': 'And Councilwoman, I wanted to I think she had an answer there.'",
        "'speaker_4': 'So I wanted to I just I want to say, in addition to specifically to this plan area, the you know, there would be what's what's great about Ilitch is is that it's consolidated ownership. And when that comes through the sort of for rezoning, we will have IP, which is the infrastructure master plan, looking at that and getting'",
        "'speaker_4': 'into more details, understanding mobility, you know, doing more detailed mobility studies which are beyond the scope and capacity of this plan.'",
        "'speaker_9': 'Okay.'",
        "'speaker_10': 'Okay. That concludes my questions. Thank you, Mr. President, and thank you for answering my question.'",
        "'speaker_0': 'All right. Thank you. And that concludes the core question portion of of of this 561 is not closed comments by members of council. So I'll start this being a part of the district that I represent, you know? I think it's really important that the public hear this, that a plan is aspirational.'",
        "'speaker_0': 'A plan is aspirational. It is. It captures the vision of where we want to go in the future and. You know this plan right here. I'm talking to constituents all the time. And this is the thing that they're going to tell you that's most important.'",
        "'speaker_0': 'First of all, nine out of ten will tell you they only feel within their they only feel that they're in a huge city when they're in their car and they're stuck in traffic. Mobility is a huge concern. Nine and ten to tell you, number one, we have a housing crisis.'",
        "'speaker_0': 'An issue in our city is is getting less diverse every day. And three is sustainability. We are really concerned about sustainability within the city and county of Denver. Aspirationally this plan. Encapsulates all those things. It talks about inclusivity.'",
        "'speaker_0': 'It talks about. I mean, you know, Joel Clarke would say this is the most impressive part of the South Platte River. It talks about revitalizing that piece. It talks about open space. It talks about all that traffic that everybody's talking about.'",
        "'speaker_0': 'Now you have a part of the city that is connected to a multimodal network, and it talks about increasing that. It talks about parking maximums. It talks about a team plan. Joe and Clark. Councilman, president pro tem. We've been talking about a team plan for ever.'",
        "'speaker_0': 'We now have one so people don't have to be overreliant on their cars. So from an aspirational perspective, this gets at everything. And by the way, it include it, although we didn't have Councilman Lopez and some folks from his neighborhood, which was an oversight.'",
        "'speaker_0': 'And we'll make sure going forward that we do that. We did have District one and as you know, District one has not, you know, been run roughshod by developers. They're going to fight right tooth and nail. We had Jefferson Park folks in my committee sit in there and tell you, I don't like this, I like this, I'",
        "'speaker_0': 'don't like that, and I appreciate that. I appreciate that conflict because it helped us put a plan together that was inclusive. And and Councilman Espinosa was at most and all, if not all of the meetings. Oh, sorry. And pushed pretty hard.'",
        "'speaker_0': 'And I think aspirationally he is not to put words in the mouth supportive of this plan. And so I think aspirationally we're in a good place. It's not over, folks. We get another and I'm sure folks who are going forward for the rezoning are not going to like this.'",
        "'speaker_0': 'But we another bite at the apple several actually. And it's called the rezoning. And it's going to be a long process where we we all get to be a part of it. Now, I'm a tell you right now, because I've been a part of texts and zoning amendments don't come at the 12th hour, 11th hour and say'",
        "'speaker_0': ', I didn't feel like I was a part of this because now I'm taking notes. All of the folks who said that they want to be a part of the details of what this looks like, you're going to get a note, you're going to get you're going to call, you're going to get you're going to get invited to'",
        "'speaker_0': 'the table. I think one of the things I learned on this, you know, this was moving right at the gentrification conversation we were having in the district. And I would go to a meeting and say, if you care about this gentrification, displacement, what our city looks like, you better be at a planning meeting.'",
        "'speaker_0': 'And we have to do a much better job getting the word out. But we as a community also have to do a much better job of seeking out that information as well. And so, you know, I think, you know, Councilman Lopez, Councilwoman Canete said some things.'",
        "'speaker_0': 'I think what I would throw out to the to the community and CPD and other folks is, you know, if we really want this to be a community this diverse, there are a lot of groups, a lot of African-American, Latino, professional groups that need to be a part of this and that we need to start reaching out'",
        "'speaker_0': 'to. And so I put that on my plate. I put that on CPD's plate, and we all should put that on our plates moving forward. I will say, number one, that moving forward and not, you know, obviously can't get in the details because we don't know.'",
        "'speaker_0': 'But this will be one of the most impressive, sustainable green areas in the city. One, two. This will be one of the most impressive multi-modal developments that we have in the area. And three, this will have one of the highest, in my opinion, and I will push for this requirements of affordable housing that we have at any'",
        "'speaker_0': 'large development in the city. And so we've got to work at that. I don't know what that looks like. You know, we'll be working all together as a city. But I think all of those questions that councilwoman can each about the the specificity of what's not included, what is included, I think are great questions.'",
        "'speaker_0': 'And I think this is open. I think this is open and we're really going to have the opportunity. I'm really excited that you mentioned that DOJ will be at the table and they are at the table. And so they are a great partner of the city and they can do a lot of great in the city.'",
        "'speaker_0': 'So I'm supportive of this by the requirements we are used to judge to pass a plan. I think it just meets all the requirements and I'm excited for the next step. Councilwoman Canete.'",
        "'speaker_8': 'Thank you, Mr. President. To build off your remarks, I think that this plan has a lot of really good and bright aspirations. So I. Kudos to the steering committee. Kudos to you, Councilman, who I know was behind some of those important aspirations and pushing them forward.'",
        "'speaker_8': 'So I think that there is no question about that. This is a really great plan in all of the areas that it covers. I think the reason, the dialog it started even before your plan this evening, it started with the earlier rezonings.'",
        "'speaker_8': 'But I think that the city and I, you know, I don't know who I mean, what I mean the city. But I think sometimes there's a notion that displacement is about where the development lands. And if the development lands someplace without housing, then it's not a displacement question because there's no housing there and you're not displacing anyone'",
        "'speaker_8': '. And I think what you're hearing tonight is that we can't be thinking about displacement as just where development lands. We have to think about every ripple that circles out from that development, and we have to think about its long term intergenerational impacts on the city.'",
        "'speaker_8': 'And so that requires thinking and planning and aspirations that are as big, as bold as all of those ripples. And not just on the site. And I hear a team tonight that's embracing, I think, that level of thinking, and I think that's a breakthrough.'",
        "'speaker_8': 'And again, you know, we have some projects coming forward on a similar timeline that missed the boat completely. And that's where the concern comes in in terms of where we go from here. So one of the things I want to point out is that I think one way to think about the ripples and I noticed it again'",
        "'speaker_8': 'tonight when we talk about conformance with plans and I know you're talking about legal conformance, I haven't yet heard a CPD presentation mention the affordable housing plan or the Todd plan. So we work hard sometimes running around trying to get language into plans because we want them all to point to each other.'",
        "'speaker_8': 'So the Todd plan says put affordable housing activities. The housing plan says put affordable activity. So we have all these plans. And I think that we are still. Thinking a little bit too much about the bubble where it's dropping and we're forgetting about these other really important plans that that point is in the right direction.'",
        "'speaker_8': 'So again, though, you got there in this plan, and I think that that's a testament right to the process, but not necessarily something we're doing consistently. So then what happens after the plan is adopted? And I think that I'm concerned about the silo that I've discovered.'",
        "'speaker_8': 'You know, so we heard it tonight, and I think our Office of Economic Development, this is not about them failing as individuals. But if somehow our view is we have a long conversation not just about the development, but about all these ripples, and then we're going to punt the implementation of the housing piece to a department that'",
        "'speaker_8': 'wasn't there, hasn't been engaged, hasn't been in my office or probably other offices asking what do you council members think is important about how we do housing here? This is a department that's set up to implement an ordinance.'",
        "'speaker_8': 'It's a it's a transactional thing. Did you meet the linkage fee? Did you not? We haven't set that department up to do catalytic visioning of how you integrate housing into big areas. We haven't we haven't set them up to do that.'",
        "'speaker_8': 'And so, therefore, they're struggling to do that and some other projects. And so they can't the staff and the team and the expectations we've built for that department right now, they haven't been in your conversation. So they're not the right party alone for sure, but maybe at all to be leading then the implementation conversation, because they missed'",
        "'speaker_8': 'all of the conversation, both about the development and about the ripples. And so I hear you that, you know, you did some internal meetings with them. But what I've seen is just that is not a substitute for being engaged with us as council members or being engaged with the community.'",
        "'speaker_8': 'So that bridge. But we need to blow up those silos and we need to build that bridge to make sure that as we go forward, we aren't thinking about this transaction. And that's where I get nervous about the formulas.'",
        "'speaker_8': 'So let me give you an example. I can think of at least three types of policies or approaches to housing that have nothing to do with unit formulas. So, for example, questions about disabled access, right, is about unit design that doesn't show up in a formula.'",
        "'speaker_8': 'Questions about we have a desire to maybe experiment a little bit with resident preferences, where we maybe draw some circles on a map and we try to include residents who are at risk of displacement into some of the new units we're building.'",
        "'speaker_8': 'Wouldn't that be an amazing place to pilot that policy? That's not going to show up in a formula. So we have to really get out of the idea of administering the linkage fee as the basis for how we think about this development.'",
        "'speaker_8': 'And then I just want to thank you for your openness and your humility in saying, hey, I'd love to take some input on how to do this next piece because I think we want to do it maybe differently.'",
        "'speaker_8': 'You had a really powerful steering committee that got these amazing aspirations. So then how do you get the next group of people for implementation? And so I would like to suggest that we think about like even a focus group approach, and I want to give one example.'",
        "'speaker_8': 'So I judged an art contest with mostly Latino students who are asked to talk about their neighborhoods. And I was shocked how every group there were for art pieces. Every group had create an art piece where the central feature of their neighborhood was open space and green space.'",
        "'speaker_8': 'I expected it to be about buildings and I expected it to be about, you know, streets and places. They hung out. It was these youths cared a lot about nature. And so I would be curious what a group of Latino youth has to say about river access.'",
        "'speaker_8': 'Right. And just let's not think about just professional organizations, but let's think about different user groups. You talked a lot about retail and the idea of active streets. And I don't want to speak for my constituents of color, but when I hear them talk about their experiences and where they feel welcome and where they don't, a lot'",
        "'speaker_8': 'of it has to do with how does the security interact? Does the security tend to over target and ask questions in a racial profiling way? Do the retail establishments right? We've obviously all seen the Starbucks example. So wouldn't it be amazing, if you like, for example, as a requirement to do retail in this site, had every retailer'",
        "'speaker_8': 'think about racial inclusiveness so that the table with the black customer doesn't get served last. I don't you know, I would just love for you to ask questions outside the design box to two communities that have sometimes felt excluded from our public spaces and ask them why.'",
        "'speaker_8': 'And I think you're going to find it's not about this sidewalk. It's sometimes about the ways people interact and all that. So and I again, I don't know, but I think these are the kinds of questions I love you to ask.'",
        "'speaker_8': 'And I think it sounds to me like you're open to that. And so I'm excited to support this plan. I'm excited to to see you struggle with these aspirations, ask some different players about them. And and I will call and answer the call when it comes, if there's ways that you want to, you know, put me to'",
        "'speaker_8': 'work and pieces of this, I'd be happy to help think about the affordable housing piece. But I think it's got to be more than you and. It's got to be more than you. And ID. If those are the only players in the room, I will consider this a failure.'",
        "'speaker_8': 'And then the last thing I will just say is I respect that the plans at a high level. To me, the word Low-Income means including 30% of a mind blow. And I would consider this plan to be a failure if it did not include that level of housing in addition to the workforce and maybe even for sale'",
        "'speaker_8': '. So with that, congratulations on the hard work and I will be supporting it tonight.'",
        "'speaker_0': 'All right. Thank you, Councilman Espinosa. So my first note on here and it's underlying scary. I say that because, you know, sometimes, you know, in certain circles, I'm sort of the boogeyman for developers. And and I think when I walk into a room like this, that's probably the perception that some have.'",
        "'speaker_0': 'And most who know me now know that I'm anything but I'm challenging. But I'm I'm I'm pushing in a direction I think we all want to go, just maybe pushing a little harder. And in dealing with we're in a room full of people talking about your property and I'm pushing the way I push also.'",
        "'speaker_0': 'I mean, consistently just saw receptiveness and an openness to, you know, the ideas that were being expressed and letting those things play themselves out. And that's consistent with those those meetings and private meetings that that. So I just appreciate having you know, when you have.'",
        "'speaker_0': 'Three stake, three property holders. You know, you have this such an opportunity to have such an open minded, you know, representative on the ownership side to allow that sort of conversation to naturally flow. I think that's what you have in all of the sort of good aspirational aspects of this plan.'",
        "'speaker_0': 'So kudos that have been given to everybody. Staff your leadership. You know, it was a good it was a very good process. And, you know, we tried to be as inclusive as possible, maybe not in the task force.'",
        "'speaker_0': 'Maybe I'll admit that was pretty select group of individuals, but it was a very diverse scope of backgrounds and perspectives and and and and a lot of ideas got conveyed. And then even after all that public outreach that was by by design, you went the extra mile to go in and hear those concerns by very, very particular'",
        "'speaker_0': 'constituencies with very, very specific asks and and accommodated appropriately when, when, when it fit with the conversations that we had already had as a group and at least explained to them where there was synergy and where where there was conflict.'",
        "'speaker_0': 'And so it was a great process. And I was never really successful in scaring Uris, but I might now because we just got back from L.A. and one thing we learned there is they're planning to put me in their rezoning process is at least four years long.'",
        "'speaker_0': 'So, you know, we've got some time and and I got to have. Dinner with the incoming planning director for city of Santa monica, who's been an architect practicing for a long time and dealing with those delays and now is going to be leading those delays.'",
        "'speaker_0': 'So the there is a displacement thing going on here, too. My colleague Kevin Flynn's thing. Glitches has been a north Denver institution since its creation and so yeah it moved from one part of district one into this part of District one and if it ever goes away, I'm all for and I seen say Mountain View and Lakeside'",
        "'speaker_0': 'and moving it there. There's 120 acres there that we could do and throwing it out there anyway. The reason why we even sort of entertain this idea and the question to the city attorney was I have no I'd no problem being bold.'",
        "'speaker_0': 'And so if there were a statement by council that it wanted to be part of this, bring it forward, you know, and, and, and, and don't be afraid or shy away from that. I will be supporting this as it is.'",
        "'speaker_0': 'I do think it's a very good 30, 30,000 elevation plan is better than than most, in my opinion, because it gets to sort of a different way of sort of steering our zone, potentially steering the zoning for a rezoning process that might capture the lessons learned over the hundred.'",
        "'speaker_0': 'And what is it, 130 year history of the city and county of Denver. And so. So the one thing is, is that the diversity conversation came up tonight. We talked about it a lot and it did come up early.'",
        "'speaker_0': 'And the one thing that I've sort of. Figure it out. I mean, my own personal observation in 20 some odd years of architecture and whatnot is that is that there is no black place and there is no brown place and there is no white place in a good city building.'",
        "'speaker_0': 'You go to Atlanta, it's a very different population demographic than than Denver. But the places are still places you go. And that's true for probably Vancouver. And it's a completely different demographic than here. And so building quality places.'",
        "'speaker_0': 'Ah, four people are welcoming of everybody. And so the language we have on diversity about making things accessible. Are about as far as we can go. Structurally, then we have to design those places to be accommodating and welcoming for everybody.'",
        "'speaker_0': 'If we if people of color don't see an amenity filled place as a place for them. That speaks to some other sort of structural failure that we've had as a city, because that's not the design of this of this whole plan.'",
        "'speaker_0': 'This is not to basically say we are catering to one particular demographic. These are public. You know, this is this is private development around a whole network of public right of way and public amenities. And and they're not codified in to a particular user.'",
        "'speaker_0': 'You know, I mean, for different particular I mean, a particular ethnicity of user. And that's just that's just a fact. And this is going to sound super naive. But I've been Latino my entire life. I've lived in sort of varying degrees of sort of low, low income to very well-to-do and.'",
        "'speaker_0': 'And yeah, I eat certain foods that other households don't. I listen to certain music growing up that other households didn't do that. And and then I went to school and I had a very, very limited exposure to certain ethnic groups, almost no Asians.'",
        "'speaker_0': 'Very, very limited black people in my in my growing up, you know, I grew up in southwest Wyoming. It's tough there. And so. But when I. My last job before entering here, I worked for five years for a predominantly African-American run business and in a black community doing projects time and time again for black households.'",
        "'speaker_0': 'And that failed. We all live the same way. We're all Americans and we all desire open space, public space, a place to play, a place to breathe, the place to, a place to earn a living and a place to buy our to buy the food, to feed our family.'",
        "'speaker_0': 'And so none of what's in those stores. Is dictated by the building. None of those what's in those stores is dictated by the street or by the park. And so none of what's in this plan will dictate who lives there.'",
        "'speaker_0': 'It is about doing a better Denver, learning from what we've done in the past and recreating the successes that we've torn out. And rebuilding those and building on what we do know and putting in infrastructure for today. And that if it's done right, will welcome anybody and everybody.'",
        "'speaker_0': 'Civic Center Park serves all populations of the city, and it doesn't change every time it does. So we just had the Puerto Rican Festival, right? I mean, they didn't say, well, Sydneysider doesn't welcome us because it's Greek architecture.'",
        "'speaker_0': 'You know, and so I'm doing my thing. But it's just that this is a good plan. It gets to those sort of granular things on a very high level. I told you I was going to say I was concerned about the zoning.'",
        "'speaker_0': 'I think that that's where the nuts and bolts. Yes. Our code, based on our form based zoning, could capture all these ideals and then would we start being in our head when we found its limitations on things that we're trying to do that are outside the box?'",
        "'speaker_0': 'But it also could capture none of these ideals. And so I want to see a codified language that does a better job respecting the innovation, the variation and the granularity of of community building that is that is inherent in our conversations.'",
        "'speaker_0': 'And is that the core of what is being proposed here? Thanks. All right. Thank you, Councilman Lopez.'",
        "'speaker_5': 'Thank you. Thank you. Council President. I am. All right. I absolutely appreciate the work that's been done, especially the outreach. You know, I've. I maintain that. I think it's. More than just notable, more than just a kicker or just a complaint.'",
        "'speaker_5': 'What it is, it is telling the steering committee. Steers the plan from the get go. And if it's if we can't. I'm going to support this plan because I do believe it is aspirational. There is a vision here.'",
        "'speaker_5': 'We should not be parking lots for most of the year. Especially when we are growing in population and we need the density of the units, the affordability to go along with it. 80% is not the benchmark. It's not a watermark.'",
        "'speaker_5': 'It is 60% and it is two and three bedroom units. It is a real city, is full of real people. Right. And I'm interested in being part of a city and building part of a city. That achieves that.'",
        "'speaker_5': 'Right. I wanted to start out and this is. You know, when I sat here, I just couldn't help but think of the. And I'm a native. I grew up here my whole life. Yes. I've been Mexican my whole life.'",
        "'speaker_5': 'I'm just kidding. That's just a dig on my thing. Go with it. You know, there's a lot of things about Denver that are just that are absolutely unique. That are our spirit and our soul. You think of Mile High Stadium, you think of Larimer Square.'",
        "'speaker_5': 'You think of Federal Boulevard? You think of our parks. And you think of villages and as the city changes and as you know we. Build out certain parts of the city as things I couldn't imagine, which is moving from the north side down into the Central Valley.'",
        "'speaker_5': 'But they did. And I just keep thinking in this whole conversation of the Ferris wheel. 125 year old part. And there's one saying on that Ferris wheel that you're all going to have to tangle their. And that saying is to not see glitches is to not see Denver.'",
        "'speaker_5': 'There is a history. Inscribed on a lot of these places. And they're not it's not simply just the Ferris wheel. It's it's an identity. And Denver has a unique identity, just like all the cities that we all tend to visit and inspire and take great ideas from.'",
        "'speaker_5': 'I. I'm itching to hear what other people say of our city when they explore our cities. There are new ideas that we take from here and they're the best we can get. The great ideas. I think there are a lot of great ideas up north, but there's a lot of progressive policy up north as well too.'",
        "'speaker_5': 'There's a conditions for those things to thrive and exist. I know cities. I. Be a lot happier in my city if. In our city. If I knew that every one of those cranes in the air included affordable housing at a rate that is justified.'",
        "'speaker_5': 'But it doesn't. And we cannot say and we shouldn't say that we haven't been through this before. And that we don't know what to expect and that this is new. We've been working on the Cherry Creek Plan since I've been in office.'",
        "'speaker_5': 'We've been working on downtown area plans and we've watched downtown grow. You've watched the Platte River Valley grow. We've seen Union Station develop. At a rate that I've never seen any area develop before. We've fought to get community benefits and Union Station.'",
        "'speaker_5': 'There were standards that I believe were still a little low. But we've been through this before. We know what to expect. And so I you know, in this plan, although it is aspirational. There is a difference in terms of neighborhood plans and how quickly they get implemented.'",
        "'speaker_5': 'We've had neighborhood plans in my neck of the woods that had existed and that were formed in the seventies, calling for certain conditions that still have not been implemented. Whereas other plans that I was on this dais watching Ford.'",
        "'speaker_5': 'And making decisions on have been implemented very quickly. It just depends on the political will. So as we move forward, I want to make sure that we are. Our truthful with ourselves. And are transparent with the public. I think eulogies is a very important not just a symbol, but it is true.'",
        "'speaker_5': 'It's in an era where it's becoming very unaffordable to live in Denver. It's also becoming even more and more unaffordable for kids to be able or young people and families to be able to enjoy as well, too, without paying an arm and a leg.'",
        "'speaker_5': 'Safe place for folks to be. I saw a committee meeting. I sat in a committee meeting. This council where majority of these kids only live a block from the villages, are picked up on curfew tickets more than any other side of the city.'",
        "'speaker_5': 'This is one of those areas where you want to make sure your kid is safe. Jobs are important, too. We are displacing jobs. And we have to with this plan, we have to be able to figure out. A place for those jobs.'",
        "'speaker_5': 'We got to figure out how to replace those. I think when it comes to. Connectivity. I think this this has done a great job when it comes to using the river as its front door. It does a great job.'",
        "'speaker_5': 'And a compliment accomplishes a lot of great planning, a lot of great ideas. I can't wait to see implemented. However. When it comes to affordability, we have to be experts. This issue cannot move on, for there is no piece of land that we can touch without a plan with one of our plans that did not speak to'",
        "'speaker_5': 'affordability. That has to happen, not with just developers. We can't just say all the developers of this developer didn't do that. That's leadership from the city that needs to take place. And we should expect the city to set that standard.'",
        "'speaker_5': 'And not eggshell into it, but to be bold, to set that standard. To commit to it. This is this community planning and development, the mayor's office administration. We have to set the table. We have to create the rules of engagement so that folks understand.'",
        "'speaker_5': 'What they are and what we can do and what's expected when that's unclear. And this plan will be unclear. We have to commit to that. That direction is. Is absolutely key. So with that, I mean, I said this before and I you know, I'll say it again.'",
        "'speaker_5': 'You know, I, I am going to support this. I wish I was a little bit more excited. But I am putting my faith in folks who I know had visited me and told me that they're committed to it.'",
        "'speaker_5': 'And I have and I'm having faith that I'm going to make the right decisions. And I will say this one more time. I, I may be term limited in my, you know, in representing my district. But I'm not going to go anywhere for the foreseeable future.'",
        "'speaker_5': 'And neither are the folks who live in my district. Just like eulogies. Hopefully. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. So, yes, we know this is the downtown area plan amendment. But we also know it's the Ilitch site and it shapes the change for the future. And so it's why I think you're hearing so many of us being not just vocal, but passionate about the things we care about and how we see our'",
        "'speaker_10': 'city changing and where we see that we keep missing the mark on some of these things. And yes, it does start with us having the right policies in place that sets clear direction for everybody and is the same level playing field for everybody.'",
        "'speaker_10': 'I have a long history with this area of town going back to 1979 when I started working for the councilman of this district, when we started making changes to the Central Valley. And then I later replaced that councilman and represented that area for 16 years and saw major changes.'",
        "'speaker_10': 'I served on the committee, along with Councilwoman Reynolds, that brought the Pepsi Center to the site, you know, address some of the floodplain issues. And, you know, so change is inevitable. We all know that. And lots of changes are happening in this city pretty rapidly today and affecting a lot of different people.'",
        "'speaker_10': 'But I believe that we need to keep the density downtown. It's also where we need to have diversity. But if we can keep the density downtown, hopefully that means that we don't have density overtaking our neighborhoods because we have neighborhoods around this city screaming and hollering that we're we're taking over their neighborhoods.'",
        "'speaker_10': 'Jefferson Park almost is it? There's very little left in Jefferson Park of what used to be in that neighborhood. Because it's pretty much been redeveloped. So. You will hear this very loud and clear in this next election cycle where neighborhoods are fighting to protect their residential communities.'",
        "'speaker_10': 'So we think this density does belong downtown. I'm anxious to see the infrastructure masterplan. I'm also anxious to see the details that would be in open space. I want to I want to see how much acreage we're talking about and that it's it's not just slivers added to the park, to the river, but that we have open'",
        "'speaker_10': 'space built in to accommodate the masses of people that will be in this area. I want to see the affordable housing plan in the commitment and that we have different price points that can be served. And I don't just want to see that here.'",
        "'speaker_10': 'I want to see it at Sun Valley. I want to see it when we start looking at the plans for building out the Burnham yards, which is another 77 acres not far from here in all of these large sites where we're going, where we have this opportunity to bring more density downtown and to keep it away from'",
        "'speaker_10': 'single family would have been traditional single family residential neighborhoods. Reese I'm also happy to offer my assistance at whatever touchpoint you think. You know, my input would be helpful in ensuring that diversity is part of the conversation or that the connectivity to addressing the first mile, last mile connections.'",
        "'speaker_10': 'Because if we're going to say, you know what, you don't have to build as many parking spaces in your development. But we see what's happening in the Reno area where they're they're close to a Todd. Right. But they're getting to reduce the number of parking spaces.'",
        "'speaker_10': 'But you see every little sliver of land that saturated with cars because we haven't figured out a first mile, last mile connection in this city to all of these real stops so we can get people around this city where they need to go and not have to be in a car.'",
        "'speaker_10': 'So we need. We need to keep working collectively in in how we address that. We have no jurisdiction over the railroads. And so addressing the. The safety of the people that we're going to bring down to this area, knowing full well.'",
        "'speaker_10': 'Unless and until. The central main line is relocated to the far north end of of Colorado, as some people are trying. And that's a that's a long haul that may or may not ever happen. These products are going to travel through the center of our city.'",
        "'speaker_10': 'And, you know, we've had some influence in trying to keep them from staging in the center of our city. But they will continue to travel through. And so. Ensuring that we address the safety is a critical piece of the big picture of everything we do, not just here but anywhere along our rail corridors.'",
        "'speaker_10': 'And it's why when we have developments that are next to rail, I will always make sure we're asking that question and bringing that to the attention of our developers so that we're not just having people build and leave folks stuck there, and then they're long gone.'",
        "'speaker_10': 'And then if we have a catastrophic incident, we're all stuck, the city stuck figuring out how how did we do this? Why did we not address this? We have to be proactive in looking at how we address this issue on the front end.'",
        "'speaker_10': 'I think there are some good elements that are part of this plan and I will be supporting it tonight as well. But I look forward to seeing more of the details and in whatever way I can be helpful, I'm offering my assistance as well.'",
        "'speaker_10': 'Thank you so much.'",
        "'speaker_0': 'All right. Thank you, Dr. Sussman.'",
        "'speaker_4': 'Thank you, Mr. President. Oh, it's so interesting to hear the. The comments of my fellow council people. I think it shows how much downtown Denver means to all of us that folks want to talk about the history of their lives and and how it is intertwined with downtown and, you know, how long it has been.'",
        "'speaker_4': 'And I think that we put lots of hopes and dreams into that area. Tammy Dorr likes to call it the living room of the city or the living room of the home. And to me, that downtown area is the heart.'",
        "'speaker_4': 'It's a home. You know, it's just everybody feels so strongly about it. And I want to give great thanks and praise to the citizens who spent so much time working on this project. What a big job. And you produced a plan that.'",
        "'speaker_4': 'Has something for everybody. I mean, it has some mixed use housing. It has affordable housing, it has diversified, it has mobility, it has, you know, open space. It's like let's let's hope for everything in the world. And and I think we all place a lot of hope and dreams in it.'",
        "'speaker_4': 'But, you know, this the downtown isn't going to solve all of our social ills, for Pete's sake. This is just one area. And I think you heard a lot tonight, which was sounded to me a lot like a cup half empty when I see it as a cup half full.'",
        "'speaker_4': 'What you have done. It's so much easier to edit something than to compose it. And so as people were saying, well, it's not perfect. It could have done this. It could have done that. I just want to thank you for all that you have done.'",
        "'speaker_4': 'And please know that it's the the half empty feelings people have is because they are much they love downtown and how much they care about it and hope that it could be just absolutely perfect as it as it being as it matures and becomes reality.'",
        "'speaker_4': 'But thank you very much for having included so much stuff in here and for all the work that you did about. What goes into the heart of our home. Thanks.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Gilmore.'",
        "'speaker_11': 'Thank you, President Brooks. I would like to definitely thank everybody for their work on this plan and. You know, sharing the vision of what the South Platte River can be, the amenities and really building a brand new community and really in looking through the document diverse was used a lot and I think diversity is very, very important'",
        "'speaker_11': '. But I would also like when you go a little bit deeper to explore inclusivity. It's one thing to have a diverse community, but really having something that's inclusive is people take ownership of it. And it's not that they're moving in to be part of this community.'",
        "'speaker_11': 'But when my colleague, Councilwoman Sussman, was talking about. The the histories and the memories that elegies evokes for families and my 13 year old daughter. I mean, she would know specific places and elegies that are meaningful to her.'",
        "'speaker_11': 'And so I just asked that as you kind of delve a little bit deeper, deeper. And I love the part about the community gathering spaces because that's something that we hear time and time again in the Montebello and Green Valley Ranch community is we have lost those community gathering places and how important historically but going into the'",
        "'speaker_11': 'future, those community gathering places are and I would encourage you to look at how through those spaces you can ensure that people see their culture, that they hear their music, that they have access to their food, and that they can really see the history of the area and how they fit into the past, present and future of'",
        "'speaker_11': 'the city. Because if you're able to do that, you really will have an inclusive community that you've built, that people take ownership and they put down roots. And as you also get deeper, I would ask that you look at not only access to affordable housing from the for rent side, but home ownership.'",
        "'speaker_11': 'Because when I again listen to folks throughout the city, people of color do not always have the in-roads and the access to building wealth. And when you think about it, home ownership is that pathway to wealth. And so where you could look at out of the box ideas talking with the community, but really how you can encourage'",
        "'speaker_11': 'people to not only rent in the area but really be a home owner and truly, truly put down. Roots is so important. The other pieces are access to education. I think you've got the community gathering spaces, but access to financial literacy and financial empowerment.'",
        "'speaker_11': 'So if you have historically always rented, your family has always rented, you've lived paycheck to paycheck, you're maybe not equipped or even know the questions to ask about, well, how do you create your budget? How do you save up to buying a home?'",
        "'speaker_11': 'What if there is an emergency? Things that a lot of times people take for granted. If you haven't been given that opportunity or those tools, it's and this is coming directly I'm sharing with you what I'm hearing from my community as well is the access to financial literacy and empowerment.'",
        "'speaker_11': 'But beyond that, how does real estate work? Financial planning, estate planning, trust planning, all of those tools that go towards making families more stable. And the last part is access to workforce opportunities. So in these community gathering spaces, are there going to be, you know, entrepreneurial incubators kind of like the commons on campus?'",
        "'speaker_11': 'Are there going to be access to training programs? So we're making sure that we're not only getting people into this area and maybe looking at buying their first property, but then how are they going to grow their skills and maybe open a business or become part of this great new, vibrant neighborhood and really have that truly inclusive'",
        "'speaker_11': 'fill? And so, again, congratulations. I think it's going to be amazing and stellar, and I look forward to working along with you on this path and journey. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Clark.'",
        "'speaker_7': 'Thank you, Mr. President. First of all, I want to thank the team for all the hard work. Lots of meetings, lots of time invested in this. And so thank you to everyone from the public to the city staff who put into this.'",
        "'speaker_7': 'It is very clear from the end products that a lot went into it and a lot of really awesome hard work. You know, one of the things that's great about this process is that this plan goes through a body of people, a group of people.'",
        "'speaker_7': 'And I know at 930 at night sitting in those particular chairs, you're not probably fully appreciating, you know, that it goes through a body and like this. But what's great is that everybody up here comes at this and picks it different corners and looks for different things and pulls out different things.'",
        "'speaker_7': 'And I'm sure that, you know, if you're a regular on Channel eight on this season of Denver City Council, you can almost predict who's going to pick which corners. But it's great because then we have all of these perspectives picking and appreciating and looking for things.'",
        "'speaker_7': 'So I don't think it will come as any surprise that I'm thrilled that there's a tourism plan in here. Although I have a dream that someday we will have plans that don't need to have tedium in them because we will have a citywide team plan that we've been pushing for since we were, you know, talking small lots'",
        "'speaker_7': 'and budget. So. I love that it's in here. I hope that we can get to a point where that's citywide. And then here's the real shocker. I'm thrilled to see the park and the river plan. And I mean, this is a site that is right next door to the birthplace of Denver at the confluence of the Cherry'",
        "'speaker_7': 'Creek and the south. What it is I've said this to a million people before. This is Denver's riverfront. This is the best piece of riverfront real estate in the city. This is our chance of having a real defining riverfront of really finally making that transition from having fully turned our back on our birthplace.'",
        "'speaker_7': 'And the reason that the streets in downtown Denver don't run north, south and east, west and really embracing that, that opportunity is here. And don't get me wrong, I adore you, which is I still for me, it's still the new elegies, because as a kid, my elegies was the old elegies.'",
        "'speaker_7': 'But now I'm taking my kids in our tradition to ride the train down. And I think, you know, I won't reiterate what everyone said about the importance of that place or finding a new space for that place. But really, when you look at it, elegies is is the exact example of turning your back through a use on'",
        "'speaker_7': 'the river because that entire stretch, it's it's a chain link fence between you and the river on the best piece of riverfront real estate. And so I get so excited about the aspirational parts of this plan. And I love how Councilwoman Kennedy talked about when you're building spaces for families, it's not just about bedrooms.'",
        "'speaker_7': 'It is about that green space. And all of the people up here have talked about the connection to parks and green space and that really creating any livable community. You can't be done without that creation of space. And where else in our city can you not just create green space, but you can have a river that is'",
        "'speaker_7': 'is is living in vibrant in so many ways that flows right through it. And really, you know, this plan, the aspiration is to not make that turn our back on it, but to make it the front door to this community and the front yard for this household that we're building.'",
        "'speaker_7': 'So I think that this is just a plan. And so I will say I'm excited about the aspiration, but we it will be a tragedy if we don't achieve that on so many fronts that everyone's brought up. But but right now focused on if we don't achieve that full embrace of the river and the full potential of'",
        "'speaker_7': 'what this riverfront can be, then we will have failed. And so I encourage everyone in the room and everyone in this process to go from 30,000 feet down to, you know, taking off your shoes and getting your toes in a river that is that is swimmable and that is fishable.'",
        "'speaker_7': 'And where kids can go down who live right there and turn over a rock and catch a crowd, I'd like the thousands of kids I've taken on field trips down to the river who are shocked and surprised to find that nature lives right there, underneath, underneath the rock.'",
        "'speaker_7': 'So thank you for all of your work, and I look forward to the reality that comes from this plan. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Clark. Councilman Cashman.'",
        "'speaker_7': 'Thank you, Mr. President. Councilwoman Sussman was was was right on the money, partly in saying that that it's easier to edit than to compose. Unfortunately, in a case where something is really badly written, it's easier to start from scratch rather than try to twist it into something good.'",
        "'speaker_7': 'Now, the good news, I don't think this is badly written. I think it's really well-written in a whole lot of ways. Mr. Dugan, you're not the only person involved with ownership of this parcel, but you're the one in front of us.'",
        "'speaker_7': 'So I'll speak to you. You have a great opportunity here and you have a profound responsibility as well. The the element of the plan that concerns me. One of it is I don't know how long you're going to be around.'",
        "'speaker_7': 'None of us do. And I believe in what you said. I think you get it. The idea of affordability, inclusiveness, I truly do. But like I say, you're just a person and the plan is important. And as with so many of our plans, I just don't think it says loudly enough that we need family housing, that that'",
        "'speaker_7': 'right now, our city in so many ways has been building a city for a limited population. So I would love if this plan were more aggressive in speaking to that, but. It is, you know, our housing plan that talks about housing and inclusive.'",
        "'speaker_7': 'Denver. I wanted to say something about crisis because I truly believe it is. It is at that point. But this is a I'm not going to use the word, but it is a plan that speaks of hope and direction.'",
        "'speaker_7': 'And so I will be supportive of that of that plan. Like I say, I just hope, sir, that you live a long and healthy life. Thank you, Mr. President.'",
        "'speaker_0': 'Here. Here. To risk his life. Thank you, Councilman Cashman. I just want to thank each and every one of you all for for paying for parking, for coming through security and sitting in really hard seats for a long time and listening to folks.'",
        "'speaker_0': 'You guys care a lot about this city and you cared a lot about putting this together. So thank you. Hats off to all of you who are here and all of you watching at home. This concludes our comments.'",
        "'speaker_0': 'It's been moved. And second, about Secretary Raquel.'",
        "'speaker_9': 'Clark I.'",
        "'speaker_2': 'Espinosa.'",
        "'speaker_3': 'Flynn, I.'",
        "'speaker_1': 'Gilmore, I.'",
        "'speaker_2': 'Catherine Can I. Lopez All right. New Ortega assessment.'",
        "'speaker_4': 'All right.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Sorry.'",
        "'speaker_1': 'Please.'",
        "'speaker_0': 'Oliver. Okay, we're back on there. Okay. Please tell us the results.'",
        "'speaker_2': '11 eyes.'",
        "'speaker_0': '11 eyes. 561 is passed. Congratulations. All right. One last pre adjournment announcement on Monday, July 19, 2018. Council will hold a required public hearing council bill for 24 teams on classification of problem approximately 90 701 East 56th Avenue unstable to any protests against Council Bill 424 must be filed with the Council offices no later than Monday, July'"
    ]
}