{
    "Resolution to Settle Liability Claim in Case No. 16-cv-07007-PAB-MEH.": [
        "'speaker_2': 'And depending, we have nothing. All right. Madam Secretary, will you please put the first item up on our screens? And, Councilman Cashman, will you please put Resolution 1324 on the floor? Thank you, Mr. President. Yes, I move the Resolution 1324 be adopted.'",
        "'speaker_2': 'It has been moved and seconded and comments by members of Council. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. As I shared earlier, I was out of town. I did not have an opportunity to get a briefing, so I'm not sure what this is all about. Therefore, I'm going to be abstaining on the vote on this one tonight.'",
        "'speaker_6': 'So I'd like it out for a vote.'",
        "'speaker_2': 'All right. Thank you, Councilwoman Ortega. See no other comments, Madam Secretary. Rocca.'",
        "'speaker_4': 'Ortega.'",
        "'speaker_2': 'I'm sorry. Hold on. Councilman Espinosa, did you. Did your name pop up at the last second there before we went to the screen?'",
        "'speaker_5': 'Yeah, I was just going to explain my abstinence as well, so I'll be abstaining because I didn't get the briefing as well. And that's on me, so.'",
        "'speaker_2': 'All right, Madam Secretary.'",
        "'speaker_4': 'Raquel Ortega.'",
        "'speaker_6': 'Abstain.'",
        "'speaker_4': 'Sussman a black eye. Espinosa.'",
        "'speaker_5': 'Abstain.'",
        "'speaker_4': 'Flynn, i. Gilmore. Herndon, I. Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Can eat. I. Lopez All right. New. Mr. President.'",
        "'speaker_2': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': 'Nice to meet you.'"
    ],
    "Financial Disclosure Ordinance Revisions.": [
        "'speaker_2': 'Nine eyes, two abstentions. Resolution 1324 has been adopted. Madam Secretary, if you could please put the next item up on our screens. Councilwoman Canete, you've called out comfortable 919 for a comment. Go ahead.'",
        "'speaker_3': 'Thank you, Mr. President. Council Bill 918 is a bill that originated with the clerk's office, and she had been working to really modernize some of our areas of code that do transparency and reporting. Two of the bills, one is on lobbyists.'",
        "'speaker_3': 'The one that I called out is on financial disclosures, where we as councilmembers and other city employees file if they've received gifts that relate to the work that we do with the city, and then also where we report on, you know, some of our own financial interests so that the public may know if we have interests in'",
        "'speaker_3': 'the things that we're legislating on. And, you know, I want to there's sometimes more is more. And so there's a couple of changes in this bill that I think are really good, which is that it will be more frequent reporting.'",
        "'speaker_3': 'So twice a year instead of once a year. So there's less of a time lag before the public is able to see the reports. And also the reports will be available online. So in this case, I think the bill represents more is more one council change that we made in committee to the bill, which is a little'",
        "'speaker_3': 'bit about less being more, is that we think that the gifts the city is most interested in, our public is most interested is seeing, is those that have any relationship to our duties here. So we narrowed the group of people.'",
        "'speaker_3': 'So, for example, I don't know that the public has a strong need to know if my neighbor gave me a sweater for Christmas. They have they do no business with the city. And it created confusion, the fact that there were no limits on who you reported.'",
        "'speaker_3': 'So we narrowed who you're reporting to. And I think that's good. At the same time, we raised the threshold from $20, $25 to $50 at in committee. At that time, I was supportive of that change. And it made a lot of sense because, you know, Councilman Brooks, for example, was recently ill and people gave him flowers that'",
        "'speaker_3': 'might have been valued at more than 25. And and again, to have, you know, hundreds of flower bouquets reported. And his financing report might not have been the best use of of transparency in terms of helping to understand the city.'",
        "'speaker_3': 'But as we've proceeded, this bill is moving forward, and I'm going to vote for it tonight. But there's a similar bill dealing with some other issues in the code that Councilman Flynn has been working on. This has been a great example of really doing work in committee where we talk about all the details.'",
        "'speaker_3': 'But what it means is we're going to discuss his bill again tomorrow. And depending on how his bill goes, I may suggest that because we've narrowed who we are reporting to, that we should really report any meals, tickets that we get from those covered individuals.'",
        "'speaker_3': 'So I, I very likely will be bringing an amendment forward on this bill, maybe with others, maybe co-sponsoring with Councilman Flynn. But I just wanted to let folks know because I always feel like it can be very surprising if you see nothing on first reading and then maybe have changes on second.'",
        "'speaker_3': 'So I want to let folks know that I wanted to wait and see how the committee conversation went tomorrow. But it's my belief that if we very much are narrowing who we're reporting on, that it's maybe important to report all of the things that we get, especially since we're reporting twice a year.'",
        "'speaker_3': 'The threshold used to be if you've done some things that you know, collectively result in a certain amount throughout the course of the year, now that we're reporting more frequently, it just makes sense to report more everything so that people can really see between a first half of the year and a second half of the year what'",
        "'speaker_3': 'it adds up to. So with that, it is just a heads up to the public and a heads up to my colleagues and fully supportive of this did not pull it out for a vote. But we'll see how committee goes.'"
    ],
    "Extension of Term for Denver TSSIP 2012 Project with CDOT.": [
        "'speaker_3': 'And we may want to, you know, make a reconciliation on on second reading. So thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman. Madam Secretary, if you would, please put the next item up on our screens. Councilwoman Ortega, you've called out Council Bill 1069 for a question. Go ahead. Yes.'",
        "'speaker_6': 'So this is. A proposed amendment between Denver and the Colorado Department of Transportation. And I looked through the documents, the cement in IGA, and I was trying to.'",
        "'speaker_4': 'Determine.'",
        "'speaker_6': 'If this had.'",
        "'speaker_3': 'Any.'",
        "'speaker_6': 'Direct correlation to the I-70 project. And I'm not sure if there's someone here that can answer that question. Angela, I see you stepping forward.'",
        "'speaker_3': 'I Angelica system of public works. I believe this does not is not associated with the I-70 projects at all.'",
        "'speaker_6': 'So this has nothing to do with the IGA.'"
    ],
    "Second Set of Amendments to the 2016 Denver Building and Fire Code.": [
        "'speaker_8': 'Okay. Thank you. Okay.'",
        "'speaker_6': 'Thank you, Mr. Chair.'",
        "'speaker_2': 'Thank you, Councilwoman. All right, moving on, Madam Secretary, if you please put the next item on our screens. And Councilman Cashman, could you please put Council Bill 1195 on the floor? Thank you, Mr. President. I move the council bill 1195 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved and seconded and I am going to offer up an amendment. So I move that council bill 1195 be amended in the following particulars on page one, line 21 Strike the date of December six, 2016, and insert the date of December 19th, 2016.'",
        "'speaker_2': 'And on page one, line 21, strike the clerk filing number of 20160067003 and insert the clerk filing number of 20160067004. Has been.'",
        "'speaker_1': 'Moved.'",
        "'speaker_2': 'And second, it will go on the comments by members of council and I'll start the comments by explaining the amendment. The purpose of the proposed technical amendments to Council Bill 1195 is to make non substantive changes to reflect an amended filing number and date in which an amended packet of amendments to various international codes were submitted to'",
        "'speaker_2': 'the clerk. The original amendments to the International Fire Code submitted to the Court contained an incorrect piece I reference in IFC Section 913.8.1. or sorry 913.6.1 and incorrect footnote and table entry in table 503.2.1. Both errors have been remedied in the packet of amendments re filed with the clerk.'",
        "'speaker_2': 'The changes are reflected on pages 238. Footnote one at the bottom of page added additional language clarifying the table and 309 on 3.6.1 Change the PSA from 150 to 175. So that's with the amendment. And then says We have this bill called out.'",
        "'speaker_2': 'This is one that I'm really excited about and have had the pleasure of working on a package of updates to our codes that are going through. And one of them is about signage, which doesn't sound like the most exciting thing in the world, but four for me and I think for a lot of people, this is a'",
        "'speaker_2': 'really exciting change to our signage and this is and how we sign single store restrooms. So a restroom that you can go in and lock the door and it's just you inside. And the way our code was set up before was if you had two single stall restrooms or more, you were required to sign them as a'",
        "'speaker_2': 'men's room and a women's room. And what this amendment does is it changes that to require that these single stall restrooms are signed as gender neutral. And I think that this is just a great example of one your government at work for you, because this was brought forward by the people saying, hey, this is a change we'd'",
        "'speaker_2': 'like to see. And I think it's also a great example of common sense in in what we do. And that I think that as we started having the conversations about this to every stakeholder group that we talked about, this was a common sense solution as shared in committee, you know, as a share of a few things as'",
        "'speaker_2': 'I went through this journey, learning about this signage change and starting to pay more attention to the signs that are on the restrooms throughout Denver. But we had, you know, so many different stakeholders at the table talking about how this change of changing something as simple as design was really great for families with children, for transgender people'",
        "'speaker_2': ', for caregivers to achieve potty parity, which was a term I had never heard before, but I had experienced many, many times when my eight year old daughter was standing in line at a single stall restroom when right next to it was another one because it had was marked as a men's room.'",
        "'speaker_2': 'She couldn't use it. And and also our business community when we met with the Downtown Denver Partnership and some of their committees to talk about it, we actually had a business owner who said, Oh, yeah, that's the most ridiculous rule.'",
        "'speaker_2': 'I put those signs up to tell your inspectors, come and check me off, and then I immediately take them down because it's bad for business. It's bad for business to have people waiting in line when there is nothing different about the bathroom across the hall, and they should be able to to use that.'",
        "'speaker_2': 'And so I think that this is, again, one of those commonsense changes that really doesn't make a difference for a lot of people. I know that it's going to personally affect my life and my district on Pearl Street and Broadway, where most of the businesses are already doing this.'",
        "'speaker_2': 'And yet if someone were to call them in prior to us voting, this change through the city would be compelled to take it and find them for having signs that say, Behind this door there's a toilet and anybody who needs a toilet can use it.'",
        "'speaker_2': 'And I think that it's as simple as that. And so I just want to give a quick shout out because there are a lot of people who put a lot of work into this. So to Jill and the entire CPD team, it's always easy to be on this side of the table and say, Hey, I think we'",
        "'speaker_2': 'should do it this way. And then not so easy when you're working with an international building code, it turns out to get to that end result. And so thank you to the LGBTQ commission, who is one of the first groups to bring this forward and say, Hey, maybe there's a better way for us to do this.'",
        "'speaker_2': 'And can we look at this, too? The mayor and the mayor's office, this guy Stuart for all the help and gone through this the downtown Denver partnership one Colorado. And I want to give a big shout out to my colleague, Councilwoman Canete.'",
        "'speaker_2': 'You really helped me through this. We were partners in crime on looking at this issue and and navigating it. And she just has a wealth of experience that was awesome to be able to rely on. So that's we're amending it to make those very boring.'",
        "'speaker_2': 'Changes. But it's it's a it's a great change and a great build. And I think it's reflective of the inclusive city that we are, that we make the most simple thing possible as inclusive and as comfortable for every single person as possible.'",
        "'speaker_2': 'Tonight, when we vote on that vote on the. So with that other comments, Councilwoman.'",
        "'speaker_3': 'Thank you, Mr. President. I want to first, kudos to you. You really did put in a lot of work on this, as did your staff, Maggie. So thank you to Maggie as well and leading in many of the conversations with the business community and others.'",
        "'speaker_3': 'So thank you for your leadership. And, you know, you mentioned families. He also mentioned the the the the gender issue. I one community we haven't talked about as the disabled community. If you're a caretaker of a different gender than the person you may be a caretaker with and you need to use the restroom.'",
        "'speaker_3': 'The single store restrooms are usually big enough for you to use. Sometimes they are the disabled restroom and being able to go in there without anyone questioning you is an opportunity for that community. Have more inclusion. I think, you know, some people may wonder why the LGBTQ commission brought this forward.'",
        "'speaker_3': 'I was just like to do a little public education when we're up here, which is that right now in the state of Colorado, transgender people already have the opportunity to use the bathroom of their gender. If they identify as female, they have the legal right under our laws to use the women's restroom, vice versa if they identify'",
        "'speaker_3': 'as male. But we know that you can't always legislate a comfort level. You can't legislate the fact that sometimes our community doesn't always understand transgender members of our community. We have a lot more work to do to educate about the lives they lead, the very simple challenges that they face, and the many contributions they have to our'",
        "'speaker_3': 'community, just like the rest of us, with their employment and with their their their civic engagement. And so this creates just a choice. It's an option, right? So we're not really changing what was already a civil right that a community had, but we're creating an option for folks in our city.'",
        "'speaker_3': 'And I will just to to to call out the building code, folks. I think that many cities have taken this very simple measure, and they've done it through policy without checking with the building code. And I think that this is an example of how we take common sense steps, which is this is a building issue.'",
        "'speaker_3': 'It's about how you sign things and we fix the building code. And and I think we might be one of the first cities to have done that that way. So. So kudos to them for doing it through the, the simple and common sense way of, of the building code.'",
        "'speaker_3': 'So with that, I will be excited to support this tonight. And I think it demonstrates that while, you know, our community may have questions about inclusion, given some of the world events and some of the backlash we've seen against vulnerable communities, I think Denver has been here on these issues of inclusion, will continue to be here and'",
        "'speaker_3': 'your city will always be a place where people of all backgrounds are welcome and have access to the services they need, like going to the bathroom. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilman Herndon. Thank you, Mr. President.'",
        "'speaker_5': 'This is the deja vu. We had the same process in committee where we all talked about this. And I won't repeat what my colleagues were eloquent in speaking, but it also with this new regulation creates what I refer to as diaper changing station parity.'",
        "'speaker_5': 'It is amazing in 2016, essentially 2017, how I will take my 18 month old into a men's bathroom and there's no place for me to change him. And so this requirement, gender neutral, now allows facilities to be in both stations and both of the restrooms.'",
        "'speaker_5': 'So it's great as a father. So now that burden is no longer on my wife. And so I when I made this comment, that committee, I received an email from somebody else that said, thank you for saying that, because that is something that we should absolutely not be having to deal with in 2016, in addition to certainly'",
        "'speaker_5': 'the greater needs that my count my council colleagues spoke about as well. So thank you from that perspective, as a father of a toddler, that ability that we my wife doesn't have that burden as much as she should.'",
        "'speaker_5': 'So kudos to all. Thank you very much, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. Councilman Hernandez, good to hear you talk like a daddy, because it makes me feel good as well, too, because I for for a long time, I raised my daughter and single dad. And when she needed to use the restroom.'",
        "'speaker_7': 'I'm sending my daughter into this restroom where I have no idea who the heck is in there, hoping that she comes right back out. And those of you who are parents either have a little boy or a little girl, and you send your your kid into the restroom.'",
        "'speaker_7': 'You have no idea who is in there. That's worrisome. And, you know, you start worrying 30 seconds in, you're like, oh, my God, are they okay? Okay. Now I get to actually go in being be at the sink while she's in the stall, making sure she's okay.'",
        "'speaker_7': 'Right. And so and that's you know, frankly, to be honest, this shouldn't be something that's strange or unusual unless you have. The little dude or the lady with the skirt. As on your door. Bathroom door is at home.'",
        "'speaker_7': 'Right? I mean, this is how we have it at home. Might as well do it this way anyway. So I think it's a great it's a great fix for all the reasons that Robin said. Councilwoman, can you just talking about for equity and making sure that we respect that?'",
        "'speaker_7': 'Absolutely. I'm just surprised that it took us this long to realize that it. So anyway. And plus, what if the lady doesn't want to wear a dress? What if she wants to wear jeans? And that representation, I mean, for crying out loud.'",
        "'speaker_7': 'Not all girls wear dresses.'",
        "'speaker_2': 'Thank you, Councilman Lopez. Councilman Flynn. Thanks, Mr. President. Just a quick question. I don't see Jill here. He's right there. Where? Oh, hiding behind the computer term.'",
        "'speaker_5': 'Would it be possible under this change for some small businesses, some low volume businesses, and.'",
        "'speaker_9': 'Pardon the.'",
        "'speaker_2': 'Expression, to be relieved of the obligation to provide a men's in a women's room. Now, could they get.'",
        "'speaker_5': 'Away with just one and save costs? Does the building code require a small space to provide to restrooms? I'm wondering if this could actually save small business money.'",
        "'speaker_6': 'So I'm going I hope my technical folks correct me if I get this wrong. Jill Jennings Garlock, Deputy Director of Community Planning and Development. This change doesn't change the number of restrooms you have to provide. So if you have to provide under the code one man's and one women's, you still provide that.'",
        "'speaker_6': 'They're just one is they're both same gender neutral.'",
        "'speaker_5': 'So there still will be a minimum of two no matter how what the size of the business.'",
        "'speaker_2': 'Okay. That might be something worth revisiting.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you. Just to follow up and clarify on that, there is a level where you're only required to provide one. And it's it's signed, gender neutral or the minimum is two. That's correct. Eric Browning The Denver Building Department.'",
        "'speaker_5': 'The quantity.'",
        "'speaker_2': 'Threshold for a.'",
        "'speaker_5': 'Single bathroom does not change. And that single bathroom, when it's provided.'",
        "'speaker_2': 'Will be required to be same gender neutral. Hmm. Thank you. Thanks for the clarification. All right. So seeing no other comments, madam secretary, raquel espinosa.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Flin i herndon cashman. I can eat lopez. All right. New Ortega II Assessment by Black Eye. Mr. President.'",
        "'speaker_2': 'All right. Madam Secretary, please close voting and health results.'",
        "'speaker_4': '11 eyes.'",
        "'speaker_2': '11 eyes. So Council Bill 1185 has been amended and now we have to vote on passing it. Is that correct?'",
        "'speaker_4': 'Yes. Okay. As amended.'",
        "'speaker_2': 'So, Councilman Cashman, can you please put accountable 1195 on the floor to pass as amended? Thank you, Mr. President. I move the council bill 1195 be placed upon final consideration and do pass as amended. It has been moved and seconded and I think we already got all our comments out of the way.'",
        "'speaker_2': 'So, Madam Secretary, Rocco O. Great. Councilman Espinosa, you have another comment?'",
        "'speaker_5': 'Yeah, I had one question, actually. My still allowed to ask her, is.'",
        "'speaker_2': 'It just the the whole bill is up now, so go.'",
        "'speaker_5': 'For it. Jill, it's really just a clarification on the on the fire side. These minimal unobstructed widths. Is there a height, a vertical component?'",
        "'speaker_6': 'No, it's just a horizontal component.'",
        "'speaker_5': 'So if you had 14 feet or 20 feet of clearance, you can't then bridge over that gap.'",
        "'speaker_6': 'So the bridging of a street, for instance, would be set by the utility easements underneath that. So I believe Denver Water, for instance, requires a 24 foot clear over any utility. I can't say if Denver fire has something different than that.'",
        "'speaker_6': 'Okay. They're shaking their head now.'",
        "'speaker_5': 'This looked like it would be it would be applicable even on interior lots. And, you know, so it's not just true.'",
        "'speaker_6': 'It is it does apply to private streets as well. There's a minimum width in order to ensure fire trucks get access. Yes.'",
        "'speaker_5': 'So there we do have provisions, though, that will allow encroachment over these obstructed I mean, these clear these horizontal clearances.'",
        "'speaker_6': 'I believe so, yes. That would have to go through a process of approval by each utility and other provider.'",
        "'speaker_5': 'All right. It's just something that I'll probably follow up with you, because, sure. If there's a way to put development over the top of these things, somebody in northwest Denver will find a way. So I would like to follow up with you guys.'",
        "'speaker_5': 'Thank you to talk. All right.'",
        "'speaker_2': 'Thank you, Councilman. Seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_4': 'Black by Espinosa. I Flynn, i herndon. I can I can eat. Lopez. All right. New Ortega. Sussman Hi, Mr. President. Hi.'",
        "'speaker_2': 'Madam Secretary. Please close the voting. Announced the results.'",
        "'speaker_4': 'Let's see. Sorry, Espinosa.'",
        "'speaker_5': 'No.'",
        "'speaker_2': 'Lebanese Lebanese counterpart, 1195, has passed as amended. Madam Secretary, please put the next item on our screens. Councilwoman Canete, you have called out comfortable 1231 for a comment. Go ahead.'"
    ],
    "Energy Efficiency Reporting Requirement for Commercial and Multifamily Buildings.": [
        "'speaker_3': 'I was honored to represent the council and really grappled with what are the ways to work appropriately with private sector owners of apartment buildings, commercial buildings, to think about ways to reduce the impact on climate. And so a lot I learned a lot about the many options and the conclusions were that there is more we can do'",
        "'speaker_3': '. And so this ordinance represents the first two steps, which is to, first of all, make sure all those owners know what their energy consumption is. And second of all, to make that transparent. Why transparent? Well, we're competitive in the United States.'",
        "'speaker_3': 'Just making something public makes folks want to do better. Right. And so we've seen in cities that have made this information transparent that, you know, energy usage drops by a couple percentage points just for making it public. We know that, you know, tenants want to know this information.'",
        "'speaker_3': 'Maybe it determines what their payments are going to be for these utilities or they want to be in a green building that matches their their values. So it's important for tenants, for buyers of buildings. So so there's a lot of benefits to making this information public.'",
        "'speaker_3': 'There was a lot of conversation about asking buildings that don't have very good energy scores to do more to make some improvements. Now, that's a hard thing to ask a business to finance upfront, but one of the things we talked about was making sure that those things pay back, right?'",
        "'speaker_3': 'So you get a little you have a little upfront payment, but you earn it back over time as you have lower heating bills or lower electrical bills. And so you really end up even and the climate ends up the winner.'",
        "'speaker_3': 'So the the real consensus with the mayor's office was that it was important for us to learn about the scores and get folks started with these first two steps first. And I'm fully supportive of that. I'm hopeful that we have dramatic drops in energy usage from the commercial sector.'",
        "'speaker_3': 'But I am very pleased that we've committed to come back and talk about this again in 2018 so that we can keep the conversation going and so that if we need to take more action, this is critical. It's critical.'",
        "'speaker_3': 'Denver is connected to the state economy in terms of tourism. If we don't have thriving ski mountains because we have climate change, we are hurting. We depend on the food sources. And so our city is intimately connected to these issues and we have an obligation to stick with this as long as it takes to get it to'",
        "'speaker_3': 'get some impacts reduced. So with that, I'm really enthusiastically supportive. I want to thank the departments that worked on it and especially the stakeholders. We had a lot of owners of buildings, you know, experts and, you know, community businesses that do energy improvements all at the table.'",
        "'speaker_3': 'So for those that are watching or here tonight, I just want to thank you for all your time and encourage my colleagues. I know this is on the consent agenda, but not just to pass it, but to feel good about the fact that we're taking a really important step forward on climate change.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman and Councilwoman Black.'",
        "'speaker_3': 'Thank you, Mr. President. Thank you, Councilwoman Canete, for your hard work on this. I just wanted to give a shout out to our apartment buildings and our condominium buildings. While they are big energy users, they're much more efficient than single family homes.'",
        "'speaker_3': 'And so one of the other issues we talk about as a city is. All in the impact of sprawl on our environment. And single family homes actually are big users of energy, too. And there may only be one or two or three people living in a single family home.'",
        "'speaker_3': 'And if they're far away from the city, people are probably driving. So this is a good balanced compromise, but multifamily buildings are actually much more energy efficient. So just wanted to make sure everyone was aware of that.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_2': 'Thank you, Councilwoman. I'll just jump in that. I'm very excited about this, Bill. Thank you, Councilwoman, for your work representing us. And I hope that we will continue to push harder to be a leader in sustainability on this front and on all the other fronts, because I think that's the city that we we are and we should'",
        "'speaker_2': 'be. All right. This concludes the items to be called out. All other bills for introduction are ordered published. You're now ready for the block vote on resolutions and bills on final consideration. Council members, please remember that this is a consent or block vote and you will need to vote I.'",
        "'speaker_2': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilman Cashman, were you pleased with the resolutions for adoption and the bills on final consideration for final passage on the floor? Thank you, Mr. President.'",
        "'speaker_2': 'I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in the block for the following items. These are all series of 2016 resolutions 1168 1228, 1249 1250 1251 1252, 12, 13, 12, 14, 12, 15 1242 1243, 1245 1246 1236 1237 1238 1241, 1253 1254 1255, 1256, 1263 and bills'",
        "'speaker_2': 'for introduction also series of 2016 919 920 1172.'",
        "'speaker_4': 'Bills on final you'll need bills on final.'",
        "'speaker_0': 'I'm sorry.'",
        "'speaker_4': 'The bills on final. Those on 530 with 1196.'",
        "'speaker_2': 'Not the bills on introduction. 1196 is the first one. Sure. 1196 1218 1226 1083 1084, 1171, 1069.'",
        "'speaker_5': '1189, 1198.'",
        "'speaker_0': '1200 1201.'",
        "'speaker_2': 'And 1231. Thank you, Madam Secretary. It has been moved and seconded. Madam Secretary. Roll call.'",
        "'speaker_4': 'Black. I Espinosa. Hi, Flynn. I Herndon. I Cashman. Hi, Kenny Lopez. New Ortega. I i Mr. President. All right. 11 eyes.'",
        "'speaker_2': '11 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight, there will be required public hearing on Council Bill 1030 for changing the zoning classification for 1209 North Perry Street.'"
    ],
    "Zoning Change for 1209 North Perry Street in Council District 3.": [
        "'speaker_2': 'Easier. Council is reconvened. We have one public hearing this evening. Speakers should begin their remarks by telling the council their names. If. If you don't mind, in the back. We're going to get started.'",
        "'speaker_5': 'We all say.'",
        "'speaker_2': 'It. Excuse me, David. It looks like you have a really adorable baby back there. But if you don't mind, we're going to get started.'",
        "'speaker_6': 'Tony Massaro.'",
        "'speaker_2': 'All right. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses. If you are here to answer questions only when your name is called, come to the podium, state your name and note that you are available for questions of council speakers.'",
        "'speaker_2': '12 3 minutes. Unless another speaker has yielded his or her time, which would result in a total of 6 minutes on the presentation monitor. On the wall you will see your time counting down. Speakers must stay on topic of the hearing and must direct their comments to the council members.'",
        "'speaker_2': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and refrain from individual or personal attacks. Councilman Cashman, will you please put Council Bill 1034 on the floor? Thank you, Mr. President. I move the council bill 1034 we placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved and seconded the public hearing for Council Bill 1034 is open. May we have a staff report?'",
        "'speaker_6': 'Good evening. Theresa is Sarah with community planning and Development. This is a map amendment rezoning application for 1209 north of Perry Street. The proposed proposal is to rezone from general urban multi-unit, three storey and urban edge to unit to general urban residential mixed use five storeys.'",
        "'speaker_6': 'So the property is in Council District three in the West Colfax neighborhood, just north of the Perry Street Station and the Lakewood Dry Gulch Park, three blocks south of West Colfax Avenue, four blocks north of West Sixth Avenue.'",
        "'speaker_6': 'Property is about a quarter of an acre or 11,300 square feet. It is currently vacant. The property owner is requesting the rezoning to prepare the property for redevelopment. So again, the request is to rezone from general urban multi-unit three stories and urban edge two unit to general urban residential mixed use five stories.'",
        "'speaker_6': 'So the general urban context is characterized by multi-unit residential in a variety of building forms. Low scale commercial imbedded in residential areas. Residential uses primarily located on collectors or local streets. Generally in a grid street pattern. So again general urban multi-unit three stories and urban edge to unit C which is a 6000 square foot lot vacant property'",
        "'speaker_6': 'surrounding buildings scale of 1 to 2 stories. And on this map I'm not sure you can see well, but there's a darker orange. Those are three properties that are under site plan review for taking advantage of the M3 zoning and building townhomes or a triplex on the smaller property.'",
        "'speaker_6': 'So we're already seeing redevelopment on this block. Existing zoning general urban multi-unit three storey and urban edge two unit on three sides of the property and south is urban edge two unit. This gives you a little bit of a flavor of the context.'",
        "'speaker_6': 'Property itself is vacant. To the right is the house just north of the property. And then to the right. Lower right is the property across Perry Street. Then, of course, lower left is the Perry Street Station. And then a property across the alley on the upper left.'",
        "'speaker_6': 'Most of them. One or two stories, as we said. So informational notice on this went out to all of the registered neighborhood organizations in the area, as well as City Council on August 25th to notify everyone that we had an application that was complete.'",
        "'speaker_6': 'There was a planning board hearing held on October 19th where planning board voted 10 to 0 to recommend approval of this application. And the application did go to the Land Use Transportation and Infrastructure Committee on November 8th and was passed on to this body.'",
        "'speaker_6': 'And I'm going to take a drink because my thoughts getting dry. And you see here the list of the rhinos that were notified. The West Colfax Association of Neighbors, Sloan's Lake Citizens Group, Villa Park, Neighborhood Association, Denver Neighborhood Association and Inter-Government and Inter Neighborhood Cooperation.'",
        "'speaker_6': 'Today we have three letters of support that were attached to your staff report. So you know the criteria well, consistency with adopted plans, uniformity of district regulations, furthering the public health, safety and welfare, justifying circumstances and consistency with neighborhood context and zone district purpose and intent.'",
        "'speaker_6': 'The plans that apply our current plan 2000 Blueprint Denver and the West Colfax Plan that was adopted in 2006. So comprehensive plan 2000 tells us to protect our air quality by expanding the use of transit and increasing the mix of uses within our neighborhoods to encourage mixed use transit oriented development to determine the potential for transit oriented'",
        "'speaker_6': 'development in our station areas in particular, and encourage such opportunities where it is possible. Blueprint. Denver The land use concept is urban residential, a higher density and primarily residential concept, but does include some complementary commercial uses. The property itself is an area of stability and an area of change.'",
        "'speaker_6': 'It was an area of change. And then the RTD right of way to the south was all an area of stability. And then the alley got relocated to the north of the property. And so we ended up with a little bit of area of stability mixed with the area of change because the blueprint Denver map wasn't changed'",
        "'speaker_6': 'when the alley was relocated. So the street classifications are Perry Street is a main street collector and 12th Avenue is designated local collectors balance, mobility and the land use. So the West Colfax Plan of 2006 has a framework plan that has future land uses and urban design districts.'",
        "'speaker_6': 'And this is the section of the plan that speaks to future rezonings of property, and it does designate this property as urban neighborhood station that should be located. These areas are located within a half, half to a quarter mile of the light rail stations.'",
        "'speaker_6': 'And these the plan says these areas should be single family or multifamily at a scale of 1 to 5 stories. Also in the plan is the concept of growth opportunity, areas that were sort of like areas of change and areas of stability.'",
        "'speaker_6': 'And this property was designated a growth opportunity area where existing housing stock is dated and declining and it might be appropriate to redevelop the area. And this just shows you that urban neighborhood station designation from the West Colfax plan and this is the showing you the residential growth opportunity area.'",
        "'speaker_6': 'It's a little hard to read, but the the red properties are that residential growth opportunity. The other thing that this map shows is multi-modal green streets, which Perry Street happens to be one where the plan talks about beefing up the urban design and the multi-modal use of this street.'",
        "'speaker_6': 'It's important because it connects to Colfax and it connects to the St Anthony's redevelopment. So the land use recommendations out of the West Colfax plan are to recommend higher density for housing diversification and higher density in strategic locations like station areas, main streets and town centers, and to support infill development and mixed use projects and says the'",
        "'speaker_6': 'plan says these are especially appropriate at town centers along Main Streets and in close proximity to transit stops. The West Colfax Plan also designates the area in district plans where it talks about the character of the area and talks about in that section of the plan redeveloping the edges of Villa Park and the West Colfax neighborhood.'",
        "'speaker_6': 'So this just shows you the designation of the Pleasant Hill Station in the West Colfax Plan with that staff believes that this application conforms with all of the plans and furthers the uniform uniformity of district regulations. By going to a standard zone district that's not custom.'",
        "'speaker_6': 'That will have the same rules throughout the city for that zone district and furthers the public health, safety and welfare by implementing the city's plans. Justifying circumstances, its changed conditions, the land or its surrounding environs has changed or is changing to a degree that it's in the public interest to encourage redevelopment of the area.'",
        "'speaker_6': 'CPD believes this criteria is met. There is major investment in this area with the light rail. Metro White Light Rail. Redevelopment of St Anthony's within a half mile are the Knox and Perry Street stations. So this area is definitely undergoing change.'",
        "'speaker_6': 'So we believe there is. Correct. Justifying circumstances. There is changing conditions. And we did talk a little bit about the general urban neighborhood context, multi-unit, residential and a variety of building forms. Low scale commercial embedded within residential areas.'",
        "'speaker_6': 'Commercial uses in a variety of building forms. The X5 is intended to promote safe, active, pedestrian, scaled, diverse areas and activating the public realm. The mixed use residential mixed use zone district. You can have ground storey retail, but you can't have upper storey retail.'",
        "'speaker_6': 'You only are allowed lodging or residential uses in the upper storeys and you can also have a strictly commercial building. But if you have a strictly commercial building over 10,000 square feet, I mean strictly commercial building, then you're only allowed a building of 10,000 square feet in that zone district.'",
        "'speaker_6': 'And there is only one. Building form allowed and that's the shopfront building for. So staff believes that the g r x5 is the appropriate zone district for this property and. And staff recommends approval.'",
        "'speaker_2': 'Thank you very much. We have two individuals signed up to speak this evening. First up, we have Bruce O'Donnell.'",
        "'speaker_9': 'Thank you, Mr. President, of members of the council. My name is Bruce O'Donnell, and my address is 386 Emerson Street in Denver. And I'm delighted to be your last matter of business this year. And before you everybody gets out for the holidays, I am not going to repeat Theresa's entire presentation.'",
        "'speaker_9': 'I'll try to be brief. I do want to point out that we did have good community engagement with two RINO's, as Theresa said, and have positive community input and feedback in support of the application. This is in a blueprint Denver area of change and in the West Colfax plan.'",
        "'speaker_9': 'This calls for tod type redevelopment with five storey heights and hundred percent lot coverage, which is exactly what the proposal on the District of gr5 accomplishes. This zone, district and this rezoning were initiated prior to the moratorium on the slot home form, specifically because this on the street would make it almost impossible to do that with the'",
        "'speaker_9': 'transparency requirements and the build tos and so forth. And so if that is in your mind at all tonight, this is being done because it's consistent with the moratorium and you're thinking on precluding that building for them. I also am available to answer any questions this evening.'",
        "'speaker_9': 'Should you have any? But consistent with the staff recommendation for approval and Planning Board's recommendation for approval. I requested City Council approved MAT in the amendment application 2016 i00026 rezoning 1209 Perry Street to grx5. Thank you.'",
        "'speaker_2': 'Thank you. Next up, David Roybal.'",
        "'speaker_5': 'Hello. Good evening, counsel. Thank you for the honor to speak names. David Roy Bach, Star Citizen, a large 21 or seven cell. Jason Street, born and raised in this area, went to Lake Middle School. This area means a lot to me of the tragedy that we happened that we had there.'",
        "'speaker_5': 'Which are we lost? I went to school with the Mother Lake. It's a part of the Midwest. We we used to have a time we used to have a studio there. It was called Time Council Studio, and we had a store three blocks away.'",
        "'speaker_5': 'So when it says General, General Urban, mixed use, I just hope it's an area that can serve the community and it's something that I want to pay attention to. And I hope constituents on Channel eight are paying attention to of the first rezoning on on the south side of Colfax.'",
        "'speaker_5': 'You know, we already know what happened already on the other side of of Colfax by Lake Middle School. It's a neighborhood I don't know. I don't even know. I grew up there, but I don't look like it. So I just want to be real cautious.'",
        "'speaker_5': 'If this is the first rezoning that's going to start pushing into the West Side that is affecting all of Villa Park because Villa Park actually goes all the way through the whole Lakewood Gulch. And I've been part of the eminent domain, the light rail, since 2007, and I've seen the long, hard battles that was fought for the'",
        "'speaker_5': 'property along there. So it's kind of overdue to see a rezoning there after the light rail. It's a huge transit area from the light rail. Kids walk to there from lake a lot of kids it's a kid access to go to school the nine bus so I just hope that it's something that's good and doesn't change it'",
        "'speaker_5': 'and I just sort to know how they reached out to the Jewish community because that is a huge part of Jewish Denver that's still there, been there for hundreds of years, at least 125 years. And I just speak in support of this, that it's going to help strengthen the community and not bring any gentrification and divide the'",
        "'speaker_5': 'west side. Thank you very much.'",
        "'speaker_2': 'Thank you. That concludes our speakers questions from members of council. All right, Councilman Espinosa.'",
        "'speaker_5': 'Theresa, quick question. Is the e utu c a protected zone district. It is.'",
        "'speaker_6': 'But in this case, there is an intervening right of way. And so.'",
        "'speaker_5': 'And we move that right away to the north of the property.'",
        "'speaker_6': 'But there's still some left now.'",
        "'speaker_5': 'So the E2 C is on the south border where the train track is.'",
        "'speaker_6': 'Yes. And there's some right of way there between the station and the property.'",
        "'speaker_5': 'Yeah. Okay. So enough to.'",
        "'speaker_6': 'Separate the separate. And so the protected district has no effect.'",
        "'speaker_5': 'Great. Because that's that's where I was going with that as I was hoping that we were in a upper story setback situation on the south side of this building. So you're just confirming that that is not the case?'",
        "'speaker_6': 'That is not the case.'",
        "'speaker_5': 'Wonderful. Thanks. No further questions.'",
        "'speaker_2': 'Thank you, Councilman, because we know. All right. The public hearing for counsel, Bill 1034 is closed. Comments by members of council and council. Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. This particular rezoning started pretty early on. It makes one you know, I was very happy with the the community outreach that took place. As you see, one of the neighborhood associations had signed off on it and they didn't get any letters of opposition from either Villa Park or West Colfax.'",
        "'speaker_7': 'We can see it kind of speaks for itself, the fact that it's right on 12th and Perrier, where the light rail station is, this is exactly the kind of density that calls for. It is that area of change.'",
        "'speaker_7': 'But when you when you see where that station is, it's important that that we're able to increase the amount of units and availability for folks to be able to use that light rail station. Otherwise, as a light rail station, it goes through a single family neighborhood.'",
        "'speaker_7': 'And when you look at the West Colfax plan, when you look at the Villa Park plan, a little parks and older plan, it doesn't account for the library or not the library outside the light rail station. But when you go to that West Colfax plan to the north, it does talk about that particular area picking up.'",
        "'speaker_7': 'And when you look at blueprints, you know, long standing call for area of change in that area. This is what it is. You know, back in 2010 when we did the citywide rezoning, you know, we knew that, you know, the opportunity would come where we would actually see more increased development that really utilizes that the West Line'",
        "'speaker_7': 'and to be able to see, you know, this become a little bit tighter of his own district and find out I think it's a. It's a plus for the community. So you know that we have no opposition. I don't have any opposition to this particular rezoning.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Espinosa.'",
        "'speaker_5': 'I just want to thank the applicant for moving forward with our x five because of the shopfront form. I think we can sort of at least your architecture can turn the corner. I hope that it does and address that.'",
        "'speaker_5': 'The Gulch and it does provide some ground for activation if you choose to if the opportunity is there. So hopefully you're open to tell what Mr. Roybal is saying and see if there's any need in the community. But I recognize that once the zoning is in place, it could be 100% residential.'",
        "'speaker_5': 'And so it goes. At least here's a place where the form based zoning code may get it right. We'll see. But that was it. That's all. I do like this as a zoned district in this sort of context, more so than some of the other ones we've allowed thus far.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_2': 'Thank you, Councilman. Seeing no other comments, madam secretary.'",
        "'speaker_4': 'Raquel Lopez. I knew Ortega i black.'",
        "'speaker_3': 'Eye.'",
        "'speaker_4': 'Espinosa. I flinn.'",
        "'speaker_5': 'I Herndon.'",
        "'speaker_4': 'I question can eat, Mr. President.'",
        "'speaker_2': 'All right. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': 'Tonight.'",
        "'speaker_2': 'Tonight, Kels Will 1034 has passed. On Tuesday, January 17th, 2017, Council will hold a required public hearing on Council Bill 1193, changing the zoning classification for 2099 and 2101 31st Street and a required public hearing on Council Bill 1199 Changing the zoning classification.'"
    ]
}