{
    "Proclamation for the 2014 Denver County Fair.": [
        "'speaker_1': 'Mr. President.'",
        "'speaker_2': 'Communications. Madam Secretary, do we have any communications?'",
        "'speaker_1': 'None, Mr. President.'",
        "'speaker_2': 'Proclamations. We have two proclamations this evening, and we're going to start with Proclamation 605. Councilwoman Montero, will you please read Proclamation 605?'",
        "'speaker_5': 'I will. Thank you, Mr. President. Proclamation 605 is welcoming the 2014 Denver County Fair. A big batch of tradition with the side of now, it reads. Whereas the first Denver County Fair in over a century was held in 2011 and was such a huge success.'",
        "'speaker_5': 'It has become an annual event and the Fourth County Fair will be held at the Denver National Western Stock Show complex August 1st through third 2014. And. WHEREAS, The Denver County Fair is a true reflection of all that makes Denver a special and unique place.'",
        "'speaker_5': 'The Fair promotes the vibrant diversity in our city and is a place where citizens can celebrate all things Denver. And. WHEREAS, The Denver County Fair honors the fine traditions and values of America's county fairs, providing the time honored, friendly competition for that blue ribbon for the best garden produce, preserves, pies, handmade crafts, home brew, chickens, goats and'",
        "'speaker_5': 'more. And. Whereas, Denver's four H Club youth will be exhibiting their award winning creations and animals competing for a chance to win ribbons and awards, encouraging their successes. And. WHEREAS, The Denver County Fair also brings the traditional county fair into the 21st century, there's a blue ribbon competition for composting vegan and gluten free creations, speed texting, poetry'",
        "'speaker_5': ', new cannabis and hemp categories. Robots and homeopathic remedies. And. WHEREAS, activities this year include food trucks, daily live demonstrations, competitive eating contests, live local music and entertainment, local shopping in the heart of Denver at the pavilions. And. Whereas, Sunday is Viva Denver Day, it will celebrate our city's vibrant Latino community with themed events that celebrate this amazing'",
        "'speaker_5': 'cultural group. And. WHEREAS, The Denver County Fair is a venue where people share history and traditions but also exchange new ideas and innovations in the heart of Denver, which is forging a reputation as a bustling creative capital for the 21st century, but which is also rediscovering the benefits of locally based, produced food, backyard farming and urban homesteading'",
        "'speaker_5': '. And. Whereas, with Colorado's pioneering spirit for innovation, the Denver County Fair is quickly becoming a model for other fairs throughout the country. This year, the Fair launches its new state of art competition software, a new technology that would be licensed to eager county fairs nationwide after its inaugural in Denver.'",
        "'speaker_5': 'And. WHEREAS, the 2014 Denver County Fair generated approximately $1.5 million for the local economy, and it's estimated that the 2014 County Fair could increase that by 20%. Now, therefore, he proclaimed by the Council of the City and County of Denver, Section one, that the Council hereby enthusiastically welcomes.'",
        "'speaker_5': 'The fourth annual Denver County Fair extends its best wishes for another spirited, successful year and encourage everyone to get out and enjoy the fair in section two that the clerk of the city and county of Denver shall attest.'",
        "'speaker_5': 'And a fix the seal of the county, the city and county of Denver to this proclamation and that a copy be transmitted to Tracy Will and Dana Kane, co-founders of the Denver, the County Fair.'",
        "'speaker_2': 'Thank you, Councilwoman Monteiro. Your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. I move that proclamation. 605 The adopted.'",
        "'speaker_4': 'Second.'",
        "'speaker_2': 'Has been moved, and secondly, comments from members of the council. Councilwoman Montero.'",
        "'speaker_5': 'Thank you, Mr. President. It's my honor to be able to present this proclamation tonight. The Denver County Fair actually has roots in Council District nine, and I'm so very, very proud of it. It's such a unique. And it's.'",
        "'speaker_5': 'Characteristic of the river north and all of the urban farming and the different culture that is coming together in the Denver community. I also am really excited about Viva Denver. That's this Sunday. It includes I really want to see this, a lucha libre Mexican wrestler.'",
        "'speaker_5': 'Is it a wrestling match? Or maybe they're just going to show up a match. Okay. And I saw papaya toss, bilayer, folklorico and a pinata bash. So that is a new addition to this year. This this particular county fair is also gaining more international attention.'",
        "'speaker_5': 'And I was telling my my colleague, Charlie Brown that The View and Jimmy Kimmel actually mentioned our our county fair on television. So we're getting more attention. I'm not really sure why they mentioned it, but maybe you'll share that with us.'",
        "'speaker_5': 'So anyway, I just want to encourage everyone to get over to the National Western Stock Show complex this Friday, Saturday and Sunday and come and enjoy the county fair with us. And I encourage all of my colleagues to please support this.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman Monteiro. Do we have any other comments from members of council? Councilwoman Sharon.'",
        "'speaker_1': 'Thank you. Council President Herndon, I think Judy did a wonderful job on that. I just want to say quickly that the soap opera toss sounds like there might be a lot of sticky fingers. Hee hee. But I wanted to add my name to the list of co-sponsors for this wonderful proclamation.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Sheppard. Councilman Lopez. Mm hmm.'",
        "'speaker_6': 'Thank you. Thank you, Mr. President. I am really excited about the Denver fair. I think it's it's cool where it's at. I went last time and it was it was pretty awesome because I think they had like a geek section for me.'",
        "'speaker_6': 'It was like a sci fi section, wasn't it? Their last time it was really, really cool. There's always something there for everybody in Denver. The fair is starting to become a big symbol of Denver, kind of a microcosm of Denver, everything in Denver and who we are.'",
        "'speaker_6': 'And I think the more we have this fair, the more we attract more people to celebrate who we are, whether it be in suburbia or something else. I never thought this would somebody on my life, but but it's pretty cool.'",
        "'speaker_6': 'I hope they have very good local grown honey for those up years. I got to say, though, speaking of honeys, this is probably the hottest Denver fair poster I've ever seen.'",
        "'speaker_4': 'Who made this?'",
        "'speaker_6': 'This is awesome. It's really cool. This is. This is who we are. I mean, this is somebody from could be from West Denver or the north side or it might even be from from your neck of the woods, councilman.'",
        "'speaker_6': 'So it's really cool. And this is exactly what Denver embodies. So I can't wait to to go over there. Mr. President, you're smiling at me way too much.'",
        "'speaker_2': 'Thank you, Councilman Lopez. We have any other comments by members of council seen on Madam Secretary. Roll call.'",
        "'speaker_1': 'Montero I. Nevitt I. Ortega, Rob Shepherd. Sussman Brown. Hi, Fats. I can eat lemon lime Lopez.'",
        "'speaker_6': 'Hi.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Madam Secretary. Please for the vote. And now the result.'",
        "'speaker_1': '12 by.'",
        "'speaker_2': '12 is proclamation. 605 has been adopted. Councilman Monteiro, is there anyone you'd like to bring up to the podium to accept the proclamation?'",
        "'speaker_5': 'Yes, Mr. President, I would like to bring up Tracy Whale and Dana Cane. I'll see you. Okay.'",
        "'speaker_4': 'I just wanna say thank you so much for giving us a proclamation that really appreciated. We've worked so hard over the past four years to really make this thing a go. And we've had some bumps and but we've gotten through them and we've persevered.'",
        "'speaker_4': 'And we're just so excited to be able to, you know, put on the 2000 2014 County Fair. We've got 12 stages this year. We have 220 events throughout the whole weekend, jam packed with all kinds of music and dancing and all kinds of good stuff painting, speed, knitting, best cheerleading, all kinds of labor competitions that people can'",
        "'speaker_4': 'also get involved with on the spot. We have the new iHeart Denver Pavilion, which is going to celebrate all things Denver. And we also have unicorn rides, which I don't I know there's no county fair that has unicorn rides.'",
        "'speaker_4': 'We also have inflatable land, carnival and Midway Games. Scooby Doo is coming. Councilman Monteiro mentioned the food truck roundup, which we're extending the hours for that, too. So we're really looking forward to really having a great event. Councilman Lopez coming in on our poster and that's that's designed by Marc PENNER Howell.'",
        "'speaker_4': 'He's designed all of our posters up until now. He also designed our 2015 poster, which I brought with me to give you guys a sneak peek. And no one's seen this. This is the first time. So don't tell anybody.'",
        "'speaker_4': 'We're also going to unveil the fair to.'",
        "'speaker_6': 'Oh, I see.'",
        "'speaker_4': 'But they're pretty settled. They're and so yes, there's you know, so, you know, like I said, we really want to be a reflection of Denver and who we are. And we're really beautifully diverse, cultural, you know, destination and the world is watching us, which is really amazing.'",
        "'speaker_4': 'So thank you so much. I really appreciate.'",
        "'speaker_2': 'It.'",
        "'speaker_5': 'Thank you. Thank you. Thank you for taking.'",
        "'speaker_2': 'Thank you for asking. Thank you, Councilwoman Ontario, for that proclamation. Our next proclamation is proclamation 624. Councilman Lopez, will you please read Proclamation 624?'"
    ],
    "Supplemental Appropriation for Liability Claims Settlement.": [
        "'speaker_2': 'It has been moved in seconded. Any other comments from members of Council Councilman Ortega? Did you have any other comments or is that it?'",
        "'speaker_8': 'No, that's a councilman fight.'",
        "'speaker_5': 'Thank you, Mr. President. I had thought a long time because I wanted to make comments about the settlement, but the settlement is not truly before us today. That's going to be coming up next week in the form of a resolution.'",
        "'speaker_5': 'Whether money sits in the contingency fund according to this supplemental or whether it sits in a claims fund is still sitting until we've decided to spend it. And so the fact that there may not be comments coming does not mean that there is unanimity in feeling on the council.'",
        "'speaker_2': 'Thank you, Councilwoman Fox, any other comments by members of the council? Scene nine. Madam Secretary.'",
        "'speaker_1': 'Raquel Ortega.'",
        "'speaker_8': 'Abstain.'",
        "'speaker_1': 'Rob I. Sheppard, I. Susman, i. Brown I. Fights. No. Can each. Lehman. Lopez. Monteiro. I. Never.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_2': 'I come from the Susman. Your votes.'",
        "'speaker_1': 'I'm so sorry.'",
        "'speaker_2': 'Madam Secretary, please call the voting. Announce the results.'",
        "'speaker_1': 'Ten eyes one day, one abstention.'"
    ],
    "Second Amendment to User Agreement with Colorado Symphony Orchestra for Boettcher Concert Hall.": [
        "'speaker_2': 'Tonight one nays, one abstention. Capital 622 has been ordered published. Madam Secretary, could you please keep the next one? This council bill 560 by caught out by councilmembers Nevitt and Lopez. I'll start with Councilman Levitt to see why.'",
        "'speaker_2': 'What you want us to do with this up?'",
        "'speaker_4': 'Thank you, Mr. President. I just. I think I have a question, but I may ask this to be pulled out for a vote as well.'",
        "'speaker_2': 'Well, let me just say, Councilman Lopez, did you have a question or comment or did you want that pulled out for.'",
        "'speaker_6': 'I just had comments, but I'll I'm curious as to what the councilman never wants to do.'",
        "'speaker_2': 'All right, Councilman. Never go right ahead.'",
        "'speaker_4': 'Thank you. Do you want to pull it out for a vote now or will you give me leave to do that?'",
        "'speaker_2': 'I will certainly give you latitude if you want to. Okay.'",
        "'speaker_4': 'Thank you. So this this is the the agreement between the city and county and the symphony orchestra related to the use of the better concert hall. We had this in committee the other day. It seemed like a really great kind of win win where the symphony got their rental fee reduced to a dollar and we got tickets'",
        "'speaker_4': 'that we could give away. It seemed like a great, you know, a great partnership. But the the events over the weekend or at the end of the week seem to sort of gave the impression that this wasn't such a great partnership and that maybe we weren't on the same team.'",
        "'speaker_4': 'And I just kind of want to ask I don't know if there's anybody here from arts and venues who can answer any questions. I see Kent Rice here. I don't know if there's anybody else who can answer questions, sort of what's going on.'",
        "'speaker_4': 'I just sort of, you know, we left committee feeling like we're all on the same page doing a good thing, but it feels less like that now.'",
        "'speaker_7': 'Oh, you. Good evening. Members of Council Kent Rice here, executive director for Arts and Venues for the City. We are doing a good thing here. Okay. So the city needs to close that year concert hall to begin a renovation of some kind or another.'",
        "'speaker_7': 'This will occur in the second half of 2015. The symphony's season happens to bridge 14 and 15. Their season concludes in May of 2015, and because of a forced eviction, if you will, it seems like a fair thing for the city to accommodate the symphony in some way.'",
        "'speaker_7': 'They'll have to find another place to perform in their 1516 season. We came up with the idea to do to distribute tickets to the city's new Imagine 2020 cultural plan. So the agreement calls for $170,000 of symphony tickets to be distributed to people, presumably who would not normally be able to go to the symphony either because they're'",
        "'speaker_7': 'not familiar with it, can't afford it, or maybe it's not their cup of tea. And that is one of the pillars of the Imagine 2020 plan is to make arts and culture more accessible to people. The other hundred thousand dollars, and it's a $270,000 rent abatement thing.'",
        "'speaker_7': 'The other amount, the hundred thousand will acknowledge the city and county as a sponsor of the symphony season, along with the magic in 2020 and arts and venues. So I do endorse the idea of doing this for the symphony.'",
        "'speaker_7': 'I think it's a fair thing for them and I think it will be a very good thing for the people who receive the tickets.'",
        "'speaker_4': 'Great. So can you offer any, uh, can you shed any light on the. I know we've been talking about better concert hall. What the future of metric concert hall is that is the symphony not a party to those conversations.'",
        "'speaker_4': 'I mean, I'm just trying to unpack what seemed like a an act of hostility rather than one of partnership on the part of the symphony.'",
        "'speaker_7': 'So I won't editorialize or I'll say what's going on with with Bashir. We've halted what was an RFQ, a request for qualifications to renovate the hall. And we did that for a couple of reasons. One is that there wasn't adequate money to do a full renovation of Bashir.'",
        "'speaker_7': 'And those of you that have been around a while and most of you have may recall that when the Better Denver bond program was passed originally in 2007, it was for $60 million. Over time, that number became 16.8 for a renovation.'",
        "'speaker_7': 'Once we got the feedback from the architects about what we could do with that amount, it was quite scaled back. Quite scaled back, really. Renovation that didn't meet the needs. We thought of the symphony based on what we knew and what we expected to do for one of our venues in the arts complex.'",
        "'speaker_7': 'So we said, Wait a minute, let's have a conversation about the highest and best use of the $16.8 million, the highest and best use of that for concert hall and the grounds immediately surrounding it. So we began an informal sort of discussion with a number of people, including people who are resident in the arts complex, our cultural'",
        "'speaker_7': 'partners, city people and so forth, to say, what should we do with this money? And one of the ideas that was proposed was to renovate the whole area with a different kind of purpose altogether, to have a lot of different forms of entertainment being performed in an outdoor performance space and perhaps use the physical space where best'",
        "'speaker_7': 'you're currently resides. So that is one of the ideas that we considered it. It is the leading idea, but that's the leading idea among a group of people that have had a couple of conversations. The next path is to have some public convenings to get other people's opinions on this.'",
        "'speaker_7': 'That particular train of thought kind of got out there to the media a little bit ahead of itself. But it's the beginning of a process, not the end of the process. No final decision has been made other than that, we wanted to halt the train that was moving forward to redesign parts here with what we thought was'",
        "'speaker_7': 'an inadequate amount of money to do a good job.'",
        "'speaker_4': 'Okay. Thank you. It still makes me a little uncomfortable to be consecrating a marriage when it feels like the bride is being dragged kicking and screaming to the altar. But you've offered me some reassurance here and that hopefully it'll all work out in the end.'",
        "'speaker_7': 'And I'm not sure I can respond to the marriage metaphor completely. But give me a second. I think this is a long engagement.'",
        "'speaker_4': 'And, you know, we have been living together for quite some time. Sometimes people don't have it before they marry.'",
        "'speaker_7': 'So, yes, a long engagement and then a happy one overall.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman. Before I go to Councilman Lopez, I saw Councilman Ortega chimed in. I just wanted to make sure that. Councilman Ortega, you just had a question and you it. Okay, perfect. Kathryn Lopez, go right ahead.'",
        "'speaker_6': 'I just got thrown off by that whole matter. I think it's more of a friends of benefits conversation. No, I'm just kidding. I, you know, I wondered what the purpose was calling this out. And I just wanted to make comments.'",
        "'speaker_6': 'You know, I know that folks have been hearing he said she said kind of stories and being on the board of the Colorado Symphony. I, I just want I wanted to make sure I'm able to vote. Mr. Bravo.'",
        "'speaker_6': 'Mr. Broadway. I just wanted to make sure being a board member on the Colorado Symphony that I can vote on this bill or if I would have to abstain.'",
        "'speaker_4': 'Yes, you can vote.'",
        "'speaker_6': 'Okay. And the second point was making sure that folks that I was able to express, you know, I haven't been on the board of that. Probably what I feel is a privilege to sit on the board of a great symphony orchestra and other musicians and other folks behind the music, so to speak, and understand where they're coming'",
        "'speaker_6': 'from, but also to represent the city's interests. In terms of my district and sitting on the city council knowing that we have two very great entities and I don't know a single person that has expressed to me there is such disdain that they would rather see the orchestra go somewhere else or the Colorado not have an orchestra'",
        "'speaker_6': 'or the orchestra not be in Denver or there not be a partnership. I think it's you know, for the longest time, I used to think that the orchestra was part of the city, that it was a city orchestra, and it came through city council.'",
        "'speaker_6': 'I couldn't see the separation of either or. And I you know, I just have a lot of faith in your office and a lot of your decision making, but also in our city and our willingness to make sure that an orchestra like the one that we have does not leave our city.'",
        "'speaker_6': 'And I'm sure, you know, there's probably a lot of different complex more a lot of different nuances, a lot of different complexities to such an agreement. But I think that the very soul of it, the very heart of it, I think that the you know, I'd rather see the symphony stay and I'd rather see, you know, us'",
        "'speaker_6': 'be able to accommodate such a great organization. And with that spirit moving forward, I think this this bill that's in front of us does that. It's a good faith agreement between the city and the Colorado Symphony Orchestra, figuring out where to play in 15 and 16 and figuring out, you know, the the lineup and how we move'",
        "'speaker_6': 'together and.'",
        "'speaker_4': 'See the ideas.'",
        "'speaker_6': 'Right. That's up to us. But I don't see this couple splitting up anytime soon. This is an I can't believe I'm going to say this on TV. This isn't a Ben and Jennifer kind of thing. Right. This isn't one of those quick little marriages end so quickly.'",
        "'speaker_6': 'I think this is long term and I can't wait to be there for the 50th anniversary one day. So I just wanted to make those comments. Thank you.'",
        "'speaker_2': 'Thank you. Kathryn Lopez. Before I go to Councilman Ortega, I want to make sure your Councilwoman Shepherd, do you want to call this out or did you just have a question? A question? Just a question. Fantastic. Councilwoman tell you.'",
        "'speaker_2': 'Go right ahead.'",
        "'speaker_8': 'Thank you, Mr. Rice. Two questions. The first one just for the public. Can you remind us where the remainder of the 60,000 that was in the bond issue went?'",
        "'speaker_7': 'Yeah, I'd be happy to. There was 60 million originally. 1 million was spent right away on design and planning for what was going to be a very, very large renovation, perhaps taking down the existing bachelor hall and building a new larger one.'",
        "'speaker_7': '$2 million was used for repairs on the hall in the interim period because there were a number of things that needed to be addressed right away, including leaks in the roof and some new acoustical equipment. The other $57 million was redistributed by a vote of council in the fall of 12 to other cultural institutions in which the'",
        "'speaker_7': 'city has an ownership interest. So that includes Botanic Gardens, the art Museum, the DCP, Nature and Science and the zoo. Also the McNicholas building across the street got some funding. The Champ Street Bridge that connects the convention center into the back of Beecher got some funding and Red Rocks got some funding.'",
        "'speaker_7': 'So the 57 million was distributed among a lot of different cultural assets. Again, 16.8 is the amount that was set aside for Bettcher.'",
        "'speaker_8': 'Okay. And my next question is, can you just give us an idea of what the timing is that the public input process that you talked about?'",
        "'speaker_7': 'Another very good question. It's about 2 to 3 months and we're working on it now, but we hope to sort this out no later than the end of the year and preferably earlier.'",
        "'speaker_8': 'So as you schedule those public meetings, will you let us all know so we can help get the word out?'",
        "'speaker_7': 'Be happy to.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Ortega. Councilwoman Shepherd.'",
        "'speaker_1': 'Thank you, Mr. President. I will refrain from all relationship and marriage analogies because I know I'm just baring myself. But I'll be honest, I'm a little confused because I thought I understood one thing in the middle of last week, and then when the story hit the paper, I found it to be a bit some diverging.'",
        "'speaker_1': 'Directions there. So what I'm not clear on is we're asking the symphony to move out so we can make repairs to the building yet. On the other hand, I'm hearing that the number one thought out there is to potentially tear down the building.'",
        "'speaker_1': 'It doesn't make sense to ask them to move out to do repairs to a building that we're going to tear down or talk about tearing down. So if there is something that I am way off line here, I'd really like to get some clarification.'",
        "'speaker_7': 'I think it's a very fair question. Councilman Shepard, there were several factors in pausing the RFQ. One of them was that we had inadequate money to fund a proper renovation. The second one was, what was the actual future for this symphony in the hall?'",
        "'speaker_7': 'And the symphony had announced that due to some financial challenges, it was considering moving to a church in Capital Hill. I think that was reported in the media. You probably saw that. And another one was a concern that the symphony had about paying the city's existing rental rate going forward.'",
        "'speaker_7': 'And I don't mean for the immediate year prior to the beginning of the renovation, they had concerns about the rental rate for the very long term and the rental rate at city venues in the arts complex for the opera, the Bowery and the symphony are all comparable.'",
        "'speaker_7': 'So it was very difficult to imagine creating a new free rent deal or very low cost rent deal for one cultural organization over another. So the uncertainty of what the symphony wanted to do post renovation led the question to be called What are we spending the money in the right manner and for what purpose?'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'You're welcome.'",
        "'speaker_2': 'Thank you. Thank you. Councilwoman Schaeffer, we have two of the council members chimed in. Robin Kenny. So Rob and Kenny, I want to see if either one of you two wanted to call it out. You just had kind of a question.'",
        "'speaker_2': 'All right. We'll start with Councilman Moran.'",
        "'speaker_1': 'Thank you. Kent, when we were reallocating the $60 million for other cultural projects, I thought the money that was going to remain for Bettcher was going to. I thought we knew we couldn't renovate the whole concert hall and we were going to do I can't say I was terribly excited about it, but do some renovations to the'",
        "'speaker_1': 'lobby. Do I have some facts confused there?'",
        "'speaker_7': 'You're generally on target, but not 100%. So we we had requested $27 million. We thought that was the minimum to do the infrastructure improvements that were required. So, you know, it was a significant amount of money. What we got was the 16.8.'",
        "'speaker_7': 'So almost $10 million less than what we thought was the minimum that the challenge and this was a big issue for us and I think for the symphony as well, is that most of the money would not be seen by patrons or the public.'",
        "'speaker_7': 'So more than 60% of the money would be infrastructure improvements that are required to bring the building up to code. Improve HPC correct some plumbing problems. The lobby could be fixed, but the interior of the hall, which is where people experience the music, where the performers do their job, that the musicians, it would all look exactly the'",
        "'speaker_7': 'same, which is sort of another public policy issue for us. How much money do we spend to improve something when the average person who walks in once they get past the lobby, which would be new, would say, Well, where's the rest of the renovation?'",
        "'speaker_1': 'So in a sense, the scope or the goal to do much more renovation has changed since we reallocated that fund dollars. Just with more thought.'",
        "'speaker_7': 'Is frankly that the scope was there all along. But when we got less money than we needed it, you're right. It directly reduced what we could possibly achieve.'",
        "'speaker_2': 'Thank you. Councilman Robb, before going to Councilman Jersey. Councilman Brown, did you want to call that out or did you just have a question or comment question? Councilwoman, you can go right ahead.'",
        "'speaker_1': 'I guess I'm going to have a question and a comment. First, the comment, which is that I have heard actually from constituents who've been following this whole thing unfolding, particularly, I was actually at a community meeting in Southwest District, Southwest Denver in Council District two and, you know, on a totally unrelated topic.'",
        "'speaker_1': 'But it came up and I feel like what I hear from residents is they feel like it's the city's responsibility to make sure that we keep a symphony in Denver and that it's part of our cultural family. And so I don't hear from them that that there's a certain way that has to occur.'",
        "'speaker_1': 'But I certainly think that I hear that sentiment from constituents, and I, I agree with that sentiment, that I really do think that this is an important partnership. And, you know, as Councilman Brown raised some questions that, you know, were from 60 Minutes, I think that we have to understand that there may be a need for a'",
        "'speaker_1': 'city role for that to occur. And so I think that this is a good contract in the short term because what it does is it financially makes it possible for the symphony to stay for the next year. So I based on the feedback I've gotten from constituents that they want us to step up and they want this'",
        "'speaker_1': 'institution to be a part of Denver, not a suburb, not another part of the metro area, but a Denver piece. It seems to me that I need to approve this agreement today. So that's the the comment, I guess the the concern or the question is whether or not you would be willing we as a city are going'",
        "'speaker_1': 'to be willing to, for example, extend them for a year. If this is unresolved and we're not yet making repairs. I don't want us to be blindly following a schedule that, to Councilwoman Shepard's question doesn't make sense because the renovations aren't ready because we've slowed down the process of contracting or aren't going to happen.'",
        "'speaker_1': 'And so I just I want to get some clarification from you that this agreement we're entering into today could change to the benefit of the symphony, should it occur, that we don't, in fact, need them to move out when we thought so too.'",
        "'speaker_7': 'Common comments. Councilwoman Canete. First, of course, I think everyone wants the symphony to stay in the city and county and frankly to perform at the arts complex. Whether that can happen is partially the responsibility of the city, but primarily the responsibility of the symphony, because the city supports many, many cultural organizations, small and large.'",
        "'speaker_7': 'And it would be, I think, fairly tough for the city to undertake direct financial support for all of the needy cultural organizations in the city. Regarding your second point, of course, if something changes between now and next spring or even before, that indicates that we can't keep the schedule or there's no renovation plan that makes sense.'",
        "'speaker_7': 'We would, of course, do whatever we could to make sure that that they were still resident because we like having them in the arts complex. I mean, they're one of our major partners in the arts complex.'",
        "'speaker_1': 'And my last question, Mr. President, which is I don't want to debate right now whether we should tear down Bettcher and create an outdoor facility. But we have engaged in a major facilities analysis in partnership with Visit Denver and the National Western Stock Show.'",
        "'speaker_1': 'Has the idea that we're considering been studied as part of that analysis?'",
        "'speaker_7': 'Absolutely not. That was not even contemplated. That had to do with the Colorado Convention Center and where was it going over the next 20 to 30 years and much more importantly, the national western and the whole zone and the and DCC.'",
        "'speaker_1': 'Yeah, it was my understanding though that concert venues was a significant question whether or not the National Western needed, whether there was a market for additional concert venues. And so I would just say as a comment that to the extent that, you know, you are engaging this council in that public process over the next few months, what'",
        "'speaker_1': 'we need in the metro area in terms of concert space has to be a relevant question that's considered before that road is pursued.'",
        "'speaker_7': 'So I agree about the need to study it. I think what's very unfortunate and it's kind of has to do with engagement being rocky from time to time. The idea about the outdoor performance space was not the main idea.'",
        "'speaker_7': 'It was whether or not we're using the money properly for the. Taxpayers. That was the key question. But the leading edge of that got reported as an amphitheater. So I understand why it's a topic of discussion.'",
        "'speaker_1': 'One last question, Mr. President. Who was the decision maker that cut the 27 million to 16?'",
        "'speaker_7': 'That would be you. I mean. Well, I think.'",
        "'speaker_1': 'It was presented to us as a recommendation. Of whom, though.'",
        "'speaker_7': 'Oh, there was. I'm sorry. There was a panel.'",
        "'speaker_1': 'There was a selection committee. We were as a whole.'",
        "'speaker_7': 'Councilwoman Lehman was on the committee, and there were, I think, someone from public works, someone from a construction company, someone from the band Sound Foundation, or probably half a dozen people that reviewed all the proposals. And there were a lot of them.'",
        "'speaker_7': 'And then they made the recommendation. You're right, you guys. Just to prove their recommendation. Absolutely.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman, can this Councilman Brown can't.'",
        "'speaker_0': 'There's been a lot of talk about bond money, 16.8 million or whatever. But there was also, if I recall.'",
        "'speaker_4': 'A key role for private.'",
        "'speaker_0': 'Fundraising in this effort. Now, obviously.'",
        "'speaker_4': 'This puts a huge.'",
        "'speaker_0': 'Cloud over potential fund raising and the uncertainty that comes with that. Could you bring us up to date on what has been raised? Where is the money? And is there a chance that some people might, for example, want their money back if this doesn't work out?'",
        "'speaker_7': 'I believe you're referring to the original contract, Councilman Brown, between the symphony and the city to raise $30 million. Is that correct? Yes. So when the 60 million was approved in 2007, the original vision for a renovation, and again, it was a huge, very, very big renovation, had a price tag between 90 and 100 million.'",
        "'speaker_7': 'So the symphony entered into a contract with the city to raise $30 million. So a 50% match against the city's 60 million in bond funding. In the ensuing five years, the city with the symphony, rather, was not able to raise the money.'",
        "'speaker_7': 'And so they came to our agency and asked if the contract could be canceled because they knew that there there was not a path forward to raise that amount of capital to match the city's funds, which is what led to the redistribution of the bond money.'",
        "'speaker_4': 'Do you know how much was raised?'",
        "'speaker_7': 'I don't know. I don't know that they have I think they had some commitments, but I don't know how much that was or what the status of that money is today.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'You're welcome.'",
        "'speaker_2': 'Thank you, Councilman Brown. Thank you, Mr. Wright. Do we have. I see no other questions or comments. I'll just wait a moment. All right. See? And none, ma'am. Secretary, since that was not called out, we'll move on to the next one, which was five, six, three and 564, called out by myself that deal with two concession agreements'",
        "'speaker_2': 'for the airport. And I have a question. And based off of the answer, we will determine if I call it out or not. So I see Aaron in the back. Could you just come on up to the podium, Aaron?'",
        "'speaker_2': 'And my question deals with both of these agreements for Starbuck concessionaires via the activity requirements. What were the goals and where did these two finally end up?'",
        "'speaker_4': 'So the goals for East KDB goals were 40% and their proved participation was 20%. That 20% was achieved through a joint venture with Civil Technologies, which is an AC Eagle or HDB company, and it was also approved through a good faith effort for the remainder.'",
        "'speaker_4': 'So they're going to try and new suppliers to reach the rest of that goal because it is a franchise. They have certain restrictions of who they can purchase from, but they are making a good faith effort to purchase from local suppliers that are HDB approved.'",
        "'speaker_2': 'And for the record, could you introduce yourself and say your title?'",
        "'speaker_4': 'My name is Aaron Barraza and right now I'm doing the government affairs for DIA.'",
        "'speaker_2': 'Thank you so much. Okay, so based off of that answer, I would like to call both of these out in the block. And Councilman Ortega, could you please call and put council bills 563 and 564 to be ordered published in a block?'",
        "'speaker_8': 'Okay. And then I'll make one come and talk to you because I move the council bills 563 and 564, the place ordered published in a block.'",
        "'speaker_2': 'It has been moved in second and I will start with the comments. And so this is about we've had this conversation before with airport has had tremendous success, which we are grateful for. But I think one of the reasons for our success.'",
        "'speaker_2': 'Just deal with the ability to bring in diversity to these concessions contracts. And these concession contracts are seven years old, a seven year contract, and we're missing the boat when it comes to diversity. We have requirements for every concession that comes forward.'",
        "'speaker_2': 'As we just heard, the requirements were for 40%. And of these both of these contracts didn't meet that goal halfway there. And I just think that as a city, we either value diversity were denied. We had a contract come before us previously that was nowhere near the goal at 1%, and I was bothered by that and voted'",
        "'speaker_2': 'against it. And I think if we value diversity, we should put our foot down and say there's a way that you should be able to do this because we either have a standard or we do not if we continue to make exceptions, I don't think that's fair to those that have to work diligently to find minority women'",
        "'speaker_2': 'owned partners in that capacity. So for these two contracts, I will be voting no. And hopefully we can go back to this company and say you should be able to find a way to be able to attain that goal of 40%, because I don't believe we would set a goal for 40% if we didn't realistically think that'",
        "'speaker_2': 'they could achieve it. So. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. We had a previous DIA contract that had talked about meeting the goals with suppliers and that got pulled back into law. Now that we've got yet another contract coming forward that is intended to meet the goals with suppliers, I think this is a slippery slope for the CIA to be going down because, you'",
        "'speaker_8': 'know, I was at an iMac conference not this year but year before and had an opportunity to meet and talk with lots of different operators of airports as well as some concessionaires. And at the time they were aware that this particular contract was moving forward to the city and they knew I was on the city council and'",
        "'speaker_8': 'they bent my ear about the fact that if we were going to allow concessions to be able to meet goals with suppliers, we need to have close to 100% of the suppliers being minority. And it's because the purchase of the various supplies varies.'",
        "'speaker_8': 'It ebbs and flows based on what the need is and and how much of that product is being consumed, whether it's, you know, your equipment purchases to your supplies. It it just does not make sense to think that we're going to meet a 20% goal with suppliers.'",
        "'speaker_8': 'So for those reasons, I'm not going to be voting for these two contracts tonight.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilwoman Canete.'",
        "'speaker_1': 'Thank you, Mr. President. First, a couple questions since I don't serve on this committee doing it, Aaron. First of all, what exactly is this concession space going to be?'",
        "'speaker_4': 'So both of these are Starbucks. They're already existing. They're part of the premium value concessions program. One is a kiosk and one's in line. And they've both been tremendously successful. They they are joint ventures with the minority owned business.'",
        "'speaker_4': 'That's how they reach the 20% for the HDB eagle. Like I said before, they do have restrictions because they are a franchise of who they can purchase from in which materials they can purchase.'",
        "'speaker_1': 'Yeah. So I. Starbucks was good. That's what I needed. Okay. And so second, there are renewal. Yes. They're renewals. And third, Civil Technologies is an engineering and design firm. What is their role as the minority partner?'",
        "'speaker_4': 'They're a part owner. They're 20% owner in this venture.'",
        "'speaker_1': 'Okay. So I guess I'm a little torn on this one because I think that when you're at a certain size of an operation, it's difficult to parcel out a portion for a partner of any kind, minority or otherwise.'",
        "'speaker_1': 'And so, you know, it seems to me like questionable if if you're in a situation where it's kind of a sole proprietorship or a, you know, an operation, I don't know about carving up ownership for the where there's no clear role.'",
        "'speaker_1': 'For example, I mean I don't know what a 20% owner in a Starbucks without expertize in food and beverage is going to be doing. And so to me, that's questionable in and of itself. I mean, that's a it's a great firm and I'm very familiar with their work on transportation and and development.'",
        "'speaker_1': 'But I guess I need to get educated on what the role they're going to play here is. But but I also agree with Councilman Herndon that when you set standards, it's important to keep them. I often feel like we're a little blind with our ownership requirements.'",
        "'speaker_1': 'There are really a lot of ways to build opportunity for minority communities in terms of employment and in terms of training and other things. But to the extent that I do support this policy, I guess I'm going to continue to listen to the debate a little bit.'",
        "'speaker_1': 'But I think it is troubling to set goals and not meet them. It's it's not a good practice. And I agree. I joined Councilman Herndon in voting against some of the McDonald's or I don't remember what all was in that package of franchises.'",
        "'speaker_1': 'But but I am going to listen to the rest of the debate and may need to to vote against this as well.'",
        "'speaker_4': 'You know, also, in addition to this agreement, part of it is that they have to they have to invest a large capital investment to help upgrade the look of the kiosk and to look at the other end line.'",
        "'speaker_4': 'And during those, they can also use subcontract or contractors and subcontractors that are that are actually qualified as well. And these two Starbucks locations are actually part of their revenues. Help to achieve an AC DB revenue of $1.9 million for for this group of projects.'",
        "'speaker_4': 'So there was a substantial investment or revenue for these companies as well.'",
        "'speaker_2': 'Thank you, Councilwoman Kennedy. Catherine Brown.'",
        "'speaker_4': 'Aaron, I don't think you were in fact, I know you were not here, but for some.'",
        "'speaker_0': 'Reason we had we went for years. You guys remember this without a Starbucks at the area. And I recall because I don't know if you remember this, but it was up there. And the terms of the number one and number two complaints that Denver did not the I did not have a Starbucks.'",
        "'speaker_0': 'You guys remember that. So what do they bring in monetarily today? And then secondly, what happens.'",
        "'speaker_4': 'So if these contracts are not approved tonight? So in 2013, the inline store day received $312,000 in rent. And for the kiosk store day, they received $180,000 in rent. And the kiosk for Starbucks gave them $1.2 million in sales, and the end line gave them $2.2 million in sales.'",
        "'speaker_4': 'So they're very successful franchise over idea and very popular, as you said, from by the travelers.'",
        "'speaker_0': 'What happens if these bills do not pass?'",
        "'speaker_4': 'I'm not entirely sure. I'm going to have to. I guess we're going to if these don't pass, I guess we're going to go back to the drawing board. And I don't entirely know that right now.'",
        "'speaker_0': 'Because this is a big deal.'",
        "'speaker_4': 'It's a very big deal. And it's a lot of rent going to day, 312,000 for one of them, under $80,000 for the other.'",
        "'speaker_0': 'You look at half a million.'",
        "'speaker_2': 'Council members and I would say we ask that question of the last time McDonald's. What would happen if those bills were defeated? And the answer that was given, they would go back to the concessionaire and create a new agreement that they would bring to council.'",
        "'speaker_2': 'That was the answer that was given last time. And they did that a pass that they did not have to. Okay.'",
        "'speaker_0': 'I thank you. Thank you.'",
        "'speaker_4': 'I'm a little.'",
        "'speaker_0': 'Concerned.'",
        "'speaker_4': 'I just put it that way. I say concerned.'",
        "'speaker_2': 'Thank you, Councilman Brown. Councilman.'",
        "'speaker_1': 'You're going to have to help me understand, we have a policy or regulatory package at the airport by which we do the premium and concessions. And they have certain rules.'",
        "'speaker_4': 'Right.'",
        "'speaker_1': 'And then we have our requirements for the.'",
        "'speaker_4': 'DBE.'",
        "'speaker_1': 'SB program. So tell me how those two overlap. Are they in conflict with each other or does the premium concession take priority? What concerns me is I want to be sure that we're playing by the rules we put out there.'",
        "'speaker_1': 'If the rules are unfair, we need to change the rules. But I want to be sure we're playing by the rules that have been our policies and practices and not making an exception for Starbucks or for McDonald's in terms of the way those two programs work together.'",
        "'speaker_4': 'All right. So DIA did collaborate with the Concessionaire partners to develop and implement the Premium Value Concessionaire program. It is run by a third party contractor and it rewards the top performing concessionaires with new agreements. They don't have to go back to the RFP process.'",
        "'speaker_4': 'The performance measures include contract compliance, sales and customer service. I do not know if there's a conflict when it comes to incorporating the activity goals into that. I think it's primarily, mostly their performance at the airport when it comes to customer service and sales.'",
        "'speaker_1': 'And so so obviously we're having to make a tough choice between our desire to have a premium concessionaire there in our values for SB DB. So what I would say is, and this may be the reason that Councilman Herndon keeps calling these out, we got to reconcile those two programs.'",
        "'speaker_1': 'And when you can't answer that, we do have a problem.'",
        "'speaker_4': 'Well, like I said, the performance measures, our contract compliance sales and customer service. And because they are part of this premium value concessionaire program and they were a top achiever, they did achieve all of those measures. So they are very high performers at the air.'",
        "'speaker_4': 'I think the AC TB is a separate item.'",
        "'speaker_2': 'All right. Thank you, Councilwoman Robb. Councilwoman Ortega, I'm going to allow Councilman Neville to go since he hasn't chimed in yet. Councilman, never. Go right ahead.'",
        "'speaker_4': 'Thank you, Mr. President. Oh, I think I brought this up. The last time we struggled over this issue. And I get I get confused that the activity program is not is not our program. It's federal program. Yeah, I'm right about that, am I not?'",
        "'speaker_4': 'And so the the the application of and it's a it's a federal program that asks us to meet goals as an airport with respect to active participation in airport concession economy. And in that federal program, we have exceeded the federal goals for active participation in the concessions economy out of DIA.'",
        "'speaker_4': 'So. So we're not meeting. We're exceeding the goals of the federal program. Am I right about that? You are right. Well, just to clarify, the ACW goals are set by the Division of Small Business Opportunity. And actually 2013 was an all time de record for meeting our goals.'",
        "'speaker_4': 'They were up 5.4. 5% last year. So we are exceeding those goals. There was $115 million in activity revenue. Right. So I'm committed to the overall KDB participation. The airport's 39%. Right. So I'm committed to the activity program.'",
        "'speaker_4': 'It's vital and it's important. I just I'm I'm scratching my head a little bit about how much hand-wringing we should do over one particular contract or another. In fact, tell me if I'm right about this, that the establishment of specific goals for specific concessions is a an embellishment on the federal program that we elect to do.'",
        "'speaker_4': 'That's not part of the federal program, federal programs about the airport as a whole. We elect to establish goals for individual concession contracts. That's us, right? Because they do vary. Got it. Okay. I guess I just I just wanted to clarify that, to make sure I understood that we were what we were talking about.'",
        "'speaker_4': 'If it's a federal program, goals are set high. We exceed them. I feel pretty good about that. Yeah, we should hold our concessionaires accountable for trying to reach those goals. But as long as we're exceeding the federal goals, it seems a little funny that we would spend a lot of time wringing our hands over publishing this bill'",
        "'speaker_4': '. Right. And he's making a good, strong effort. And it's I mean, last year was an all time record for us. Got it, sir. Thank you. Efforts are being made and there are a lot of new, you know, Elway's route, Steve snap and dogs.'",
        "'speaker_4': 'There are there's a strong local presence at the airport, too.'",
        "'speaker_2': 'Thank you, Councilman Debbie. Councilwoman Ortega.'",
        "'speaker_8': 'I think the real issue here is are we serious about setting goals and asking folks to meet the goals that we set as they're set on each of the projects? And on this one, you're saying half of the goal was met, 20%.'",
        "'speaker_8': 'And part of that goal is going to be met with suppliers. And I'm arguing that we cannot meet that goal on a consistent basis by utilizing suppliers, because with all of the other concessions across the city, we we ask them to meet that goal on a consistent basis.'",
        "'speaker_8': 'And when you look at the fact that the supply need ebbs and flows, I don't believe we're going to meet that goal on a consistent basis. And that's why I'm not going to be supporting it. I think there's a need for Starbucks.'",
        "'speaker_8': 'Every DIA, every major airport has Starbucks. You know, people look for them in airports. But I think the issue is that I don't believe we're going to be able to meet the goals on this contract, these two contracts, by utilizing by allowing them to meet them with suppliers.'",
        "'speaker_4': 'I'd also like to point out that there are other examples where other concessionaires did meet that goal with a supplier agreement. For example, Hades has 25% of their ACW goal, was met with the supplier. Give me the city park food so it is possible.'",
        "'speaker_8': 'But do they still have a can? Do they have a concession partner that.'",
        "'speaker_4': 'I don't know that detail. But I do know I mean, with that being said, Starbucks.'",
        "'speaker_8': 'Would like.'",
        "'speaker_4': 'To arrange that same percentage. So if they can reach that same percentage that then they can actually see that. AC TB goal.'",
        "'speaker_8': 'I argue that we cannot meet goals with suppliers unless the goal was set way up here. That ensures that on a consistent basis that the goal is being met.'",
        "'speaker_4': 'I understand.'",
        "'speaker_2': 'Thank you, Councilwoman Kathleen Kennedy, Councilwoman Foster, and have the opportunity to chime in. Do you mind if I go with our first couple of five?'",
        "'speaker_5': 'Thank you, Mr. President. I had rung in earlier and then withdrawn my request because Councilwoman Robb was hitting very much the concerns that I had. It seems to me that we have laid out a premium value program that has told people if you do certain things and this goal aspect is not part of that, at least it'",
        "'speaker_5': 'wasn't written down. If you do what we have identified as the criteria, then we will renew you. And I don't see that we should be changing the rules in the middle of a game. If indeed you want to go back and reassess your premium value program and have that as one of the criteria that where everybody agreed'",
        "'speaker_5': 'to that. That would be something that I am very reluctant to say. Now we have a particular contract coming forward that has met the requirements they thought they were supposed to meet. And suddenly we have a different rule for the game.'",
        "'speaker_5': 'I don't feel comfortable doing that and so do feel comfortable approving these contracts at this time.'",
        "'speaker_2': 'Thank you. Councilman five Councilman, can you.'",
        "'speaker_1': 'This is actually a really helpful floor debate, and I'm glad that we're having it because I've learned a lot from listening to my colleagues. So I think one question, which is did they meet the previous goal that they committed to in their prior contract?'",
        "'speaker_4': 'That that was before I was here. I don't know the answer to that, but.'",
        "'speaker_1': 'If you can get that answer, because I think one of the themes that I'm I think what's perhaps less important, I'm not sure why we would set a new, i.e., arbitrary goal on a renewing concessionaire and where that goal setting came from.'",
        "'speaker_1': 'So that's a question that has emerged here. So is it ever realistic for a concessionaire who's a franchise to get 40%? It may not be. Why are we setting it? It's not like this is an open space up forbid, you know.'",
        "'speaker_1': 'So that's confusing. But what is important is that people meet the contractual commitments they've committed to. And so I think that if if they said we could do 20, then they should be measured by being able to do 20.'",
        "'speaker_1': 'And to Councilman Leavitt's point, I have always been supportive of some flexibility in programs like this to be achieved over an entire enterprise where some might overperform and some might underperform. So I think I'm getting more comfortable listening to this debate, but so I'm going to vote for this tonight.'",
        "'speaker_1': 'But I do want to know whether they met the goal that they had in their prior contract, whatever that goal may have been. Absolutely. I think, secondly, we need some clarity and how goal setting is happening, especially for spaces that are already occupied and or our franchises.'",
        "'speaker_1': 'And then I think the third issue, which is the sticky one, you've named some outstanding businesses, Elway's, Steve, Snap and dogs. But if they have an unfair obligation compared to their national branded counterparts, that's problematic for me. I don't want to hear that.'",
        "'speaker_1': 'The answer is McDonald's and Starbucks get off and Steve snap and dogs and always don't. So that certainly still lingers. But I think I can get there pending some information in the interim.'",
        "'speaker_2': 'So so thank you, Councilwoman Kenney. I'm going to chime in for a comment and make sure that I understand this right now and correct me. So premium vrai, the premium value program. So if you are selected as one of the winners, you get to do direct negotiations with the airport without having to have your that entity, that'",
        "'speaker_2': 'concession go out to RFP. Correct. But that in no way changes the fact that every concession contract has to have an activity requirement. Correct? Correct. And those are set by the FBO division, Small Business Opportunity, which is done right here within the city and county of Denver through.'",
        "'speaker_2': 'So I don't believe and thank you for making sure I got that right. And I say this because I would and Chris Martinez, I don't see him in the audience because this would be a great opportunity for him to come and speak to this.'",
        "'speaker_2': 'So he has come to businesses before and talked about how those had been set up. And so I believe that if we set up a percent of 40%, there's an understanding that that should be able to be attained.'",
        "'speaker_2': 'It would it would seem naive to do something so high and not expect him to get that. So I'm of the belief that if SBO can assign a number, they should be able to get that. And to Councilman Neville's point, absolutely, we hit the goal very well in 2013.'",
        "'speaker_2': 'And I think it's because we've had some scrutiny to make sure that each individual concession contract is doing this. We shouldn't have the have other people pull up the slack, especially the slack is coming from large organizations, large companies, which I believe would be easier for them to be able to find a partner.'",
        "'speaker_2': 'So I, I understand and appreciate and support what the airport does. But in this entity, we are starting to have this once again, too many opportunities of making exceptions. And then I don't think we're going to be as successful as we were previously.'",
        "'speaker_2': 'Councilman or take I'm go to Councilman Brown and then I'll come back to you. Is that okay? Yes, Councilman Brown.'",
        "'speaker_0': 'Thank you, Mr. President.'",
        "'speaker_6': 'I must confess that.'",
        "'speaker_0': 'I'm a little surprised by this tonight. I didn't know it was coming. And I hope that we can pass this out tonight on first reading and give the representatives from hosts an opportunity to meet with each and every one of us to lay out their case one way or the other.'",
        "'speaker_0': 'But I'll tell you, I don't want to kick Starbucks out a day. And to do that tonight, I think, would be a mistake. And I think this needs more discussion, whether we delay the bill or whatever you want to do.'",
        "'speaker_0': 'The President. But I'm a little concerned here, frankly.'",
        "'speaker_2': 'Thank you. Thank you, Councilmember. I will go to Councilwoman Ortega.'",
        "'speaker_8': 'So I just want to add that I think this brings some of the procedural steps of the premium value program into question, because what we're talking about is basically repurposing the space of two existing locations that will now have new concepts and the two new concepts or Starbucks at those two locations.'",
        "'speaker_4': 'And so there are already existing Starbucks there.'",
        "'speaker_5': 'These are.'",
        "'speaker_8': 'Existing I thought this was repurposed so that those spaces.'",
        "'speaker_4': 'These two Starbucks are already existing. And they did meet the the contract compliance and sales and customer service from the PBC. So that's why they're just being renewed.'",
        "'speaker_8': 'Okay. So that that makes this even more important.'",
        "'speaker_4': 'Right.'",
        "'speaker_8': 'And glaring to the point that Councilwoman Kinney just made, that we we make our local concessionaires who are going through the application process go through extreme expense and scrutiny. You know, they have to be able to have the cash flow to be able to make the capital investment and be able to pay their staff and all of'",
        "'speaker_8': 'that stuff. And so if we're we're not giving them a pass, but yet when we want large corporations to come in and we're giving them a pass, it it seems like an unfair playing field. And so those are some of the concerns and issues that I have.'",
        "'speaker_8': 'And I've been spending some time trying to really understand the matrix of how the decisions are being made in the premium value program. And I really believe that it's intended to work hand in glove with the ECD program.'",
        "'speaker_8': 'But when these when and particularly when the spaces are being repurposed, it it makes sense that we create more of that level playing field in the way that we we treat the applications, the applicants. So that's it. I'm done.'",
        "'speaker_2': 'Councilwoman Ortega. Councilwoman Montero.'",
        "'speaker_5': 'Thank you, Mr. President. I wanted to weigh in weigh in on this as well. I just want to say that. The interest should resonate with you and the rest of the RIAA to understand that it shouldn't be this hard to come before us and have this kind of debate on the floor.'",
        "'speaker_5': 'I'm not particularly pointing at you. You're the messenger. But what I want to say is that we care about those particular goals, and I care about you being able to go back to the concessionaires and show them, you know, this debate so that they can understand that what we're talking about is very, very serious.'",
        "'speaker_5': 'We understand. I'll speak for myself. I understand the dollars that you're talking about. But what I want you to understand is what I value in terms of the goals and that premium, the premium, whatever category is that. I just think that generally speaking, without going through all the details in the PowerPoint that there should be a value'",
        "'speaker_5': 'in and doing better and understanding what many of us value. And so I am going to vote no tonight unless there's something else on the floor that will delay. The votes may go through, but that even if they do, I wouldn't consider that a victory.'",
        "'speaker_5': 'I would just consider that you got through one set of votes because it shouldn't be this difficult. So I will just wait and hear the rest of the debate and see what's going to happen. But I'll be a no.'",
        "'speaker_4': 'And I also did want to add that the 20% is already met and the with the rest of it, they can actually see that DSP able go ac TB Eagle, I'm sorry, with the suppliers. So it's still possible for them to not only meet but exceed that.'",
        "'speaker_2': 'Thank you, Councilwoman Montero. Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. You know, I told my colleague, Councilman Councilman Brandon, he spoke this night, but I did learn a lot. I think you personally do a very good job. I represent the airport and I don't think this is a reflection on you.'",
        "'speaker_6': 'I know you're just the messenger here, but I know that these goals are very important. These programs are very important and they can't be undermined. And the second we undermine them, we undermine the whole purpose and the spirit of what we stand for.'",
        "'speaker_6': 'Right. And that's making sure that we spread opportunity. And Denver International Airport is the airport in the country. When you're looking for opportunity, it is very successful. People who had a small business in the airport in the eighties is now have now grown to become national players.'",
        "'speaker_6': 'That's how that's that's how successful and that's how important opportunity is at the airport. You have so many people who would do everything they can just to get a space, just to get a kiosk at the airport. It's highly competitive and it also places a lot of people at a disadvantage.'",
        "'speaker_6': 'And that's where we come in and that's why these rules exist. We cannot undermine that disadvantage or not undermine those goals and perpetuate that disadvantage. So, you know, unfortunately, I am going to be support I am going to be voting no on this because I think it's important enough of a message to send back home.'",
        "'speaker_2': 'So thank you. Councilman Lopez, do we have any other comments from members of council? All right. Scene nine. Madam Secretary.'",
        "'speaker_1': 'Rocco Ortega, the Rob Shepherd past Susman Brown. I but I can eat I. Fleeman II. Lopez. No. Monteiro. No. Never. I shepherd. No. Mr. President?'",
        "'speaker_2': 'No. All right. Council members Brown and Sheppard, your votes are hanging. Fire. Councilman Sheppard. There we go. Madam Secretary, please close the vote and announce the results.'",
        "'speaker_1': 'Seven Eyes, five face.'",
        "'speaker_2': 'Seven eyes, five mask. 560 3564 are published in a block. Madam Secretary, please tee up the next one. And this is Council Bill 535 on final hearing. I call this out. And Madam Secretary, I'm going to pull that so we can just have that as part of the block piece.'",
        "'speaker_2': 'All right. Did I make sure I got all of them seen? No, we're good. In all of the bills for introduction are order published and we are now ready for the block votes. Councilwoman Ortega, will you please put the resolutions on the floor for adoption?'"
    ]
}