{
    "Proclamation for the Denver St. Patrick's Day Parade Committee.": [
        "'speaker_1': 'Thank you, Councilmember Cashman. And we'd like to wish a happy birthday to Councilmember Black, who is not here, but whose birthday is tomorrow. There are no presentations this evening. There are no communications. We have one proclamation being read this evening.'",
        "'speaker_1': 'Councilmember CdeBaca, will you please read Proclamation 20 2-0276.'",
        "'speaker_4': 'Thank you. Yes, I can. Proclamation number 22 to 76 congratulating the Denver St Patrick's Day Parade Committee on the occasion of the 60th anniversary of the annual parade on March 12, 2022. Whereas Denver has one of the largest cultural parades in the United States and the largest Saint Patrick's Day parade west of the Mississippi.'",
        "'speaker_4': 'And. Whereas, this year's theme is centered around the return of the Irish and honors the 60th anniversary of the parade. And. Whereas, the Denver St Patrick's Day Parade exemplifies a peaceful celebration among the community of diverse citizens who gather together with a glance toward the Celtic past and a look toward the future while enjoying Irish cultural fanfare'",
        "'speaker_4': ', pipe and drum bands, Irish step dancing and honoring all divisions of our military to the delight of over 300,000 spectators. And. Whereas, we offer our congratulations and thanks to all volunteers of the Denver St Patrick's Day Parade Committee, including many who have passed on but are still remembered for their endless hours and never ending commitment, which is'",
        "'speaker_4': 'what makes this celebration possible. And. Whereas, we hope the Colorado Sun and the Mile High Air lifts the spirits of all who marched or attend the 60th Annual Parade on Saturday, March 12, 2022. And we hope for a warm wind at our backs as we celebrate the Irish culture in the great state of Colorado.'",
        "'speaker_4': 'Now, therefore, be it proclaimed by the Council of the City and County of Denver that the Council hereby congratulates the Denver St Patrick's Day Parade Committee, a volunteer organization on a well-organized, peaceful and spirited gathering at the 60th annual event, and that the clerk and Clerk of the city and county of Denver shall test and affix the'",
        "'speaker_4': 'seal of the city and county of Denver to this proclamation and that a copy be transmitted to the Denver St Patrick's Day Parade Committee President Michael O'Neill. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember CdeBaca. Your motion to adopt.'",
        "'speaker_4': 'I move that proclamation 22 dash to 76, be adopted.'",
        "'speaker_1': 'Thank you. It's been moved and seconded. Comments by members of Council. Council member CdeBaca.'",
        "'speaker_4': 'Thank you very much. Just very happy to have this proclamation this year and actually see a potential parade happening. Last year this was the beginning of everything getting shut down and so very excited to welcome you all here and welcome the parade back to Denver.'",
        "'speaker_1': 'Thank you. Council member. Council member. Flynn.'",
        "'speaker_5': 'Thank you, Madam President. If I could just have some indulgence for a brief period here for a comment. About 17 years ago, I took my kids over to Ireland and we had the honor of visiting in County Galway, the little town where my Flynn ancestors from which they left during the potato famine, to come to America to'",
        "'speaker_5': 'find a better life. And while we were on the way from La Croix to Galway itself, we passed through the the town of Gort, where William Butler Yeats Castle Tours Abahlali is situated. And while we were in there in the gift shop, my kids bought me a a.'",
        "'speaker_5': 'A framed photo or a framed print of one of Yeats's most celebrated poems. It's very short. Madam President, I would like to read it, especially in this time when world peace is being threatened. We need to hear these words from the great Irish poet William Butler Yeats.'",
        "'speaker_5': 'The Lake Isle of Innisfree. I will rise now and go and go to Innisfree. And a small cabin build there of clay and wattles made nine bean rows, while I have there a hive for the honeybee. And live alone in the be loud glade.'",
        "'speaker_5': 'And I shall have some peace there. For peace comes dropping, slow dropping from the veils of the morning to where the cricket sings. There Midnight's All, a glimmer and noon, a purple glow. And the evening full of the linnet swings.'",
        "'speaker_5': 'I will rise and go now for always, night and day. I hear lake water lapping with low sounds by the shore. While I stand on the roadway or on the pavements. Gray I hear it in the deep hardcore.'",
        "'speaker_5': 'Thank you, Madam President.'",
        "'speaker_1': 'Thank you very much, Councilmember Flynn. Those are amazing words and we can always be reminded of that. So thank you so much for doing that and I am very happy to support this tonight and look forward to finally having a parade and celebrating a little bit in our city.'",
        "'speaker_1': 'Madam Secretary, roll call.'",
        "'speaker_3': 'Please see tobacco. I. Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Herndon, i.'",
        "'speaker_3': 'I. Cashman.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Can Eat i. Ortega, I. Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Sawyer, I. Torres, I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce results.'",
        "'speaker_3': '11 Eyes.'",
        "'speaker_1': '11 Eyes. Proclamation 20 2-0276 has been adopted. Councilmember CdeBaca We'll start the five minute timer, if you'd like to invite up. Who's going to accept the proclamation?'",
        "'speaker_4': 'Thank you. I'd like to later invite committee president Mr. O'Neill and whoever else I would like to accept with him.'",
        "'speaker_5': 'Thank you so much for that. Ladies and gentlemen, I just want to start a little bit here. We're one of the few groups that that comes before you each year with a little bit of a serenade from the pipes and a song called Danny Boy before I make my remarks.'",
        "'speaker_5': 'Distinguished members of the Denver City Council. My name is Michael O'Neill and the president of the Denver St Patrick's Day Parade Committee. And I want to start my remarks with my profuse thanks and gratitude to the city itself for allowing us to put the Irish back on the streets this year in the city of Denver.'",
        "'speaker_5': 'I want to also make sure to thank the Office of Special Events, the Denver Fire Department, the Denver Police Department, the City Excise and Licensing Department. And I could go at public works. I could go on and on and on about everyone that is helping us put this parade back on the streets of Denver.'",
        "'speaker_5': 'And as part of that, I'd like to introduce a couple of distinguished members here with me. First, Dr. David Powell, who has been a party committee member for over 25 years, and as our grand marshal for 2022, Mollie Casey, our 2022 Queen, Carlene and Wyatt, our little Mr. Saint Patrick.'",
        "'speaker_5': 'Mr. Shamrock, that's going to be here. But I. I just want to let you know, I had a profound thought here in the last couple of days that it's amazing that we've lived through the last two years of COVID, and we've separated ourselves and we've not had that sense of community that we've had before the advent of'",
        "'speaker_5': 'the pandemic. And it's amazing that it's the Irish community that is now hosting the largest gathering of citizens across our country, starting with the Mile High City. And with that, we're going to have millions of people that are out enjoying themselves and having a wonderful time for the celebration of Saint Patrick's Day.'",
        "'speaker_5': 'And with that, I leave you with our theme. The Irish are back. Thank you very much.'",
        "'speaker_1': 'Will, thank you so much. And we welcome the celebration. And it's time it's time for us to come back. And thank you so much for the beautiful music and being here in chambers together. And our hopes are for a bright, sunny, bluebird, sky, Colorado day for the celebration.'",
        "'speaker_1': 'And so thank you again and congratulations. All right. We're going to go ahead and move on here. Madam Secretary, would you please read the bills for introduction?'"
    ],
    "Contract with HDR, Inc. for On Call Architectural and Engineering Services at Denver International Airport.": [
        "'speaker_1': 'Council Member State Abarca has called out Bill 273 for a vote under bills for final consideration. No items have been called out under pending. No items have been called out. Madam Secretary, please put the first item up on our screens for us.'",
        "'speaker_1': 'Thank you. Councilmember Herndon, will you please put resolutions 171 through 178 on the floor for adoption?'",
        "'speaker_0': 'Yes, Madam President, I move the Council resolution 01710172017301740175017601770178. Be adopted in a block.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. Comments and questions by members of Council on Resolutions 171 through 178. Councilmember Sawyer.'",
        "'speaker_6': 'Thanks, Madam President. I just want to. I see Carolina. I can't see you behind the there's a screen in the way of us wanted to thank the airport for taking these contracts to committee and also to making changes to your reporting structure.'",
        "'speaker_6': 'I am really looking forward to those coming through so that I don't have to keep voting no on these uncalled contracts that we we keep seeing. So thank you very much to all the airport staff for coming and doing that and making those requested changes.'",
        "'speaker_6': 'And I hope that the other city agencies follow Daddy and the airport's leads in creating reporting structures for their on call contracts as well. Thanks.'",
        "'speaker_1': 'Thank you, Councilmember Sawyer. Madam Secretary, roll call on Council Resolutions 22, dash 171172173174175176177 and 178, please.'",
        "'speaker_3': 'Sawyer.'",
        "'speaker_6': 'No.'",
        "'speaker_3': 'Torres. I see. Tobacco, I. Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Herndon, I. Hide. All right. Cashman. Kenny Ortega, I. Sandoval, I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results one day.'",
        "'speaker_3': 'Ten Eyes.'"
    ],
    "Construction Contract for Jackson Gap and 78th Parking Expansion at Denver International Airport.": [
        "'speaker_1': 'Ten Eyes Council Resolutions 22, dash 171 through 22. Dash 178 have been adopted. Madam Secretary, please put the next item up on our screens. Thank you. Councilmember Flynn. Please go ahead with your comments on resolution two, two, two.'",
        "'speaker_5': 'Thank you, Madam President. I have called this out for a one week postponement. Under our Rule 3.7 to next week's meeting on March 14th of the title of the resolution was inadvertently printed incorrectly on our agenda. Its correct on the resolution itself.'",
        "'speaker_5': 'It's correct on all prior agendas. But Madam President, for just inadvertently the title from a the resolution right above it got duplicated. And this will this one week will give the administration time to do the proper and correct notice.'",
        "'speaker_5': 'I know it's a technical paperwork error, but we want to make sure everything is done correctly. Thank you.'"
    ],
    "Third Amendatory Agreement with the Denver Foundation for the Denver Immigrant Legal Services Fund.": [
        "'speaker_1': 'Thank you. Councilmember Flynn, there's no motion required. Do any other council members how many comments on this? All right, scene one Council Resolution two, two, two will be back before the Council for consideration on Monday, March 14. Madam Secretary, please put the next item on our screens.'",
        "'speaker_1': 'Councilmember Torres. Go ahead with your comments on Resolution 219, please.'",
        "'speaker_6': 'Thank you, Madam President. I just wanted to call out and really thank the folks involved with this. Ultimately, I see you in the audience from the Office of Immigrant and Refugee Affairs. This this bill awards additional funds for the Denver Immigrant Legal Services Fund.'",
        "'speaker_6': 'And when this first fund was first started, it was with 100,000 of city funds and $100,000 grant from Vera. This most recent distribution put out just over half a million dollars into community organizations to provide legal services for immigrants, both in defense and affirmative relief.'",
        "'speaker_6': 'And I just want to thank the city and a team's team and the committee for this work and to remind folks that this is an open fund. So this is not just something that's funded by the city. It also takes your donations.'",
        "'speaker_6': 'So businesses, philanthropic sources, community members and residents can also donate to this fund and really make a difference for somebody to have that legal support to apply for citizenship, to renew their license to defend themselves in immigration court.'",
        "'speaker_6': 'So just really want to call out the progress in this effort and think the work of a team. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Torres. Councilmember Kenny.'",
        "'speaker_6': 'Thank you so much, Madam President. I was excited to see that my colleague, Councilwoman Torres, called this out. And I just want to echo her thanks to really the community partners who led, I think back in the day when Councilman Lopez was sitting in this very chair, actually, the very end of the dais was his spot.'",
        "'speaker_6': 'And hearing that call worked with the administration and really pushed, I think, beyond what was the comfort zone at that time. You know, this is critical to our community. These individuals, many of whom have claims to stay in the country.'",
        "'speaker_6': 'They have statuses, but they just don't know how to assert them in court by themselves without an attorney. They are parents of children in our community, which we are responsible for if something happens to them and they're not able to care for those kids.'",
        "'speaker_6': 'They are parts of our community. They work in jobs that are helping to maintain our city. And so we really are interconnected, right? The immigrant members of our community are part of the fabric. And if you unravel that fabric, the entire cloth right.'",
        "'speaker_6': 'Becomes weakened. So I really want to appreciate the way that we have seen this grow. And I want to give kudos to Councilwoman Torres, who's been a champion, and we've got to partner on some of these increases together.'",
        "'speaker_6': 'And I think the one thing I will just add about the donation fund is that, you know, when we see events in the world and I think all had hope that some of the border issues, some of the immigration issues were going to get better in this administration.'",
        "'speaker_6': 'And it's been hard. Congress has been unable to be a partner and to get any meaningful immigration reform passed. And so, honestly, this is as critically needed today as it was in the darkest days of the last administration.'",
        "'speaker_6': 'It hurts my heart to say that I don't think it's for lack of of of desire to make change. But if you feel like you see images of immigrants and refugees and those who are struggling and, you know, the idea of how we keep our community inclusive, please consider contributing.'",
        "'speaker_6': 'Companies should be contributing to this. These are workers in your businesses whose families are affected by this. So so I hope that we can all, you know, become aware of the ways to give our treasure to something that means something to our community.'",
        "'speaker_6': 'So thank you very much. And it's on consent, but I'm very excited that we're going to be voting on it tonight. Thanks.'",
        "'speaker_1': 'Thank you. Councilmember Khanna. Each and my only request beyond my thanks and gratitude for working on this is that we make sure and get out to council offices the information so that we can share it out to our constituents.'"
    ],
    "Repeal of Auditor Subpoena Power and Records Production Ordinance.": [
        "'speaker_1': 'If folks would like to contribute or participate in any way. So thank you. All right. We're going to go ahead and move on. Madam Secretary, if you would, please put the next item up on our screens. Councilmember Herndon, would you please put Bill 273 on the floor for publication?'",
        "'speaker_0': 'Yes, Madam President, I move that council bill 20 2-0273 be ordered published.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. Comments and questions by members of Council on Council Bill 22, Dash 0273 Council members say to Barca.'",
        "'speaker_4': 'Thank you. This is first reading and so it will come up again in front of us. But I want to go on record at this meeting and I'll be a no next reading as not supporting this. As you may recall, I'm a staunch supporter of the auditor's request for subpoena power.'",
        "'speaker_4': 'I believe it's a critical component of his work and to the transparency our Denver residents have so frequently demanded from our government. If you're watching the news, members of the public, there are legal actions being pursued by the auditor for what he believes was an overreach of council's power.'",
        "'speaker_4': 'An amendment in an amendment that made it into this bill when it was passed last spring. There are three branches of government, of course. The mayors, the executive branch councils, the legislative branch and the courts are our third branch.'",
        "'speaker_4': 'There are three branches of government to serve as checks and balances to each other for a reason. Because this issue is in litigation, I feel that it is in fact an overreach for us to pull the ordinance out completely through a flat out repeal, rather than allowing the issue to be resolved either in court or by conducting'",
        "'speaker_4': 'a brand new process to find a better solution mutually. While this ordinance remains in effect. So for that, I'm a note tonight. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember CdeBaca. Councilmember Flynn.'",
        "'speaker_5': 'Thank you, Madam President. I think if I recall last May's debate on this accurately. Most members of this body want the auditor to have subpoena power and would vote that way and in fact, did give him subpoena power.'",
        "'speaker_5': 'He has it. We put a few guardrails in for the in the interest of security of confidential and proprietary data. But this repeal is necessary now and to start over. I agree with Councilwoman CdeBaca. We will start over because we want the auditor to be able to do proper investigations.'",
        "'speaker_5': 'But this repeal is necessary to prevent the waste and abuse of taxpayer money that is triggered by the auditor's ill advised decision to file a meritless lawsuit. Repeal removes any basis for it. The auditor suit asks the judicial branch to usurp the role of city council and hand the auditor a version of the ordinance that could not'",
        "'speaker_5': 'have passed this body. That is an attack on the independence of the council and the separation of powers that we just heard about from Councilwoman CdeBaca. He did this in place of authentically engaging with us. So while the lawsuit is doomed to fail, the lawyers bills to the taxpayer would be all too real and a waste.'",
        "'speaker_5': 'This council last year was frustrated by the auditor's refusal to engage with us in the legislative process and address very real and serious concerns over how he would handle proprietary and confidential data. Because of this refusal, culminating in his absence from the council meeting where the vote was being taken, the final vote, his request for subpoena authority'",
        "'speaker_5': 'that night was headed for defeat. In order to give him that subpoena authority that most members want him to have. I proposed this amendment in order to save the bill. Without my amendment, his bill would have died on the floor with my amendment.'",
        "'speaker_5': 'The auditor would have the authority to subpoena any and all data, documents and information, including complete access to all confidential and proprietary information held by entities being audited. But it allowed those entities, if they chose to require that only, only proprietary or confidential data had to be examined on site instead of being copied and taken away to'",
        "'speaker_5': 'the auditor's office. Since then, the auditor has made many misleading and incorrect statements about this ordinance, most notably that the amendment allows outside parties being audited to withhold information. It does no such thing at all. His decision to refuse examining confidential or proprietary information on site is not the same as being denied access to it.'",
        "'speaker_5': 'Audit subjects had legitimate fears about sending their sensitive, proprietary and confidential data out the door on a flash drive, especially knowing that the auditor would extract that data and upload it into third party applications outside their oversight. So after the ordinance is replaced, is repealed.'",
        "'speaker_5': 'Rather, it is my intention to start outrage over a new bill to reestablish subpoena authority for the auditor in the area, especially of wage investigations and enforcement only at first, which we all want or most of us want, while inviting the auditor reengage on the use of subpoenas in performance and internal audits.'",
        "'speaker_5': 'And we hope, Madam President, for serious cooperation and authentic engagement this time around. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Flynn. Councilmember Sawyer.'",
        "'speaker_6': 'Thanks, Madam President. I just wanted to reiterate points both my colleagues made. I do think it's incredibly important that the auditor have subpoena power. And so I hate to repeal this tonight, but at the end of the day, process matters.'",
        "'speaker_6': 'And the process that we went through is the governmental process of the city and county of Denver. And the judicial branch shouldn't be asked to settle that, especially when it's going to cost taxpayer money unnecessarily. I agree. If the auditor had been prepared a committee, if there had been if they the auditor's office had attended the final'",
        "'speaker_6': 'hearing, you know, maybe things would have been different. But that didn't happen. And process matters. So as much as I hate to do this tonight, I am going to agree and vote yes that we should repeal this ordinance and start the process over again.'",
        "'speaker_6': 'I'm not happy about it, but you know, this is the best choice in order to save taxpayer dollars, which I think is the most important right now. Thanks.'",
        "'speaker_1': 'Thank you. Councilmember Sawyer. Councilman Cashman.'",
        "'speaker_0': 'Yeah, thank you, Madam President. I just this feels to me like a spat between friends. I couldn't have more respect for my colleagues on the dais. I couldn't have more respect for Auditor O'Brien. I think he's done a spectacular job in his time of service to the city, and the level of discourse has gotten heated and to'",
        "'speaker_0': 'me a bit extreme on both sides. But I do agree that rather than turn this matter over to the judiciary, I think the proper path. Forward is to bring this back through the committee structure and see if we can't come up with a policy that serves the the citizens of the city and county of Denver as best'",
        "'speaker_0': 'we can. And but I think it's time for the level of acrimony to come back down to earth again. I was here when this policy was debated. It was a city council doing its best to consider all the elements.'",
        "'speaker_0': 'There's nothing different from this discussion than any other that that we've put forward in my in my time on council. So I look forward to going through the process again and my best to two other O'Bryan. I hope he's having a good evening.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Councilmember Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. I just wanted to iterate some of my comments that my colleagues made and just remind everyone that this is a public city council meeting and anyone is freely and openly willing to attend. And when you have a bill in front of city council as a sponsor, I hope that we make ourselves available for'",
        "'speaker_4': 'questions from this body. Anyone is able to participate. We have people who participate at all of our public hearings on Monday night and they don't need an invitation. This is a public meeting for everybody. And so I ask Ed O'Brien and his team to make sure that to understand that this is a very public process.'",
        "'speaker_4': 'And as we will note that other times, as bills get called out, whoever is bringing the bill forward, we are able to ask robust questions from the bill's sponsor. And this happened to be a bill sponsor from Ed O'Brien.'",
        "'speaker_4': 'And with that, I also admire the work that we he has done and the audits. I read his audit reports. I have learned a lot about his audit reports. I just ran a bill with Councilwoman Cranitch about the Board of Adjustment and I read his report on the Board of Adjustment when I was reading, when I was'",
        "'speaker_4': 'doing that bill. And it had a lot of information that actually I did not I was not aware of. So I do hope that we can bring this forward without costing the taxpayers money to have to go to court.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Sandoval. Madam Secretary, roll call on Council Bill 22, Dash 0273, please.'",
        "'speaker_3': 'See tobacco?'",
        "'speaker_4': 'No.'",
        "'speaker_0': 'Flynn. I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Hi. Hi. Cashman. Can each. I. Ortega. I. Sandoval. I swear. I. Torres. I. Madam President, I.'",
        "'speaker_1': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': 'When Nate and I's.'",
        "'speaker_1': 'Ten I's counsel build 20 2-0273 has been ordered published. That concludes the items to be called out. All of their bills for introduction are ordered published. Councilmembers remember this is a consent or block vote and you will need to vote I.'",
        "'speaker_1': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Herndon, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_0': 'Yes, Madam President, I move that the resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in the block for the following items. 211 2211 91 to 15 to 23 to 20 5 to 26 two 3231 to 30 2 to 24 to 16 to 19.'",
        "'speaker_0': '184. 202205.'",
        "'speaker_1': 'All right. Thank you, Councilman Herndon. It has been moved and seconded. Madam Secretary, roll call, please.'",
        "'speaker_3': 'CdeBaca I Flynn.'",
        "'speaker_0': 'High. Herndon, I.'",
        "'speaker_3': 'Hi, Cashman. How can each I. Ortega Sandoval. I swear i. Torres. I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary. Close the voting and announce the results.'",
        "'speaker_3': '11 East.'",
        "'speaker_1': '11 I. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Council will not take a recess this evening. Our pre adjournment announcement on Monday, April 4th. Council will hold a required public hearing on Council Bill 22, dash 0147 Changing the zoning classification for 2875 North Albion Street in North Park'"
    ]
}