{
    "Purchase of Property at 700 W. Colfax Avenue and 1449 Galapago Street for Court Office Space.": [
        "'speaker_0': 'Madam Secretary, will you please put the first item on our screens? And, Councilwoman Blackwell, you put Council Resolution 590 on the floor for adoption.'",
        "'speaker_9': 'I move that council resolution 18 dash 0590 be adopted.'",
        "'speaker_0': 'It has been moved and seconded questions or comments by members of Council. Councilwoman Ortega.'",
        "'speaker_4': 'Thank you, Mr. President. I'm not going to go into why I am voting no, because I explained that last week and so I just wanted this called out so I could be a no vote on the acquisition of this property at 700 West Colfax and 1449 Galapagos Street.'",
        "'speaker_0': 'Thank you, Councilwoman. See no other questions or comments? Madam Secretary, roll call.'",
        "'speaker_2': 'Ortega Sassaman.'",
        "'speaker_4': 'Black Eye.'",
        "'speaker_2': 'Brooks Espinosa. Flynn I. Gilmore. Herndon. High Cashman. High Carnage. Lopez. I knew. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting and announce the results.'",
        "'speaker_7': 'One is.'",
        "'speaker_0': 'Missing. Somebody.'",
        "'speaker_2': '12 eyes one day.'",
        "'speaker_0': '12 eyes when they counted. 590 has been adopted. Madam Secretary, will you please put the next item on our screens? Councilman Nu, go ahead with your questions on resolutions 842 856 857 858, eight, 59, eight, 60 and 861.'"
    ],
    "Contract Approval for Sanitary Sewer Main Rehabilitation in Council District 1.": [
        "'speaker_6': 'So just 842. Sorry. I would like to.'",
        "'speaker_0': 'Call it just 842. All right, Councilwoman Black, will you please put Resolution 842 on the floor for adoption?'",
        "'speaker_9': 'Yes, I move that council bill 840 to be placed and adopted.'",
        "'speaker_0': 'All right. We it has been moved and seconded. Any other comments on what you made, Councilman Espinosa? Are we ready to vote?'",
        "'speaker_6': 'Yeah, we're ready to vote.'",
        "'speaker_0': 'All right, Madam Secretary, roll call not.'",
        "'speaker_7': 'Very it.'",
        "'speaker_6': 'Espinoza staying.'",
        "'speaker_2': 'Flynn, I. Gillmor.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Herndon, I guess. Cashman I can eat. Lopez I knew. Ortega By Sussman Black Eye.'",
        "'speaker_8': 'Brooks Hi.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_0': 'I am secretary. Please close the voting. Announce the results.'",
        "'speaker_2': '12 eyes. One abstention.'",
        "'speaker_0': '12 eyes. One abstention. Resolution 840 to has been. Ordered. Published.'",
        "'speaker_2': 'Adopted.'"
    ],
    "Alley Vacating with Reservation in Council District 5.": [
        "'speaker_0': 'Adopted. All right. Thank you very much. All right. If you're up with the next screen, next item on our screen, Councilwoman Blackwell, you please for Council Bill 394 on the floor for publication.'",
        "'speaker_9': 'Yes, I move that council bill 18, dash 394, be ordered published.'",
        "'speaker_0': 'It has been moved and seconded questions or comments by members of council or Councilwoman Sussman.'",
        "'speaker_4': 'Thank you very much, Mr. President. Is there somebody from public works here? Sarah Stanek. Thank you. Come. Come on up. This has been one of the more interesting alley vacations in our city. We've had a lot of questions in committee and things have even been happening between committee and now.'",
        "'speaker_4': 'Just to help with a little bit of the history of this. Sarah, in the first sort of question came from a constituent about this alley where they discovered that there was a great deal of encroachment into this alley that the city owned.'",
        "'speaker_4': 'This was about six years ago. And at that time, the city decided they were going to cite the neighbors who had encroached and asked them to remove the encroachments that they had. Then there, about a year or two later, the city decided.'",
        "'speaker_7': 'That.'",
        "'speaker_4': 'Perhaps they would just vacate the alley and not continue with the encroachment. Do you know why the city changed its mind? Yes. Sarah Stanek from Public Works. My understanding is that we did begin in the enforcement proceedings and part of our process for encroachment enforcement is to look at alternatives.'",
        "'speaker_4': 'The vacation was offered as a potential alternative through the enforcement process, and we then received an application for the vacation, which we began processing. The vacation was offered by the city or offered by the neighbors. The neighbors applied for the vacation, the encroachment enforcement through that process.'",
        "'speaker_4': 'Again, one of the options that is presented during the enforcement process is an option to vacate. And the when we received the application to vacate, that was as we were going through the enforcement proceedings. And why does the city think that vacation would be better than enforcing the encroachment?'",
        "'speaker_4': 'The process that we take for all vacations of the public right of way is to review the use, review objections, notify adjacent property owners and determine if the area is serving the public right of way in this particular instance.'",
        "'speaker_4': 'All objections were reviewed and found to lack technical merit and the.'",
        "'speaker_7': 'Alley in.'",
        "'speaker_4': 'Question was found not to be serving the public right of way and could be vacated. Thank you. What is this does not pass and this alley does not get vacated. What will the city do then if the vacation is not passed?'",
        "'speaker_7': 'The alley will remain public. Right of.'",
        "'speaker_4': 'Way. And we will resume the enforcement process. Okay. Thank you very much. If there were a public easement put on the vacation, which there was for for a while, would Mr. Gidley be able to then have access and build his driveway?'",
        "'speaker_4': 'Is that alley were vacated and there were a public easement on it? Would he still be able to build his driveway? I'm not sure I can speak to that. The public works does not have a precedent for those types of easements.'",
        "'speaker_4': 'Within vacated once once an property is vacated once the right of way is vacated. It is private property and we do not have a precedent for determining public easements or cross.'",
        "'speaker_7': 'Access easements.'",
        "'speaker_4': 'Of private property. You don't have. So, gee, I didn't quite understand that answer. So if we did have a public easement on it, you don't know if Mr. Gidley would be able to use it. The easement the easement would be an arrangement between the property owners, the adjacent property owners, and not something that public works or the'",
        "'speaker_4': 'city would have a precedent for determining. And yet it was on the bill for a while before it got off the bill. My understanding is that the private parties were discussing other easements. There is a reservation and an easement for utilities for an Excel transformer that is located within the alley.'",
        "'speaker_4': 'And it's my understanding that the private property owners and their legal representation were discussing other easement options, but that none were filed with this particular vacation. We received a letter today from Mr. Gurley's attorney and saying that if there were a public easement, he would be able to have an alley there if there was public easement on'",
        "'speaker_4': 'the vacation. Is Mr. Gidley here? I would like to ask him a question about that. Would you like to come up and speak to that place, to the microphone? You have to come to the microphone.'",
        "'speaker_8': 'On Mr.. GIDLEY or.'",
        "'speaker_5': 'I'm Josh Porter.'",
        "'speaker_4': 'Which whoever Mr. Gidley thinks is appropriate, either himself or your attorney.'",
        "'speaker_8': 'Oh, yeah.'",
        "'speaker_4': 'Okay.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_4': 'Good evening. Good evening. Just tell me, could you please introduce yourself?'",
        "'speaker_8': 'My name is Joshua Krieger, attorney for.'",
        "'speaker_11': 'Gary Gidley, who you just.'",
        "'speaker_8': 'Saw.'",
        "'speaker_11': 'Resident of 260 leads Dale and one of the adjoining neighbors on this alleyway at issue.'",
        "'speaker_4': 'And you wrote us today to say that if there were a public easement, he would be able to create an alley even though that alley was vacated. Could you tell us a little bit why you think that's possible?'",
        "'speaker_11': 'Just as was recently stated, there's no precedent for it.'",
        "'speaker_8': 'But if.'",
        "'speaker_11': 'The city reserves a public access easement, which.'",
        "'speaker_8': 'As you noticed, Councilperson Sussman.'",
        "'speaker_11': 'Was initially considered here as a mechanism to kind of preserve.'",
        "'speaker_5': 'Access issues in the alley.'",
        "'speaker_11': 'And was this public access easement? We see no reason why the city can't reserve that public access easement for construction. Well, Mr..'",
        "'speaker_8': 'Gidley would need to continue.'",
        "'speaker_6': 'The alley from what is currently.'",
        "'speaker_11': 'Paved and currently blocked by retaining walls and landscaping.'",
        "'speaker_8': 'That is illegally encroaching in the alley by.'",
        "'speaker_11': 'The other neighbors. He would need to construct a continuation of that paved portion, a narrow strip along an edge of what is now the public right of way down to his property. And we see no reason why that can't be done under a public access easement.'",
        "'speaker_11': 'Lack of precedent does not mean anything is standing in the way. It would take some creative problem solving.'",
        "'speaker_8': 'Between the parties and Department of Public Works.'",
        "'speaker_11': 'But we see why that can't be accomplished here.'",
        "'speaker_4': 'I see. Okay. Thank you very much. Again, it means that neighbors have to talk to each other. And I want to ask questions about that, too, because the court, when they came to committee, one of the biggest issues that the committee had was they wanted people to the neighbors to work out some happy negotiations on.'",
        "'speaker_7': 'If the property were going to be divided, how it would be divided.'",
        "'speaker_4': 'I'd like to ask Mr. David Foster up here to talk about the division of the property and what the neighbors have come to an.'",
        "'speaker_7': 'Agreement on.'",
        "'speaker_4': 'About if it's vacated.'",
        "'speaker_0': 'David Foster, 360, South Garfield, Denver. You're on behalf of the whites. Who were the applicants on the location. So the property is you may or may not know once the city vacates, it actually is divided per state statute.'",
        "'speaker_0': 'It's not divided per private agreement. And so what we had discussed is whether or not there was a way to accommodate. Mr. Gidley so that he might have more property than would otherwise be granted to him via the state statute.'",
        "'speaker_0': 'And although we haven't reached agreement with Mr. Gidley, Mr. Gidley has reached agreement with at least one, if not two neighbors to have access and actually ownership of some property so that if the City Council were to vacate the alley, he will be obtaining more property vis a vis the Ali vacation than would otherwise be.'",
        "'speaker_0': 'He would otherwise be entitled to vis a vis the state statute. So per agreements he will be receiving more property than he would otherwise be entitled to under state statute.'",
        "'speaker_4': 'And you all have come to this agreement.'",
        "'speaker_0': 'Again, there is no agreement, but that is something that both the hamrick who are here today, Mr. Gidley, has reached out to his own neighbor, the Seltzers, and I know that he's reached an agreement with them, but you can ask his counsel about that.'",
        "'speaker_0': 'So the people that we can I wouldn't say control, but the people we've discussed and come to agreement with, namely being the Hamrick have agreed to convey property to. Mr.. Gidley.'",
        "'speaker_4': 'Okay. Thank you very much. I see that others have some questions. So I'm going to pass for now. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Flint.'",
        "'speaker_3': 'Thank you. I don't know if you can answer this, but I think Mr. Foster has addressed it already. But under state statute, when a public right of way is abandoned, typically the adjoining property owners equitably split, like if it were an alley that went straight up and down.'",
        "'speaker_3': 'Typically, the owners on either side would divide to the middle and take possession of that. This is an alley that kind of reminds me of an Irish hurling stick. It's really odd shaped and it's dead end and it's got this big area sort of buried in the middle of the block.'",
        "'speaker_3': 'So it's easy to see why over the years, some of the neighbors illegally encroached into it innocently enough, but but not entitled to it. And it cut off the very dead end of the alley that backs up to Mr. Gilley's property.'",
        "'speaker_3': 'So I need to know before I can vote yes on this. That there is an equitable distribution of the property that is agreed on. And it doesn't sound like there is right now today. It's hard to vote on something that's still in process.'",
        "'speaker_3': 'So can you enlighten.'",
        "'speaker_8': 'Us on.'",
        "'speaker_3': 'Where this stands from public works standpoint and maybe Mr. Gilley's attorney and the white's attorney can elaborate on where the agreement stands? It's very hard for me to change a tire on a moving car, and I feel like that's what I'm being asked to do.'",
        "'speaker_4': 'Yes. So public works and the city would not take a position beyond the state statute in the division of the property once it is vacated.'",
        "'speaker_3': 'Let me let me let me interrupt there for to ask you, because one thing I have a hard time imagining is.'",
        "'speaker_8': 'What would do we know.'",
        "'speaker_3': 'Under the state statute what would be an equitable distribution of that really odd shaped property? Has anybody ever attempted to do the trigonometry on that? Did you, Major?'",
        "'speaker_4': 'Looks like someone might have.'",
        "'speaker_3': 'You major in trigonometry, David.'",
        "'speaker_0': 'You know, I did not. I provided that to you, Councilman Flynn. That is a engineered depiction. And I think we need to make sure that we're using the right terms when we're having this discussion. There's the legal.'",
        "'speaker_8': 'Statutory property.'",
        "'speaker_0': 'Division and then there's an equitable right. So those, I think are could be different if if it's strictly what the state statute says, you're entitled to the frontage and councilman. Right. You're you're right. I mean, there's this kind of hammerhead.'",
        "'speaker_0': 'I've called it a hammerhead. And so the analysis has been done that shows who has the linear frontage along that Hammerhead and who would be entitled to certain property along that Hammerhead. I have other copies if others are so inclined to see what that might look like.'",
        "'speaker_8': 'Beyond what the state statute allows for.'",
        "'speaker_0': 'And that's one of the exhibits that you have. What I've shared with you already is you do have an agreement from an abiding neighbor, Mr. Hamrick, to give additional property that Mr. Gately is not presently entitled to. Mm hmm.'",
        "'speaker_0': 'So that goes from beyond the legal to what I would consider more the equitable. More property than he would otherwise be entitled to vis a vis this disposition.'",
        "'speaker_3': 'Right now, I'm looking at the exhibits, and I think there is one of these purporting to be just. Objectively. Here's what the state statute would show, because I thought this was based on what the proposed agreement was.'",
        "'speaker_8': 'There are two. There are two.'",
        "'speaker_0': 'Depictions. One is the state statute. All right. And then the other was more of the equitable division of property that you had asked to see. Okay.'",
        "'speaker_3': 'All right. Thank you. But right now there is there is no agreement between the parties.'",
        "'speaker_0': 'Again. Mr. Hamrick, who is the neighbor, has agreed with Mr. Gridley to convey a portion of his property that would entitle him to more property than he would be entitled to under the state statutory division of property. Okay.'",
        "'speaker_3': 'So to Mr. Gibbons, attorney, what what else needs to be done to proceed with this?'",
        "'speaker_8': 'Well, I'll start by saying that it's.'",
        "'speaker_11': 'Incorrect and misleading to say that there are agreements in place that would give Mr. Gidley.'",
        "'speaker_8': 'More property.'",
        "'speaker_11': 'Than he's entitled to. As it stands. Mr. Hamrick Mr. Lee's neighbor to the west and the seltzer family, Mr. Ghibli's neighbor to the east, each of whom.'",
        "'speaker_8': 'Also border on the alley.'",
        "'speaker_11': 'Have already quit, claimed certain areas of land to Garrett.'",
        "'speaker_8': 'In return for various work Garrett has done on them on their properties. So Garrett of.'",
        "'speaker_11': 'He'll only get what he's entitled to under state statute. We realize that. But there are no agreements in place. Garrett is now in a position to gain more land than he would have. In June, May and June, when these quick claims occurred.'",
        "'speaker_11': 'But as it stands right now, there are no agreements that would allow Garrett to gain more property than he would be entitled to. Right now.'",
        "'speaker_8': 'He's just been able to achieve.'",
        "'speaker_11': 'Presumably under operation of law from the statute, which by admission is quite vague. The statute has two parts to it. If it's a.'",
        "'speaker_8': 'Straight right angle.'",
        "'speaker_11': 'Public right of way. As you noted, everybody just comes out to the middle line where where there aren't where it's the dead end portion. It's fairly vague and says, you know, to the adjoining landowners, essentially it's what it says.'",
        "'speaker_11': 'And I think we can agree that there's probably a frontage percentage calculation that goes on. And I think independently on each side, we have kind of come to some independent conclusions about. The Straight. There are two very straight, predictable portions of the alley that will vacate those owners right to the middle.'",
        "'speaker_11': 'And then for the remaining hammerhead dead end portion of frontage percentage calculation will go into play. But that's really anybody's guess. I think if this were to end up in a court as a quiet title action. Right. It could be a pizza pie.'",
        "'speaker_11': 'It could be straight lines. It would just be a percentage. I will note that following committee in June, we on invitation of Mr. Mr. Foster provided some settlement proposals and didn't hear anything on those for more than three months until Friday before this meeting I where a map was attached to a response to that that was outdated'",
        "'speaker_11': 'contained inaccurate information such as the new deeds. So we were just kept in the dark on this and it was kind of sprung on us to have to analyze this.'",
        "'speaker_3': 'Okay. We can't thank you. That's enough for that, because I see that there's shaking of heads. And also, I don't want to get into the into the private details of the transaction, but I think that's enough. And I think we're all going to need a vacation after this.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn. Councilman Espinosa.'",
        "'speaker_6': 'Questions for Mr. Foster and Public Works. Mr. FOSTER. So there are currently at least three property owners and three encroachments sorry that that are sort of beneficial for access today. Is that correct?'",
        "'speaker_0': 'Only two properties that actually use the property for access.'",
        "'speaker_6': 'And there is at least that much agreement that if we what we know is that if the land is vacated, some owners might get something and other owners might get other things. And with those two that are currently benefiting from those encroachments, have agreements among themselves that they're going to continue working together to maintain the access that'",
        "'speaker_6': 'that they now currently have and sort of co utilize that?'",
        "'speaker_0': 'That is correct. It would.'",
        "'speaker_8': 'Be.'",
        "'speaker_0': 'The only thing that I will tweak there is that there is a third owner who doesn't use the alley. It's on the other side of their fence and they don't have any reason for this particular property. And my clients have been in communication with them to purchase that should the alley vacation come to fruition.'",
        "'speaker_6': 'So essentially the historic utilization to date will be maintained?'",
        "'speaker_0': 'That is correct.'",
        "'speaker_6': 'Okay. So to to to my colleagues, you know, that is actually more information than we have on any vacation that we've approved in the three years that I've sat on this seat. You know, we usually approve these things and then let the state do it.'",
        "'speaker_6': 'I mean, let let the lines sort of fall where they may. So what we actually have is actually general consensus that the current sort of multi means shared access that has been used to date is there. So my question to public works so well.'",
        "'speaker_6': 'And so yeah, so I'm concluding that, yes, we have more information to preserve current access and current encroachments that the city has already now deemed okay because they don't need the land provide. So but the current situation is that is in fact right of way.'",
        "'speaker_6': 'So if, if Mr. I mean a script the names if the if if if Garret were to you know, we have a lot of developments, particularly in my district where there's existing alleyways that are improved to some degree, usually not improved.'",
        "'speaker_6': 'I have seen developers replace entire alleys as part of their development since we have the right of way today. Could could Mr.. What's his name? Sorry, Mr. Gately. Could Mr. Gately come to the public works and say, look, I will I will construct I would like to access my property from the hour from from this right away'",
        "'speaker_6': '. And I would do improvements to city standards from the from the entirety, from the existing street right away across this right of way to my home. And would that be acceptable to public works if they met all city standards for alley right away.'",
        "'speaker_4': 'I may need to call up one of our representatives from right away services to answer that. The city has no plans at this time to improve that alley as to whether or not we would accept a private citizen essentially making that offer.'",
        "'speaker_4': 'I will have Jim Barwick this evening.'",
        "'speaker_8': 'I'm Jim Barwick with Public Works right away services and I think the whole point of the vacation would be lost on that. I don't know how to get the other people to agree to that. Like she said before, we don't get a precedent like of vacating an alley and then an access easement.'",
        "'speaker_6': 'No, no, no, I wouldn't. I'm talking about if if if at the time when he came in and said, hey, I want to I want access, when the city thought he had alley access because there's a right away on a map and then they realize that actually it doesn't exist.'",
        "'speaker_6': 'If he had said, oh, I will do that, I will construct that alley for a public benefit. Would would the city would public works review that and consider that and maybe even approve it if it most likely?'",
        "'speaker_8': 'Yes, if you decided to. But from what I understand out there, the. The amount of construction would take to do that would be pretty immense. But yes, the answer is probably yes.'",
        "'speaker_6': 'So those are the two those are the answers I wanted, because what I've been doing, I mean, I sort of this is borderline commentary, but I think my colleagues should know this is that I've seen it both ways.'",
        "'speaker_6': 'And it occurred to me, too, that that, yeah, a proper alley could in fact be constructed there and in fact, reached out to Mr. Gidley and suggested that approach. And that approach has never been fulfilled. And so at some point, me personally and I can take this position because this is not a quasi judicial matter, I'm like'",
        "'speaker_6': ', no, the standards are the standards. You meet them or you don't. And if you're in if you're not content with with doing that and satisfying what the city expects from us, Ali, improvements, then we're at an impasse and that the appropriate thing is to follow through with the vacation and let the let the castles fall where they'",
        "'speaker_6': 'may because we have deemed it if we vote that way, that it is no longer a piece of property that the city.'",
        "'speaker_8': 'Yes, I believe that's correct.'",
        "'speaker_6': 'Right. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman.'",
        "'speaker_10': 'Real quick, sir. What's the. Well, if this vacation's approved, what's the status of that Excel equipment? As in and.'",
        "'speaker_8': 'I know.'",
        "'speaker_4': 'There is an easement for to maintain the Excel transformer so it will remain.'",
        "'speaker_10': 'Sale. Stay. Yes.'",
        "'speaker_4': 'Yes.'",
        "'speaker_10': 'Thank you very much.'",
        "'speaker_0': 'Menu. Councilman Sussman Okay. If I go to Councilwoman Ortega, of course.'",
        "'speaker_4': 'Councilman Ortega So I just want to clarify. If the. Mr. is that Garrett is provided more land than what he is entitled to, as was stated by David Foster. Does that still give him access? I didn't hear that answered clearly.'",
        "'speaker_4': 'To be able to get to the back part of his property off of that street. So if somebody could answer that question.'",
        "'speaker_11': 'It would not anything around. Mr.. GIDLEY As I guess, entitlements upon vacation is buried deep within that dead end of the alley, and he would still be isolated from the actual paved portion that the other neighbors are currently accessing.'",
        "'speaker_4': 'So in your mind, what solves that is a public easement that would grant access not only to him but to any of those property owners off that alley, regardless of which side of the the alley, it's you know, it abuts up to the different property owners on both the east and the west side.'",
        "'speaker_11': 'Yes. Either an easement or no vacation at all. And the city enforces the public right of way.'",
        "'speaker_4': 'Okay, Sara, the map I'm looking at shows that that is a concrete alley, not all the way. There is a section of a paved roadway extending from the north about some some feet below. It is unimproved after that.'",
        "'speaker_4': 'Okay. And so public works is not wanting to put a an easement on that alleyway once it becomes private. Is that what you're saying is what would set a precedent? Once it becomes private property, we would have no it would be private property.'",
        "'speaker_4': 'The city would have would have would not have a role in placing an access easement on it. Do we not have access easements for various utilities and other infrastructure on private property around the city? We do and I will.'",
        "'speaker_4': 'It looks like the city attorney's office can explain a little further.'",
        "'speaker_12': 'Hi, this is Brandt Eisen from the city attorney's office. If we wanted if there was going to be a public access easement, we would need to reserve that within the the vacation ordinance itself. Just like we're reserving the Excel easement, it would be through the entire alley, and it would necessitate that some of the neighbors that have'",
        "'speaker_12': 'improvements in the alley would need to remove those improvements. Is my understanding of to have full access, obviously. So it is essentially is like not vacating at all if you're doing it at one point, the portion that we were talking about previously there was going to be a public access easement was for two separate driveways at the'",
        "'speaker_12': 'top part at the hammerhead part of the alley. If we were to reserve an access easement through the entire alley, neighbors would need to remove parts of. I'm not sure what what dimensions they would need to remove, but they would need to remove improvements that are currently in the alley.'",
        "'speaker_4': 'So I can't tell from looking at this map if there is any access from what looks like the. I'm not sure if that's the north end on this map. It's the blue shaded part where Mr. Garrett's property is.'",
        "'speaker_4': 'Is there any access to Mr. Garrett's property from anywhere other than that current alley off the West Side or what looks like maybe the north side? Maybe it's a cell phone. I can't tell.'",
        "'speaker_12': 'I don't know. Yeah, I don't know the answer to that. Yeah.'",
        "'speaker_11': 'Jarrett's only vehicle access is off of Leeds Dale Drive. And when it was described a few moments ago that after the paving on the straight portions of the alley, that it's unimproved, it's unimproved and that it's not a paved alley.'",
        "'speaker_11': 'But the neighbors have put retaining walls. They've changed topography, they've expanded their backyards.'",
        "'speaker_8': 'They've planted trees in the alley. So it's improved in a personal property perspective, and that's what's blocking my clients access.'",
        "'speaker_4': 'Even though it's currently. Public right of way.'",
        "'speaker_11': 'Since it was platted and dedicated.'",
        "'speaker_8': '60 years ago. Yes.'",
        "'speaker_4': 'Okay. All right. Thank you. I have no further questions.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Sussman, you back up?'",
        "'speaker_4': 'Yes. And you can see how complicated this particular project has been. Sara, I have some questions and that's it's probably looking forward. The city wasn't paying attention when these encroachments happened. And it has caused this kind of, you know, worry between neighbors.'",
        "'speaker_4': 'And I'm wondering if the city has got a plan to using perhaps our wonderful GIS system to sort of study the cities to make sure that this sort of thing is not happening in many other places in the city.'",
        "'speaker_4': 'As of right now, our process for enforcement within the right of way is is to respond to issues as they come to our attention. That is certainly something that we could could review what that process looks like and throughout the city, what we might be able to do to improve how those things can come to our attention'",
        "'speaker_4': '. But we are not currently planning to go out and do proactive encroachment patrols throughout every alley and piece of right of way in the city. But we can we do respond when the issues come to our attention as of in this case, from neighbors or other issues that come up.'",
        "'speaker_4': 'I certainly wouldn't expect you to do patrols, but I would think perhaps we could invent something with gas to take a look from a bird's eye view. Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Councilman Espinosa.'",
        "'speaker_6': 'Yeah, David, I don't know if you have the answer to this, but maybe somebody else does. Do you know what the value of land is in this neighborhood? Because this is not an inexpensive place to live.'",
        "'speaker_0': 'I mean, we've had the property appraised.'",
        "'speaker_6': 'But do you know what the square footage of dirt is?'",
        "'speaker_0': 'I we. We have an appraisal that has that. I can't give it to you right off the top of my head. I mean, it's not it's not inexpensive.'",
        "'speaker_6': 'So it's safe to say, though, that pretty much everyone who borders that right away today stands the possibility of gaining land, except for the well, except for the actual applicant that filed for no money.'",
        "'speaker_0': 'They will be. Yeah. I mean, what, because it was dedicated at the time that it was platted. So some developer gave that land to the city 60 or 70 years ago. And the city is in the process potentially of giving it back, you know, to the subsequent owner, you know, 60 or 70 years later.'",
        "'speaker_0': 'Yeah, they're not paying for it. It goes back on the on the tax rolls as well. And it's taxed. I just I want to just make a clarification mostly for Councilwoman Ortega, because we haven't had a chance to talk about this.'",
        "'speaker_0': 'This property has been planted for 70 years. And for 40 of those years, Dr. Paul Stead, who's not here, actually took care of the city's property and he kept it as a community garden. And everybody had fruits and vegetables as a result of him maintaining the city's property because the city wasn't maintaining its own property.'",
        "'speaker_0': 'And and so.'",
        "'speaker_8': 'A.'",
        "'speaker_0': 'Garage was built with access off of this driveway. And my client's home was built before they purchased it with access off of a driveway. And the city approved those things using this as the access point to both of those improvements.'",
        "'speaker_0': 'So much to Councilwoman Testaments point. Yeah, I mean, there's some ownership that I think the city has to have in terms of how this circumstance has led itself to a half an hour or 45 minute conversation on a monday night, which is the first time I've experienced this kind of a conversation here and for many of you'",
        "'speaker_0': 'as well. But notwithstanding all of that, this is not.'",
        "'speaker_8': 'Necessary for even Mr. Gidley to have access, because he's had.'",
        "'speaker_0': 'Access off of lead steel. That home has had access off of lease sales since 1960 when the home was built. And that is and nobody is entitled to more than one point of access. It should be noted as a clarification that this issue arose to a site inspection because Mr. Gidley had sought a permit to build a'",
        "'speaker_0': 'new garage off of leads. Dale which is what resulted in the inspector coming out and noticing that there was this issue of the alley because the inspector thought.'",
        "'speaker_8': 'That the garage was supposed to be built off an alley that doesn't exist. That's how this whole thing started, because Mr. Gidley was building an improvement to his garage off of Lisa Dale. And that's the history.'",
        "'speaker_6': 'So one question to Mr. Diddley's attorney as well, because, you know, I tried to remedy that very situation, but that that entire history is very clear to me. And so but so too, to that point ish, Mr. Gidley might stand the possibility of getting existing right of way if if a vacation was approved by this council, Mr.'",
        "'speaker_6': '. Gidley might stand to get some land as part of the subsequent parceling out of that former right of way, you know, which would eventually essentially expand the land area of his property, which would be available for backyard or development or other sort of personal use.'",
        "'speaker_6': 'What that he doesn't have or would never have with Right of Way. Is that true or not?'",
        "'speaker_11': 'That's absolutely correct. And Garrett would happily improve upon whatever land, whatever title vests in his name after vacation. But windfalls of land and cash have always been secondary tertiary to Mr. Hadley's primary concern here, which is safe access through the Ashley Weed Stables as a state highway, frequent accidents outside of his driveway.'",
        "'speaker_11': 'If you know the intersection of Alameda and leads Dale it's a very busy, very congested area. The driveway to the southeast of Garrett was blocked up and a wall was created because it was unsafe. And the neighbors moved their access over to the street, to the east.'",
        "'speaker_11': 'Not recalling what that street is, but it's primarily been an issue of access, and we've reiterated that throughout this entire process when I've been on board for the past year. Garrett For the years before that, that safe access through the alley.'",
        "'speaker_8': 'As the other neighbors are also able to enjoy has been Mr..'",
        "'speaker_6': 'Gately, as you understand that that entire time, if you've been on board for one year, Mr. Gidley has had for that entire time the ability to go to right away with the drawings showing a proper alley being constructed by him from the road to the north all the way across.'",
        "'speaker_6': 'Relocating the transformer. Getting through those approvals all the way to his house. Not saying it, it would be a done deal because granted that transformers in the way. So there's a whole lot of work that could have been incurred occurring over this last year in good faith towards getting to a right of a proper alley that meets'",
        "'speaker_6': 'city standards the way any other developer would do, and that has not occurred. Do you understand that? That has always been an option?'",
        "'speaker_11': 'We are. And to my understanding, when Garrett approached the city several years ago, he was essentially told that it wasn't possible because of the improvements. It's a vicious chicken or the egg situation where the we are arguing for the legal status of the alley.'",
        "'speaker_11': 'The whites and the other neighbors are saying it's some sort of current physical use of the alley. So we we attempted that and we ran into serious.'",
        "'speaker_6': 'And there are signals from the city. We recognize that there is a legitimate hurdle with the transformer that exists in the right of way. And there is no there is. Even if we were to grant an easement, there is no guarantee that he would ever be able to access his property unless, you know, without some gerrymandering of'",
        "'speaker_6': 'the of that easement or some deference by Xcel, you know, this this was not we don't get to this point without serious consideration of the ramifications. And there have always been a sort of more proper channel in a more appropriate way to to address this concern.'",
        "'speaker_6': 'And and somehow we ended up in this situation where we have two attorneys sort of arguing both sides of of this before us. And that's actually none of this is really of a concern to at least me as a member of council on whether a vacation is appropriate or not.'",
        "'speaker_6': 'But thank.'",
        "'speaker_0': 'You. Thank you, Councilman Espinosa. Councilman Flynn.'",
        "'speaker_3': 'Thanks, Mr. President.'",
        "'speaker_5': 'I really hate to.'",
        "'speaker_3': 'Reward an encroachment onto public property that has occurred over a significant amount of time. But it is apparent that the city has played a role in this as well. And I think I want to suggest a course of action for us, and that would be.'",
        "'speaker_8': 'To.'",
        "'speaker_3': 'To publish this on first reading and sort of pull the grenade pin on it. And the clock is now ticking. This has been hanging fire for such a long time. I think if we put this on first reading and then we hold it over for final and we can make a decision then based on whether the neighbors'",
        "'speaker_3': 'can come up with some sort of an agreement among themselves. I feel sort of like the the French cleric are no Amalric at the massacre of this gay and say let's just.'",
        "'speaker_8': 'Kill the alley and.'",
        "'speaker_3': 'Let the owners sort it out. So I advocate that we take a vote on this and move it on to publication.'",
        "'speaker_0': 'Thank you, Councilman Flynn. And I'll just jump on that and say that I am not at all comfortable with this yet. Still, after multiple committee meetings and tonight. But I completely agree with you that we should publish this because this is first reading, move it on and then we will be back.'",
        "'speaker_6': 'For some second Councilman Flynn's motion.'",
        "'speaker_0': 'So, well, that's the motion that's already on the floor. Conveniently so. Madam Secretary, Raquel Sussman.'",
        "'speaker_2': 'Hi, Black. I'm Brooks Espinosa. Flynn Gilmore. Herndon Cashman. Canete Lopez. New Ortega. Mr. President.'",
        "'speaker_0': 'I am secretary. Please close the voting. Announce the results.'",
        "'speaker_2': '12 days, 112 hours one day.'",
        "'speaker_0': 'Council Bill 394 has been ordered published. Now, Councilwoman Sussman, do you have a motion to postpone? Second, final reading.'",
        "'speaker_4': 'Councilman Flynn and Espinosa. And I'm ahead of you here. I move that final consideration of Council Bill 18 dash 0394 be postponed to Monday, September 10th, 2018. That's two weeks from today.'",
        "'speaker_0': 'It has been moved and seconded. Are there any questions or comments just about the postponement? Seeing none.'",
        "'speaker_8': 'Madam Secretary, Roll Call.'",
        "'speaker_2': 'Susman Hi. Black Eye Brooks. Espinosa Hi, Flynn.'",
        "'speaker_8': 'I.'",
        "'speaker_2': 'Gillmor i Herndon I Cashman can eat. Lopez I knew Ortega I. Mr. President, I'm secretary.'"
    ],
    "Proposed Agreement with Denver Housing Authority for Affordable Housing Fund Transfer and Development.": [
        "'speaker_0': 'Please. Because voting in those results. 3939 as final consideration of Council Bill 394 will be Monday, September 10th. All right. Moving on, Madam Secretary, are you pleased with the next item on our screen and Councilman Flynn? Go ahead with your questions on Council Bill 863.'",
        "'speaker_3': 'Okay. This is the intergovernmental agreement with the Denver Housing.'",
        "'speaker_8': 'Authority and Laura Speer.'",
        "'speaker_3': 'Can you speak to. Thank you. I just had a several questions on the agreement. I did watch some of the committee meeting on this. I'm not on that committee, but. The primary question was the mechanism under which the reasonable distribution.'",
        "'speaker_3': 'I have Mr. Guerrero here also. Thank you. The reasonable distribution of developable properties that Denver Housing Authority would acquire in order to distribute them around the city. I found to be sort of found it to be weaker than I would have hoped, because it seemed to me that the mechanism requires only a minimum of six.'",
        "'speaker_8': 'Council districts, which is just over half.'",
        "'speaker_3': 'Of the city, and it's a distribution by dollar amount rather than by unit amount. And because of the land cost differences in some parts of the city versus others that are more affordable, that that we will end up with what we're trying to avoid, which is a concentration in some neighborhoods and not a not a reasonable distribution'",
        "'speaker_3': 'which is called for in the idea. So I and I did watch part of the and Laura, you sent an email later this afternoon. So could you explain to me why a dollar, an equitable dollar distribution of no more than 15% of the proceeds was determined to be represent.'",
        "'speaker_3': 'What's more reasonable distribution rather than distribution of the actual number of housing units that they would produce around the city.'",
        "'speaker_8': 'Good evening. Council members Ismael Guerrero, executive director of the Denver Housing Authority. Laura brzezinski and I agreed to be tag team, and I drew the short straw in this question. Did she tag you? Actually, literally, yes. Okay. No marketing aside, though, in the in the IGA.'",
        "'speaker_8': 'As you know, there, the two pots of money that your question refers to, the land acquisition. Yes. Property Acquisition Fund. And because that is in that in the agreement that is land that the HRA will be acquiring land or properties will be acquiring and develop co-development.'",
        "'speaker_8': 'I'm not co-developing developing in partnership with other nonprofit and for profit developers. We don't have specific sites, obviously, and specific buildings identified for that, so it's harder to get to a specific unit count overall on a site by site basis.'",
        "'speaker_8': 'However, we feel that the the land value is a proxy for the number of units that will be acquired there and therefore.'",
        "'speaker_0': 'That will be developed.'",
        "'speaker_8': 'And those sites. So therefore, if the funds are distributed per the policy goals of no more than 15% in one district, our assumption in the modeling is that sites that are sort of less expensive in certain districts will have I'm sorry that as the as the land price goes, so will the amount of units that we can'",
        "'speaker_8': 'build on that parcel. So in a downtown area where land is might be twice as expensive will be more or more, but we'll be buying smaller parcels and getting, you know, higher density development in outlying neighborhoods where land is tends to be less expensive.'",
        "'speaker_8': 'They also tend to have lower densities. So we'll be spending equal amount of of dollars to get the same equivalent number of units.'",
        "'speaker_3': 'You're referring to zoning entitlements for zoning?'",
        "'speaker_8': 'Yeah. Generally to the higher density zoning close to the central business district. Lower density as you get into the outlying neighborhoods. Okay. So so we just felt that the land value was a good proxy for the number of units that would be developed on that site.'",
        "'speaker_3': 'So but in other words, there is no goal to have a reasonable distribution of the actual number of housing units in each council district.'",
        "'speaker_8': 'I think that that policy goal is reflected in the land value goal.'",
        "'speaker_3': 'So if it works out, it would just be through this secondary mechanism of the dollar amount that we spent on the land. But it also depends. Apparently, it could also depend on who our development partner is and what they bring to the table.'",
        "'speaker_3': 'That that's correct. Would that be fair to say?'",
        "'speaker_8': 'Yes. Okay.'",
        "'speaker_3': 'Laura, could you answer this one? Don't forget to.'",
        "'speaker_8': 'Tag.'",
        "'speaker_3': 'Thank you. The contract says that the executive director of is that of OED and DHC can modify or waive requirements in the scope of work in Exhibit A and also in the definitions in Exhibit B on their mutual agreement without coming back to the Council, except after the fact within 60 days to tell us how you changed'",
        "'speaker_3': 'this contract that we're going to approve tonight. And I'm a little uncomfortable with the notion that we're sending a contract out the door that by mutual agreement between the administration and the housing authority, you can modify or waive some of the requirements.'",
        "'speaker_3': 'Can you make.'",
        "'speaker_8': 'Me more comfortable with that in.'",
        "'speaker_4': 'Some way? So Laura brzezinski, Office of Economic Development, and Julia, few from the city attorney's office want to add to this as well. Please feel free. But the contract does state that the scope of work can be modified at the mutual agreement of the executive director of OED.'",
        "'speaker_4': 'Except for the minimum outcomes that are achieved through the agreements. That includes 1200 units produced through the land acquisition, and I think it's 1294 units that are preserved and created through the partnership with DOJ. Mm hmm.'",
        "'speaker_3': 'Okay, so you just restated what I asked, but why are why are we doing that?'",
        "'speaker_4': 'Part of the reason that we I.'",
        "'speaker_3': 'Mean, why most other contracts that we put out when there's when they change, the administration comes back to us with a contract amendment.'",
        "'speaker_4': 'Sure. So the agreement is built around those minimum achievable outcomes. But some of the path to achieving those outcomes, we know, will be dependent on market conditions that could change over time. So some of the assumptions that are included as part of the scope and the specific projects that may achieve those outcomes are places where we wanted'",
        "'speaker_4': 'to provide flexibility.'",
        "'speaker_3': 'I was just going to say, you want the flexibility as long as you're achieving the same contract agreement goals. I keep calling your contract. It's an idea. So as long as the goals remain the same, your flexibility within.'",
        "'speaker_3': 'The methods for doing that would you would report back to us but not ask us for permission to do that?'",
        "'speaker_4': 'Well, to some extent, there are there are parameters around what can be approved by the directors. But we are negotiating and proposing through this agreement to purchase the outcomes of the units created and preserved through the agreement.'",
        "'speaker_3': 'Okay. Thank you. I have one more question. Am I reading exhibit B4 correctly that under the net proceeds member housing authorities, administrative fees or.'",
        "'speaker_8': 'Costs are capped at 4%.'",
        "'speaker_3': 'Of the of the.'",
        "'speaker_8': 'Property tax allocation.'",
        "'speaker_3': 'And the proceeds of the bonds. The reason I ask is because that's 1% better than what the housing fund we said. I think it is 5%. Eight, 8%. Okay.'",
        "'speaker_4': '8%.'",
        "'speaker_3': 'That's correct. So what I'm reading that to mean is that DHS admin.'",
        "'speaker_8': 'Costs that they're allowed to.'",
        "'speaker_3': 'Load onto these proceeds is limited to 4%. That's correct. That's excellent. Yes. If true. If true, that's excellent. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Flynn, Councilman Espinosa.'",
        "'speaker_6': 'Ismael, you threw me off by the the the land value thing because some of these parcels are ones that you already own.'",
        "'speaker_8': 'To clarify, Councilman Espinoza, I was referring to the funds that would be used to acquire new sites to be developed by other development partners. So not that the property specifically.'",
        "'speaker_6': 'Okay. I do wish that I mean, do we have any any other sort of metrics that allow us to sort of look? You know, we've got the information about housing cost burden, you know, level of cost burden, households at different arms.'",
        "'speaker_6': 'But do we have there are other factors, right? Proximity to workplace productivity, schools? Do we have I mean, are we sort of heat mapping? So we actually understand that, you know, we're actually have a housing an affordable housing void.'",
        "'speaker_6': 'And, you know, we have an affordable housing need citywide, but we have population concentrations of people that are having the mean areas where there's there's not enough housing proximate to other aspects that would actually that actually impact the total totality of affordability for that household so that we're actually more strategically placing housing where it is rather than'",
        "'speaker_6': 'just simply going by by land value or something informing that.'",
        "'speaker_8': 'Yeah, that's correct. I think we call out other location factors opportunity neighborhoods, proximity to transit and services are some of the site conditions that we'd be looking for, not just the price of the land. Great.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman Mechanic.'",
        "'speaker_7': 'Thank you, Mr. President. I frankly just wanted to comment on this bill, so my colleagues dove right in with their questions. But I actually want to summarize what it does just for the public and for the record, which is that this bill and the companion that goes with it, which is 864 together, double our commitment to affordable'",
        "'speaker_7': 'housing, which just for the record, is the largest commitment in the state of Colorado, even more than the state's general fund commitment to housing. They have other funds that they leverage, but for a general fund, commitment of funds that, you know, could be spent and other things, this is it's historic.'",
        "'speaker_7': 'And I think just a few things to make sure that folks highlight is as we move forward, which is that it brings, you know, $105 million forward in advance through bonding, which was something specifically that the community strongly asked for, that we not just do a small amount each year.'",
        "'speaker_7': 'There's some cost benefit to that, there's some transaction costs and interest cost and things like that. But I think there was some building consensus that it was important to bring some money forward and the administration was able to work with DHS to find a way to do that.'",
        "'speaker_7': 'Third thing I think is important to highlight is who some of these housing units will serve. It will be a full range of incomes when you look at the full range of sources. So, for example, there is marijuana tax dollars that are being dedicated through this provision and that will include funding for folks of all incomes.'",
        "'speaker_7': 'But the portion we talking about that the Denver Housing Authority will be focused on with land acquisition will particularly focus on the most vulnerable residents of our city. These are folks who are either struggling with homelessness or who earn so little that they are below what we call 30% immediate median income.'",
        "'speaker_7': 'These are very, very low wage workers or folks who are on fixed income, Social Security, they're on some form of disability. They're seniors who are who are very low income. So so it's important to know that this package serves the lowest income folks.'",
        "'speaker_7': 'And then the last thing I want to highlight is that the portion that the Denver Housing Authority is taking on, which we focused our questions on today, but is actually only half, half of this package. But this portion, this half of the package will be affordable in perpetuity, which means it won't expire.'",
        "'speaker_7': 'We are struggling mightily right now to preserve housing that expires at 15, 23 years and to try to re-up it all and not lose it. And so we will not have to do that with this half of the package.'",
        "'speaker_7': 'And so these are really important pieces that just deserve highlighting before we gloss this through in our consent agenda. No one has called this out for a vote. I don't think so. It will be a consent package vote.'",
        "'speaker_7': 'But because it's big and because it's important. I just wanted to take a minute to, you know, thank the administration for the creativity. And I think the marijuana industry who has been very open to a sales tax increase, that won't be easy.'",
        "'speaker_7': 'Right. We want to make sure that that product stays in the legal market and doesn't get pushed to the black market. So it's a careful balance. And so I want to thank the marijuana industry for their, you know, approach to this and then to the community voices who help to kind of keep us moving so that we'",
        "'speaker_7': 'wouldn't just rest on the package we passed in 16, but we would work to grow it. So we all committed to doing that. We all had different paths and a lot of the ideas we shared and we researched.'",
        "'speaker_7': 'Separately all kind of were reflected in this package. So my thanks to those who worked together and to my colleagues. You know, I think that, you know, we've blazed a trail here and we're continuing to grow it. And that's what I continually state.'",
        "'speaker_7': 'There is no one bullet or solution to the housing challenge we face. But each piece we we expanded nondiscrimination with a week ago to two weeks ago feels like a lifetime already. But each piece we do you know whether it's keeping people in their homes through eviction defense.'",
        "'speaker_7': 'You have to add up each of our policies separately, together, and then you have to watch how the impact of each one grows as we grow the program. That's how you measure the impact we're having. So with that, I am so excited to vote on this as part of, I think, the consent package.'",
        "'speaker_7': 'Thanks.'",
        "'speaker_0': 'Thank you. Councilwoman, can each Councilman Brooks.'",
        "'speaker_6': 'Yeah. Thank you, Mr. President. And I just wanted to add my my almond and also exclamation point on a couple of points. Councilwoman Kennedy mentioned, you know, this is this has been a long conversation starting from 2014. And I think our first package of bills in 2016 was a great first step.'",
        "'speaker_6': 'But I think the community is very clear that this is this is good, but it's not nearly enough of what we're experiencing and the number of people that are being displaced in our city. And so the the administration are our nonprofit partners of VHA.'",
        "'speaker_6': 'It's incredible. But I also want to say, in doubling this fund, we're not done. And it is going to take the private sector, it's going to take government is going to take nonprofit, it's going to take the community to continue to grow this.'",
        "'speaker_6': 'And so although I'm extremely excited we got this done this year, I think there's a lot more work that we have to do. The other thing and 2016, it was exciting to pass the first affordable housing fund. The whole point was there was a permanent fund, but that night we put a sunset on it and excited that'",
        "'speaker_6': 'a part of this package is eliminating the sunset sunset as well, and so excited to move forward and making sure that this is something that's going to impact Denver in the next 20, 30 years. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Brooks, Councilman Flynn, your up.'",
        "'speaker_3': 'Thank you. Just briefly, I want to thank Ismael and Laura for the answers. I had called this out for a vote because I did have those questions that I thought were were crucial to having the answers. And I got the answers here.'",
        "'speaker_3': 'So I'm happy to withdraw that request and put us in a black vote.'"
    ],
    "Property Purchase at 700 West Colfax Avenue.": [
        "'speaker_0': 'Thank you. Thank you, Councilman Flynn. All right. An exciting bill that will move over to the block vote in a couple of minutes. We have one other item that's been called out, which is 746. Madam Secretary, we put 746 up on our screens.'",
        "'speaker_0': 'And Councilwoman Blackwell, you please put Council Bill 746 on the floor for passage.'",
        "'speaker_9': 'Yes, I move that council bill 746 be placed upon final consideration and do pass.'",
        "'speaker_0': 'That has been moved. Can I get a second moved and seconded now? Questions or comments by members of Council Councilwoman Ortega.'",
        "'speaker_4': 'This is a companion bill to the first one that I called out and I will be voting the same will not repeat my comments that I made last week. So just the no vote.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Ortega. Seeing no other comments or questions, Madam Secretary?'",
        "'speaker_2': 'Raquel Ortega.'",
        "'speaker_4': 'No. Sussman.'",
        "'speaker_2': 'Black Brooks. Espinosa. Flynn I Gilmore. I heard in Cashman can eat Lopez. I knew. Mr. President.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '12 one Nay.'",
        "'speaker_0': '12 eyes, one nay Council Bill 746.'",
        "'speaker_8': 'Has passed right.'",
        "'speaker_0': 'That all other bills for introduction are ordered published except for Council Bill 80855 which council will vote separately on after the one hour courtesy public hearing scheduled after tonight's recess. We're now ready for the block vote on resolutions and on bills on final consideration.'",
        "'speaker_0': 'Council members remember that this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call out an item for a separate vote. Councilman Black, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_9': 'Yes, I move that resolution to be adopted and bills and final consideration be placed upon final consideration and do pass in a block for the following items. 18 Dash 0840 18 Dash 084 318 Dash 086 218 Dash 365 18 Dash 077 218.'",
        "'speaker_9': 'Dash 085 618. Dash 085 718 Dash 085 818 Dash 085 918 Dash 10860 18. Dash 086 118. Dash 084 718. Dash 8079 418. Dash zero. 218 dash 023 18 Dash 0837.'",
        "'speaker_0': 'Has been moved and seconded. Madam Secretary, did we get them all?'",
        "'speaker_8': 'Yes. Our Rights.'",
        "'speaker_0': 'Secretary.'",
        "'speaker_8': 'Roll Call.'",
        "'speaker_4': 'Black Eye.'",
        "'speaker_2': 'Brooks Espinosa, I.'",
        "'speaker_8': 'Flynn, I.'",
        "'speaker_2': 'Fillmore, I. Herndon, I. Cashman can eat Lopez. All right. New Ortega. I Susman. Mr. President.'",
        "'speaker_0': 'I am secretary. Please close the voting. Announce the results.'",
        "'speaker_2': '1313.'",
        "'speaker_0': 'I is. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a one hour courtesy public hearing on first reading of Council Bill 855 regarding an agreement with PHC mixed use to exchange city owned property located at 2863 Fairfax Street for PHC owned property located at 2868'"
    ],
    "Property Exchange and Park Improvement Agreement with PHC Mixed Use, LLC.": [
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilwoman Black, will you please put Council Bill 855 on the floor?'",
        "'speaker_9': 'Yes, Mr. President. I move that council bill 855 be ordered published.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 855 is open. May we have the staff report?'",
        "'speaker_4': 'Good evening. Lisa Lemley Division of Real Estate. So we are here. Real Estate is representing the team to discuss the contract that is coming through is an exchange contract. The city currently owns the property at 2863 Fairfax Street and we would exchange the property for like size with the property across the street at 2860 Street I'm sorry'",
        "'speaker_4': ', 28, 68 Fairfax Street included in this transaction, PHC would also. Paid to the city $650,000 for future but determined park improvements that will be deposited in escrow. That is the sum of the transaction. I'm talking about the park improvements.'",
        "'speaker_11': 'Yes. Scott Gilmore, deputy executive director of Parks and Planning. So this this project was started back in 2015. Xcel Energy had to transfer stations that they were decommissioning. I was able to talk talk to Excel. They had one.'",
        "'speaker_11': 'And on Fairfax, this is the one we're discussing now. And they also had one in Westwood, the Westwood neighborhood. So we were able to acquire those two parcels for $50,000. I would add I had attended some public public meetings at the Greater Park Hill community meetings to let people know that I was working on this, trying to'",
        "'speaker_11': 'acquire these properties, and that our goal, the Park's goal, Parks Department's goal, was to build a park in this community that basically has a park desert. There's not a lot of parks in this neighborhood. So this was something that we were just trying to do and trying to do to build this little pocket park.'",
        "'speaker_11': 'So we were able to do that. In 2016, H&M Capital approached the city and said, Hey, we are redeveloping the east side of the block. You guys have a pass on the West Side, and that's the map that you have on 20/29 and Fairfax.'",
        "'speaker_11': 'We would like to contribute to building a park on this block. We want to make our development better. We want to make the block better. And so we we started discussions with them and we we talked about a possible swap of land.'",
        "'speaker_11': 'They take the West Side parcel and then on the east side they would actually work with us to build a park within that within that block. And so we've moved forward and this is where we're at now. So they would actually give a $650,000.'",
        "'speaker_11': 'When this if this moves forward, $100,000 would be immediately available for us to actually move forward with the design. At this time, we basically just have some concept designs. The city did have four meetings in the community to work on some concepts.'",
        "'speaker_11': 'Also, the Park Hill community had four meetings. The Park Hill, Greater Park Hill community actually had three meetings. They came up with some concepts. These are actually pretty good concepts and they've got some really good bones to actually start the actual design process, to move forward to eventually get to a construction document.'",
        "'speaker_11': 'Right now we do not have any design that is finalized or anything, so this moving forward would actually give us funding, which we do not have at this time, to actually start the design of this project. So that's kind of what I wanted to bring up.'",
        "'speaker_0': 'Thank you. Does that conclude this staff report then?'",
        "'speaker_11': 'Yeah, for now, yes. If there's any other questions, we are here.'",
        "'speaker_0': 'Thank you. We do have 29 individuals signed up to speak this evening. This is a one hour courtesy hearing, so we'll have to stop after one hour. So while you do have 3 minutes, if you're saying things that someone else has said or you can say them quickly, please do to allow time for us to get through'",
        "'speaker_0': 'as many of those 29 as we possibly can in one hour. I'm also going to ask if you're sitting in this first bench, if you could please find another seat, because I'm going to call up five speakers at a time so that we can try and get through people quickly and don't lose a lot of time.'",
        "'speaker_0': 'Turning over. So when I do call your name, come up to this front bench and then be ready in that order that I call you to pop right up when the speaker in front of you is done. I will now call the first five speakers.'",
        "'speaker_0': 'I do apologize if I mispronounce your name and then the first speaker can step up to the microphone. We'll get started right away. So the first five that we have is Robin Fishman, Christine O'Connor, Jesse Parris, Benjamin Shaffer and Alison Larson.'",
        "'speaker_0': 'If you could all five come to the front bench and Robin Fishman, the microphone is yours.'",
        "'speaker_7': 'Thank you. I really did not want to be first.'",
        "'speaker_4': 'But I go for it.'",
        "'speaker_7': 'My name is Robin Fishman. I live at 2665 Forest Street. It is roughly four houses down the alley from this development. I have watched a lot of change in this neighborhood. And I. For those of you who.'",
        "'speaker_4': 'Tend to vote with.'",
        "'speaker_7': 'Your registered neighborhood organization, I want to really speak to you.'",
        "'speaker_4': 'Tonight. I am a former board member of the Greater Parkfield community. I am the.'",
        "'speaker_7': 'Former executive director of Gated Park Community. I'm very familiar with how they work.'",
        "'speaker_4': 'And I have great respect.'",
        "'speaker_7': 'For the members here.'",
        "'speaker_4': 'Tonight who volunteer and work very hard with them.'",
        "'speaker_7': 'I typically agree with them, but on this case I feel like they have really missed the boat.'",
        "'speaker_4': 'They have done absolutely nothing whatsoever to survey the housing or membership.'",
        "'speaker_7': 'That lives directly.'",
        "'speaker_4': 'Closest to this park. I'm four houses away, as you will hear, and I hope you will ask.'",
        "'speaker_7': 'The people that come up to speak post tend to live farther away from the development. I and my neighbors live very close to the development. We are most affected by it. They did nothing to survey the membership. I have participated in park design programs.'",
        "'speaker_4': 'Through them where I had a very open mind about whether the park should be on the east or west side.'",
        "'speaker_7': 'Of the street. I was told we were looking at a ballpark of $750,000 to fundraise to privately build the park on the West Side.'",
        "'speaker_4': 'Which I actually volunteered to do.'",
        "'speaker_7': 'But as my mind started to change and I started to lean toward the east side, gradually I was left out of that process. I was no longer included.'",
        "'speaker_4': 'On emails to even deliver fliers about those meetings.'",
        "'speaker_7': 'And is very clear that they have a very specific agenda about wanting it. Only on the west side of the street, the park itself.'",
        "'speaker_4': 'Will be built between residents and a retail development.'",
        "'speaker_7': 'On the West Side. It will be.'",
        "'speaker_4': 'Long Table Brewery.'",
        "'speaker_7': 'Which is a great establishment.'",
        "'speaker_4': 'But it won't. It will be between.'",
        "'speaker_7': 'Retail and housing, regardless of which side of the street it's on.'",
        "'speaker_4': 'Some of the concerns.'",
        "'speaker_7': 'That have been raised have been about.'",
        "'speaker_4': 'Gentrification issues, people feeling welcome to the park and will it really feel like a city park.'",
        "'speaker_7': 'Versus a plaza? I feel strongly that through the work of the developers and.'",
        "'speaker_4': 'Through the work of the.'",
        "'speaker_7': 'Neighborhood, we can work with the city to make sure that it feels very much like a park that is open to all and make sure that the permitting is through the city to make sure that it feels open.'",
        "'speaker_4': 'And welcoming.'",
        "'speaker_7': 'I have certainly participated in processes where I have encouraged naming it after a park resident and making sure that it is something that is less than a plaza but open to everyone. My concern is if we wait for the West Side.'",
        "'speaker_4': 'We are fundraising probably for a private park, which that funds those funds could be put to.'",
        "'speaker_7': 'Much better use, such as helping the people.'",
        "'speaker_0': 'I'm sorry, but your time is up. Oh, thank you very much. Next up, Christine, come on.'",
        "'speaker_7': 'All right. Well, anyway, I'm in favor of the swap.'",
        "'speaker_4': 'My name is Christine O'Connor. I live at 144 South Ulster Street in Denver. I'm going to ask you guys a rhetorical question to start with. So just can you just hold this in your head while I'm speaking? But how do you expect me as a voter to support a park, a sales tax for increasing revenue to parks'",
        "'speaker_4': 'by 47 million over our 74 million? If you're giving away park assets. Just hold that for a minute because this is really serious, this giveaway deal. I mean, the developer, as other people will explain, is getting money hand over fist.'",
        "'speaker_4': 'He's going to benefit by increased property values on the east side. He's doubling his holdings on the west side. He can reason.'",
        "'speaker_6': 'You all know that's going to.'",
        "'speaker_4': 'Come. I mean, we weren't born yesterday, so I'd like you to think about that. I also have a serious ask for you, something that you could do. And I think that the city and parks have bent over backwards to work with the developer and, you know, get an agreement in writing.'",
        "'speaker_4': 'Meanwhile. The community, which worked really, really hard for over two years, has no guarantees in writing. None. Park grader Parkhill asked for a board to be set up. A community board? That's not even done. There's no guarantee that the extra profits will go into this board for maintenance of the park.'",
        "'speaker_4': 'There's a number of things it can do. I've heard you're eluding meeting. I know that many of you have valid concerns about gentrification and who this park will serve. And being on Lowry, where we have a plaza in the middle of the shopping center, I guarantee you it's not an open public park.'",
        "'speaker_4': 'This one also isn't labeled a park, and I know DPR is going to take control, but if you really think that there isn't going to be racial profiling and there aren't going to be neighbors and restaurants complaining if it is really publicly used, then I don't think you really know anything about parks.'",
        "'speaker_4': 'So I'd like to ask that you postpone this until you've required the mayor and the administration to make agreements with the neighbors as part of this deal. And I know some of you are going to say, oh, we can't do that.'",
        "'speaker_4': 'That's out of our purview. Then why have a city council if you can't direct the mayor? I'm just not sure what our purposes. So there's other people who are going to talk. But I also have concerns about the future of our park.'",
        "'speaker_4': 'I love plazas. I've been to Siena. That plaza is wonderful. We have them. You know, they're all over New York City. But there's no guarantee that this is going to feel like a public park. And there's no rationale in the game plan.'",
        "'speaker_4': 'All we need to have.'",
        "'speaker_0': 'I'm sorry. I'm sorry, but your time is up. Thank you very much. Jesse Paris.'",
        "'speaker_11': 'Jesse pairs Black Star Action Movement for Self-defense and the City Council at large candidate for 2019 Black Stars and more for self-defense. We are a for profit.'",
        "'speaker_8': 'Which is for the poor, working, poor, elderly and senior citizens in the homeless and those that are just thrown off broke. We do not agree with this at all. As a Denver native, I grew up in Parkview. This neighborhood is being gentrified just like the rest of the neighborhoods throughout this whole city.'",
        "'speaker_8': 'And just to sit here and listen to you all try to justify this by saying that this is going to be a public park, all while having an urban camping ban which criminalizes the homeless on the streets of Denver.'",
        "'speaker_8': 'It makes it illegal for them to even sleep in the park. You think that the answer is more parks instead of affordable housing? This place could be used to build affordable housing.'",
        "'speaker_11': 'Transitioning to transitional housing.'",
        "'speaker_8': 'All the above. But instead you want to build another park. Like we don't already have enough parks already. Like we'd already have enough dog parks already. We have more dog parks than we have public restrooms in the whole city of Denver.'",
        "'speaker_8': 'We are definitely against this. You are being very disingenuous in the way that you are going about this process. The community has literally told you they do not want this done and you still want to go through with it.'",
        "'speaker_8': 'You still are in bed with the bedbugs, the business developers, and you still are following the lead of Michael Hancock, who is not fit to serve. So Denver homicide allowed Blackstar some movement. We are against this. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Benjamin Schaaf.'",
        "'speaker_8': 'Benjamin Shariff. I live on 26 block of forest, so half block away from the development. I am in favor of the land swap. I have attended the the meetings and I, I to me it is it is a funding issue.'",
        "'speaker_8': 'There's funds available for a park. I and I have I have not heard from the GP agency any, any form of funding available that they have. They just have been said that they will find the funding available for that.'",
        "'speaker_8': 'To me, as a neighbor of the park with young children. I would like to use this park.'",
        "'speaker_5': 'I have seen this said.'",
        "'speaker_8': 'For two years without any development and I'll keep a brief with that. But I am in favor of the land swap.'",
        "'speaker_0': 'Thank you. Next up is Alison Larson and what Alison is coming up, I'm going to call the next five to come to this frontbench, Christina Cryer, Karen Engel, Ford, Jason Cline, Hayter, Blair, Taylor and Alison Shah. Sorry about some of those names.'",
        "'speaker_0': 'I apologize.'",
        "'speaker_7': 'Alison Larson. I'm Ali Larson. I'm a resident in Park Hill. As you can see, this is a heated issue in our neighborhood. Park Hill is experiencing gentrification at a massive rapid rate. And the people that are here opposed to the land swap, as I am, are not opposed to a park or oppose it.'",
        "'speaker_7': 'The way this process has been handled, which is have been extremely and equitably and with no transparency. I am urging you, as our city council members, to recognize that the city is paying attention to how we are gentrifying.'",
        "'speaker_7': 'Are we doing it respectfully? Are we doing it thoughtfully? Are we thinking about citizens who don't take online surveys, which is one of the ways that they were doing community feedback here? Are they showing up to meetings? Not necessarily.'",
        "'speaker_7': 'And we need to be listening to all of our community members. If you walk around Park Hill, I will tell you that the school a few blocks to the east of this has an Afro rate of over 90%.'",
        "'speaker_7': 'The school several blocks to the south has an overall rate of 13%. Park Hill is very divided. There are people here that will tell you that it is one Park Hill, but it is not. And these types of things happening continue to make that divide even greater.'",
        "'speaker_7': 'We are asking you to put a hold on this. Recognize that there were other offers on the table to develop this land that were not given consideration. That has not been mentioned here. There were developers that people that were bringing money to the table as well.'",
        "'speaker_7': 'As you heard, this whole thing was started because this developer came to the table, made the offer, and nothing else was considered. That should be a red flag to you as city council, as our city is gentrifying. Developers should not hold the power.'",
        "'speaker_7': 'When we were at the previous committee hearings, developers, the developer, held all of the power. Happy Hands even mentioned the term a gift.'",
        "'speaker_4': 'This was a gift from the developer.'",
        "'speaker_7': 'That should not be happening in city buildings. We should not be talking about gifts from developed developers that actually are not gifts. We are giving the developer a lot of money. This would be a plot of land in the middle of a fancy development in the middle of North Park Hill.'",
        "'speaker_7': 'North Park Hill is a special place. It still has some diversity. It still has a rich culture. If you have not been on this block recently, there has been a long standing black owned liquor store on the south side of the block that many of our neighbors have complained about because it gets frequented by lower income African-American'",
        "'speaker_7': 'patrons. Yet a brewery was built at the north end of this block, and no one seems to mind that there are drunk, white, rich people hanging out on that corner as well. I just want to point out that this is a sensitive subject.'",
        "'speaker_7': 'We care about our neighbors. We care about what is happening here. I'm a longtime resident. I care about neighbors. And I care about how we as a city are doing things. Are we doing it well? Are we doing it thoughtfully?'",
        "'speaker_7': 'This process has not been done equitably, nor thoughtfully, nor transparently. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Christina Crier.'",
        "'speaker_7': 'Hello. As you mentioned, my name is Christina Cryer and I live with my husband and my four and six year old boy at the corner of 26th and Forest. I'm also representing multiple other Park Hill families that weren't able to be here, including my cousin's entire family and my brother's entire family, all of which live within a'",
        "'speaker_7': 'block of, you know, this proposed park, whether it's on the east side or the west side. I've been to multiple meetings now trying to kind of weigh the pros and cons and hear from both sides. And in the simplest form, I mean, it just seems fairly obvious that it is a win for the neighborhood and we get'",
        "'speaker_7': 'a park sooner rather than later. The last information and data that I received was that the park could be, you know, 5 to 10 years down the road if we do not go through with the land swap. I don't know if that's still the updated numbers.'",
        "'speaker_7': 'We saved taxpayer dollars by helping, you know, partnering with the development.'",
        "'speaker_4': 'We still keep the entire.'",
        "'speaker_7': 'Piece of land with the city of Denver. And the park is going to be identical, whether it's on the east side.'",
        "'speaker_4': 'Or.'",
        "'speaker_7': 'The west side. I think what we're hearing is.'",
        "'speaker_4': 'Frustrations that aren't necessarily related 100% to the park. I've heard that there's been some.'",
        "'speaker_7': 'Mistrust or perhaps people wanted to be a little bit more included. And maybe that's the case and perhaps things could have, you know, developed better. But that doesn't change the fact that the park is going to be either on the east side or the west side, and that we can have it sooner without using taxpayer dollars.'",
        "'speaker_4': 'If we go through with the swap.'",
        "'speaker_7': 'I've also heard a lot of issues or concerns might be the better term on the development itself, and that is not what's up for vote right now. We can't necessarily change what's going on around the park, whether it's on the east side or the west side.'",
        "'speaker_4': 'We talk about things.'",
        "'speaker_7': 'That are there right now, whether that's going to be there in the future or not, I don't know. But those are things that is not being voted on right now and things that we can't change. I also don't think that there's an entire person.'",
        "'speaker_4': 'In this room that doesn't think that there's room for improvement on this block.'",
        "'speaker_7': 'You'll continue to hear from other people that live even closer than I do and some of the issues that they face. I know that we have faced some issues as well on my block, and I also understand that change needs to be thoughtful and that it really does need to benefit the neighborhood.'",
        "'speaker_7': 'And I think that the process has been going on for months and months. So I think that suggesting that not a lot of thought.'",
        "'speaker_4': 'Has not gone into this yet would be.'",
        "'speaker_7': 'False and wrong.'",
        "'speaker_4': 'And I also think that we can use this as an opportunity to.'",
        "'speaker_7': 'Shape the block. You know, I've reached out to, you know, my neighbors. I've reached out to, you know, councilman, I've reached out to the developer and I've reached out to on a couple of occasions the greater Parkdale community, you know, and I've had a lot of conversations and tried to bring up some different ideas, you know, whether'",
        "'speaker_7': 'it's bringing a social enterprise into the development or creating different park activities. But the Greater Park Hill Group has not exactly been open to those conversations.'",
        "'speaker_0': 'Thank you very much. Next up, Karen, anger fought.'",
        "'speaker_7': 'You are doomed from the beginning. It's current and graffiti.'",
        "'speaker_8': 'When I was nine.'",
        "'speaker_7': 'I got to live in Park Hill, 2258.'",
        "'speaker_2': 'From Area Street.'",
        "'speaker_7': 'Grew up at 23rd and Bel from 1970. My cousin lives on Fairfax and 26. I am opposed to this swap in the developers pictures of the development. It looks like a 3 to 4 story building overlooking a private piece of land does not feel very hospitable, and that has been a very key point.'",
        "'speaker_7': 'This is not hospitable to the neighborhood and it is not respectful of the neighborhood. Just because you live close by. It's a park. You don't own the park a block from your house. That's a neighborhood park. It is a park.'",
        "'speaker_7': 'Desert. So it should serve the greater area. I work at Park Hill Clinic at the Denver Health Clinic. I'm a physician. Most of my patients live in the neighborhood. They. Would benefit from having more open space. I think the city has a great asset here and they should think twice before giving away this open space.'",
        "'speaker_7': 'I know the developer would want to put another building and looking at how it would be, the park would then be surrounded by three sides because then the developer would have the opportunity to put in another large building.'",
        "'speaker_7': 'So it would be three large buildings surrounding a very small park.'",
        "'speaker_2': 'I can have concerns about the heat.'",
        "'speaker_7': 'Island aspect of it. When I went to the horse and pony shows of the that the Parks Department put on, giving us four options and no input into anything other than comment on these four options. They said they would not allow that a playground was okay and there was a lot of it.'",
        "'speaker_7': 'What we came up with as a community at those meetings was discounted.'",
        "'speaker_4': 'Uh, one more thing.'",
        "'speaker_2': 'Or maybe in the interest of.'",
        "'speaker_7': 'Time, I will bow out.'",
        "'speaker_0': 'All right. Thank you very much. Next up, Jason Cline had her very good.'",
        "'speaker_11': 'So hi, my name is Jason Cleanser. I live at 2615 four, so less than a block away. We've been in the neighborhood since, well, 1/29 and Holly and then here.'",
        "'speaker_8': 'At 26th and Forest four and so on.'",
        "'speaker_11': 'And obviously I've seen a lot of change of the city. I'm sure.'",
        "'speaker_8': 'Anybody that's lived here for.'",
        "'speaker_11': '20 years plus you've seen a lot of change in the city. This block has not seen much change. In fact, the only change that has come has been through buildings B, becoming empty, subsequently encouraging crime and delinquency in our neighborhoods.'",
        "'speaker_11': 'I've seen cops shoot at kids in my neighborhood. I've seen other kids shoot at other kids. I've seen a tremendous amount of drug use. And and that's not what this neighborhood's about. This neighborhood is about community. It's about family.'",
        "'speaker_11': 'It's about being respectful to its neighbors. And because of the dilapidation that happened on that block.'",
        "'speaker_8': 'Over the years, that it's.'",
        "'speaker_11': 'It's not turned into an asset that the community can really value. The developer has taken on his his wings to to to put this in play, put attainable housing in the market. And he wants to.'",
        "'speaker_6': 'Give the community $650,000.'",
        "'speaker_8': 'At the cost of a $25,000 lot.'",
        "'speaker_11': 'That the city paid for. Congratulations, Scott. That's a hell of a good land deal.'",
        "'speaker_8': 'The reality is, is that the city is not.'",
        "'speaker_11': 'Out any.'",
        "'speaker_8': 'Money.'",
        "'speaker_11': 'With this. They're out 25 grand, but they get a $625,000 asset because of it.'",
        "'speaker_8': 'The city did a tremendous.'",
        "'speaker_11': 'Job of really programing this project, finding out the ins and outs of what makes a park community. And I commend their group for really being forward thinking of finding the assets that that that would make that a central part of our neighborhood and our streets.'",
        "'speaker_11': 'Because I do think it matters that you live there because I've seen it. I've been awoken by gunfire too many times in that neighborhood.'",
        "'speaker_8': 'To have it keep being a.'",
        "'speaker_11': 'Problem. And the fact of the matter is that if you live at 20th and Glencoe or if you live in Lowry, you don't know the issues that come down here. I we do. I've seen it. I've rolled up my windows at night because of it.'",
        "'speaker_11': 'So I honestly, hopefully you guys consider that as part of this thing and respect to somebody that's making an investment of millions and millions of dollars to make our neighborhood not only better to take away some of the assets that weren't being used and really make.'",
        "'speaker_8': 'Our community a piece that we can all be proud of.'",
        "'speaker_0': 'Thank you. Next up, Blair Taylor.'",
        "'speaker_7': 'Hello. My name is Blair Taylor and I live at 28 Glencoe Street. I am the District five representative for the Greater Park Hill Community Board. The Greater Park Hill Community Board is made up of more than 20 residents of Park Hill.'",
        "'speaker_7': 'We have not officially changed our position made in November of 2017 opposing the Fairfax land swap. The city has demonstrated determination to force this deal no matter the description, discrepancy of value or lack of foresight. This deal gives land to a developer whose tenants on either side will clearly have the advantage of this plaza for their use'",
        "'speaker_7': '. The developer's own website furthers this evidence by having both designed it without any neighborhood input or actually naming it the Square at Park Hill Commons. That's not a public pocket park for Park Hill. The Greater Park Hill chair requested in July a pause for decision makers to include provisions which would provide equal opportunity for added community value'",
        "'speaker_7': '. Some of the things that we requested were building the park in the first phase of development. Right now the contract states the park will be developed in 2021. That's six years from when it was purchased. That would have given the community plenty of time to look at go go co-funding, which is what Westwood Park, which was completed'",
        "'speaker_7': 'last week, went last weekend used. Building the community produce design. It was a process that was inclusive of a really diverse group of residents. Establish a neighborhood board that would oversee and ensure the park rules accommodated all of the residents.'",
        "'speaker_7': 'Establish a good neighbor. Agreements with all of the adjacent tenants. Provide some truly affordable housing in perpetuity for those residents who are displaced. And promote leases to minority owned businesses. One of the residents has drawn a comparison to this deal being reminiscent of the purchase of Manhattan Island.'",
        "'speaker_7': 'The natives are given $24 worth of trinkets and told to be thankful in exchange for their loss of land, culture and livelihood. I hope that you've truly considered the repercussions of gentrification in a neighborhood that is so rich with history that you've not chosen to sell out to make the rich richer.'",
        "'speaker_7': 'We hope that the vote that you cast today reflects to your constituents your value of community, because in May we will be casting our votes.'",
        "'speaker_0': 'Thank you. Next up, Alison Shah and I'm going to call the next five up, Tracey McDermott, Karen Williams, Shonda Harrison, Tiffany Knapp, Snyder and Hank Boots. Go ahead.'",
        "'speaker_4': 'Okay. Thank you. Alison Shai, live at 3014 for us. So just two blocks from this development, I think that there are some very significant issues in our neighborhood regarding gentrification and a very strong minority in the neighborhood that is vehemently anti-development and anti developer.'",
        "'speaker_4': 'And I think that some of these issues are getting mixed in with the park. For some people, these are inseparable. I actually favor the park being built by the developer and being part of a larger complex that enables the development to include commercial restaurants and cafes as part of the development.'",
        "'speaker_4': 'Without the park on that side, we lose the opportunity to have a new commercial expansion of that neighborhood. I think that the concerns that people have are ones that people in our community can come together to address and work on.'",
        "'speaker_4': 'I think that we are a strong community of committed people, many long term residents of new residents who could actually commit to making this a neighborhood park by working on all these kinds of issues that people have raised who are opposed to it.'",
        "'speaker_4': 'That doesn't they don't require us not to build the park to undertake these kinds of community works financially. I think it's a it's a great deal for us to get the park built with a developer who's willing to put the money into it.'",
        "'speaker_4': 'Does he benefit? Yes, he does. Is that a zero sum game? That means we don't benefit. No, I don't think so. So that's all I have to say.'",
        "'speaker_0': 'Thank you. Next up, Tracey McDermott. Right. Karen Williams.'",
        "'speaker_4': 'Hello, I'm Karen Williams. I live at 26, 23 forest half block from the proposed park. I am for the land swap. I think as many others have said, it's a great deal for the city. I think the Parks and rec money that they would spend on the West Side could better be spent in other neighborhoods where they'",
        "'speaker_4': 'don't have someone giving them $650,000. I attended a meeting. Councilman Herndon put on bat way back in october last year. Two other park meetings, three greater Park Hill meetings. The developer has said that he will work with the design the community came up with, which we I appreciated.'",
        "'speaker_4': 'I'm a senior citizen in the neighborhood. I would love to be able to take grandchildren there and I just think it'd be a great deal for the city. So thank you very much.'",
        "'speaker_0': 'Thank you. Shanta Harrison. Sean to Harrison. All right, Tiffany Knapp. Snyder. Kent, I'm sorry.'",
        "'speaker_4': 'Okay.'",
        "'speaker_7': 'Well, thank you all for hearing from neighbors. And I also wanted to thank Councilwoman Nature coming out and speaking with some neighbors who are for the land swap for the park to be built on the east side of the street.'",
        "'speaker_7': 'I live at 28, 34 sits. It's Mid-Block just a block away from where the development is happening on Park Hill. Resident for 12 years. I love this neighborhood. I love Park Hill and I feel I'm here tonight because I just feel sad at what this has become.'",
        "'speaker_7': 'I feel, unfortunately, that it's it's become a racial issue. I believe that it has pitted neighbors against neighbors. And I, I have to say that I think that the Greater Park Hill Community Board has been a big part of that.'",
        "'speaker_7': 'I have friends and neighbors and people that I care about on both sides of this issue. And so it's hard to get up here and talk, you know, to talk about that. But I feel strongly that the issues that are being brought up and the concerns that are being brought up are are good.'",
        "'speaker_7': 'It's good conversation. I think that we need to be having more of these conversations. I think people are very sensitive to the issues of gentrification in Park.'",
        "'speaker_4': 'Hill, specifically.'",
        "'speaker_7': 'North Park Hill. I, I have several neighbors of color who I have had. Discussions with about this, both for and against the the land swap. And so, again, I think these conversations are really important. So I'm thankful that we have an issue to talk about.'",
        "'speaker_7': 'What I don't think is that this park in where it is placed on the east or the west side will, A, provide healing for those issues.'",
        "'speaker_4': 'Solve the.'",
        "'speaker_7': 'Issue at hand? And I think what we're dealing with now is we need to move forward. I think we've been at so many of these meetings. We need to move forward with a park that has a has funding in place.'",
        "'speaker_7': 'It has a timeline in place to serve our community better. I have three young kids and I'm worried about the safety of the block. And like so many people have mentioned, there has not been change on the block for years.'",
        "'speaker_7': 'So while I don't think this is maybe maybe the development is not the.'",
        "'speaker_4': 'Perfect solution.'",
        "'speaker_7': 'For the block of Fairfax. I recognize that and I want to be sensitive to that, but that is what is happening. And so I feel strongly that a park can serve our community, can serve our neighbors. And I just feel like already it's been, you know, almost set in stone that it's going to be inclusive if it's'",
        "'speaker_7': 'on the West Side and exclusive as if it's on the east side. And I just don't feel like that's the case. Thank you so much.'",
        "'speaker_0': 'And could you just state your name for the record?'",
        "'speaker_7': 'Tiffany Camp Snyder, really excited.'",
        "'speaker_0': 'All right, Hank, Boots and Hank is coming up the next five. If you could come to the front, Brad Burdick, Lehman Knowles, Moira Stiles, Maria Flora and Paul Nordquist.'",
        "'speaker_8': 'Go ahead.'",
        "'speaker_14': 'Thank you. My name is Hank Boots. And I agree with Tiffany that the process divided the neighborhood on this issue. And the reason it divided the neighborhood is because it was a very dishonest, undisclosed process. We have heard there is a letter of intent.'",
        "'speaker_14': 'There's not a letter of intent. The city is going to build this park. The developers couldn't build this park. We've heard so much. I suppose I'm supposed to watch my language here. But you know, what we've heard is dishonesty.'",
        "'speaker_14': 'Dishonesty from Parks and Rec. Dishonesty from where? Where's the contract on this deal? And all of a sudden, it shows up. Now, everybody in this room, I got a feeling if you're selling your house, you want to get as much as she can for it.'",
        "'speaker_14': 'And there is nothing in this process to indicate that the city had any interest in maximizing what it could get from this land. It sold to one person. It didn't put a for sale sign up. It didn't ask for bids.'",
        "'speaker_14': 'There's no fiduciary duty whatsoever to the people that actually own that land. Which one of them is me? So I'm very disappointed and I hope that if the city continues to swap land, park, land, what could be park land for apartment buildings, then we'll have honesty next time.'",
        "'speaker_14': 'We'll have people that come to us to begin with and say, We have people interested in buying this. Is there anybody else interested in buying this? That's how I was sold a car. And maybe that's too difficult a concept, but I'm really let down.'",
        "'speaker_14': 'And this was not a clean, honest, forthright deal for the citizens. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Brad Burdick.'",
        "'speaker_8': 'Hi. Good evening. My name's Brad Burdick. I live at 2631 Forest, about a half a block from the proposed development. I reiterate all the things that everyone before me has said in support of the park. We've had concerns.'",
        "'speaker_8': 'I've been there for about eight years and I can honestly say that I've heard. Immediate sirens or sirens as a result of gun violence from that block more than a dozen times in the last eight years. So anything that will bring people together on that block as far as businesses, foot traffic will be an improvement for the'",
        "'speaker_8': 'block. And thank you for your time. Thank you. Lemon Knowles.'",
        "'speaker_13': 'Hi. My name's Lemon Knowles. I'm a Park Hill resident off 30th in Cherry, and I'm also the president of City Park Friends and Neighbors. This is my third courtesy hearing concerning park issues. The only issue I have or the concern I have is the process where the civic engagement was not as strong as it could be.'",
        "'speaker_13': 'We do need development. We do need improvements in the neighborhood. But the citizens who are there, long term citizens like myself, who know the history of the community, we really should have been more engaged from the beginning. So I was really upset when I saw the construction fence.'",
        "'speaker_13': 'I didn't know that that the deal had even taken place. I read about it in the Greater Park Hill News. And so, you know, it's just been very stressful for the last year and a half where the citizens just don't feel like they've been respected.'",
        "'speaker_13': 'So what I suggest in the future is that the civic engagement be stronger. Thank you.'",
        "'speaker_0': 'Thank you. Moira Stiles.'",
        "'speaker_4': 'Thank you for your time tonight. My name is Maura Stiles. I live at 2859 Forest Street, which is directly behind where the park is planned to be, if it is going to be on the east side of Fairfax Street.'",
        "'speaker_4': 'My battery's dying here. So on my notes, I just want to say a couple extra things on top of what's already been said tonight. I really have been appreciating the conversation that has come up because of this issue.'",
        "'speaker_4': 'The conversation and the dialog that does need to be moving forward in our community. It is valuable. It is rich. It is something we should all be a part of. One of the benefits of having this park be on the east side is that we see that happening in the very near future versus an undisclosed unknown date'",
        "'speaker_4': '. We really would like to have this be a much more cared for. Eyes on it. Watched block for the safety of three children, 14, 12 and nine for the safety of them on this block. I just also want to say that we do hear and care deeply about the history of pain and exclusion and marginalization that this'",
        "'speaker_4': 'kind of discussion triggers in our community. The issue of inclusion will be an issue that we need to care about whether the park is on the west side or the east side of Fairfax. And our hope is neighbors, as we've been discussing this as neighbors, is for the forward movement of completing the park on the east side'",
        "'speaker_4': 'in the very near future as a space for interaction and healing to happen. If this can get moving forward, it creates a space where the conversations and the interaction can begin rather than just there just being an empty space.'",
        "'speaker_4': 'That reminds us of the polarization. We as neighbors are committed to lean into those conversations. We moved to Park Hill 11 years ago because we wanted to raise our boys in a racially, ethnically, socioeconomically diverse community. And I truly hope that my boys.'",
        "'speaker_8': 'And all.'",
        "'speaker_4': 'Of our kids can see us as a neighborhood and as a community, carry the shared value of it being really up to all of us to be inclusive and to care for our neighbors. So, again, we are for the land swap.'",
        "'speaker_4': 'And thanks for your time.'",
        "'speaker_0': 'Thank you, Maria. Flora.'",
        "'speaker_4': 'Good evening, Maureen of Florida speaking against the measure. I'm a Park Hill resident. Denver Parks and Recreation advocates for the land swap as a way to build a pocket park fast, cheap and good. But it's none of those things, and I urge you to vote against it.'",
        "'speaker_4': 'If the swap is approved, we insist that DPR build the park that was designed by the community. The swap is not fast. Happy Haines was at Greater Park Hill earlier this year and said that the pocket park would likely be built in two years.'",
        "'speaker_4': 'So say the beginning of 2020. The city isn't going to start construction under this contract until the early until any time before October 31, 2019. And later, if this contract drags out, I could build a park in the same time on the West Side.'",
        "'speaker_4': 'The swap plan is not cheap. The major is one of the major selling points. Was this $650,000 so-called donation by Tim Papp capital from Park Design and Construction. But H. M is getting value out of this. They're going to get increased rents because the park is embedded in the development and they're going to get a tax deduction'",
        "'speaker_4': '. They're getting under this contract a $10 a month lease to store up to 10,000 cubic yards of dirt on what's now the plaza. And there's a great deal of value in that. That lease is open ended. It doesn't end until construction starts.'",
        "'speaker_4': 'And it also saves what it would have spent developing the plaza as it was initially depicted in its plans. But most of all, the swap plan is not good. The neighbors are concerned that the plaza embedded in a Jim's upscale, dense development will not be the park that the neighborhood wants.'",
        "'speaker_4': 'The Greater Park Hill R.A. held three community design meetings where anybody could speak their mind unmoderated. First and foremost, the community wanted play features for all age kids, specifically swings and climbing structures. A park design was created and given to council with a conventional play structure.'",
        "'speaker_4': 'DPR duplicated the park process came out with a set of plans that did not have a single swing or slide, no play structures other than rocks, and one of the plans didn't even have any turf. We're disappointed. We're reduced, insisting on swings and slides.'",
        "'speaker_4': 'So to ensure that the neighborhood gets the park it wants, we request that DPR give the R.A. a seat at the table in the park design process, and we insist that it build the park that was designed by the community.'",
        "'speaker_4': 'Thank you. I have pictures of the community design. I'll give them to the clerk for distribution.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Paul Norquist.'",
        "'speaker_8': 'Thank you. My name's Paul Norquist. I live at 2885. Dexter. We're three blocks west of the proposed development. I'm here to speak for myself and my family and my neighbors in favor of the land swap. I think.'",
        "'speaker_0': 'We just believe in the facts of it, that it's a like for like exchange.'",
        "'speaker_8': 'Of land, that there is a $650,000 allotment that the development or developer is giving to the city to build that park. And like was said before.'",
        "'speaker_0': 'The money that Denver Parks and Rec.'",
        "'speaker_8': 'Would.'",
        "'speaker_0': 'Have to use then can be used in another underserved community. I think we just need to.'",
        "'speaker_8': 'Look at the actual facts of the land swap and.'",
        "'speaker_0': 'Unfortunately we have to put some of this other stuff.'",
        "'speaker_8': 'On the wayside until.'",
        "'speaker_0': 'Those issues can be addressed in another.'",
        "'speaker_8': 'Manner. But for the land swap itself.'",
        "'speaker_0': 'We are in favor of the.'",
        "'speaker_8': 'Swap. We want this thing going.'",
        "'speaker_0': 'We want the.'",
        "'speaker_8': 'Block to change as quickly as possible and.'",
        "'speaker_0': 'Get this thing moving and become an asset for our.'",
        "'speaker_8': 'Community. Thank you.'",
        "'speaker_0': 'Thank you. I call the next five up, Andrea Robinette, Dan Shaw, Eric Penn, Darren Bloom and Miguel Cabezas Reese.'",
        "'speaker_8': 'Is there.'",
        "'speaker_0': 'Andrea or Cindric.'",
        "'speaker_8': 'Sandra. Sandra.'",
        "'speaker_0': 'I apologize.'",
        "'speaker_7': 'Good evening. My name is Sandy Robinson and I live at 2875 Birch Street. And I opposed the land swap. I have been in attendance at several neighborhood meetings addressing the land swap and placement of the park on 28th and Fairfax.'",
        "'speaker_7': 'I've heard comments made by several residents expressing support for the land swap because of their belief that the land swap will ease some of their safety concerns. As an African-American Latina, I too have concerns. I feel that not only are these comments racially biased, but will perpetuate the pattern of racial harassment.'",
        "'speaker_7': 'We people of color are experiencing in the country today. I have concerns that those who express these safety concerns, those moving into the development and specifically the retailers that are proposed to surround this public park, will be given unjustified reasons to harass, call the cops and unnecessarily risk the lives of people of color.'",
        "'speaker_7': 'Despite the resurgence of gentrification in Park Hill, there is still a strong presence of people of color. We long term residents should not, under any circumstance, live in fear of our new non-ethnic neighbors. We shouldn't have to worry that the police will be called on us because we want to have a birthday party or a barbecue in'",
        "'speaker_7': 'what will be deemed a public park. And let me just say, when we are in public parks, our barbecues are not the same as other people's barbecues. My music is loud. My music is in a different language. My music is not only in English, it's not country.'",
        "'speaker_7': 'I listen to salsa is merengue is cumbia, and it's in Portuguese because I speak Portuguese fluently. By placing the park within the development and allowing the land swap, the city would.'",
        "'speaker_4': 'Not only allow.'",
        "'speaker_7': 'But encourage the harassment we are experiencing today. But let me be clear. I'm prepared for the harassment. I strongly.'",
        "'speaker_4': 'Believe.'",
        "'speaker_7': 'That by allowing the swap, Denver will soon be on the news and social media with our own permit parties and bet in barbecue. Becky's. So please. City Council developers and future residents and retailers know that if there is one.'",
        "'speaker_4': 'And I mean one, unwarranted harassment phone call made.'",
        "'speaker_7': 'On a single person of color, we will witness protests far reaching anything Denver has ever experienced. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Dan Schorr.'",
        "'speaker_8': 'Hi. I'm Dan Shaw. I live at 30th and Forest and that's very hard to follow. I think this is a really very difficult issue.'",
        "'speaker_3': 'For Park Hill.'",
        "'speaker_8': 'And a couple of people have mentioned that this has brought forth some really important things that need to be resolved discussed. I would just urge the city council in whatever it does tonight that a process be embedded to continue the conversation.'",
        "'speaker_8': 'There was a very good conversation, an excellent moderator that one of the councilman heard and convened several meetings about the park. There was a moderator from U, c, d and he did a great job really enabling people, giving people a voice.'",
        "'speaker_8': 'And I think that really more than anything else for me about this East or West is that it's an opportunity for us to to get to have that opportunity to to talk about these things. And so if if it wherever the park is, there has to be a really intentional process for designing it and for and for'",
        "'speaker_8': 'and for creating something where it is really, truly inclusive. So I mean, I think that's my really one. I want to say thank you.'",
        "'speaker_0': 'Thank you, Eric Pen. Oh, I'm sorry. Yes, there could.'",
        "'speaker_8': 'Her name is Eric Penn. I'm a community advocate and a resident and mom. Some may wonder why a resident of mom Bella would show up at a parks meeting in a Park Hill, especially when I have a pretty nice neighborhood park.'",
        "'speaker_8': 'I can walk a block and go to Silverman Park. Like I see families that are having barbecues and quinceaneras. The streets are always packed. They play football. We have a pavilion, we have a playground swings. And that's why I'm here, is because all of these things are the things that this city is or this neighborhood is asking'",
        "'speaker_8': 'to be put into their neighborhood so they can experience the things that we experience. In my neighborhood, in Montebello. And I don't think that's unreasonable. I think that's what this community deserves. It is a park desert, which is ironic being named Park Hill.'",
        "'speaker_8': 'But. There are some things that happen in this process that I think we've heard tonight brought out some of the disdain in the neighborhood, some of the ugly sides of people. During the community meetings, people feel that they are pitted against each other by the moderators that were hired at a $30,000 expense.'",
        "'speaker_8': 'They felt that there were issues of gentrification that helped divide people based on race and that the city wasn't clear and wasn't transparent in its efforts to make this park a reality. So I think what people are saying is true.'",
        "'speaker_8': 'We have two issues here. One is about what is an actual community park look like? What is the intention of parks in this city? What is the purpose for putting them where we put them, and what do we intend people to use them for?'",
        "'speaker_8': 'And then how does the city council, how do the city agencies actually interact with the residents? What is it that they expect from the residents who follow through in all the community meetings that they're asked to go to?'",
        "'speaker_8': 'They got resources to build architectural plans and designs. They went through all of the processes that they're asked to do and still came to find out through an open record request that a deal had already been signed with a developer.'",
        "'speaker_8': 'And so I ask the City Council to look and work to create new processes in outreach to the community, to develop new procedures when land development is taking place, and to vote this measure down. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Darren Bloom.'",
        "'speaker_8': 'Good evening. My name is Darren Blum. I live on 29th and Fairfax, two houses up from where this this commercial development will be. I, I work from home. I have multiple dogs. I'm out on that block every single day.'",
        "'speaker_8': 'Whether it's summer or winter, freezing hot doesn't matter. I think it's imperative that we approve this park. We let the construction go through. We let the the developer proceed with the plans that they had at the they've outlined with the commercial on top of the residential and mixed use, which will bring a vibrancy to the to that'",
        "'speaker_8': 'part of the street, the community. I understand there's some concerns from the long term residents. And and I think in my interaction with the developer, he's been quite accommodating and understanding of some of the issues there. And I think if there was perhaps some more dialog, we can get through this.'",
        "'speaker_8': 'But the short of it is I, I would like to go forward with the swamp and get this thing built.'",
        "'speaker_0': 'Thank you. Next up, Miguel Cabezas Reese.'",
        "'speaker_5': 'Why are we here? So I was. You know, I've heard a lot at this meeting so far. I've heard some residents urging for broken windows policies which are failed. I've heard some colorblind racism, and I've heard advocacy for certain things that, you know, that we have to wait to talk about gentrification, that we have to wait to'",
        "'speaker_5': 'have the concern, the conversation about the displacement of communities of color. And we can't have those conversations here in front of the council. Where can we have those conversations? I have heard of City Council, Parks and Recreation Director say that there is no money to build this park and that the $650,000 to build this park by the'",
        "'speaker_5': 'developer is a gift. I object wholeheartedly to that characterization. This land swap is no gift. The way that this deal was made and is being pushed through council is no gift. The way that Greater Park Hills are now and the community was sidelined was no gift.'",
        "'speaker_5': 'And please note is that all of the people of color who testified here against were against this. This bill is not about a park, but is about a park. But we cannot ignore what else is being built, the development being built.'",
        "'speaker_5': 'The housing does not include any affordable housing, much less low income housing. Initially, the developer wanted, I understand, to make this a private park. That is regrettable, but more than that it is telling telling of who will be welcomed at this park, who will have the police called on them, whose children will, in the words of tenant'",
        "'speaker_5': 'housing, coats, commands and so entire sidewalks with their tricycles, people of color are being kicked, kicked out of the city by what some have regrettably called natural market forces. There is another term for this, which I would like and which I refer to it as economic racism.'",
        "'speaker_5': 'The concern from the community and communities of color is the exponential displacement of communities of color from areas that we have lived in, areas where our roots have taken hold and grown deep. I regret this bill and I urge a no vote.'",
        "'speaker_5': 'If this were a development that had sustainable, affordable units, substantial affordable units, I might feel differently. What we need are affirmative action, like policies that act as a tourniquet on the loss of people of color from Denver, policies that require all medium to large housing developments to include affordable housing units.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. And I'll invite Ben Maxwell, Patricia Iwasaki, Matt Emmons and Jeanette Fidel up to the front. And Ben Maxwell, you're up.'",
        "'speaker_3': 'Hi, Matt. Hi. My name is Ben Maxwell. I'm the with H.M. Capital. I'm the owner of H M Capital and also PHC next year. I just wanted to come tonight and say thank you all for all for your time.'",
        "'speaker_3': 'Thank everybody in the community for their input. We're very regretful that this has turned into a into a fight over gentrification. We came into this I used to live in the Park Hill neighborhood at 30th and Cherry, and we came into this with let's do a neat development that supports retail, which supports local businesses, things that are'",
        "'speaker_3': 'owned locally in the neighborhood. People can live in the neighborhood, people can work in the neighborhood, people can own a business, have a restaurant, things of that nature. Our biggest goal with this project is to unite the community.'",
        "'speaker_3': 'So it's very sad that that's going the opposite direction and we hope that we can do whatever we can to repair those relationships. We are. Looking, you know, we're not trying to do even though, you know, good design does not necessarily mean upscale development.'",
        "'speaker_3': 'We're looking at trying to keep all of our rents at an affordable rate for both retail as well as residential. We are looking for small businesses. We have turned down large national franchises to go in this block because we really want locally owned Park Hill, Denver businesses to operate in this space.'",
        "'speaker_3': 'It's been our goal that this is a community center for the Park, for North Park Hill and all the yield the rest of our time to do. The neighbors who have a lot to say.'",
        "'speaker_0': 'Thank you. Next up, Patricia osaki.'",
        "'speaker_4': 'Thank you. My name is Patricia Iwasaki.'",
        "'speaker_7': 'I live in northeast Denver. I'm on the board of taking neighborhood.'",
        "'speaker_4': 'Health to heart. And I have been working with Greater Park Hill Community for the past three years in terms of their sustainability efforts. I am a social worker by training. I have been working.'",
        "'speaker_7': 'On environmental justice issues in northeast.'",
        "'speaker_4': 'Denver.'",
        "'speaker_7': 'For the past.'",
        "'speaker_4': 'I'd say ten years. I really urge and echo a.'",
        "'speaker_7': 'Number of sentiments.'",
        "'speaker_4': 'That there are strong feelings that this.'",
        "'speaker_7': 'Ordinance and the action of the transfer.'",
        "'speaker_4': 'Of.'",
        "'speaker_7': 'Land with across the.'",
        "'speaker_4': 'Street has lacked transparency with the neighborhood.'",
        "'speaker_7': 'There are a number of.'",
        "'speaker_4': 'People of color and older.'",
        "'speaker_7': 'Residents who have lived in the Park Hill area for the past.'",
        "'speaker_4': '40 to 50 years that have.'",
        "'speaker_7': 'Very strong feelings.'",
        "'speaker_4': 'But city council in the city is not concerned about the issues.'",
        "'speaker_7': 'That residents are concerned about. It is not a matter.'",
        "'speaker_4': 'Of being for.'",
        "'speaker_7': 'Or against.'",
        "'speaker_4': 'A park or park.'",
        "'speaker_7': 'Systems, but it is a matter of having the. Voice and listening to people who live in the area. I'm the kind of park.'",
        "'speaker_4': 'That they'd like to see. There is a concern that what will be built will exclude longtime residents and people who have been a part of Park Hill for a number of years. Being comfortable to be able.'",
        "'speaker_7': 'To utilize the outdoor area.'",
        "'speaker_4': 'And despite all of the best intent of developers, I think this is a major issue of concern.'",
        "'speaker_7': 'I won't take any more time, but I urge.'",
        "'speaker_4': 'The City Council to listen to. This is.'",
        "'speaker_7': 'Just a small fraction representing.'",
        "'speaker_4': 'The voices.'",
        "'speaker_7': 'That feel very strongly about this issue in the community. Thank you very much.'",
        "'speaker_0': 'Thank you. Matt Emmons.'",
        "'speaker_12': 'Thank you. My name is Matt Emmons. I live at 2880 three fourth Street. I back up immediately to the proposed development project, Fairfax. I lived there for 15 years. It's the only home my kids have known. I have a daughter at East this morning, a son of McAuliffe and then a dozen kids on the half block that'",
        "'speaker_12': 'we run around on the front yard and have since they were very small. I want to thank Councilwoman Kenney for coming out today and meeting with some of the immediate neighbors around the project. Perhaps less vocal, but no less passionate about the project.'",
        "'speaker_12': 'We are for the swap. Almost. Almost to a home. A lot of emotional speeches, a lot of emotional topics, many that I honestly can't relate to. But I'm a more pragmatic person and have a more pragmatic approach to this.'",
        "'speaker_12': 'And there are a series of facts here that cannot be disputed. One is there will be a park on this block. Parks and Rec is committed to that east or west side. There will be a 15,000 square foot park there.'",
        "'speaker_12': 'It will be eventually flanked by commercial development on either side. That issue remains the same, and it will be built and maintained by the park by the city of Parks and Rec. The issues are, when does it get built?'",
        "'speaker_12': 'Who built it and who pays for it? We feel like this is a bird in the hand. With the step with the developer stepping up to pay for it to provide the funds for Parks and Rec to do it.'",
        "'speaker_12': 'The design of the park is something that I am not concerned about, frankly. Open space, grass, trees, play structures. It doesn't matter to me, but it bears repeating that this park will be between commercial developments, no matter where it is.'",
        "'speaker_12': 'Be the same size. No matter where it is, it will be on the block regardless. So if we focus on those, I think we can reach a conclusion that this is good for the neighborhood long term and good for us.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jeanette Fidel. She met Fidel. All right. Thank you all very much for being concise and respectful with your time. We did get through everybody with a little tiny bit of time to spare. That does conclude our speakers.'",
        "'speaker_0': 'Are there any questions from members of council?'",
        "'speaker_5': 'Councilman Herndon name is president and thank you, Mr. President, for getting through that so that we can get everybody through because I appreciate them coming in here. And I'd like to call Parks and Rec up to the few questions.'",
        "'speaker_5': 'Things that I'm just in other people in the queue. So I'm just going to ask a few questions and I will bow out. I asked these at committee, so these should not be surprising. We keep hearing that the neighborhood is not going to be involved in this process.'",
        "'speaker_5': 'You said this and Gordon said this. You're going to create a design committee that will who will be a part of this.'",
        "'speaker_11': 'Yeah. So the design committee, which we will put together, will be, of course, have some park staff on it. We do want we have committed at the meeting, Gordon did commit to having a greater greater Park Hill community member on that committee.'",
        "'speaker_11': 'This is going to be a public process. So we would bring that group together to actually select a design firm to actually move forward. The design at this time, like I mentioned before, there is no design of the park.'",
        "'speaker_11': 'There are some concepts, you know, there was a mention of swing sets and slides that is still all on the plate. We are not saying this is going to be one thing or another that is still to be decided.'",
        "'speaker_5': 'Thank you. And second question deals with this being a designated park. So this will be owned. This is Denver Parks. And my understanding was there was even going to be conversations about the community being involved in the naming of the park.'",
        "'speaker_5': 'And I want to make sure that that was correct as well.'",
        "'speaker_11': 'Yes. So what we would do is if this passes, if council feels that this passed and move forward, we would actually begin working on rezoning this parcel to OSA, which means that would become a public park. Once that's done, we would move forward with the design.'",
        "'speaker_11': 'We would work on constructing the park and wants to. The construction is done as as I've done with many other parks in this city, over a thousand acres. We would move forward with the designation of this park, which protects the park from ever being developed as anything else and anything that is not a park purpose.'",
        "'speaker_11': 'The other thing that I did want to mention is this would be a public park. So that means all park rules and regulations do apply. Everybody is welcome to this park. This is the community's park. So that is something that we would we would definitely stress.'",
        "'speaker_5': 'Again, two more questions, Mr. President. There was a conversation about not taking he to any other offers. I only know of another one which came from the owner of the brewpub who was just to the north of the XL Parcel.'",
        "'speaker_5': 'And I could you just speak to that offer and why that was not considered.'",
        "'speaker_11': 'So there was an offer that came in. You know, we had started this discussion in early 2016 with H&M Capital. The brewpub was moving forward, it was being designed. It was doing everything they knew about all these discussions.'",
        "'speaker_11': 'Early 2016, we actually did go to a Greater Parkhill community meeting and we actually had a presentation about this whole development. So everybody was aware of the possibility of having a swap and building the park on the east side in November.'",
        "'speaker_11': 'We did get a proposal from the beer pub that is on the corner and what that proposal was, there was two pieces to it. The first part of it was they offered, I believe, $150,000 to actually buy the parcel from the city and to build a private park.'",
        "'speaker_11': 'And then they would actually allow the city to possibly use the park, or they would actually the other part was they could maybe help us build a park. And so that was the proposal. And at that point we had already been discussing and we had a firm commitment from H&M Capital on what funding they would provide to'",
        "'speaker_11': 'this space. And so the two proposals just were not even close.'",
        "'speaker_5': 'Thank you. And my last question, Mr. President. Timing. So we should just go through we will start the process of designing a community designed park that will go on the east side. If this does not go through, then we are we are going with the Xcel substation.'",
        "'speaker_5': 'Do we have a funding source for the Xcel substation to develop into a park?'",
        "'speaker_11': 'No. As most of city council, everybody on city council knows, we have a process in parks. We actually have a sip list, a planning list. And so what happens is we put all projects on our capital improvement project list, and that is all the projects that are in all the districts, in all the city.'",
        "'speaker_11': 'And so those are projects that we want to get to. And so that this if this did not move forward, this project would go on that capital improvement list and it would actually have to just jockey for position and then we'd have to, you know, dirt, we'd have to see the priority and what was being done in'",
        "'speaker_11': 'the city. And we would just it would fall in with all the other projects in the city.'",
        "'speaker_5': 'Okay. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Councilman Lopez.'",
        "'speaker_8': 'Discussion of parks. My allergies are going haywire here. Mr. Gilmore, I just wanted to ask you a couple more questions. When you acquired the park in 2010, was it an Excel substation?'",
        "'speaker_11': '2015, I'm sorry, it's the end of 2015.'",
        "'speaker_8': '2015. And it was an Excel substation.'",
        "'speaker_11': 'Yes, it was exactly like the one in Westwood that we purchased there.'",
        "'speaker_8': 'So Excel substation became city owned. What is the if you would, if we were to build that out? Designed. So we've already paid for it. We've already paid for it. If we were to build that out. Design, build.'",
        "'speaker_8': 'I mean, I'm asking you to speculate, but what would the budget be for a built out park like that?'",
        "'speaker_11': 'For a park that size, even though it's a it's a smaller park. Can you talk.'",
        "'speaker_8': 'About like a family structure swings? Yes, slides.'",
        "'speaker_11': 'So the design process, a park about that size as a as a pocket park between probably $750,000. $10 million.'",
        "'speaker_8': 'Right. Which. Okay. Talk to me a little bit about the process. I know that, you know, in the chambers I heard that we were testimony that the process wasn't clear, wasn't transparent. And so what? Walk me through the process as that's what's.'",
        "'speaker_11': 'So I have to take some responsibility for that. And back when I first started this job, I traveled to L.A. with Gordon Robertson. And we were we were traveling to L.A. They have a project where they're building pocket parks all over the city.'",
        "'speaker_11': 'And so when we came back, you know, my thought was we can just look for possible opportunities in neighborhoods that desperately needed them. And so when this these Excel transfer stations came up, I saw it as a perfect opportunity to possibly build parks and build a couple of parks in neighborhoods that desperately needed it.'",
        "'speaker_11': 'So when it was when it was available, we actually purchased it. I was attending meetings at Greater Park Hill. I was going and letting them know that I was working on this project, that I was hopefully going to purchase this parcel and that it was on the east side.'",
        "'speaker_11': 'And at that time we had no funding and that if we could do anything with that parcel at that time, you know, there might be the possibility of, you know, maybe taking out part of the wall because there's a big stone wall around it and possibly creating maybe a dog park.'",
        "'speaker_11': 'We didn't. What my commitment to the community was is that we're not just going to take a parcel on that block and just grass it and then actually maybe make up a space that just was not activated that actually could end up being more of a detriment to the community than than an asset.'",
        "'speaker_11': 'So we really wanted something that was going to activate the space and make making sure that that park was going to be a positive draw for the whole community. And then H.M. Capital, as we were just holding on to the parcel because we did not have any funding.'",
        "'speaker_11': 'H&M Capital did approach us in 2016 and said, Hey, we have purchased the East Side of the block and we'd like to possibly just discuss with you the possibility of us helping you guys build a park on the east side.'",
        "'speaker_11': 'This was there was never an I heard someone mention this that H&M Capital was going to build a private park. There was never once any mention of this being a private park for H&M Capital when they came to us and said, we want to help.'",
        "'speaker_11': 'This was always to build a public park that was going to be available to everybody. So we did get other proposals way back from other developers that never moved forward about building up a private park. And so that may be where that came from.'",
        "'speaker_11': 'So we did start the discussion with H&M Capital. We kind of were discussing this. I was very clear with the community that this process right here would be what would have to happen if this moved forward, that the swap would have to be approved by city council and this project would not move forward unless this this city'",
        "'speaker_11': 'council approved it. So really, this is now on city council to say, do we want to move forward with building this park on the east side of of the street of Fairfax with somebody else's money? Or do we want to wait and build it later with city funds on the West Side?'",
        "'speaker_11': 'I mean, that's what it boils down to right now.'",
        "'speaker_8': 'Right. So let me look. I appreciate that, Mr. Gilmore. I know that there was somebody from the neighborhood association in that area that spoke. I forgot your name. If you can come up and I wanted to ask a question of the neighborhood.'",
        "'speaker_8': 'Yeah. We were representing the neighborhood association up there, and. I'm sorry, I forgot your name.'",
        "'speaker_7': 'Blair Taylor.'",
        "'speaker_8': 'Blair, I'm sorry. Ms.. Taylor, on this. On that block. I'm looking at it right now. So 29th to the north, 28th to the south. You got Fairfax. You got the east side in the west side. I'm looking at the zoning in that area and that in that whole neighborhood.'",
        "'speaker_8': 'It's all zoned. Just on that block, the whole neighborhood's different. Is residential on that particular block. It's all Main Street. Main Street two. So it's commercial all around. Right?'",
        "'speaker_7': 'Yes.'",
        "'speaker_8': 'What's the difference between. A park on the West Side and the park on the east side when they both have mixed use kind of commercial on both sides. What's what's the difference with what the name would you feel based off of your conversations with the residents in that area?'",
        "'speaker_8': 'What's the main difference?'",
        "'speaker_7': 'I think one of the large differences is the sort of intent of the users. So the west side of the block is owned by a minority landlord. It houses a lot of nonprofits at Howard Houses, Greater Park Hill Community Board.'",
        "'speaker_7': 'It has a new ice cream shop that's used by families. Well, you know, it's very residential. It's one one story. It's very welcoming. There's a lot of mix of people and diversity. And I think a lot of the concern comes from when you put a green space.'",
        "'speaker_7': 'That is abutted on both sides by brand spanking new development that's owned by a single developer. The people who've been there the longest aren't necessarily going to be migrating over. A lot of the concern is come with what types of businesses are going to go there.'",
        "'speaker_7': 'We've heard it heard high end grocery stores. That's not really what the neighborhood needs. We need like corner stores. We need things that are our residents can use. We've lost laundry mats. We've lost just sort of like everyday places.'",
        "'speaker_7': 'And I think that people were really hoping that the park would be a place where. Families and old residents, new residents. The people who showed up at our community design meetings were such a huge range of residents and it was like an open palette.'",
        "'speaker_7': 'And what we're seeing when you look at the supporters, it's sort of one faction. We're not seeing a big diversity. The people who are opposed to this have real concerns and they come from a diverse background. I hope that's what you saw.'",
        "'speaker_8': 'I appreciate the response. And if I can add. Thank you. Can I get Mr. Maxwell right. Ben Maxwell, you're the owner of the properties, correct?'",
        "'speaker_3': 'Yes.'",
        "'speaker_8': 'Now. And your reason why? Why would you want to do the land swap? I mean. I mean, why not enjoy the park from across the street?'",
        "'speaker_3': 'Yeah, altruistically, it was. We looked at the whole block. We got a good portion of the block on our contract. We looked at the park on the other side. We initially had a commercial design, so we owned the park directly or the parcel directly adjacent to the Excell substation as well on the west side of the street'",
        "'speaker_3': '. So we initially looked at doing commercial there and what we decided was we really wanted to support and when we were doing that, we were looking at doing 100% residential on the east side of the street and being in that neighborhood.'",
        "'speaker_3': 'I knew and I felt like. Retail office and residential was a better fit for that bloc than just doing a large scale residential project on the East Side. With that right now is not really a great time to build retail property.'",
        "'speaker_3': 'That's just not it's it's not as profitable, it's not as economical. There's just lots of downsides to building retail over building residential. So we looked at it and said, okay, well, what? Is there something that we could do that would be a differentiator and also give back to the community?'",
        "'speaker_3': 'And so really that was our decision on the park was not to not to get increased rents because I don't think we're going to get a dollar increased rents, but just to attract more tenants, attract more community, attract more of a well-rounded, balanced development for the block rather than what makes the most financial sense, which is residential'",
        "'speaker_8': '. One more question, if I may, Mr. President. So you approached 650,000 plus commitments with build afterwards as well to.'",
        "'speaker_3': 'Well, initially. So it's kind of evolved over time. Initially, we we went ahead and did a design on the park because we knew that the department didn't have the money to do a design. So we went ahead and said, all right, well, we'll just design something to get the concept out there.'",
        "'speaker_3': 'So we did that and we also tore down all the properties that were on this this land. We've also spent quite a bit of money on the land that we're trading dollar for dollar and where we initially were going to build it.'",
        "'speaker_3': 'And then once we were done, go through this process of transferring it at that point to the city and doing this land swap after reconstruction was built.'",
        "'speaker_8': 'If you don't build the park, if the park isn't built on the site, if this land swap doesn't go through and the site that you have and envisioned for a park.'",
        "'speaker_3': 'We're giving the money at the time of the swap. We are giving the money the six.'",
        "'speaker_8': 'If this if the swap doesn't happen, yes. What happens to that property, which would be 28, 68, Fairfax?'",
        "'speaker_3': 'We would probably start over from scratch on our design for the whole block.'",
        "'speaker_8': 'And there would be no greenspace.'",
        "'speaker_3': 'Or no we have. So in my zoning there is a zero requirement for any open space. It's not we're not required to have 10% open space. We're not doing this to meet any city requirements.'",
        "'speaker_8': 'Would you still donate to Parks and Rec?'",
        "'speaker_3': 'Unfortunately, all that money would go to redesign the new buildings. It would have to go there.'",
        "'speaker_8': 'All right. Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Lopez. Councilman Cashman.'",
        "'speaker_5': 'Thank you, Mr. President. Is anyone from community planning and development here? That would have been helpful for a land swap discussion. The question I'm trying to answer is on the parcels on the West Side, is there anything that anyone wants to talk to in the zoning code that would limit development on the West Side from possibly at'",
        "'speaker_5': 'some point becoming akin to development on the East Side? Okay. Thank you for that. Mr. Maxwell, I have a few questions for you. Sir. So. There's relevance at some level. These parcels that we're going to swap. What would you estimate each parcel would sell for if you're going to sell a third of a .36 acres?'",
        "'speaker_5': 'I think it is.'",
        "'speaker_3': 'This are the last parcels that we purchased. It was two independent parcels and then a portion of a third parcel. And I believe we paid about 1.5 million for the land for that, for just the piece we're giving to the city and that the city is giving.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'So about 1.3.'",
        "'speaker_3': '1.5. 1.5.'",
        "'speaker_5': 'Thank you very much. When you talk about affordable rents, you have any clue what that means?'",
        "'speaker_3': 'Yes. I mean, we looked at we looked at affordable housing on this instead of paying the the linkage fee. And unfortunately, because we have 22 micro apartments and 21 three bedrooms, micro apartments don't qualify or didn't initially when we were going through this process a year and a half ago for consideration in exchange for a linkage fee'",
        "'speaker_3': '. So we went through that process for about two months with the Office of Economic Development, and basically it got to the point where just it wasn't feasible.'",
        "'speaker_5': 'Okay. Well, but I mean, do you know, are you planning two bedrooms? Three bedrooms?'",
        "'speaker_3': 'So we have one bedroom units or basically micro apartments that are about 400 square feet with a loft bedroom. Those are going to be 12, 1300 dollars a month range. So one bedroom is very affordable for this city and crazily enough.'",
        "'speaker_3': 'And then we have three bedroom units. Average rents for three bedrooms around the city are pushing above $2 a square foot in many apartment buildings. We're going to be at a dollar $60, 65 a square foot.'",
        "'speaker_5': 'Do the math for me. Was that going to mean.'",
        "'speaker_3': '2400, 2500 for a three bedroom?'",
        "'speaker_5': 'Thank you. So when you developed this park, how close? Would your buildings be? How close can you build the edge of your buildings being.'",
        "'speaker_3': 'According to zoning? We can build right on the plot line. There is a section of our building about 25 feet that is right on the lot line. The rear 30 feet is parking. So we're not there's no building adjacent to that in the front.'",
        "'speaker_3': '70% or so of the building has patios that face to the park.'",
        "'speaker_5': 'So your access to this park.'",
        "'speaker_3': 'The access to the park is all through the street. Okay.'",
        "'speaker_5': 'Thank you. Yeah. The rest of my questions are for community planning and development. Who's not here? Thank you.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Councilman Espinosa is up for the question, but I think he also had an answer to your first question that he thinks he could answer. Would you like an answer from Councilman Espinosa? All right, Councilman Espinosa, take away for everyone.'",
        "'speaker_6': 'Here's the graphic. So the yellow is the single family rose mean the surrounding residential. The red area is the zoning the the current CMS two zone district. It covers both sides of Fairfax and so since both parcels mean both sides of the street are the same depth.'",
        "'speaker_6': 'Essentially, they're both capable of the exact same sort of development approaches.'",
        "'speaker_0': 'All right, Councilman Espinosa, also up for questions.'",
        "'speaker_6': 'I didn't then I didn't do the math. So what is this square footage? I mean, the square foot cost on residential sale, sort of the commercial. I mean, the the value of residential development, new development in this area per square foot.'",
        "'speaker_3': 'If we were to sell the.'",
        "'speaker_6': 'Townhomes, yeah.'",
        "'speaker_3': 'It would be a guess because we haven't looked at it on a for sale basis, but probably in the 325 to 350 range.'",
        "'speaker_6': 'Okay. Are there any so for anybody else, are there any realtors in the audience that do work in this area? Just sort of corroborate that. Okay. Thank you. And then, Scott, I've got a quick question for you. Is there anything sort of legally preventing the developer from giving $650,000 for the design and construction of the park on'",
        "'speaker_6': 'the former Excel site?'",
        "'speaker_11': 'No, I do not believe so.'",
        "'speaker_6': 'Okay. So it's.'",
        "'speaker_11': 'No.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_11': 'My attorney said no.'",
        "'speaker_6': 'All right. Thank you. No further questions. Thanks.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman Brooks.'",
        "'speaker_6': 'Thank you, Mr. President. Scott at the podium already. Would you be willing to put into writing what that board advisory board would look at, would look like when designing.'",
        "'speaker_11': 'The design committee? Yep. Yes. We could put something together.'",
        "'speaker_6': 'By next week.'",
        "'speaker_8': 'Yes, we could. Okay. Thank you. I have a.'",
        "'speaker_6': 'Question. I'm trying to figure out how to. Scott, can you can you. Again, I'm going to take us back to the meeting that we had on committee. And you you know, I think there is a conversation in here around gentrification, displacement, as if you don't interact with that.'",
        "'speaker_6': 'Right. And so I feel like I'm hearing two different things, right? I'm hearing something from the community and something that you don't understand. I know specifically that you've helped me with inclusion with Brick City at Curtis Park. And so but for whatever reason, we have missed the ball here.'",
        "'speaker_6': 'And that's what I'm really trying to understand. And so I want you to respond to that. And I also want you to help me talk through and help the community think through opportunities of inclusion, just like what we've done on the East Side.'",
        "'speaker_11': 'Yeah. So I have to take full responsibility as the deputy manager of parks. I mean, I was my goal was just to try to get a park built in this community. And, you know, if anybody made some missteps, I probably made some missteps.'",
        "'speaker_11': 'And and I should have been probably a little more forthcoming on how this whole process was moving forward. We were just trying to move forward, and I saw a great opportunity to get a park built and a community that desperately need it, needed it with somebody else's money.'",
        "'speaker_11': 'So I kind of moved forward, you know, when we got to the point and and when I got questions from Greater Park Hill or any community members, I was responding in June of 2017. There was some questions about the naming.'",
        "'speaker_11': 'And I know Robin Councilwoman Canete was really involved in that and there was some questions about naming it after community member. And, you know, we thought we realize that we would do that and we could work on that and that could be a community process.'",
        "'speaker_11': 'And that was one of those sticking points, it seemed like. And so it continued to move forward and I continued to try to engage. And then as the development started to coalesce and H&M Capital had purchased the block and then building started to come down, that is when this really, really became an issue.'",
        "'speaker_11': 'And I think people started seeing that this was happening. And I think the park became a target for the bigger issues of gentrification in the neighborhood and just some of the displacement and the affordable housing and all those things.'",
        "'speaker_11': 'And I tried my best to explain to people that I'm building a park for everybody. As you said, you know, I've worked on on community issues and in neighborhoods downtown and communities of color, making sure parks are built in communities of color, that we are building the best parks we can in all communities, because everybody in this'",
        "'speaker_11': 'city deserves a high quality park in their neighborhood. And that is what I'm shooting for with this. We made some missteps. We stopped we stopped our process and we slowed down. We started to engage. We you know, we went to some of their community meetings.'",
        "'speaker_11': 'They started a community meeting, and we went to those we started our own process. And I believe through those two processes, those community meetings, the seven meetings that were were had, that we do have a good foundation to build a park that everybody could be happy with.'",
        "'speaker_6': 'Okay. Thank you for for answering that. And I just say that the next step of inclusion when it's built is I think we're the, you know, the. You know, it really has to be that way. Yes. And I hope that and I agree.'",
        "'speaker_6': 'I hope that Gordon, as as we talk through that, that there even next week, we can start thinking of some implementable items from the jump that the community can put into.'",
        "'speaker_11': 'To and be that. One thing I do want to mention and I want to stress. Yeah, great. Parkhill did a really good job on these meetings and this concept that they came up with are very valid and we want to start our process with this community led design, and so we're committing to that.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_6': 'Is there an attorney with Parks here? Turney. We really say, Oh, great.'",
        "'speaker_5': 'Good evening. Jason Moore, city attorney's office.'",
        "'speaker_6': 'Jason, I see you everywhere. And I think this is the first time. I think it's the first time like this, brother.'",
        "'speaker_5': 'I hear that.'",
        "'speaker_8': 'Okay, good.'",
        "'speaker_6': 'Jason, here's the crux. I think of the issue. There's a ton of mistrust in the community, right? Ton of mistrust in my community of five points and all over the city. And we as government, I think it's our responsibility to continue when there's mistrust, to be even more transparent.'",
        "'speaker_6': 'Right. And so that the issue for me is on this is that we don't have any, it seems to me, legal issues on refugees when we're trading land and things like that. I've seen us do our eyes to try and get, you know, what is a request for inquiry to just see if the land works and we'll'",
        "'speaker_6': 'get a bunch of folks and then we'll take it through a process. So there's no you did a backroom deal. Tell me about our policy is and I know it's not but but is there anything that can. Help us to improve this policy so we don't have to go through this with the community.'",
        "'speaker_5': 'Yeah, and it'll be a split answer. So I have my answer to what the general review of the advice I'd give the parks but real estate as a policy as well. The XO eight and XO 100. I think that's real.'",
        "'speaker_6': 'That's an executive order. So everybody's phone.'",
        "'speaker_5': 'So I apologize. Executive Order three. Executive Order 100. Deals with competitive process in contracts. And then, of course, the charter Nicole deals with competitive process and construction. Depending on the deal, depending on the dynamics of the deal, depending on what parts wants to get done, I might advise that they do requests for information or some kind of'",
        "'speaker_5': 'RFP process to do to cover some of the political issues that might come up. So there are the rules, there's the code. But, you know, sometimes the policy is going to kind of win the day. If if if that is what you need to make folks happy.'",
        "'speaker_6': 'And so on. This situation, what did you.'",
        "'speaker_5': 'Advise? I was I came late to this party. So this this was pretty far down the road. So Parks had begun to negotiate the contours of the deal that they were going to do, land swap, etc.. The issue of a competitive process for this did come up.'",
        "'speaker_5': 'I'll let Lisa Lumley finish out that answer based on some unique characteristics of the deal. I, I didn't see that a competitive process was required. But, you know, again, there there was already a lot of momentum behind the deal anyway.'",
        "'speaker_8': 'So this is.'",
        "'speaker_6': 'No legal issues with this.'",
        "'speaker_5': 'Strictly speaking. I don't think so. Okay.'",
        "'speaker_8': 'Lisa would like to.'",
        "'speaker_4': 'Lisa Lumley It is not often that we do an exchange and the conversations had started. By the time real estate was brought in, because it was exactly parcel four, parcel square foot, four square foot, literally across the street.'",
        "'speaker_4': 'That is why we thought that we could justified the unique situation of going out to a true RFP, RFI, because everything was exactly the same zone, the same. The values would have been the same.'",
        "'speaker_6': 'So the executive order is it's not a suggestion.'",
        "'speaker_4': 'No, it's not. And what it does say, though, is we would still do our clearance and releases, which we do. We do our environmental due diligence, which we do. So from that standpoint, it's the disposition that would be called out on how we would do it.'",
        "'speaker_4': 'And or and I will say there are certain other dispositions through our tax title that we we may handle a little differently. So everything else in Executive Order 100, though, we would absolutely be following.'",
        "'speaker_6': 'Last question. If you would have gotten a deal that was comparable to competitive. Would you would have reviewed that deal. Looked at that deal because there's many received the email today saying that there are three deals.'",
        "'speaker_4': 'Yes, we would have. And I will say I'm only aware of one other offer as well. We did see that. That is why we actually slowed the process down at that point when I was made aware of the second offer.'",
        "'speaker_4': 'So we did look at it to compare those. Okay.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Brooks.'",
        "'speaker_10': 'Councilman Scott. Skye, let me get this guy going to give you this ring. So that's the handout we have received today. And on the back of that, it has designed features that I assume that you're talking about as part of the design that came from the community.'",
        "'speaker_10': 'Is there any design feature that's listed there that is out of. Ordinary would not be considered as part of the design committee? No. Okay. So it all seems to be very in line with what you're saying with the design coming from the community.'",
        "'speaker_11': 'Yeah. I mean, like I said, their design process, that Greater Parkdale community had actually had some very valid suggestions and were going to, like I said, were committed to taking that design effort and utilizing that to build this space.'",
        "'speaker_11': 'To be clear, this is a third of an acre and this is a very, very small parcel. So everything that the community has been suggesting, it will not all fit in this park. So the site limitations.'",
        "'speaker_8': 'Are being assessed.'",
        "'speaker_10': 'All those will be considered. Yes. Yes. Thank you. Yes. Ask your question, please. Yeah. Yes, sir. There's been a lot of discussion about development of a good neighbor. Agree with the neighborhood, don't own the park or and develop there.'",
        "'speaker_10': 'Is there something you'd be amenable to?'",
        "'speaker_3': 'Absolutely. We we definitely want that with all of our tenants. And at the first meeting we presented to in the beginning of 2017, I mean, it was our hope that the greater Parkdale would really help us create a neighborhood group and take over really planning events at the park, things of that nature that.'",
        "'speaker_3': 'Permanent through the city parks department.'",
        "'speaker_10': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman new Councilman Flynn.'",
        "'speaker_3': 'And thank you, Mr. President. Christine O'Connor. I. First of all, I wanted to thank Maria Flores, Flora and Carrie to get in. Nancy Francis, who had given me a tour about a month or so ago of the sight of Christine.'",
        "'speaker_3': 'You had testified that this would that on the west, on the east side, it would be a private park. And I'm curious why you why you believe that would be a private park?'",
        "'speaker_4': 'No, I know it's going to be owned. I've heard like everybody else that it's going to be owned by DPR.'",
        "'speaker_3': 'So you feel it would be treated as a private.'",
        "'speaker_4': 'Treat it as and I have the same fears that Sandy Robinette and others have expressed that even though it is considered public. The intimidation factor of having restaurants and high end retail or maybe not high end. So the developer says we'll see.'",
        "'speaker_4': 'I'm not sure that it really is going to draw the same way, say Turtle Park draws or the park up on MLK, the block size.'",
        "'speaker_3': 'Right. So what is really confusing me is why the neighbors feel that the park on the west side would also not be a private park when it would be surrounded by? Eventually by. And is it H&M? I'm sorry, H&M.'",
        "'speaker_3': 'H&M. Yes.'",
        "'speaker_4': 'But it's not being it won't be developed. It would be developed by city money.'",
        "'speaker_3': 'Right. But on the north side is the brewpub. Yes. Which one of the folks from the resident community testified is a gentrifying factor and that would front right on the park. And in fact, the owner we have the letter offer that he made.'",
        "'speaker_3': 'His first offer was to buy it and make it a private park that he would regulate. Yes. That that would give me more concern than what I've heard here from Mr. Maxwell. And on the south side would also be a a an h m capital project.'",
        "'speaker_3': 'So it seems to me that they would be identical. So I'm wondering, I'm having a real confusion figuring out why.'",
        "'speaker_4': 'Why it matters.'",
        "'speaker_3': 'Why? You see, it seems to me that everything that was testified, the residents fear increasing gentrification, not being inviting exclusion applies to either side. And so that if we went if we killed this and kept on the.'",
        "'speaker_8': 'West Side.'",
        "'speaker_3': 'You would still have those same impacts. And tell me why you.'",
        "'speaker_4': 'See this as fundamentally different. I don't think the city explored options like going in trust for public land and other funding to do it themselves. I think Scott just landed on this because it was easy and he did, and DPR didn't do its homework right.'",
        "'speaker_4': 'I think that the fact that this developer is paying 650,000 to develop the park in and of itself indicates that he will have a say in the design. He will have a say in what happens there. He will be considering very carefully what kind of park goes in.'",
        "'speaker_4': 'It is not really a Denver public park that's been developed over the years and then got a slot, then found a land it. I think it's fundamentally different.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_4': 'You're welcome.'",
        "'speaker_0': 'Thank you. Councilman Flynn, Councilwoman Cannick.'",
        "'speaker_7': 'Thank you very much. Scott, can I follow up on the question you were asked about the community design? Because I feel like I got a slightly different answer. So when I had originally asked you and I think it was Kelly who I don't I can't see who else back there if Kelly's here.'",
        "'speaker_7': 'But about the community design, you had shared that it didn't meet some of the specs. So because the question why not just adopt the community design? And the answer was because it didn't meet the Parks and rec specs for, you know, maintenance, but you had a number of specs that you look to for how to design a'",
        "'speaker_7': 'park. So can you just help bridge for me? That feedback I had gotten with the statement that everything here is on the table.'",
        "'speaker_11': 'So you're talking about this design right here? Yes. So this design, like I said, has some great actual some great input and it has some really valuable things. We just as we build parks and I do want to mention something really quick.'",
        "'speaker_11': 'H&M Capital actually supports its design more than the design that actually the Parks staff came up with. So he actually is really supportive of moving forward with this type of design. The thing that I meant about standards and making sure that things are done and in those.'",
        "'speaker_11': 'Department standards is making sure irrigation and making sure the benches are the type of benches that are consistent throughout our park system. Just all the amenities, making sure ADA is taken in count. So all those items that as we build parks in our city, all the items that we have to take into account, we have to make'",
        "'speaker_11': 'sure that those are part of this design. So this is concept. This is really, really high level. So we have to take these concepts and actually put together the construction designs. And so that takes time. So a lot of people think we can just take a design like this and just go start building.'",
        "'speaker_11': 'It takes quite a bit of time to actually put together construction documents and get them through the city system. Because you do 30% construction design, 60%, 90%, and then 100%. So just moving through that process takes the time and then all the departments have to actually buy off on what those standards in those designs are.'",
        "'speaker_7': 'Got it. And I just I think it's specificity and really being I think this is not the time to do shorthand. And so I think that that's a pretty different answer and it's a more specific answer and it's important.'",
        "'speaker_7': 'One of the things that's occurred in this process is setting of expectations and then not meeting them or not being clear. And so to say, the spirit of this is on the table, but that there's numerous features that don't meet the city standards for potentially legitimate reasons.'",
        "'speaker_7': 'Right. It's not that the community's ideas weren't good, but I and so I just wanna make sure I'm saying this right. So. So you might not be able to have a wall here, for example, because it might prevent access for people with disabilities or it might prevent drainage from working properly.'",
        "'speaker_7': 'But so so there are features here that are not possible. And I just think we got to be really clear and I just so so if things are not possible, we got to be clear.'",
        "'speaker_11': 'And that would be that would be something that would would take place during the design process where we actually really start hammering out what's going to be in this part. Like when I look at this, I see the stage shade structure and it's a it's one of the cloth shade structures as we have done parks throughout our'",
        "'speaker_11': 'system. We have done these and we're realizing that these are really, really delicate and they're being ripped off and they're they're being destroyed. So those are the types of things that I would really want to make sure that we're doing.'",
        "'speaker_11': 'We're putting in a shade structure that actually we don't have to try to change out every year because of weather. You know, there was a talk of building a wall around the park and kind of walling it in.'",
        "'speaker_11': 'Well, we want to really make sure that the park actually has access and that you can get in and out of it. And you don't want to build walls around the park. We want to make it as open as possible.'",
        "'speaker_11': 'So just some of those items, we want to just really make sure that we're working with the community hand in hand to make sure that everybody's input is being taken. But they also understand that there's constraints and things that we have to do to make sure that the park is up to our standards.'",
        "'speaker_4': 'Got it.'",
        "'speaker_7': 'So I just wanted to clarify that record. Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_7': 'Can you clarify whether there is anything you know, there are equally sized parcels, but is there anything in particular that changes the design from the west side to the east side? Are there any constraints that would make it such that the park would have to be or would need to be designed differently if it was on one'",
        "'speaker_7': 'side or the other?'",
        "'speaker_11': 'I actually don't believe there would be any different design. They're exactly the same size. And as Councilman Flynn mentioned, both both of them are going to have developments on either side. What we were excited about, to be honest with this parcel, is that there will be eyes on the park and this is going to be immediately you're'",
        "'speaker_11': 'going to have restaurants there and people will be able to watch this space. People will be able to come to eat and their kids can play on the playground. And I've heard some other comments that we didn't have swings in our in our design or slides and we can that's simple to we can add those to the'",
        "'speaker_11': 'design. So we want to make sure that those items are in this design, the things that the community want. And if that's swings and slides and a barbecue pit, those types of things, we can do that.'",
        "'speaker_7': 'So I just want to say back to some really clear that everything there's there's the idea of all these things can be considered, but you won't fit all of them because of the size. Yes. And that the way they're done may not be the exact way the communities design them, but for for reasons you can and will'",
        "'speaker_7': 'explain in the process.'",
        "'speaker_8': 'Yes, we will.'",
        "'speaker_7': 'Okay. I guess the second line of questions I wanted to ask, I guess I'm trying to think if I want to start with the developer, the community. I'm going to offer this to like Lemon or just Sandy. But I guess I was thinking about whether or not there has been any discussion at all with the developer, not'",
        "'speaker_7': 'so much about this park, but about the ways in which businesses can be culturally competent and the way that you might train, educate, interact in ways that minimize. So I'm just curious if that dialog has occurred throughout this.'",
        "'speaker_7': 'You guys probably have had many meetings aside from the parks. I'm just curious if that conversation has begun yet.'",
        "'speaker_13': 'So that's the other part is, you know, if this land swap is approved, the other part is looking into the type of businesses that will go into the complex. And Ben and I have been talking about that. And we do want to make that a community inclusive process.'",
        "'speaker_13': 'So any time we can get that started. But Ben appears to be conscious. He did say he was not interested in chain stores and franchises. He was definitely interested in some of the historical businesses that were.'",
        "'speaker_5': 'On the block.'",
        "'speaker_13': 'Who are no longer. And then culturally sensitive type businesses.'",
        "'speaker_7': 'Great. And then just just to be really clear, what if. Did you talk at all about you know, we've had a number of companies who've had to train their staff and talk about. Right, Wendy, to Sandy's point. So beyond just who the businesses are.'",
        "'speaker_7': 'Has there been any conversation yet about cultural competency for all of the businesses? Perhaps they may be white owned, perhaps they may be Asian owned, they may be owned by someone who's maybe not an African-American business or the employees might be, you know, of different backgrounds.'",
        "'speaker_7': 'And so have you guys started that conversation?'",
        "'speaker_13': 'We will. And that's going to be part of the conversation.'",
        "'speaker_7': 'Okay, great. And so I'll just ask Ben to stand up and maybe speak for yourself on this. You know, I think that there is this concept of bi right zoning where this project started and it's a kind of like we can build it and we don't need anything from the city.'",
        "'speaker_7': 'And then the park changed the conversation, right? In the sense that there is now you're here in front of city council and you wouldn't have been otherwise. And so, you know, sometimes that comes with an acknowledgment that where you want something from the city and you've acknowledged some places it could benefit.'",
        "'speaker_7': 'It changes the conversation. So I guess for you, where have you changed or where are you willing to change? Where you go on what's quote unquote on the table with regards to the development? Yeah. Given that this is no longer just a buy right situation, you're here asking for a very important privilege, which is to to to'",
        "'speaker_7': 'incorporate public space in the middle of your development.'",
        "'speaker_3': 'Right. I think this this process has definitely been eye opening and never gone through anything similar to this. So it's been a very eye opening process. And we are open to to anything that the community comes at us with.'",
        "'speaker_3': 'We've always thought of this as we wanted to do it as part of the community. And if we didn't want to do that, if we weren't here for the right reasons, I think we would have given up on this plan a year, year and a half ago and gone a different direction and.'",
        "'speaker_3': 'Our commitment has always been to what we feel. Was that? You know, developers always talk about highest and best use. And I can't stand that term because a lot of times the highest and best just don't. They're contradictory, right.'",
        "'speaker_3': 'And to me, the best use for this block is a mixed use development with retail, office and residential. And we've been fighting the whole time to. Preserve what we think is it will benefit everybody equally throughout that and not just build what makes the most financial sense.'",
        "'speaker_3': 'So we're here. We've committed to this process. We've committed to everything about it, and we look forward to all the community engagement that we can get and really putting our best foot forward and being as transparent as possible.'",
        "'speaker_7': 'So let me ask you about another issue of equity that was raised. You and I had some conversations early on, and you were hopeful that you could incorporate some affordable housing. I was surprised to learn that the conversation had changed.'",
        "'speaker_7': 'That was not something I was told about by our department, which is a common challenge I have had from this dais recently. No fault of yours. But I want to just be and I know they're not here, so I'm not even going to ask because I know they left.'",
        "'speaker_7': 'They were here for another bill. They weren't here for this. But can you just be very clear with me? Were you told that you cannot count units as affordable on this site, or did you make a decision that the way that you would have had to do it was not possible?'",
        "'speaker_7': 'I guess I want to understand whether or not inclusion of affordability could be back on the table. Yeah. Whether it's a legal issue or it's an economic or a policy issue.'",
        "'speaker_3': 'So technically, we've already paid the permit fees and we're already through that process.'",
        "'speaker_7': 'We've already paid the linkage fee.'",
        "'speaker_3': 'Yes, I believe so. Okay. But to that process, all of our micro units actually fall under the studio affordability. Level that's required to get the points, though. But because of the square footage, there was some when we went through that process, it was brand new.'",
        "'speaker_3': 'The linkage fee had just passed. And so in on fairness to officer economic development, they were unsure of. How that was going to play out, I guess, you know, I don't know the technical terms of it. So we had to make the decision of which way we're going to move forward.'",
        "'speaker_3': 'And, you know, even though our units all technically follow all the micro apartments technically follow under the affordability, the it didn't make sense on the whole block because of the three all the three bedroom units, the office space, the retail space.'",
        "'speaker_3': 'So that's why we moved in a different direction. We do do a lot of affordable housing. We do group homes all over the city that are renting out to nonprofits. So we do do our part on that and we full heartedly believe in that.'",
        "'speaker_3': 'We've got two that are run by September. We've got a couple that are run by Catholic Charities. We purchased the building that Catholic Charities used to have their headquarters in so that they can take advantage of $1,000,000 grant and build the 100 woman homeless shelter.'",
        "'speaker_3': 'Overall for Smith Road, we closed in two weeks so that they could meet a deadline for city council to get $1,000,000 grant from you guys to do that project. So we're fully on board with affordability and just didn't the technical affordability on this one just didn't work out.'",
        "'speaker_7': 'So I just want to be really clear. If you according to the to the Army levels, it wouldn't have brought down the rents in those units. Correct. Okay. So it wouldn't have gotten to the goal that the community was asking for.'",
        "'speaker_7': 'It sounds like it wouldn't have changed the rents down to like $800 or anything like that.'",
        "'speaker_3': 'Technically, it would it would have raised the rents to be at the affordability level.'",
        "'speaker_7': 'Okay. All right. I think I think that's it, Mr. President. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each. Councilman Lopez, I'm going to skip over you to go to Councilwoman Ortega before coming back. That's right, Councilman Ortega.'",
        "'speaker_4': 'Thank you, Mr. President. Let me let me start with Scott. Scott, is there any reason that a playground could not be there? I heard there was a desire to have a playground there. There was some question about whether or not that would be supported.'",
        "'speaker_4': 'But if it's adjacent to residential.'",
        "'speaker_11': 'No, I.'",
        "'speaker_4': 'Just as a challenge a problem.'",
        "'speaker_11': 'So no, I mean, I would I would gather that this this pocket park is going to have a playground. And I just I had mentioned that what a amazing space this could be. If you could go as a family, you could go and have dinner.'",
        "'speaker_11': 'And actually, your kids are playing on the playground right there and you can watch them. You know, it's just what is going to be make up that playground. Is it going to be nature play or is it going to be traditional play?'",
        "'speaker_11': 'Or and those are the things that we have to determine what's going to go on this park. But I would gather that this space will have a playground for sure.'",
        "'speaker_4': 'So I heard your commitment to Councilman Brooks about putting together a committee to help look at design for the park. Who makes the final decision?'",
        "'speaker_11': 'The final decision on that committee or the final.'",
        "'speaker_4': 'What that is, is that ends up in that.'",
        "'speaker_11': 'Park. So what we would do is actually put together a committee. We'd get, you know, one or two community members on that. And what they would actually help us do is actually select help us go through the process of selecting a design firm, taxi design, this park.'",
        "'speaker_11': 'And that would actually get us to the construction documents that would then go out to bid two for construction.'",
        "'speaker_4': 'Okay. Let me see if I have any more for you before I go to Mr. Maxwell. So on the price, Councilman Lopez asked, how much is it normally to do one of these pocket parks? Your answer was between 750,000 and a million.'",
        "'speaker_4': 'So we have 650,000. Who fills the gap?'",
        "'speaker_11': 'We as the Parks Department, we have committed to fill in that gap. If the. It depends on what's going to go on in that park. We could do the park cheap, probably, and build a park for half a million dollars.'",
        "'speaker_11': 'Or we can build a park that truly this community deserves. And then we buy it might go to, you know, $800,000. So we as a department.'",
        "'speaker_4': 'Is there a cap on what we.'",
        "'speaker_11': 'You can't really. I mean, I would hope that we don't go over $1,000,000, but. Okay. You just don't know what the cost the final cost is going to be until you get those design documents and it goes out to bid.'",
        "'speaker_11': 'And then a company gives us the cost of what it's going to be to build that park.'",
        "'speaker_4': 'And typically, what percentage of that? Is the design.'",
        "'speaker_11': 'Design usually runs about 10%.'",
        "'speaker_4': 'Okay. All right. I have no further questions for you. So, Mr. Maxwell, if you can come up. So what is the total square footage of the development that you're looking at doing?'",
        "'speaker_3': 'Making me do math in my head. So there's about in the two mixed use buildings, there's about 30,000 square feet.'",
        "'speaker_4': 'So that's both housing as well as.'",
        "'speaker_3': 'That's the retail restaurant, micro apartments and Office. The Townhomes is probably another 30,000 or so.'",
        "'speaker_4': 'A total of about 60,000, roughly. Okay.'",
        "'speaker_3': 'Remember.'",
        "'speaker_4': 'And I just want to ask you a question about parking. I heard you say there would be parking off the alley. Yes. Yes. Will that include parking the commercial?'",
        "'speaker_3': 'Yes. So currently we have parking on the first behind the retail along the alley, as well as parking lots of inner off of the alley. And then our plan is for the immediate future for the next two or three years to turn the we on the parcel across the street to have that as excess parking as well'",
        "'speaker_3': '. So we're well in excess of the required zone.'",
        "'speaker_4': 'So is that where you turn down the building and.'",
        "'speaker_3': 'That building we did not tear down. It's a it was an operating business.'",
        "'speaker_4': 'Okay. So you've got parking available there? Yes. Okay.'",
        "'speaker_3': 'And then we would also turn the existing park land or what the Excel station into parking in a short term as well.'",
        "'speaker_4': 'Okay. And I was pleased to hear you. Your openness to the the types of businesses and working with the community around trying to have businesses that address some of the cultural sensitivity to the neighborhood and the long term history of the neighborhood.'",
        "'speaker_4': 'Um. I don't believe I have any other questions at this point in time, so. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Ortega. Councilman Lopez, you disappeared when I skipped you. Are you still in line?'",
        "'speaker_8': 'I'm sorry.'",
        "'speaker_0': 'All right. Go for it.'",
        "'speaker_8': 'I don't know why he disappeared. He's messed up. I have a question for the DiBella developer. When you. When you. We're looking at the park and. Planning on the block that you have. So you have the entire block.'",
        "'speaker_8': 'Mm hmm. From corner to corner? Correct. Why? In the middle of the development? I mean, I think I'm thinking to myself, if it's if it's an issue of and I'm not questioning your commitment to parks or anything like that.'",
        "'speaker_8': 'I do I do appreciate you come to the table, but. Usually if we wanted to have eyes on the park and I'm thinking of the the substations that we've had of Barnum, the Barnum substation, which is in Westwood.'",
        "'speaker_8': 'And then there's another substation on Colfax. And I should say Colfax. And your ears should perk up. They're both on corners. Mm hmm. Ideally, a good pocket park, if we can. If we have a choice, could be on a corner and you would have community, and then you would have, you know, folks near to follow me.'",
        "'speaker_8': 'Kind of sharing that corner and also because it's open but on one to almost on to visible sides, that's eyes on a park. That's street light. Have you thought about about doing it on a corner that way? It's a little bit more visible.'",
        "'speaker_8': 'And I think, you know, we'd be able to get away with a lot more on the corner.'",
        "'speaker_3': 'We did look at it. We kind of looked at what we thought was the ideal location for it. And really it came down to what was economically feasible for to make it so we could do the park and have successful development that actually could thrive.'",
        "'speaker_3': 'Because I think the worst thing that could happen for this community as we build a project that doesn't work, that's got too high around, it's got too much vacant space that's not full with residential and not full with commercial.'",
        "'speaker_3': 'And, you know, we wanted this to be one cohesive neighborhood. And it wasn't just a matter of the park. It's how does it all work together as one solid block? Like, how.'",
        "'speaker_8': 'Do you think you wouldn't be able to fill a rental unit in this city?'",
        "'speaker_3': 'There's a lot maybe not in this exact market, but this exact market is not going to last forever. And and we're looking at this as a 20, 30, 40 year investment. We're not looking at this to turn it and start to read.'",
        "'speaker_3': 'We're not looking at, you know, selling this off to a California buyer in the next two years after we get it done. We're looking at owning this and being a part of this community for the next 20 or 30 years.'",
        "'speaker_3': 'And we can't look at what the market is right now. We have to look at what the market can be and will be again in the future.'",
        "'speaker_0': 'Thank you. Thank you. Guzman-Lopez Councilman Flynn thanked.'",
        "'speaker_8': 'His President, his Tracie.'",
        "'speaker_3': 'McDermott here.'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Oh, I didn't see you behind Kara.'",
        "'speaker_8': 'Could you come up?'",
        "'speaker_3': 'When Mr. Maxwell came to Greater Park Hill community a year. Saying that he made some statements that are different than what he's saying tonight.'",
        "'speaker_4': 'That is correct. He stated that he got to.'",
        "'speaker_7': 'Design the park. He would name the park.'",
        "'speaker_4': 'He got to decide what events went in the park.'",
        "'speaker_3': 'And he decided.'",
        "'speaker_4': 'What? What events?'",
        "'speaker_7': 'When in the park.'",
        "'speaker_3': 'What events? And how long ago was that?'",
        "'speaker_4': 'That would have been.'",
        "'speaker_7': 'November 2017, I believe.'",
        "'speaker_3': 'November. So less than a year ago.'",
        "'speaker_4': 'Possibly. My timing may be incorrect on that.'",
        "'speaker_3': 'Okay. Thank you. Mr. Maxwell, can you tell me why you would say something like that? Absolutely. And that was November of 2016, I believe. Okay. Our initial thought in our initial conversations was Parks has no money to do a design for the park.'",
        "'speaker_3': 'Parks didn't have money for the construction. And if I said it in a manner that I came across a truly regret that because that's not at all how we met it. We just said, we will design the park, we will look at some of the options to build it.'",
        "'speaker_3': 'We did a design on it just to kind of move the process forward. But most importantly, it was just to move this process forward and get a park built. As far when we also offered that we would contribute a significant dollar amount every year to maintain the park, but it would always be the Parks Department's park at'",
        "'speaker_3': 'the time. At the January 2017 meeting with the Greater Park Halle, we definitely stated that we would permit the park if we wanted to do events like Movie Night in the Park, things of that nature. I'm sorry. Let me start.'",
        "'speaker_3': 'You would get a permit from the city. From the city that you would issue a permit? Correct. We would get a permit from the city. One of the first things we did on our website in 2017, January 2017, was put direct link to the Parks Department permitting process on our website.'",
        "'speaker_3': 'I see that. Yeah. Yeah. So, Parker, our, our intention was that we really didn't want to run the park, but we would do it until the community. Let me ask you today, on one in August of 2018, what is H.M. Capital's position on your role in designing?'",
        "'speaker_3': 'We want zero role in designing it. We want zero role and we want to pay for it. We want to see the neighborhood get what they want. And we've always wanted that. We don't want to be a part of the design committee.'",
        "'speaker_3': 'Not that we don't want to, but we we don't believe it's our place. We don't want a final say on the design. We made sure in the documents that we don't get any, you know, overreaching. We don't get any design.'",
        "'speaker_3': 'You don't oversight. You don't intend to participate. I don't pretend to participate in that. If we are not welcome to the table, if we're welcome to the table, we would happily have somebody from our team join the conversation.'",
        "'speaker_3': 'But in our opinion, this is the part that needs to be designed by the residents of the neighborhood, not by us. Okay. Thank you. Yeah, that's almost appropriate.'",
        "'speaker_0': 'Thank you. Councilman Flynn. Councilwoman.'",
        "'speaker_7': 'Thank you, Mr. President. I think one of the things we're all struggling with is the idea of how you rebuild some of the trust, particularly where this is the council vote. And so I just have a couple more questions to try to lay down.'",
        "'speaker_7': 'I think a little more clarity of what happens. Yes. So if if this swap were to pass. Yes. We've heard from Councilman Brooks that over the course of the next week, he's going to get a greater level of detail about what the Park Design Advisory Committee I might not be saying the right name, but that that group'",
        "'speaker_7': 'will look like so that before we vote on second, we see what part? Advisory design process. Little more about what it looks like on paper. So I guess I'd like to get to that same point in terms of the discussion.'",
        "'speaker_7': 'And let's start with the East Side first. You know, would you be willing to to put on paper? And I think it would be good for you to talk to some of the neighbors who've talked about the other aspects of the development to say and maybe it's a simple we've had this conversation before that you would commit'",
        "'speaker_7': 'to three meetings or three discussions about, you know, the rest of the development. So things that are not in the parks wheelhouse but are in your wheelhouse. Regarding equity particularly, I think it's important we have a divide that is somewhat it's you cannot define it even though tonight it played out with with some reason some side I'",
        "'speaker_7': 'you know I know many of us make calls to folks intentionally to get feedback. And I know I heard supporters who are African-American. And so I think it's going to be important to get to some folks who aren't here tonight as well.'",
        "'speaker_7': 'So making sure so if you could think about and for the residents, I would encourage you to reach out. But would you be willing to commit to a minimum number of discussions about that topic?'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_7': 'And then maybe give us a little detail next week, you know, or in an email or something to give us some sense of that detail.'",
        "'speaker_3': 'Yeah, I think we can do that. I mean, we've I personally have gone to pretty much every single greater part of our meeting over the past two years or so. Almost now I've publicly sat at every one of those meetings.'",
        "'speaker_3': 'Please reach out to me, here's my email, here's my phone number. And a lot of people have and I've had a lot of private one on one lunches and conversations with people on both sides of the fence. We're always willing to do that.'",
        "'speaker_3': 'And if we need to make it a formality, we're happy to.'",
        "'speaker_7': 'Yeah, I think I mean, I my request might be that it be a neutral ground because I think there's some folks who, you know, feel like it needs. So it's maybe your meeting. And if you want if the community wants a facilitator, you ask and we can help find someone that you choose or you know what I'",
        "'speaker_7': 'mean. So I think find out what folks need. And if it's three meetings and it's, you know, something neutral and and it's separate from this person. And then the other thing I want to ask about is the west side.'",
        "'speaker_7': 'Go back to the west side. I think this hasn't been a major topic tonight, but is certainly, I think is an undercurrent, which is the fact that you do on a parcel on the West Side at the end of this transaction.'",
        "'speaker_7': 'And the question about what BI Right. Zoning looks like going forward on that side of the block. So I guess I would ask what is your willingness or commitment to engage in some process on the West Side if and when that development time comes, even though you don't have to, even though there won't be a Parks Department'",
        "'speaker_7': 'and even though there may not mean maybe, who knows? As far as I know, there's unlikely to be a council vote. And I think that's where the trust gap has grown, is about what happens on the West Side.'",
        "'speaker_7': 'So. Right, so what commitments similarly can you make to some discussion process and transparency about that site so we don't end up with these same set of feelings, but no council hearing?'",
        "'speaker_3': 'Yeah, absolutely. I think we can we can outline something that would maybe work for the whole community. We're kind of going into that west side with no preconceived notions of what it's going to be over the next 2 to 3 years.'",
        "'speaker_3': 'We've kind of just committed to it's going to be a parking lot for 2 to 3 years. Our goal is that that that block can sustain more and more local retail and small these businesses. But we don't know that.'",
        "'speaker_3': 'And we've got to see kind of how it plays out on the West Side. So with that, I think we can commit to. Greater communication and transparency with the the neighborhood organization and maybe get some feedback and ideas from the neighborhood on what different folks would like to see on that side of the street.'",
        "'speaker_7': 'I just I think where you don't have enough information to do an outcome oriented good neighbor agreement, sometimes a process oriented, good neighbor agreement that says here's how we're going to meet and what we're going to talk about is at least a start.'",
        "'speaker_7': 'So thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilwoman Guzman Lopez, are you up again?'",
        "'speaker_8': 'Yeah, just one more. This may be for Councilman Herndon. Councilman, you you've been the councilman here for eight years. How high is this in terms of a priority? If if there's if this this particular site so this particular site where the park was proposed, that used to be the Excel substation, that would be 2863 Fairfax.'",
        "'speaker_8': 'It's going to take this conflation, this rounded up $790,000 to build this park. What's been the conversation that you've had with the Parks and Rec? Are they going to are they going to commit to it? Is this something that's been on your priority as a capital improvement?'",
        "'speaker_8': 'I know that they meet with those parks and RECs, meet with us usually to get guidance from us about those projects. Is this a priority for you? And if so, how, when, when, when does that look? What does that look like?'",
        "'speaker_5': 'So to make sure I hear you correctly, this parcel absolutely. It's a priority getting a park built in North Park Hill. No disrespect to the park at the corner of Martin Luther King and Quebec. I don't consider that an active park.'",
        "'speaker_5': 'North Park is the park desert. So bringing something to this is a huge priority. But as was discussed, every councilperson on this day can talk about see IP. That's capital improvement projects throughout the district that are frankly higher than this third of an acre.'",
        "'speaker_5': 'But so finding a way to build a park for the community, a community designed park is a huge priority for North Park.'",
        "'speaker_8': 'Is this project on your CIP for this year?'",
        "'speaker_5': 'Well, it will depend on how this vote goes.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Guzman-Lopez Councilman Espinosa.'",
        "'speaker_6': 'And just more of a note for clarification. The EMC two zone district only allows three building forms the drive thru services, the drive thru restaurant and the shop front form. So the shop from form is going to be sort of the maximum density version of development.'",
        "'speaker_6': 'And it's for it's one of our most sort of more restrictive based zoning as far as what that form looks like and how it addresses the street. So it's sort of safe to say that unless it's a drive through form the formally, they're going to essentially relate to each other.'",
        "'speaker_6': 'Whatever gets whatever the uses on either side, physically, they're going to manifest themselves the same way. Okay, thanks.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Seeing no other questions. The public hearing for Constable 855 is closed. Comments by members of Council. Councilman.'",
        "'speaker_5': 'Thank you, Mr. President. So first I want to I want to give some thanks and one I want to give thanks to the community. Whether you are first time here or many times here or part of the Reno, not part of the R.A. live next door living.'",
        "'speaker_5': 'Lowry, I appreciate you all coming out and sharing how your your opinions about this. You probably learned a little bit more about alley vacations than you thought you were going to before this started. But I want to say that because we we hear you, because when this process started two years ago, there was not a lot of'",
        "'speaker_5': 'concerns about it. And then right around the middle of 2017, because I was at that great a Park Hill meeting where there were some serious concerns and frustrations. And I held a community in October, and you came to that.'",
        "'speaker_5': 'And then Parks said, Stop. We are going to pull back and we're going to say, what does a community design park look like? So I want to thank the community for that, because you made that happen. So no matter which side of Fairfax this is going to go, this is going to be a park designed by the'",
        "'speaker_5': 'community. And so I want to applaud you for that, making sure that you're going to have a say in the design of the park. And the next group I want to thank is Parks. And, you know, Scott, I applaud you for standing up here and taking the brunt.'",
        "'speaker_5': 'But you were part of the team that said, you know what, we're not comfortable with how this is gone. So we're going to stop and rewind. And you can we can certainly look back and say, you should have done this differently.'",
        "'speaker_5': 'You should have done it better. But it takes something to say, you know what, we did this wrong, that we're going to stop and make sure that this is a community design process. And you did that and you stood in front and said that this will be a community park designated because the Greater Park Hill and their'",
        "'speaker_5': 'original piece back in November said it needs to be designated a park. That is going to happen and it's going to be a park with community members at the table. So it's not going to be a plaza. Because it's gonna be designed by the community.'",
        "'speaker_5': 'And I don't think there's a community member in this diocese and the chambers that are going to allow a plaza to be built when they're at the table. So it's going to be a park. So I applaud Parks and Rec for doing that.'",
        "'speaker_5': 'I also want to applaud Ben and H him gavel because he could have easily said, I'm not going to do this. And by him and I actually believe because you lived in Park Hill, so you understand this community.'",
        "'speaker_5': 'You're not a developer that's just coming in and trying to maximize and leave. As you said, highest and best is not always best for the community. I think you have demonstrated that you are here at the table and willing to meet because you came to grade a Park Hill.'",
        "'speaker_5': 'You've come to my community meetings, you've come to the meetings that Steve Charbonneau and I forgot to tell to my colleagues. Steve Charbonneau facilitated my meeting as well as the ones for Parks and Rec. You have been all of that and you've committed right here that you're going to work with the community when it comes to who'",
        "'speaker_5': 'who is at the table when it comes to ensuring that this park will be inclusive for everybody. That's part of it is your role. The other part is our role because this park's not going to be built tomorrow.'",
        "'speaker_5': 'So as a community, you have a commitment from your council person, what can we do to make sure that that is an inclusive park? And so my offer to Greater Park Hill or to any other community members, let's have that conversation because the weather is on the west or the east side.'",
        "'speaker_5': 'We need to have a conversation about gentrification. We need to have a conversation about some of the ills that are going through residents short and long term in this community that this council is working on diligently to try to mitigate.'",
        "'speaker_5': 'And we are doing that in several different facets. But let's have that community conversation about that. So those are my thanks for all the people that have been a part of this. I support the park on the east side and I'm going to focus strictly on the park because this is what the question is.'",
        "'speaker_5': 'You're going to get a community design park east or west. You're going to get a community design park, east or west that will be flanked by commercial, whether it be a beer garden to the north or a restaurant to the north and in commercial to the south.'",
        "'speaker_5': 'So that's not going to change. So what are some differences between the two? We have the ability to build the park, community design park faster because we have a we have demonstrated there is not a use of excuse me, a funding source on the West Side.'",
        "'speaker_5': 'So we can build a community design park designed by the community for the community. For a community that lacks park acreage. Just does. So let's do that as best as we can for the community. So I applaud all the areas, the the people that I've been a part of this.'",
        "'speaker_5': 'Let's continue to move forward. Let's continue to have these conversations, because if it's west or east there, as Councilman Flynn, I applaud him for pointing this out. There should be the same concerns when it comes to inclusivity. So let's start to have those conversations to make sure that that will happen.'",
        "'speaker_5': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Councilman Espinosa.'",
        "'speaker_6': 'Yeah. So you probably saw me up here sort of furiously writing things and stuff like that. I don't have my underwear in as big of a bunch as I did earlier. And throughout this whole process, I always thought this was a three story development entitlement.'",
        "'speaker_6': 'And it's not. It's a two story which really changes the math for me. That said, it is not. I don't blame the developer any more than I blame Target for asking for $4 million for the mall developer asking for this transaction.'",
        "'speaker_6': 'But I do appreciate the willingness to sort of help with these other conversations and dialog and be present, you know, because those aren't your those aren't your burdens to bear. But it is helpful when when when developers engage the community in that way, because those are burdens that are in communities.'",
        "'speaker_6': 'So, you know, unfortunately, he left, but there were a lot of great comments. But I just wanted to tell Eric Pena when he was here or PEN that his comments in particular really resonated with me. But they sort of speak to all those things as well.'",
        "'speaker_6': 'But the so is not lost. I mean, the thing the basic premise is the money could have been given to the city to develop a park on our city owned lands, but that is not directly beneficial to the developer.'",
        "'speaker_6': 'So that resolution, which would have resolved all of this debate, was never offered. And so that tells you something about. What is the you know, what is the value? There's a number here and we settled on on 650.'",
        "'speaker_6': 'Even though the you know, Scott said the park the park that size is 750000 to $1 million. So what that means is. No. Despite what I heard tonight, the developer is not going to build this park. The city is going to build this park, but the developer is contributing significantly towards that end.'",
        "'speaker_6': 'But they could have. And that's what I'm going to get at. So what we have on both sides of the street is a rectangle, 125 by 125. I mean, a square. Sorry. 125 by 125 feet. City owns one.'",
        "'speaker_6': 'Developer owns the other. If a developer wanted to create a small open space and I don't know if this is totally kosher with the market, too, and he wanted to do a quarter of that lot. That that quarter is roughly 9900 square feet.'",
        "'speaker_6': 'Double that for two stories is 7813 square feet. And let's use the split. The difference between 325 and $350 a square foot go, 337. That's 2,000,635 that and $32,981 of of development potential that sits in that little quadrant that wouldn't be realized if an open space was provided within the development.'",
        "'speaker_6': 'So what instead we're doing is we're going to, you know, within that development. So let's put it in the block. Right. Sorry. But instead, what we're doing is we're giving you land to put that size of open space, internal to that development, and then that entirety is developable across the street.'",
        "'speaker_6': 'There's real money there. So while I always welcome the idea that, you know, that there was a win win in a deal to be made here, the city needs to drive a hard bargain and not just give a bargain.'",
        "'speaker_6': 'We basically transferred the $50,000 deal that we got from Excel and pass that savings on to the developer. Who is now poised on that development that just that will report me on that portion, too, to make one mean $2 or more for every dollar that is being given to the city in this transaction.'",
        "'speaker_6': 'That's what I mean by there was more latitude, there was more money, a harder bargain to drive to actually maybe capture the full $754 million. Much was being made as this being a gift. And it is. But it's for the developer without more financial equity and a good neighbor agreement.'",
        "'speaker_6': 'Without financial equity and good neighbor agreements, our obligations to to protect the surrounding residential or some meager affordable housing units included. You know, we brokered this deal. Sadly, these are the failings of the administration. They're the ones negotiating.'",
        "'speaker_6': 'This council does not negotiate this. This is this is the agencies that are in this. You know, they're the ones presenting they're the ones having this conversation on your behalf. Both sides. That's your tax dollars being squandered or being or being bolstered, however you choose.'",
        "'speaker_6': 'But if you look and you observe history shows in this city, the disproportionately advantage advantage disproportionately the advantage goes to the developer. And this is no different. Again. I do not blame the developer for asking. I blame our negotiators for not challenging or pushing harder.'",
        "'speaker_6': 'So what I'm saying is this is not the deal. I would negotiate. But it is one. Sadly, too soon that I can approve. Because this project will end. But but let's not. And actually, that's not mince words here.'",
        "'speaker_6': 'This project will expedite gentrification in this neighborhood. With or without the park. So this park has nothing to do with other forces that are going on there. That's why we should have had those negotiations, should have been part of the conversation.'",
        "'speaker_6': 'If we're not going for full dollar value. What else can we capture? What other hard commitments that could have been made as part of that agreement and not basically bantered about among council members who are struggling with the fact that, yeah, this is a ginormous giveaway and these are tough conversations that the city should have been having'",
        "'speaker_6': 'because you guys are having them with us. But all we're doing is approving something. We're not negotiating it. And we could push back. But we're also not privy to these steps along the way. It's executive privilege. So again, if this if I had if it if I were in the room, we'd be we'd be having a different'",
        "'speaker_6': 'conversation. And you can tell what some of that would be. But our role is sort of perfunctory at this point. Is this is this about is this a worthwhile, valid deal? Is it kosher and all sort of legal context?'",
        "'speaker_6': 'Yes. And now I worry. Because there is benefit here. So I don't I'm not interested in in throwing in scrapping everything that has been done and all the efforts that have been made. But man. My message to the administration is you need to drive a hard bargain.'",
        "'speaker_6': 'There's people, businesses being displaced. With no place, no option to stay. And so I you know, I will be supporting this. But this is a tough deal in my book because the math. Again worked out really incredibly in the developer's favor at three stories, but that's not what we're dealing with, two stories.'",
        "'speaker_6': 'So it's actually far more closer to what it should be numbers wise. But it is still an imbalance. And until. But in my questions to the administration about what sort of appraisals were done, what sort of analysis was done to calculate the real value to the developer.'",
        "'speaker_6': 'We're Neal. When I asked for a response on that. And so this was what was offered. It seemed like a good idea because it builds most of the park. But actually, I think we could have gotten all of the park or we could have gotten that commitment much earlier about what level of community involvement there would be'",
        "'speaker_6': '. We could have advanced maybe the design of that park. So it was already sort of concurrently being built, I mean, being conceptualized, and that would actually benefit the developer because they could consider they could factor in some of the underground, some of the needs of that site, and maybe there would be some concessions by the city at'",
        "'speaker_6': 'that point. That, you know, in lieu of of all those dollars, build some of this infrastructure because you're going to double down. I mean, you're already doing the work in the adjacent area. But again, that's not this this council's responsibility.'",
        "'speaker_6': 'The administration. And I'm willing to bet some of that's going to occur. I hope is because it's there's only some more win wins to occur here. So I've gone on long enough. I think you all understand where I stand.'",
        "'speaker_6': 'I will be supporting it. But it's it. I just wish we'd gotten more from the get go. Thanks.'",
        "'speaker_0': 'Thank. Councilman Espinosa. Councilman Cashman.'",
        "'speaker_5': 'Thank you, Mr. President. I share my colleague's concern about whether or not it was a great deal. I'm not as deep into the numbers as he is. I just see that Mr. Maxwell had a partial worth. A million and a half were trading him another partial worth.'",
        "'speaker_5': 'A million and a half. He's given us $650,000. He's going to get a park worth somewhere between that and a million bucks. So that that's that reality. I'm my main thoughts are along the lines of some of the things that Councilman Kenny shared.'",
        "'speaker_5': 'I think the issue of the design of the park is going to get shuttled to the neighborhood satisfaction. That's what I think. I don't know that I'm I'm waiting next week to hear more specifics about how that process is going to unfold.'",
        "'speaker_5': 'But the thing that really does concern me is that we take enough time to look at the other issues, the cultural issues that that have been talked about at length. And I don't know that that gets done in a week or two weeks.'",
        "'speaker_5': 'We've lost a year that that discussion should have been unfolding in a more comprehensive manner. So I'm really be looking at how that's pronounced. If this moves forward, you know, it's just. As the expression goes, it's not fully baked.'",
        "'speaker_5': 'You know, for me at this point, the park is not an issue for me. With due respect to the neighbors, the side of the street is is not an issue. It's it's the process that's concerning. And I get how that process gets shortchanged.'",
        "'speaker_5': 'I believe, Mr. Gilmore 100%. He saw an opportunity to build a park quickly, and he and he jumped at it. And I've done similar things in my life. And all of a sudden you realize, wait a minute, there's this other stuff that I should be considering.'",
        "'speaker_5': 'And while I understand it, one of one of the critical problems we face, and I think it was maybe Councilman Brooks that talked about the issue of the trust. We're fighting in everything we do here, trying to regain the trust of the public in their government.'",
        "'speaker_5': 'And so we need to really be extra attentive to holding public engagement as the highest value so that that's in the top of our mind as we approach whatever we're doing here in the city. So. Yeah. That's why I've got to say thank you.'",
        "'speaker_0': 'Then you get some. Cashman kills me. Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. Hmm. You know, I. First of all, you know, I wanted to. Coming from somebody who has fought for as much park acreage as possible in a. Parks starved. District in Denver. And being able to.'",
        "'speaker_8': 'To turn that around, being able to create parks where nobody thought there were parks and to build parks where we had every advantage an opportunity to do so. I could tell you that that that for as much as Mr. Gilmore is trying to put a lot of stuff on himself, we couldn't have done that without.'",
        "'speaker_8': 'An aggressive. At least an aggressive mission to go and find park space wherever possible, especially in areas of town. That are. That are struggling and especially in areas of town that don't have access to park space. And so I know that the intent there is to to.'",
        "'speaker_8': 'To try to acquire Parkland as much as possible. And there was a part there was a time in this city where this administration did not like pocket parks and they were never interested in pocket parks. Now. That's the only opportunity we have.'",
        "'speaker_8': 'It. It doesn't. I don't feel as confident. And this is not on and any kind of personal attack. I don't feel as confident. And we have to ask that we're accomplishing those mission, that mission when we have to ask developers to do it for us.'",
        "'speaker_8': 'I mean, I really appreciate you coming to the table. And I appreciate the offer. But we have to be in a city. We have to have the priorities straight in this city with our budget to give parks. The opportunity to have the upper hand.'",
        "'speaker_8': 'And so we're not as a city behind the eight ball. Whenever somebody comes to us with some money to be able to say, hey, okay. We should have our own fund dedicated to be able to guide our principles.'",
        "'speaker_8': 'And that's a budget issue. And that is going to be on the ballot as well. Right. Whether or not as a citizenry, as a city does, is that a value that we have a healthy budget to be able to do this, not just for parks but for our infrastructure?'",
        "'speaker_8': 'Right. So I don't want to wage a war on our philosophy of parks or. On on the economy in our city and take it out on one side of the street or the other. Right. There is a part that's going to happen.'",
        "'speaker_8': 'It's going to be built on this street. And I do understand I do understand what folks are saying at the microphone. Folks have said, hey, we're tired of people calling the cops on us because we we have Spanish music because that happens to us.'",
        "'speaker_8': 'Right. We're tired of people watching our every move in our parks and they don't let us be because maybe it's because of the color of my skin. Maybe it's because the music I'm playing, maybe it's because the carne asada that's on the grill.'",
        "'speaker_8': 'I get that. I understand that. And for folks who are living in this neighborhood. And want to see this part happen and don't understand it and take an opportunity to understand that. People in this country are being the cops are being called on us, especially Latinos, especially African-Americans, just because we are who we are.'",
        "'speaker_8': 'We could be chillin in a park and that happens. Those are real stories. I don't question those stories because I know that happens. However. In my experience with Parkes part. And also the other thing I want to address and what I heard at the microphone and I get that there are some safety issues.'",
        "'speaker_8': 'In every neighborhood, we have issues where somebody's peddling some dope or there's some fights. I get that. That happens in my neighborhood, too. That happens in our parks. You had parks where that's been the case. Just because there's a park in your neighborhood does not mean safety is gone.'",
        "'speaker_8': 'All of a sudden, you're going to achieve safety. You achieve safety when people want to be in the park, you achieve safety when people want to be there and they want to have music and they want to be able to have a good time and they want to have their quinceaneras and they want to take pictures for'",
        "'speaker_8': 'prom and all that. That's that's when you achieve when you activate a park, that's when you achieve it. So it's not necessarily that we have space for a park and we have Parkland, but it's how we're going to program the park.'",
        "'speaker_8': 'What are we going to have in it? If all you have is a pretty little fountain and some trees and some ducks, that's not going to make an active park if you're going to have swings. A gazebo for families to have birthday parties.'",
        "'speaker_8': 'Right. That's what's going to have. That's that. That's activating a park. So I can tell you by looking at the zoning and by looking at the uses. It really is not going to make a difference in one. I'm seeing that it's not really going to make a difference on one side or the other if they're just both'",
        "'speaker_8': 'flanked right there in the middle of a main street zone district. In a matter of years, it may look like a mirror image of the other side. And we've had all this argument and fighting for nothing unless. You come to the table?'",
        "'speaker_8': 'You all come to the table, recognize that this is the dynamic in this neighborhood. What was said in these council chambers and try to be able to create a park for everybody. Right. And then also be aware of those social aspects of this.'",
        "'speaker_8': 'This is definitely these chambers are definitely the chambers that should be hearing stories about how the impact of gentrification in our city. Absolutely. We should be talking about that here. We should be talking about, you know, the undertones and undertones of racism in our city.'",
        "'speaker_8': 'Absolutely. These aren't issues that we're not just pulling some card up. Nobody give me a race card. We're not just pulling it out and using it wherever it's happening. And we have to address it. And that means every single one of us and everything we do, even in parks.'",
        "'speaker_8': 'And so I think that's that's the. I wanted to address that. But I also wanted to ask and this is my ask a Parks and Rec. Because of its location, because of the perception. Whatever the sign, whoever whatever this park is called, it should say public park.'",
        "'speaker_8': 'So that there is no question whether this park is part of your development or part of the community. So there is no confusion whatsoever. If it's. I don't know. Barack Obama public park. It could be Mickey Mouse, Public Park.'",
        "'speaker_8': 'But however. However you name it. Name it. Public. So that people understand that they belong there, that that's their part. I have already kind of expressed what I've. My suggestion would be it would be to put it on a corner so people can see it.'",
        "'speaker_8': 'So you can access it from from two sides, not just one. Right. And that's all design on your end. That's all up to you. But I definitely understand the angst. I understand the anxiety. But from somebody on the West Side who has made it my.'",
        "'speaker_8': 'Oh. My everything to try to. Create parks that reflect who we are. That's it. Don't walk away. Be part of it, demand to be at that table and make sure that that park reflects. Park North Park Hill. For every single all every ounce of every molecule.'",
        "'speaker_8': 'Glory and culture it is right. So I with that it's I'm I'm going to support it only because I you know, for for those reasons. But yeah.'",
        "'speaker_0': 'They. Thank you, Councilman Lopez. Councilman Brooks.'",
        "'speaker_6': 'Hey, thank you, Mr. President. And thank you for everybody who stayed around to nearly 10:00 to talk about a park in the neighborhood. But we're not just talking about a park. We're talking about something so much more. So thank you.'",
        "'speaker_6': 'For those of you who drove paying for parking. Those of you who all came in here going through security and sitting in those hard seats, really appreciate your passion for this city. And I think that's incredibly important. And if your passion dies tonight, depending on the vote, that's unfortunate because there's a lot a lot of stuff going'",
        "'speaker_6': 'on in the neighborhood. I, I used to represent this neighborhood, and I'm in this on this street every week at House of Hair. Anybody know Pope? Mr. Pope is in there. So he has been and I've been hearing this about this deal for a year and a half.'",
        "'speaker_6': 'But let me just say something. So MLK first neighborhood that he came to when he came to the city of Denver was Park Hill. In Park Hills, a historic neighborhood of always trying to figure out the issues around race and equity issues and equality, equity, understanding that folks are starting from a bias, understanding that folks are starting'",
        "'speaker_6': 'from a disadvantage in the community in Park Hill has always been historic for having white allies who support that. And it's a powerful neighborhood. I got to say tonight and it's because it's not my district. And I just got a chance to sit back and listen to everybody tonight.'",
        "'speaker_6': 'I'm just sad because I know who are friends in here and I see you all on opposite sides. And and that's not the vision of our neighborhood. And even though. We have different opinions of what this is. We should never let this come to the point of dividing our friendships in our community, in our neighborhood.'",
        "'speaker_6': 'We will not allow what's going on federally to affect us on our street corner. This this country is more divided than it's ever been. We're not going to let a park. We're not going to let gentrification. We're not going to let any of that stuff divide us.'",
        "'speaker_6': 'And so I just think it's important for me to say that at the outset, because that is at the crux of every conversation that I have and it's at the crux of this this issue here. So, you know, I really appreciate the conversation.'",
        "'speaker_6': 'Obviously, you know, the development issue I was in the barbershop, I heard that it was six stories redevelopment coming next door all the way from folks who have been on the block for 40 years and was excited to see some change.'",
        "'speaker_6': 'And so there's some great debate and great arguments going on. But as the facts begin to come out, you know, folks started to really talk about what they wanted to see, what they wanted to see in the park, who they wanted to see coming outside of those apartments, who they want to see coming outside the restaurants.'",
        "'speaker_6': 'And it's an inclusive community. I think the anger that people have been hearing, especially in African-American communities, that feeling like they're losing a sense of community. So I think. You know, I appreciate Scott really talking about some of the missteps.'",
        "'speaker_6': 'The process was not right. And I appreciate you starting it over. Scott and and Scott. Like I said, we've worked on many of issues and continue to work on issues. And I really believe that our parks can be that great equalizer in our community.'",
        "'speaker_6': 'And parks is not the number one issue in this community. I think everybody see in that there's some undergirding issues that are going on. There's a school called Stedman and Hallett that are struggling right now, struggling about to close.'",
        "'speaker_6': 'Right. Like struggling. And so there's some big issues in our community. And I think it's important when we come to the conversation with these issues, is that we start talking about them, we start discussing them. You know, for me to support this, I was very I'm very clear.'",
        "'speaker_8': 'That.'",
        "'speaker_6': 'I want a detailed list of the process. Gordon We've worked on a hundred processes together. You've been inclusive for people to feel like they haven't been included. It troubles me. So a very detailed list of participants and what the process will look like by next week when we vote on this for full up.'",
        "'speaker_6': 'Been there is ready radio Radian Development actually connects people with folks small businesses who have been pushed out of the neighborhood. I'm going to give you that contact this radian. I'm going to give you that contact this week.'",
        "'speaker_6': 'And the person you should sit down with is is Marcus Pope, who is in the neighborhood, who because I just don't want to talk about the small business inclusion. I really want to be give you tools to say this is how we include small businesses, especially folks who've been pushed out.'",
        "'speaker_8': 'Of the community.'",
        "'speaker_6': 'You know, as I look at the.'",
        "'speaker_8': 'The the the swap.'",
        "'speaker_6': 'I don't even want to call it a swap because it makes it sounds really bad. As I look at the transaction here, dealing with a park. I'm going to say it again, there's huge trust issues and we need to make things as transparent as possible.'",
        "'speaker_6': 'And I think that the city of Denver, when we when we interact with these transactions, we have to have an open and transparent process with the community so that they know and I've talked to all of you all in Parks Department, I've talked to you in real estate so that they know there is nothing going on behind'",
        "'speaker_6': 'closed doors, that this is for the benefit of the community. And I know that I've talked in detail. I've talked about some of the issues, but the community doesn't feel that way. So we have a lot of work to do.'",
        "'speaker_6': 'But moving forward, I want to see those things to be completely supportive.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_4': 'Thank you, Mr. President. So these are neighborhoods. These these are conversations that we're having in neighborhoods all across the city. It's not unique to your neighborhood. We've been having these conversations for, you know, the last eight years that I've been back here as we've been dealing with the I-70 project around some of the the inequities that are'",
        "'speaker_4': 'happening to those communities. Interestingly, the city is beginning to have internal conversations about race inequity. That is occurring. It's happening with our Denver Wright process, which is very important because that's going to set the stage for our city moving forward for the next 20, 25 years.'",
        "'speaker_4': 'It's been at least that long since we revisited that blueprint document. And I think these are conversations we need to have on the front end of these projects, not on the back end, so that we address the concerns and the impact to communities on the front end and not wait until, you know, folks have been displaced and'",
        "'speaker_4': 'they can no longer even have a voice at that table because they can't even afford to stay in some of our neighborhoods. And I know this was all about a park and and where that park should be. And I appreciate the input that we have received in my office phone calls, emails from folks on all sides of'",
        "'speaker_4': 'this issue. I appreciate you all sitting through a long night and, you know, listening to the previous conversations that we've had here about other issues. But this has been very enlightening for me to see Mr. Maxwell's commitment to trying to work through this all and sincerely appreciate your your willingness to not not only.'",
        "'speaker_4': 'You know, step back from the design and put money at the table, but really willing to roll up your sleeves and focus on some of these other social issues that have been the undercurrent of this entire conversation. And I'm pleased that Parks and Recreation is making a commitment to fund the gap, even though this is not a'",
        "'speaker_4': 'priority in Mississippi. You heard the question about if. If this doesn't happen, what happens to the park and the commitment to have a park on this block? Well, the money wouldn't be there, but we're going to find the money to complete this park at this location, because we have a $650,000, you know, contribution towards it.'",
        "'speaker_4': 'So, you know, I just based on what I had heard and seen, I sat through one community meeting in the neighborhood. I was leaning towards opposing this. But really having heard tonight's conversation, I am going to support this tonight just because I think this is a genuine opportunity to try to heal the wounds that have been caused'",
        "'speaker_4': 'as a result of of what what has been a divide. And I know there are people in this neighborhood who have worked together on so many other issues and to be kind of split off over this one issue.'",
        "'speaker_4': 'Hopefully, this this I'm not sure what's happening to the wall because something is falling off the wall anyway. I think this really is that opportunity to bring people back together and appreciate Parks and Rick's, you know, commitment to make sure that this is what the community wants in terms of the park that will be there.'",
        "'speaker_4': 'And so I will be supporting this tonight. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Cashman, you back up?'",
        "'speaker_5': 'Yeah. I just want to add one more thing. Just so I could take up a few minutes of everybody's time and enjoy those lovely benches. I just. Councilman Flynn mentioned it early on. I it's it's unacceptable that on an issue this important that's been on top of people's minds for so long, that we have to vote on'",
        "'speaker_5': 'an exception to the rules because we don't have the contract til late on Friday. So and I'm also disappointed that, again, an issue that's been this president on everybody's mind that we don't have a representative from from community planning and development to answer basic questions.'",
        "'speaker_5': 'I appreciate my the input from my colleague, Councilman Espinoza, but we've got a neighbors here late and a whole lot of other people here late. And I think the administration could have done a better job in being prepared to bring this forward.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Seeing nobody else in line for comments. I'll just close with this. I want to say thank you to everyone for coming out here, for sitting here, for taking time to add your voice to the conversation.'",
        "'speaker_0': 'What I'm hearing tonight in here is the same thing that I hear every day in my district. There's so much change, so much that we feel we can't control happening in our city and in our country, that when something comes up where there is a chance to weigh in, we start having all of these really important conversations'",
        "'speaker_0': ', even when they're not directly related to the thing that we get to vote on, because we are all as a city, so hungry for that conversation and for solutions to the problems that we're talking about. And they're really important conversations.'",
        "'speaker_0': 'And we have to find ways as a community to find more ways and better ways to have those conversations and find ways to take back some of that power and control. But looking at what we're voting on tonight.'",
        "'speaker_0': 'For me, this is about a park on the same block that has the same zoning flanking it on both sides. And none of you know nothing about our vote is going to change those things. So do we want one with $0 or do we want one with $650,000?'",
        "'speaker_0': 'And that's what we're tasked with voting. I know, Scott. I know, Gordon. I was in the trenches fighting with these guys for parks that we had no money for before I was on this council and in my former life.'",
        "'speaker_0': 'And I know that both of them are extremely passionate about this community and extremely passionate about delivering a great park for every neighborhood and for every person. I appreciate Scott stepping up in front of everybody and saying that he may have made some missteps along the way in the process.'",
        "'speaker_0': 'And I know because I know, Scott, that it wasn't because there was something else going on in the background or there was some backroom deal. But it's because he's so passionate about finding ways to deliver on these parks and on a park for everyone, that when he sees something that's a possibility, he jumps all over it.'",
        "'speaker_0': 'And that's because we have a huge funding issue. As Councilman Lopez mentioned, we don't have the money to build these parks, to deliver these parks. We have parcels sitting right now, today in my district that have sat vacant, waiting for funding for decades.'",
        "'speaker_0': 'And there's no one offering $650,000 to build that park across the street or even a dollar. To do that, we need to fund our parks so that we don't have to. Scramble all over trying to deliver a park for a community that needs one.'",
        "'speaker_0': 'And we need to have the money to do right by every neighborhood and every kid and every person in the city. Right now, we don't have that. And so, again, it brings us back to what are we voting on tonight?'",
        "'speaker_0': 'Do we want to park on this block and $650,000 to build it? Or do we want a vacant parcel on this block with no money to build it like I have so many of in my district right now?'",
        "'speaker_0': 'So tonight, my vote is for a park with $650,000 to build it. With that, Madam Secretary.'",
        "'speaker_2': 'Raquel Herndon.'",
        "'speaker_8': 'I.'",
        "'speaker_2': 'Question. Can each by Lopez.'",
        "'speaker_8': 'I.'",
        "'speaker_2': 'Knew Ortega I.'",
        "'speaker_4': 'Susman Black.'",
        "'speaker_6': 'Brooks I.'",
        "'speaker_2': 'Espinosa, I.'",
        "'speaker_8': 'Flynn, I.'",
        "'speaker_2': 'Gilmore Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting announce results to advice. One Abstention 12 eyes, one abstention. Council 855 has been ordered published Monday, August 27th will be second reading or final consideration of Council Bill 855. Uh, Maggie Bolden, I know you're watching on Channel eight right now.'"
    ]
}