{
    "Proclamation honoring Larry Ambrose.": [
        "'speaker_0': 'And thank you both for for your sacrifices and commitment to the Mile High City as well. Thank you both very much. Thank you. What a wonderful proclamation. So honored to recognize a life worth of commitment to our city and our residents.'",
        "'speaker_0': 'And we're going to go ahead and continue with that theme. Councilmembers Cashman, Ortega and Torres, would you please read Proclamation 20 2-0218, please.'",
        "'speaker_3': 'Thank you, Madam President. Proclamation number 22, Dash 0218. Whereas Larry was born in Pueblo, Colorado, to Aubree and Harriet Ambrose in 1945, Aubrey owned two businesses an Army, Army, Navy surplus store and a shoe store. And whereas, Larry graduated from Pueblo Central High, attended CU Boulder as a marketing major, and attended UCLA obtaining a business and arts'",
        "'speaker_3': 'degree in 1968, being the first person in the country to get a degree in arts administration. And. Whereas, Larry began his career as an impresario of the arts at the age of nine, promoting the fledgling piano talents of his friend Fred Winger in a local talent contest.'",
        "'speaker_3': 'Fred went on to become a noted pianist. He later mangled a number of managed forgive me, managed a number of bands, including Ashgrove Club, LA's number one place for life music and managed a band. Musicians originally from San Francisco living in a commune in Walsenburg and recognized the remarkable talent of a new friend.'",
        "'speaker_3': 'He had made a Denver woman who had never performed in public but had a great voice. He urged her to sit in at one of his band rehearsals and give it a try. The audition didn't go particularly well, but Larry urged her not to give up.'",
        "'speaker_3': 'That young woman. Laney Garrett, has become one of Denver's truly legendary entertainers, largely due to Larry's early encouragement. And. WHEREAS, Larry met Jane Parker in 1972 when she showed up at the Rio Grande Saloon on Santa Fe Drive looking for good, funky music.'",
        "'speaker_3': 'She worked for the Denver Symphony. Jane ran into Larry again at a bar in Colorado and Evans four years later where his band was playing. And she said she remembered his eyes. Larry called her the next day to ask her out to listen to music.'",
        "'speaker_3': 'And whereas Jane and Larry started seeing each other regularly and she moved into his house and became a part of the commune, she told Larry she wanted to get married and he said, okay. They eloped to Reno, Nevada, along with their friends, Judy and Jack Ratelle, who also tied the knot.'",
        "'speaker_3': 'The Ambrose's traveled to Europe and Mexico and skiing and loved kite flying. Their home was always filled with friends, food, joy and love. Just like his family home in Pueblo. And. Whereas, from 1996 to 2014, Larry commuted back and forth to Pueblo to take care of his mother and to manage the family business.'",
        "'speaker_3': 'While there, he was hired as the manager of the Pueblo Convention Center and turned it into a vibrant place with concerts and artists while still managing the family business. And.'",
        "'speaker_8': 'Whereas, at the age of 59, Larry went to law school, earning a J.D., but was too busy with multiple jobs to study to pass the bar. And. Whereas, Larry was involved in the formation and advocacy of Denver neighborhood groups since 1973, when he and Jane started one of Denver's first Reno's Northwest neighbors.'",
        "'speaker_8': 'And. Whereas, in early 1980s, Larry and Frank Quintana, former DFT captain, co-founded the Jefferson Highland Sunnyside Neighborhood Association. He and Jane helped pioneer the low Hyde business district on 15th Street, where they both had businesses in 2004 and were founding members of Sloan's Lake Neighborhood Association.'",
        "'speaker_8': 'Where Larry served as vice president until his passing. And. Whereas, as community relations director of the Eraring campus, he wrote the policies on community use of space and more notably saved the Golda meir house from the wrecking ball when it was moved to the Ninth Street Historic District in 1988, where it was restored and named to the'",
        "'speaker_8': 'National Register of Historic Places. And. Whereas, Larry was a member of the Plant Area Reclamation Committee, where he advocated for a major city park in the Central Platte Valley and was subsequently subsequently appointed by Mayor McNichols as the neighborhood representative to the Central Valley Planning Committee.'",
        "'speaker_8': 'And. Whereas, Larry and Gertie Grant co-chaired a citywide building height control initiative that was on the ballot in 1985, he was a leader in saving historic buildings in the Highlands, in getting power lines buried in Highland Square business district.'",
        "'speaker_8': 'He worked with Councilman Sal Carpio in creating the Viking Park entryway into northwest Denver and establishing Denver's system of dog parks.'",
        "'speaker_7': 'And. WHEREAS, Larry served on numerous city planning committees and task force groups, he served on the Iron Board for nine years as secretary, vice president and president. He initiated the creation of Iron Sea's website, logo and branding. He established a record of activism and advocacy through Iron Sea resolutions to Denver City government officials and initiated at the'",
        "'speaker_7': 'behest of Kathleen Wells, the creation of platforms for agencies committees, starting with parks. He formed the I.N.S. Parks Designation Committee and appointed his first members. He initiated the silent auction ad agency annual awards dinners and with help from Jane Lorimer, taking the dinners to a new level of success.'",
        "'speaker_7': 'Larry, Larry Held Taking the dinners to a new level of success. Larry Held executive committee retreats for the first time. That included building agency's current mission statement to advocate for Denver citizens by bringing together, informing and empowering Denver neighborhood organizations to actively engage in addressing city issues.'",
        "'speaker_7': 'In 2021, IAC gave Larry the Lifetime Achievement Achievement Award for his work in Denver communities. And. WHEREAS, Larry recently served as executive director for the Southwest Improvement Council even through the time he was sick. Swix purpose is to improve living conditions for its residents through civic engagement, health and human service programs and affordable housing.'",
        "'speaker_7': 'And. Whereas, Larry enjoyed a life well lived with music, joy, purpose, meaning, connection, friendship and love. If you were a friend of Larry's, you are a friend for life. He indeed spent a lifetime of commitment to address the betterment of Denver's neighborhoods.'",
        "'speaker_7': 'And whereas, Larry is survived by wife of 48 years. Jane Parker Ambrose. Cousin David. And Laura Houseman of Corpus Christi, Texas, and many, many other cousins. He was laid to rest on Tuesday, February one, 2022, at Emmanuel Cemetery within Fairmount Cemetery.'",
        "'speaker_7': 'Now, therefore, let it be proclaimed by the Council of the City and County of Denver that the Section one that the Council of the City and County of Denver honors Larry Ambrose for his countless contributions to our community and declares today, February 14, 2022, to be Larry Ambrose Day and honors his memory.'",
        "'speaker_7': 'Section two that the clerk of the city and county of Denver shall attest and to fix the seal of the city and county of Denver to this proclamation and a copy be provided to his wife, Jane Parker Ambrose.'",
        "'speaker_0': 'Thank you, Councilmember Cashman. Your motion to adopt.'",
        "'speaker_7': 'Yes, thank you, Madam President. I move that proclamation 20 20218 be adopted.'",
        "'speaker_0': 'Thank you. We have it moved. And the second count? The comments by members of Council. Council Member Cashman.'",
        "'speaker_7': 'I will see the floor to pro Tem Torres as this is actually a district representative.'",
        "'speaker_3': 'Thank you so much. Thank you for being here, Jane.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'And thank you so much council members Cashman and Ortega for co-sponsoring on this proclamation. I think we were all pretty devastated to hear about Larry's passing and really remember him me personally, strongly as just such a dedicated neighborhood advocate.'",
        "'speaker_3': 'So I really do thank him. Thank you for your dedication in that space and know that he'll be missed. Oh, yeah, he will be missed.'",
        "'speaker_0': 'And we've got a few more people in the queue that want to speak. And so we're going to I'm.'",
        "'speaker_1': 'Going to make it real quick.'",
        "'speaker_0': 'We've got to go ahead and vote first. Okay. All right. If you want to wait for just a few moments here, we've got I thought I had seen Councilwoman Ortega. Were you in the queue? And then. Yes. Okay.'",
        "'speaker_0': 'We'll go ahead. And Councilwoman Ortega, go ahead, please.'",
        "'speaker_8': 'Thank you, Madam President. Larry is someone who was known by many people across the city. He wasn't just an activist in northwest Denver. His involvement with ANC was, you know, reflective of those citywide relationships that he had with so many people across this city.'",
        "'speaker_8': 'And Larry had strong opinions about a lot of things, and not everybody agreed with Larry's approach or his position on things. But he stood up for what he believed in and would would speak out on those issues. And as you can see, some of the changes that have happened within ANC as one of those areas where he'",
        "'speaker_8': 'had huge impact, I had an opportunity to get to know Larry. Even going back to when I worked for Sal Carpio and his work in the Central Black Valley, and he again, you know, reflected the input of neighborhoods into what was going to happen in the central Black Valley.'",
        "'speaker_8': 'And as you all know, we've got three parks down there. And those parks initially were identified to serve northwest Denver in District nine that was park deficient, but they also served the many people that now live in the Central Valley.'",
        "'speaker_8': 'I want to acknowledge that we have Tim Sanders, former councilman at large, councilman in the audience, who served with Larry on the Southwest Improvement Council Board, where Larry served up until just a couple of weeks before he passed.'",
        "'speaker_8': 'He was still working from home, even though he was in hospice, trained to do work for the Southwest Improvement Council. That alone shows you the dedication and commitment that he had to our communities. And Jane, my condolences for the loss on Larry.'",
        "'speaker_8': 'He was just just an incredible individual that many people loved. And I think the statement in here that if you were friend and Larry's, you were friends for life, really kind of says it all as well. So thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Ortega. And we've got Councilman Cashman. You're up next. And then we've got a few folks after you. So go ahead, sir.'",
        "'speaker_7': 'Thank you. And I'll try to make it easy on you, Jane, and make my comments kind of quick. I actually heard the Ambrose name first when I learned of Jane and her work with her kite project and when I was a journalist and would cover the work that she was doing and then became acquainted with this guy'",
        "'speaker_7': ', Larry. And holy cow, I want to talk about a force of nature. And I would just always felt blessed because I never got on Larry's wrong side. You know, he was just one. There were some folks who really didn't like his approach because when he believed in what he believed in, he he did not suffer fools.'",
        "'speaker_7': 'Well. And if he thought you were a fool, you were liable to get both barrels. He did incredible work for our neighborhoods. You know, for me, I think most prominently, his work with I.N.S., he. Really changed the tenor for those who don't know ANC, its gender, neighborhood cooperation and a citywide coalition of some 100 neighborhood groups up'",
        "'speaker_7': 'and down over the years. And Larry did just phenomenal work in really activating that voice. But the thing that really caught me was and it was mentioned in the proclamation, a lot of folks know Lani Garrett, a and entertainment legend in Denver for four decades.'",
        "'speaker_7': 'And you would just assume she kind of sprung from the earth all by herself. But she put a Facebook post the day after Larry passed, first starting off saying she was absolutely devastated and then telling that story where she had met him.'",
        "'speaker_7': 'They were friends. And he came to pick her up to take her take her to hear a music group. And as he walked into her house, he heard her singing in the kitchen and said, geez, you know, you've really got a great voice.'",
        "'speaker_7': 'You ought to come try out with our band. And she went, Try it out with the band. And it was a total flop. And she she went home thinking, well, you know, I'll just, you know, keep singing in the kitchen.'",
        "'speaker_7': 'And Larry did what he what he does with people or what he did with people, you know, urging them to be their best selves and kept pushing Lani. And she picked herself up and got back into the game.'",
        "'speaker_7': 'And like I said, she's just one of the one of Denver's entertainment legends. And so that really caught me with something I had had no clue about. So I will just add, you know, my condolences and for all for not just Jane, but for all of Denver.'",
        "'speaker_7': 'You know, we've lost an important voice among people who really care about this city. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Castro. And we have Councilmember Sandoval and then Flynn in the queue. Go ahead, Councilwoman.'",
        "'speaker_2': 'Thank you, Madam President. I'm sorry for your loss, Jane. I to Meg. Jane first. Before, Larry, I had heard of Larry from growing up in the north side. But I got to know Jane very well. And we spent time together in a program.'",
        "'speaker_2': 'And then I found out Larry was her husband, but I knew her from the Kite Store down downtown at the pavilion. I don't think it was called the pavilion, but downtown. And so I remember when my father passed away, Larry, and my dad passed, and we all did not always see eye to eye, but he gave his'",
        "'speaker_2': 'condolences. And what he said to me with my dad was thought provoking. And I will say the same for Larry. He was very thought provoking. And when he made a case, he made it and he knew all of the facts about it and he stuck to it.'",
        "'speaker_2': 'And that is something that I have always thought about with Larry and Jane is how thought provoking they have been and how great stewards of Sloan's Lake that they have been. They face loans lake and they've advocated for things at the lake, and that will be greatly missed.'",
        "'speaker_2': 'And I also believe that we stand on the shoulders of those who come before us. And Larry definitely is one of those people.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. Councilmember Flynn.'",
        "'speaker_6': 'Thank you, Madam President. Well, I met Larry before I met Jane, in fact, when I met Larry about 40 years ago. When I came to Denver to work at the Rocky Mountain News. Larry was one of those people that almost immediately came into the circle of folks she needed to talk to Larry and Deep Punk down at'",
        "'speaker_6': 'area when Larry was working community relations at their area campus. And we would go to lunch over at the Heroes Place over by East High School and talk about development, talk about land use, talk about neighborhoods. We talk about it so much and it was so intense.'",
        "'speaker_6': 'Jane, I apologize. I didn't even know he was married to Bill until I heard about your One Sky One World program. And it's true what was said in the proclamation that I think Councilman Cashman read in that portion that if you were a friend, you were a friend forever.'",
        "'speaker_6': 'And as we moved along over the four decades that I knew, Larry, we had moments of great agreement and moments of great disagreement. But we always had, at least I believe we had moments of friendship. And it was a pleasure to know him.'",
        "'speaker_6': 'And we will miss his creativity and his intelligence and his alternative way of looking at things. He was instrumental to me many times here desk testifying. In fact, he was instrumental in impacting one of my votes on a zoning issue in Sloan's Lake years ago that I recall.'",
        "'speaker_6': 'And so we will we will miss him. And I recall also that he was so well-known that in 2015, even though he wasn't on the ballot, he got 2000 write in votes for mayor. I don't know if many people realize it's pretty hard to get a write in vote, but just with a lot to, I think a'",
        "'speaker_6': 'two week social media campaign, Larry got 2000 plus write in votes and I think that's quite remarkable and alone says a lot. So you have my condolences, Jane. We will miss him. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. And we definitely send our sincere condolences to you, Jane, on behalf of city council, the city family, for your great loss. He was a great man and did many things on behalf of our city.'",
        "'speaker_0': 'And you two were amazing partners together. And so we send you our support and prayers in this time. Madam Secretary, roll call.'",
        "'speaker_2': 'See the Barca. I. Cashman.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Kenny Ortega. I. Sandoval. Sawyer. I. Torres. I. Black eye for. Eye for an eye tendon.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Hi. All right. Madam President.'",
        "'speaker_0': 'I. Madam Secretary closed the voting and announced results.'",
        "'speaker_2': '39.'",
        "'speaker_0': '13 Eyes Proclamation 20 2-0218 has been adopted. Council Member Cashman will go ahead and allow you to bring up our speaker this evening.'",
        "'speaker_7': 'Yes, a woman with great patience. Thank you for giving us the time to honor your husband. Like to call up Larry's wife, Jane Parker. Ambrose.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you so much. I don't know. Don't get me wrong. I just humbly accept this proclamation. It's going to be really hard not having Larry since. But you know, it's.'",
        "'speaker_2': 'The grieving process.'",
        "'speaker_1': 'That's so interesting, the different stages that you go through. And one of the things that I wanted to share with you. Is when we saved the gold in my house. I remember we were up 3:00 in the morning waving flags so that the truck could carry the house down to historic and High Street area.'",
        "'speaker_1': 'And. One of the beautiful things about Larry, that he could decide things out of people and what their perspective was and with Golda. She was. He called her. A drop instead of a drop out because this was the teens and Denver was actually being called like the new Paris of the world.'",
        "'speaker_1': 'There was a convalescence center where people were coming in and working on their health because of the climate. And so Golda's sister, Shana, was living here in there. And she called, she says. Dad is trying to marry me off to a 32 year old man.'",
        "'speaker_1': 'And I want to go to school. I want education. I don't want to be married to this 32 year old man. Shane says, I have no money to send you. And she said, Don't worry about it. And she taught English on the streets of Milwaukee for $0.10.'",
        "'speaker_1': 'And she raised that money to create her passage on a train, Milwaukee to Denver. And she walked through our Union Station and lived with her sister so she would stay up at night. Washing teacups of all these intellectuals and artists that would gather together.'",
        "'speaker_1': 'And they were forming the beginning of Israel. And that to me. Speaks volumes. About. Don't get me started. Okay. But anyway. And so Larry fought for that to bring attention. I mean, Denver should be so proud of the fact the Golden Bear lived here.'",
        "'speaker_1': 'Then he brought Shane, his daughter, into Denver years later when he was working at Terraria Judy. Beautiful, beautiful woman. But that history should not. And from there he went on. He met a man by the name of what was last.'",
        "'speaker_1': 'I forget Wally's last name, but. He was a retired principal and he actually was a classmate of Golden Letters in at North High. And so, Larry, and he started the North High, a foundation. And then they started biking part, which sits at a spear and fed room.'",
        "'speaker_1': 'And the reason why they cleared that little triangular area is to enhance the entrance to northwest Denver so that people could see North High, they could see the Mason Center, they could see St Anthony's. Church and really welcome people into this incredible community.'",
        "'speaker_1': 'Those are the things we need.'",
        "'speaker_2': 'To.'",
        "'speaker_1': 'Keep in mind. And I mean, I could go on and on. And I thank you so much. And I humbly. Accept this proclamation. Thank you. Thank you.'",
        "'speaker_0': 'Thank you so much, Jane. And I believe we had Tim Santos, who is also going to say a few words as well without long time relationship and I'm sure is at large as well.'",
        "'speaker_1': 'Thank you very much, Madam President. And Council. My name is Tim Sandoz. I'm a board member of the Southwest Improvement Council, also known as Swift Head Mary Ambrose, head and executive director of just prior to his death. As everyone said, Larry kept on working regardless of how many times we asked him to stop because we knew of'",
        "'speaker_1': 'his health. But he was so driven a person, he wanted to make sure that he could accomplish the things he had set out to do for Southwest Denver. He was an amazing advocate for, as was said earlier by council staff throughout here in southwest Denver was no different.'",
        "'speaker_1': 'He was dramatically involved in the community, in particular for seniors, for food, for health, for housing. Larry One of the most amazing things about him was his intellect and his vision and his foresight. And as was mentioned, he was very determined once he had done his research, understood where he was at, and would be very strong on'",
        "'speaker_1': 'those positions, much to the chagrin of a number of elected officials through the years that we all knew, including myself. But one thing about Larry, as counsel has pointed out, he was so strong in his position that people would think he disliked them.'",
        "'speaker_1': 'He never disliked anybody who disagreed with your position, but he still respected and admired people for standing up and for delivering theirs. And with Southwest Denver as well as North Denver, where I first met Larry in 1987 when we were preparing for a 1989 bond election as Citizens for Denver's Future that had 92 members, Larry was a'",
        "'speaker_1': 'part of, again, his vision, his intellect, his ability to work was what was so strong about him and what was so great. What a lot of people don't may not remember is Larry also ran for city council at large in 1989 against me.'",
        "'speaker_1': 'And we got to know each other, as you all know, when you're on the stump with this him, you talk to him. And Larry and I developed a great relationship and I just really admired him and thought, Daniel, he should be on city council at the same time, just not nice.'",
        "'speaker_1': 'But he was tremendous individual. We are sorely going to miss his leadership and his met at the Southwest Improvement Council and I'm going to miss him personally for just his humor, his intellect and everything that he brought to the table.'",
        "'speaker_1': 'Larry was one of a kind, and we will always think of him and remember him in southwest Denver. Thank you so much. Thank you.'",
        "'speaker_0': 'Thank you so much. We appreciate the memories that you shared. And again, our sincere condolences and support to you, Jane, as you move into this next chapter. Madam Secretary, would you please read the bills for introduction for us this evening?'"
    ],
    "City Council Rules of Procedure Amendment for Professional Services Procurement.": [
        "'speaker_0': 'No items have been called out under bills for final consideration. Councilmember Torres, Hines and CdeBaca have called out Bill 161 for comments and questions. Under pending, no items have been called out. Madam Secretary, would you please put the first item up on our screen?'",
        "'speaker_0': 'Thank you. Councilmember Flynn, please go ahead with your comments on Resolution 185.'",
        "'speaker_6': 'Thank you, Madam President. This resolution is a real addition to the council rules of procedure that will implement a recent charter change that allows city council to engage professional services on an as needed basis. And I just I've called this out essentially to comment on my colleague and our colleague, Councilwoman Ortega, who has been working for this'",
        "'speaker_6': 'result for many, many years. And I called it out so that we can publicly acknowledge and I want to thank her for bringing this to fruition through all those years of effort. I believe that this will be a very valuable tool for this and for future councils.'",
        "'speaker_6': 'When we start doing when we have to engage in complicated projects that need more analysis than our typical timeframes will allow us to do. And I look forward to the first few times we get to utilize this. So thank you, Councilwoman Ortega, for for riding on this so hard over the years and bringing it to us.'",
        "'speaker_4': 'Okay.'"
    ],
    "Contract with Mental Health Center of Denver to expand STAR program citywide.": [
        "'speaker_0': 'Thank you, Councilmember Flynn. And we sincerely appreciate Councilmember Ortega's work on this resolution. All right. We don't have anybody else in the queue for that one, so we'll go ahead and move on. Madam Secretary, thanks for putting the next item up on our screens.'",
        "'speaker_0': 'Councilmember Canete, please go ahead with your comments on Resolution 1207, please.'",
        "'speaker_3': 'Thank you. Council President. This is a $1.4 million contract with Mental Health Center of Denver, who also is contracting with Denver Health to expand the Stier program, which is our support team assisted response. This is the alternative to policing that launched in the summer of 2020 and has been continuing and has grown slightly.'",
        "'speaker_3': 'And this is an important contract for our community to celebrate for several reasons. First, this contract is going to provide five museums. They're not available right away. As you may know, there are supply chain issues, but our provider is agreeing to fill the gap in the middle.'",
        "'speaker_3': 'But we will be able to have five vans providing service through more of our city to people who are in crisis and don't necessarily need the armed police response that we heard about and appreciated a little bit earlier tonight.'",
        "'speaker_3': 'We've already got seven new clinicians hired and six new EMT and medical techs to provide, you know, medical assessments to provide trained mental health services. And they estimate that this contract is going to result in 10,000 contacts. I share this information because, you know, this contract is not new.'",
        "'speaker_3': 'But one of the things I talk about every time I talk to a class or, you know, I'm asked to give a talk about some of the challenges our city faces. I share with people that we have models that work.'",
        "'speaker_3': 'Our challenge is often that they are not to the scale that we need them. Right. Supportive housing works. We don't have enough of those units coming online are supportive. Our tiny home villages work. We don't have enough of them.'",
        "'speaker_3': 'Right? Star is an example of a program that has worked for those that it has had contact with in minimizing unnecessary arrests or unnecessary costs. Right. Whether that be a jail cost or an emergency room cost. And it has done so for less than 1% of the calls coming into the city that it might be eligible for'",
        "'speaker_3': '. So it matters that we're scaling it up. It matters as well, because we know that this program doesn't just belong to a city agency. Tonight's contract is important because it's the first time this contract's being brought forward by our health department, who is an expert in people who are experiencing mental health crisis and need medical care.'",
        "'speaker_3': 'Right. So it's the right agency leading it. They do it in partnership with others, but it belongs to the community. That's what this program it was really born from community advocates, parents, caregivers, people who wanted to see us doing something different.'",
        "'speaker_3': 'And this contract includes some important things that that community's advocated for. It includes a third party evaluator, the Urban Institute. This is a very highly respected national organization. So don't take our word for how this program's doing. We'll have a third party evaluator.'",
        "'speaker_3': 'It includes a community advisory committee that includes individuals named by those who advocated for and created the first advisory program for this program and said, we want these individuals to be part of this new city sponsored advisory committee.'",
        "'speaker_3': 'And the city responded. And so we have community advisors providing oversight and input and feedback and having eyes on this program. We have a third party professional evaluator on this program, and we have an important expansion to serve more people.'",
        "'speaker_3': 'So it's on consent, I hope, and plan that it's season consent, but it's important to just take a moment every now and then celebrate the council partnerships that brought this to fruition. Councilwoman Gilmore, in particular, we spent a lot of hours together with this agency, and we appreciate your, you know, taking our input and allowing us to'",
        "'speaker_3': 'be partners in the process as well. And generally, this entire council has championed the program. So so that's why I called it out tonight and, you know, can happily go forward the rest of the night on consent, but hopefully with a little more awareness of the important, important steps that are happening tonight.'",
        "'speaker_3': 'Thank you. And thank you to the providers out there on cold nights and hot nights and tough nights providing this service. We thank the clinicians and the EMT and medical techs who will be out there. And we also look forward to there is an RFP out right now for a nonprofit partnership, and we hope to have more'",
        "'speaker_3': 'community agencies as partners in the program as they respond to that RFP. So thank you to all of you on the ground doing the work. INKS Madam President.'"
    ],
    "City Council Rules of Procedure Amendment for Public Comment Session.": [
        "'speaker_0': 'Thank you, Councilmember Kinney, and appreciate you calling this out because of the amazing work that the star team does. And how important it is for our city. And I appreciate you highlighting that a bit more for us this evening.'",
        "'speaker_0': 'Madam Secretary, if you wouldn't mind putting the next item on our screens, Councilmember Flynn, will you please put Council Resolutions 166 and 119 on the floor for adoption?'",
        "'speaker_6': 'Yes. Thank you, Madam President. I move that council resolutions 22, dash 0166 and 22, dash 0119, be adopted in a block.'",
        "'speaker_0': 'Thank you. It has been moved and seconded comments and questions by members of Council on Council Resolutions 20 2-0166 and 22, Dash 0119. Council members say to Barker.'",
        "'speaker_2': 'Yes. I called these out to go on record voting no for both of them. 166 is the council rules change that, in my opinion, solves a problem that wasn't well defined. It didn't explore other options to expand access to public comment.'",
        "'speaker_2': 'It didn't thoroughly engage the public in defining the problem or potential solutions, and it potentially punishes people for participating regularly. I think we've got a lot of issues with our public comment sign up to begin with and had an opportunity to really overhaul the current format and do something that is more equitable.'",
        "'speaker_2': 'And we did not meet that mark with this. And so I do not support this rule change tonight. The other contract, 119 is for the sole source provider that's been working with the Department of Safety on the psychological evaluations of DPD for over 20 years.'",
        "'speaker_2': 'We I called this out at the last opportunity. We voted on it, and it was highlighted that there are no people of color on this team. And we had a commitment from the Department of Safety to put this contract out for competitive bid.'",
        "'speaker_2': 'And from my understanding, it did not go out for bid. And here we are again with it in front of us. And no real resolution around the issue, the lack of people of color on staff and the sole source nature of the contract.'",
        "'speaker_2': 'So I'm a no for both of these tonight.'",
        "'speaker_0': 'Thank you, Councilmember CdeBaca. Next up, we have Councilmember Cashman.'",
        "'speaker_7': 'Thank you. 20 2-1 66. The rules change. When I brought forward the initial bill to begin public comment in front of this body in 2016, it was brought forth because the way I looked at it, we had 13 right members of city council working hard.'",
        "'speaker_7': 'We had, you know, some thousands of people working for the city, bringing up ideas. But, you know, at that time, there were probably 600,000 people in the city and county of Denver. And I just thought it might make sense that we have a regular session where we could hear from the public, because I figured there were probably'",
        "'speaker_7': 'a heck of a lot of good out ideas out there that we weren't hearing about. It was never intended for everybody to get to speak every week. But so we started off in 2016 agreeing to have a 30 minute public comment session before the first city council meeting of each month.'",
        "'speaker_7': 'And then about two years later, that that same council chose to expand it to the first and third meetings of each month, but continued the policy that those public comments sessions were not to be televised. Then this council decided not a long time ago to expand public comment to 30 minutes before each Monday night city council meeting'",
        "'speaker_7': ', and we decided that there was no reason they shouldn't be televised. So now they're televised. I think it's evident that this council's behavior has been to expand the reach of public comment, and it has been said before, besides these 30 minute comments sessions which are admittedly not long enough to hear from everybody, you can reach us via'",
        "'speaker_7': 'email. You can you can reach us by in-person meetings, all kinds of opportunities to to make your ideas heard. My support of this is to try to give to broaden the ideas brought before this body. If it turned.'",
        "'speaker_7': 'I first of all, I don't expect that folks who would like to speak more frequently than once every so many weeks, I think people probably have pretty much the opportunity that they want. But if there's someone who hasn't spoken in a long time, they simply move to the front of the line.'",
        "'speaker_7': 'No one is prevented from speaking or signing up to speak, and I expect that adequate opportunity will make itself evident. And I also believe that if there this policy turns out to be other than intended, we'll take a look at it and be sure that people have a reasonable opportunity to speak to this body.'",
        "'speaker_7': 'That's my comments. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Cashman. Councilmember Hines.'",
        "'speaker_7': 'Thank you. Council President May I ask Deputy Director Walker to provide comment on what Councilmember CdeBaca mentioned?'",
        "'speaker_1': 'The city. Thank you.'",
        "'speaker_0': 'All right. Thank you. And just a reminder for members of the public who are listening to the conversation. Councilmember Cashman was making comments on a bill on excuse me, resolution 166 around public comment. But now we're going to shift gears and we're now talking about Resolution 119.'",
        "'speaker_0': 'So go ahead, please, Laura.'",
        "'speaker_3': 'Thank you. And thank you for that, Councilman Himes. Laura Walker, deputy director of safety. And I just wanted to clarify that Nicolette Inflator was.'",
        "'speaker_1': 'A competitive bid.'",
        "'speaker_0': 'The Department of Safety performed that.'",
        "'speaker_3': 'Competitive process during 2020, and there were three awarded vendors.'",
        "'speaker_1': 'On that competitive process. So there was a selection for Nicolette Inflator.'",
        "'speaker_7': 'All right. Thank you. Thank you. Council president.'",
        "'speaker_0': 'Thank you. Thank you, Laura. And thank you, Councilmember Hines. Not seen anyone else in the queue right at this point is. Um, and I know we've got Council member CdeBaca. Go ahead, please. I see your hand is up.'",
        "'speaker_2': 'My question is for Laura, and it's clarity around who the other vendors were and what section or what slice of the work this contract is going to fulfill and why we chose to continue going forward with this contractor.'",
        "'speaker_1': 'I guess.'",
        "'speaker_3': 'So. Back in 2020, we did.'",
        "'speaker_1': 'Award.'",
        "'speaker_3': 'Three vendors and I can get you that there was four four contractors that actually bid. We awarded to three Nikola deflator.'",
        "'speaker_1': 'Dr. Jackson.'",
        "'speaker_3': 'And Jeremy Brower.'",
        "'speaker_1': 'Regarding if they do.'",
        "'speaker_3': 'Have the majority of the work within within the Department of Safety.'",
        "'speaker_1': 'So that's why we.'",
        "'speaker_0': 'Did.'",
        "'speaker_3': 'The largest amount and expenditure did get a new collective later. And so that's why we were seeking to.'",
        "'speaker_1': 'Increase a dollar spend.'",
        "'speaker_3': 'Of this.'",
        "'speaker_1': 'Contract.'",
        "'speaker_2': 'The other contractors at all. Have they ever been affiliated with Nicoletti? So.'",
        "'speaker_1': 'Can you repeat the question?'",
        "'speaker_2': 'Have the other contractors that were awarded the contracts, were they affiliated with Nicoletti at any point in time?'",
        "'speaker_0': 'I think we might need to have you repeat the entire question over again, Councilwoman.'",
        "'speaker_2': 'Have any of the contractors that were awarded the other contracts, have they ever been affiliated with Micheletti in the past?'",
        "'speaker_3': 'I believe Jeremy.'",
        "'speaker_1': 'Prior was, but I would have to go there on that.'",
        "'speaker_2': 'Thank you. That's it.'",
        "'speaker_0': 'Think. Okay. Thank you, Laura. And thank you, Councilwoman CdeBaca. We have no one else in the queue. And so, Madam Secretary, roll call on Council Resolutions 22, dash 0166 and 22, dash 0119.'",
        "'speaker_2': 'See the rocker? No, Clark.'",
        "'speaker_7': 'All right.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_7': 'Hi.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_7': 'Hi.'",
        "'speaker_2': 'Hi. All right. Question. Kenny Ortega. I. Sandoval. I. Sawyer. I. Torres. I. Black. All right. Madam President, I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': 'One May 12 Eyes.'"
    ],
    "Ordinance to Remove the Term Item from Dangerous Weapons List.": [
        "'speaker_0': '12 Eyes Council Resolutions 20 2-0166 and 20 2-0119 have been adopted. Madam Secretary, please put the next item on our screens. Councilmember Torres, go ahead with your comments on this 161, please.'",
        "'speaker_3': 'Thank you, Madam President. So early January, we passed a bill on ghost gun legislation, and along with that bill were a number of changes made to the weapons language of the code. After hearing from a constituent, I looked at a piece of concerning wording in the language changes and made and questioned the potential expansive interpretation of the'",
        "'speaker_3': 'language. Any item in section F. After discussion with Council, President Gilmore made the decision to make a minor change, to propose a minor amendment that we feel is pretty meaningful. It could be interpreted that any item is not used as a weapon, which is what the language should be exclusively focused on.'",
        "'speaker_3': 'So given its location in the code, I know when I voted in favor of the Ghost Guns Bill, I did so believing that only substantive changes were being made to pertaining to ghost guns. Revising this section to include any item goes beyond a clerical update.'",
        "'speaker_3': 'I initially thought about a journalist friend of mine who covered the 2020 protest who used a gas mask when the recently revised language possessing that gas mask could be criminalized because it protects him from the effect of tear gas, even if it's not used as a weapon we shouldn't allow for this potential interpretation of the code.'",
        "'speaker_3': 'I want to thank the City Attorney's Office for a cooperative effort to make the fix, and I hope my colleagues will vote in favor of the amendment.'",
        "'speaker_0': 'Thank you, counsel pro tem Torrens and happy to support this amendment this evening. We've got Councilmember CdeBaca and then Councilmember Hines.'",
        "'speaker_2': 'I don't have any questions. I just wanted to make sure that it was explained to the public why this was being changed. And thank the city attorney for making the change as well.'",
        "'speaker_0': 'Thank you. Councilmember CdeBaca. Councilmember Hines.'",
        "'speaker_7': 'Thank you, Councilman. President. I'd also wanted to thank Councilmember Pro-Tem Torres for this, for the catch and for the correction. I spent much of the protests actually in the streets, and most of it was in District ten. A lot of my neighbors don't have air conditioning.'",
        "'speaker_7': 'And so when the tear gas would would come through our community, a lot of times people would just be watching television or sleeping or whatever. And and they, too, became part of the conversation, even though unwittingly so and and so I as I spent a lot of time in the protests, I saw people with all sorts of'",
        "'speaker_7': 'things like gas masks or items that could have been interpreted as in in the in this ordinance without the correction. As as. Offensive. I mean, an offense not just offensive, but as a as an illegal and an and an offense to our laws.'",
        "'speaker_7': 'And I want to make sure that that the people who become part of this conversation unwittingly, who just happened to be living in their neighborhoods, aren't or aren't caught up with this legislation. So thank you again, pro Tem Torres for for bringing this forward.'",
        "'speaker_7': 'I'll be.'",
        "'speaker_0': 'Thank you, Councilmember Hines, and seen no one else in the queue that will stay on the consent agenda. That concludes the items to be called out this evening. Any bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Flynn, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_6': 'Yes, Madam President. Thank you. I move that resolutions be adopted. And bills on final consideration be placed upon final consideration and do pass in a block for the following items. All series of 2022. 212 185 113. 124 128.'",
        "'speaker_6': '121 one 2682. One 4012. Zero 746. 122. One. 61 101102103104. And 141.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_2': 'CdeBaca, I. Clare Flynn. I can't go. I can't. I. Cashman. I. Commit i. Ortega. I. Sandoval. I swear i. Torres. I. Black rice. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_2': '13 eyes.'"
    ],
    "Rezoning of 2000 Blake Street in Five Points.": [
        "'speaker_0': '13 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass this evening. Council will not take a recess. Councilmember Flynn, will you please put Council Bill 21, Dash 1455 on the floor for final passage?'",
        "'speaker_6': 'Yes. I move the council bill 21, dash one four or five five be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Herndon, your motion to postpone.'",
        "'speaker_7': 'Yes, Madam President. I move that final consideration of Council Bill 21, Dash 1455 with this public hearing be moved to March 21st, 2022.'",
        "'speaker_0': 'Thank you. You've got the move, the motion, and we need the second. Madam Secretary, roll call on the postponement of Council Bill 21, DASH one four, five, five. And before we do that, roll call. Councilmember Ortega, did you have a question?'",
        "'speaker_8': 'Madam President, I just wanted to ask if this is being done at the request of the applicant.'",
        "'speaker_7': 'Correct.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_0': 'All right. Great. Thank you. Councilmember Ortega. Madam Secretary, roll call.'",
        "'speaker_2': 'Please see the baca. Right.'",
        "'speaker_7': 'Clark, my.'",
        "'speaker_2': 'Friend.'",
        "'speaker_6': 'I.'",
        "'speaker_2': 'Herndon. I work for Cashman.'",
        "'speaker_1': 'Right.'",
        "'speaker_2': 'Kenny Ortega. I. Sandoval. I. Sawyer. I. Torres. I'm glad I. Madam President, I.'"
    ],
    "Rezoning for Accessory Dwelling Unit at 735 North Milwaukee Street.": [
        "'speaker_0': 'Madam Secretary. Closed the voting and announced results. 13 of 13 I's Final Consideration of Council Bill. 20 1-1455 with its public hearing has been postponed to Monday, March 21st, 2022. Councilmember Flynn, would you please put Council Bill 20 2-0003 on the floor for final passage?'",
        "'speaker_6': 'Yes, I move the council bill 20 2-0003 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Herndon, your motion to postpone.'",
        "'speaker_7': 'I move that final consideration of Council Bill 20 20003 with this public hearing be moved to February 22nd, 2022.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Comments by members of council. Councilmember Herndon.'",
        "'speaker_7': 'No comments by president.'",
        "'speaker_0': 'All right. Thank you, Madam Secretary. Roll call on the postponement of Council Bill 20 2-0003.'",
        "'speaker_2': 'CdeBaca I work all right.'",
        "'speaker_1': 'Flynn, I.'",
        "'speaker_7': 'Herndon I.'",
        "'speaker_2': 'Have.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Cashman Hi. It's me. I. Ortega. I. Sandoval. I swear. I. Torres. I work. I. Madam President, I.'",
        "'speaker_0': 'Madam Secretary, closed the voting and announced the results.'"
    ],
    "Rezoning of 1974 and 1990 South Huron Street in Overland.": [
        "'speaker_2': '13 Eyes.'",
        "'speaker_0': '13 Eyes. Final Consideration of Council Bill 20 2-0003 with its public hearing has been postponed to Tuesday, February 22nd, 2022. Councilmember Flynn, will you please put Council Bill 20 2-0016 on the floor for final passage?'",
        "'speaker_6': 'Yes, Madam President, I move that council bill 20 2-0016 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Herndon, your motion to postpone.'",
        "'speaker_7': 'Yes, Madam President. I move that final consideration of Council Bill 20 20016 with this public hearing be moved to February 22nd, 2022.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Comments by members of council.'",
        "'speaker_7': 'Councilmember Herndon look honest, Madam President.'",
        "'speaker_0': 'All right. Thank you, Madam Secretary. Roll call on the postponement of Council Bill 22, Dash 0016, please.'",
        "'speaker_2': 'CdeBaca. I.'",
        "'speaker_0': 'We might need you to say I again, Councilwoman.'",
        "'speaker_2': 'I.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_7': 'Herndon. I.'",
        "'speaker_2': 'I. Cashman. Kenny Ortega. I. Sandoval. I. Sawyer. I. Torres. I. I. Madam President, i.'",
        "'speaker_0': 'Madam Secretary, closed the voting and announced results.'",
        "'speaker_2': '13 hours.'",
        "'speaker_0': '13 ies. Final Consideration of Council Bill 20 2-0016. With its public hearing has been postponed to Tuesday, February 22nd, 2022. On Monday, March 14, the Council will hold a required public hearing on Council Bill 21, Dash 1528, changing the zoning classification for 3435 North Albion Street and Northeast Park Hill.'"
    ]
}