{
    "Plat Approval for Loretto Heights Filing No. 1 in Council District 2.": [
        "'speaker_0': 'Thank you. I'll do a recap here. Under resolutions, Councilmember Flynn has called out Resolution 1057 for comments under bills for introduction. No items have been called out under bills for final consideration. No items have been called out and under pending.'",
        "'speaker_0': 'No items have been called out. Madam Secretary, please put the first item up on our screens. And Councilmember Flynn, go ahead with your comments on Council Resolution 1057, please.'",
        "'speaker_5': 'Thank you, Madam President. It's not often that one would call out a subdivision plat for a comment or for any notice at all. But this one I wanted to call out especially to thank the staff at Department of Transportation Infrastructure for working with my community on the Loreto Heights campus redevelopment.'",
        "'speaker_5': 'There were seven streets. If you look at the plat, you'll notice that are entirely internal to the campus. And so we worked with Dottie and the city surveyor and the staff there to impress upon them that it was not crucial to follow the the Denver street grid rules.'",
        "'speaker_5': 'You know, we're alphabetical, etc. These streets are entirely contained on the campus. There were seven of them. The streets that exit the campus on the federal course have Amherst, Bates and Cornell and Dartmouth as they because they intersect with a with federal boulevard.'",
        "'speaker_5': 'But inside the campus we were able to name seven of these streets with legacy names from the history of the Loreto Heights College and the Sisters of Loreto. And it is one way to recognize the historic nature of this site for 100 years and more.'",
        "'speaker_5': 'So when people enter the campus, they will see the historic ties to the Bonfils family here. For example, Sister Pan, Croatia, Mother Pan, Croatia. Bonfils, who is buried on in the cemetery on this site, was a cousin to Frederic Bonfils, the founder of the Denver Post.'",
        "'speaker_5': 'Frederick Bonfils is one of his daughters. May or may Bonfils Stanton endowed several of the buildings on the campus, the theater and the library. And so and Bishop Matchbook, who brought the Sisters of Loreto up here from New Mexico back in 1864 to start Saint Mary's Academy, which which developed in Loreto Heights.'",
        "'speaker_5': 'So we have match above way, we have Bonfils way, we have pan creation lane, we have Loreto way, we have a street named for the sister of Loreto who was the last sister who held that position as president of the college.'",
        "'speaker_5': 'My sister, Mary Francis Walsh, I think for 20 some years and one street named after a fellow named Max de Giulio who made who elevated the performing arts curriculum. ADLER At a height to national stature back in the sixties and seventies through the the Mae Free Standing Theater.'",
        "'speaker_5': 'And so I just wanted to call that on and recognize the willingness of of Dante staff, particularly our our departed manager, Ulysses Lee, who made the decision to allow this and to work this through the council process. And I recommend this to my colleagues for approval.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. All right. Seen no one else in the queue. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote I.'"
    ],
    "Second Amendatory Agreement with Environmental Hazmat Services, Inc. for Solid Waste Collection.": [
        "'speaker_0': 'All speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so. Their Home Address. If you've signed up to answer questions, only state your name and note that you are available for questions of council.'",
        "'speaker_0': 'Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted. We will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating to virtual participants.'",
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilmember Ortega, will you please put Council Resolution 982 on the floor for adoption? I don't know. I think we might need your mike on again. Is it? Is it on? Huh? Okay. Okay. We might be having some wiring difficulties or something.'",
        "'speaker_0': 'Go ahead, please.'",
        "'speaker_6': 'Council Resolution 21 980 to be adopted.'",
        "'speaker_0': 'All right. Thank you. It has been moved and seconded the 30 minute courtesy public hearing for council resolution 982 is open. May we please have the staff report? And I see we have Wolf in here.'",
        "'speaker_2': 'Good evening, Madam President. I just want to quickly recognize a 50 year resident of the city who's making his first appearance in these chambers, Bill Fenton Senior, who said he appreciates all the work that you all do. I tell him to expect some tough questions and conversation, and he said he'd expect nothing less.'",
        "'speaker_2': 'So good evening, everyone. Watching in attending. I'm Will Fenton from the Denver Department of Public Health and Environment, the kind of a truncated presentation compared to a few weeks ago, but certainly happy to address any questions as they come up.'",
        "'speaker_2': 'The proposal before you is a resolution approving amendments to a contract with Environmental Hazmat Services Inc. for the collection of discarded and abandoned hazardous waste on city owned property and other public spaces and the cleaning of these impacted areas citywide.'",
        "'speaker_2': 'DDP is the sponsoring department for the contract for this agreement is extremely important to the other agencies represented here because of the protection it provides to the public health of all residents and visitors that we serve. And also two city employees who are not trained or equipped to safely collect hazardous waste and clean impacted space.'",
        "'speaker_2': 'The scope of work also includes the collection, safekeeping, storage and return of possessions temporarily relinquished by persons experiencing homelessness. The current agreement expires on October 10th, 2021. In 2020, this agreement was amended to include rapid response services, whereby the contractor must provide onsite services within a 1 to 2 hour window of time at all hours of the'",
        "'speaker_2': 'day or night in facilitation of the arrest of individuals whose possessions or wastes require storage or disposal. Quickly, what is hazardous waste and where's it collected? And what public spaces are cleaned? Hazardous waste can be household waste included.'",
        "'speaker_2': 'Abandoned and misused propane canisters. Hazardous waste is chemical and medical waste. Discarded sharps, drug paraphernalia and drug making materials present a hazard to city staff and the public and are also collected by us. Hazardous waste can also be human and animal waste, food waste, soil, bedding, hazardous consumer goods, camping, fuel, industrial chemicals and other materials.'",
        "'speaker_2': 'Public spaces, like some of these pictures here that you've seen. Some of them. Include alleys, sidewalks, public buildings, parks and adjacent areas, as well as riverbanks and similar greenspace. On the left here, we have HHS employees cleaning the area behind the restaurant, Skyline Park.'",
        "'speaker_2': 'An area next to a park trail, an impacted space by a roadway, and the fountain outside city offices of Colfax and Broadway. And finally, an oil drum dumped in an alley. Resolution 2109 82 extends this agreement for an additional two years to round out the maximum five year term contract language has been added that require DHS personnel'",
        "'speaker_2': 'attend and pass sensitivity training. Language has been added that clarifies that DHS employees are not to engage with or negotiate with members of the public on behalf of the city and on site cleanups, always deferring to city representatives.'",
        "'speaker_2': 'In conversations with DHS directly that I've been a part of, we emphasized that we will not and we will not tolerate inappropriate comments or any inappropriate behavior from HHS employees. We hear your feedback and we've made adjustments. We're requiring DHS to participate in structured onsite performance review.'",
        "'speaker_2': 'With city staff after site cleanup for requiring clarified invoice practices to break out onsite cleanup from offsite storage operations, charges and other expenses. We've added to the contract that each of us comply at all times with the household when we're relevant to their tasks.'",
        "'speaker_2': 'The city has the right to terminate this agreement with cause upon written notice, effective immediately and without cause. Upon 20 days. Prior. Written notice to written notice. IHS. We also heard feedback that these cleanup efforts involving IHS were not sufficient.'",
        "'speaker_2': 'City staff will collaborate and are collaborating with DHS to sign off on DHS work completion after their work is completed. Their work is focused on removing hazardous materials and cleaning public spaces so that they're safe for residents. Dottie is also coordinating internally to create a checklist for completion of additional site cleanup by city personnel.'",
        "'speaker_2': 'Then city staff are also reviewing storage site locations and hours, almost none. We also heard your feedback about more contract expenditure details. On the left of this screen is a table of expenditures by agency and on the rate by year, the total approximate expenditures used for equipment cleanup for this contract are between 750,000 and $900,000.'",
        "'speaker_2': 'The city currently receives. 400 or 500 citizen complaints of encampments per week. That volume has been consistent for the past two and a half months. Parks and Recreation has also spent more than $350,000 to date on removing hazardous materials from and cleaning our city's parks.'",
        "'speaker_2': 'The purpose of this contract is protecting public health for everyone. Protecting public spaces for all of us. And protecting city employees by contracting with hazardous waste management personnel to adequately provide these protections, this very necessary service to the city.'",
        "'speaker_2': 'We ask that you support extending this agreement. Thank you.'",
        "'speaker_0': 'All right. Thank you, Will, for the staff report. And this evening, we had 22 individuals sign up to speak. I want to give folks a reminder. This is a half an hour, 30 minute courtesy, public hearing. And so we will most likely not get through all of the speakers, but we want to give folks an opportunity to'",
        "'speaker_0': 'voice their opinions. But knowing this is a contract and it's either for or against vote, we want to limit duplicative testimony. And so I'm going to call up the first few speakers in person so that we'll go through about five of them and then we'll go ahead and transition online.'",
        "'speaker_0': 'So if we can have a ready to go, our first speaker is Tim Savas and then we will follow with Katie Blakey, Lauren Echo, John Stockton and. You see here. Things will work here. John Stockton. Let me see.'",
        "'speaker_0': 'Oh. And then been done in. All right. We can go ahead, sir, and get started.'",
        "'speaker_2': 'Hello. I'm Tim Sabers. I'm here to support the renewal of the.'",
        "'speaker_5': 'Hazardous.'",
        "'speaker_2': 'Materials contract for the large scale and encumbrance clean ups. These cleanups are critical in and for Denver. They are saving neighborhoods and are creating much needed peace.'",
        "'speaker_5': 'For everyone.'",
        "'speaker_2': 'On those blocks. The hazmat crews that are involved do impressive work and are.'",
        "'speaker_5': 'Crucial for the successful.'",
        "'speaker_2': 'Completion of these cleanups. I would like to commend the police officers, daddy personnel, again, the houseman contractors and all of the other city contractors that perform their work at these clean ups in a consistently professional manner.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Katie Blakey.'",
        "'speaker_3': 'Hello, council members. My name is Katie Blakey. I live in District ten, and I'm asking you to please end this contract with us. Understand that this is a tough topic. So let's break it down a little bit. You have a contract before you with a vendor who over the last three years has habitually failed to adequately provide'",
        "'speaker_3': 'the services for which they're contracted. They're supposed to leave sites of encampments free of hazardous materials and debris after displacement. They leave them filthy. Community members like me, like Headwaters, are forced to clean up after them. They're supposed to provide storage services, but DHS frequently trashes belongings.'",
        "'speaker_3': 'Residents have told them they want to keep her store. By his own admission, and from the data you've seen from DEO, very few people ever recover their belongings. Twice in just the past week and a half, DHS was not even at the storage facility during its hours of operations when someone tried to retrieve their belongings.'",
        "'speaker_3': 'They failed to show up frequently. This violates the legal settlement, opening the city up to further litigation. When they were first awarded the contract as a storage hours were from 12 to 4 p.m. Monday through Friday, a total of 20 hours per week, and the city would be billed for up to 20 security hours per week.'",
        "'speaker_3': 'Now they've changed their hours to 6 to 8:30 a.m. on Monday, Tuesday, Wednesday and Friday and from 12 to 6 p.m. on Thursdays. Though the facility is now only open for 16 hours per week, they charge the city for up to 28 hours of security per week.'",
        "'speaker_3': 'What more does it take to show that DHS has no business partnering with the city? How much incompetence is too much? How many times is too many when it comes to not performing the services contracted? How far can IHS implement creative scheduling to overcharge the city by tens of thousands of dollars before you say enough is enough'",
        "'speaker_3': '? How much litigation are you willing to subject the city to because they can't be bothered to show up? Where do you draw the line? On top of all of that, they're abusive to unhoused residents and frequently get into verbal and sometimes nearly physical altercations with housed residents.'",
        "'speaker_3': 'Why should host who is responsible for solving one of the most urgent crises in our city have to redirect their limited resources to train a private company as employees? It's not the spirits. People talk about getting shitfaced while working or getting fights with the public while they're doing their job.'",
        "'speaker_3': 'This is a failure of leadership, and the city is in no way responsible for remedying that failure. The services outlined in this contract are crucial. And in the case of storage ones, the city is court ordered to provide.'",
        "'speaker_3': 'We need a trustworthy, competent and reliable partner to help the city address one of the most challenging issues it faces. IHS is not that partner. City departments have known about issues with IHS for a long time. You have other options.'",
        "'speaker_3': 'Use the existing regulated hazardous waste contracts with custom, environmental and ajuste until she is able to find a new vendor. If Headwaters Protectors can form in a matter of weeks to provide excellent sanitary waste services, surely you can find a vendor to pay that will do the same.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Lauren Eko.'",
        "'speaker_9': 'Her counsel. I'm here to speak against this resolution. As we've already discussed this previously in the Safety Committee, I mostly wanted to address a sort of strawman argument that the city has put forward against any sort of criticism against this contract, that this is these public health conditions are a problem and that we need to address them'",
        "'speaker_9': '. Nobody is saying that we don't need to address them. In fact, what people have mostly been telling you is that we aren't addressing them, that this is what DHS is doing, is not effectively resolving these hazards in any way.'",
        "'speaker_9': 'The massive amounts of trash and hazardous actually discarded syringes, etc., that have been found by head water protectors and other community members after sweeps demonstrates that they're not even necessarily very effective at cleaning. Out to mention that this contract has been going on for three years now.'",
        "'speaker_9': 'The public health conditions in encampments aren't getting better. If anything, they're getting worse, which seems like ample evidence that this isn't working. And I'm invoke your pain and do three things right. It's cleaning storage and comporting themselves with decency around vulnerable members of our population.'",
        "'speaker_9': 'I mean, the cleaning clearly isn't working. The storage part is laughable. I mean, at the Arc and Sweep last year, which was, I would remind you, the largest sweep in the city's history, displacing 300 people. Exactly. Two people had their belongings stored with the city as a safety committee.'",
        "'speaker_9': 'Your own employees said themselves that almost nobody is ever able to retrieve their property, which the D Hall survey data from last year. There's that out that almost nobody tries and even fewer are able to. Which makes sense, because if you've ever tried, it's a huge pain in the ass.'",
        "'speaker_9': 'I have seen one man attempt to retrieve his property. It took him a week, which he was only able to eventually do because he was able to get a ride from an activist back and forth across town because the storage facility wasn't even reliably accessible during its posted hours, which apparently continues to be the case.'",
        "'speaker_9': 'Nonetheless, DHS is overcharging the city for it, exploiting the four hour minimum payment for its security contractors to apparently charge a lot of money for a service that it's not even effectively providing. And then, I mean, countless people have told you about the egregious disrespect and unprofessional behavior by your employees, which I'm glad that you're attempting to'",
        "'speaker_9': 'address with sensitivity trainings. But it seems extremely naive to think that that will fix this problem because you just doesn't have a staffing problem. The city has created a staffing problem by the job that you have have given them to do is one that positively attracts cruel and callous people as well as unprofessional people.'",
        "'speaker_9': 'Because, you know, those are the only people who are going to be willing to do this job as it's put in place, and particularly the only ones who will be comfortable enough to not burn out doing it, you need to to start addressing these public health issues in a more preventative way by providing trust services and things'",
        "'speaker_9': 'and service boxes, etc..'",
        "'speaker_0': 'Next speaker is John Stockton, followed by Ben Benjamin.'",
        "'speaker_1': 'Hi. My name is John Stanton. I live in Denver, Colorado. I am here to speak against the renewal or the extension of this contract. I was also at the super committee meeting about a week, two weeks ago, and I was curious to hear a lot of people speak with a lot of authority about how the sweeps are'",
        "'speaker_1': 'executed, including city officials that do not actually attend the sweeps. I've been to more than 75 sweeps this year alone, and I document that I show up at between five and 530. So I'm there before many of the city officials, before the city officials, before the mayor's office.'",
        "'speaker_1': 'And the architecture and the culture of the sweep is something that you can't understand until you're there. They can put a very pretty face on it. They can put a very sterile explanation of what they do. But the actual trauma that is inflicted during these sweeps is indescribable, unless you've seen it.'",
        "'speaker_1': 'I know that there's a few council members who have been here at a sweep. I would encourage the rest of you to go down to one. And there was there was two last week. There's going to be another two this week when they describe how you just behaves.'",
        "'speaker_1': 'It is. The most sterile explanation of what they do. In fact, when I arrive at five or 530 is often residents already in distress because the only people on the ground are NHS officials and a single employee. And those groups of people are there every morning.'",
        "'speaker_1': 'They work together. They have a very abusive, almost gang like culture in the way that they act, the way that they address unhoused advocates, the way that they address unhoused residents. And as soon as someone pulls out a camera or as soon as someone shows up with any sort of authority, that changes on a dime.'",
        "'speaker_1': 'But these individuals and this company shows up at 5 a.m. before there's accountability.'",
        "'speaker_2': 'And also in some of the.'",
        "'speaker_1': 'Addendums to this contract, some of the shifts that they say they're going to make improvements upon. I'm very curious where that accountability system is going to come into place. If you have three or four DHS contractors who work with a single DOD employee as their overseer.'",
        "'speaker_1': 'I'm not sure why Adam Abeyta was able to speak so confidently last week, when Adam has only been to one sweep in the last four months versus the single DOT employee who would likely be the contact point of confirmation that the area is clean, that everything is being handled very well.'",
        "'speaker_1': 'The culture of abuse, that the sweep also means that people protect each other's backs. And when you have the same individuals committing the same egregious verbal abuse, physical stealing of objects, destruction of property without any real concern for people's autonomy, they are going to protect one another.'",
        "'speaker_1': 'So some of those fixes in the contract are far too vague. There's far too many loopholes where the same people will be able to sign off and say, Well, you did a good job. You did a good job, wink.'",
        "'speaker_1': 'And that's very worrisome. And the fact that that hasn't been considered shows a real lack of consideration for who this affects. There are up to 1500 unhoused people on the streets every night in Denver. These sweeps have been happening at an incredible rate, 300% stronger, greater than they were happening last year.'",
        "'speaker_1': 'And it is your responsibility to make sure that those vulnerable populations are protected. You have the opportunity to choose a new contractor. It is not the most convenient option. It is not the easiest. It will require more work.'",
        "'speaker_1': 'But that is what you.'",
        "'speaker_2': 'Are here to do. You are here to serve your people regardless of whether they have a home or not. And IHS has not.'",
        "'speaker_1': 'Been doing their job. They have not been fulfilling their contract obligations. And I feel like you also would not if you continue this contract.'",
        "'speaker_0': 'Thank you. Our next speaker is Ben Dunning.'",
        "'speaker_1': 'Hello. My name is Benjamin Denning.'",
        "'speaker_5': 'I've been a resident here in Denver.'",
        "'speaker_1': 'For 55 years since I was three.'",
        "'speaker_5': 'Currently live in five.'",
        "'speaker_1': 'Points.'",
        "'speaker_5': 'And I'm one of the original founders of Denver. Homeless out loud.'",
        "'speaker_2': 'Every week, week in and week out.'",
        "'speaker_1': 'Everyone seems to be complaining.'",
        "'speaker_5': 'About homelessness in front of this.'",
        "'speaker_1': 'Body. The misinformed call them drug addicts and thieves.'",
        "'speaker_2': 'And the truth is, it's not any more so than.'",
        "'speaker_5': 'The lot of us here in this room, the better informed call for solutions.'",
        "'speaker_2': 'Which are often presented with unnecessary roadblocks. Even from this esteemed body, a couple of examples of that are roadblocks that this body has done. In 2019, there were several budget amendments.'",
        "'speaker_1': 'That address the biggest.'",
        "'speaker_2': 'Concerns that our communities have trash removal.'",
        "'speaker_1': 'And.'",
        "'speaker_2': 'Access to bathrooms. And then several other things that could help. This body didn't pass a single one of those last year.'",
        "'speaker_1': 'In addition to those things like that.'",
        "'speaker_2': 'This body did not pass an amendment that could have housed a thousand of the folks that are currently out on the streets. That would made a huge impact standing in the way. Now, tonight, we're talking about renewing a contract with a body that's been, frankly, abusive.'",
        "'speaker_5': 'To our homeless community. So the agencies go out there, they're learning, they're doing better.'",
        "'speaker_2': 'But DHS, it's almost as if they don't care. They want to get away with anything.'",
        "'speaker_1': 'They can make as much money.'",
        "'speaker_5': 'As they can and they do a poor job.'",
        "'speaker_2': 'You've heard examples of that.'",
        "'speaker_1': 'Tonight for examples of them leaving trash behind. The community groups have to clean up. Now, last time we were here talking about this subject, some folks inside the city.'",
        "'speaker_2': 'Told you the process for.'",
        "'speaker_1': 'Getting somebody else in here and what would need to be done. Like John was saying earlier. So I'm going to be easy, but you need.'",
        "'speaker_2': 'To do it.'",
        "'speaker_1': 'Because the damage that these people are causing into people's lives.'",
        "'speaker_2': 'Is going to just it's going to continue to escalate. And at.'",
        "'speaker_1': 'Some point, this body is going to need to not be passive and to just allow things to go along and take serious.'",
        "'speaker_2': 'Action in order.'",
        "'speaker_1': 'To protect our communities. Because by doing this right, we're not only protecting the homeless, but we're protecting people in.'",
        "'speaker_2': 'Houses and.'",
        "'speaker_5': 'In our communities.'",
        "'speaker_2': 'But what happens is you get real estate folks who stand to.'",
        "'speaker_5': 'Profit from this, and they want to put a big wedge into two communities that need to learn how to get there.'",
        "'speaker_1': 'Earlier this evening, you heard real estate agent talk about the financial incentives during.'",
        "'speaker_2': 'General public comment. He described to you how the.'",
        "'speaker_5': 'Finances work and.'",
        "'speaker_1': 'What the motivation is there.'",
        "'speaker_5': 'The number one thing that's going to drop the value on on their properties is visible homelessness.'",
        "'speaker_1': 'And if they call the police.'",
        "'speaker_2': 'And pay off enough.'",
        "'speaker_5': 'Council members or real.'",
        "'speaker_2': 'Estate lobbies or however they do it.'",
        "'speaker_1': 'They can get them timely moved. Like what we did up over there by the Arkin's camp not too long ago in order to make their contract. And then they don't.'",
        "'speaker_5': 'Care because they've already made their sale.'",
        "'speaker_2': 'But that's not what's important.'",
        "'speaker_1': 'What's important is the.'",
        "'speaker_2': 'Health of our community. And because we are.'",
        "'speaker_1': 'Not taking active things to keep these camps from getting dirty, that's.'",
        "'speaker_0': 'The time we have allotted for each speaker. We're going to go ahead and move to our online hearing participants. Our first one is Terry.'",
        "'speaker_3': 'Told the board.'",
        "'speaker_1': 'HILDEBRANDT And I'm a resident small business owner and property owner for over 25 years in the Golden Triangle neighborhood of District ten. I'm asking that you vote to extend the contract the city has with environmental hazmat services. This contractor is essential to the city's efforts to address dangerous, unhealthy homeless encampments.'",
        "'speaker_1': 'The extremely important that we have contractors available to remove hazardous waste such as feces, urine, discarded needles and rotting food. Where would our city be without this essential service provided by environmental hazmat services? Who has the expertize to safely remove these hazards from our streets, restore our sidewalks and public spaces?'",
        "'speaker_1': 'We can't imagine if this was left to an already overloaded city workforce that doesn't have this specialized expertize. I have witnessed encampment cleanups and have found this company doing this difficult job in a respectful, kind, patient and thorough way.'",
        "'speaker_1': 'In the last year and a half, I have witnessed 11 I repeat 11 serious camp mats within two blocks of my home. Many of these had so many needles that we were afraid to even go close for fear of stepping on these needles.'",
        "'speaker_1': 'And we have seen trash. The sidewalks were completely blocked. In the encampment there was right outside my front door. I was able to witness the entire cleanup from my front door. And I am genuinely grateful for Dottie and the environmental hazmat services group.'",
        "'speaker_1': 'I look forward to hearing from you and your support.'",
        "'speaker_0': 'Thank you. Our next speaker online is Matty Hughes.'",
        "'speaker_3': 'Hi. Sorry. Can you hear me?'",
        "'speaker_0': 'Yes. Yes.'",
        "'speaker_3': 'Hello. So I am speaking tonight to urge all of you to please vote no to the renewal of the city's contract with us. And as someone who has attended many sweeps and seen with my own eyes the inhumane way that DHS workers and DPD engage with the unhoused population, I believe it would be a senseless, cruel and'",
        "'speaker_3': 'counterproductive move to renew this contract. I attended the presentation of the survey by D Hall a few weeks ago to City Council, and although I already knew while that the sweeps do not help anyone in the city, if that presentation made it even more clear how detrimental these suites are.'",
        "'speaker_3': 'Safe. Outdoor spaces are an excellent solution. Continue trashing of human beings belongings multiple times a week or not. If you know any people experiencing homelessness in Denver or at all. Sorry, you know how traumatic the sweeps are. People lose essential belongings daily, including their ID, cellphones, wallets, few remaining photos of family and friends, their bikes, blankets, tents'",
        "'speaker_3': ', which are their homes and more. They often have no way of preventing this, as the city is not following the guidelines set by the settlement of the wildfires Denver case. There is not appropriate signage giving notice for the sweeps, and often they do not give the required advance notice at all.'",
        "'speaker_3': 'The sweeps leave behind trash anyway. They should not even be referred to as clean ups. Please watch. Oh, I'm sorry. I'm reading off the email I sent, but I also wanted to say that I think it's also worth noting that the Council president should recuse themselves from voting on contracts that directly benefit a department led by their'",
        "'speaker_3': 'spouse. That's a direct conflict of interest, and it would be disrespectful to their constituents, the whole city, and show a complete lack of integrity and responsibility otherwise. And I also just wanted to say to some of my fellow Denver residents who showed up to speak that it's a harmful and uninformed narrative when they say that people experiencing'",
        "'speaker_3': 'homelessness are leaving needles all over the place. Sometimes they are. But we should note that a lot of those needles are needed for conditions like diabetes. People in homes have the privilege of being able to throw those things away, and the city is simply not providing the trash services that they need to clean up their messes.'",
        "'speaker_3': 'That people want them to do, but it's simply ignorant, uninformed and harmful to continue this narrative that unhoused people are only drug addicts and criminals. There are people going through incredible hardships that we could never understand unless we were going through the same thing.'",
        "'speaker_3': 'And I beg of you, this.'",
        "'speaker_0': 'Time we have a lot of. Our next speaker is Wendy. He sent.'",
        "'speaker_3': 'Her ammo. Nine. Thank you for your service to our city. Every day, Denver residents, businesses and visitors look at the homeless encampments spread out across our once beautiful city, from downtown to neighboring communities, our parks and trails. The trash and hazardous waste from these encampments and neighborhoods on the trails from overnight camping and even in our parks'",
        "'speaker_3': 'after curfew, sweeps have way surpassed any level of order. Our city is full of an unsustainable amount of trash, needles, drug paraphernalia, human feces, urine, gas, propane tanks, rotten.'",
        "'speaker_6': 'Food, etc., etc. causing the spread of disease.'",
        "'speaker_3': 'Infestation of rodents and bugs. Jeopardizing the health and safety of our citizens. Environmental Hazmat Services is a critical contractor.'",
        "'speaker_6': 'That has been professional.'",
        "'speaker_3': 'Conscientious, and provides a service that is absolutely essential in the removal of the hazardous waste associated with these encampments. 83% of us voted against urban camping to begin with, and now we're relying on your leadership to deal with the hazardous waste produced by these encampments.'",
        "'speaker_3': 'Renew this.'",
        "'speaker_6': 'Important.'",
        "'speaker_3': 'Contract to ensure the safety.'",
        "'speaker_6': 'And health of our citizens and our local environment. Where would we be?'",
        "'speaker_3': 'Where would our city be without this essential service provided by us? With the expertize to restore public spaces, we can't have a gap in service or expect an already overloaded city workforce to successfully complete this specialized service. Protein advocates say DHS employees need sensitivity training.'",
        "'speaker_3': 'Really, we are tasking this company with a hazardous and dangerous job. While the protest protesters verbally insult them as they literally cleaning up urine and fecal matter.'",
        "'speaker_6': 'Throw up rotten food, trash and drugs. Thank you to our.'",
        "'speaker_3': 'Police officers for being on location and keeping us and our city workers safe. Know that the majority of citizens of this city support you. Leaders should be redirecting.'",
        "'speaker_6': 'Sensitive sensitivity funds for.'",
        "'speaker_3': 'Training to the citizens of this city living in this film and their mental and physical well-being.'",
        "'speaker_6': 'I have been to several.'",
        "'speaker_3': 'Encampment sweeps and have found IHS doing this difficult job in a respectful.'",
        "'speaker_6': 'Kind, patient.'",
        "'speaker_3': 'And thorough way. Please extend this contract, enforce the camping ban, and.'",
        "'speaker_6': 'Let's eliminate the sweeps altogether.'",
        "'speaker_3': 'Thank you so much for your time.'",
        "'speaker_0': 'Thank you. Our next speaker online is Tess Dougherty.'",
        "'speaker_3': 'For having me tonight, so to speak. I just want to address some of the things that have been said. I've never seen a single person who claims to having been having come to a sweet, bittersweet. Just to start that off.'",
        "'speaker_3': 'These people who keep saying that they come to all these sweeps, I've never seen them there. And there are mutual aid partners that have been there. Also agree that I've talked to them about it. They've not seen them there.'",
        "'speaker_3': 'So that's just curious as to where that claim is coming from. I also want to point out that you notice how every person supporting this contract extension support starts their comment with something like, I'm a long time homeowner, homeowner and resident of district whatever, and I'm a I'm a business owner as well.'",
        "'speaker_3': 'Do you know why they do that? They do that because they think that that saying that qualifying their comment like that somehow gives their voice greater superiority over people experiencing homelessness. People living on the street cannot be here tonight because they're protecting their things.'",
        "'speaker_3': 'The things that could be swept, could be stolen, could be taken from them. That is why we do not have people expressing homelessness here. That is why the contracted hour, I mean, the hours that are open for residents to retrieve their belongings are between 630 and 830.'",
        "'speaker_3': 'When does sweeps happen? That's when they happen. It's absurd. It's so disrespectful. And, you know, just just to also point out, we're not protect we're pro housing. We believe that people should have the autonomy to choose where they live and to do it in a safe manner.'",
        "'speaker_3': 'The shelters are not safe. 37 people came down with COVID at one of the 48 street shelters. One of the 43 shelters kicked out a woman experiencing homelessness and she was found dead in her tent a week later at the edge of the property.'",
        "'speaker_3': 'A Catholic Charities last week. Her name was Carlotta Ross. And so, you know, that is what we are here to say, that we're not protect. We don't think anyone should be living on the streets in a tent. We think they should be given affordable housing that is free of mold and roaches.'",
        "'speaker_3': 'But let's go back to us. When we're talking about expertize, according to their website, self training is all that is required to acquire the licenses that people keep claiming. DHS is the sole company holding these these license needles.'",
        "'speaker_3': 'Give people sharps, boxes, feces, give people bathrooms, trash, have solid waste, pick up and provide services. These are the things that will prevent all of these things that people keep saying that DHS is doing, each as there were 2,000 of trash found and not even even since we had the committee meeting with you guys, they have done'",
        "'speaker_3': 'abusive things. They don't they have no they have no. They're just like they don't care. They they they're doing these things without any remorse, even even after we brought these things to you. So I'm really concerned about the accountability as well, like John was talking about.'",
        "'speaker_3': 'I don't think that there will be accountability. Where's the checklist from Dottie? That was that was so clean. Where is that? You know, where's the checklist? Have you been seen the checklist since you're going to be voting on this?'",
        "'speaker_3': 'And I also think the council president should recuse herself from this vote, given that her husband explicitly said in that in that committee meeting that he was single handedly responsible for the contract with DHS. It's a conflict of interest.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker online is Dave Howard. Right. I thought that we had Dave Howard. All right. Okay. We're going to go ahead and move on then because that was our only they've age online that we have that they're speaking for.'",
        "'speaker_0': 'The item. So I don't believe.'",
        "'speaker_1': 'Excuse me, but I'm asking for.'",
        "'speaker_0': 'All right. We'll go ahead and bring David Hagan up and then we're going to go ahead and ask the rest of the individuals who are in person be ready to come up as well. Shannon Hoffman, Harmonie Cummins, Hannah Sinise are additional people in person.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Thank you for letting me speak. I did put four because I'm for a clean encampment and for a clean city and for not being on the streets. I am not for people screaming white power to indigenous folks. I'm not for the abuse, the stealing of property and the continued treatment that we see at the encampments.'",
        "'speaker_1': 'I'm not for what happened just this last week after the committee meeting. They're still treating people like they're worse than trash. They don't care. And again, the folks on that said that they have been to several encampment sweeps.'",
        "'speaker_1': 'I doubt it. People behind me been to 77 this year, 80 I've been to, I don't know, quite a few more than 11, maybe 20, 30. I've never seen any of them. So when people get up here and lie to extend its contract, another thing we are not saying nobody nobody's clean up.'",
        "'speaker_1': 'We want clean air. We want stuff clean. There are countless other companies in this city that can do the job and do it well. These guys are not good.'",
        "'speaker_2': 'They are terrible at their job.'",
        "'speaker_1': 'Or they just don't care. Maybe they're good elsewhere. They're not good here. And they. They're just not good. Plain and simple. There's got to be somebody else in the city that could do a better job. When, like the lady came up a few weeks ago, said that she wanted to keep the contract, but then she said that'",
        "'speaker_1': 'she had to clean up the encampment with.'",
        "'speaker_0': 'Her friends after they left.'",
        "'speaker_1': 'That doesn't make sense. We're spending millions of dollars. I think this year we've already spent close to $500,000 with them. A half a million dollars already been spent this year. Really?'",
        "'speaker_2': 'To do what? For headquarters to get a bunch of.'",
        "'speaker_1': 'Volunteers to come clean up afterwards, because that's what happens after every sweep. Volunteers kind of clean up. So they get a half million dollars and then we come in and clean up afterwards. I don't I just don't understand what is going on and why this contract is so important for everybody to keep.'",
        "'speaker_1': 'Like, what is it? Whose pocket? I just don't understand, because if anybody else was doing this bad of a job, you would fire them. I can guarantee it. If anybody went to these sweeps and saw this, you would be fired immediately.'",
        "'speaker_1': 'There's no refrain. Reform. They're trash. They're not good. So ask yourself why it is that this contract must be passed to a company that was built in 2017 and then gets a $6 million contract in 2018. That doesn't make any sense to me.'",
        "'speaker_2': 'Established companies get those contracts, not new ones. So who's who's who's behind this?'",
        "'speaker_1': 'Who's behind this? Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker in person is Shannon Hoffman.'",
        "'speaker_3': 'Good evening. My name is Shannon Hoffman. I live in District ten. There is no white supremacy in the future. There is no white supremacy in the future. I say this today because I was recently in a class where this was the writing prompt and it was really hard for me to imagine that statement.'",
        "'speaker_3': 'So I just had to write that sentence several times. And I believe what's happening tonight is that it's really hard for us to imagine not having this VHS contract. But I'm here to tell you, there is no NHS contract in the future.'",
        "'speaker_3': 'Because everyone will be housed and everyone will have access to a bathroom and water to drink and to wash themselves. So that's what we all say we want, right? So how do we get to that future? We start by working now toward the horizon of abolition.'",
        "'speaker_3': 'And you have already done this for almost a year ago. This council turned down a $25 million contract with allied security. You said they have a credibility problem. Does IHS not have a credibility problem? We have outlined for you the multiple ways IHS has been disrespectful in word and action to unhoused neighbors.'",
        "'speaker_3': 'Much like we provided for you a list of incidents of violence from allied security. We are suggesting just don't contract with IHS. They upcharge the city and thus citizens. Just as this chart shows $1.5 million in the past five years with the bulk from Doddy close to 900 K for Sweets.'",
        "'speaker_3': 'This council says, well, IHS is going to do some trainings to improve their behavior. That's what Allied said. They said they'd hire a diversity coaching company and we all said, all of us. We said, that's not good enough.'",
        "'speaker_3': 'Based on their past behavior and another company was hired, can we not do the same thing here? Is it not our duty, your duty to approve contracts when a company meets the standard of the contract? But in this case, DHS does not do what they are contracted to do.'",
        "'speaker_3': 'They leave trash everywhere after a sweep. So what is the difference now in 2021? Is it that less people are watching? Because that by definition is a lack of integrity. So please have the integrity with how you voted on the Allied contract a year ago.'",
        "'speaker_3': 'Use your imagination to dream beyond these circumstances. These same funds and this contract could be repurposed for trash, service and toilets, making the cleanup services of DHS obsolete and actually cheaper. As was mentioned that last year there was a proposal for trash service that would only cost $300,000.'",
        "'speaker_3': 'So we're meeting you all where you are, but we're standing in our integrity. Please vote no on this contract and let's start fresh with a new vendor. Thank you.'",
        "'speaker_0': 'Thank you. Next up, we have Harmony Cummins.'",
        "'speaker_3': 'Hello. Whose job is it? To be sure, contracts are well managed and asked of contractors are providing a quality service for a fair price. To be sure, we are not wasting taxpayer dollars. I think some of you guys got a handout.'",
        "'speaker_3': 'You guys got a handout? Perfect. It just has a practice. They're required to pay their employees a four hour minimum, but they have a practice of scheduling people in two hour shifts. So an example that you've been given on seven two, Tony Martini is scheduled himself from Tell Out the two.'",
        "'speaker_3': 'Then a different guy from 2 to 4, then schedules himself again from 4 to 6. So each of these shifts are now paid 4 hours each. Instead of one person getting paid 6 hours. In addition, the person who's doing the schedule scheduled himself for the first shift and the third shift so that he now makes the 4'",
        "'speaker_3': 'hours on the first and the 4 hours on the second. I wonder why he's doing that. That sounds very advantageous to him. And then I ask, I do accounting. Well, why isn't someone from HHS looking at this and being like, Huh?'",
        "'speaker_3': 'What's going on here? Well, that's because they add a 36% upcharge to what they do. So it's advantageous for them to have these these billing hours be like this because it's more hours for them to add a 36% upcharge on and then to bill it back to the city.'",
        "'speaker_3': 'I spend a lot of time in District one, nine, ten and three, and our city is disgusting, as many people who said that today. And if you guys have walked around on these streets, so if we're doing such a good job with this, why is our sitting so disgusting that we're afraid to go to certain places?'",
        "'speaker_3': 'I know it's a problem for all of us. I've been part of the people who go up and pick up trash after a cleanup has happened. I see a lot of problems with what's happening here. This scheduling issue I described above is for security guards, so this isn't even for anyone picking up the trash.'",
        "'speaker_3': 'So all this scheduling, the upcharge all goes for dollars that don't do a single thing to remove anything, a needle, a piece of trash or feces from the city. At what point do we look? Should we be doing something better?'",
        "'speaker_3': 'It was mentioned that maybe we schedule like this because the work is so traumatic. Well, if the work is so traumatic, shouldn't we be looking at doing something more holistic at a whole? We've talked about bathrooms. We talked about trash services.'",
        "'speaker_3': 'It's each it's actually been and it's a whole lawsuit that the city would provide sharps boxes and some of these things. And we're not doing it. And by definition, by keep doing the same things in the same status quo stuff and expecting a different outcome.'",
        "'speaker_3': 'That's called insanity. So to extend.'",
        "'speaker_6': 'This contract.'",
        "'speaker_3': 'And think that our city is going to be cleaner and things are going to be better. I don't see it. And I hope you don't see it either.'",
        "'speaker_0': 'Thank you. Our last speaker, we have hit the 30 minute courtesy public hearing time. And so we'll go ahead and have our last speaker, Hanna Stein Streisand's. And I might have mispronounced that, HANNAH. So you can correct me when you come up here.'",
        "'speaker_6': 'You were very close.'",
        "'speaker_3': 'Strange. Thank you. Thank you for having me this evening. My name is Hannah. Strange is. And I'm here to urge all of you to vote against extending the contract tonight. Extending this contract as a continued step towards normalizing the dehumanization of our unhoused neighbors.'",
        "'speaker_3': 'In a past forum, testimony has been made specifically about tent poles being snapped by DHS personnel, personal items such as a pair of golf clubs being stolen by US workers in order to put in front of the unhoused person and community while their shelters were being torn down.'",
        "'speaker_3': 'You heard even more this evening. Dehumanization has historically been used as a tool of oppressive classes to build negative public views of social groups to fuel division between communities, as well as wear down the self-respect of those people being targeted.'",
        "'speaker_3': 'As Denver committed to continue to move in this direction, our tax dollars need to be placed towards wellness programs to support and uplift those in need. The treatment of the unhoused community by the city of Denver is getting nowhere.'",
        "'speaker_3': 'The non solutions Denver has implemented are harming our community as a whole. Our entire city suffers while traumatizing behavior continues to be normalized. I urge you to vote against the renewal of this contract and move in a new direction.'",
        "'speaker_3': 'I also urge you to get on the street and meet the people who you are, affect who you have the power to change their lives by changing your decisions. Help them volunteer your time and your perspective will change.'",
        "'speaker_3': 'You have this power in your hands tonight to make us shift toward a healthier, happier city. Please do so. Thank you.'",
        "'speaker_0': 'Thank you. Appreciate the community members who are both joined in-person and online and appreciate the individuals that testified tonight. And we're sorry that we didn't get to hear from anybody, but we had half an hour to make sure that we weren't duplicating folks testimony.'",
        "'speaker_0': 'And so now we want to go ahead and move to questions from members of Council on Council Resolution 92. And we're going to start out with Councilmember.'",
        "'speaker_3': 'Thank you. Council President. I'd like to ask the Department to respond to the second to last speaker regarding the four hour minimums, but the use of two hour shifts by the contractor one has it true to have you fixed it?'",
        "'speaker_3': 'Three Are they? What are we doing about this?'",
        "'speaker_2': 'Thank you, Councilwoman. I believe online is Commander Ron Thomas. If we could have him promoted, I think he can address this question directly.'",
        "'speaker_0': 'All right. I believe we already have him promoted, so. Go ahead, Chief Thomas.'",
        "'speaker_5': 'Good evening. Division Chief Thomas. And to address that question. DHS basically charges. Well. They're paying each officer that works a shift $200 per shift, which is essentially a two and a half hour shift. So they are there working at two and a half hour shift.'",
        "'speaker_5': 'Their place, Sergeant, is scheduling those shifts. He's invoicing the company once a week and then they're paying those officers for basically about two and a half hour shift.'",
        "'speaker_3': 'Thank you, Thomas. First of all, the paper we have in front of us shows a number of two hour shifts, not two and a half hour shifts. And if you can address how it is that. If can you explain where it is that the speaker is is seeing that they are being paid $400 rather than $200.'",
        "'speaker_3': 'For each of their two and half hour to two hour shifts. We have several discrepancies between what you described and what we were given. So I want to understand both of those discrepancies.'",
        "'speaker_5': 'Certainly, I can attest to what I have seen within the last several months that has entered into our 12 staff record, which is our basically our record keeping our record management system relative to two time worked. And those officers are entering a two and a half hour shift generally from 6 to 830 on Monday through Friday, with'",
        "'speaker_5': 'the exception of Thursday, where there's some different shift hours and then four, they're essentially two and a half hour shift, which is entered into our telegraph system. They're being paid $200 through 1099.'",
        "'speaker_3': 'Okay. Okay. I appreciate you are reporting what you have seen. I guess let me just I'm going to ask the speaker who testified on this to come up, please. Can you just share what source of information you use to construct this?'",
        "'speaker_3': 'These are from IHS invoices that have been carried. And so on. The bottom line of the handout that I gave to you, that came straight from an invoice. It says, officers are paid a minimum of 4 hours per shift.'",
        "'speaker_3': 'Okay. Thank you, Mr. Fenton. Has your agency audited or compared the invoices which apparently say something potentially different than what Commander Thomas can see in his system? And it appears we may have a discrepancy. Have you audited to compare the two?'",
        "'speaker_2': 'I know the DPG it for our invoices. I don't know that that it covers the service provided by the officers. I wonder if if you can address that point, you know.'",
        "'speaker_3': 'The question is whether we are paying DHS for the billing that they do to do for off duty officers. Is that what we're clarifying?'",
        "'speaker_1': 'Yes. Perhaps I can have some clarity. My name is Paul, Madame. I'm the manager with public health and Environment. Will is correct. We have not audited those invoices because they're not invoices for services to our department. The invoices that have been displayed recently are for dodgy Department of Transportation infrastructure.'",
        "'speaker_1': 'And so it would be incumbent upon them to review those.'",
        "'speaker_3': 'Is someone from Daddy here.'",
        "'speaker_0': 'And have.'",
        "'speaker_3': 'You reviewed and compared? The NHS invoices to the DPD records.'",
        "'speaker_7': 'Good evening. Council Margaret Melvin, Deputy Manager for Dottie. And. We have not audited those. That is something that we can do. You know, from my understanding, when we review, we do check to make sure that the hours that we requested, you know, this excess only operates at our direction.'",
        "'speaker_7': 'So we do check to make sure that the hours that we requested are indicated in the invoice. But this discrepancy that has been brought up is not something I have looked into. But we will look into it.'",
        "'speaker_3': 'Is someone from IHS here?'",
        "'speaker_2': 'No, but I want to see if I can address this just a little more first.'",
        "'speaker_3': 'Yeah. I mean, if each of us is under the impression that officers have to be paid a minimum of 4 hours per shift and we have a discrepancy, then I'm I just want to be clear. I'm prepared I was prepared to advance this contract tonight.'",
        "'speaker_3': 'But if we have a billing discrepancy and we're going into a new contract where it is not resolved, that is a concern.'",
        "'speaker_1': 'Again. This is Paul Bedard, Public Health and Environment. I had a conversation with environmental hazmat services with the President, Mr. Martin Green, today regarding this topic, and he indicated that it is the policy of the individual police officers under the police union rules when they are acting outside, when they are employed outside of city business.'",
        "'speaker_1': 'This was specifically, as is private contractors, to provide security that that is a standard measure of how their billing is. And so that I think my understanding is the way we're seeing it being billed represents is an artifact of the requirements for employing individuals who are police officers.'",
        "'speaker_3': 'Commander Thomas, are you still with us?'",
        "'speaker_5': 'Yes. Chief Thomas, thank you.'",
        "'speaker_3': 'Is there a separate way that off duty officers are paid that would not show up in your books? That accounts for the fact that your books are showing two and a half hours. But we have now confirmation that the contractor believes they have to pay for a minimum of four.'",
        "'speaker_5': 'No. So what I what I know is that is that the officers put the shift hours that they are actually working in our the staff system. The scheduling officer. Who fills those shifts for, you know, for IHS, sends them an invoice of the officers that have worked their shift and IHS.'",
        "'speaker_5': 'Pays those officers and it comes out to. Essentially $200 this year. For those really 50, it would really be $50 an hour if you were if you were to calculate a four hour shift.'",
        "'speaker_3': 'Paid for for hours, even though they work for two and a half.'",
        "'speaker_5': 'That is a term of employment that's worked out between the scheduler and the employer. Just.'",
        "'speaker_3': 'Okay, so, I mean, but but this is not a bar downtown. I guess. So I guess I am trying to understand why we as a city are paying our own officers to work off duty for more hours than they're actually working.'",
        "'speaker_0': 'If we could ask folks to keep their comments down, it's difficult for us up here to hear the conversation as well.'",
        "'speaker_3': 'And I'll see on the floor after this. But I'm still not understanding why we are paying for time. It's so. It sounds like we are all agreeing that the fee is for 4 hours, even though the work is for two and a half.'",
        "'speaker_3': 'And the question is. Why are we paying for hours that aren't being worked?'",
        "'speaker_2': 'Can I provide some general information that I think will help inform this? And this was a conversation that Paul Bedard and I were having back and forth about this issue. So certainly, please correct me if I'm wrong. And again, this is a little on top of what you're asking for.'",
        "'speaker_2': 'But I think the context this is important because DHS is not required to hire Denver police to provide security. It's an option that they choose to pursue and exercise. Right. And Marty mentioned Martin, the owner of the company who couldn't be here, even though we hoped he could be, because he had an existing personal appointment.'",
        "'speaker_2': 'Medical appointment. That's what he told us. He added that Marty explained that though he is not required to use an off duty Denver officer for security, the storage location and storage site security is required in the contract. These individuals are providing good service.'",
        "'speaker_2': 'These officers are flexible in their work hours of availability and and work for less. Per Marty's estimate, than what he would have to pay a private security service like. They just as for Pinkerton, for example. That's why he's reached out to employ off duty police.'",
        "'speaker_2': 'Continuing regarding cost, the contract only allows us to charge the city $68 an hour for security staff person. And that can be found on line 13 B of the contract rate sheet. I don't know if that's included in your handout, but I'm looking at a at a copy of it.'",
        "'speaker_2': 'And that's what they're charging this city as evidence than their invoices that we confirmed. However, Denver police in their off duty private employment have to observe their labor union rules on minimum number of hours and rates. So for the contract to use these individuals, he has to observe police union labor rules, which have a minimum pay rate'",
        "'speaker_2': 'of $75 an hour. But they and I don't know who that refers to. I don't know if it's union rules or anything else. We're making an exception to that so that these personnel could work with us and meet contract rates.'",
        "'speaker_2': 'Also, DHS said their union rules specified a minimum duration and that duration. So that's why we're seeing a four hour charge versus a two and a half hours actual on site schedule. Lastly, I'll just say that he indicated that this has worked in past years.'",
        "'speaker_2': 'So I just want to be fully transparent and offering that and certainly want to address any questions as best we can.'",
        "'speaker_3': 'But I will see the floor. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Canete. Councilman Cashman.'",
        "'speaker_2': 'Yeah, thank you, Madam President. So I've been really impressed by a couple of things, a bunch of questions for your release in our committee meeting and again today. And one of those things is the people that I've heard testify that would like us to turn this contract down.'",
        "'speaker_2': 'Almost unanimously are saying do the sweeps or the clean ups. But do them completely and do them compassionately. And I've also been impressed that I haven't heard anybody from the city from from Dottie, from DHS say that we didn't leave behind a ton of trash on Arkin's court and that there's a bunch of trash that gets left'",
        "'speaker_2': 'behind as a matter of course. So what I'm wondering is what has the oversight been of the city in the past? Has there been a consistent team assigned to be there evaluating the clean ups? And then how will that be different?'",
        "'speaker_2': 'Moving forward.'",
        "'speaker_7': 'Councilman Cashman. So a lot of the effort of the cleanup has fallen on Daddy to manage. We don't manage every encampment cleanup, but the vast majority do fall on us. In our solid waste team. Do you go out to the site?'",
        "'speaker_7': 'They will direct each other's you know, as we've said, this contract with DHS is really concentrated on the hazardous waste cleanup. Our solid waste team picks up the trash we do if it's needed. We do work with our streets department to bring sweepers.'",
        "'speaker_7': 'Then we work with our waste water department if needed, to bring in our VAC trucks, if, you know, if there is a wet cleanup that we need to do. So the oversight is done by the crew lead generally in solid waste.'",
        "'speaker_7': 'But we also, at the different cleanups, will have representation and oversight. You know, I've been at cleanups. I know Adam goes to clean up.'",
        "'speaker_2': 'I mean, I'm sorry.'",
        "'speaker_7': 'I'm sorry.'",
        "'speaker_2': 'I appreciate I appreciate your answer. But is there an assigned team? I mean, we've heard that DHS gets there first, starts on their own. And I mean, is is there an assigned team of people who regularly there's like a four person team that is assigned to be there all during the cleanup from start to finish.'",
        "'speaker_7': 'So generally there hadn't been. But as the encampments have gotten more prolific, it has really overtaken a lot of our resources. And we do now have a team generally that that, you know, that is not their only job in the city, but we do rely on them heavily.'",
        "'speaker_7': 'And so that is a consistent team and they do have a checklist that they go through. And after the conversations and the input we've gotten, we're adding to the checklist on top of the regular items that they're looking at.'",
        "'speaker_7': 'We are asking them now to take not only before pictures, but we also want after pictures. We do recognize ISIS is not responsible for the final cleanup of the site. That is whichever city agency is taking the lead in, in many of the cases that will be dotty.'",
        "'speaker_7': 'And so that is on us. And so we're going to to make sure that we are improving that checklist so that we all have that after picture. And knowing that sometimes the sweepers, it may take us up to a day to get day to day to to get on to the schedule.'",
        "'speaker_7': 'You know, our sweeper trucks are out. Trucks are already working throughout the city. So that is something that we're going to be adding that we haven't been doing regularly.'",
        "'speaker_2': 'I'm and I'm not an expert in materials, but it concerns me certainly that any trash is left behind. With all the money that we're spending on this and with the need to do what our residents want is to clean the city.'",
        "'speaker_2': 'So I'm wondering, do you know whether it would work or not to take a metal detector to be sure you're not leaving needles behind? That would seem to be a a basic thing. If it's if needles are of the type of material that a metal detector would do, I mean I mean, I expect it to be clean'",
        "'speaker_2': ', to be raked clean, whoever has to do that. And I know that's a big job, but I think that's what our residents want us to do.'",
        "'speaker_7': 'Absolutely.'",
        "'speaker_2': 'And so I've suggested moving forward that it would would make sense to me that we have a. An objective observer team. And I don't know what that looks like, whether it's representatives of council or other agencies, but the administration has has seen fit to not think that's important.'",
        "'speaker_2': 'So I'm just trying to see I mean, we're hearing a lot of concerning things. Like I said, I've heard no denials of it. Incomplete work that's been done. And I've heard no real denials of the insensitive work that's been done.'",
        "'speaker_2': 'So I just want to be sure that I mean, as with my colleague, Councilwoman Canete, you know, I believe these cleanups need to be done. But I believe they need to be done well. And I'm looking for assurance that there's going to be the degree of oversight that's going to be done.'",
        "'speaker_2': 'So how will it moving forward? Is there like a set procedure of eyes that will be on this?'",
        "'speaker_7': 'In short, yes, we are looking at having the checklist. That will be something that we can pull up to look at each cleanup. You know, when I see the cleanups, you know, my expectation is that that area is going to be free of trash, absolutely free of hazardous waste and and if needed, swept or we can actually'",
        "'speaker_7': 'bring our trucks out if we need to do a wet cleanup. So, yes, my I'm working with the team so that we do have that documentation to to show that that is the way we've left the site.'",
        "'speaker_2': 'I appreciate that. And I have two more quick questions now, I'm sure, and for our legislative council. Obviously, the city council has the authority and the ability to approve contracts. Do we have any ability to break conch to end contracts?'",
        "'speaker_2': 'You don't approve it. I mean, if we were. By that, I'm to be clear. If we approve this. There's elements in the contract, as Mr. Fenton has told us, that give the city ability to end the contract. But does city council have the ability to end the contract in midstream?'",
        "'speaker_2': 'Jonathan Griffin W Legislative Council Generally, no. But it would.'",
        "'speaker_1': 'Also depend on the terms of the contract. I've seen the maybe the person who wrote the contract, if they were here, they could speak to it. But typically the contracts are approved. There would have to be something in the clause that was violated.'",
        "'speaker_1': 'It sounds like there are some. But council wouldn't have the power at that point.'",
        "'speaker_2': 'Okay, then. Okay. And my last question is, we also heard if I if I heard the testimony correctly. Of the storage facility not being open during posted hours. And I'm wondering if that if you're able to verify that in either direction.'",
        "'speaker_2': 'And again, moving forward, how do we be sure that it's it's being open. It's open the hours that we are telling the community is going to be open. You. Well, I certainly want to address the storage question, but I also have a little more to add on the structured oversight.'",
        "'speaker_2': 'If that if I can go back to a previous question, if that's okay. I think it's really important to emphasize to this body that, again, DHS is responsible for certain materials and for cleaning cleaning the certain spaces as directed by city personnel, regardless, whichever department that is.'",
        "'speaker_2': 'And included now in the the amended agreement that is shared with you all, there's a section on structured oversight for quality control. And if I could just read a portion of this, maybe already familiar with it. The contractor is required to participate in structured oversight practices implemented by the city agency commanding the services under the agreement.'",
        "'speaker_2': 'The purpose of the oversight is to establish a shared understanding of the task or projected goals document, accept the work completion and create a record of work quality for review. Structured oversight practices may consist of, but are not limited to not limited to the following pre task or pre project tailgate meetings to establish quality goals, share goals'",
        "'speaker_2': ', post task or purpose post project works, worksite inspections, use of checklists or signoff sheets on work completed and photo or video documentation of post project work site conditions. These aren't just commitments of doing things differently. These these are things that we are putting in the contract.'",
        "'speaker_2': 'And not only do we kind of not only are we clarifying what we expect of DHS on the site for these different projects, as you heard from Dottie directly, we also have a responsibility to kind of reset and clarify expectations as a city for each site that we are visiting, whether it's an oil drum doctrinally somewhere or'",
        "'speaker_2': 'for or for these encampments, we have a responsibility and we have the ability to make sure that these these clean ups are backed clean. And that's exactly what we plan to do moving forward. As far as the storage option goes, that is another area where the contract is clear that we.'"
    ]
}