{
    "Ordinance to License and Regulate Alcohol Common Consumption Areas and Entertainment Districts.": [
        "'speaker_5': 'I move that resolution 19 dash 1110 be adopted.'",
        "'speaker_0': 'All right. It has been moved and seconded. Councilwoman Ortega. You have a motion to amend? That is correct. Go ahead with your motion.'",
        "'speaker_2': 'Mr. President, I move to amend Council Bill 1911 ten with the following particulars on page nine, Line 17 Strike sunset and replace with the sunset. Report to City Council on line 18. Strike this and replace with Perin a this after line 18 insert the following Perin be the director shall report in writing to City Council by April'",
        "'speaker_2': '15th of each year, beginning 2021 on the operation of the Entertainment District and the Common Consumption Area Licensing Program.'",
        "'speaker_0': 'Thank you. Councilwoman, it looks like your amendment has been moved and seconded comments by members of Council Councilman Ortega.'",
        "'speaker_2': 'Yes, we discussed this when this bill came to committee, and I guess we didn't. There was discussion about just bringing the amendment forward as opposed to changing it and moving it out of committee with the changes. But what this does is require that reports from the Department of Excise and license are brought back to City Council on'",
        "'speaker_2': 'how this common consumption program is working. It's expected to be a sort of a pilot program for several years, and if there were major problems by seeing the reports, it would allow us to address any of those issues immediately.'",
        "'speaker_2': 'So this basically just requires that report back to city council.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Flynn.'",
        "'speaker_5': 'I guess, was just a point of order. Not on the amendment, if I could. The motion on this was to adopt the resolution. It's actually a council bill. And the motion should have been I move that council bill 19 dash 1110 be ordered published.'",
        "'speaker_0': 'Just to clarify, thank you for the clarification, Madam Secretary. We all all eyes dotted and t's crossed now. Yes. Thank you. All right. Seeing no other comments, Madam Secretary. Roll call on the amendment.'",
        "'speaker_2': 'Ortega I black. I said Abarca, I. Flynn.'",
        "'speaker_5': 'Hi.'",
        "'speaker_2': 'Gilmore. Herndon.'",
        "'speaker_5': 'Hi.'",
        "'speaker_3': 'Hines.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Cashman. Kinney.'",
        "'speaker_9': 'Sandoval.'",
        "'speaker_2': 'Hi. Sawyer, I. Torres Hi Mr. President.'",
        "'speaker_0': 'I am secretary. Please close voting. Announce the results.'",
        "'speaker_3': '13 Eyes.'",
        "'speaker_0': '13 Eyes. 1110 has been amended. And now, unless there are other comments, we're going to go to voting on the bill as amended. So I don't see any other comments. Madam Secretary, roll call on 1110 as amended.'",
        "'speaker_7': 'Black.'",
        "'speaker_2': 'I said, Abarca, I. Flynn.'",
        "'speaker_5': 'Should there be a new motion to Twitter published as amended? Yes. Correct.'",
        "'speaker_2': 'Well, it's.'",
        "'speaker_5': 'Yes. Mr. President I move that council bill 19 dash 1110 be ordered published as amended be ordered published.'",
        "'speaker_0': 'All right. We have a first and a second on that. Madam Secretary, we all good?'",
        "'speaker_2': 'Black. I said Ibaka. I played like Gilmore. I Herndon.'",
        "'speaker_3': 'I hate.'",
        "'speaker_4': 'Cash. What if, Mr. President, if. If we're doing points of order, we have. Whereas already a motion and a second. That motion must be rescinded before we make the new motion. If we're doing Robert's.'",
        "'speaker_0': 'Rules the motion in the second, we're already on the amendment which past we failed to remove before we started voting on the the bill, if I'm correct. So I believe we're okay, but I'm going to check with our.'",
        "'speaker_0': 'Yep, we're all good, but thank you, councilman. Do I get your vote in there? I thank you.'",
        "'speaker_2': 'Cashman. I can reach Ortega. Hi, Sandoval. Hi, Sawyer, I. Torres, I. Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please. Because the voting announced the results.'",
        "'speaker_3': '13 eyes.'"
    ],
    "Establishment of the Office of Climate Action, Sustainability, and Resiliency.": [
        "'speaker_0': '13 eyes. Countable. 1110 has been. Ordered. Published. Published, ordered. Published. Success. Thank you. All right. Madam Secretary, if you please put the next items on our screen and Councilman Flynn, will you please put Bill 805 on the floor?'",
        "'speaker_5': 'As president, I move that council bill 19 805 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. We're gonna go to comments. This is the bill that was originally filed a couple of months ago creating our Office of Climate Action, Sustainability and Resiliency. We have since gone back to the drawing board, started with a new bill which was supposed to be in committee last week, hence why'",
        "'speaker_0': 'this was delayed to today. But we had a snowstorm that canceled our committee, so it will be in committee this week. But this was set to come up today to make sure that we kept the fuel on the fire, to make sure that we got this office created.'",
        "'speaker_0': 'So it will be in committee this week. So I'm asking that we kill this bill now in favor of the new bill, which will be in committee on Wednesday, I believe. Great Councilman Cashman I believe Wednesday. So again, the ask is to for a no vote to kill this bill.'",
        "'speaker_0': 'See no other comments, Madam Secretary, roll call.'",
        "'speaker_2': 'Black? No, said Ibaka. I wouldn't.'",
        "'speaker_5': 'Know.'",
        "'speaker_2': 'Gilmore. No. Herndon.'",
        "'speaker_0': 'No.'",
        "'speaker_3': 'Haynes.'",
        "'speaker_4': 'No.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_5': 'No.'",
        "'speaker_2': 'Kenny Ortega. No. Sandoval.'",
        "'speaker_7': 'No.'",
        "'speaker_2': 'Sawyer.'",
        "'speaker_3': 'No.'",
        "'speaker_2': 'Torres. No. Mr. President.'",
        "'speaker_0': 'No. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_3': '12 nays one.'",
        "'speaker_0': 'I, 12. Nays one. I believe five has failed. That concludes the item must be called out this evening.'",
        "'speaker_8': '1037 Can we ask questions?'",
        "'speaker_0': 'Ten. We have a late breaking one called out. Ten. Madam Secretary, can king put 1037 1037 on our screens? Councilwoman CdeBaca has a question.'"
    ],
    "Approval of 2020 Operating Agreement between the City and County of Denver and Denver Health and Hospital Authority.": [
        "'speaker_8': 'Is there anybody here from Denver Health who can speak to the changes that we had requested in the contract? Councilwoman, were you able to review and see if the the changes were satisfactory? I didn't get an updated contract.'",
        "'speaker_3': 'Yes, they were made between the first committee meeting and the second committee meeting to my satisfaction. And I did review the language and it was, as did the city attorney and felt very comfortable with it. Thank you.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_7': 'John.'",
        "'speaker_0': 'You good?'",
        "'speaker_3': 'Good.'",
        "'speaker_8': 'Oh, there you are.'",
        "'speaker_3': 'Can you can you.'",
        "'speaker_8': 'Awesome. Can you explain the changes that were made?'",
        "'speaker_3': 'So for the changes in regards to what Councilwoman Connie's talked about, I don't have all of the.'",
        "'speaker_10': 'Exact specifics as far as there's supposed to be somebody from.'",
        "'speaker_3': 'CDBG that can speak to you on the exact changes. But I know that they have bent all of the requirements that we.'",
        "'speaker_10': 'Wanted through the.'",
        "'speaker_3': 'Committee discussion.'",
        "'speaker_8': 'So now the there's a mandate in the contract to share information and cooperate when there are investigations.'",
        "'speaker_3': 'So that is a different conversation.'",
        "'speaker_10': 'That's a second conversation outside of the operating agreement was.'",
        "'speaker_8': 'Well, that was part of the contract. It was the information sharing.'",
        "'speaker_3': 'Right. And Councilman can correct me if I'm wrong, but that is the second piece that you guys have been working on with the city attorney as well. So, Matt, Mr. President, go ahead. Thank you. I'm doing this from memory, not from notes.'",
        "'speaker_3': 'So bear with me. And Kirsten can help. But the first issue is regarding if there was a concern regarding staffing, that there would be a procedure by which the the city could communicate that concern. And then the Denver Health and Hospital Authority would have to respond back with an action plan.'",
        "'speaker_3': 'And then if there that was not satisfactory, one of you know, what we call the nuclear option, there was there was not a process by which the and this piece of the contract, which is appendix, there was not a process by which the appendix could be terminated on its own.'",
        "'speaker_3': 'And so we added that process as a worst case scenario piece. There were a couple procedural questions that were asked particular to incidents that we've been briefed on an executive session, and there will be a follow up executive session, I believe, this coming Tuesday.'",
        "'speaker_3': 'And that will include some jail procedural questions as well as questions for Denver health. So but those questions are are not at the level of the contract. They're more at the what happens on the day to day level who talks to a supervisor the term.'",
        "'speaker_8': 'But the termination clause, if they do not cooperate has been added.'",
        "'speaker_3': 'The city has the power to give them notice to terminate, but more importantly, upstream from that there is now a process to share a concern and then to require Denver Health to respond. There were also there was also a change made actually prior to the first committee meeting, which was helpful, which required.'",
        "'speaker_3': 'And so I just want to clarify, all the scenario I just described is when litigation is not occurring, the contract had already had in it a procedure when litigation is occurring. And before we even went to the first committee meeting, they did make a last minute change that required a response to concerns in the litigation scenario.'",
        "'speaker_3': 'So now we have both a process in the litigation scenario as well as this process in the non litigation scenario. And I'm asking if anyone corrects me if I got any of that wrong. And I think the language was really.'",
        "'speaker_10': 'Specific to protect Denver health right in through a current process, but also to give the city the opportunity to say that these services are something that they want to opt out.'",
        "'speaker_8': 'Awesome as long as the pre litigation termination clauses in there. Is it Kirsten?'",
        "'speaker_3': 'Kirsten Crawford Legislative Counsel Yes. All of those things that we discussed were met. Denver Health worked very closely with us on a very short timeframe to get those in there. And we will have an executive session, not this Tuesday, but the following.'",
        "'speaker_3': 'And if we need to explain in detail, I think it would be better to do that next session, but. Awesome. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. That concludes the item she called out. All bills for introduction are ordered, published, and we're now ready for the black vote on resolutions and bills on final consideration. Council members remember that this is a consent or block vote and you will need to vote.'",
        "'speaker_0': 'Otherwise, this is your last chance to call an item out for a separate vote. Councilman Flynn, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_5': 'Yes, Mr. President. As soon as they're up on my screen. Thank you. I move that resolutions be adopted and bills when final consideration be placed upon final consideration and do pass in a block for the following items. All series of 2019.'",
        "'speaker_5': '11. 13. 1071. Ten. 79. Ten. 80. 11. 15. 1147. 1060 1072, 1064 and 1037.'",
        "'speaker_0': 'Thank you. Councilman Flynn has been moved and seconded. Madam Secretary, recalled Black.'",
        "'speaker_3': 'I said Abarca.'",
        "'speaker_0': 'I Flynn.'",
        "'speaker_3': 'I Gillmor. I turned in my hands.'",
        "'speaker_2': 'I cashman.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Cannick and Ortega, I. Sandoval.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Sawyer, I. Torres, I.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting. Announce the results. 1339 As the resolutions have been adopted and the bills have been placed upon final consideration and do pass tonight, there will be a required public hearing on Council Bill 964, changing the zoning classification for 3395 Brighton Boulevard and 3333 Brighton Boulevard.'"
    ],
    "Zoning Change for Properties at 3333 and 3395 Brighton Boulevard in Five Points.": [
        "'speaker_0': 'Council is reconvened we have four public hearings this evening. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses. If you're here to answer questions only when your name is called, come to the podium, state your name, and note that you are available'",
        "'speaker_0': 'for questions of council. Speakers will have 3 minutes. There is no yielding of time on the presentation monitor. On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members.'",
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilman Flynn, will you please put Council Bill 964 on the floor?'",
        "'speaker_5': 'Yes, Mr. President. I move that council bill 19 Dash 964 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and second in the required public hearing for council 964 is open. May we have the staff report?'",
        "'speaker_6': 'Good evening, Council. I'm Brandon Shaver with CPD presenting an official map amendment 433, 33 and 3395 Bratton Boulevard. The request is to rezone from PD 702 to CMCs eight, A01, D7 and CMCs eight. I own DEO seven with waivers.'",
        "'speaker_6': 'The subject property is located in Council District nine in the Five Points neighborhood. Again, the request is for Cemex eight, which is urban center neighborhood context mixed use with a maximum height of eight stories. The applicant is also proposing to include A1, a height, incentive overlay and d07a design overlay, which I will speak to in a few'",
        "'speaker_6': 'slides. The property is approximately 4.7 acres with current industrial and vacant land uses. The purpose of the rezoning with the overlays is to allow for additional height as an incentive in exchange for commitments to benefits, including affordable housing and improved design outcomes.'",
        "'speaker_6': 'The current zoning is Puti G7 you two. That is the billboard use overlay and the surrounding the subject property. There are a mix of industrial and urban center mixed use zone districts ranging from 5 to 12 storeys in maximum height.'",
        "'speaker_6': 'Most of these include the incentive in design overlays that were legislatively mapped in 2017, as the property has customized zoning in the form of a beauty. The overlays were not added legislatively, and then to the northwest of the subject property, you'll notice OSA zoning, which is the future River North Park, currently under construction.'",
        "'speaker_6': 'This PD was established in 2013 with three specific goals. The first was to allow brewing and distilling uses for great divide. These will be carried forward through waivers. The other goals speaking to height and building form standards will no longer be necessary as the design overlay can be applied.'",
        "'speaker_6': 'Current land use is on the site, including industrial and vacant adjacent to the subject property, their mix of industrial office, commercial retail and multi-unit residential uses. The photos to the right of this slide give you a sense of the building, form and scale in the area.'",
        "'speaker_6': 'The subject property is on the bottom right and a new office building across 35th Street is on the upper right. Again, this request is for Cemex eight Urban Center neighborhood context mixed use, maximum height of eight stories and up to 110 feet.'",
        "'speaker_6': 'This zone district has higher build to and transparency requirements as well as street level active use requirements. The zoning is the same as the zoning that's allowed by the current PD, which is based on CMC. The H1 or incentive overlay one allows for incentive heights at this location of up to 12 stories or 150 feet in height'",
        "'speaker_6': 'and requires affordable housing at a rate four times greater than the typical requirement and other community benefits when the buildings exceed face heights. The river north design overlay d of seven increases building form standards for the base CM Zone District, including a 16 foot minimum street level height and increased transparency while requiring street level nonresidential active uses'",
        "'speaker_6': '. The proposed waivers for the sites are for that northern parcel of the subject property where great divide is in operation. These waivers allow for general manufacturing fabrication and assembly use as well as limited outdoor storage. This follows CPD's policy of using waivers as a bridge to a future text amendment.'",
        "'speaker_6': 'You'll see the Blueprint Blueprint. Denver calls for an evaluation of commercial mixed use zone districts such as the CM eight to expand the allowance for hand-crafted manufacturing and maker spaces where compatible the waivers preserve and carry forward the existing title from the Putty.'",
        "'speaker_6': 'Additionally, in this case, the waivers can be used to implement Blueprint Denver's goals on this site before CPD evaluates all commercial mixed use zone districts and authors, a testament to the Denver zoning code speaking to the process, informational notice was sent out in November of last year.'",
        "'speaker_6': 'At this point, the applicant went through a zoned out amendment process and revised the rezoning application. CPD received the revised application in late July and sent notice for planning board on August 19th. Planning Board voted in favor 620 to move this application forward to City Council and then speaking to the public comment as a present, we have'",
        "'speaker_6': 'received nine letters of support. One from the R.A., which is the Rhino Arts District. Two from nearby business owners. And six letters of support from surrounding property owners. Now on to the criteria. There are a number of plans that impact the subject property.'",
        "'speaker_6': 'So please bear with me as I walk through them and remember that you can find greater detail in the staff report. The proposed rezoning is consistent with Plan 2040 as it relates to a number of goals and strategies focused on increasing development of housing units close to transit and mixed use areas.'",
        "'speaker_6': 'Building on a network of well connected, vibrant, mixed use centers and corridors. Encouraging quality infill and focusing housing growth by transit stations. In Blueprint Denver. The subject property is mapped as having a neighborhood context of urban center. These contexts contain high intensity, residential and significant employment areas.'",
        "'speaker_6': 'These areas typically contain a substantial mix of uses with good street activation and connectivity. The future place as identified in Blueprint is a community corridor. These places also have a wide mix of uses, a wide customer base and buildings sited in a distinct linear pattern along the street also have no are future street types with 35th Street'",
        "'speaker_6': 'identified as local and Brighton Boulevard as a mixed use arterial. The proposed rezoning is located within Blueprint Denver's growth strategy for community centers and corridors. We expect these areas to take on 25% of new housing and 20% of new employment by 2040.'",
        "'speaker_6': 'Overall, this request is consistent with Blueprint Denver policies and strategies, as the plan recommends increasing affordable housing in parts of the city with access to transit. The proposed incentive overlay will incentivize affordable housing in exchange for increased height.'",
        "'speaker_6': 'In accordance with Blueprint Denver. Another policy speaks to the need for better design outcomes to ensure active and pedestrian friendly environments along high profile corridors. The proposed design overlay seven will result in exceptional design outcomes consistent with the design vision that was articulated in the 30th and Blake Station area plan process and in accordance with Blueprint Denver'",
        "'speaker_6': '. Therefore, the proposed rezoning from a paddy zone district to a standard Denver zoning code district with an incentive and design overlay is consistent with Blueprint Denver's recommendations. On to housing and inclusive. Denver This was adopted in 2018, and while it was not adopted as a supplement to the comprehensive plan, it can be considered an adopted plan for'",
        "'speaker_6': 'this MAP Amendment review criterion when relevant. This plan includes citywide guidance for using Blueprint, Denver and other partnerships to reduce regulatory barriers to the development of affordable housing and supporting mixed income communities. Some of its recommendations can be applied to individual map ments that propose incentive overlays.'",
        "'speaker_6': 'In this case, the following goals on the screen are applicable. And the River North Plan from 2003 a full a few of the goals and strategies still to be accomplished include rezoning portions of the area to mixed use zone districts.'",
        "'speaker_6': 'While this has been accomplished generally on an area wide basis, the subject property was not included in the Legislative Map amendment because of the existing PUD zoning designation. Other goals in this plan include promoting economic activity in the neighborhood and creating a variety of housing options, including affordable housing.'",
        "'speaker_6': 'The proposed TMX eight zone district, combined with the incentive and design overlays, is consistent with the recommendations in this plan, as it will allow for a mix of residential office and retail uses in a pedestrian friendly form that contributes to the urban fabric of the district.'",
        "'speaker_6': 'The proposed MAP amendment is also consistent with the goals and objectives of the Illyria and Swansea Neighborhoods Plan, as it will allow for a variety of housing options and will offer the opportunity for increasing the employment base in the area.'",
        "'speaker_6': 'In the 30th and Blake Stationery plan. The subject property falls within CBRE, AC, which is mixed use, residential infill and redevelopment. The recommendation for this up area is to increase the populations of residents living near transit through the adaptive reuse of existing buildings or construction of new residential buildings along Brighton Boulevard, creating a residential base around the'",
        "'speaker_6': '36th Street and Brighton node and continuing southwest along Brighton Boulevard towards Senado Market. While the specific building heights reflected in this plan were modified by the 30th and Blake Station area height amendments. This plan does state that maximum building heights should be higher than building height southeast of the railroad tracks.'",
        "'speaker_6': 'Therefore, the request for a mixed use zone district with greater intensity is consistent with the station area plan. In September of 2016, the 30th and Blake Stationery Height Amendments was adopted and this updated each of the three smaller area plans previously mentioned.'",
        "'speaker_6': 'The recommendations in the Building Heights Amendment plan aim to make it clear highlight a clear vision for building height, respond to changing conditions and public investment affecting the station area and surrounding NBCC area, and support appropriate and desired growth patterns, including building form standards and mixed income housing opportunities associated with greater density and height within the overall'",
        "'speaker_6': 'station area. The subject property is mapped as having a base height of eight storeys with a maximum incentive height of 12 storeys. So as part of ongoing efforts to implement the 30th and Blakes stationary height amendments, text and map amendments to the zoning code were implemented, creating the incentive and design overlay zone districts.'",
        "'speaker_6': 'The proposed map amounted to either one will result in the maximum incentive height of 12 storeys applied to the site. Therefore, the proposed rezoning to CMC's eight A01 D of seven is consistent with the 30th and Blake stationary height amendments and all of the adopted plans as amended.'",
        "'speaker_6': 'Steph also finds the requested zoning rezoning meets the next two criteria, as it will result in uniformity of district regulations and will further public health, safety and welfare through incentivizing affordable housing and ensuring enhanced design outcomes as advanced by the two overlays for the discussion of these criteria can be found in the staff report.'",
        "'speaker_6': 'This application describes two change conditions that are justifying circumstances for the rezoning. The first references nearby development and redevelopment throughout the Brighton Boulevard corridor and the station area. Additionally, city, a city adopted plan since the time of the previous rezoning, justifies this rezoning as the PDE was adopted in 2013 and the Height Amendments were adopted in 2016'",
        "'speaker_6': ', which crucial regulatory tools needed to achieve the vision for the area. This plan is a change condition because it was adopted after the current zoning was put in place and the subject property is wanting to include the overlay already mapped on the majority of surrounding properties.'",
        "'speaker_6': 'The proposed rezoning is consistent with the urban center neighborhood contexts that exist in the surrounding area and with the CMC's 801.7 Purpose and Intent statements, which can be found in greater detail in the staff report. Therefore, CPD recommends approval based on finding that all review criteria are met.'",
        "'speaker_6': 'I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you. Thank you very much. We have seven individuals signed up to speak this evening, so we're going to jump right in. First up is Kristy Greer.'",
        "'speaker_3': 'Good evening. My name is Kirstie Greer. I'm here representing Mcwhinney, a co applicant and the subject rezoning request. I'm a Denver resident residing in District one. Mcwhinney is a real estate and development company based in Colorado with 160 associates employed along the front range.'",
        "'speaker_3': 'As a member of the Union Station Alliance, Mcwhinney helped oversee the $54 million redevelopment of Denver Union Station in 2014. Mcwhinney also developed Lotos New Dairy BLOCK Micro District, a progressive experience of local shopping, dining and drinking in a historic downtown block.'",
        "'speaker_3': 'Mcwhinney has been passionate about Denver and developing exceptional real estate here for decades. More recent for us is a growing love of the Rhino neighborhood. We're especially excited about the opportunity at 3333 Brighton Boulevard, the subject of the rezone application before you for a number of reasons.'",
        "'speaker_3': 'First, we found an incredible partner and great divide. Much like Mcwhinney, they're a local company with deep roots in the city of Denver, and they're an important member of the rhino community. Second, we're an enthusiastic participant in the 30th and Blake incentive height overlay area.'",
        "'speaker_3': 'We recently purchased land at 38th and Blake with plans for a development that will utilize height incentives through the provision of onsite affordable housing. Mcwhinney, like the city of Denver, likes to do dense urban, exciting projects near transit and in the path of growth.'",
        "'speaker_3': 'The request to bring the great divide land into conformance with the surrounding zoning is a necessary step in realizing the potential for high density development and affordable housing. Despite the need for a rezoning, we see the site as a straightforward candidate for development.'",
        "'speaker_3': 'It's currently vacant. It's at the center of a long list of future and current development projects. It's adjacent to a future public park and situated in the path of the major improvements made on Brighton Boulevard and is within a ten minute walk to a major transit station.'",
        "'speaker_3': 'Lastly, we've learned that there is community sought support for exceptional placemaking in Reno CBD and others with the city of Denver have recognized the need for density in this plan area and guided us toward a free zone. Our community outreach has resulted so far and positive feedback for the possibilities that the reason could provide, especially with a'",
        "'speaker_3': 'retail focused placemaking developer like Mcwhinney. At this point, we do not have plans meaningfully developed for the site. Our current vision would include a vibrant neighborhood serving ground floor retail district for at least the full length of Right and Boulevard.'",
        "'speaker_3': 'There could be components of both housing and office, but with the zoning uncertain, the use, height and density have have remained unresolved. I would like to thank CPD and Dito, who have helped to answer the important questions raised by members of Luti in the meeting of September 24th.'",
        "'speaker_3': 'We hope that CPD and Dino's efforts in conjunction with the response letter we wrote dated October 30th. Two men, two members of council, have served to answer the questions raised. Thank you for your time and consideration.'",
        "'speaker_0': 'Thank you. Next up, Brian Dunn. Good evening. My name is Brian Dunn. I'm a Denver resident living living in District eight, and I'm the owner of Great Divide Brewing. We're here tonight requesting that the subject property on Brian Boulevard be rezone to CMC D seven in A-1 and with waivers on the existing brewery and taproom to allow'",
        "'speaker_0': 'the continued use of brewing which make our site a mixed use hub of employment and neighborhood activity. In 1994, I started a great divide at 22nd in Arapahoe in the Ballpark neighborhood. In 2012, we searched all over the Denver metro area for additional real estate to expand the brewery.'",
        "'speaker_0': 'Despite the fact that a neighboring community offered to give us five acres.'",
        "'speaker_5': 'For free.'",
        "'speaker_0': 'Or dramatically reduced price. And despite the fact that real estate along Brighton Boulevard was more expensive than any of the other options we looked at, I felt strongly that I wanted to keep great divide in Denver. Ultimately, we decided to purchase approximately 5.1 acres at 35th and Brighton, and we went under contract on the land in the'",
        "'speaker_0': 'summer of 2013. Our intent was to build a production facility and to create a taproom that would serve as a central place for the local community to gather, socialize and enjoy our beer. When we investigated purchasing the site with the intent to redevelop it, CPD directed us to pursue a PD zoning designation.'",
        "'speaker_0': 'This zoning designation was intended to allow the brewing of beer on site without allowing the type of large scale industrial brewing that was disallowed and disfavored by CPD for the Reno neighborhood. The PD was also. The PD also allowed us to build our taproom.'",
        "'speaker_0': 'The party was approved.'",
        "'speaker_5': 'In 2013 and we opened for.'",
        "'speaker_0': 'Business in July of 2015. We were one of the first new businesses to invest and Rhino Brighton Boulevard looked a lot different in 2013, looked a lot different in 2013 than it does now. We initially built on half of the 5.1 acre site and we built what the business needed the most a packaging facility to count our'",
        "'speaker_0': 'beer warehouse offices and a taproom. All along, our intent was to build out the balance of the site into a full brewing facility with a large restaurant and tasting room. However, today we are choosing to sell the vacant land to Mcwhinney because of their successful track record at Union Station and Dairy BLOCK.'",
        "'speaker_0': 'The craft brewing business is very competitive and we no.'",
        "'speaker_5': 'Longer need to build.'",
        "'speaker_0': 'A large brewing facility on the adjacent parking lot. The location of the department dynamic mixed use project next door will drive traffic to Reno and the brewery and help retain our strong employee base, some of whom live in District nine.'",
        "'speaker_0': 'Our property was not able to be included in the 2018 legislative rezoning based on the fact that it was zoned as APD, which was in fact done at the direction and request of CPD. Thank you. Thank you. Next up, Blair Lectern fills.'",
        "'speaker_3': 'Good evening, members of City Council. My name is Blair Elect and I'm a Denver resident residing in District four. I'm here this evening is outside counsel to Mcwhinney in connection with acquisition and rezoning of the subject property. On behalf of the applicant, I'd like to thank CPD for their guidance in helping us.'",
        "'speaker_8': 'Prepare our application and navigate.'",
        "'speaker_3': 'The approval process set forth in the zoning code. Our request for rezoning approval is based on the fact that the rezoning not only meets but exceeds all of the criteria for MAP amendments set forth in the Denver zoning code.'",
        "'speaker_3': 'Facts which are detailed not only in the letter from me on behalf of the applicant, dated August 28, 2019, and provided to each of you by Brandon Shaver via email on November 1st, but also discussed in the staff report presented by CPD this evening.'",
        "'speaker_3': 'One of the key criteria for rezoning approval is the existence of justifying circumstances as discussed in the zoning code and in detail by Brandon this evening. A justifying circumstance exists when, since the date of the approval of the existing zoning, there has been a change to such a degree that the proposed rezoning is actually in the public'",
        "'speaker_3': 'interest. Specifically, the types of changes contemplated by the zoning code include the city's adoption of a plan or change or changing conditions in a particular area. Both of the foregoing justifying circumstances apply to our application. The primary justifying circumstance is City Council's 2016 adoption of the 38th and Blake Stationary Hyde Amendments and the associated legislative rezoning of'",
        "'speaker_3': 'the majority of the nearby properties and rhino great divide was not.'",
        "'speaker_8': 'Asked to opt in to.'",
        "'speaker_3': 'The City Council approved 2018 legislative rezoning, which impacted much of the rhino area and implemented the vision in the 38th and Blake Station area. Hyde Amendments tonight great divide in Mcwhinney are asking that the subject property be zoned to conform to the 38 and Blake Station area height amendments.'",
        "'speaker_3': 'So that is not only consistent with the adopted plan guidance but also treated in the same manner as the other neighboring properties which were able to opt into the 2018 legislative rezoning. Our letter of August 28th, 2019, as well as CPD's staff report, addresses the change in changing conditions in the surrounding neighborhood, which also justify your approval'",
        "'speaker_3': 'of this evening's rezoning. So I won't address those conditions in detail in these remarks. It is important to note two other benefits to the city if council approves the rezoning this evening. First, in addition to implementing the A01 overlay, which allows for increased height in exchange for compliance with increased affordable housing requirements.'",
        "'speaker_3': 'The rezoning also imposes the DE seven design overlay on the subject property. This design overlay provides for enhanced design review over and above the requirements set forth in the existing PDD for any development or redevelopment occurring on the property.'",
        "'speaker_3': 'Secondly, approval of tonight's rezoning will reduce the total amount of customized zoning in the city and in the Reno neighborhood. It will decrease the footprint of the waivers associated with great divides. Existing brewing use.'",
        "'speaker_0': 'I'm sorry, but your time is up. Thank you very much. Next up, Brian Lucky's.'",
        "'speaker_5': 'Good evening. My name is Brian six and I'm here representing the Great Divide as the senior director of finance as well as a board member of the Rhino Business Improvement District. As you're aware, in 2013, we received support to rezone the property to allow for our specific use and were given a loan from the city's Office of'",
        "'speaker_5': 'Economic Development to help acquire the property. Since then, we've created jobs, activated ground floor retail, partnered with the city and neighborhood to carry out the vision of rhino, increase the property and sales tax base of the parcel. We purchased and redeveloped and participated in numerous charitable charitable efforts supporting local causes and organizations.'",
        "'speaker_5': 'I say this to reemphasize the fact that Great Divide has been a great member of the community and committed to the neighborhoods where we reside. Part of the request in front of you this evening is to approve waivers that would continue to support our ability to operate as a regional craft brewery and tasting room.'",
        "'speaker_5': 'The loan reference was part of oldest CDBG program, where businesses are provided funds to help close the project's financing gap and was approved by City Council in 2013. In this case, we were able to use loan proceeds to help acquire land and as a result, expand our operation and create additional jobs in Denver.'",
        "'speaker_5': 'The loan has a repayment obligation and great divide as remitted monthly P.A. payments since the loan funded and it revolves those funds right back out into the community for the benefit of other small businesses, low income housing projects and local nonprofits.'",
        "'speaker_5': 'We will be using a portion of net sale proceeds from the sales transaction with Mcwhinney to pay down the loan balance like the principal and interest payments. The proceeds received by OED will be people back out in the community to spur economic development, create and create additional jobs.'",
        "'speaker_5': 'As active members of the community engaged in public outreach efforts to properly inform the neighborhood of this red zone request. After numerous meetings, presentations and conversations with residents, businesses and property owners alike, we received nothing but support. To date, there has been zero opposition and I believe that is directly correlated with the fact that we are only'",
        "'speaker_5': 'asking for zoning considerations that our neighboring property owners have already been granted via past legislative action. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pearce.'",
        "'speaker_5': 'Good evening, Council. President Members of council. My name is Jesse Paris. I'm representing for Denver Homicide Low Black Star Action Moment for Self-defense, Positive Action for Social Change, Unity Party of Colorado and Universal African People's Organization. Denver Chapter.'",
        "'speaker_5': 'And I'll be your next mayor in 2023. And I ran for city council where large almost 15,000 votes with no money on the surface. This sounds like an awesome idea. I remember coming to these meetings last year about a promenade and rhino.'",
        "'speaker_5': 'Now two US natives that were born and raised here. This is not Rhino, this is East Denver, this is the Eastside. But just for context, we will go with this Rhino North River district. It sounds like you're trying to put another Cherry Creek along Brighton Boulevard.'",
        "'speaker_5': 'So really, who is that to benefit? Because currently we have unhoused neighbors camping right on our gas, caught in fear of being swept. So who is going to really benefit from this business? Developers, transplants, people that just got here, those that can actually afford to live here.'",
        "'speaker_5': 'Where is the guarantee that there's actually going to be affordable housing here? Previous meetings about this overlay, the lowest I heard was 60%. And my area median income recommendations between 60 to 80% and my level. So I want to know for sure, if you pass this tonight and you do decide to build affordable housing on the sites'",
        "'speaker_5': ', what the AMA level for that is actually going to be and not between 30 to 60 or 40 to 80, but actually 0 to 36. We can do better and the priority should be housing, but yet it seems to be more commerce and tourism.'",
        "'speaker_5': 'So I would like somebody to please answer my questions. Thank you.'",
        "'speaker_0': 'Thank you. Next time, Bolduc.'",
        "'speaker_10': 'Good evening, counsel. My name is Table Doc. My husband and I moved our motorcycle shop to Walnut Street in 1999. In addition, I am one of the founding members of the Rhino Bid and a property owner on Walnut Street.'",
        "'speaker_10': 'I've also sat through many of the zoning overlay to me overlay meetings. I am certain that the new zoning was not meant to punish a longstanding business like great divide. I think that like most zoning issues, we aren't always able to take into consideration all of the potential problems that might arise when we pass an overlay.'",
        "'speaker_10': 'I believe, unfortunately great divide has been caught in this crossroads between what was then and what is now. Great Divide has been an integral player in the growth on both Brighton Boulevard and the Rhino Arts District. Their presence has enticed others to follow suit and start businesses on this once empty corridor.'",
        "'speaker_10': 'They also employ several people, contribute to the community and pay substantial taxes. They simply are asking to remain as a business and a neighbor, just like they stepped up and worked with the city to open a business in an underdeveloped neighborhood.'",
        "'speaker_10': 'I urge the city to step up and work with them as they are only asking for something. They already have to keep their business going and the ability to sell their excess property under the new zoning provisions. I don't see how by allowing this sale and allowing the new owners to take advantage of the new overlay that'",
        "'speaker_10': 'they can do anything but add to the vibrancy of the community. As a city, we keep a performing business and we add density to an ever growing Denver population. Voting for this is a win win for everyone involved.'",
        "'speaker_0': 'Thank you. Next up, Jordan Bark.'",
        "'speaker_5': 'Hi. My name's Jordan BLOCK. I'm a District nine resident and neighborhood Kol. I'm also a professional urban designer, so I'm sort of speaking as a resident and a professional. I was asked by a friend from the applicant Mcwhinney if I would consider doing this.'",
        "'speaker_5': 'And you know, I wouldn't consider it unless I saw the project. So I did. I sat down, saw this project, and I was really enthusiastic about what I saw. I traveled through the Brighton corridor all the time. I travel through Denver all the time.'",
        "'speaker_5': 'I'm a Denver native. I know what the city is and what's come from. And one thing that is extremely disheartening for me to see is all the corridors are supposed to be live, community based corridors that are just lined with apartment buildings or other uses that have nothing that is public facing.'",
        "'speaker_5': 'I was really surprised with the level of commitment that Mcwhinney was willing to make towards active use, especially retail on Brighton. But also from what I saw in the drawings I saw was active uses and maybe some retail on the park, which I think is something that you would not get a commitment from from most developers.'",
        "'speaker_5': 'I think that committing to these things and ensuring that not just right now that we have a good sort of public space or public facing amenities on these corridors, but ensuring that we have them as long as these buildings are up, which is generations potentially is really important.'",
        "'speaker_5': 'And on top of that, I think the affordable housing that's coming in the form of the overlay incentive that they're opting to take is really important. I do agree with Mr. Parris that there's obviously larger problems to be solved in the corridor and the community in general, and this might not make a huge dent overall, but it'",
        "'speaker_5': 'is, I think, something that a developer like Mcwhinney has shown that they're willing to commit to and actually do on projects like the one even closer to me at 38th and and Blake right by the station and another project around the city.'",
        "'speaker_5': 'So I want to speak as a professional that I think that's really important to have good quality developers, local developers, commit to good projects and corridors that really need sort of the future foundation for good placemaking and public realm.'",
        "'speaker_5': 'And I think that this project represents that. So I was happy to come in and speak in favor of it. So thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there questions from members of Council on this item council and Central?'",
        "'speaker_7': 'Thank you. Thank you, Mr. President. So you'll have to forgive me. I have a lot of questions tonight, so I will just start with the CPD. And so in 2010 when this got re zoned to the PD it currently is what was the current zoned zoning on this parcel.'",
        "'speaker_6': 'And the city was written in 2013.'",
        "'speaker_3': '2013.'",
        "'speaker_6': 'And I am not sure what the zoning was before the beauty was written.'",
        "'speaker_7': 'So according to the application that I found online in August of 2013, it was SIM Ex eight zone district. So we took a cmcs zoned district and turned it into a PD that has CRM CMCs eight underlining for the forms.'",
        "'speaker_7': 'Is that correct? That's correct. Correct. Hearing that. So in that application in 2013, part of it is the justifying circumstances are the land and its surrounding environments have changed and changing to a degree. So basically a change in circumstance.'",
        "'speaker_7': 'And then tonight we're also using that same justification. So can you explain how in 2013 to 2019 they were using the same justifying circumstance?'",
        "'speaker_6': 'Sure. So I think that it's important to note that that's only a one piece of change or change of condition that's listed in this application. I think that what we are more hang our hat on is the city adopted plan and that since the current zoning went into place in 2013, the city wrote a plan that said'",
        "'speaker_6': 'that we need incentive in design overlays for affordable housing and now this property is wanting to take advantage of those. So that's sort of the justifying circumstance.'",
        "'speaker_7': 'Okay. So then I also have a question that why everyone keeps talking about the fact that this wasn't able to be part of the legislative rezoning that Councilman Brooks did. I've looked at other things. I have other examples.'",
        "'speaker_7': 'How come a PWD cannot be part of a legislative rezoning?'",
        "'speaker_6': 'I'm not sure if it's that. It just can't be included in the legislative over zoning, but I think that it does add to the complexity. So for that reason, when it was done as a blanketed approach, none of the areas that had custom zoning were able to opt into that legislative mapping.'",
        "'speaker_7': 'So none of the areas that had customized zoning opted into that. Two, are you sure about that?'",
        "'speaker_6': 'Yes. And you can see in the map that there's a lot of surrounding properties that still have customized zoning that do not include the overlays.'",
        "'speaker_7': 'Do those other customized earnings have a new pad? Because this this pad's pretty new. The other ones were like the old zoned district. Is this one of the fewer new pads or are there newer pads in that area that didn't opt in?'",
        "'speaker_7': 'I think. Are they old zone districts?'",
        "'speaker_6': 'Yeah, this is probably one of those few newer pads. Okay. Code pads, real time.'",
        "'speaker_7': 'So I have a question for the property owner. When Councilman Brooks was working on the overlay, did he I know he did robust outreach in this neighborhood. Did he come to you and offer you to be part of the legislative rezoning process?'",
        "'speaker_0': 'No, not that I recall.'",
        "'speaker_7': 'Do you remember getting out, having outreach done in that neighborhood? I know you guys were involved in Reno in Overlay, so none of you were at any of those meetings and asked to opt in?'",
        "'speaker_0': 'I wasn't personally, but Brian could probably speak to that better than I can.'",
        "'speaker_5': 'You know, I was just knowledgeable as a board member from the bid, so I was never at any of the outreach meetings, but no one specifically came to us and asked us to opt in.'",
        "'speaker_7': 'And you didn't. Given that you were at those meetings, you didn't ask to opt into the affordable housing incentive overlay or anything?'",
        "'speaker_5': 'Not at that time. As a brewery, we had no aspiration or.'",
        "'speaker_7': 'Okay. So then I have another question for you. So in your testimony, you talk about the OED and how it was a bill to help you close on the land. But actually, it's a community block grant that you got.'",
        "'speaker_7': 'And in that was it was contingent upon the rezoning of this parcel. Do you remember that part of the OED loan that OED actually led the process for you to have to rezone into a customized zone district?'",
        "'speaker_5': 'I do not know. The the loan was completely separate from the rezoning.'",
        "'speaker_7': 'Yes. So it was adopted the same night as the rezoning, according to the Denver. You know, you can go online and you look so in that loan doc that you all signed, it says specifically that it's contingent that you have to get the customized zoning to get the land.'",
        "'speaker_7': 'So you all did that the same night. So you also said that you got the loan to help buy the land. But actually, according to your loan documents, it says that you had to create 29 new permanent low income jobs.'",
        "'speaker_7': 'So do you still have those 29 low, permanent income jobs? And can you talk to me about what entry level they are, how they're paid, and what kind of position that they go to?'",
        "'speaker_5': 'Sure. The use of funds was to acquire land. There was a requirement of the loan agreement to create jobs, and we did create 29 jobs. I don't know the exact percentage, but at least if at least 51% were made available to low to moderate income residents.'",
        "'speaker_5': 'So jobs such as packaging tax. Brewer's logistics.'",
        "'speaker_7': 'And to the east I. How long do people that the average person work for you and can you just tell me a little bit more about your business since the city helped incentivize your business to go along Brighton Boulevard?'",
        "'speaker_5': 'Sure. Our turnover, much like any business, exists, but I'd. I'd say that ours isn't all that great for those jobs specifically. A lot of them are still there. Some are. Some are brand new. They moved on and we rehired and backfilled those positions.'",
        "'speaker_7': 'Okay, Brandon, CPD, I have one more question for you. So in that 2013 application for this, one of the justifying circumstances to go to a PD was that the city is anticipating updates to the Denver zoning code to allow for brewery operations to expand and reinvest themselves within the city and county of Denver.'",
        "'speaker_7': 'And now I hear once again CPD using waivers to me a business where it's at. So my question and I know this is probably way bigger than everyone has a boss, right? And everyone has a plan and everyone has ideas.'",
        "'speaker_7': 'But for me that the fact that this was called out in a PWD in the city doesn't do pwds in 2013 and it's 2019 and we still haven't talked about that text amendment and we're using waivers which is customized rezoning again.'",
        "'speaker_7': 'So this is the exact same parcel that has to type of customizing rezoning. Can you talk to me about the waivers and the and that what blueprint Denver calls out and the waivers for this particular parcel, this corridor?'",
        "'speaker_7': 'And then could you talk to me also about where these waivers also could use for us in Denver? Because it is in my correct in my understanding that a waiver is a bridge to a forthcoming text amendment.'",
        "'speaker_6': 'You're correct. I'll try to break that down first. I think it's important to note that the original PD from 2013 was established not only for those uses that we're going to carry for with the waivers, but it was also for heightened design standards and building form standards.'",
        "'speaker_6': 'So that's why the PD was necessary in 2013. Moving forward to current date and the use of waivers is justified because Blueprint Denver says that we need to look at all of our commercial mixed zoned districts and allow for the kind of manufacturing and handcrafted use.'",
        "'speaker_6': 'And so I don't think that this is the only place in the city that we are looking to explore expanding these kinds of uses. I think that there are other places in the city where we want heightened building forms and but to allow for that makerspace as well.'",
        "'speaker_7': 'So do you mean the high end building forms? So the use for the maker and craft space are those usually in industrial zone districts and they're not in CM Exon district. So what you're what I hear you saying and tell me if I'm right or wrong is that you're trying to marry forms but uses in an industrial'",
        "'speaker_7': 'zone district. So we get form standards that would be in an industrial zone district. Is that what I hear?'",
        "'speaker_6': 'You're absolutely correct. Okay.'",
        "'speaker_7': 'So I have one more question for the the property owner. So. Often times rezonings are contingent or sales of land are contingent upon the rezoning so the sale won't go through. It's usually written up in the agreement. If the rezoning doesn't go through.'",
        "'speaker_7': 'So tonight, if this rezoning were to go to fail, would you would mcwhinney still purchase the land?'",
        "'speaker_3': 'Blair, which involves counsel to mcwhinney. So there is a condition to closing in the purchase agreement that.'",
        "'speaker_8': 'Provides that.'",
        "'speaker_3': 'If the rezoning is not approved, final and appealed and unavailable, mcwhinney has the right to terminate the contract.'",
        "'speaker_7': 'Okay. Thank you. And I have one more question. So sorry. I just lost my chair. Uh, I'll. I'll defer, and then I'll come back up.'",
        "'speaker_0': 'Thank you. Counsel Kelso, I'm sorry.'",
        "'speaker_3': 'Thank you, Mr. President. I just have a couple of questions about the waivers. Was there. I guess I'm a little bit confused because it seems like there wasn't a specific project or you said that there was not a specific project, but then you mentioned that there you had seen a design for a project.'",
        "'speaker_3': 'Is there a project or is there not a project at this time? So there's no project fully designed. What Jordan Bloch and I talked through was what I mentioned in my speech, which was the retail component where retail developers were committed to doing retail.'",
        "'speaker_3': 'So we talk through what our vision could be for Brighton Boulevard and what our vision could be for the forthcoming festival way that fronts the Rhino Park. Okay. That's that's pretty much the extent of it. Got it. And so what what is not the quote unquote project is the affordable housing piece that would potentially be right on'",
        "'speaker_3': 'top of. Right. As I said, you know, it's a big investment and a big commitment to develop plans for one of these projects. So until the zoning is figured out, we've sort of held off on that part of it.'",
        "'speaker_3': 'Okay. So. I totally understand why you're saying that's great. It makes perfect sense to me. But then why are you applying for a waiver requiring no parking when you don't know what affordable housing options you're going to provide that would then you don't know whether you would need parking or not.'",
        "'speaker_3': 'Am I can you can you just explain? Sure.'",
        "'speaker_6': 'You know, the proposed waivers are only for the existing great divide site. So if they were to sell a portion of the land to make money, the waivers do not run with that parcel just with the great divide.'",
        "'speaker_6': 'Pursell.'",
        "'speaker_3': 'Okay. So that's it. So it will separate at that point and got it. So there would be parking required for the separate site if the if this rezoning were to be approved?'",
        "'speaker_6': 'That's correct.'",
        "'speaker_3': 'Great. Thank you. No further questions. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Cashman. Thank you, Mr. President. I'm here to tell the owner. I know we don't.'",
        "'speaker_5': 'We're talking about affordable housing.'",
        "'speaker_0': 'But that only comes into play if you go for the height that's available in the plan as an option.'",
        "'speaker_5': 'How certain should we be.'",
        "'speaker_0': 'That affordable housing might be a part of this?'",
        "'speaker_3': 'So as I said in my speech, we definitely believe in density. We want to do a dense project here. While there's no guarantee we'll take advantage of the incentive height overlay and provide additional and provide affordable housing. That would be our plan.'",
        "'speaker_5': 'Okay. So it's just maybe, maybe, maybe not.'",
        "'speaker_3': 'Right. Okay. It's difficult to say with the uncertainty of the reason, as I said, and our inability to develop plans, we have every intention of taking advantage of the height overlay. But again, there's no guarantee. Sure.'",
        "'speaker_0': 'Thank you. That's all, Mr. President. Thank you, Councilman. Councilman Ortega.'",
        "'speaker_2': 'My question is for someone from the current ownership. Can you tell me if the loan has been paid off? That was obtained from Hawaii to purchase the land.'",
        "'speaker_0': 'Brian can do with that. As a as.'",
        "'speaker_5': 'A finance guy, I do know we pay it every month. So to date, we've paid 387,000 of principal and interest approximately, along with a $10,000 loan processing fee. And as a next Office of Economic Development employee, we hardly ever charge the loan processing fees.'",
        "'speaker_5': 'We got charged and we gladly paid. So that's 397,000. In addition, we have spoke with OED and we will be, if this goes through, will be adding another $350,000 loan pay down. So all in would be 747,000 on $1,000,000 loan taken out in 2013.'",
        "'speaker_2': 'So you would still have an outstanding balance. We would after paying your 350,000 from the sale. So I know typically when the city has been involved and I know this particularly to be more prevalent when we have nonprofits who are involved in purchasing land with city funding, they expect it all to be paid back at the time'",
        "'speaker_2': 'of a sale, or they expect affordable housing to continue where it's a nonprofit that's done housing. And it appears to me that we're using city money to create a windfall opportunity by selling part of the land that was originally acquired for this particular business.'",
        "'speaker_2': 'And when when you're able to sell it at a higher rate, it makes it harder to get affordable housing at a lower EMI scale because the next person coming in and acquiring it is paying a higher value for the land.'",
        "'speaker_2': 'So I guess I'm just trying to understand a little bit more about the the actual commitment of what is being proposed to go there. And I know when you go to the planning department, they probably tell you you don't have to tell city council any of this stuff because they're just dealing with the form of what your'",
        "'speaker_2': ', you know, the scale and the form of what you're you're asking for. But. It's hard for us to know what you know, what the community's going to be dealing with. And I know in this area, as we have seen it completely, you know, it's almost completely built out where we have seen particularly housing.'",
        "'speaker_2': 'And in part of the issue is that we're not mandating the the amount of parking that might otherwise be required because you've got to tod stops close to this area but yet all up and down the the Arkansas coast Arkansas court next to the South Platte River, you've got cars bumper to bumper.'",
        "'speaker_2': 'And I don't know if those are employees, if those are tenants from the housing. And and so I'm struggling with how we address that balance of of what is needed. So I don't know if any of you want to speak to how the need for parking for the business is going to be sufficient.'",
        "'speaker_2': 'I've been to the facility many times for various functions and that lot kind of fills up if you have a bigger a bigger event. So do you feel like that in any way, shape or form is going to compromise the the kinds of.'",
        "'speaker_2': 'Events you might be able to attract if you don't have the kind of parking with with the other part of the land being developed on.'",
        "'speaker_5': 'Well, let me first just say that in regards to the loan and the pay down, yes, there will be a balance, but there will also be a deed of trust still out with the city. So their remaining balance will be securitized against our existing facility, which is the 65,000 square foot property.'",
        "'speaker_5': 'So they will still have a deed of trust. They're doing a partial release in exchange for a pay down of the loan. And again, those funds are able to then get Revolv back out into the community as other CDBG business loans, grants to nonprofits and loans or grants to low income housing projects as far as the parking'",
        "'speaker_5': '. You know, obviously, we have a great partner, Mcwhinney, and we're going to work together to understand what their phasing of their project might look like. But for the foreseeable future, there still will be vacant land that could be used.'",
        "'speaker_5': 'Yes, it's it's owned by them. But I believe that we have the ability to find other parking in the in the district and in the neighborhood, for instance, office space that uses their parking lot during the day, but not in the evening when most of our events would occur.'",
        "'speaker_2': 'Go ahead. And then I just have one last question for CPD.'",
        "'speaker_3': 'Sure. Councilman Ortega, I just wanted to address to two issues that you raised. First, with respect to the amounts of affordable housing, my my colleague Kirsty mentioned this earlier, but as you know, Mcwhinney hasn't really sort of figured out the full development program for the site.'",
        "'speaker_3': 'They're looking at retail, they're looking at residential, they're looking at office, and they're trying to see what is most viable in connection with affordable housing. They will comply with the law that's in effect at the time that they are pursuing their SGP approval and their building permit approvals.'",
        "'speaker_3': 'And so if they elect to build up to the incentive height, they will of course also comply with the incentive overlay requirements. I did want to call out that Mcwhinney, as Kirsty mentioned recently, acquired some property at 30th and Blake they are intending to build up to the incentive height on that particular property and in fact have'",
        "'speaker_3': 'agreed to provide affordable housing units above and beyond what is actually required by the city under the incentive overlay. And as it relates to parking, I think it's somewhat of a similar answer in the sense that they will have to evaluate the program and understand what their ultimate users are and how that interfaces with the neighborhood and'",
        "'speaker_3': 'how, you know, the parking analysis will work in terms of the dose of an overlay and what is required. So that's a little bit of a TBD, but obviously we're sensitive to parking and need, you know, need to build a project that works for our end users, tenants, etc..'",
        "'speaker_2': 'So one last question for CPD. So assuming that this all goes through, they sell it, mcwhinney buys it and they're going to max out the the density of what they could do on the site. Who determines what the EMI scales are for affordability on the project?'",
        "'speaker_6': 'Ditto controls oped housing stability, Department of Housing Stability now and then as host.'",
        "'speaker_2': 'And do we have anything that is standardized or is it all done on a case by case basis? Please.'",
        "'speaker_3': 'I don't see.'",
        "'speaker_0': 'Our partners from host here tonight. So yeah so.'",
        "'speaker_5': 'I'm kind of part of a community planning in development. The incentive overlay in order to take advantage of it, you are required to follow the Chapter 27 housing.'",
        "'speaker_0': 'Rules as they relate to the incentive overlay those rules required. Then Dito now the Department of Housing.'",
        "'speaker_5': 'Instability to adopt a rules and regulations that set forth how.'",
        "'speaker_0': 'You comply with that and provide plans for how you can what level affordability as you can achieve and you're required to achieve and all the rest. So they are set forth both in chapter 27 and in rules and regs adopted by now.'",
        "'speaker_2': 'Host So do we have those rules and regs in place?'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_0': 'Councilor.'",
        "'speaker_3': 'And can I send a lifeline?'",
        "'speaker_0': 'Looks like she has an answer to the question. You are jumping?'",
        "'speaker_3': 'Yeah. The way the ordinance was adopted, the default and my level is currently 80% of am I. What happens is that if you do, there's there's two there's three options. Under the standard ordinance rate, you pay the fee you build on site, or you do a build alternative plan, which can include a different number of units or'",
        "'speaker_3': 'a different set of images. And so there is the potential to negotiate an agreement to provide a different set of images. And for example, that's the plan that was used at River Mile, where the developer decided to do a difference, entered into a negotiation with the city to negotiate different levels.'",
        "'speaker_3': 'But if you take the automatic trade, the height for the affordability, then it will be at 80% of AMI. There are some, some, some, some, some ways that they can talk about bedroom sizes and army levels and alternatives.'",
        "'speaker_3': 'But but I will just say to I don't know if you want to speak to the study, but there is a CPD hosted study that's going out right now to examine whether or not those army levels should change or the build formula should change.'",
        "'speaker_3': 'And so that's for the base zoning as well as for future incentive overlays. So there's I don't know that we can say for sure in the future that it will always be this level because the study is intended to look at that.'",
        "'speaker_3': 'So I don't know if confirm if. That's right. Sure.'",
        "'speaker_5': 'Yeah, no, that's right.'",
        "'speaker_0': 'So the zoning just refers to the housing is the housing is easier to change over time and react and respond. So what I would agree with what was said earlier, they'll be was.'",
        "'speaker_5': 'They'll be held to whatever requirements are in place at the time.'",
        "'speaker_0': 'That they develop.'",
        "'speaker_2': 'And when is that study expected to be completed? Any idea? 18 months. Okay. All right. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman and Councilwoman CdeBaca.'",
        "'speaker_8': 'Thank you, Mr. President. This question is.'",
        "'speaker_3': 'For.'",
        "'speaker_8': 'The owner. It sounds like we have some processes that are going on right now. We're waiting for a potential text amendment. We've got the the incentive overlay study going on. And you guys don't have a plan yet and a sale hasn't happened yet.'",
        "'speaker_8': 'So there sounds like there's some things going on with you all, too. What is the rush? Why not create the plan and then come back to zoning? Why not have the transaction completed? Figure out your plan and come back to us with your plan.'",
        "'speaker_3': 'Sure. Thank you for your question, Councilman CdeBaca. I think that the issue is that in order for Mcwhinney to develop a plan, they have to engage engineers, architects, etc. And there's a great deal of cost associated with coming up with those plans.'",
        "'speaker_3': 'And they don't want to develop the plans until they know sort of what the base zoning is, so they know what they're designing to.'",
        "'speaker_8': 'So I'm really concerned about this one because I love Union Station, but it's not a place that we can go all the time because it's very expensive. The placemaking element of it was not designed to be affordable, and I don't recall when I was doing my research.'",
        "'speaker_8': 'Any other projects that you've done affordable housing on? And so I'm, I'm hearing 38 them. Blake But that's not complete yet, right? It's not.'",
        "'speaker_3': 'So 38 and Blake, they are in the process of getting an approved site development plan. They're very close and they'll move forward to with the balance of the process, which I believe is building permits and whatnot. But the site development plan and the BAP that we're working out with DOE requires us to build a certain number of'",
        "'speaker_3': 'residential units on that particular project. And as I mentioned, Mcwhinney has voluntarily elected to build affordable units in excess of the number required by the city to get the incentive high.'",
        "'speaker_8': 'And are you guys going to go all the use the whole incentive, or do you plan to use part of the incentive because that drastically changes how many units we get that are affordable. And the affordable is at the 80%.'",
        "'speaker_3': 'Are you talking about this 34th thing? Yeah. Brighten the.'",
        "'speaker_8': 'Subject? No. Well, what are you guys doing on Blake? Because that's a great indicator of what you'll do here.'",
        "'speaker_3': 'Yeah, I can say. Yeah. So our current plans that are in for review for STP contemplate 17 stories. So that's taking full advantage of the height overlay and the design overlay. The BAP form calculates your number of affordable housing units based on gross square foot.'",
        "'speaker_3': 'So the bigger your building, the more affordable units you have to provide. So we made the building as big as we could and the the BAP form which is generated by DITO and given to us and we fill it out and it tells you your number of units was based on that.'",
        "'speaker_8': 'And how many units is that.'",
        "'speaker_3': 'The form calculated? 19.'",
        "'speaker_8': 'Out of how many total?'",
        "'speaker_3': '348. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. When I first looked at this, I thought, this is a slam dunk. There's no one against it. And yet here we are still talking about it. So I am I am starting to be concerned, frankly, and just the the lack of a plan for immediate development.'",
        "'speaker_4': 'I think you have a reasonable explanation. But I also that there you're using public funds and not fully repaying the public funds. And then I've been looking up the actual location where the great divide is. Would I have someone from the Great Divide come forward for a second?'",
        "'speaker_4': 'How wide are your sidewalks on Brighton in front of the Great Divide?'",
        "'speaker_0': 'Whatever the city made us there asks us to do well and remember. And we go ahead.'",
        "'speaker_5': 'We go.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_5': 'That was part of the area where the Brighton Boulevard capital investment took place. And so we put in a temporary condition because we were ahead of that construction. But the city allowed us to do that because knowing that construction was right on our heels to build that out.'",
        "'speaker_5': 'And that was part of the capital improvement project along Brighton Boulevard that both the city and the property owners as part of the General Improvement District supported financially.'",
        "'speaker_4': 'So there are sections and immediately in front of great divide where there are those columns, those decorative columns where the sidewalk is narrower than four feet wide. Is that correct?'",
        "'speaker_5': 'I don't know exactly, but it is narrower. Yes.'",
        "'speaker_4': 'Yeah. Okay. So I actually was part of a an article that was in one of the local publications. There's someone here in the room who edited that article. And that area actually isn't four feet wide. And now I'm concerned that Dito is using public funds.'",
        "'speaker_4': 'We had a public improvement project and we didn't follow ADA standards. I, I just assumed that that was privately funded. So now I have concerns about what are we doing with this new development that's, that's backed by a great divide.'",
        "'speaker_4': 'So I'm not sure exactly where I want to go with this, but but I you know, if if we don't know exactly what we plan to do with the neighboring section, I just I just want to understand, you know, are are we working with an organization that will.'",
        "'speaker_4': 'Follow the rules and make sure that I mean, we wanted Britain to be a corridor that's accessible for everyone. And and so I'm somewhat frustrated with Britain because it is not accessible for pedestrians and I use a wheelchair for my body.'",
        "'speaker_4': 'That's a pretty important mobility feature for me. Just. And thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Sandoval, did you still a question?'",
        "'speaker_7': 'I did. I found it. Sorry about that, Councilman. Mr. President. So to the owner or mcwhinney whoever couldn't take this one, why are both parcels being re zoned? Why was not? Why is the brewery not just staying in the party and the other part going to see Max?'",
        "'speaker_3': 'Because we were instructed to do it this way by CPD.'",
        "'speaker_7': 'The CPD gives you told you that you had to rezone both properties.'",
        "'speaker_3': 'Yes.'",
        "'speaker_7': 'Can I ask Brandon? That is that is so this is not to take us back a couple weeks ago with this seems like a consistent thing that CPD keeps pushing property owners into zoned districts. And in my six and a half years here, I have not heard CPD do that.'",
        "'speaker_7': 'So did you guys recommend that they had to do this? Is it like based on parcel size, acreage size? Like what was why?'",
        "'speaker_6': 'Oh, I don't know if I would say that CPD directed them to that. It is CPD's practice to limit the use of custom zoning. So where we saw an opportunity to take away APD and replace it with waivers that were specific to that site and then resume the other piece to a standard zoned district, I think that'",
        "'speaker_6': 'was the thinking on our behalf.'",
        "'speaker_7': 'Tried to get at a customized zoned zoning. So the only I have one question following up, but there still is customized zoning with the with the waivers. Right. So we're not eliminating all customized zoning on this property. There still will be customized zoning because of the waivers.'",
        "'speaker_6': 'There's customized zoning that would move forward to allow great divide to continue its current operation. Yes.'",
        "'speaker_7': 'Okay. That's it. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. All right. So no other questions. The public hearing for Council Bill 964 is closed. Comments by members of Council Councilwoman said about you, this one's in your district. Did you want to comment first?'",
        "'speaker_8': 'CHAIR Thank you, Mr. President. I am very concerned about this one, and I've been concerned since you all came to committee. I don't think that this is an appropriate shift, especially without a plan. I think that the sale of the parcel that was used or that was bought with city dollars feels inappropriate.'",
        "'speaker_8': 'It doesn't feel different than profiting off of a subsidized home. And so I am not supportive of this tonight and I hope my colleagues will follow. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Sandoval.'",
        "'speaker_7': 'Thank you, Mr. President. So this one is a little bit close to home because I used to work for Councilman Monteiro and I worked on this Peabody, so I knew the justifying circumstances. In 2013, I saw more agencies working together to get this property, this catalytic property on Brighton Boulevard, and that we needed to advance the Brighton'",
        "'speaker_7': 'Boulevard with the DCC. So we had in DCC, we had already we had Parks and Rec, we had public works and we had CPD at the table. And in six and a half years I have never had that many agencies talking about a rezoning.'",
        "'speaker_7': 'So for me, I don't feel like there's enough justifying circumstances that the landscape has changed enough to justify going back to a zone district that was formed in 2010. So when the city and county of Denver updated our whole entire zoning, we had the opportunity.'",
        "'speaker_7': 'It was a five year robust process. There was tons of outreach and there are parcels in northwest Denver that do not have updated zoning that are called Chapter 59, part of the old zoning. And in northwest Denver, I have had the need to use customized zoning to save some of our historic properties and historic structures.'",
        "'speaker_7': 'And we have not been allowed to use customary zoning. We've had properties in northwest Denver that needed OED dollars to make sure that we had robust commercial zones. And we have not have been granted OED dollars. We have not been granted OED dollars based upon contingent upon a rezoning.'",
        "'speaker_7': 'So for me, this one seems like there's a lot of city investment, which there is if you look at buy in Boulevard and the mayor's budget since the North Denver Cornerstone Collaborative was started, this area has received more capital improvement and more money than any other area in Denver.'",
        "'speaker_7': 'And I'm thankful for that. I think it's redeveloped. I don't agree with. Everything. But tonight, I just do not feel that this rezoning meets the criteria that you all are basing it on. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I think that there are a lot of balls up in the air. We don't have a specific project in mind right now. It looks like we're thinking about doing some rezoning as well. And just to be consistent with if we're if we want to make sure that we, you know, with our budget discussion'",
        "'speaker_4': 'earlier tonight, if we're going to have I mean, if we're going to think things through before we greenlight things, I think this is a number another opportunity for us to think things through. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Hines. Councilman Black.'",
        "'speaker_7': 'Thank you, Mr. President. I will be supporting this. It does meet the.'",
        "'speaker_3': 'Criteria, and.'",
        "'speaker_7': 'It is not within.'",
        "'speaker_8': 'Our law that you really you provide us with the plan.'",
        "'speaker_7': 'And I understand why you don't have one without having the zoning redone. It's a priority for this council and for our administration that we get more affordable housing, which is why we have these incentive overlays, especially in this area.'",
        "'speaker_7': 'And I see Chris Nevitt back there, our Tweedy director, and I know it's it's very important to him and the people he works with in CPD and our DITO Department that we get affordable housing in this area. So I'm excited about the sense of overlay.'",
        "'speaker_7': 'I know the city spent a lot of resources creating that and I will be supporting it. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Black. Seeing no other comments this evening. I'll just add that I agree with Councilwoman Black that this application has met the legal criteria for rezoning. I think some more discussion and the discussion that we continue having is about what we're presented in front of us when we're making these decisions.'",
        "'speaker_0': 'And I think that warrants us continuing to look at how that can be different. But it is not right now. And I think as demonstrated in the staff report, this meets the legal criteria for a rezoning. So I will be supporting it tonight.'",
        "'speaker_0': 'Madam Secretary.'",
        "'speaker_2': 'Raquel CdeBaca. No Black.'",
        "'speaker_7': 'Eye.'",
        "'speaker_5': 'When I.'",
        "'speaker_3': 'Gillmor I.'",
        "'speaker_0': 'Herndon High.'",
        "'speaker_4': 'Hines Ney.'",
        "'speaker_2': 'Cashman High. Kenny Ortega Reluctantly.'",
        "'speaker_7': 'Sandoval No.'",
        "'speaker_3': 'Sawyer No.'",
        "'speaker_2': 'Tourists? No. Mr. President.'",
        "'speaker_0': 'Right. Madam Secretary, please close voting and notes results in 12. Go.'",
        "'speaker_2': 'Eight eyes, five.'",
        "'speaker_0': 'Nest, eight eyes, five needs constable 964 has passed. Desmond Flynn, will you please put Counsel Bill 1967 on the floor?'"
    ],
    "Zoning Change for 18300 East 66th Avenue in DIA.": [
        "'speaker_5': 'Yes, Mr. President. I move the council bill 967 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you, Councilman. It has been moved and seconded. The required public hearing for Council Bill 964 is open. May we have the staff report?'",
        "'speaker_2': 'Jerusalem. Sara with community planning and development. This is another map amendment. Located at 18300 East 66th Avenue. The request is to rezone from a former Chapter 59 Zone District, CMU 20 with waivers and conditions. Air which is the airport overlay to suburban context.'",
        "'speaker_2': 'Community Community Corridor I'm sorry commercial corridor five stories air which is the airport overlay and I'm you aren't seeing and I have no.'",
        "'speaker_0': 'Reference to technical difficulties on the display here.'",
        "'speaker_2': 'Arrow so I'm going to use. So this is in city. Are you not seeing us? No.'",
        "'speaker_0': 'We have it in our system. But we're seeing this in the years. You know.'",
        "'speaker_2': 'The public seeing it, though?'",
        "'speaker_7': 'I don't think so.'",
        "'speaker_2': 'Maybe it will wait. So maybe here. Does that help, huh?'",
        "'speaker_0': 'Here we go. Thank you.'",
        "'speaker_2': 'Okay, so, city, this is in Council District 11 in the DIA neighborhood. Again, the request is to rezone to suburban commercial corridor five stories with an airport overlay, and the only building form allowed would be a general building form.'",
        "'speaker_2': 'And the airport overlay. I don't know if you're familiar with, but does accommodate airport operations and impacts to surrounding properties. So the existing zoning again is a Chapter 59 zone district with waivers and conditions and waivers and conditions.'",
        "'speaker_2': 'You have a copy of that ordinance in your staff report, but most of them are related to airport operations and impacts to surrounding properties. So the subject property again CAMUTO with waivers and conditions. To the north and east and west.'",
        "'speaker_2': 'The same zone district to the south is CMU ten. Another Chapter 59 zone district with similar waivers and conditions and the airport overlay. So a lot of vacant land in this area currently is property is vacant. To the north is a hotel and to the southeast is a new 7-Eleven that isn't even showing up on this map'",
        "'speaker_2': '. South and west vacant. And on this map, you do see the 7-Eleven down in the corner here. So. That's what it looks like out in this area. The pictures also show you very much vacant. There is that, again, a hotel to the north and to the southeast, a new 7-Eleven.'",
        "'speaker_2': 'So informational notice on this went out in June of this year. Planning Board Notice was posted for a August hearing. At that hearing, there was unanimous support for this rezoning. And then we were at Liberty in September, and it was passed on to the full council.'",
        "'speaker_2': 'And we are here tonight with a properly notified public hearing. So there are several RINO's in the area, but no one has written in a letter, a comment letter, no R.A. letters and no other public comments. So, you know, the criteria, the plans that apply our current plan, 2040 Blueprint, Denver 2019 and the New Far Northeast Area'",
        "'speaker_2': 'Plan, the same year this year, 2019. So there is support for this in plan 2040 to build a network of well connected, mixed use centers and corridors to facilitate growth of a diverse business sector, to support our airport as the gateway to Denver and the world, and to promote infill development where infrastructure and services are already in'",
        "'speaker_2': 'place. The Blueprint. Denver The future context is suburban, as we said earlier. Single family, multi-family, residential on commercial corridors and centers, a mixture of land uses generally curvilinear streets. Although in the Gateway area or this area, the air area, we are actually getting some grade streets.'",
        "'speaker_2': 'So that's a good thing. And then of course, the DIA overlay future please type in Blueprint. Denver is community center, which is a mix of office, commercial, residential and different varying scales large to small. And then again that I o which is the overlay and a recommended height of five stories.'",
        "'speaker_2': 'Street classifications for 66th Avenue is an underserved needed local Yampa Street to the west is a commercial corridor and then tower half a street. Half a block to the east is a commercial arterial. Future Growth Strategy from Blueprint.'",
        "'speaker_2': 'Denver is community centers and corridors anticipated to see 25% of new housing growth and 20% of new employment growth. Far Northeast Area Plan again suburban suburban context which speaks to commercial development focused along main corridors and centers. Community Corridor Future Place, which is a mix of retail, food, beverage, entertainment, hospital, hospitality and office uses and oriented along'",
        "'speaker_2': 'streets. Far northeast area plan growth strategy is the same community centers and corridors with most growth going to greenfield areas and existing community centers and corridors such as Tower Road maximum recommended height in far northeast area plan is eight stories and the DIA neighborhood corridors are are seen to be on major through streets and major at major'",
        "'speaker_2': 'intersections. There is also a GDP for the area that is a 2000 to document. That speaks it's a very simple two or three page GDP speaks to development of the CMU 20 mixed use zone district two. Those standards, which are very similar to our SCC five that's being proposed with that staff, believes this is consistent with our'",
        "'speaker_2': 'adopted plans that we are by using a standard zoned district, we're furthering the uniform application of our zone district city wide by allowing new development on vacant property that's consistent with our desired character. As described in our adopted plans, we're furthering the public health, safety and welfare justifying circumstances changed conditions.'",
        "'speaker_2': 'We are zoning out of a Chapter 59 zone district. We have three new plans with new direction for this area. So staff believes change conditions is a correct justifying circumstance. And then we did already discuss a little bit about this being consistent with the suburban context and the intent of the CC Zone district for our corridors.'",
        "'speaker_2': 'With that Stafford. Approval.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening. First up is Mark Throckmorton. Of the four of you, if you could just come up to the microphone, introduce yourself and just say that you're here for questions.'",
        "'speaker_0': 'Mark Throckmorton with Elsie, full and whiner representing the landowner, and I'll defer for questions. Thank you. Next up, Jesse Pearce.'",
        "'speaker_5': 'Good evening. Members of Council Council President Clark. My name is just Paris. I'm representing for Denver Homicide Lao Black Star Action Movement for Self-defense Positive Action Commissioned for Social Change, Unity Party of Colorado and the Universe of African Peoples Organization.'",
        "'speaker_5': 'Denver Chapter. We are neither for or against this. I really want to know exactly what the army level is going to be for the housing proposals house and that is going to be in this area. I was just out in this area recently, about a couple of months ago, and I seen rapid development going on.'",
        "'speaker_5': 'It looks like this is going to become another Denver Tech Center. This would be Texas in our number two because we have Panasonic and other tech companies out there as well. So I would like to know what the AMA level is going to be for the proposed House in this area and exactly who is going to occupy'",
        "'speaker_5': 'this space. Thank you.'",
        "'speaker_0': 'Thank you. Next up for both.'",
        "'speaker_5': 'Good evening, Council President and Council Member Thanks for having this. Ferdinando 725 17th Street, Denver, Colorado. I am president of LC Film and Writer Inc the landowner and the applicant. I think I'll just keep this very simple. We were in the old zoning code and we're looking at flexibility uses and SCC seems to be the best rate'",
        "'speaker_5': 'along town road and commercial corridor. And over time we will probably come in with other land to try to get out of the old zoning code into the new code. So marker or I are here for any questions.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you very much. That concludes our speakers on this item. Are there questions from members of council?'",
        "'speaker_2': 'Councilman Ortega offered, if you wouldn't mind, coming back up. So where is this in proximity to the the development that is closer to the transit stop?'",
        "'speaker_5': 'So it's about just over a mile north, probably a mile and a quarter north. It is a long tower road. Long tower road. We're experiencing more auto and type uses. And right around the rail stop, we're saving that for more dense uses.'",
        "'speaker_5': 'We have a hotel that's going to be opening soon and we're working with additional users to have a densify closer to the rail shop.'",
        "'speaker_2': 'Any idea on what percentage of housing might be included in this proposed site?'",
        "'speaker_5': 'According to the airport overlay district, we cannot have any housing north of 64th Street, so we will know.'",
        "'speaker_2': 'That was going to be my next question about the noise contour. Yeah, I'm looking at this contour map right here. And so I was just trying to understand this map is not showing me the actual street grid of where the southernmost part of the noise contour is.'",
        "'speaker_2': 'That and I know we've already encroached into that with the development that is part of the 64th and pioneer area. So so this will not and cannot have any housing at all, is what you're saying?'",
        "'speaker_5': 'Correct. There's no no housing north of 64th on our land and there's no single family housing north of 56. And this being north of 64, there will be no housing.'",
        "'speaker_2': 'Okay, great. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega, I'm seeing. Oh, Councilman Hernan.'",
        "'speaker_5': 'Teresa, is this the first rezoning where we are using the far northeast neighborhood plan? I would just.'",
        "'speaker_2': 'It is.'",
        "'speaker_5': 'Wonderful. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Herman. All right. Seeing no other questions, the public hearing for Council Bill 967 is closed. Comments by members of council. So I'm Gilmore. This one's in your district. Would you like to go first?'",
        "'speaker_10': 'CHAIR Thank you, President. Clerk I will be supporting this rezoning tonight. This was this entire tower road corridor was the point of many, many conversations during the far northeast neighborhood planning process and folks really wanting to see commercial corridor businesses along this area and you know, looking at some collision repair auto uses is something that the neighborhood'",
        "'speaker_10': 'really wanted to have close to home. We a lot of times have to go to Aurora or outside of Denver to get those services. And so I see that it meets all the criteria and I'll be supporting it today.'",
        "'speaker_10': 'Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilman Gilmore. Seeing no other comments, I'll just add my thanks to staff for all your hard work on this report. I think it clearly shows that it meets the criteria and I will be supporting it this evening.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_2': 'Gilmore I.'",
        "'speaker_7': 'Black I.'",
        "'speaker_2': 'Said about that.'",
        "'speaker_3': 'I'm going to abstain.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_5': 'All right.'",
        "'speaker_3': 'Gilmore.'",
        "'speaker_2': 'I earned it.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Hinds. High Cashman.'",
        "'speaker_2': 'Kenny Ortega. I. Sandoval. I.'",
        "'speaker_7': 'Sawyer.'",
        "'speaker_2': 'Torres. I.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_3': '12 Eyes one abstention.'",
        "'speaker_0': 'Provides one abstention. Council Bill 967 has passed. Right next up, the council will recess and reconvene as the board of equalization. First up, Golden Triangle pedestrian mall. Though a protest letter was filed for the Golden Triangle Pedestrian Mall because no speakers have signed up to speak, council will forgo holding a public hearing on this local maintenance district'"
    ]
}