{
    "Proclamation for Carol Ann and Paul Rothman.": [
        "'speaker_4': 'None, Mr. President.'",
        "'speaker_1': 'Communications. Do we have any communications?'",
        "'speaker_4': 'None, Mr. President.'",
        "'speaker_1': 'We have two proclamations this evening. Councilman Clark, will you please read Proclamation 925.'",
        "'speaker_6': 'Thank you, Mr. President. Proclamation number 16 Dash zero 925 Recognizing Carolan and Paul Rothman for their leadership, advocacy and support of the downtown children's playground. Whereas beginning in 2002, Carol Ann and Paul Rothman provided their initial support, advocacy and leadership for the downtown children's playground.'",
        "'speaker_6': 'And. WHEREAS, that advocacy and leadership not only continued, but increased exponentially through the completion of the final phase of the playground in 2016. And. Whereas, Carol Ann and Paul engaged, requested, approached, cajoled, and sometimes corralled anyone and everyone, anywhere and everywhere to provide support for the playground.'",
        "'speaker_6': 'And. Whereas, Carol Ann and Paul brought together residents throughout the downtown and lower downtown communities to help care for and help maintain the playground each and every weekend. And. Whereas, without this tireless, ever present and always positive commitment for this needed recreational amenity, the downtown children's playground would not be a reality now, therefore, be it proclaimed by'",
        "'speaker_6': 'the Council of the City and County of Denver, Section one, that the Council of the City and County of Denver recognizes Carol Ann and Paul Rothman and thanks them for their tireless and generous advocacy and support for the downtown children's playground.'",
        "'speaker_6': 'Section two that the Clerk of the city and county of Denver shall affix the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to Carol Ann and Paul Rothman.'",
        "'speaker_1': 'Thank you. Councilman. Clerk, your motion to adopt.'",
        "'speaker_6': 'Thank you, Mr. President. I move the proclamation 925 be adopted.'",
        "'speaker_1': 'It has been moved in seconded comments from the council. Councilman.'",
        "'speaker_6': 'Clerk Thank you, Mr. President. This was a project that I got to see take shape from the very beginning stages, from seeing an empty field and a huge need transform into just one of the most special places in all of downtown Denver.'",
        "'speaker_6': 'And it was really special for me because then I this I started watching this all come together before I had children. And then I got to take my kids down and experience that playground from a kids point of view and really understood the impact for our entire city, because downtown is a part of every single neighborhood in'",
        "'speaker_6': 'our city. But really for the growing number of people who are living downtown and who are raising children downtown, to have this magical place right by the creek where kids can play and can learn and can grow. And just like so many other projects along our waterways, you can point to this project and say that project wouldn't'",
        "'speaker_6': 'have happened except for except for a lot of times I saw a big foundation coming in to support. And in this case, it really was two individuals who put this this on their back and said, you know what, we're going to will it to be we're going to make it happen and we are going to do everything'",
        "'speaker_6': 'and anything and just keep fighting and scrapping, not just so that it's there, but so that every little phase of it gets built out. And, you know, we're all in these twos debt for what they've done for our city, for our community and for downtown.'",
        "'speaker_6': 'And so I would encourage all my colleagues to support this proclamation. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Seeing no other comments. Madam Secretary. Rocco.'",
        "'speaker_4': 'Clark I Espinosa Flynn I. Gilmore, i. Catherine I. Carnage I. Lopez I. New Ortega I. Assessment I. Black i. Mr. President.'",
        "'speaker_1': 'I. Please close the voting and announce the results.'",
        "'speaker_4': 'Councilman Flynn. The not working. And. And. Okay, I got it. 12 Eyes.'",
        "'speaker_1': '12 eyes proclamation 925 has passed. Councilman Clark, anyone.'",
        "'speaker_2': 'That you'd like to bring up?'",
        "'speaker_6': 'Thank you, Mr. President. There are a few people who I'd like to come up, but I will start by handing it off to the fearless leader of our Parks and Recreation Department, the honorable Happy Haines. And I'll let her pass the torch from there.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Indeed. Thank you so much. Council President, Councilman Clark and other members of city council. It's my pleasure once again to be here. I have so much fun here. This is so many good things happening last week and this week and every week.'",
        "'speaker_0': 'And I am I couldn't be more delighted tonight to be here to honor these two incredible individuals. Karellen and Paul Rothman embody the values that make Denver such a great place to live in civic responsibility, social responsibility, stewardship, love and commitment, especially for Denver's families and children.'",
        "'speaker_0': 'And as a former educator, it's not surprising that Carol Ann's infinite passion for children and her overall wish for children to live healthy lives has inspired her and Paul's work in the lower downtown neighborhood. This all started nearly 15 years ago, when Carol Ann and Paul Rothman shared a vision with Denver Parks and Recreation and the Greenway'",
        "'speaker_0': 'Foundation to build downtown Denver's first neighborhood playground. And they never stopped. As it is with many of our projects, it took a lot of effort to cobble together the resources to bring to make this dream become a reality.'",
        "'speaker_0': 'For over ten years, Carol Ann and Paul personally contributed, fundraised and advocated for hundreds of thousands of dollars to fund various phases of the work that was just completed. The final phase was just completed. Located next to the Cherry Creek Regional Trail and in close proximity to many of downtown Denver's wonderful venues the Pepsi Center, Elegies, Coors'",
        "'speaker_0': 'Field, and the Denver Performing Arts Complex. The Downtown Children's Playground serves both as a neighborhood and regional playground where young and old singles and families can enjoy our great outdoors in downtown Denver. And as the downtown Denver population continues to rise in the number of visitors and workers that continues to grow in our downtown area, this downtown'",
        "'speaker_0': 'Denver children's playground plays a huge role in helping to create a family friendly downtown area. Today, Carolyn and Paul remain actively involved with the ongoing operations of this downtown children's playground. As you heard earlier, organizing and leading community cleanups and making sure that the free little library stays fully stocked with children's books.'",
        "'speaker_0': 'So members of Council I, on behalf of Denver Parks and Recreation and the citizens of Denver, I want to express my sincere gratitude to Carol Ann and Paul Rothman for their dedication and commitment over the years to make downtown Denver a better place to live, work, play and thrive.'",
        "'speaker_0': 'Congratulations to you, and thank you so much from the bottom of our hearts. I would like to turn it over to an extraordinary individual who is an amazing partner of our cities. And you, we are probably going to be tag teaming a lot because in nearly everything that happens in downtown and lower downtown I the Greenway Foundation'",
        "'speaker_0': 'is is an an incredible partner. And I'd like to introduce my great friend and partner, Jeff Shoemaker.'",
        "'speaker_7': 'Thank you. Happy?'",
        "'speaker_1': 'Mr. President, we have to stop meeting this way.'",
        "'speaker_7': 'Thank you, members of Council. Thank you.'",
        "'speaker_6': 'Councilman Clark, President pro tem. This one is very, very personal to me.'",
        "'speaker_0': 'Happy mention.'",
        "'speaker_7': '15 years and she's.'",
        "'speaker_0': 'Right. That's when the work began on this.'",
        "'speaker_7': 'But the vision.'",
        "'speaker_0': 'Of this started.'",
        "'speaker_7': 'Five years prior to.'",
        "'speaker_0': 'That.'",
        "'speaker_6': 'And it just never got off.'",
        "'speaker_1': 'The ground until this.'",
        "'speaker_7': 'Spark, this.'",
        "'speaker_0': 'Passion, this zealous advocacy.'",
        "'speaker_7': 'In the names of.'",
        "'speaker_6': 'Carolyn and Paul Rothman came on board.'",
        "'speaker_7': 'They have invested their financial, their personal, their neighborhood, their residential, their regional advocacy and passion for this project. And I will tell you that without Carolyn and Paul Rothman and you can take this to the bank, there would be no downtown children's playground, no brag.'",
        "'speaker_7': 'Just a fact. And I'm going to turn it over to these two amazing people.'",
        "'speaker_6': 'And I know you have.'",
        "'speaker_1': 'Good work.'",
        "'speaker_7': 'To do tonight. I don't want you to be too jealous because the Shumaker family is going to take the Rothmans to the chop house and we're going to close the place down here in a little bit. But I want to introduce and recognize two significant individuals within the Parks and Recreation Department without whom as partners three way'",
        "'speaker_7': 'partnership. Imagine this public, private, philanthropic and to I mentioned the word last week skipper every project has, you know, a good skipper, a good general. And the two generals of this project are here tonight, Mr. Mark Bernstein and Mr. Tom Hockey, and they had the challenge of dealing with Shoemaker on a daily basis.'",
        "'speaker_7': 'But without them, this project again would not be possible. And it is my honor, it is a personal.'",
        "'speaker_0': 'Privilege for me.'",
        "'speaker_7': 'To introduce to you this amazing couple, Carolyn and Paul Rothman. Thank you.'",
        "'speaker_0': 'Well, I want to thank you. This is really a wonderful honor for us. And I guess what I'd like to say is back in 2002, we had no idea of how to build a favorite playground. And I guess, as Jeff mentioned, for five years of $10,000 had been raised and we had just gotten a rejection letter for'",
        "'speaker_0': 'a grant. So we sort of started from the beginning, and I think none of this could have been done ourselves alone. So I'd wanted to thank those who really share in what we are receiving here tonight. We could not have done it without them.'",
        "'speaker_0': 'So first I'd like to single out Mark Bernstein at Parks and Rec and others who we worked with over the years, and especially our councilwoman, Judy Monteiro, who was always there for us whenever there was a need. The Greenway Foundation sort of helped us along the way, who we should contact, how we should get things done.'",
        "'speaker_0': 'And we had great support from ARCA, Tara and Andy Deford, who designed the things for the playground. But most of all, I think in sharing this award with others, the biggest group that I would single out would be the people in our community.'",
        "'speaker_0': 'When we were told that in order to get a go code grant, we needed to show broad based support from the community. We got contributions from literally hundreds of people, some very little, some larger, and that really got us going and on the way.'",
        "'speaker_0': 'So although we both stand here today, many, many people share in this honor and made it possible.'",
        "'speaker_1': 'And again, thank you very much.'",
        "'speaker_0': 'Thank you, Carolyn.'",
        "'speaker_3': 'Thank you. It was a long, long journey, much longer than we anticipated and as any long journey. There were highs and lows. But now that the three phases are finished and the three little children's library is there, we can see so many special things.'",
        "'speaker_3': 'And I love to go down there and see mothers having coffee together and the children playing. I love to see often on a weekend you'll see fathers taking over with their kids and at lunch time you'll see office workers from all over having lunch there.'",
        "'speaker_3': 'We also see people that don't have anyplace else to go. And I think some of the highlights have been when they've seen us down there cleaning up with one of the crews and thanked us. So that's been very special.'",
        "'speaker_3': 'But I think the most special thing for me is I was down there and this is an example of it last week delivering books. And this little boy was with his mother probably four or five, and he was all over the place and having a wonderful time.'",
        "'speaker_3': 'So he saw me putting books in and he came up and he wanted to know what I was doing.'",
        "'speaker_8': 'So I explained how we could take one or he could read it there, and if he.'",
        "'speaker_3': 'Had any at home, he could bring them another time. And I said, Do you like this playground? And he said, It's my secret and it's my playground. And I think that's the biggest difference for me. You mentioned the dirt and nothing, and it was like that.'",
        "'speaker_3': 'It was just dirt. And now you go there and it's green and lush. There are people using it and having a good time. So thank you for giving us the opportunity to do this. And it's been a long but fun journey and we've learned a lot.'",
        "'speaker_3': 'And I have to say, I admire the city when I think how many years it took 15 years to get this playground together. I have no idea how the big projects happen. I really don't. So thank you.'"
    ],
    "Proclamation of Indigenous Peoples' Day.": [
        "'speaker_1': 'Thank you so much. I love it when our head of Parks and Rec says she likes to come in here because it's so much good happening here. We don't hear that very much, but thank you. I appreciate it.'",
        "'speaker_1': 'All right. Thank you all. Okay. So, Councilman Lopez, I hear you have a proclamation tonight as well. Can you read it?'",
        "'speaker_6': 'Yes. Thank you, Mr. President. Proclamation 16 DASH 0939. In observance of the first annual Indigenous People's Day in the city and county of Denver. Whereas the council, the city and county of Denver recognizes that the indigenous peoples have lived and flourish on the lands known as the Americas since time immemorial.'",
        "'speaker_6': 'And the Denver and the surrounding communities are built upon the ancestral homelands of numerous indigenous tribes. And. Whereas, the seasonal encampments of the Arapaho and Cheyenne, people along the banks of this Cherry Creek and South Platte River confluence gave bearing to future settlements that would become the birthplace of the Mile High City.'",
        "'speaker_6': 'And. Whereas, Colorado encompasses the ancestral homeland of 48 tribes and currently the city and county in Denver and the surrounding communities are home to the descendants of approximately 100 tribal nations. And. WHEREAS, the Council of the City and County of Denver recognizes and values the vast contributions made to our community through indigenous peoples knowledge, science, philosophy, arts'",
        "'speaker_6': 'and culture. And through these contributions, the City of Denver has developed and thrived. And. WHEREAS, Indigenous Peoples Day was first proposed in 1977 by a delegation of Native Nations to the United Nations sponsored International Conference on Discrimination against Indigenous Populations in the Americas.'",
        "'speaker_6': 'And. WHEREAS, on October 3rd, 2016, the Council of the City and County of Denver unanimously passed Council Bill 16. Oh, let me say that Council Bill 801 series of 2016 officially designating the second Monday of October of each year as Indigenous Peoples Day in Denver, Colorado.'",
        "'speaker_6': 'Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Council of the City and County of Denver celebrates and honors the cultural and foundational contributions of indigenous people to our history.'",
        "'speaker_6': 'Past, present and future. I will continue to close gaps in equity and promote increased access to health care, housing, education, economic opportunity, and civil rights for all people. Section two. The city and county of Denver, Colorado, does hereby observe and proclaim October 10th, 2016, as Indigenous Peoples Day.'",
        "'speaker_6': 'Section three that the clerk of the city and county of Denver, Charlotte, affixed the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the Denver American Indian Commission, the Denver Agency for Human Rights and Community Partnerships.'",
        "'speaker_6': 'The Denver Public Library. The City and County of Denver School. District Number one History. Colorado. The Colorado Commission on Indian Affairs. And the Governor of Colorado, John W Hickenlooper.'",
        "'speaker_1': 'Thank you. Councilman Lopez, your motion to adopt.'",
        "'speaker_6': 'I move that council proclamation 939 series of 2016 be adopted.'",
        "'speaker_1': 'It has been moved in second comments by members of council. Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. Today. Well, today is a historic day. For the first time. In our history in Denver, we officially celebrate and we officially observe indigenous people stay.'",
        "'speaker_9': 'For the first time.'",
        "'speaker_6': 'And we we do that. We do that because indigenous people's history is American history and indigenous people's history is Denver history. It encompasses all. You know, I don't want to be too long because I last last last Monday.'",
        "'speaker_6': 'We introduced the bill. Not a made it official, an observation and it passed unanimously. 12 two zero. The bill was signed by our mayor, Michael Hancock. And it is now official. And.'",
        "'speaker_0': 'We do this.'",
        "'speaker_6': 'We celebrate Indigenous People's Day in Denver. As a badge of pride. As a badge of honor. A matter of respect. And. As a matter of self-determination. Because it has always been about self-determination. And you're right. To do so.'",
        "'speaker_6': 'And we do that. And as we honor and celebrate and observe Indigenous Peoples Day, it's important to remember that we do it.'",
        "'speaker_0': 'As.'",
        "'speaker_6': 'As Cesar Chavez famously said. Without the disrespect or contempt of any other culture.'",
        "'speaker_0': 'And that is truly.'",
        "'speaker_6': 'What the embodiment of this is. It's the the celebration, the preservation of one's own culture that does not require.'",
        "'speaker_0': 'The contempt.'",
        "'speaker_6': 'Or disrespect of another's. And that's a difference. With this holiday. With this observation, as we do so, as we honor all of our brothers and sisters, whether they speak our languages or not, whether they have last names like ours or not.'",
        "'speaker_6': 'Well, they. They look different than us or not. And that's the spirit in which this proclamation is read tonight. And I am proud. To be able to sit here from the dais to read this proclamation. And read a part of Denver history.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Well said. Okay. We we got a we we have some more folks speaking. I think a lot of you will be speaking. See, I got a lot of clapping to do. Councilwoman Ortega.'",
        "'speaker_3': 'Thank you, Mr. President. First of all, I want to make sure that my name is added to the proclamation. I'm not going to repeat all the comments that I made last week. I want to thank Councilman Lopez and his staff for working with the community in bringing this forward.'",
        "'speaker_3': 'I think this is very important that we honor and recognize the original settlers in Colorado and the Denver community who help shape this community. You heard me talk a little bit about some of the the streets down in the central Black Valley that are named after some of our native chiefs or their wives.'",
        "'speaker_3': 'And I think continuing to reflect the culture and history in our books, in our classrooms, in so many of the things that we do in this community, you know, people get to go to the march. POWELL And enjoy part of the culture that has continued, you know, after all these generations.'",
        "'speaker_3': 'And to see that the culture continues to be passed on from the elders to, you know, the two and three year olds that you see dancing on the floor of the Coliseum at the Powell. But, you know, it's so much more than that.'",
        "'speaker_3': 'And as Councilman Lopez talked about, the some so many of the disparities that still exist. We have a long way to go, but this is a huge step in just honoring the contributions that have been made by our native brothers and sisters.'",
        "'speaker_3': 'So thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Ortega. Looks like we don't have any other comments. This is this is an incredible day for us and in the city of Denver. I feel like a lot of times we say this is the first time in history, but this truly is the first time in history in the city of Denver.'",
        "'speaker_1': 'And its setting, it's setting a representation for the rest of the state and even the nation. And we are, you know, most of council. We are we're just so humbled to be a part of this. So thank you, Councilman Lopez, for leading in this effort.'",
        "'speaker_1': 'It it brings me to that quote, you know, if not us, who. If not now, when? And so we're standing up for a lot of folks who thought that their names and their history would never be said again.'",
        "'speaker_1': 'But today we're saying it. So this is exciting. Madam Secretary, roll call.'",
        "'speaker_4': 'Lopez. I knew. Ortega. Sussman. Black eye. Clark. Espinosa. Flynn. Hi, Gilmore. Cashman. Hi. Can I. Mr. President.'",
        "'speaker_1': 'I please close the voting and announce the results.'",
        "'speaker_4': '12 Eyes.'",
        "'speaker_1': '12 Eyes. Proclamation 939 passes has been adopted. So, Councilman Lopez, are you going to bring up each and every individual to to celebrate this who we have in the audience?'",
        "'speaker_6': 'Well, we do. And there were the zoning might same as I'll do it. So we have a lot of folks in our community from the from members of the American Indian Commission here at the city, our community, Denver Public Schools, folks with definitions and folks with, you know, different agencies.'",
        "'speaker_6': 'So but I'm going to ask that the following individuals just please approach the microphone, stand together. And then we also have a couple of representatives from a couple of tribes. They're going to one offer a blessing, in some words, so she can.'",
        "'speaker_6': 'Mr.. CARNEY For us from the southern Utah nation. Mr.. Robert, I'm Robert Cross from Lakota. Mingo Flying Earth with the Denver. American Indian Commission may mean going to want to come with their cute little one. And then we also have some students from DPS if you want to come forward.'",
        "'speaker_6': 'Yeah. So why don't we? We start with just an introduction. The students want to introduce yourselves. What school you go to? And then they mingle.'",
        "'speaker_1': 'And then you want the students to go first. Student. Okay.'",
        "'speaker_10': 'No. But you need the students.'",
        "'speaker_1': 'He wants the students to go first.'",
        "'speaker_6': 'You want to take you.'",
        "'speaker_10': 'Okay, you guys go.'",
        "'speaker_1': 'Young people come over here to the mic. There you go.'",
        "'speaker_2': 'Compared to our stay home, it's easy to understand that the Jews are by Joni Mitchell immensely happy. Todd achieving a touch he international Oglala Lakota him after south high school blah blah. Good evening everyone. My name is Joni.'",
        "'speaker_2': 'I am told. Keep me in touch. You need to know I am the current Denver Indian Center princess and I attend South High School. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'McCarthy. Hello, my relatives. My name is Angel Locke. I'm from the Standing Rock Reservation. I'm part a student board of Education. I go to Denver Center for International Studies.'",
        "'speaker_1': 'Wow.'",
        "'speaker_2': 'A.J.. Josephine, Ky. Hello, my name is Josephine King, and I go to Denver just as high school. And I'm from Colorado Springs, Colorado.'",
        "'speaker_4': 'And the Joy Lynch. Hello, I'm Joy Lynch. I'm Navajo and I.'",
        "'speaker_8': 'Go to East High School.'",
        "'speaker_6': 'Yeah. Hello. My name is from a commercial I attend. I'm a senior at West Early.'",
        "'speaker_0': 'College of.'",
        "'speaker_6': 'Navajo, Oglala Lakota, Nez Perce.'",
        "'speaker_1': 'Beautiful.'",
        "'speaker_6': 'I mean.'",
        "'speaker_2': 'Hello. Good evening, everyone. My name is May Ming were flying earth. I am the co-chair of the Denver American Indian Commission. I am Lakota. Dakota Anishinaabe. R.E.M. Autumn. And I have to say that as an indigenous person, I'm very proud to be here tonight.'",
        "'speaker_2': 'I'm the very first official Indigenous Peoples Day in the city and county of Denver. I first just want to acknowledge my elders who are going to be speaking here, and I apologize for speaking ahead of you. I want to thank Councilman Lopez and and his service around here for all of their work on this effort.'",
        "'speaker_2': 'I want to thank each one of you, city council members, for your unanimous vote last week. That sends a message to our local community, to the nation, that indigenous people's voices have been heard and will be continue to be heard in the city and county of Denver.'",
        "'speaker_2': 'I also want to acknowledge our community members who have been a part of this effort for years and that this comes at the at the hard work and sometimes resistance, civil disobedience of our community members to make their voices heard.'",
        "'speaker_2': 'And I want to thank them for all of their work and for being here in support this evening as well. I think we've talked about what this indigenous peoples day can represent for the for the city and county of Denver.'",
        "'speaker_2': 'And I think it's an exciting thing and it's an important thing, as both City Councilman Lopez has mentioned, visibility is important in telling our stories. As Councilwoman Ortega has mentioned, telling telling an accurate portrayal of what has happened here is important to include our our voices in the history of this city.'",
        "'speaker_2': 'And and I think the more often we can talk about those things, the better we are as a community that the more often we can talk about our leaders who have come before us, Little Raven, any any indigenous names that we can repeat in our daily, daily lives was all the numerous tribes that have our name for'",
        "'speaker_2': 'our streets, and that we also think about how some of the other things around us continue to perpetuate negative aspects of our history and that we need to think about what those things are like. Having street names after army people who slaughtered people at San Creek.'",
        "'speaker_2': 'Those think those things aren't aren't appropriate. We don't want we don't want to continue those things. I think it's important for our children that we now have indigenous people stay in Denver, that I'm so proud that my daughter will have this as part of her life and her growing up in the Denver area Indigenous Peoples Day.'",
        "'speaker_2': 'And so that we can all take, take, take a page from from each of you today and voting on that and that we can continue to educate our community members on indigenous issues. I just also wanted to very briefly say I'm a recent resident of the Denver area.'",
        "'speaker_2': 'I grew up in the Dakotas on the Standing Rock Reservation. Indigenous Peoples Day to me represents a time when we can start to talk about some issues that affect our communities, some critical issues, because as much as we would like to just celebrate Indigenous Peoples Day for all the positive things, there are still negative things that are'",
        "'speaker_2': 'happening in our communities, are still under attack. We're still subjected to environmental racism, we're still subjected to racist mascots. There's a whole host of things that we still need to confront and face, and I hope that Indigenous Peoples Day can be a way to start those conversations and to bring those issues to the forefront.'",
        "'speaker_2': 'So tonight, I would like to ask anyone who's from Standing Rock, anyone who's been to Standing Rock, who has stood with my community in opposition to this pipeline. There's a proposed pipeline, 1200 mile pipeline. That's an oil pipeline that is proposed to pass through our ancestral lands and under our precious Missouri River.'",
        "'speaker_2': 'That is I understand that's also a watershed to Denver. So, you know, the water is important. And and anyway, tonight, I would like to ask anyone who's here to stand with me. And we accept this proclamation tonight in solidarity with Standing Rock.'",
        "'speaker_2': 'Thank you. Thank you, Paloma.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'KENYON, Mr.. Mr. Frost and Mr. Cross, if you want to introduce yourselves and do your thing. Yeah.'",
        "'speaker_11': 'Okay. I want to welcome each and everyone here from the Denver community, Mr. President and the rest of the council people. I like to commend each and every one of you speaking on behalf of our community here, the Native American community.'",
        "'speaker_11': 'My name is Kenny Frost. We're the original inhabitants of Colorado of this great nation. And it brings great pleasure to be able to address each and every one of you face to face. And thank you for the courage that you have displayed by passing this today.'",
        "'speaker_11': 'This is a historic occasion. When we look at things historically, we sometimes do not understand the magnitude of historic. Each and every one of you will be written in the history books. Just to give you an idea, and all those who are here get to be a part of that because they got to see the governing body'",
        "'speaker_11': 'of Denver doing the right thing. And I thank you. The community thanks you. It's been a long time coming. The council people from the past have tried but didn't go. Now it did. With your courage and strength. And one of the things I want to do as an as the youth spiritual leader for my tribe and for'",
        "'speaker_11': 'the youth tribe in Utah, as well as for other tribal nations that I help assist in Sundance is and as a Sundance chief, is that after I'm done, Robert is going to say a prayer to close everything up.'",
        "'speaker_11': 'The reason he's going to say a prayer and sing a song is that each and everything will be good for all of us. That when we go home, we're going to carry that warm feeling that we have here and you get to take that home to your families and that will spread.'",
        "'speaker_11': 'The other thing that I want to mention is I was up in Newark when the dogs were attacked, attacked our people from the beginning. So for a little over a month and a great many challenges. So I'm going to ask each and every one of you now to take another step.'",
        "'speaker_11': 'Encourages, like cities of Seattle, cities that just last week, Los Angeles city government passed a proclamation supporting Standing Rock and helping fight for that one. I'm asking you and challenging you to also stand up for that water, because believe it or not, that Missouri River would have boring under.'",
        "'speaker_11': 'Underneath is the Ogallala Aquifer. It goes through South Dakota, Nebraska, Kansas, eastern end of Colorado, Texas, Oklahoma. It's a huge, massive freshwater area there. And that's going to affect our state, particularly the people who depend on wells for drinking water.'",
        "'speaker_11': 'Once that water gets in that Ogallala Aquifer, it's impossible to clean. So that's why cities and great cities across the United States are passing proclamations in order to stand with Standing Rock. Because we all depend on water once it goes down into the Missouri.'",
        "'speaker_11': 'Into the Mississippi. 10 million people from the Missouri. 10 million. So you're talking upwards of 25 million people being affected and our water is sacred. I have a background in natural resources and I help my tribe. We helped set up the Natural Resource Division, which we've done really well, providing for tribal members back home.'",
        "'speaker_11': 'And one of the things I've learned is that our water Denver depends on fresh water. You get your water on the other side of the mountains. That's where you want it comes in comes from the founding fathers of Denver.'",
        "'speaker_11': 'Were smart. They got the water from over there and piped it through the pipes to come here to Denver. I don't know if many of you know that. I don't know if the community knows that. But that's where you get your water is on the east western slope.'",
        "'speaker_11': 'And that's how important water is, because those founding fathers, your predecessors were smart, just like you guys as you guys decided to do the right thing and we're all equal. There's one thing that we that we must remember, no matter where we come from, no matter what our belief system is, no matter how we believe or think'",
        "'speaker_11': 'or pray, there's one thing that ties us together as one people. To love happiness, providing for families and just living in harmony and peace with one another. And by you passing this, we can continue to do that. The next thing is we support our representative science and push it through a state as one nation, as one city'",
        "'speaker_11': ', as one group. We can do this along with the community to help pass it so that we can abolish this one day and and everybody come together as one. And let's get rid of hatred, prejudice, and work as a community, as one people as it should be.'",
        "'speaker_11': 'So I commend you and thank you for listening to me. And thank you, Denver Community for being here tonight. A great many people have passed on and how much they would have loved to have been here to see this.'",
        "'speaker_11': 'So thank you.'",
        "'speaker_2': 'Much.'",
        "'speaker_10': 'When we talk with you, first of all, I want to extend my hand to all of you and thank you for what you did. That's a great honor to stand here and talk to you. My Lakota walk like, okay, La Lila.'",
        "'speaker_10': 'Motion capture the convicted killer. La la, la, la. Hatcher my country wants to know. We all killer. You know what? Well, slow, huh? We are taking you to a calculated Lila. Lila, duck walk. Why Chinchilla? Why don't you let your hedgerow walk?'",
        "'speaker_10': 'You kill the Chicago killer. You know, whatever she says here, you know about her people and what they need up there. That's where our prayers and that's where it's going. So we want we want to keep that pressure going that way.'",
        "'speaker_10': 'You know, and they tell us there's a there's a story, you know, that goes one time we were we were underground. We were underground. And when this shook wanted to talk, I came down or this wolf came down here and brought us back from the ground underneath the earth.'",
        "'speaker_10': 'And as as he brought us forward, as he brought our first one forth, who was named Takagi, the first one eventually took out. He went back under to bring his people back up. But when he came back up, he was met by two people.'",
        "'speaker_10': 'One was called the economy, and the other one was called the new writer. And each time he told me and he knew he did play a part in our history constantly. They always played a part in our history.'",
        "'speaker_10': 'And when when Columbus came, they came. They were there. I knew he, too, and told me told me he's. He's a trickster. He tricks us. In Inuktitut. She's a beautiful woman on one side and. Bad looking woman on the other.'",
        "'speaker_10': 'They call her now easy. She brings in now easy. And it's not necessarily like that. But what it represents is the two powers of male female working together in a lot of ways, positively or negatively. And so when when Columbus came and the first tall guy, he was standing there waiting for him on the shore, there must'",
        "'speaker_10': 'have been a lot of anxiety that took place. Because I'm sure that the first one that seen this this man or this person coming coming to shore also recognize the fact that we were in for a lot of different things coming in.'",
        "'speaker_10': 'And most of those were probably negative that he thought about. You know, and probably wondering what was going to go on. So when when these things come where we can stand up and honor something that's positive, even though it's small like this, you know, my children went to school and then.'",
        "'speaker_10': 'It seemed like once a week for a long time there. Every every once a week for a long time there was going to school to have to address some matter or another that had to do with why the school system wasn't doing what they had to do to make sure everybody everything was in balance within the educational'",
        "'speaker_10': 'system. And it got to the point where I had to eventually pull my daughter out of school, you know, because of things that were, are and are still here in Colorado that are really damaging for us native peoples like Squaw Mountain, things like that, you know, that come about all the time.'",
        "'speaker_10': 'And, and so I took them to a different school out in the country, and it was the same out there. It was a lot of struggle, you know. And so I had to go into the school system and find that the native kids here have their own school system, but a lot of us don't.'",
        "'speaker_10': 'A lot of the school system here don't realize that they have their own way of being taught through their school system that they're supposed to the school system's supposed to utilize for our children, native children. We're not really considered minorities.'",
        "'speaker_10': 'We considered our own culture. A lot of us are solitary. So a lot of times, you know, we go into our school system and start looking at what really we're supposed to be taught. It's not there for us in these European descended school systems.'",
        "'speaker_10': 'You know, it's not there for us. A lot of times we're supposed to be taught in the circle, you know, and a lot of times those things aren't available for us. So it gets confusing for our children. So it's really important that which is proclamation and these things that go on that you people, you know, and all'",
        "'speaker_10': 'your happiness for doing this. And I really appreciate this with all my heart because it's a struggle to go out there and have to stand your ground as a Native American. And even when you go out your door, you're living in a place that's not yours no more.'",
        "'speaker_10': 'You know, you feel like a foreigner in your own homeland. People look at you like that. You know, I can't dress like this every day. I'd love to, but I can't because people, you know, will start connecting something to me.'",
        "'speaker_10': 'And it's not it's not fair in that way. So for my children, for all these children here and these young people and these ones here that stood their ground for years now fighting for this proclamation, all these people, every one of them come out here every year, no matter what the weather's like, no matter how cold it'",
        "'speaker_10': 'is, they're all out there doing their best to make sure that these things get passed. You know, for all them, you know, we're here. We're here for them. And we're going to stand our ground not only here, because now that you've done this and all, you live within this capital.'",
        "'speaker_10': 'You live. You surround this state capital here. Now, you guys could join us and we could all go to the state capital and we could do it right. I think that. Right. You know what we're supposed to do together?'",
        "'speaker_10': 'You know. So that's what we need. We need you to join us. And let's go to the state capitals together and make them in a real positive, spiritual way. Change their minds because our children, they need that, you know, they really do.'",
        "'speaker_10': 'They need that, you know, and I'm tired. I'm tired of seeing my children from all the way back. I have to go through this. It's not fair to them. It's not me as a child. It wasn't private to me either.'",
        "'speaker_10': 'And it's not fair to her. No, no, no. You know. And we have to stand our ground every day of our lives. So this is beautiful for one day. But now give us two days. Give us three days.'",
        "'speaker_10': 'Give us a lifetime. You know, that's all we ask for. You know, and that's all we've asked for from the day that is told me and that nugget that showed up on our shore. You know. That double faced and that trickster.'",
        "'speaker_10': 'When they showed up on our shore, all we asked for was healing and health and health, you know, for all of us. Oh, man. And that's all we're still asking for to this day. Nothing has changed. As Tanya, who was here with me last year.'",
        "'speaker_10': 'Last time. And one of our leaders, Russell Mead. Who stood his ground from the beginning. You know, I stand here for them. And I was called here to stand by another one. You know. And that's why I'm here.'",
        "'speaker_10': 'I'm here because these gentlemen, these are relatives of mine. And this man here is Mr. Lopez. And the other one, you know, they're both my relatives because they're fighting that same fight. You know, takes relatives to do that.'",
        "'speaker_10': 'It doesn't take people that have power, takes people that can share to do that. I appreciate that. I think all you wind up that you actually think. Thank you. Shake my hand. Oh.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Mm hmm.'",
        "'speaker_9': 'In the song. In person.'",
        "'speaker_10': 'Because as natives we defend the earth. You know, everything we do is about the Earth. It's not about manmade law. It's about creators law. And that's defending the Earth. I want to see you defend yourself. Where you work.'",
        "'speaker_9': 'Well. What? What?'",
        "'speaker_1': 'You. I went. What?'",
        "'speaker_10': 'Okay. Good to be with you.'",
        "'speaker_9': 'Yoo hoo hoo hoo hoo. Oh. Whoa, whoa, whoa. But what?'",
        "'speaker_6': 'What?'",
        "'speaker_9': 'But what? Oh, gosh. Whoa, whoa, whoa. Ho! Oh!'",
        "'speaker_10': 'Let me try the turkey. Now. Yellow. Hey, hey, hey, hey.'",
        "'speaker_0': 'Ooh.'",
        "'speaker_10': 'Gee, my car. No, we're changing your.'",
        "'speaker_0': 'Whoa!'",
        "'speaker_10': 'What are you. Ha ha! Whoo hoo! Oh, thank you. The one thing I want to reiterate here is that our children are the most important to us. We call them Conejo. And when those children go to go to these schools and they hear that Denver did this, you know, they're going to they're going to make a bigger'",
        "'speaker_10': 'effort to help themselves, I'm sure of it. You know, because when you go to these schools and you're always hearing condemning of your peoples, you know, it makes it hard to keep going back. I know this because my children, they they don't want to go to these schools, you know, and it's not because they don't like the'",
        "'speaker_10': 'schools or the people are the teachers. It's just the curriculum that's involved in it. So we need to make a big change, you know, in order for all of us to realize that who we are as human beings, we're not we're not anything more or less than that, you know, and we've got to get over that fact'",
        "'speaker_10': 'that, you know, history is there and history has to be looked at. We can't be denying it. And that's what we're doing. You know, we try to cover up Turtle Island. That's what this country's name is. Originally, Turtle Island, Macaque.'",
        "'speaker_10': 'Q And so you guys try to cover that up too much, you know? And we got to bring that back. We got to bring back the true history of this land. And, you know, like up here at Red Rocks, that's a sacred site to us.'",
        "'speaker_10': 'And yet we can't go up there and share in that place in a sacred way. You know, that was fought over all the way up to the late 1800s. And then they finally chased out those warriors. But they they fought for that place because it's a sacred site.'",
        "'speaker_10': 'So I was just saying, you know, we have many sacred sites here on our relatives homeland here, all of us. All 16 sacred sites. 16 different nations. So I just want to say thank you, though. Oh, thank you.'",
        "'speaker_1': 'Thank you. Thank you. Councilman Lopez wants to present all of you with the proclamations.'",
        "'speaker_6': 'I just wanted to present this proclamations. Take.'",
        "'speaker_0': 'I mean, what.'",
        "'speaker_10': 'I wanted to think when I was growing up. But then I figured I'd get it all.'",
        "'speaker_6': 'So I.'",
        "'speaker_1': 'Want to do this.'",
        "'speaker_10': 'Because this represents the blood of my ancestors for all they fought for. Well. Oh. Hmm. You know, history. To get one little thing done. You know one of the thing. But all of you have done you know, this is their blood.'",
        "'speaker_10': 'This is their acceptance. You know, all I can do is just cry, cry for them, you know?'",
        "'speaker_6': 'DUCKWORTH That's also the the ordinance that we passed last. Last week as well, too. Thank you. Thank you for coming.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_11': 'Thank you all for doing this. It's the right thing. And we work together from this day forward.'",
        "'speaker_1': 'Thank you, everyone. Thank you for coming this evening. We will. This will be a night definitely to remember. And we hope that other cities follow suit in our state as well. Thank you. Now, Madam Secretary, this is going to be a tough transition, but will you please read the resolutions?'"
    ],
    "Agreement with Colorado Center for Infrastructure Investment for Strategic Advisory Services at Denver International Airport.": [
        "'speaker_1': 'Just want to make sure that's correct. Okay. Madam Secretary, can you pull please pull up 832. Great. Councilwoman Black, will you please put a 32 on the floor for adoption?'",
        "'speaker_8': 'Thank you, Mr. President. I move that resolution 830 to be adopted.'",
        "'speaker_1': 'All right, we have a mover in a second comments by members of the council, Councilwoman Gilmore.'",
        "'speaker_2': 'Thank you, President Brooks. I wanted to call this out because in the ordinance language, it mentions that the consultant will provide strategic advice based on the Great Hall Project, including den real estate. And my brother in law has an interest in the Great Hall project, and so I will be abstaining on this vote.'",
        "'speaker_2': 'Thank you. President Brooks.'",
        "'speaker_1': 'All right. Thank you, Councilwoman Gilmore and Councilwoman Kenney.'",
        "'speaker_12': 'Thank you, Mr. President. I did just want to let council members know that we will be having a briefing. I believe in the Finance Committee about some new advising that the city is bringing on overall regarding public private partnerships beyond just this airport contract, but the entire approach the city has to public private partnerships.'",
        "'speaker_12': 'And so I believe that that is scheduled in the coming weeks. And it may be of interest to us as we think about how we do these these these types of partnerships going forward.'",
        "'speaker_1': 'Thank you. That is germane. And I have a lot of constituents who've been wondering about public private partnerships. So I think it would be a good information gathering that's in the government and Finance Committee. What date?'",
        "'speaker_12': 'Again, sorry, I don't have it in front of me, but I promise we will make sure to alert the entire council. This the adviser that the administration is going to be bringing on does not meet the $500,000 threshold.'",
        "'speaker_12': 'So it does not come to us as an ordinance request. Instead, it will be more of an introduction to know how they plan to use this person and I will send everyone the date. My apologies for not having it.'",
        "'speaker_1': 'Sounds good. Thank you. Madam Secretary. If there are other comments, roll call.'",
        "'speaker_2': 'Gilmore Abstain.'",
        "'speaker_4': 'Cashman I can eat. Lopez knew Ortega. I Susman. I black eye. Clark. All right. Espinosa. Flynn. Hi, Mr. President.'",
        "'speaker_1': 'Hi. Please close the voting and announce the results.'",
        "'speaker_4': 'So I just looking to make sure. Ortega. Sorry.'",
        "'speaker_1': 'That's right.'",
        "'speaker_4': 'Ten eyes, zero nays, one abstention.'",
        "'speaker_1': 'Tonight, zero nays, one abstention. Resolution 832 has been adopted. All right. Say no other bills. All other bills for introduction are ordered published. We are now ready for the block vote on resolutions and bills for final considerations. Council members, please remember that this is a consent or block vote and you will need to vote.'",
        "'speaker_1': 'Otherwise, this is your last chance to call out an item. Councilman Black. Will you please put the resolutions for adoption and the bills for final consideration on the floor for final passage?'",
        "'speaker_8': 'Thank you, Mr. President. I move that resolutions be adopted and bills and final consideration be placed upon final consideration and do passed in a bloc. Vote for the following items. 838. 793. Seven. 94. 833. 834. 837. 843 844 845 848 612 835 839 846.'",
        "'speaker_8': 'And that's it.'",
        "'speaker_1': 'Madam Secretary. I think she's got it. Would you agree?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'It has been more than a matter of secretary. Roll Call.'",
        "'speaker_4': 'Black Eye Clare by Espinosa I Flynn I Gilmore.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Cashman. I can each I knew Ortega. Hi, Susman. Mr. President.'",
        "'speaker_1': 'I. Police Close voting results.'",
        "'speaker_4': '11 Eyes.'",
        "'speaker_1': '11 Eyes resolutions have been adopted in the bills have been placed upon final consideration and. Duplass Tonight there will be a required public hearing on Council Bill 599 changes the zoning classification for 17670 East 64th Avenue and 6 to 0 three Panasonic Way.'",
        "'speaker_1': 'A required public hearing for the Council Bill 624 Change the zoning classification for 16 zero one 1671 Pearl Street and 524538 East 17th Avenue and require public hearing on Council Bill 752 Changes on classification from 4150 North L.A. Street.'"
    ],
    "Zoning Change for 17670 E. 64th Avenue and 6203 Panasonic Way.": [
        "'speaker_1': 'On the presentation monitor on the wall you will see your time counting down. The speakers must stay on topic of the hearing and must direct their comments to council members. Please refrain from profane and obscene obscene speech. Direct your comments to the Council as a whole and refrain for individual or personal attacks.'",
        "'speaker_1': 'Councilwoman Black, will you please put Council Bill 599 on the floor?'",
        "'speaker_8': 'Thank you, Mr. President. I move that council bill 599. Be placed on the floor.'",
        "'speaker_1': 'For final consideration and.'",
        "'speaker_8': 'Final consideration and due process.'",
        "'speaker_1': 'It has sorry it has been moved in second to the public hearing for 599 is now open. May we have the staff report? Carlin Heizer. Welcome back to Denver. I know I've said that, like, five times, but it's so good to see you.'",
        "'speaker_6': 'Great. Thank you very much. Colonizer with community planning and development. Here to present the proposed rezoning 417670 East 64th Avenue and 6203 Panasonic Way. So moving on to the second slide, this proposed rezoning is in city council district 11.'",
        "'speaker_6': 'Next slide shows that it's in the disease statistical neighborhood.'",
        "'speaker_1': 'Mr. Hazard, just make sure you're we can't sometimes see the pages. It doesn't flip with you. So just let us know what page you're on as you're going through.'",
        "'speaker_6': 'Okay. So I'm on slide three. Yep. I'm moving on to slide four shows the specific location of the proposed rezoning. So this is in the 61st and Pena Station area. It's due north of the new stations and ride lot and just slightly northwest of the new Panasonic building, which in this particular image is kind of the only'",
        "'speaker_6': 'building that you see within the parameters of the of the aerial photo. Slide five. This specific request affects two properties. They are 17670 East 64th Avenue and 6203 Panasonic Way. Both properties are undeveloped. The Northern properties about nine and a half acres in size.'",
        "'speaker_6': 'The southern property addressed off of Panasonic Way is about five and a third acres in size. The applicant is requesting rezoning to allow for future transit oriented development on both parcels, and the request is to rezone from several former Chapter 59 districts and overlays to S-Max 12 A with the AIO and DOS six overlays.'",
        "'speaker_6': 'Slide six shows the specific districts that are requested. So some x 12 is in the suburban neighborhood context. It's a mixed use district, 12 stories maximum. It allows some auto oriented design flexibility that is associated with suburban context zone districts, but also has additional standards that necessitate pedestrian oriented design elements, particularly along primary streets.'",
        "'speaker_6': 'And those things are baked into the standards for that district. The AIO is the DIA influence overlay zone district. It prohibits single and two unit residential and also requires that navigation easements be filed prior to rezoning approval or approval of a site development plan.'",
        "'speaker_6': 'And I just want to note that that requirement has been met. The applicant provided proof of existing easements covering both properties fully that DIA has said meets that requirement. Finally, the DOH six overlay is the painting station next design overlay district, and this was created by council just a few months ago.'",
        "'speaker_6': 'It allows for flexibility and signage in conjunction with an approved district plan. Moving on to Slide seven, existing context for zoning the so the sites themselves are zoned CMU 20 with waivers and conditions and CMU 30 with waivers and conditions and then with various overlays.'",
        "'speaker_6': 'On top of those, the surrounding zoning has similar mix of overlays, but to the north is gateway zoning to the south and west DIA zoning into the east. Smc's eight zoning with the same overlay is being sought by the applicant and the Smc's eight.'",
        "'speaker_6': 'Zoning was part of a larger rezoning earlier this summer for the full and wider properties. It was approved by council back in June or July. Slide eight, more information on the existing zone districts. So the CMU 20 and 30 are both former Chapter 59 mixed use districts.'",
        "'speaker_6': 'Both have a 1 to 1 floor area ratio and waivers and conditions are a part of both zone districts. Those waivers and conditions restrict the residential uses that are allowed on the sites, but those restrictions are now out of date, with updates that were made to the AIO earlier this summer by council.'",
        "'speaker_6': 'And furthermore, the redundant with the AIO. So the waivers and conditions are no longer needed so long as the AIO is mapped on the sites, which is what's proposed. The overlay is currently mapped on the site. Don't actually apply when the underlying zoning is a former Chapter 59 district.'",
        "'speaker_6': 'They apply once the property is re zoned to a Denver zoning code district. They are, as already mentioned, the airport influence overlay and the Pioneer Station Next Design Overlay District. But currently one of the parcels also has the ur1 adult use overlay and the applicant is now proposing to keep that overlay, but the other two would be'",
        "'speaker_6': 'kept as part of the proposed rezoning. Slide nine shows the existing context for land use, so the sites themselves are undeveloped. To the north is an agricultural property that does not appear to be in active use. There is a single family residential home on that property.'",
        "'speaker_6': 'To the south is the station in park and ride for 61st and penny station to the east. Mostly undeveloped land, although the Panasonic building is located in that vicinity and then to the west, more undeveloped land and the A-line alignment.'",
        "'speaker_6': 'Slide ten shows imagery to attach to each of these land uses. So the first two images at the top are the subject properties. Then to the north, across 64th Avenue is the farm use that's no longer active to the east.'",
        "'speaker_6': 'Across Panasonic way is the Panasonic building and then to the south is the park and ride lot for the station. In terms of process. This followed standard notification procedures throughout. Planning Board had its public hearing on August 3rd and voted to recommend approval by a vote of 7 to 0.'",
        "'speaker_6': 'It then went to Luti committee which moved it on to council. The public outreach was provided or notification was provided to the RINO's that are listed at the bottom of Slide 11 and no public comment has been received.'",
        "'speaker_6': 'Moving on to Slide 12 shows the review criteria for the rezoning and the standard five criteria do apply. Slide 13 will be starting with the first criteria of consistency with adopted plans. And the applicable plans in this area are Company 2000, Blueprint, Denver and the 61st and Pioneer Stationery Plan.'",
        "'speaker_6': 'Slide 14 shows areas of consistency with comp plan 2000. The strategies listed here on the slide were found to be consistent with the proposed rezoning and for additional details on those, please refer to the staff report. Slide 15 Transitions to Consistency With Blueprint Denver So the subject properties are located in an area of change and the land'",
        "'speaker_6': 'use concept is mixed use for the Northern Parcel and transit oriented development for the Southern Parcel Blueprint. Denver also provides street classifications for the surrounding street network, but those classifications were updated by the 61st and Pioneer Stationary Plan.'",
        "'speaker_6': 'So moving on to Slide 16, this shows the street classifications as that plan updates blueprint Denver and so 64th Avenue to the north is identified by that plan is a future commercial arterial Telluride way which runs it's the curving street that runs throughout the station area identified as a mixed use arterial.'",
        "'speaker_6': 'And then Panasonic Way, which runs directly adjacent to the southern property, is identified as a mixed use collector. And these street classifications of collector and arterial streets match up well with the density that's proposed by the rezoning. Moving on to Slide 17 are the land use recommendations from the stationary plan.'",
        "'speaker_6': 'The concept land use recommended by the stationary plan is mixed use employment for the Northern Parcel and Todd Transit Community core for the Southern Parcel. Slide 18 shows the recommended building heights by the stationary plan. And for both properties, it's a 12 storey maximum.'",
        "'speaker_6': 'Slide 19 is about the 61st and the general development plan. So GDPs are not adopted plans, but they do provide more detailed and site specific guidance for properties that are under GDPs than what you would find in an area plan.'",
        "'speaker_6': 'And so the GDP is relevant for that reason. The land use recommendations from the GDP are mixed use employment for both the northern and southern properties. So a little different from the guidance from the other adopted plans which identified mixed use for one or mixed use employment.'",
        "'speaker_6': 'And then Todd for the Southern mixed use, employment is what's recommended by the GDP for both parcels and the concept building height is 12 storeys as recommended under the GDP. So moving on to Slide 20, just to summarize consistency with adopted plans.'",
        "'speaker_6': 'So what we have here is a situation where a variety of mixed use land use recommendations are provided that apply to the two parcels, those being mixed use, mixed use employment or transit oriented development. The Smc's 12 aid districts implements the intent of each of these land use recommendations.'",
        "'speaker_6': 'And it also meshes well with the recent rezoning to the East, which uses SIMEX districts to implement similar land use guidance from those same plans. Moving on to the second criteria, then uniformity of district regulations. The proposal would zone out of a former Chapter 59 zone districts and into the Denver zoning code and also implements overlay districts'",
        "'speaker_6': 'that are consistent with what is mapped in the surrounding area. The third criteria public health, safety and welfare. That criteria is met by virtue of implementing the city's adopted plans. Criteria number four justifying circumstances identified as a changed or changing condition.'",
        "'speaker_6': 'Those change conditions being the opening of the station just south of the subject properties. New and updated regulatory tools from within the last year, the creation of the Smc's 12 Aid District last November. Updates to the AIO. The creation of the DOH six overlay.'",
        "'speaker_6': 'It's making use of regulatory tools that have been recently put in place for the purpose of mapping in this area. And finally, there is increased development activity and interest now with development of the station and the rezoning of the properties in the station area.'",
        "'speaker_6': 'So finally, with regard to consistency with neighborhood context, zone, district purpose and intent, that criteria is also met is detailed in the staff report. And so wrapping up with the final slide CPD recommendation is approval based on finding that all of the review criteria have been met.'",
        "'speaker_1': 'All right. Thank you. CORTLAND We have one speaker tonight and that is Ryan McCaffrey. You have 3 minutes.'",
        "'speaker_6': 'Good evening, council members. My name is Ryan McBride with Norse Design, where I'm the applicant representative this evening, 1101 Banning Street, Denver, Colorado. I don't have anything to add. I just want to say thank you to Cortland and Staff for getting us to this point tonight.'",
        "'speaker_6': 'But and we look forward to moving forward with this project eventually.'",
        "'speaker_1': 'But I'm here to answer any questions you have. Thank you. Thank you. All right. That concludes our speakers questions from members of council. Councilman Ortega.'",
        "'speaker_3': 'Thank you. I'd like to ask Cortland if you can come up to the microphone. So looking at slide 17, it looks like the site to the north. Is primarily focused on employment, but it's a mixed use district. So will that mixed use include any residential or is the residential only?'",
        "'speaker_3': 'Primarily focused on this site to the south.'",
        "'speaker_6': 'So the zoning would allow residential on either of the properties. And then the IIO further restricts residential. That's allowed it allows multi-family residential, but not single or two unit residential.'",
        "'speaker_3': 'So can you talk a little bit about the noise abatement requirements that are required for both sites?'",
        "'speaker_6': 'Sure. Very generally, I know that the building code was recently amended and that additional provisions were provided in that building code update that were modeled after noise abatement procedures that are in place in Aurora that provided the model for those.'",
        "'speaker_6': 'So there's the building code and what's in it, as well as additional provisions that were added locally to help abate noise.'",
        "'speaker_3': 'Okay. And then just to clarify, the maximum heights on either one of the sites is 12 storeys. Correct. Okay. Thank you.'",
        "'speaker_1': 'Great. Thank you. Um, any other questions for members of council? All right, CNN that concludes all of our questions. That comes from members of council. The public hearing for Council Bill 599 is now closed. Comments by members of Council Councilwoman Gilmore.'",
        "'speaker_2': 'Thank you, President Brooks. And, you know, I'm glad that Councilwoman Ortega asked the question about the increased building code.'",
        "'speaker_0': 'That to really.'",
        "'speaker_2': 'Mitigate noise for folks who are going to actually reside in the TOD Station area. So sixty-firsts and PENNER, we need to make sure we're creating the housing opportunities to really attract the retail and activate this TOD Station. And so this rezoning will allow the developer to look at added opportunities and going up to 12 stories, looking straight'",
        "'speaker_2': 'to the West, they will have unobstructed views of the Rocky Mountains because it butts up right to Panya. And then on the western side is the Rocky Mountain Arsenal National Wildlife Refuge. And so the opportunities for folks to really live, work and play close to home will be realized through, you know, this first step forward with the'",
        "'speaker_2': 'rezoning. And I will be supporting this tonight. And if my council colleagues are coming along on the District 11 tour on Friday, you will actually get to see this site firsthand and will be touring the Panasonic building, too.'",
        "'speaker_2': 'So just a little plug for you to come out and join us in District 11 on Friday. Thank you, President Brooks.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. If you are going on the tour, raise your hands. No, I'm just joking. Okay. Other other comments from members of council. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_4': 'Gilmore I can eat new Ortega. I. Susman My black eye. CLARK All right, Espinosa.'",
        "'speaker_0': 'FLYNN Hi.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'I please close the voting and announce the results.'",
        "'speaker_4': '11 eyes, zero nays.'"
    ],
    "Zoning Change for Pearl Street and East 17th Avenue Properties.": [
        "'speaker_1': '11 eyes, zero nays. Council Bill 599 has passed. Congratulations. Councilwoman Black, will you please put Council Bill 624 on the floor?'",
        "'speaker_8': 'Thank you. Mr. President, I move that council bill 624 be placed upon final consideration and do pass it.'",
        "'speaker_1': 'It has been moved. Can I get a second? It has been moved in second to the public here for council. Bill 624 is open. May we have the staff report? A barge. How are you this evening?'",
        "'speaker_7': 'I'm very well, thank you. Members of council. Good evening. I'm as council president, Burke said a barge with the Department of Community Planning and Development. I'll be presenting an official map amendment. Along Pearl Street, between 16th Avenue and 17th Avenue.'",
        "'speaker_7': 'There's a range of addresses. And then moving on to slide two. You see that the site is in Council District ten. And on slide three, that it is in the uptown statistical neighborhood. On slide four, the property is 1.44 acres.'",
        "'speaker_7': 'It's a full half block. And the applicant request is custom zoning based on the CMCs eight zone district, and it would be a planned unit development or PWD. And also they propose to retain the current uptown design overlay idea, one that applies on most of the site.'",
        "'speaker_7': 'Looking at site five, the zoning on the site in an area is almost exclusively urban centered neighborhood context. On the site, the heights range from 5 to 8 storeys permitted now and the it's in mixed use and main street districts, the surrounding districts are a similar mix.'",
        "'speaker_7': 'The on slide six, the City Park Natural History Museum view plane applies to this site as it relates to the site. It limits heights to 130 to 135 feet approximately, which is quite a bit less limiting than the existing or proposed zoning.'",
        "'speaker_7': 'So it it doesn't have have an effect on limiting building height at this time. The on slide seven uptown uptown design overlay d01 applies to most of the site. Now that's the yellow area within the red area, which is the proposed rezoning.'",
        "'speaker_7': 'And the proposal actually would extend it to apply to the whole site. So it would also include that northern little area there. The design overlay implements additional qualitative design standards and guidelines that are used by staff to review projects in the area.'",
        "'speaker_7': 'On Slide eight, you see that the those guidelines address considerations like vehicular access, structured parking facades, the design of those facades, architectural scaling, masonry materials, facade transparency. So it's an additional level of review that happens for projects in the area with the intent of ensuring that the higher density projects which will happen throughout uptown as it becomes'",
        "'speaker_7': 'more and more of an urban residential neighborhood, will have a high quality human scale design. On Slide nine, the existing land use on the site is mostly surface parking. There's also commercial retail, residential and office uses and a mix of similar uses on the surrounding lots.'",
        "'speaker_7': 'Looking at Slide ten, some photos of the site. The photo on the top is kind of the iconic view of the tavern building there at 17th and Pearl. And a big part of the custom zoning approach that I'll tell you about in just a moment is about retaining that building and the one storey commercial building that you'",
        "'speaker_7': 'see just to the right of that on the site while allowing for additional redevelopment on the remainder of the site. And then on slide 11, if you look at the lower image, we're looking down Pearl Street, looking east, and there's another big building on the site.'",
        "'speaker_7': 'That building faces 16th Avenue, that two story residential building. And the planned PWD does not propose to retain that building. On Slide 12, additional details about the rezoning request. It's based on the general building form in the CMCs eight zone district, and then it would add requirements to preserve key features of the two buildings that are defined'",
        "'speaker_7': 'as remaining buildings, the tavern building and the one story building next door. It varies height limits by sub areas across across the site to redistribute the height entitlement from where those remaining buildings are to the remainder of the site.'",
        "'speaker_7': 'And it includes some site standards that help differentiate the remaining buildings from new construction. On Slide 13, you see the proposed sub areas and over on the right hand side of Slide 13 in sub area C and D, those are the areas that face 17th Avenue.'",
        "'speaker_7': 'So Saberi, A D has the tavern building in it and so various C has the other remaining building sub areas. E and F are really set up to help differentiate those buildings from what will happen on the rest of the site, which will be on in some areas A and B and on the next slide side 14'",
        "'speaker_7': ', the image that's towards the bottom of the slide is a three dimensional representation of those sub areas, along with the proposed permitted height in them, which would be starting with the sub area on 16th Avenue is Siberia. A The height limit would be 74 feet and six storeys.'",
        "'speaker_7': 'It then goes up in the center of the site. In summary, a B to ten stories or 110 feet. 110 feet is the maximum building height on the site now and then the remainder of the sub area is closer to 17th avenue d, e, c, d, e and F.'",
        "'speaker_7': 'All relate to the preservation and maintenance of those remaining buildings limiting height in Siberia, C and D to the parapet, height of those existing buildings. And then in summary, E, which wraps around the tavern building, the height is limited to one story, so it would actually drop down before going up again to to the redevelopment area in'",
        "'speaker_7': 'the center of the site. On Slide 15, there's some variation in required build to and setbacks from the underlying zoning on most of the site server's avian seats. ABC Andy. It would be the same as the CMCs eight zone district, but in summary, E and F the build to and setbacks are varied to help differentiate the remaining'",
        "'speaker_7': 'buildings. And so there's actually a small setback so that as you walk along the street, the buildings will set back just as you pass the remaining building before coming back to the sidewalk edge where the new development is happening.'",
        "'speaker_7': 'An important part of the PD. This is slide 16. There are. There's a two page spread of tables. There's one for each of the two remaining buildings which outline the key features that must be retained in those buildings.'",
        "'speaker_7': 'And on Slide 17, there's just a really high level summary of what those tables include, is that on the most visible area of the facades of those buildings, which of course includes the street facing facades facing Pearl Street and facing 17th Avenue, as well as the most visible part of some of the side facades.'",
        "'speaker_7': 'The PD directs preservation of the brick facades themselves the cornice, the brick parapet, the chamfered corner configuration on the tavern building. Then there's also a secondary area of facade defined that is a visible area of side facades. So for example, the side facing second floor of the tavern building will remain visible after redevelopment because the height limit'",
        "'speaker_7': 'right next to it will be one story as the building steps down. And there there's a little bit more flexibility that the brick facade would have to be retained, but new window openings could be placed in that in that facade.'",
        "'speaker_7': 'And then on Slide 18, just to show you, there's an attachment to the PD that includes as built drawings of those remaining buildings. So that we clearly know right now where all of those elements are and what their dimensions are so that they can be retained in the future, like the the cornice and the existing window openings'",
        "'speaker_7': '. On Slide 19. The process to date has included communication with the wide range of Arnaud's that are adjacent or near the site. And then on Slide 20. Just list the key process dates up until this hearing. And for each of the previous meetings, the planning board hearing, the delivery committee meeting and this hearing the Arnaud's listed on'",
        "'speaker_7': 'the previous slide were notified and signs were posted on the site for planning board and for the City Council hearing for public comments. We've received two written comments. Both are letters of support. Capitol Hill United Neighborhood actually helped organize a neighborhood assembly with Uptown on the Hill, Swallow Hill, historic Denver and the applicant team.'",
        "'speaker_7': 'And at that neighborhood assembly, attendees voted unanimously to support the planned unit development concept for this site. And then Chun has also just sent in an email of clarification saying that they do support the height that's proposed at the 16th Avenue end of the site as well.'",
        "'speaker_7': 'At the planning board hearing. Two speakers spoke in favor of the application. On Slide 22, looking at the review criteria for considering a rezoning, the first consistency with adopted plans. Slide 23 is Comprehensive Plan 2000, which recommends conserving land by promoting infill development consistent with neighborhood character, investing in a range of housing types and services, and promoting'",
        "'speaker_7': 'sustainable centers with jobs and housing near transit. On Slide 24 Blueprint, Denver designates the site with the concept land use of mixed use and the entire site and surrounding areas within an area of change where Blueprint Denver foresees most of the city's future growth.'",
        "'speaker_7': 'On Slide 25, the adjoining street 17th Avenue is a mixed use arterial, and Pearl Street and 16th Avenue are local streets. The Uptown Neighborhood Plan. This is slide 26, also applies to the street, to the site. It's an older plan from 1986, supports mixed uses in this location.'",
        "'speaker_7': 'It talks about there being a distinction in height and bulk between downtown and the uptown area where the site is located. And that existing development pattern should be referenced to establish an appropriate pattern of scale in bulk that encourages continuity of historic character.'",
        "'speaker_7': 'And then the diagram that you're seeing at the bottom of this slide is a diagram of heights that are permitted by the Natural History Museum, City Park View Plane, and it's just included there because the plan says that closer to downtown, it's really that the heights that are permitted by that view plane are the appropriate maximum heights'",
        "'speaker_7': '. And then it says it should step down further than that, moving into the neighborhood where the proposed rezoning is located between Pennsylvania and Park Avenue. And just to note, that's where the proposed rezoning is. Locating the view plan would permit 136 feet, and the maximum proposed height is 110 feet.'",
        "'speaker_7': 'So KPD finds that the proposed PD is consistent with applicable adopted plans in terms of uniformity of district regulations. The next criteria on slide 27, we find that it would result in uniform application of district building form use design and design regulations across the site that the proposed rezoning furthers the public health, safety and welfare, primarily by'",
        "'speaker_7': 'implementing adopted land use plans. On slight Slide 28, we look at the justifying circumstances criteria for a MAP amendment. The applicant has indicated justifying circumstance of changed conditions. You know, clearly this is an area that has and will continue to undergo quite a bit of change.'",
        "'speaker_7': 'Looking at Slide 29, there are two images and it's just really interesting to see that the image on the left from 1933, it might be a little hard to see, but the the neighborhood is is pretty filled in.'",
        "'speaker_7': 'There's lots of buildings. It's a high density, vibrant neighborhood. In 1933, fast forward to 2014, mostly surface parking. So we're moving back towards 1933 in terms of what kind of neighborhood this will be on slide 30, consistency with neighborhood context, zone, district purpose and intent.'",
        "'speaker_7': 'The proposed underlying zone district is in the urban center neighborhood context, which is consistent with this area, as is the general building form in the CMCs eight zone district. And then on Slide 31, just looking at additional criteria that apply to use of a planned unit development.'",
        "'speaker_7': 'So as you know, it's CPD policy to use base zone districts whenever they can get the desired result on a site. However, there are exceptions. We believe this is one. The zoning code talks about the unique and extraordinary circumstance, justifying use of APD as being where a customized zoning approach is necessary to protect and preserve the character'",
        "'speaker_7': 'of a historic structure or history or historic district. It's my understanding that those two buildings that are defined as remaining buildings probably would not qualify for local landmark designation. And we have a pretty high bar here. However, you know, they're well-loved buildings in the neighborhood.'",
        "'speaker_7': 'And it's also possible that the 17th Avenue corridor would actually qualify as a historic district. And if so, those would be contributing buildings in the historic district, which would protect them. However, that's a that's a long process that would involve a lot of a lot of the neighborhood.'",
        "'speaker_7': 'And so in terms of protecting and saving those buildings now, I think this is a unique and extraordinary circumstance justifying the use of this of the PD to protect the buildings. So on Slide 32, CPD recommends approval of the Map Amendment application based on finding that all review criteria have been met.'",
        "'speaker_1': 'Great. Thank you. Tonight, we have five speakers on Council Bill 624. I'm going to just call the first five speakers. So Michael McNally, Josh Larimer, Sean Maley, Andy Lewicki, Tom Dragonet. You each have 3 minutes. Come on up to the front.'",
        "'speaker_0': 'Michael McNally and with Sutherland Company, the owner and developer and the applicant in this case. I want to thank Council President, council members for your time tonight and for hearing this. This application. I'll give you a quick history on this project.'",
        "'speaker_0': 'In the spring of 2015, we identified this site and started working with with the landowner and with our architects to do our due diligence, put the land under contract, started to figure out what we could do here when it's so far that we went through the landmark process and were granted the rights to pursue the permits.'",
        "'speaker_0': 'We actually went through a key concept plan and actually got approval for the initial plan. We then closed on the land. I guess the press release with the Yellen closing sparked some community interest and from historic Denver and the surrounding neighborhoods about the saving the building.'",
        "'speaker_0': 'And so they approached us. We stopped. We met with them, had several meetings. And, you know, shame on us for maybe not being as sensitive and realizing the nature of those buildings. But we quickly listened. And I like to think that that's the kind of developer we are that.'",
        "'speaker_1': 'Will stop and.'",
        "'speaker_0': 'And listen to the community and and understand what's going on and see if we can find solutions. So we we quickly engaged with the neighborhood and had several meetings, several large format meetings, as well as over 20.'",
        "'speaker_1': 'Individual meetings with.'",
        "'speaker_0': 'Neighbors and constituents in the area. We studied many options. Historic Denver and other people even suggested maybe even adding more height. But we were very focused on trying to come in and stay under that 1/10 height limit. We felt that that was the appropriate height and massing there.'",
        "'speaker_0': 'So after several months of working in design, we we came up with this option that you see today. And it's a long story, but a year and a half later, we feel that with the preservation agreement that we have in place for the historic Denver, that any events he can can highlight more for you.'",
        "'speaker_0': 'When she speaks the rezoning process with the PD, we're able to to kind of come in and keep everything at the respective height limits, but figure out how to take what was up on the street where the tavern was and pull it to the back.'",
        "'speaker_0': 'And we we feel like at the end of the day, it's been a great public private partnership. It's taken a while, but at the end of the day, we have a better product and we're excited about this project.'",
        "'speaker_0': 'I'd like to thank Councilman Knew for his support and helped her in this process. The city staff historic Denver shine swallow hill uptown on the hill our many neighbors it's it's been a it's been a challenging yet rewarding process that we've been through.'",
        "'speaker_0': 'And we're excited to hopefully see this project advance. I'm available for questions if you have any.'",
        "'speaker_1': 'Thank you, Mr. McNally. Josh Larimer.'",
        "'speaker_2': 'Hello. My name is Josh Larimer.'",
        "'speaker_0': 'I am with Shears Adkins Rockmore.'",
        "'speaker_2': 'Architects at 1550 Wynkoop. I don't have a statement, but I'm available for questions.'",
        "'speaker_1': 'Thank you, Miss Larimer. Sharmila.'",
        "'speaker_6': 'Good evening, Mr. President. Members of City Council. My name is Shaun Maley. Address to 1660 Lincoln. And I've been working with Michael and Southern Land Company on this rezoning and outreach process. I'll keep my remarks very brief tonight and be here to answer any questions, but just wanted to make note of a few additional items.'",
        "'speaker_6': 'Again, this conversation started about 18 months ago when Southern Land began meeting with historic Denver Councilman New and other folks from the neighborhood regarding the tavern building in the site. And I want to give kudos to historic Denver, all the neighborhood groups and my client Southern Land as all parties worked extremely hard to get this project from'",
        "'speaker_6': 'the initial approved concept plan to the pretty concept that's before you tonight. I also want to commend city staff and CPD for all their hard work and their willingness to roll up the sleeves and work on this party with us.'",
        "'speaker_6': 'I know that parties have not been the mode of choice for zoning projects lately, but the ability to customize the zoning was absolutely essential to make this project possible. Also, just wanted to note the extreme lengths we've gone to to not only work with the neighborhood organizations, but every adjacent owner to this site.'",
        "'speaker_6': 'There's well in excess of 20 owners. And we've had.'",
        "'speaker_7': 'Meetings for.'",
        "'speaker_6': '12 to 18 months with every single property owner to make them aware of this project in every regard from the zoning, the preservation agreement, parking both on street and off street utilities, construction, logistics, timing, etc.. So again, we're very happy.'",
        "'speaker_7': 'To be here tonight.'",
        "'speaker_6': 'With this rezoning before you and I'm here for any questions. Thanks so much.'",
        "'speaker_1': 'Thank you, Mr. Reilly. Annie Levinsky.'",
        "'speaker_2': 'I'm Annie Levinsky. I'm the executive director of Historic Denver. And we're looking at 1420 Ogden Street. And I'm glad to be here tonight on behalf of our Board of Trustees to support this rezoning at 17th and Pearl from the CMC's eight and CMA x five to the Peabody.'",
        "'speaker_2': 'This rezoning did come about as well as has been mentioned as a result of our negotiations with SLC as the site owner to preserve the 116 year old streetcar commercial building that sits on the corner of 17th and Pearl and its adjacent one story addition.'",
        "'speaker_2': 'The building which we've all come to call the Tavern Building, is part of a series of important streetcar commercial buildings that line this section of 17th in the summer of 2015, when news of the plans to demolish the buildings broke.'",
        "'speaker_2': 'We did start hearing from a lot of community members. It was actually the most active social media outcry we've had and within a few days we had garnered 1700 signatures on a petition that we quickly cobbled together. And when I reached out to Southern Land Company, to their credit, they were very receptive to the conversation and willing'",
        "'speaker_2': 'to talk about it. And so I definitely want to express our gratitude for them for being so open and to working with us over the course of last summer. In the meetings, they mentioned to come up with a solution on how to develop all the adjacent vacant land and those parking lots that we hate to see, but'",
        "'speaker_2': 'also to preserve what was special about this particular location. And we it's, as has been noted, the preservation it accomplishes, I think, to desire goals of the preservation as well as maintain the same level of density as originally proposed for the project.'",
        "'speaker_2': 'In addition to the SLC has agreed to execute a second more detailed preservation agreement with historic Denver if the rezoning is approved, the additional agreement has already been drafted and provides guidance on changes that will be made to the building and will ensure its protection long into the future.'",
        "'speaker_2': 'Well, after the buildings, the new building is constructed, this solution, involving both the rezoning and the preservation agreement, were presented at the community meeting by Chan back in February of 2016. At that meeting was well attended and there was unanimous support for the concept.'",
        "'speaker_2': 'And as noted, Chan, who could not be here this evening, also sent a letter of support to you last week. So again, we are really grateful to Southern Land Company for their willingness to work on this. Also appreciate the leadership of Councilman Nu and the city staff and the whole team.'",
        "'speaker_2': 'It's been, I think, a great case study in how these situations can be resolved. And we really hope that this project will become a case study in how the old and the new in our city don't have to be in conflict, but can work together to make Denver an enduring city.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you, Miss Lewinsky. Tom Reagan. Any.'",
        "'speaker_6': 'I'm writing 8950 17th Street lawyer for Southern Land.'",
        "'speaker_0': 'And I'm here to answer questions of any.'",
        "'speaker_6': 'Come up that require my answer. Thank you.'",
        "'speaker_1': 'All right. This concludes our speakers questions for members of council. Councilman Espinosa.'",
        "'speaker_12': 'It's clearing us out.'",
        "'speaker_1': 'Yeah, I just saw that. I have Espinosa first and then Cain each.'",
        "'speaker_5': 'So don't care who answers it. I may have missed it. Is the building currently or planned to be a landmark structure or is it not? The 17. The one on 17.'",
        "'speaker_7': 'So no. None of the buildings on the site are currently landmark structures. And is it probable that none of them would actually meet the criteria for individual designation?'",
        "'speaker_5': 'Um, maybe a little bit too far back in the history of Denver, but do you know why those buildings weren't part of the urban renewal that sort of created the season of parking lots that we have there?'",
        "'speaker_7': 'I don't know. And plus one of the other speakers does, you know, I mean, we obviously lost a lot of buildings in the area and along that corridor, and some of them dodged the bullet putting these two buildings.'",
        "'speaker_5': 'All right. Thanks. No further questions.'",
        "'speaker_1': 'All right. Thank you, Councilwoman Kinch and then Flynn.'",
        "'speaker_12': 'Thank you, Mr. President. A question for you. Obviously, a good kumbayah found a common ground story, but I am a little nervous about the level of detail on the slide you showed with the corners and the windows and the turrets.'",
        "'speaker_12': 'In a landmark situation, if you needed to do new windows or technology changed, you had someone you could go to. I'm nervous about whether or not, you know, the simplest thing would work. I mean, we've run into this before with Pewds, where you have to get a rezoning because your door breaks, you know.'",
        "'speaker_12': 'So is there a process like that in the zoning realm that will avoid this coming back to council if something minor changes? I mean, I just I'm just curious about the level of detail.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_7': 'There is quite a bit of detail on the one side looking at the as built drawings, which are an attachment to the PDA. And yet the intention is we had a lot of discussion about that and developing the PD that the basic standards in the PD list the the just only the most important key features to retain'",
        "'speaker_7': 'like the cornice and the the window openings. The as built drawings include additional detail about quite a few things, but really they're just there as a reference so that if there's some question about where's the cornice and is this replacement similar to the original, that we have a reference point for answering those questions.'",
        "'speaker_7': 'But the Pudi isn't structured in a way that says that those sheets those as built a define what can happen there's a there's a broader range of things that can happen and those are just reference to that basically.'",
        "'speaker_12': 'Got it. And if there is a question, however, who does it go to? The zoning administrator? Who's the person who helps to answer those kinds of questions? I mean, it's it's an awkward place to do. I'm glad we're doing what we're doing is trying to be clear.'",
        "'speaker_12': 'But is there is there an administrative level where those questions will get answered?'",
        "'speaker_7': 'Right. So, you know, when we have challenges with zoning questions, there's a technical team that includes the zoning administrator that helps look at those things. And in a case like this, we bring in landmark planners to who, you know, understand the terminology and the architectural features that we're talking about.'",
        "'speaker_7': 'But we did very intentionally write it in consultation with the zoning staff so that it's it's written in a way that they can understand and really what's in the base. PD just has a few basic preservation objectives in the form of those key features to protect, and then the height limits that are set at the height limits'",
        "'speaker_7': 'of the buildings.'",
        "'speaker_12': 'Okay, got it. Thanks. And then one question for Annie Levinsky, please. The corner building makes a lot of sense to me. It's notable I had to look up a picture of the one story building next door. It's not memorable.'",
        "'speaker_12': 'Why? Why is that included? Especially being one story in an area where we're putting more density.'",
        "'speaker_2': 'We talked about that back and forth a lot. Our primary focus had been the two storey building, but also very much emphasizing the pedestrian scale of 17th. And part of what makes that scale special is the the street wall that's created there and that is consistent for we have gaps in it because of the surface parking.'",
        "'speaker_2': 'But where you don't have separate for service parking, you have one and two storey buildings along this part of the corridor. And so in talking to Southern Land, they agreed that they were willing to protect that it provides sort of a buffer and a transitional area to the larger project.'",
        "'speaker_2': 'But I'm not I can't recall exactly the level, the language in the PD, but in our preservation agreement there is quite a bit more latitude on the one story building because there's not as much original fabric. So it's really maintaining the scale and the street while there, but not as much because it is not a detailed building'",
        "'speaker_12': '. Super. Thank you so much.'",
        "'speaker_1': 'Thank you. Councilman, can each. Councilman Flynn.'",
        "'speaker_0': 'Thank you, Mr. President. I guess I for first, I want to congratulate and thank all the players here from Southern Land and councilman knew and the community for coming up with a real creative solution to this. I think we've all been reading some of the stories that have occurred and whatnot.'",
        "'speaker_6': 'But I'm very I'm curious about one thing, just as a.'",
        "'speaker_0': 'Matter of curiosity. Sub area E is has a 16 from Abe. Maybe you can address this sub area e is a.'",
        "'speaker_6': 'Once has a one.'",
        "'speaker_0': 'Story 16 foot limit on it and it's kind of L-shaped between other suburbs. I'm just curious, what's the what's the purpose of that?'",
        "'speaker_7': 'So the purpose of that sub area. So Councilman Flynn is talking about severely wrapping around Siberia d there is to differentiate the remaining building, the tavern building from the new construction that will happen the bigger new construction that will happen adjacent.'",
        "'speaker_7': 'And so this is a preservation principle to help, you know, differentiate the old or historic. From the new. And what's happening here is that the height will drop down because there's that low height limit and it'll be like a connector building and then the height will go way back up again.'",
        "'speaker_7': 'That connector building will also step in because you'll see that Subrip E is the only sub area that has setback requirements.'",
        "'speaker_1': 'Okay.'",
        "'speaker_7': 'Right. So Sudbury is all about differentiation.'",
        "'speaker_0': 'It actually sounds very interesting, but I'm just curious why it was lower than even D and and C.'",
        "'speaker_7': 'Right. So the buildings that it helps the tavern building separate from the new construction. All right.'",
        "'speaker_0': 'Thank you, Mr. President.'",
        "'speaker_1': 'Yeah, thank you, Councilman Flynn. Councilman Gilmore, did you pop out of there?'",
        "'speaker_2': 'No, thank you, Mr. President. Councilman Flynn asked my question.'",
        "'speaker_1': 'I get that synergy. Okay. Councilman Espinosa, are you back.'",
        "'speaker_5': 'Up to more? Yep. Sorry. Actually, that's sort of interesting that you so very e would exist because they could have had a building. The sort of I don't know. It was wasn't unusual for those buildings to be smacked up against one another in that context.'",
        "'speaker_5': 'So along those lines, though, was there ever a conversation about doing some sort of encroachment on top of the building? ALA What we just did with the Emily Griffith Center.'",
        "'speaker_0': 'You know.'",
        "'speaker_7': 'I actually inherited this case from Tim Watkins, so I wasn't around for the early part of the process. Do any of you.'",
        "'speaker_6': 'Remember discussion of.'",
        "'speaker_0': 'Something coming. We definitely looked at several options, some some of them included, maybe cantilevered over the existing structures. But when everything was weighed out, I think context and massing, we wanted to respect those those existing structures. The experience along 17th, as Andy noted, can leverage can get expensive.'",
        "'speaker_0': 'So we found that we we could get the net rentable that the project needed with the, you know, the additional storeys within the existing height limits. So that's where we focused and tried to stay off those buildings as much as possible.'",
        "'speaker_5': 'Yeah, there's a, there's a fringe benefit in that a little more daylight into that area for a longer period of time. So there's it's it's overall a good thing. One other question was, was there ever a discussion in determination along something along the lines what we do with conservation overlays, where we would have sort of compelled work'",
        "'speaker_5': 'on on that in some areas D or so very easy to go through landmark design review and just simply leave it at that and say here's where we're working. But in that context, you're going to have a mandatory designer view.'",
        "'speaker_7': 'Yes. So thank you for the question, Councilman. In a conservation overlay, we actually wouldn't do that. Typically, you know, the intent is that when something is a historic landmark, it is designated, you know, either individually or in a district.'",
        "'speaker_7': 'And that that's clearly when the preservation system applies and things go through preservation review at the Landmark Commission or other commissions in situations like this or like in a conservation overlay district where the desire is just to promote a compatible new development that's compatible with a certain character, we would try to define things in a way that's'",
        "'speaker_7': 'simpler and more quantitative than in a preservation situation. And so we did sort of steer clear of the idea that alterations to those buildings would be reviewed by the Landmark Commission, say, or even specifically by landmark staff. Just to just to clarify that boundary, you know, that they are not designated.'",
        "'speaker_0': 'Okay, great. Thank you.'",
        "'speaker_1': 'All right. Any other questions? Members of Council. Okay, great. This concludes our questions and comments by members of Council. Uh, Councilman new?'",
        "'speaker_7': 'Yes. I want to thank.'",
        "'speaker_6': 'Southern Land Company. This what a great project that you're putting together in the area. We're trying to promote greater of residential development and and the retail, but also preserving the historic building, you know. You know, you go you over that tavern you really appreciate it is sort of a cute little thing.'",
        "'speaker_6': 'And and it's going to be a great addition.'",
        "'speaker_7': 'To that area. And I'm so.'",
        "'speaker_5': 'Glad we're we're saving.'",
        "'speaker_6': 'It. So it was an excellent project that you put together and and a good example.'",
        "'speaker_7': 'Of using.'",
        "'speaker_6': 'The PUD as a as a to I like that.'",
        "'speaker_7': 'I to several.'",
        "'speaker_6': 'Meetings and listening and was something that you emphasized Michael it is so true. We had so much discussion in area all the Southern land people and representatives and architects listen to residents in the community about what they wanted and what they wanted to save and what they thought.'",
        "'speaker_7': 'Was good for their community.'",
        "'speaker_6': 'So I really appreciate appreciate that. And and it's really a model for how I think I don't know who mentioned it, but it could be a model for how we go forward showing collaboration between developers and the community.'",
        "'speaker_6': 'So it was a really a great project and I really appreciate all you've done and I'm really proud to support this project and this whole redevelopment that we're doing in Colfax, in North Capitol Hill.'",
        "'speaker_7': 'And I also invite all my colleagues.'",
        "'speaker_10': 'To go and get.'",
        "'speaker_6': 'A great hamburger sandwich and beer at this tavern is just wonderful.'",
        "'speaker_7': 'Too. So we'll have to convene over there one night.'",
        "'speaker_6': 'But congratulations and I think you'll be a wonderful project for the community.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. New Councilman Espinosa.'",
        "'speaker_5': 'Yeah, I just it's a pleasure, actually, to be voting on something like this. So I want to thank the owner. I want to thank CPD for four for reaching into the party box and finding out that there's a really terrific tool that we have in order to reach this sort of compromise.'",
        "'speaker_5': 'I want to thank the community and historic Denver for being involved in that dialog and for everybody finding consensus. Because, you know, this is what that tools for when you have something that defines the sort of character of an area, you know, and we have the means and the in the right developer with the wherewithal to make'",
        "'speaker_5': 'that happen. It's really nice to see that we can end up in this forum with a solution. So I'm sorry that it may have been some teeth pulling in in a struggle to get there, but I think where you've ended up is in a really good place.'",
        "'speaker_5': 'And I think Denver's better will be better generations ahead of now when we're long gone, basically seeing that marriage of what you've what you had and what you're going to do. So thank you. And I thank you CPD staff as well.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. I'll just you know the comments. I'll just make a couple of comments. Councilman knew this was in my district for four years and then you stole it at just the right time. Just when it was it was getting heated up in the in the neighborhood.'",
        "'speaker_1': 'This is something that I'm supportive of. Good job. Both all three sides, the city and our governor and also the developer, I think I think is great. The comments I actually want to make have to do with our notification of neighborhoods.'",
        "'speaker_1': 'So this is actually a you can take this back to your boss and Gabby, you can take this to the mayor's office. I think it's absolutely ridiculous that the points, the five points historical redevelopment court was on the required neighborhood.'",
        "'speaker_1': 'I mean, that is 15, ten, 12 blocks away. And they could care less about this project or where it is. And also, you know, Colfax Business Improvement District is is on this as well. So I've been saying this for like five, six years, maybe five years that we need to look at our neighborhood notification and make sure'",
        "'speaker_1': 'it's accurate, make sure neighborhoods aren't defunct because that list was about 12 to 15 and that's a lot. So anyway. It has been moved and seconded. Madam Secretary. Rocco.'",
        "'speaker_4': 'New Ortega. I. Sassaman. I Black Eye. Clark. Espinosa. Hi. Flynn. I. Gilmore. I. Cashin. Carnage. Mr. President.'",
        "'speaker_1': 'I please close the voting. Announce the results.'",
        "'speaker_4': 'A Lebanese.'"
    ],
    "Zoning Change for 4150 N. Elati St. from Industrial to Mixed-Use Residential.": [
        "'speaker_1': '11 eyes. We keep looking at councilman lopez. 11 Eyes Council Bill 624 has passed. Congratulations. Good work, guys. All right, Councilwoman Black, the last bill. Can you please put it on council? Bill 752 on the floor.'",
        "'speaker_8': 'Thank you, Mr. President. I move that council bill 752 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved in, seconded the public hearing for council bill 752 is open. Sarah White. Can we please have the staff report?'",
        "'speaker_2': 'Good evening. I'm Sarah Waite with Community Planning and Development. Here to present staff report four 4150 Melody Street. On slide two, you can see that we are located in District nine. Slide three, you can see we are in the Globeville statistical neighborhood.'",
        "'speaker_2': 'Slide four details. The request that we have here, the property is just under 70,000 square feet and they are requesting a rezoning to potentially in the future redevelop the site for multi-family housing units and to better align it with the adopted plans in place.'",
        "'speaker_2': 'The request is to rezone from IAU oh two to C-Max 12 or x 12. I'm sorry, that's incorrect. On the slide, slide five, the requested zone district is c x 12. In the urban center neighborhood context. It is a residential mixed use district with commercial uses limited to the ground storey with a maximum height of 12 storeys'",
        "'speaker_2': '. The surrounding zoning in the area immediately to the northwest and south of the site is all IAU oh two. We do have some CRM ex 20 directly to the east and then a little further west towards the station.'",
        "'speaker_2': 'We have some pieces that have already been re zoned into TMX and CMC zone districts. The surrounding land use is primarily industrial, currently with a mix of multifamily and single family scattered around. Slide eight shows just some of the examples of the context in the area.'",
        "'speaker_2': 'It's really mixed. We have some three storey newer multifamily. We do have some low scale single family in the area, as well as some one and two story residential or industrial. I'm sorry. There were several are and I was notified during this process and the planning board moved on their consent agenda to recommend approval, as well as'",
        "'speaker_2': 'the committee decided to move this forward on the August 30th agenda. And we have had no public comments. The five zoning criteria are applicable here. We have several plans in place, including Comprehensive Plan 2000, Blueprint, Denver 41st and Fox Stationary Plan and the Globeville Neighborhood Plan.'",
        "'speaker_2': 'On Slide 13, we have several of the principles from comp plan 2000 that are applicable to this rezoning request. Those are detailed further in your staff report, but they're mostly related to infill development. Slide 14, we can see the Blueprint Denver recommendations for this area.'",
        "'speaker_2': 'This site is recommended for urban residential and it is an area of change. Slide 15, we can see the land use recommendations from the 41st and Fox station area plan. Again, we have a recommendation of urban residential and a recommended building height of 2 to 12 stories.'",
        "'speaker_2': 'Then Slide 16, we have the recommendations from the Globeville Neighborhood Plan, which reinforce the recommendations from the 41st and Fox station area plan. Again, we have urban residential area of change. And on Slide 17, you can see the height recommendations from the Globeville neighborhood plan with a maximum recommended building height of 12 storeys.'",
        "'speaker_2': 'So the rezoning request is consistent with all three of these plans. In relation to the uniformity of district regulations. This would consist of a uniform application of the Sierra Zone District and for the public health, safety and welfare through the implementation of adapted land use plans.'",
        "'speaker_2': 'The justifying circumstances for this request is that the land or its surrounding environs has changed. We have several areas of change here. We've got the 41st and Fox commuter rail station scheduled to open later this year. The proposed redevelopment in the area signals the change in the surrounding environment to the 2D context, and the current zoning of'",
        "'speaker_2': 'IOTA does not reflect the city's adopted vision reinforced in all of the small area plans. And then the consistency with neighborhood context and urban center neighborhood context is consistent in this area, and the Sierra Zone District does promote a safe and active, pedestrian, skilled, diverse area that we'd like to see in the TODDI and the Sierra.'",
        "'speaker_2': 'X12 applies to residentially dominated areas where 2 to 12 storeys is desired. So given that all five criteria have been met, CPD recommends approval.'",
        "'speaker_1': 'Wow. That was really good. Okay, so presentation is over. We have one speaker. Keith Hurley. You have 3 minutes. Thanks for being here. Good evening, counsel.'",
        "'speaker_6': 'I'm glad I'm the last one. I'm here to answer questions, but I do have a few.'",
        "'speaker_5': 'Comments, if I could. If they would. Please go ahead. I would just like to.'",
        "'speaker_6': 'Know that.'",
        "'speaker_5': 'I've been trying to I would love to stay there. But to get a permit to.'",
        "'speaker_6': 'Expand my building to accommodate our growth would be near impossible.'",
        "'speaker_5': 'Given the permitting circumstances in the in the city. I've been trying for ten months to get a permit to just.'",
        "'speaker_7': 'Build a.'",
        "'speaker_6': 'Break room and a bathroom for my employees. And I still don't have a permit. And the pot shop across the.'",
        "'speaker_5': 'Street thrives while we struggle to accommodate a growth. So I think it's best that we move out of our current location. And I just would like to.'",
        "'speaker_6': 'Get my frustration on.'",
        "'speaker_5': 'Just trying to expand, add people to my small manufacturer, and I think it's best that we move from that location.'",
        "'speaker_1': 'Okay. Thank you. All right. This concludes our speakers. Are there any questions for members of council? And I have one just to. Keith, can you can you come up? You are the tenant or the you own?'",
        "'speaker_6': 'I own the building. And my my I.'",
        "'speaker_5': 'Also my company operates a building. We are a small manufacturer of signs and lighting.'",
        "'speaker_1': 'Okay, great. And so you are you plan to move, but you want to you want to sell this property eventually, or will you be the developer?'",
        "'speaker_6': 'No, I'd like to sell the plant the property to an apartment developer.'",
        "'speaker_5': 'It's a it's a great location. We're one block from the light rail station with views of downtown. It's it's better suited for multifamily.'",
        "'speaker_1': 'Is is the sale of the property contingent on this rezoning. Yes, sir. All right, Councilwoman Ortega.'",
        "'speaker_3': 'I want to ask a question, and I'm sorry I didn't get your name first. Sarah.'",
        "'speaker_1': 'Go ahead, Sarah.'",
        "'speaker_3': 'Sarah, we've done a number of very high density rezonings in this area. And I want to know what kind of look is CPD taking when we look at the aggregate of the density that will be in this area, knowing that there is primarily one road into this site where we're going to see some serious traffic problems once'",
        "'speaker_3': 'all that development occurs, assuming it builds out to what has been proposed in all the rezone applications that have been brought to council.'",
        "'speaker_2': 'Sure. And I can't speak to any specifics on this site other than, you know, we do have a few small area plans in place that speak to recommendations generally of connections. Any time that we have development at a site development plan level, it's referred to all of the applicable agencies.'",
        "'speaker_2': 'So I really can't speak to it much more than that. You know, this is what the plans that were adopted by the neighborhoods call for here, this density.'",
        "'speaker_3': 'So so I guess I just want to draw this to the attention of my colleagues, because in this particular location, once we start seeing all of these proposed developments that we've already approved rezonings for, begin to move in.'",
        "'speaker_3': 'We're going to be expected to play some role in, I don't know, either white ministry, and I'm not sure how much the zones are taking into account that need that will exist into the near future. But again, with Box Street being the primary access point into this area, I don't see people going all the way around and'",
        "'speaker_3': 'coming in through the Globeville neighborhood unless they happen to be coming from the east side of town to get there. But really, from council on the downtown, that's the primary area. So I'm just raising that as a red flag that we need to be thinking about not only in this area, but where we're significantly increasing the density'",
        "'speaker_3': 'and we're wanting to ensure that the infrastructure is adequately employees to accommodate what we keep allowing to occur as higher density coming into these areas.'",
        "'speaker_2': 'Yeah. And if I may, I know that there have been some discussions related to the Fox home development about some additional access points to the neighborhood. It's a little further off and I don't know a lot of specifics about it, but there is that discussion happening as well.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Great. Any other questions for members of council? Actually, I have a question for Councilman Espinosa. Real quick, Councilman Espinosa. So I'm on the neighborhoods tonight. And one of the neighborhoods that this CPD made the developer reach out to is North Highlands.'",
        "'speaker_1': 'Do you believe that North Highlands, since you represent them, are concerned about this rezoning?'",
        "'speaker_5': 'Essentially, yes. To the point that Councilwoman Ortega was making in that the 38th Avenue underpass is our only connection from the north part of North Highlands and all of the sunny side to downtown. And it is now a odd intersection with Fox Street, which is the lone point of access to the South from this whole area.'",
        "'speaker_5': 'And so if we want to encourage my own constituents to access 41st and Fox, we don't have adequate we don't have any surface parking or anything on on on my side west of anchor. But we do have all that surface parking and whatnot that RTD put in there.'",
        "'speaker_5': 'So it's a very we're doing this thing in a very discombobulated way. And so I do think that if we're thinking in a sort of micro regional level, then yeah, both Sunnyside and Highlands would be concerned about that future.'",
        "'speaker_1': 'They didn't I didn't see them comment on that.'",
        "'speaker_5': 'No. I will be honest. I think they like being informed, but you won't see them comment because it's outside of their statistical neighborhood boundaries.'",
        "'speaker_1': 'Thank you for saying that right there. I will talk about that in my comments. Okay. This this concludes the comments for members of council. Public hearing of council bill 752 is now closed. I'll call on myself this be in my district.'",
        "'speaker_1': 'Representative. First of all, sir, apologize that you are experiencing those long waits for your permits. We are working. I can tell you, this whole council cares about efficiencies in our permitting department and we are subcontracting out. We are hiring new folks to deal with the demand that's going on.'",
        "'speaker_1': 'And so just apologize that your business isn't able to do. We hope sincerely that you stay in Denver. Denver is a great city and we would love to work with you in the future. I'll just say I'm going to be supporting this because it's consistent with the neighborhood plan that freshly has just been done 18 months ago'",
        "'speaker_1': '. I do raise the same concern as my colleague Councilwoman Woman Ortega. I don't think we have adequately thought about access points out of the neighborhood. It's one way and one way out, but we really have to put a lot of thought in that.'",
        "'speaker_1': 'And I think it's Crissy thing and allow Brad Buchanan and all the folks need to get together and we need to have a real conversation about that. To my third point, I do not know why we're notifying neighborhoods to neighborhoods away, especially active neighborhoods that I know if they had an issue, they would be commenting immediately.'",
        "'speaker_1': 'And so point taken on the 38th underpass because that is a contention point. But I would love someone on this council to take on the registered neighborhood conversation and just make sure that we have good, vibrant neighborhoods and that the reach out point isn't all the way across the city or 15 blocks away of folks who don't'",
        "'speaker_1': 'care about the particular development. I think it I think it's inefficient. So I will be supporting this. I'm just commenting. Okay. Any other members of council want to make a comment? My goodness. It is 8:00. Three public hearings.'",
        "'speaker_1': 'Well done, everyone. It has been moved the second it. Madam Secretary Brokaw.'",
        "'speaker_4': 'Black eye, Clark. All right, Espinosa. Hi, Flynn.'",
        "'speaker_0': 'Hi.'",
        "'speaker_4': 'Gilmore. I, Catherine. All right. Can each new Ortega assessment? Mr. President.'",
        "'speaker_1': 'I please close the voting and announce results.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'They're not going back there.'",
        "'speaker_1': 'Oh, there you go. Yeah. Yeah. Please call the voting results.'",
        "'speaker_4': '11 eyes.'",
        "'speaker_1': '11 eyes down to Bill 752 has passed. Congratulations, sir. There is no pre adjournment announcement except that I'm disappointed in my Colorado buff alumni up here. This man still doesn't have a hat. See no other business for this body.'"
    ]
}