{
    "Consent Agreement for Air Quality Monitoring Studies with National Jewish Health.": [
        "'speaker_0': '. No items have been called out and under pending. No items have been called out. Miss anything. All right. Madam Secretary, will you please put the first item on our screens? And, Councilman Ortega, you can go ahead with your comment.'",
        "'speaker_3': 'Thank you, Mr. Chair. This is a bill that it's actually an agreement, a consent agreement with National Jewish Health that will be doing some air monitoring at a number of city sites in the global Elyria, Swansea and neighborhoods and Exhibit A in the agreement has one of the names of the parks.'",
        "'speaker_3': 'That is not accurate. I did talk with the mayor's office and with Environmental Health today, and we're going to allow this to move forward tonight. They will file an amendment that changes the name of the park to correct it, and that should solve the problem.'"
    ],
    "Contract Amendment with Conduent State and Local Solutions for Photo Radar and Photo Red Light Services.": [
        "'speaker_3': 'This was actually brought to my attention by one of the residents in the community. And so I think to honor the park name change that we did a few months ago, we wanted that to be consistent. So that will happen and we can allow this bill to move forward.'",
        "'speaker_0': 'Thank you very much, Councilwoman Ortega. Madam Secretary, will you please put the next item on our screens? And Councilman Brooks, will you please for councilor as resolution 1437 on the floor for adoption?'",
        "'speaker_1': 'Yes, Mr. President. A move, the Council Resolution 1437 series of 2018 be adopted.'",
        "'speaker_0': 'It has been moved and seconded questions or comments from members of Council. Councilman Flynn. Thank you, Mr. President. This is a contract amendment to our conduit, conduit, local, state and Local Solutions Inc. contract for the operation of our four speed photo speed vans and the photo red light program.'",
        "'speaker_0': 'And it was an expansion of the of the photo red light program as well. And I held this over on December 17th because I had some questions. And once I got the data, I and looked at the contract.'",
        "'speaker_0': 'There's actually had some errors in the contract. It listed the wrong intersections where we were going to put in the cameras. So that alone would would call for us to kill it and ask for a new or a new amendment to be brought forward.'",
        "'speaker_0': 'But in the meantime, both traffic engineering and Denver police came down to visit me at the office today, and they looked at the the information that I presented on Monday to to the members here in an email. And and they agreed to evaluate the yellow change interval, the timing of the yellow light, and to see if that'",
        "'speaker_0': 'would eliminate red light running better than a than I can't a ticket camera can do. I pointed out, for instance, that in the city of Loma Linda, California, a camera had been giving out an average of 249 tickets per month until the traffic engineers adjusted the yellow timing and it ended up issuing one ticket every six days'",
        "'speaker_0': '. And that's the kind of results in the kind of safety we want here. And so they've agreed to to ask us to kill the contract tonight. So we're asking for a no vote on those. Based on those two factors, they're going to reevaluate the yellow change interval and other countermeasures and the fact that the contract amendment has'",
        "'speaker_0': 'the wrong intersections in it. And so they'll come back to us after this evaluation of all the other locations in up to maybe nine months and present us with with a different proposal. I do not oppose the expansion of the photo radar, a speeding van, and this contract would have added an additional van to that program.'",
        "'speaker_0': 'And so I've asked the administration to consider coming back to a sooner with a contract amendment that would add that van regardless, because these have been budgeted this has been budgeted for 2019 anyway, and I would support that.'",
        "'speaker_0': 'But I'm very grateful and thankful to DPD and traffic engineering for undertaking this because as I said before, the laws of traffic will always be trumped by the laws of physics. So if we give folks the requisite amount of time to come safely to a stop at a red light, I want to do that rather than just'",
        "'speaker_0': 'photograph an accident. So we asked for a no vote on this. Thank you. Thank you, Councilman Flynn. See no other comment, Madam Secretary, roll call.'",
        "'speaker_2': 'Flynn. No Black? No Brooks, no. Espinosa, no. Gilmore, no. Herndon.'",
        "'speaker_0': 'No. Cashman, no.'",
        "'speaker_2': 'Carnage, no. No, no. Ortega No. Susman No. Mr. President.'",
        "'speaker_0': 'No. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_2': '12 nays.'",
        "'speaker_0': '12 nays. Council Resolution 1437 has been defeated. Madam Secretary, will you please put the next item on our screens? And, Councilwoman Sussman, what would you like to do with this item?'",
        "'speaker_4': 'Thank you, Mr. President. I would like to request a one hour courtesy public hearing Monday, January 7th, 2019. On second reading or final consideration of Council Bill 18, Dash 1476 regarding governing the operation of electric mobility scooters.'"
    ],
    "Ordinance to Expand Eligibility for Refund Payments to Elderly or Disabled Persons Program.": [
        "'speaker_0': 'Thank you, Councilwoman Sussman. If there are no objections from members of Council on Monday, January 7th, there will be a one hour courtesy public hearing on second or final reading for Council Bill 1476. All right, Madam Secretary, please put the next item on our screens.'",
        "'speaker_0': 'Councilwoman, can each go ahead with your comment?'",
        "'speaker_5': 'Thank you, Mr. President. This is a really exciting bill 1507 And it's about a program that often isn't known by our residents, and it's really something for them. So that's why I called this out. This is first reading on the senior and disabled property tax rebate that used to just be for low income seniors and disabled folks'",
        "'speaker_5': '. It was progressive and that included both renters and owners. But we actually didn't see very many owners who were able to take advantage of the program. We have about 3 to 4000 households each year, though, that apply to the city and get assistance.'",
        "'speaker_5': 'And so this bill tonight really is going to help us reach more owners who are struggling to stay in their homes as our property taxes go up with the values of our homes to support both our schools and the city.'",
        "'speaker_5': 'So the program itself doubled in 2012, but owners were unable to use it. And today's changes are going to increase the limits for owners. For example, for a single senior to be that you needed to earn less than 16,000 for a single senior or disabled person.'",
        "'speaker_5': 'Going forward, you can earn up to 20,500. So a pretty significant increase in eligibility for owners who are seniors or disabled folks. And then I think one of the most important changes is that it will now start to cover families with children.'",
        "'speaker_5': 'We have, you know, a couple thousand of these owners in the city who are lower income. Maybe they bought a home and then experienced a disability or a divorce. Maybe they inherited a home from parents. But for whatever reason, they own a home but have a very low income.'",
        "'speaker_5': 'And these families with children, they will be able to earn up to $27,000 for a family of two, for example, or 33,000 ish for a family of four. So we're going to really be able to help more single senior and disabled low income homeowners.'",
        "'speaker_5': 'And we're going to be able to, for the first time help families. So lots of kudos and we can share more of those on final reading. But just to help ask folks to help us get the word out, these programs are available starting May 1st for the prior tax year.'",
        "'speaker_5': 'And so all of the department's materials will be upgraded and reformed in the next couple of months. And so it's a super exciting set of changes and we'd appreciate the public's help and to spread the word. And thank you to everyone who worked on the bill.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_0': 'Thank you, Councilwoman Kenney. Councilwoman Gilmore.'",
        "'speaker_3': 'Thank you, President Clerk. I am happy to support this on first reading tonight and you know, thank my colleagues, Councilwoman Kenney each and Councilman Espinosa for pulling together the Office of Economic Development, the Office of Finance, Denver Human Services.'",
        "'speaker_3': 'And, you know, this really came forward because residents in the Montebello community, the community that I live in, were very concerned about anti displacement tools that we could start to look at to make sure that we are allowing our seniors to age in place and others to stay within our community.'",
        "'speaker_3': 'And this was a low threshold where we as the city already had the senior and disabled property tax rebate program, and we would be able to expand this and get it out further and wider to our residents. And so I just want to give kudos and a thanks to the Montebello leadership cabinet because we've been working together'",
        "'speaker_3': 'with them for over three years, identifying different policies and initiatives that we could work on together as a community to mitigate involuntary displacement and the negative effects of gentrification in our community. And this is going to be a huge win for them as well, because they put a lot of time and effort and work into making sure'",
        "'speaker_3': 'we were able to push this forward. So thank you. Thank you, President Clark.'"
    ],
    "New Article on Prohibition of Conversion Therapy for Minors.": [
        "'speaker_0': 'Thank you, Councilwoman Gilmore. Madam Secretary, would you please put the next item on our screens? And, Councilwoman, can you just go ahead with your comment?'",
        "'speaker_5': 'Thank you, Mr. President. Two bills up tonight. So my apologies to my colleagues, but it's an exciting night. This Bill 1508, is about banning the practice known as conversion therapy. It isn't easy to be someone different than the world expected you to be, to love or want to be with someone that you were never told about in'",
        "'speaker_5': 'the fairytales that were read to you. To want to be a different gender, to be a different gender than you were raised. I know a little bit about this path because I had to come out to myself and to the world in my early twenties.'",
        "'speaker_5': 'Loving someone does not make you sick physically or mentally. Being a man or a woman or living outside those labels if you don't fit them neatly, does not make you sick mentally or physically. But shame and rejection make people sick.'",
        "'speaker_5': 'Shame and rejection that teach you that if you fail to meet the expectations that your religion or your family or your community has, then you are wrong and you don't belong. Each human being among us, we all need to feel like we are accepted by our families, by our communities, and we all need to be loved.'",
        "'speaker_5': 'And when the message someone receives is you can't get those things unless you change a fundamental part of who you are. You make someone sick. You put them at risk for depression, anxiety, for wanting to not live anymore because there's no way to reconcile something in you that can't change and an expectation that makes you wrong for'",
        "'speaker_5': 'being that way. Conversion therapy sometimes uses harsh and punitive techniques to try to reinforce this change that it seeks to make people go through. And many people, including folks who led the movement and founded the practice, I did a lot of research over the last few months, and many of the people who started this practice have since'",
        "'speaker_5': 'denounced it after seeing the harms it has caused the long list of folks who've lost their lives after going through this practice. So when it fails, the consequences are very real. So today's bill ensures that no minor in the city and county of Denver will be subjected to this practice in the form of therapy.'",
        "'speaker_5': 'Just like we protect minors from other things that could hurt them physically or mentally. We will be protecting them from this practice going forward. I'm very proud to be a part of the conversation that was really led by our LGBTQ commission, which is all volunteers.'",
        "'speaker_5': 'These are folks from every walks of life some straight, some gay, some transgender, and they all work together to raise this issue and bring it to Councilman Clark, myself, the mayor's office. I want to thank the mayor's office for embracing this and really putting a lot of work into making sure that we could get it done as'",
        "'speaker_5': 'quickly as possible. And even though we're only on first reading tonight because it's such an important moment, I just wanted to acknowledge the folks who may not be able to be here to tell their own stories about how shame and rejection and attempts to convert them may have.'",
        "'speaker_5': 'We have harms them, but we're here tonight for them. And I think this is a really important way for our community to affirm that we do love and accept people and we're here to support them through their journeys, not to reject them.'",
        "'speaker_5': 'Thank you. Council President.'",
        "'speaker_0': 'Thank you, Councilman. Can you thank you for your words. I can't say it. I can even approach saying it how you said it. I just want to add an amen and then also a thank you to the commission, to the administration, to the office of the city, the city attorney's office for all the work going into this'",
        "'speaker_0': '. And I'm so excited to have this on first reading. I'll be even more excited next week when we get to put it through on second reading. So thank you. Thank you. Thank you. All right. That concludes the items that have been called out.'",
        "'speaker_0': 'All other bills for introduction are ordered published, and we're now ready for the block vote on resolutions and bills on final consideration. Council members remember that this is a consent or block vote and you will need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call it an item for a separate vote. Councilman Brooks, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_1': 'Thank you. Mr. President. I do move that all the resolution be adopted in final session, be placed upon final consideration, and do pass in the following orders. 1445 1412 1447 1448 1449, 1481 1327 1413 1415 1451. Sloan up here 1452 1453 1454 1485, 1487, 1498, 1266, 13, 14, 1446, 1462, 14, 18, 1434, 14, 64, 14, 28.'",
        "'speaker_1': 'All series in 2018.'",
        "'speaker_0': 'Thank you, Councilman Brooks. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_2': 'Black. Hi, Brooks.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Espinosa. Hi.'",
        "'speaker_0': 'When I.'",
        "'speaker_2': 'Gilmore, I Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Cashman. I can teach. I knew Ortega I. Susman.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_0': 'Hi. I'm Secretary. Please close voting announced the results. 1212 eyes. The resolutions have been adopted and bills have been placed upon final consideration and do pass since there are no public hearings. And if there are no objections from members of Council, we will not take a recess.'"
    ]
}