{
    "Establishment of the Office of Special Events.": [
        "'speaker_0': 'All right. Well, you go ahead. You're welcome. All right. We'll go ahead and get those up in the queue. All right. Under resolutions, I believe, no items have been called out and under bills for introduction. No items have been called out under bills for final consideration.'",
        "'speaker_0': 'Council members carnage and Tories have called out Bill 863 for a vote and Councilmember King each has called out Bill 924924 for a vote as well. But it sounded like we wanted to add a few more in there and so we'll go ahead and get those added and then under pending, no items have been called out.'",
        "'speaker_0': 'We're going to go ahead and pause for a second. It sounds like online we have Councilmember Ortega has her hand up.'",
        "'speaker_7': 'It's not a president. I just wanted to clarify. On Council Bill 20 10855. The title of the bill refers to it as West 46th Street in Berkeley. But in the description, it's Avenue, and I think it's an important clarification that needs to be made to make sure that's consistent.'",
        "'speaker_7': 'It should be avenue.'",
        "'speaker_0': 'All right. Very good. Thank you, Councilmember Ortega, for that clarification. And that was Bill 855 on the introduction. And so we'll make sure to work with the agency if there's anything we need to do and get that corrected when it comes up on second reading.'",
        "'speaker_0': 'All right, Madam Secretary, it looks like we've got the first item up on our screen here. Council Member Sandoval, would you please put Council Bill 863 on the floor for final passage?'",
        "'speaker_7': 'I move that council bill 863 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Kenny, your motion to amend.'",
        "'speaker_9': 'Yes, Council President. I move to amend Council Bill 20 1863 in the following particulars on page one before line 22, insert section two, Dash 407 Dash Special Event. For purposes of this Article x x, the term special event shall mean a temporary event held on public property open to the public involving permitting by and coordination of two'",
        "'speaker_9': 'or more city agencies. In addition to the Office of Special Events on page one Lane 22, strike 2.407 and replaced with 2-408 on page one lane 27, strike two, dash 408 and replace with 2-409, page two, line 13 after city owned property insert where two or more city departments are involved on page two line 15 strike obtained'",
        "'speaker_9': 'and replaced with obtain on page two line 15 after from insert any on page two, line 15 strike departments and replace with departments on page two, line 21, strike two, dash 409 and replace with two. Dash 410 on page two, line 23, strike to dash 408 and replaced with 2-409.'",
        "'speaker_9': 'And on page two, line 27, strike two, dash 410 and replace with 2-4 11.'",
        "'speaker_0': 'All right, thank you. Councilmember Cooney has been moved and seconded comments by members of Council on the amendment. Councilmember Koinange.'",
        "'speaker_9': 'Thank you. Council President This amendment came from our discussion in first reading where questions were asked about when or how is it appropriate to add an additional permit and process to some event holders? And, you know, the answer given by the agency with really good intentions was that this wasn't for any routine rental of a shelter for'",
        "'speaker_9': 'an event in a park. It was where there was a more complex event that involved a park. And right of way or right of way and a special business license or something like that, where there was more complexity in reading the bill during our meeting, the language wasn't quite as clear as the description, and because some colleagues'",
        "'speaker_9': 'had concerns, I felt like it would be both reassuring to my colleagues as well as best for their record to have the bill clarified. To make very clear this is only for complex permits involving multiple agencies. So that's where all the language around permits is.'",
        "'speaker_9': 'There were also some typos where cleaning up at the same time for efficiency. So that's what some of the rest of this is. I would defer any further questions if there irony on the substance, but I believe what we're doing is matching the language to the discussion we had just with with a minor word clarification.'",
        "'speaker_9': 'Thank you. Council president.'",
        "'speaker_0': 'All right. Thank you, Councilmember Ngige, at speaking to the amendment. Next up, we have Councilmember Torres. But I wanted to remind folks that were commenting on the amendment. At this point, we'll vote on the amendment and then there'll be time to make additional comments on the final bill as amended if that amendment passes.'",
        "'speaker_0': 'And so I just wanted to share that. And so, Councilmember Torres, I see you've moved to when we vote on the amended bill. Councilmember Hines, did you want to speak on the amendment?'",
        "'speaker_1': 'Thank you. Council President. I just want to ask one question to Office of Special Events. Is this do you consider this a friendly amendment? Thank you. Thank you. Council president.'",
        "'speaker_0': 'All right. We had an affirmative from the Office of Special Events that this is a friendly amendment. And so we'll go ahead. Madam Secretary, roll call on the amendment, please.'",
        "'speaker_8': 'Cashman. I Cashman.'",
        "'speaker_2': 'I. I.'",
        "'speaker_0': 'Councilmember Ortega.'",
        "'speaker_7': 'I. Thank you.'",
        "'speaker_8': 'Can each. I.'",
        "'speaker_7': 'Right.'",
        "'speaker_8': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon High.'",
        "'speaker_8': 'Times, Madam President. I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_8': '13 eyes.'",
        "'speaker_0': '13 eyes. Council Bill 21, Dash eight. Six three has been amended. Councilmember Sandoval. Will you please put Council Bill 863 on the floor for final passage as amended?'",
        "'speaker_7': 'I move that council bill 863 be placed upon final consideration and do pass as amended.'",
        "'speaker_0': 'Thank you. It has been moved and seconded comments by members of Council on Council Bill 21, Dash 863. Councilmember Torres. Thank you, Madam President. I appreciate the amendment to clear up some of the items. It doesn't relieve, I think, some of the questions that I have.'",
        "'speaker_0': 'And so I'll still be a no tonight. All right. Thank you, Councilmember Torres. Not seeing any other hands raised. Madam Secretary, roll call on Council Bill 20 10863, please.'",
        "'speaker_8': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_8': 'Ortega. I. Black. I see tobacco. No. Clarke.'",
        "'speaker_1': 'I.'",
        "'speaker_8': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_8': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_8': 'Hines. Can each I. Sandoval. No. Sawyer, I. Torres No. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results.'",
        "'speaker_8': 'Three names. Ten Eyes.'"
    ],
    "Ballot Question on General Obligation Bonds for National Western Campus Repairs and Improvements.": [
        "'speaker_0': 'Ten Eyes Counsel build 20 1-863 has passed. Madam Secretary, would you please put the next item on our screens as the Madam Secretary, is the council secretary is doing that? It looks like we're going to go ahead and go back and clean up the bill for introduction eight, five, five.'",
        "'speaker_0': 'And so we're drafting that amendment right now for that bill on introduction, but we'll go ahead and proceed with our next item. And so, Council Member Sandoval, will you please put Council Bill 9 to 4 on the floor for final passage?'",
        "'speaker_7': 'I move that council. I move that council bill 9 to 4 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded comments by members of Council on Council Bill 20 1-924 Council Member Kenny.'",
        "'speaker_9': 'Thank you. Council President we had an extensive conversation last week. I this is the question related to the National Western Center campus facilities. I'm sad to be voting no tonight. I believe these are necessary facilities. And perhaps if we had started a collaborative conversation with some of the things that have been talked about over the last week'",
        "'speaker_9': ', if we had started that as soon as this idea came forward, perhaps we wouldn't be here. Perhaps we could continue those conversations and have greater certainty that we've ruled out all other funding sources and that this is the true full amount required from this particular source, that there is no other source that could pair with it, there's'",
        "'speaker_9': 'no other source that could replace it. And that that we have the right balance between this and other projects, including in the future of this site. This might be the most important and an integral piece of the site and therefore perhaps the most fundable.'",
        "'speaker_9': 'And we have facilities that might be tougher to find in the future. And now we've used a very precious resource. Those are the types of questions and concerns they have. I anticipate this will pass tonight and it will be in the hands of the voters.'",
        "'speaker_9': 'I hope that we respect the conversation about maximizing sources, maximizing equity, regardless of whether this is referred to the ballot. I don't think this being referred to the ballot or even passing on the ballot relieves our city of the responsibility to seek all sources, potentially substituting for this most precious resource of property tax dollars and potentially better'",
        "'speaker_9': 'preserving funding for other projects for future phases of this project. So I appreciate the dialog bringing the record out over the last few meetings. It's been long, but I think it's important that all those questions were asked and I respect those voting on on various sides of it.'",
        "'speaker_9': 'But for me, I cannot be sure that we ruled out every opportunity and option yet, so I can't support it tonight. Thank you, Council President.'",
        "'speaker_0': 'Thank you, Councilmember Finch. Councilmember Hines.'",
        "'speaker_1': 'Thank you. Council President. I wasn't here last Monday and I apologize for having to leave early. I did want to put a couple of comments on the record. I want to thank the mayor's office. I want to thank the mayor's office for the citywide survey about the sentiment behind the national Western complex and the proposed arena.'",
        "'speaker_1': 'Based on the survey, it appears that there's broad support for the national western complex in the arena. That said, I.'",
        "'speaker_7': 'Heard something as important as I.'",
        "'speaker_1': 'Receive a personal.'",
        "'speaker_7': 'Sir.'",
        "'speaker_0': 'We ask that you not disrupt our debate, sir. Thank you. QUESTION Thank you.'",
        "'speaker_1': 'That said. Gentlemen didn't stay for the counterpoint. That said, the survey only asked about the National Western on its own. The survey didn't ask any questions about that, compared that any questions that compared spending funds on national western versus other purposes.'",
        "'speaker_1': 'Other purposes I've heard about include housing, homelessness and transportation infrastructure. So we perform some of that outreach on our own. District ten residents are split on strong support and opposition to the National Western funding. That suggests to me that this is an ideal question for the voters to weigh in on in November.'",
        "'speaker_1': 'So should the people of Denver accept the funding for National Western great. Otherwise I will be very interested in lifting up the alternative funding suggestions brought by my constituents generally concerning housing, homelessness and transportation capital projects. Thank you.'",
        "'speaker_1': 'President.'",
        "'speaker_0': 'Thank you. Councilmember Hines. And not seen any of our colleagues online cueing in as well. We'll go ahead and move on. Not seeing any other speakers. Madam Secretary, roll call on Council Bill 21, Dash 924, please.'",
        "'speaker_8': 'Cashman?'",
        "'speaker_2': 'No.'",
        "'speaker_8': 'Ortega.'",
        "'speaker_7': 'I.'",
        "'speaker_8': 'Can each.'",
        "'speaker_9': 'No.'",
        "'speaker_8': 'Sandoval No. Sawyer.'",
        "'speaker_7': 'I.'",
        "'speaker_8': 'Torres. I black. I see tobacco. No, Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_8': 'So when.'",
        "'speaker_3': 'I.'",
        "'speaker_10': 'Herndon, I.'",
        "'speaker_8': 'Hines. Madam President, I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_8': 'So you don't have tourism in here. And Sandoval with a name. Okay. Thank you. For Nine Eyes.'"
    ],
    "Ballot Question on General Obligation Bonds for Denver Facilities System Repairs and Improvements.": [
        "'speaker_0': 'Nine eyes. Counsel Bill 20 1-924 has passed. Madam Secretary, please put the next item on our screens. And that looks like it's going to be the the black vote. Councilmember Sandoval, would you please put council bills? 864865, eight, six, six, eight, six, seven and 868 on the floor for final passage.'",
        "'speaker_7': 'I move that council bill 8648658, six, six, eight, six, seven and 868. He placed upon final consideration and do pass in a block.'",
        "'speaker_0': 'Thank you. It has been moved and seconded comments by members of Council on Council Bills. 864865866867 and 868. Councilmember CdeBaca.'",
        "'speaker_7': 'Thank you. These are the rest of the questions to be advanced to the ballot regarding the other components of the bond. And I would like to go on record tonight as a no. Given our crisis with ah, with COVID and the economic downturn, our revenue shortfalls from last year, our need to recoup those revenue shortfalls by increasing'",
        "'speaker_7': 'taxes or floating the levy. I think it's not a wise decision to add more debt to the taxpayers. And I will be a vote on these bond questions tonight. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember CdeBaca. Not seeing anyone in the queue here. And it didn't sound like we had folks online wanting to speak either. And so. Madam Secretary, roll call on council bills 20 1-86486586, six, eight, six, seven and 868.'",
        "'speaker_8': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_8': 'Ortega. I. CDEBACA No. Clark. I Flinn.'",
        "'speaker_3': 'I.'",
        "'speaker_8': 'Herndon Hines. I can teach. I. Sandoval. I. Sawyer, I. Torres, I. Black. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_8': 'One day, 12 eyes.'"
    ],
    "Rezoning of Properties on West 46th Avenue in Berkeley to Allow Accessory Dwelling Units.": [
        "'speaker_0': '12 eyes. Council bills 20 1-864865, eight, six, six, eight, six, seven and eight six, eight have passed. Madam Secretary, please put the next item on our screens. Councilmember Sandoval, would you please put Council Bill 855 on the floor for publication, please?'",
        "'speaker_7': 'I moved that council bill 855 be ordered publish published.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Herndon, your motion to amend.'",
        "'speaker_1': 'Yes, Madam President, I would like to amend Council Bill 20 10855 with the following particulars online seven Strike Street and replace with Avenue.'",
        "'speaker_0': 'All right. Very good. It has been moved and seconded comments by members of Council on the Amendment. Council member Herndon.'",
        "'speaker_1': 'Yes, ma'am. Friend And this is the correction that Councilman Ortega. So thank you, Councilwoman Ortega. We're going to correct this typographical error again.'",
        "'speaker_0': 'Yes. Thank you, Councilmember Ortega, for pointing that out so that we could get it taken care of on introduction, not seeing anyone else in the queue. Madam Secretary, roll call on the amendment.'",
        "'speaker_8': 'Cashman. Ortega. I. Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_8': 'Hi. Hi. Can each. Sandoval, i. Sawyer.'",
        "'speaker_7': 'I.'",
        "'speaker_8': 'Torres, I. Black. I see the i. Clark.'",
        "'speaker_10': 'I.'",
        "'speaker_8': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_8': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_8': '13 Eyes.'",
        "'speaker_0': '13 Eyes Council Bill 20 1-855 has been amended. Councilmember Sandoval, will you please put Council Bill 855 on the floor for publication as amended?'",
        "'speaker_7': 'I move that council bill eight by five be ordered published as amended.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Comments by members of Council on Council Bill 21, Dash 855. CNN. Madam Secretary, roll call on Council Bill 21, Dash 855, please.'",
        "'speaker_8': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_7': 'I didn't hear my name, but I'm going to say I.'",
        "'speaker_8': 'Black. I see tobacco. I. Clarke.'",
        "'speaker_2': 'I.'",
        "'speaker_8': 'Flynn.'",
        "'speaker_4': 'I.'",
        "'speaker_8': 'Herndon High. I cannot I. Sandoval, I. Sawyer, I. Torres.'",
        "'speaker_10': 'I.'",
        "'speaker_8': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_8': '13 Eyes.'",
        "'speaker_0': '13 Eyes. Council Bill 20 1-855 has been ordered published. That concludes the items to be called out. All bills for introduction are ordered published except for Council Bill 21, Dash 908, which will be voted on after its courtesy public hearing this evening.'",
        "'speaker_0': 'Council members remember this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Sandoval, will you please put the proclamations and resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_7': 'I move that proclamations and resolutions be adopted and bills and final consideration be placed upon final consideration and do pass in a block. Vote for the following items. 97087689389487189589688488586887875888889890891833860.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_8': 'Cashman. Ortega. I.'",
        "'speaker_7': 'Black Eye.'",
        "'speaker_8': 'CdeBaca Eye Clerk. Eye for an.'",
        "'speaker_4': 'Eye.'",
        "'speaker_1': 'Herndon on.'",
        "'speaker_8': 'Hindsight. Can it? I. Sandoval. I. Sawyer. I. Torres. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_8': '13 eyes.'",
        "'speaker_0': '13 eyes. The proclamations and resolutions have been adopted and the bills have been placed upon final consideration and do pass tonight our previous recess announcement. Tonight, there will be a required public hearing on Council Bill 21, Dash 723 changing the zoning classification for 420 East 11th Avenue in Capital Hill.'"
    ],
    "Rezoning of 420 East 11th Avenue in Capitol Hill.": [
        "'speaker_0': 'Direct your comments to council as a whole and please refrain from individual or personal attacks. Council Member Sandoval Will you please put Council Bill 723 on the floor for final passage?'",
        "'speaker_7': 'I move that council bill 73 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The required public hearing for council Bill 7 to 3 is open and we have Sara Corse here and she'll be giving us a staff report. Go ahead, Sarah. Hello again. I'm Sarah, of course, senior city planner with Committee Planning and Development.'",
        "'speaker_0': 'I'll be presenting the application for 420 East 11th Avenue to rezone from GMU 503 to GMC'S three. So the subject property is in Council District ten. Chris Hines District. More specifically, the property is located within the Capitol Hill neighborhood.'",
        "'speaker_0': 'Currently there's a three story building with mixed use on the subject property, which operates as a bed and breakfast. The property owner is requesting to rezone to expand the uses allowed. The subject property is in general urban multi-unit with allowable height of up to five stories.'",
        "'speaker_0': 'In addition to that, the use of a three is a historic structure use overlay. The surrounding zoning is predominantly GMU five over three with eight to the west and Jimmy with 303 and OSA to the south. The building on the property is the Paterson Campbell House, which is an individual designated historic structure and as a contributing building'",
        "'speaker_0': 'to the Pennsylvania Street Historic District. This means demolition of the building would be strongly discouraged and also highly unlikely and subject for review by the Landmark Preservation Commission. Also, any exterior changes requiring a building or zoning permit would also be subject to landmark preservation design review for compliance with the with the design guidelines for Denver's landmark structures'",
        "'speaker_0': 'and districts. I'd like to point out one of the main differences between the existing zoning and the proposed zone district. So the existing zoning of Jim u503 allows residential office, not including dental or medical offices or clinics, art studio and bed and breakfast lodging with a maximum of ten guest rooms.'",
        "'speaker_0': 'The proposed zoning of Jim X three will expand the commercial uses already permitted and also allow additional uses such as eating and drinking establishments and retail sales. So the subject property has mixed use, land use and the surrounding properties are multi-unit residential office, single unit, residential and park open space land uses.'",
        "'speaker_0': 'Again, here are some images of the existing property. And here are the surrounding building forms. They range from two or three stories and are a variety of building forms, as you can see. So we are at the city council public hearing today.'",
        "'speaker_0': 'I like to call out that IT planning board at their public hearing. Planning Board voted unanimously to recommend that city council approve the application. In terms of public comment, the Capitol Hill, United Neighborhoods and Auno has submitted a letter of support.'",
        "'speaker_0': 'The property also entered into a good neighbor agreement with Capitol Hill United Neighbors in which they have committed to items such as a restriction on hours. Alcoholic beverages may be served or sold. A restriction on the hours music or entertainment is provided.'",
        "'speaker_0': 'A requirement for onsite offsite parking and a requirement for making space available to nonprofits. A certain number of times per year. In addition to that, there were two letters of support received. One letter from an adjacent property owner reference how they saw the building endure years of disrepair from lack of use.'",
        "'speaker_0': 'But they have seen the building blossom under the current owner and that he has proven to be a trustworthy steward of the historic building. The other letter expressed support because the rezoning would support a local business and could open up the historic building to other uses with public access that could provide public amenity to the neighborhood.'",
        "'speaker_0': 'So let's move on to how the application meets the review criteria. So there are three plans that apply to the subject site and they are the comprehensive plan 2040 Blueprint, Denver and East Central Area Plan. The application is consistent with several of the strategies in the comprehensive plan, so I'll move on to consistency with blueprint number.'",
        "'speaker_0': 'Blueprint. Denver identifies the subject property as having the future context of general urban. This context is is described as predominantly multi-unit structures with one unit and two unit residential and low scale mixed uses that are embedded within the multi-unit areas.'",
        "'speaker_0': 'Blueprint. Denver also identifies the site as having the future place type of high medium residential. This can be described as having a mix of low to medium scale multi-unit residential uses, with some neighborhoods serving mixed use distributed throughout.'",
        "'speaker_0': 'In addition to that, 11th Avenue has the future street type of residential connector, and that's described as having primarily residential uses, but may also include schools, civic uses, parks, small retail nodes and other similar uses. The Growth Area strategy.'",
        "'speaker_0': 'The blueprint Denver identifies is all other areas of the city, which is expected to see around 20% of new housing growth and 10% of new job growth. So in Blueprint Denver, there are recommendations that form a comprehensive list of policies and strategies to guide implementation of the plan.'",
        "'speaker_0': 'There are several strategies around historic preservation, re-use of existing structures and promoting small businesses that the rezoning request is consistent with in summaries. In summary, these strategies state that in historic areas we should balance efficiency with preservation through strategies that encourages reuse of structures and also states that we should look to support.'",
        "'speaker_0': 'Locally owned businesses new and old to expand involve the meeting to meet the changing needs of residents and visitors. So let's move on to East Central Area plan. So Essential Area Plan is similar to Blueprint Denver in terms of how it identifies the future place type, which is high, medium residential.'",
        "'speaker_0': 'And it also has the same description of Blueprint Denver that I just went over. There are also several strategies. East Central Area Plan. The application is consistent with one main strategy that supports this rezoning. Request states to facilitate adaptive reuse of historic structures by allowing a broader range of uses, including compatible commercial uses and appropriate additions.'",
        "'speaker_0': 'So the proposed rezoning two GM x three will result in the uniform application of zoned district building for use and design regulations. The proposed Official Map amendment does further the Public Health and safety and general welfare of the city through implementation of the city's adopted land use plan.'",
        "'speaker_0': 'As I said, the proposed zone district is consistent with Blueprint Denver's plan policies and therefore contributes to implementing the city's adopted latest plan. The requested Zone District of Gmc's three will allow the historic structure to have a broader range of uses which will promote adaptive reuse of the historic structure and allow further preservation of the building.'",
        "'speaker_0': 'In addition to that, the broader range of uses may bring more services to the area for the surrounding community to utilize. So in terms of justifying circumstances, the application references, the adopted plans, including the Comprehensive Plan, Blueprint Number and East Central Area Plan as recently adopted plans for the justifying circumstance as stated in the first review criterion'",
        "'speaker_0': ', these plans provide a clear vision and strategies that outline the need for historic preservation, adaptive values, encouraging small businesses to thrive, and providing flexibility for small mixed use nodes with neighborhood serving amenities and uses to be dispersed throughout multi-unit residential areas.'",
        "'speaker_0': 'Citing these recently adopted plans to rezone two Gmc's three is an appropriate justifying circumstance. Lastly, the requested zone district of GMAC's three is consistent with the neighborhood context zone district. Purpose and intent. So based on the criteria for review and the Denver Zoning Code staff recommends approval of application 2020 II 00082.'",
        "'speaker_0': 'Thank you. All right. Thank you, sir, for the staff report and for this first hearing, we have three individuals signed up to speak and all are participating virtually. And so we'll go to our first speaker, Chris Chiari.'",
        "'speaker_1': 'I thank you and council members. Thank you. Good evening. My name is Chris Kyari. I am a resident of Uptown and the owner of the Patterson Inn for the last three and a half years and heavily involved in day to day operations.'",
        "'speaker_1': 'I'm very familiar with the historic property and nature of the neighborhood and consider myself the caretaker of both the property and its history. My goal is to ensure the long term sustainability and viability of this historic asset.'",
        "'speaker_2': 'And for.'",
        "'speaker_1': 'That, it's important that I have the chance to utilize the building to its fullest.'",
        "'speaker_2': 'Potential.'",
        "'speaker_1': 'Currently, a large portion of the property is underutilized and neighbors neighbors often get to see the Patterson in from the outside, but they don't have a reason to come inside to see the splendor of the interior of the property.'",
        "'speaker_1': 'My goal is to activate the property to allow more people to experience it, not just view it. It's a property that dates back to 1891. The property rezoning will give me a couple of uses I can't do now.'",
        "'speaker_1': 'One is potentially the expansion of rooms, the possibility of adding a small caf or even a small boutique store, or possibly a club or lounge as an amenity to the guests.'",
        "'speaker_2': 'This is being.'",
        "'speaker_1': 'Proactive.'",
        "'speaker_2': 'COVID had a significant impact on hospitality.'",
        "'speaker_1': 'I'm seeing that business come back, but this is a way to make sure this property has a bright and vibrant future. So I ask for your support tonight in this rezoning. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jesse Pearce.'",
        "'speaker_1': 'Yes. Good evening. Members of council, those watching at home. Those are the council chambers. My name is Jessica. Sharpest represent for Black Sox. The mood for self defense positive social change was the only party of Colorado front line Black knows.'",
        "'speaker_1': 'And I'll be the next mayor of Denver in 2023. I was against. I was initially against this zoning classification. And so I understood now that it's just for preservation and to help out the Patterson House. So I thought it was going to be more rapid gentrification, more displacement, but it's clearly not going to be that.'",
        "'speaker_1': 'So I'm in favor of this slight. Thank you.'",
        "'speaker_0': 'Thank you. Our last speaker is Rebecca Posada.'",
        "'speaker_7': 'Hi. I'm here. My name is Rebecca Pizarro. I have lived across the street from the Patterson Mansion for 16 years. It is a gem of the Capitol Hill neighborhood. I saw it years when it was vacant and fall into disrepair.'",
        "'speaker_7': 'And I can tell you that Chris Geary has been a responsible owner, and I have seen the building blossom under his stewardship. So I give full support to rezoning and allowing optimal use of the Paterson mansion for the neighborhood.'",
        "'speaker_0': 'And that's all I have to say. All right. Thank you. That concludes our speakers questions from members of Council on Council Bill 723. Councilmember Flynn.'",
        "'speaker_3': 'Thank you, Madam President. Sarah, could you just briefly detail some of the constraints that the landmark designation places on the building. If it were to incorporate these additional uses.'",
        "'speaker_0': 'The building would still be under landmark preservation and review and would have to follow their design guidelines. And I think, as I stated earlier in the presentation, depending on what the property owner wants to do, if he needs a zoning or building permit for it, it would have to go through Landmark for approval.'",
        "'speaker_0': 'So I would say, you know, certain improvements to the building are very restrictive in terms of what can be done and as well as potential demolition. And as I stated before.'",
        "'speaker_10': 'It would be highly unlikely.'",
        "'speaker_0': 'Or.'",
        "'speaker_1': 'May not occur.'",
        "'speaker_3': 'But certainly, I mean, that is one of the buildings I think many of us would lay down in front of Bulldozer if that were to occur. But I don't think that's I don't think that's an issue. What about signage?'",
        "'speaker_3': 'If there were to be a cafe or a boutique in there, would the landmark designation require a review of signage or would that just come under the regular signage review for any other property?'",
        "'speaker_0': 'I believe it depends on what is within the Landmarks Design guidelines. I can't directly answer that question right now. I could make the assumption that the signage would be included under that part of the review. But I can't.'",
        "'speaker_1': 'Take. That is a fact. Sorry.'",
        "'speaker_3': 'All right. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Flynn. And we have Councilmember Cashman with the question as well.'",
        "'speaker_2': 'Yeah. Thank you, Madam President. And Mr. Kerry, where are those members speaking to you a few years ago when you first took over the property? And I believe you were talking about expansion possibilities of a few rooms. Can you describe what your thoughts would be?'",
        "'speaker_2': 'How many rooms you might be able to add? Councilmember. Thank you. The property would provide for the addition.'",
        "'speaker_1': 'Of two rooms above the carriage house, which is one of the plans I have identified as the potential path forward.'",
        "'speaker_2': 'Know that was my memory. Just wanted to be sure nothing had shifted over the past few years. Madam President, it is a gorgeous property and truly 1 to 1 of the gems on Capitol Hill. I appreciate the uses that are described.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Cashman, and seen no other folks in the queue for questions. The public hearing is closed. Comments by members of Council on Council Bill 723. Council Member Hines Thank you.'",
        "'speaker_1': 'Council President I want to thank CBD for your presentation. I also want to thank the applicant who is here testifying via Zoom. I want to thank him for for being here even though he has a fever. I've spent way too much time here myself, and so I want to thank him for his commitment to this process, too'",
        "'speaker_1': ', to attend, even though he's not feeling well. I also want to thank Capitol Hill United Neighbors for their willingness to to talk with the applicant about a good neighbor agreement. And the intent of the good neighbor agreement is just that.'",
        "'speaker_1': 'It is to make sure that this building is and and the property and the business inside is continued to be a good neighbor with with the surrounding community in the capital area. And this as as one of the speakers said, this is a gym in Capitol Hill.'",
        "'speaker_1': 'And as Councilmember Cashman said as well. The owner has also been a pillar of our community. And I want to thank him for for all he's done for for our community and Capitol Hill and in uptown this just as another vote of support.'",
        "'speaker_1': 'The owner, when he first came to to Denver, he looked at this property and wanted to buy it, but it wasn't for sale. And and he kept it in the back of his mind. I think he waited nine years before it.'",
        "'speaker_1': 'It actually came before the opportunity came for him to purchase. And obviously he has since purchased it. But but this was one of his one of his first properties that he spied when or that he identified when he came to the came to Denver.'",
        "'speaker_1': 'And and that he is that committed to the property, I think shows that he wants to do nothing but good for the property. And and again, he has opened his doors many times to the community to make sure that that he is being a good neighbor.'",
        "'speaker_1': 'So I think that this meets the five criteria. I think that there are other criteria or there are other bonuses that will get in addition to meeting the criteria. So I hope my colleagues will vote. I know I will.'",
        "'speaker_1': 'Thank you. Council president.'",
        "'speaker_0': 'Thank you, Councilmember Hines. Next up, we have Councilmember Flynn.'",
        "'speaker_3': 'Thank you, Madam President. I want to echo what Council Councilman Hines just said, and I want to thank Chris Chiari for his caretaking of the Patterson Mansion. There is probably no better way to ensure the preservation of a landmark structure than to find a really robust fitting and not conforming but consistent use of the property.'",
        "'speaker_3': 'And this sounds like this zoning change will allow for a better array of of options to maintain this into the future. This beyond being a gem of Capitol Hill. It is one of four residences that still are excellent for the four individuals who owned the Rocky Mountain News from its founder in 1859 through its sale to Scripps'",
        "'speaker_3': 'Howard in 1926. The four individuals who owned the paper prior to that, their homes are still standing in the metro area and I think that's a testament to our commitment to preservation. This is by far the grandest. They belong to Thomas Patterson, a Democrat who owned the Rocky Mountain News at the turn of the last century.'",
        "'speaker_3': 'And this is my history lesson for the meeting. I'm sorry. I should have prefaced that at the turn of the last century and was a U.S. senator as well. And so I believe that the application meets all five criteria.'",
        "'speaker_3': 'I'm certainly very happy and eager to support this. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. And as always, I learn a little bit more about Denver's history whenever you comment on a rezoning. And so appreciate that and likewise happy to support this. Councilmember Hines seeing that it meets all of the review criteria.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 7 to 3, please. Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_8': 'Ortega. I. I can change. I. Sandoval, I. Sawyer, I. Torres, i. Black I. See the Barca I.'",
        "'speaker_1': 'Clark, I.'",
        "'speaker_4': 'Swim I.'",
        "'speaker_8': 'Herndon Madam President.'"
    ],
    "Charter Amendment on Councilmember Districts.": [
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results. 13 Hours 13 ies council bill 20 1-723 has passed. Moving on to our courtesy public hearing this evening, and thank you to the CPD staff for being here for the previous public hearing.'",
        "'speaker_0': 'Councilmember Sandoval, will you please put Council Bill 908 on the floor for publication?'",
        "'speaker_7': 'I move that council bill nine eight be ordered published.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The one hour courtesy public hearing for Council Bill 908 is open. May we please have the presentation and will allow council members CdeBaca and Flynn to join us at the lectern here.'",
        "'speaker_3': 'Madam President, in recognition of the headline that was in Westford a couple of weeks ago after the. Committee meeting. We have our walkup music.'",
        "'speaker_8': 'There you go.'",
        "'speaker_0': 'Wonderful. Wonderful.'",
        "'speaker_7': 'We thought you guys would appreciate that one. The odd couple, if you don't recognize it. So we're going to breeze through this kind of give you guys a recap of what we gave you. And committee will go as fast as we can to get on to the public hearing.'",
        "'speaker_7': 'We are trying to convert our At-Large seats to district seats. We wanted to highlight that this is about representation and equity. This quote here one of the most persistent findings by scholars of urban politics is that single member district elections increase descriptive representation of underrepresented racial and ethnic groups on city council so that to ground us in'",
        "'speaker_7': 'the context of some background. Denver City Council composition. We haven't always had At-Large seats. Before 1968, we only had nine single district seats. We had a charter change that was advanced in the last minute in 1968 to add our At-Large seats, and we have had those since 1968.'",
        "'speaker_7': 'Our population growth over the last about 11 years has been over 130,000 people. We are at a critical and unique opportunity as we are redistricting right now and the convergence of the redistricting with both At-Large council seats being open in the next election is what prompted us to advance this to you all.'",
        "'speaker_7': 'This is a graph showing our population growth, kind of just to show you a visual of the numbers I just shared. This is a heat map showing you where our most concentrated growth has been in District eight and nine.'",
        "'speaker_7': 'We've had some of the most intense growth. Here are the numbers that go along with those graphs, those visuals. I think that one to pay attention to is the 23% increase or change in the 2020. That's what we're also trying to mitigate here are our districts have grown significantly.'",
        "'speaker_7': 'Our budgets have not. And so representation has become increasingly more and more difficult, as well as winning seats. If you're running for At-Large seats, because you're now running citywide in a city of over 700,000 people. So the biggest considerations that we're trying to address here are R.A. and constituent accessibility.'",
        "'speaker_7': 'In my district alone, I have more than 30 RINO's. So even if I tried to meet with one every single day of the week, I wouldn't be able to touch on my RINOs in one month. So that makes it difficult to really be hearing their concerns and addressing their concerns in a meaningful way.'",
        "'speaker_7': 'In a consistent way. Accountability to Localized Decisions. We have this belief that at large members are accountable to everybody in the city. But the way that that plays out is not necessarily the way it plays out when you have a single district representative.'",
        "'speaker_7': 'Our council members at the At-Large level often are able to kick an issue down to a single district member instead of having to address it directly. And so accountability in those At-Large seats is a little more challenging for constituents.'",
        "'speaker_7': 'Competing interests with district members at large. Members, while representing the entire city, have a vastly different constituency than a district member, especially a member representing a less dense population. So what I mentioned earlier, with accountability and being able to kick down an issue, it also works in the reverse.'",
        "'speaker_7': 'So if there's an issue that is directly affecting a minority in a district, an At-Large member doesn't have to necessarily side or support side with or support that minor minority or marginalized group because they can argue that they're representing an entire city's interest and not necessarily the single district or that minority within the single district.'",
        "'speaker_7': 'The strained budget and resources, that's a separate conversation that we need to have. In addition to this one, we need to grow our council budgets. We've done the calculation in our district and we have less than $3 per constituent to serve our constituents.'",
        "'speaker_7': 'We've heard people push back on that and say that not everybody in our district is an adult. Representing over 6000 constituents to me is 6000 76,000 constituents, whether they're children or adults. I feel like we should have the resources available to support them with whatever needs that they have.'",
        "'speaker_7': 'And $3 isn't cutting it, but that's also something we should be talking about later, regardless of whether or not we're able to convert the At-Large seats. Again what we started with diluting minority minority votes and representation. We know these at large systems dilute the votes of people of color and other marginalized groups.'",
        "'speaker_7': 'And so we want to mitigate that, and we want to highlight that in Denver's 50 year history about large seats. There's a correction on this. It's not 15 individuals, but 11 individuals have served in the At-Large seats and none have ever been credibly challenged for reelection.'",
        "'speaker_7': 'And only two out of those 11 have ever been people of color. So just to recap the benefits of single district members localized democracy, tailored and accessible representation, accountability to constituents, minimizing special interests, and more effective use of limited resources.'",
        "'speaker_7': 'This is our in theory versus reality slides. We touched on some of the. I guess correspondence that's come into our offices arguing either for or against at large seats. In theory, at large members focus on citywide policy. In reality, we have proof that single District Council members, even within very recent history, have advanced successfully citywide policy and'",
        "'speaker_7': 'in theory, at large members serve as a backup for district members or constituent services and provide additional representation to constituents in practice. As I mentioned earlier, constituents go directly to their district member first if they go to their At-Large member.'",
        "'speaker_7': 'They're typically kicked to their single district member. And then the last one here, At-Large members serve as a balance to the mayor's power. That one's one of the most important ones to holds here in the in the balance, because in reality, the cost of running a citywide race is very prohibitive.'",
        "'speaker_7': 'So At-Large members are more susceptible than single district members to the same special interests that the executive branches and often vote in alignment with the the mayor's agenda. And if you go back and look at the campaign finance for At-Large members and the mayor, you'll often find not only similar contributions directly to campaigns, but if you also'",
        "'speaker_7': 'look at the independent expenditure committees, they're also typically aligned with the mayoral race. So those positions often affirm the mayor's power in our strong mayoral power city. This is a general timeline of how this proposal has come in front of you all.'",
        "'speaker_7': 'It did not magically come out of nowhere. This has been a conversation for many years, and the original constituents who brought this to the council many, many years ago brought it to council earlier in this year. And we kind of waited for somebody to pick the ball up and run with it and didn't see anyone pick it'",
        "'speaker_7': 'up. So we picked it up. Councilman Flynn. Councilman Herndon. Councilman Clark, in our own ways, engaged with those constituents and decided to do our own pieces to advance this conversation. Thank you to Councilman Herndon, who kicked us off with the history of our At-Large seats in committee.'",
        "'speaker_7': 'We did some outreach to our peers and here we are presenting this to you. We know the runway is a little bit short. But given the robust conversation we have, every time we allow the public to comment or council members to comment, we believe it's deserving of going to the voters for that conversation citywide.'",
        "'speaker_7': 'And we would definitely plan on engaging constituents throughout the city leading up to the November election. So this is not the end of stakeholder engagement, but this would be the beginning. This is the ballot language that we're proposing.'",
        "'speaker_7': 'Shall the the charter of the city and county of Denver be amended to convert the two At-Large City Council seats to district council seats, forming a city council composed of 13 district members? We are not eliminating any seats.'",
        "'speaker_7': 'We are just simply converting the At-Large rules to single district roles. And it would work out nicely because we could draw those districts as we redraw our districts. Now in that process. Pierce cities. A lot of you are I know like to look at our peer cities.'",
        "'speaker_7': 'What we found when we looked at our peer cities is there's no such thing as a best practice when it comes to having At-Large seats. We have many cities who do all at large. Many cities who do know at large.'",
        "'speaker_7': 'Some cities who do a hybrid like we do. And we have a full list in our appendix of this presentation for you all to check out. If this goes forward, the voters would get this on their ballot on November 2nd.'",
        "'speaker_7': 'And we hope that that is allowed. We hope that the voters get an opportunity to have this discussion. And I will pass it over to my colleague here, Councilman Flynn, to add some more context to this proposal.'",
        "'speaker_3': 'Thank you, Councilwoman CdeBaca. As a councilwoman said, I just want to add a little more context to the discussion because it's actually been going on for a lot longer than some of the folks realize in the community. We have a convergence with redistricting and both at large seats being open in the next election that frankly demands that'",
        "'speaker_3': 'we have this conversation about our structure, because these circumstances occurred only once before in the 50 years that we've had these seats in 2003, when term limits began and removed the two incumbents. They may never converge again. So we at least have to have the conversation.'",
        "'speaker_3': 'And I appreciate the openness of our colleagues and those in the community who've reached out to at least have this conversation, although many believe it's been too short. And I'll I'll be addressing that here in my part of the presentation.'",
        "'speaker_3': 'This conversation started among some long, active community members who saw this moment as the opportunity to broaden citizen representation among Denver's 13 member council, keeping district populations lower and reallocating or converting those two seats to district level to represent these smaller communities of interest.'",
        "'speaker_3': 'I want to emphasize, as I did it committee, I don't know if everyone here was at committee, but I want to emphasize again, there's no right or wrong way to structure your council. There's only how do you want to do it?'",
        "'speaker_3': 'And it may be right at this point in Denver's history with our population growth and the structure of our communities and the various communities of interest to reexamine the decision that was made 50 years ago to add the large seats to the mix.'",
        "'speaker_3': 'So there is no right or wrong, but there is a more common practice of 100 largest cities in America. 63. Have governing bodies that have no At-Large members at all. 29 have a mix of at large and district or ward members, and we are among those 29.'",
        "'speaker_3': 'And some cities such as Austin, Texas, converted about ten years ago from all at large to all district members. So having at large members on the positive side, as I said, this is this is a balance of interests on the positive side, having at large members gives every voter in Denver three representatives.'",
        "'speaker_3': 'That's that's a distinct positive point to that. There's no denying it. However, as citywide officials, there still is no guarantee that they'll reflect citywide interests. There's no guarantee that they won't be as parochial as a district member in some of their decision making and policy pursuits.'",
        "'speaker_3': 'I could name At-Large members and I've known all but three of them over the last 50 years. Who would fit that mold right? They didn't spend a whole lot of time pursuing citywide policy. And also there's no apparent correlation in any of the data between the cities that have our At-Large members and those that don't and policy'",
        "'speaker_3': 'development in those cities. While one can say that At-Large members since are untethered to any specific district, they have more bandwidth to work on citywide policies. There's no evidence that it's necessary to be at large to do so.'",
        "'speaker_3': 'There's nothing exclusive to Denver's at large members that yields significant policy advances compared to district members. So for every Kasey Reynolds or Susan Barnes gal who I see is among our scheduled speakers tonight who were At-Large members and served together for eight years.'",
        "'speaker_3': 'There was also a Bill Roberts or a Salvador Carpio or a Kathy Donahue or a Ramona martinez who were served at district level and were very strong in citywide policy development themselves. So there's no correlation that at large produces different or better results than than having all district members.'",
        "'speaker_3': 'Certainly cities like Minneapolis, Los Angeles, Austin, cities that we look to and look to their policies and in some cases try to adopt or emulate, have no At-Large members. They're all district members. One aspect of the at large that I think we need to talk about is under voting.'",
        "'speaker_3': 'Under voting is when voters have a long ballot, they vote for mayor, district council auditor, clerk. At-Large Judges. The under voting in the At-Large races is substantial. For comparison's sake, under voting in 2011, the last time that both the mayor's office and the At-Large seats were both open seats under voting in the mayor's contest was less than'",
        "'speaker_3': '1%. Fewer than 1% of voters did not make a selection for mayor. But in At-Large races, it was 38%. You vote twice in At-Large. So many voters chose to vote. That is strategic voting or, as some would say, gaming it a little bit.'",
        "'speaker_3': 'And they throw away their other vote or they don't vote at all. 38% in 2003, the previous time the At-Large seats were open, along with the mayor's office, due to term limits kicking in that year. Again, the undervote in the mayor's race was less than 1%, but it was 30% in the At-Large races in 2019.'",
        "'speaker_3': 'In our last election with the mayor and the At-Large races, all featuring incumbents. Under voting in the mayor's race was 3.8%. While the At-Large contests, it was 31.7% higher under voting than those who didn't vote for auditor or for clerks, which generally would be pretty low profile or at least lower profile than the city council.'",
        "'speaker_3': 'The At-Large seats are the only elected positions of the 1314 of the 16 elected positions in our charter. They are the only ones that do not require a majority to win. They are elected by plurality only. So in one election in which both seats were open.'",
        "'speaker_3': 'The two winners gained only 30% and 24%, respectively, of the total vote in that election of 16 at large elections since 1991. Only three winners achieved more than 50% of the ballots that were cast, which is a charter requirement for the rest of our elected officials.'",
        "'speaker_3': 'One of them is with us in the meeting today and it's Councilwoman Ortega who in 2015 had just over 50% of ballots cast. The other two were Kathy Reynolds. In her last of seven elections in 1999 and Doug Linker in 2007.'",
        "'speaker_3': 'So being subject to that strategic or bullet voting, the average undervote for at large is 37 or I'm sorry, 32%. Nearly one third of voters wasting their ballots by voting only one or none. So it's hard to say that they are representative of citywide interests with that total amount of undervote in my last segment here in the'",
        "'speaker_3': 'presentation. Madam President and colleagues. Is a little bit of history once again. And I want to thank particularly Alex Hernandez at the Denver Public Library, Western History Department, who did the mind numbing chore for us of looking through all the microfilm and digital scans of the newspaper coverage.'",
        "'speaker_3': 'When the at large seats were added, how did they come to be? And it turns out that while some of the criticism of this bill and it has some validity, that it is pretty late in the game. We could have been talking about this for four years, but we haven't.'",
        "'speaker_3': 'But the fact is, the At-Large seats were added to our charter with much less discussion than we have had on this provision. So the background. Up until 1968, the charter required that our council districts boundaries be redistricted based on the number of registered voters rather than the population.'",
        "'speaker_3': 'I know that sounds unbelievable today. In 1967, the U.S. Supreme Court made its landmark one person, one vote decision that extended equal representation to the state and local levels. And that meant that Denver's districts, council districts were completely out of line, for instance.'",
        "'speaker_3': 'And this then went to the Colorado Supreme Court. We had residents of Denver who sued the Denver City Council because of the makeup of our council districts at the time. One of them was Jerry Kopel. But many of us remember Representative Kopel.'",
        "'speaker_3': 'He wasn't representative at the time, but was one of the plaintiffs in that lawsuit. And it demanded that Denver redistrict according to one person, one vote we had districts with. Well, let me tell you, District eight centered on five points.'",
        "'speaker_3': 'District eight had the smallest number of registered voters, despite the fact that geographically it was among the largest. You went all the way from the railroad tracks to old Denver, Rio Grande, north yards up on the other side of Foch Street, clear to the northeast boundary of the city, had the fewest number of registered voters, but the'",
        "'speaker_3': 'largest population compared to districts in Montclair, Hilltop, Mayfair, the rest of the city. So the Colorado Supreme Court then ruled in 1967 that Denver must redistrict before the 1971 elections. So the council then put together a reapportionment committee headed by Councilman Bob Keating.'",
        "'speaker_3': 'They studied the issue for several months and in May of 1968, they recommended that Denver Council refer to the voters a charter amendment to expand this body from the current nine members that it had had since 1916 to 11 district members.'",
        "'speaker_3': 'There was no mention of any at large seats being added. Simply take it from 9 to 11 districts. Keating said at the time, and he was quoted in I think it was in the Denver Post. Adding districts, quote, would produce better representation for the citizens.'",
        "'speaker_3': 'No talk of adding the at large positions and going to 13. So the council decided we will discuss this when the new council committee assignments come in and in that era they came in July 1st as opposed to we do it usually a third Monday in July.'",
        "'speaker_3': 'So starting in July, their committee worked for about two weeks on a charter amendment then that not only expanded to 11 district seats, but then for the first time and this is only two months before the September 10th primary election, at which this would be on the ballot.'",
        "'speaker_3': 'So within two months of that election came the first recommendation to add At-Large seats and go to 13 members. It was ordered published at the end of July by a vote of 6 to 3. It was opposed by Mayor Tom Carrigan at the time.'",
        "'speaker_3': 'On final passage, there was an amendment by Councilman Keating to remove the two At-Large members and that was defeated. There was a an attempt to put off and delay the charter amendment until a special spring election so that there could be robust community engagement and discussion.'",
        "'speaker_3': 'And that failed also. So this did go on to the primary election ballot, a very low turnout election generally, and it passed. I don't have the vote totals. I didn't get them. So the decision to create the two at large position was made only seven or eight weeks prior to the time that the voters were asked to'",
        "'speaker_3': 'vote on it. And that was the first time I heard of it. So with that in mind, Madam President, I think we'd be happy to take questions. I think the only thing I would add and I hope that Councilwoman CdeBaca would join me in this and this really doesn't have anything to do with Councilman Clark's Senate committee'",
        "'speaker_3': ', with the individuals who served. I have said many times from my desk that I believe Cathy Reynolds was possibly the most consequential member ever to sit on this body in the last 50 years. She served seven terms here.'",
        "'speaker_3': 'She served at large. I had just I had a discussion with her with her widower, Rick, over the weekend. And he believes that Cathy would not have been able to do all that she did had she served at large.'",
        "'speaker_3': 'And I'm not going to disagree with him. He knows her better than I did, obviously, but I believe that she would have. I believe that the National League of Cities, which she served as president, has had many presidents who were district council members from Los Angeles, from Philadelphia.'",
        "'speaker_3': 'I've listed all the presidents of the National League of Cities. Many of them were district council members as well. So. I don't think that it's true that you need that extra time in order to do this hard work, because we all do the hard work.'",
        "'speaker_3': 'So I would just ask for a discussion on where we are. Where are our values today at this point in history? Do we value the residents of Denver having three representatives, or do we value the closer to the ground smaller district representation?'",
        "'speaker_3': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you. I appreciate the presentation. Councilmembers Flynn and CdeBaca. And we'll give you a chance to get back to your chairs. We've got 17 individuals who are signed up to speak this evening, and all participants are with us virtually.'",
        "'speaker_0': 'And so we're going to go ahead and get started. Our first speaker is Travis Leiker.'",
        "'speaker_1': 'It's. Good evening, Denver City Council. Travis Leiker, president of Capitol Hill, United Neighborhoods. I just want to say thank you so much for this thoughtful dialog this evening, as well as all of the work that you do on behalf of the city.'",
        "'speaker_1': 'I'm here just to provide additional background information. Capitol Hill United Neighborhoods conducted a survey of its membership, comprising roughly a thousand Denver sites in the central Capitol Hill area. And the respondents to that survey overwhelmingly opposed the proposal to eliminate the two At-Large positions, but were favorable to possibly include increasing the size of Denver City Council to'",
        "'speaker_1': '15 members with two At-Large and 13 districts. And so I feel like I would be remiss in not sharing the perspectives of our organization as well as the members that we represent. But I would also encourage council, as it deliberates this evening, to think about other processes and procedures that we do a really great job of as'",
        "'speaker_1': 'it relates to engaging community feedback ranging from liquor licenses to rezonings to other, more robust policy discussions such as the the ballot measures that we considered with respect to the bond measures. That has not been done in this case.'",
        "'speaker_1': 'We have not had any neighborhood meetings, conversations with community stakeholders, formulation of committees at the neighborhood level and the like. And so while our organization did not take a formal position with an up or down vote, I think it is worth mentioning on behalf of our organization as well as neighborhoods throughout the city, that a more thoughtful'",
        "'speaker_1': ', deliberative process would have been well-served for this engagement initiative. We heard conversations around the Austin model, the Los Angeles model, and the New York model. I would post to the council this evening that there be a Denver model and that we have the opportunity to co-create something that could be really meaningful, to increase democratic participation, to enhance'",
        "'speaker_1': 'advance voter notification around measures such as these or others, to boosting the size of council. We should be evaluating that. Organizations like ours can be your champion as it relates to increasing the sizes of your office budgets. We are here to be thought partners and we're here to engage in a robust conversation.'",
        "'speaker_1': 'But we would have liked to have had that opportunity over the last several years and unfortunately we weren't a part of that dialog up until now and only have weeks to prepare and to engage the citizenry in a thoughtful, deliberative process.'",
        "'speaker_1': 'And with that, I say thank you so much for your time.'",
        "'speaker_0': 'Thank you. Our next speaker is Kevin MATTHEWS.'",
        "'speaker_10': 'Hi. I'm Ken MATTHEWS. I live in Congress Park and I also serve on the board of Be Denver. So I am opposing this for tonight. This has been really not, as Travis said, this is there's not a lot of time given to to think this out.'",
        "'speaker_10': 'We often talk a lot about needing a lot of time to digest different proposals. And I think it's curious that the same amount of time was not given to this. I'm also a master's student at University of Denver studying environmental policy.'",
        "'speaker_10': 'And the reason I bring this up is my last term. I wrote a paper looking at the climate policies and the transportation policies of Denver. And compared to another pure city, Portland, Oregon, which is which is similar size about 670,000 people now.'",
        "'speaker_10': 'Now, Portland only has five city council members, actually six, if you include their mayor. They serve all at large, but they do break it up into they basically have different responsibilities. In terms of the climate plans between Denver and Portland, there aren't a lot of differences in the goals.'",
        "'speaker_10': 'A lot of they talk about complete neighborhoods. They talk about reducing car dependance and other things like that. The difference is Portland is actually succeeding in implementing those goals through legislation. And this body has not. And I don't know how removing two At-Large members makes this body any more effective.'",
        "'speaker_10': 'Watching this body the last couple of years. The biggest problem is a lot of council members believe that their individual district is an island that stands independent of all others and has unique challenges, and that what happens in their district does not affect a neighboring district, whether and that's whether it's housing or transportation or bike lanes, we'",
        "'speaker_10': 'just keep finding out that that's not true. There is a valuable perspective that At-Large members give to balance district members who are only focused on their district and not on the citywide. So I hope you take more time with this and and think it through.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Thaddeus Texter.'",
        "'speaker_2': 'You all know that I believe that at large elections constitute an instance of systematic racism and should be abolished. Some of you agree with me and some of you don't. But that's not what I'm here to speak to tonight.'",
        "'speaker_2': 'In a representative democracy, elected officials are chosen to determine what is best policy for a community. However, they are not properly selected to decide what is the best type of government for the community. In fact, given potential conflicts of interest, it's always dangerous when government starts to decide what is the best type of government.'",
        "'speaker_2': 'That is a decision that citizens must make for themselves. In fact, the city charter of Denver specifically leaves the question of what type of government should exist solely to the discretion of the citizens. Your job is simply to decide whether or not to submit the question to them, and that decision should not be made on the basis'",
        "'speaker_2': 'of your personal preference for the best type of government. It should be made on whether or not this is an appropriate time to reassess this question. This is, in fact, an especially appropriate time to reassess at large elections.'",
        "'speaker_2': 'First, numerous courts have ruled that they this type of election constituted is racially biased, and this alone should provide grounds for reevaluation. So also the immense growth of the city population makes the size of districts an appropriate topic for consideration.'",
        "'speaker_2': 'Finally, the fact that neither At-Large Councilperson is eligible for reelection in the city is required to engage in redistricting, makes this a propitious time to engage in the discussion. Previously, several of you had noted that this issue more requires more consideration and you may well be correct.'",
        "'speaker_2': 'However, the proper forum for that discussion is not this chamber. Rather, it is the public forum in which all citizens can participate. I know that some of you have taken informal polls on this topic and think that you have a sense of what your constituents believe about it.'",
        "'speaker_2': 'However, as you have noted, the type of polls that have been conducted are not particularly representative. What is required is a full public debate in the context of an election. As a result, I ask that you not preempt that debate facilitated by referring this issue to the voters.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is David Pardo.'",
        "'speaker_1': 'Hello. So many of you know me in a large part because I've lived in multiple districts in this city over the last few years. To me, the biggest issue with eliminating the At-Large seats is that it forgets about the 49% of Denver that rents and is.'",
        "'speaker_1': 'Maybe not going to be in the same neighborhood. In another year if their landlord decides to sell the property they're in or rents increase or they decide they want to move because they just do. And so to me, our At-Large council members represent those of us who rent, who may not have as deep roots in a single'",
        "'speaker_1': 'district, who don't see a district council member as somebody who is really representing their needs. Because we don't say, Oh, I'm from Highlands or I'm from five points or I'm from wherever we say, I'm a Denver, and that's what I am, because I've been in three different neighborhoods living in the last 15 months alone.'",
        "'speaker_1': 'So to me, it's it's really important to keep these At-Large seats to represent those of us who don't fit that traditional. Like, I bought a house and I've been here 20 years and I care about what happens in my district.'",
        "'speaker_1': 'I care about what happens in the district I live in right now, but I care significantly more about what happens in the city. And to me, that really is only represented by our At-Large members. I wanted to add, though, that there are a couple of other options out there.'",
        "'speaker_1': 'I think it's not a bad idea to expand to 13 districts if you do the math based on the number of council members there, how many sorry, how many constituents each council member represented. Years ago. 50 years ago.'",
        "'speaker_1': 'Based on those numbers, we should have 16 districts and we should have three At-Large members. I don't know that we need to have a 19 member council. But there are other options. Another option would be, you know, people talk about, hey, there's not enough funding.'",
        "'speaker_1': 'We only have like we have less than $3 per constituent. And I think that's a totally legitimate crisis. But. You could just increase your budgets. I don't think I'd have an issue with that obvious that we'd have to go in front of the voters.'",
        "'speaker_1': 'But I just think it's worth discussing other options, whether it's do we increase the budget, you increase the size of council. But I really, really don't feel like I'm going to be represented very well. If the two representatives who've consistently represented me for the last nine years that I've lived in Denver.'",
        "'speaker_1': 'If those seats disappear, then I have nowhere. I have somebody who who knows that I may be gone in a year and doesn't have to visit. So that's why time and thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Frank Sullivan. All right. We're getting Frank Sullivan up at the Q.'",
        "'speaker_2': 'Can you hear me now? Let's try this again. My name is Frank Sullivan. I live in Park Hill. I speak tonight in support of the Bill zero nine, a way to place them on November ballot, a proposition to convert the two council lunch petitions to district positions.'",
        "'speaker_2': 'You've heard my arguments in support of this proposal. You've also heard objections to those arguments, and I think each of those have resonated through the city. This is not a new issue. Discussions have gone on for quite a while in the city about this issue.'",
        "'speaker_2': 'Several times, one member of council prevented the issue from ever reaching the council floor. We've never been able to get this far. And finally, it should be for you to provide an opportunity for the citizens of Denver to weigh in on the issue.'",
        "'speaker_2': 'To be clear, two things. One, this is not about personality. It's about structure. Secondly, we are not asking you to convert the council at large positions to different positions. What we're asking is you place the issue before the Denver electorate and let the people decide.'",
        "'speaker_2': 'A packed house tonight or an empty house? A number of people who are speaking in favor of it or are opposed to it really are not a good gauge of the will of the people of Denver. The will of the people of Denver will gauge at a vote.'",
        "'speaker_2': 'Not not in this one hour courtesy hearing, as it were. Please place the issue on the ballot and let the people decide. There will be spirited discussion. Between now and November. And finally in November, the people will speak.'",
        "'speaker_2': 'Let the people decide. Thank you so much for your time.'",
        "'speaker_0': 'Thank you. Our next speaker is Darryl Watson.'",
        "'speaker_1': 'Council. President Gilmore, members of Council, thank you for your service to the city and county of Denver. My name is Darryl Watson. I'm a 30 year resident of Denver's District nine. I'm asking you tonight to vote no on a proposal to create an ordinance asking voters to eliminate the existing two at large council seats.'",
        "'speaker_1': 'During a community hearing, there were statements providing broad stroke conspiracies that the creation of the At-Large seats were underpinned by institutionalized racism. There is not an origin story of the creation of any governance system in this country municipal, state or federal that was not conceived through a lens of racism and patriarchy.'",
        "'speaker_1': 'There really isn't. What we are discussing tonight is the value of the current diversity council at large positions. Within this current system. The two current large city council members civil rights backgrounds are undeniable and speak loudly for themselves.'",
        "'speaker_1': 'Bad public policy process in 1968 should not be get more bad public process. Today, my reasons that I ask you to vote no are as follows A possible seismic change to the structure of our city. Governments should have had a more robust communication and community feedback process before being sent as an ordinance to the people to vote'",
        "'speaker_1': '. In reality, micro targeted districts could create a myopic focus on council responsibilities by some members of this legislative bodies. And please note that many district seats have never, never elected a bipoc member. And finally, leaders that are elected citywide can provide a legislative balance to our strong mayor executive structure.'",
        "'speaker_1': 'I also would like to add that large city council members provide three legislators to reach out to reach out to expanding the reach and impact of the only one district representative. And thankfully, in district in the district that I'm in, that I can reach out to Councilmember Ortega and Councilmember Kennish.'",
        "'speaker_1': 'I listened intently during the committee meeting when it council members shared their successful process for being available for their constituents. What resonated to me is that it wasn't so much a geographic size and population of the district. The Council persons responsible for that determines the level of constituent services that is provided.'",
        "'speaker_1': 'A $75,000 council district member does not reach out to 75,000 members. They reach out to a far smaller number. It is the size of the compassion. The interest in listening to constituents within that district is really what resonates and really what creates a level of high constituency service.'",
        "'speaker_1': 'We need both at large and district council members. We need to keep both of those council seats so that individuals like myself and others who rely on that honest support and the direction of a large council members will return.'",
        "'speaker_1': 'What remain? Thank you for your consideration and for voting no on this proposal.'",
        "'speaker_0': 'Thank you. Our next speaker is Dr. Adrian Stefanski.'",
        "'speaker_7': 'Hello and good evening. Members of Council. I am here to speak in favor of Resolution 908 to convert, not eliminate, but to convert the At-Large seats into two additional councilmember districts. I listened last week as Denver residents were accused of being un-American for being disenchanted with the ballot.'",
        "'speaker_7': 'This statement neglected to mention that when Denver adopted its mayor and council government in 1904, women couldn't vote. We were just reminded of the patriarchal foundation of our government by the previous speaker. But it is an illusion. The citizens in Denver are represented by three council persons.'",
        "'speaker_7': 'We heard it again tonight, but I'm here to tell you that that isn't an illusion at best. We are represented by a single one. I have heard that At-Large council people are busy working on legislation, policy or addressing citywide issues, and I simply disagree.'",
        "'speaker_7': 'I have not seen the results of this. I have not seen the critical legislation we need. What I have seen is At-Large councilors works, criticize and obstruct most meaningful legislation that has come through and to sit on the dias.'",
        "'speaker_7': 'And critics criticize how residents choose to engage. So I feel very lucky that I have been represented by Councilwoman CdeBaca, who tirelessly advocates for the people of District nine. And I really object to the idea that this proposal was rushed.'",
        "'speaker_7': 'This proposal started out with my councilwoman showing you a timeline. I object to the idea that any changes that are necessary toward a government need to take years. This is an issue of something getting referred to the ballot, right?'",
        "'speaker_7': 'So you can't have it both ways. You can't criticize people for voting or not voting and then not not wanting to give them the opportunity to vote. So I think that we've gotten to a point with with this dysfunctional council that you really need to start referring things to the ballot.'",
        "'speaker_7': 'We don't need to spend years. We need change. This is perfect timing. This is literally the perfect timing. With two At-Large council members turning out at the same time, there could not be better timing. This is not rushed.'",
        "'speaker_7': 'This is well done. Please pass this on to the voters. Just please, please support this very common sense. Move into the future. Thank you very much for your time. Please support this. Please support. This. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jonathan Patoka.'",
        "'speaker_1': 'Hello.'",
        "'speaker_7': 'I can hear you now.'",
        "'speaker_0': 'We can hear the area.'",
        "'speaker_1': 'Oh. Okay. Excellent. Hey, good evening. Houses down Tokyo District three. Tonight, I'm speaking against the notion of the Senate conversion of council seats to this false ballot. You've already heard from others that the projects are at large. Representative.'",
        "'speaker_1': 'Some undertaken are distinctly valuable, are not duplicative of the work our district representatives do, and allow for a wider breadth of legislative focus across one citizen's representatives. Adding to what you've heard already, I'm here to speak to two additional arguments.'",
        "'speaker_1': 'First up, this is a solution in search of a problem. And to that, placing the question on the ballot for voters to decide. Even if this council doesn't necessarily think it's the best solution is not a harmless act, does not amplify the voices of people.'",
        "'speaker_1': 'It is ill advised to begin. We've heard the difficulty. The difficulty that you or councilors face when doing your work amidst an increasingly large population of Democrats is understandably challenging for district network members alike to find ways to connect with your many residents, in each being only one place at a time.'",
        "'speaker_1': 'And we all know how many neighborhood meetings and events overlap on any given day of week. District representatives now represent the voices of over 50,000 residents each, while our at large councilors represent the whole city. And these numbers are rising.'",
        "'speaker_1': 'But it's clear that converting our At-Large seats today once doesn't solve these problems. If districts become smaller, that does nothing to help you attend multiple simultaneously simultaneous events. It doesn't help you personally research a broader diversity of legislative topics.'",
        "'speaker_1': 'In short, a smaller district doesn't extend your reach. On the contrary, having more support staff and alternatives that has been resoundingly popular in our discussions and surveys would extend your reach if the issue we were trying to solve is one of reach.'",
        "'speaker_1': 'We should ask voters to increase budgets for your staff and to note, even if we were to take at face value, that a smaller district would make your work easier or better in quality. This proposed solution would be nothing more than a Band-Aid with the gross history of a councilwoman said about us here.'",
        "'speaker_1': 'It wouldn't be long before 15 district councilors represent as many as 13 do today. It's clear that this proposal walked backwards from its desired solution to find problems that could passively support a narrative instead of letting problems guide the solution.'",
        "'speaker_1': 'Further. I've heard arguments in committee and elsewhere that we should place this proposal on the ballot anyhow in order to let the people decide or to let the voters have this discussion. This assertion assumes that placing this question of question on the ballot at worst amplifies the voice of the people and does no harm.'",
        "'speaker_1': 'That isn't the reality of council sponsored ballot questions, particularly this one. When an initiative reaches the ballot in this council, there's a tacit assumption among voters that this council did its due diligence before sending that question to the people.'",
        "'speaker_1': 'We, the voters, should be able to reliably believe that this council identified a problem with solutions and determined that the sponsored question was the best solution. When we see these, we think that this council didn't pass what you ostensibly consider to be ideal legislation only because you were prevented from doing so by your charter, not because the'",
        "'speaker_1': 'idea crossed the desk and said, Why not let them vote? This won't make it for public debate. Here the voters are presented with only one inadequate path for a yes or no. I urge you. Vote no. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is David Hagan.'",
        "'speaker_1': 'Hi. Thank you, Counsel, for being courteous enough to let me speak this night. I am going to say this should be given to the voters, basically based on. The last the last one we voted are you voted on Sway?'",
        "'speaker_1': 'Hinds and Clark all said they did not support the last one, but yet they wanted the voters to decide. So I would expect Sawyer, Hines and Clark to all vote yes on this one, to let the voters decide.'",
        "'speaker_1': 'If not, I'm going to find that quite a bit interesting. We just decided to let the people just decide on a neighborhood how it was going to be. Gentrified, basically. Most of the people are going to understand that they're going to vote however somebody tells them to.'",
        "'speaker_1': 'Right now we're asking the question that affects every single person in the city, and we need to be letting the voters decide on this one. If you oppose it, maybe you should start a conversation after you give it to the voters, because right now they keep talking about.'",
        "'speaker_10': 'Three people representing me. Well, I would.'",
        "'speaker_1': 'Assume that maybe I had four. If you think about the two at large.'",
        "'speaker_10': 'The president, and then my.'",
        "'speaker_1': 'My my councilman. Currently, I believe I have one because not as president, not a single At-Large person has ever responded to an email I've sent ever.'",
        "'speaker_10': 'So to say that they.'",
        "'speaker_1': 'Represent you is not necessarily true. I just don't see that to be the case. And I actually am curious to find out how they spend their budget. Because I don't know. It's just everything seems a little bit weird here.'",
        "'speaker_1': 'And they come back and say, this is Rush. When we just went through the whole set, the whole thing about the last one being Russ and you voted for it anyways. Would it have to be black and brown vote?'",
        "'speaker_1': 'Mostly, mostly brown people.'",
        "'speaker_10': 'And then now.'",
        "'speaker_1': 'We have a bunch of white people up here other than one other person, which are white people saying that we shouldn't do this. So I would like to understand where we are and. Yes. Everything has been built upon a racist system.'",
        "'speaker_1': 'We all know that. But it's our duty to stop that, not to acknowledge it, then continue forward and do the exact same thing over and over again. We should stop it. We should have somebody that represents each and every person in the city.'",
        "'speaker_1': 'And I also would like to say that my councilwoman, she represents people outside of her district because she cares enough to listen to them, to respond to them, to create relationships with them. I don't get that from my at large people.'",
        "'speaker_1': 'I'm sorry. I don't mean that, you know, but it's the way it is. I don't ever get a response. And frankly.'",
        "'speaker_2': 'If our council really gave a damn.'",
        "'speaker_1': 'About us, they wouldn't shut public comment off 3 minutes early, one minute early, they'd go 2 minutes over, one minute over, because they want to let the people talk because it'll.'",
        "'speaker_2': 'Take.'",
        "'speaker_10': '1500.'",
        "'speaker_1': 'Years for all of us to speak. If we want to go there once at a courtesy when our public hearing and 20 people get cut off. Excuse me. That's not courteous. That's. I don't give a shit about anybody but my views.'",
        "'speaker_1': 'The people are here to speak. You let them speak. If you cared about the people, you would let the people speak. And that's the way it would be. So let the people speak. Let them vote on what is coming down the way.'",
        "'speaker_1': 'Since we're so adamant about letting them vote on it.'",
        "'speaker_0': 'We have freed speaker. Our next speaker is Steven Benishek.'",
        "'speaker_1': 'Oh. Can you hear me? So.'",
        "'speaker_0': 'Yes, you can. Go ahead.'",
        "'speaker_1': 'Okay. Hello. My name's Steven Bunch. I live in District six and I'm here to speak against this proposal. So this is going massively over the last ten years. Not to even mention the past 51 last change to the council was made, as we heard.'",
        "'speaker_1': 'So it's obviously clear the time has come to reevaluate how we can best provide effective representation. However, I do have several concerns with this proposal. The first is in transforming the At-Large seats, which I believe would drastically decrease representation for the people of the city.'",
        "'speaker_1': 'There are ways to correct the democratic deficit in the current election about large numbers. However, this council, when presented with a report, chose to do nothing but move the election date back. Great city wide initiatives like Group Living have come out of that large seats.'",
        "'speaker_1': 'And Councilmember CdeBaca explained just before how current council members are swamped just within their own districts. Time is a finite resource, and current district members have to choose between spending their time on representing their districts and working on citywide policy like we heard.'",
        "'speaker_1': 'Limiting these seats and turning them into district represents also creates major equity concerns with renters who are more likely to move around the city standing to lose representation as opposed to wealthier property owners who are settled in one district.'",
        "'speaker_1': 'The second problem is in this process, this process through which does come about with public only learning about it may even have discussions have been going on for a while. There are many different paths that this could take and reevaluate the city council from expanding the council its current ratio, adding some large adding some district seats to'",
        "'speaker_1': 'increasing staff budgets. However, because of the timeline to get this on the ballot for this year, a low turnout election. There hasn't been enough time to properly consider all the possible alternatives. There's plenty of time for these conversations to take place before redistricting in 2022 and elections in 2023.'",
        "'speaker_1': 'For these reasons, I ask you to vote no to give this topic further considerations. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Tess Dougherty.'",
        "'speaker_7': 'Hi, Counsel. Thank you for holding this public comment tonight, albeit not enough. I wanted to just talk about equity. So a few things. One, the notion that district council members do not work on citywide issues is a farce.'",
        "'speaker_7': 'So everybody keeps coming forward talking about that. And there are plenty of things that are brought forward by district. District level council people that impact everybody in the city. There are numerous examples. I don't know why that is continued, a continued narrative that is just not true.'",
        "'speaker_7': 'The second the if we're going to talk about equity. You know, earlier tonight I mentioned the River North Plan, which, by the way, you know, the name River North in and of itself is, you know.'",
        "'speaker_9': 'Came out of gentrification.'",
        "'speaker_7': 'That neighborhood is called Five Points. And they literally they they say it in the.'",
        "'speaker_9': 'Plan how.'",
        "'speaker_7': 'They want to rebrand it to make it more marketable. You know, because because prior to that.'",
        "'speaker_9': 'They prior to all of the white people have come in and literally colonized the land. They, you know, just they couldn't have it associated with the name five points because that is associated with black and brown people.'",
        "'speaker_7': 'And so, you know, on that plan is Debbie.'",
        "'speaker_9': 'Ortega's name actually.'",
        "'speaker_7': 'Because she was she's been around since that since then she's been a part of these plans. So to talk about equity as if the current. At-Large members are doing it for everybody is probably not true. The third is that.'",
        "'speaker_7': 'You just let the voters decide on a half a billion dollar bond package? And yet you're maybe not going to let them vote on this. That's ridiculous. We're putting into people's hands. You put into all of the voters of Denver to decide on a neighborhood that didn't even get a seat at the table.'",
        "'speaker_7': 'About what happens to their neighborhood, and yet you're going to let the rest of the city decide. And now you're going to say that the rest of the city can't decide on this. That's absurd. It doesn't even make any sense.'",
        "'speaker_7': 'Please let the voters decide on this.'",
        "'speaker_0': 'Thank you. Our next speaker is Douglas Price. Shannon Hoffman.'",
        "'speaker_7': 'Good evening, members of Council. Can I be heard?'",
        "'speaker_0': 'Go ahead, chef.'",
        "'speaker_7': 'Thank you. I am here in support of Bill 21, 0908. At first it was simply logic around numbers. Right. Smaller districts mean that we can have closer representation. But last week during a Denver City Council committee meeting, a person Mr. Thaddeus thank you gave comment indicating that other in other seats, At-Large seats have been struck down by'",
        "'speaker_7': 'courts due to finding at large voting districts to be racially discriminatory by the Voting Rights Act of 1965. So just to share with you a little bit of that research from an article called Challenging the Racism of at Large Elections.'",
        "'speaker_7': 'In 2000, the DOJ announced that the At-Large method of electing city council members in Morgan City, Louisiana, violated the Voting Rights Act by diluting the strength of black voters in 2002. They blocked the DOJ block plans in Freeport, Texas.'",
        "'speaker_7': 'This also happened in Charleston County, South Carolina. Fayetteville, North Carolina. Georgetown County, Lake Park in Florida. Fayette County, Georgia. So you can look into the history there. You might be thinking, but, Shannon, this is the South. Well, America is the south.'",
        "'speaker_7': 'And may I also remind you that Denver was ordered by the Supreme Court in 1973, almost 20 years after board the Brown v Board of Education to desegregate schools. So we have an issue here, too, that we have to deal with with anti-racism in our public systems.'",
        "'speaker_7': 'You see in our new census data that we have pushed black and brown people out of this city. So we need representation for all people as we continue to make statements about commitments to anti-racism. This is an opportunity to act.'",
        "'speaker_7': 'This is an opportunity to engage people who have typically been underrepresented and pushed out of the political process. This is an opportunity to do something unlike we have done with the residents of Global Elyria, Swansea. Last week we we passed a bond test, said, thank you, that's almost half a billion dollars and did even less community engagement'",
        "'speaker_7': 'than what has happened here. In fact, many of those residents were blocked from engaging and they still have no idea about how they will benefit from that project. Please pass this forward to the voters so that we all may engage in this process.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Keith Pryor. All right. It looks like we don't have Keith in the queue. Next up is Jesse Paris.'",
        "'speaker_1': 'Yes. Good evening, members of the council and those watching at home. My name is Justin with Sam Paris and I'm representing four black socks and move for self-defense causes of massacre. America's also changed was the Unity Party of Colorado in front line black news.'",
        "'speaker_1': 'And I will be the next mayor of Denver in 2023. I am in favor of passing this on to the voters to decide on what we're going to do with our two at large positions. I'm in favor of converting them into district seats.'",
        "'speaker_1': 'Representation matters and clearly we are not being represented, especially black people, foundational black Americans, American descendants of slavery in this city. We are not being represented. We are being displaced, continue, marginalized and gentrified out of our communities. So I am full support of passing this on to the voters.'",
        "'speaker_1': 'Let the voters decide. As seen in Candy, Councilwoman Candy said about this presentation, there has been due diligence done on this. So there has been enough time for the voters to decide. So we just need to go on and pass this on to the voters to decide in November.'",
        "'speaker_1': 'All this talk about. We're not being. There's a population growth. And. The numbers are not keeping up with the city council. So when we do the redistricting in 2022. We need to keep all that in mind because we are not being represented as a continued state.'",
        "'speaker_1': 'We're not being represented by people who are not being represented by people who are not being represented, as we seen last week with the Bonn passage of half a billion dollars and the people and the community of which this is going to be taking place where not even at the table.'",
        "'speaker_1': 'So we have a problem, Denver And our problem is racism, white supremacy. And we continue to perpetuate it by passing these bills, these ordinances and all the above. So just leave it up to the Denver voters to decide what we're going to do with our seats.'",
        "'speaker_1': 'I get more representation from can Candi see the who's not even in my district. I'm in District eight, Councilman Hardy's district, and I don't even go to him for help. I don't get replies, back, e-mails, nothing. And I don't get the same from the at large seats.'",
        "'speaker_1': 'And I ran for out of large in 2019, almost 15,000 votes with no money. So I can attest to how racists and white supremacists. Such a racist. Thank you.'",
        "'speaker_0': 'Thank you. And a quick reminder to our speakers, we ask that you address your remarks to all of council instead of individual council members. Our next speaker is Susan Barnes Guild.'",
        "'speaker_7': 'Hi.'",
        "'speaker_10': 'I neutered and started video.'",
        "'speaker_7': 'Oh, here I am. So pretty much everything I was going to say has been said. I agree.'",
        "'speaker_10': 'That this.'",
        "'speaker_7': 'Has been rushed to the ballet. And I guess my big question.'",
        "'speaker_10': 'Is I'm not clear on what the problem what problem me trying to solve, I would argue, is Kevin Flynn, acknowledge that nothing big got done without Cathy Brown. Every big construction deal, every big policy deal. And she was superb.'",
        "'speaker_10': 'And I would. Argue with well that I.'",
        "'speaker_7': 'Worked on my two.'",
        "'speaker_10': 'Terms on council.'",
        "'speaker_7': 'Several very important.'",
        "'speaker_10': 'Issues, perhaps the most.'",
        "'speaker_7': 'Consequential.'",
        "'speaker_10': 'Being the transformation of Denver General Hospital to Denver Health Authority, which was big, heavy lifting.'",
        "'speaker_7': 'And Wellington, of course, was the mayor.'",
        "'speaker_10': 'And it was he came.'",
        "'speaker_7': 'To me and he.'",
        "'speaker_10': 'Said, okay, Barton Scout, I'm going to.'",
        "'speaker_7': 'Let you handle this, because Wellington was pretty.'",
        "'speaker_10': 'Close to my.'",
        "'speaker_7': 'Husband, Howard Delk, because Howard Gilbert tells me that.'",
        "'speaker_10': 'You are fearless.'",
        "'speaker_7': 'And to tell you the truth, I think I know this is the right thing to do.'",
        "'speaker_10': 'I completely support patty gbo.'",
        "'speaker_7': 'I think every citizen of Denver deserves.'",
        "'speaker_10': 'The best level one.'",
        "'speaker_7': 'Health care.'",
        "'speaker_10': 'Available.'",
        "'speaker_7': 'But I'm not in a position.'",
        "'speaker_10': 'To take the flack that this is going to generate.'",
        "'speaker_7': 'So I think I mean, that certainly is my proudest accomplishment.'",
        "'speaker_10': 'But I would also argue that.'",
        "'speaker_7': 'Initiating a comp plan after 40 years without one, redoing the zoning code, which candidly I.'",
        "'speaker_10': 'Apologize for.'",
        "'speaker_7': 'And many other land use and preservation.'",
        "'speaker_10': 'Historic district view planning issues were my purview. So I do think that the district council. I think you should.'",
        "'speaker_7': 'Add two more district council seats and.'",
        "'speaker_10': 'Keep the march. Thanks for the opportunity.'",
        "'speaker_0': 'Thank you. We would also like to acknowledge former council member Susan Barnes, Gil, as well. Thank you for your comments. And our last speaker this evening is Dewey Jackson.'",
        "'speaker_1': 'Thank you, Madam President. I am Dewey Jackson, a resident of District eight and also the president of the Denver Area Labor Federation, where we we represent over 90,000 plus members in the Denver metro area who work and live in these districts.'",
        "'speaker_1': 'And I would be opposed to abolishing the last two seats and ask that you would also vote no because it weakens the power of the council. And most of those workers are women and people of color, and that makes them lose two thirds representation.'",
        "'speaker_1': 'And historically, the model that the council is now has worked up to this point. And I would just say that to consider the alternatives of increasing district and staff funding, to take that to be able to service the new ballot, the new redistricting lines would be better than abolishing the two At-Large seats.'",
        "'speaker_1': 'Thank you for your time.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening. Questions for members of Council on Council Bill 908. And I believe we have Councilmembers Flynn and CdeBaca available for any questions. All right. CNN. The public hearing is closed. Comments by members of Council on Council Bill 908.'",
        "'speaker_0': 'All right. There we go. Council member Swire.'",
        "'speaker_9': 'Thanks, Madam President. I think this really comes down to a question of good governance and whether it's responsible to refer this proposal to the ballot. Has there been enough community outreach and engagement? Has it been vetted enough for consideration by the voters who are trusting us to do our jobs?'",
        "'speaker_9': 'As I said in committee, my office in our own admittedly unscientific community survey and found that the majority of the respondents don't support getting rid of the two At-Large seats. And I'm frankly not sure that I support it either.'",
        "'speaker_9': 'I think the solution is for the mayor's office to fund our council offices appropriately. We simply cannot pay our staff what they deserve and staff at appropriate levels to meet the level of customer service that our constituents deserve.'",
        "'speaker_9': 'In my office, each of my full time staff members services approximately 22,000 constituents each. My staff works really, really hard and they should absolutely get paid more. But if I paid them what they're worth, I wouldn't have any money in my budget for SurveyMonkey or constant contact or mailers or translation services or all of the things that'",
        "'speaker_9': 'we are required to fund out of our Council Council budgets in order to assure the excellent ensure the excellent customer service that our constituents deserve. That said, I think that my colleagues are probably right now is the time to look at this issue.'",
        "'speaker_9': 'And I do believe that the voters deserve to have a conversation. So I will be a yes on referring this to the ballot this evening so that the residents of Denver can engage in this conversation as well. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Sawyer. Councilmember Hines.'",
        "'speaker_1': 'Thank you. Council President. I want to repeat a comment made in committee because I don't think it really has been addressed. I see this as a, um. This particular question is a combination of two separate questions. Question one Should we have 11 or 13 District Council members?'",
        "'speaker_1': 'Question two Should we have zero or two At-Large Council members? I'm a little concerned that we're in the interest of expediency mashing those two questions together. So I, I think that if we were to have a public comment or a public stakeholder process, I, I, I personally believe that we would, uh, we would find a lot of'",
        "'speaker_1': 'people willing to, uh, to address both of those questions on the ballot as opposed to having them arbitrarily combined to this particular question. Another comment I made in committee is that 100% of those who provided feedback to my office all made comments asking me to keep the large seats, which isn't exactly the question that is being asked'",
        "'speaker_1': 'or asking me not to refer the question of the ballot. The outreach includes multiple constituents who are former Denver City Council members, including former council member Susan Barnacle. I made this comment on the record in committee, expecting a deluge of responses from constituents yet again received not a single email from anyone asking me to eliminate the At-Large'",
        "'speaker_1': 'seats or to refer this to the ballot. Specifically, one constituent wrote, But I am oppose the elimination of the At-Large districts. I don't even want to see it on the ballot. That is as it is one that can be easily promoted with weird slogans.'",
        "'speaker_1': 'This is a solution working for a problem. So I ask you to vote to oppose putting it on the ballot. Sure we've bantered this question around for a long time. This banter has been theoretical in nature, and there's a difference between banter and serious consideration now that we're seriously considering.'",
        "'speaker_1': 'I would strongly encourage us to have the conversation with the community about the two questions before sending it to the ballot. Next. I understand that the original ballot measure that added large was rushed. While I agree that the rushed process then was controversial, I disagree that we should then normalize controversy and refer this one to the ballot'",
        "'speaker_1': 'because of the same rush process. While District ten does not have a history of Bipoc council members, it still has broken a barrier by choosing a first elected official in Denver's history who uses a wheelchair for mobility. There are other ways to break barriers.'",
        "'speaker_1': 'Finally, Denver is growing up. We are no longer a cowtown in a flyover state. We're a top 25 U.S. city that continues to grow by leaps and bounds. As we grow up, we will increasingly move toward representative democracy.'",
        "'speaker_1': 'That's just what happens in most cities, with the two potential exceptions of New York and Chicago. I look forward to a conversation that includes ensuring council has adequate funding to communicate with constituents. I look forward to a conversation with the two questions.'",
        "'speaker_1': 'Until then, I will vote no to refer this to the ballot. Thank you. Council President.'",
        "'speaker_0': 'Thank you. Councilmember Hines. Councilmember Black.'",
        "'speaker_7': 'Thank you, Madam President. And thank you, Councilwoman Sayed Abarca and Councilman Flynn for bringing this forward. I learned a lot from your presentation, so thank you for that. I've been working on a lot of good governance things with the council and with Councilwoman Gilmore this past year.'",
        "'speaker_7': 'And one of the things I'm kicking off very soon with our clerk, Paul Lopez, is a ballot measure working group. And one of my goals with that is to ensure we don't get into this position in the future where we are deciding to put something on the ballot that we haven't had the time to vet, we haven't'",
        "'speaker_7': 'had the time to understand it. I think it is our responsibility as legislators to really understand what we are putting on the ballot before we put it on the ballot. I can't say that I would be for or against this proposal, but I just don't know enough about it.'",
        "'speaker_7': 'I'm going to read a few sentences from a letter that we all received from the League of Women Voters because they they stated very well. It says Our opposition is based on our position on citizen participation in government, which advocates for increased opportunities for citizen input into the governmental process.'",
        "'speaker_7': 'The process leading up to the August 23rd public hearing does not meet these criteria. Charter amendment consideration should be removed from council proceedings until a broad public discussion has taken place. Our opposition is to the current process because there has not been sufficient discussion of a change with such far reaching implications.'",
        "'speaker_7': 'Council has known for at least three years that there would be simultaneous turnover of both at large city council positions and a once a decade redistricting. Such a fundamental change to our charter and representation, a staple of Denver government since its installation in 1968, must be widely discussed with widespread forums and speakers generating thoughtful consideration by the'",
        "'speaker_7': 'citizenry. I agree with what that letter says and I would be very open to discussing this further. I just don't feel comfortable referring it to the ballot. With having so little information. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Black. Next up, we have Councilmember Herndon.'",
        "'speaker_1': 'Thank you, Madam President. I'm glad that we're having this conversation because I want to share this number with you. So the 1970 census. So when we move to the current configuration that we have right now, the population of Denver was 514,000.'",
        "'speaker_1': 'You divide that by 11, that's 46,000 per district. You fast forward several decades later, we have the same number of district representatives and we have a population of 200,000 more. Which breaks down to just about over 50% increase when they decided to increase the structures broken.'",
        "'speaker_1': 'And I have the unique position of representing two districts during redistricting because I represented District 11, which went from 23rd in Holly all the way out to the airport. My district was over 80,000 people. And I can tell you that was too big.'",
        "'speaker_1': 'And I was thankful for the redistricting that brought it down to 55,000, an appropriate level and number to be able for what we are asked of as local electeds. Because what's unique about this position, what people ask of their city council members are not asked of their state representative, their state senators, their school board members and RTD'",
        "'speaker_1': '. In my opinion, what we are asked to go to, what we were asked to participate in is significantly higher. And that's what the question is. What is what is the appropriate size for the districts? If we stay with our current configuration, with the 715,000 as a census brought forward, it's approximately 66,000, 20,000 more than what we had'",
        "'speaker_1': 'in 1970. Maybe it is. Maybe some people still feel that it's sufficient enough. I think it's worth the question because I believe that due diligence and research has been done to see other cities what they do outside of Denver.'",
        "'speaker_1': 'I don't believe we should replicate another city, but ask the question, are what other cities are doing appropriate for Denver? I believe the research has been done. I believe this is a valid question. I don't believe that it is.'",
        "'speaker_1': 'RUSH That's always the argument. People say if they feel as if they don't want something to go to the voters, I believe this is fair. I would look forward to discussion if it doesn't pass. This council should do something when it comes to our size, and I don't believe money is the solution to that.'",
        "'speaker_1': 'I would have been open if there was a proposal for going to 15 to add more, but that proposal wasn't forward. No one brought anything forward. It was just a matter of debating this one. So I want to I want to thank Council member State of Bock and Flynn for bringing forward a solution to a problem that'",
        "'speaker_1': 'I believe we need to address. So I will be in support of sending this actually, I'll be supportive of publishing this because this is on first reading, but I do hope that we send it to the voters, if not figure out a way we can better support our constituents in our districts.'",
        "'speaker_1': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Herndon. And we're going to transition online right now or virtually we've got Councilmember Ortega and then Councilmember Cashman. Go ahead, Councilmember Ortega.'",
        "'speaker_7': 'Thank you, Madam President. I'm going to try to be concise, but I think it's important to capture some of these issues that were brought up. I had an opportunity to participate in a discussion with Inter Neighborhood Cooperation, ANC Councilwoman CdeBaca, who presented this same information to them, and overwhelmingly the majority of the people who were in attendance'",
        "'speaker_7': 'in that meeting and as you know, they represent neighborhoods all across the city, had very similar concerns as those that were expressed tonight. In fact, some of them were some of the very people that were part of that conversation.'",
        "'speaker_7': 'I think the argument about renters is a very, very valid concern. So if somebody wants to run for a seat, if they're a renter, they are at the mercy of their landlord. And we've seen this happen with with people all across our city where they have to move.'",
        "'speaker_7': 'When a landlord decides to either sell or condo, convert a home or scrape it and have something else put on the property, and, you know, you're left with no choice but to have to move. And we have some active renters in our city.'",
        "'speaker_7': 'Their voice is equally as important. And the fact that, you know, they could only run for that large seat is the only way they be able to represent over half of our population that are actually renters. This is data from the U.S. Census Bureau.'",
        "'speaker_7': 'Another point that I wanted to make is when you look at the comparison of cities and what structures people have in those cities, the National League of Cities actually looked into this issue and their focus is on equitable civic engagement, and they recommend that the hybrid, which is the At-Large and the district seats, is their model charters'",
        "'speaker_7': 'that they recommend. And so I think that's important to share. We know that we have people who are active in our state legislature, who attend many of our House district meetings and some of the Reno meetings, most of them not only the state legislature, but our school board members, as well as our RTD district members.'",
        "'speaker_7': 'They represent much larger districts than what our district offices do. And we have three staff people or can have up to three staff people. Some members of council choose not to fill all three of those positions or they spend the money differently on their staffing.'",
        "'speaker_7': 'But most of them either have limited staff or no staff and are representing much larger districts. And it doesn't mean to say that they're not receiving and responding to constituent concerns that come in to them on a regular basis as well.'",
        "'speaker_7': 'Over my 42 years of working with the city or as a staff member to a council person, a staff member at our Office of Human Services and my 26 years on as a council member, I have witnessed many votes and decisions where having At-Large members at the table ensured a more robust debate that reflected the perspectives at'",
        "'speaker_7': 'a much broader city level rather than just a localized district perspective. Councilman Herndon talked about the how the districts had changed in size over time. I think it's also important to share that as the districts have grown, so have the staffing levels and the amount of money that was budgeted to each office to ensure that we're able'",
        "'speaker_7': 'to meet the needs of the constituents that that we all represent. And I can remember at one time that large seats actually got more money than what the district seats did. And we have the same budget as the district, but district offices do.'",
        "'speaker_7': 'It's always been mandated that the At-Large seats are housed downtown. We have a number of district offices, three of whom are supporting this particular measure that have offices out in the community. In some cases, they're in city buildings.'",
        "'speaker_7': 'In other cases, their rents are paid out of our district. Central budget for central budget. And so. The conversations that I have heard from my colleagues are about, you know, the concern related to being able to pay enough to keep good staff and the issue of, you know, having enough money to be able to do some of'",
        "'speaker_7': 'the things like newsletters and surveys and those kinds of things. And that's the conversation that we should be having. As as you heard from many of the speakers, part of the concern is the fact that we have not done the same outreach and robust community engagement that we did when we brought the whole package of ballot initiatives'",
        "'speaker_7': ', the charter changes that we did last time around when I chaired that committee. We started that six months in advance to, you know, vet the different ideas that people were bringing forward, both from colleagues as well as from internal.'",
        "'speaker_7': 'Agencies, independent agencies and some of our external partners that are that work with our our city staff people from the Fraternal Order of Police to. You know, those kinds of groups. And in this case, we did not do that.'",
        "'speaker_7': 'And you're hearing from the public that, you know, we should be looking at maybe adding two more seats, but keeping the At-Large seats in place because people value having that, you know, that diversity of representation. And we we're not having that conversation.'",
        "'speaker_7': 'That's not the proposal that is on the table for us to consider. And and so that's where I think we're really lacking in this process. And just because timing seems to be an issue about. You know, looking at the fact that.'",
        "'speaker_7': 'You know, Councilwoman, we can eat. You know, we'll both be gone for this next election cycle. And it's not about us, but it's about the structure. And to do something so drastic in such a quick timeframe without that thoughtful engagement from the public that we heard tonight, you heard it and see, I've been hearing it from constituents'",
        "'speaker_7': 'that are, you know, sending e-mails and calling my office that they they really do feel like this is worse. And so for for those reasons, I will not be supporting this. I think people have a misconception that by.'",
        "'speaker_7': 'Basically removing the two at large districts and creating more districts that were going to create some some, I don't know, equalization, some equity in the process. But not all districts are created equal. It depends on the geography that you happen to get.'",
        "'speaker_7': 'There are certain districts that have far more activity than others that require three units to have three staff people and to maybe attend more movies. So it just depends when the boundaries get reshaped. What geography you happen to have that's going to determine, you know, your your workload.'",
        "'speaker_7': 'And again, that's the conversation that we should be having. This is not broke. We shouldn't fix it. We don't have clarity of what it is that is broken that we're trying to fix. And I. I just can't support this moving forward.'",
        "'speaker_7': 'Thank you, Madam President.'",
        "'speaker_0': 'Councilmember Ortega. Next up, we have Councilman Cashman.'",
        "'speaker_2': 'Yeah. Thank you, Madam President. I'll try not to repeat too much of what my colleagues have already said as far as the time frame, whether or not we've had enough time. This is a major change to the to the way we're proposing to govern our city.'",
        "'speaker_2': 'It's been proposed that, well, if it's been too rushed, you know, now we can have a discussion and let the people have the discussion. If we had six, eight, nine months ahead of us to have that discussion, I might think that was a reasonable way to approach it.'",
        "'speaker_2': 'But by my look at the calendar, this would give us a couple of months and to put forward a proposal of this magnitude, of any similar magnitude, and say you've only got two months to discuss it. I think most of the time the public, including a lot of folks who are presented tonight, would be outraged.'",
        "'speaker_2': 'So I lean to the point that we haven't had enough time. I think it's an important discussion. I mean, looking at the issues that people like Frank Sullivan and Thad Tex have brought up about equity, you know, racial and otherwise are critically important.'",
        "'speaker_2': 'I mean, you know, reason would say that this topic would merit a full whether you want to call it a task force or a committee, but a full unveiling of all the issues. The one thing that I find really interesting that I haven't heard vetted in any way.'",
        "'speaker_2': 'If I remember Councilman Herb Herndon's numbers, I think in the what, the seventies, we had 46,000 a district. Right now, if we stay at 11, we're up to 66,000. Well, when they had 46,000 people per district, those district offices were not hearing from 46,000 people.'",
        "'speaker_2': 'And I don't believe we have the statistics to tell us how many unique contacts we are getting from our districts. And I think this discussion calls the question that we probably need to figure out a way to begin assembling that data, because whether this passes or not, at some point it very well is worth looking at how'",
        "'speaker_2': 'many districts we should have. Because, you know, if we if we now had 66,000 people, I know that that's if we're mailing door to door, that numbers are extremely important. And that's a budgetary question. But how much staff we need is more reliant upon, you know, what's the difference in population that we actually need to be in'",
        "'speaker_2': 'contact with by email, by phone? I think it's a great conversation. I really do. I just don't think we have the time or the structure to properly vetted in this particular issue. And so I think that's all I have to say.'",
        "'speaker_2': 'And so I'll just say thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Cashman. Up next, we have Councilmember Flynn.'",
        "'speaker_3': 'Thank you, Madam President. I agree that I wish there had been. I agree with the folks who say they wish there had been more time. The fact is, as Alex Hernandez, a Denver public library documented for us, we've probably had triple the amount of discussion on this than they did in 1968 when they added the At-Large seats'",
        "'speaker_3': 'at the last minute in the legislative process. Things were much different in 1968. I can't I can't really disagree with the folks who say they wish we had more time. I do, too. What I also know is that I'm grateful for having had the discussion.'",
        "'speaker_3': 'I think it had to occur because of the convergence of the redistricting with the two open seats. If we were to take this up in the next redistricting, we would most likely be looking at a district being out incumbents.'",
        "'speaker_3': 'That could be done, but it's not politically very easy. So I'm really grateful for the fact that we've had the discussion now. I do want to emphasize one point that I made there at the podium, and that is the nature of the voter turnout for the at large races in historically.'",
        "'speaker_3': 'The undervote in the At-Large races would raise the question in my mind of how representative are the At-Large positions of the city as a whole when in in one year when they were open seats, 24,000 votes citywide was enough to win a seat.'",
        "'speaker_3': '17,000 votes in one race was enough to win a seat. And so I think we ought to at least consider whether and again, Madam President, I want to emphasize there's no right or wrong way to do this. There really is.'",
        "'speaker_3': 'And I'm not going to it's not going to break my heart if we don't proceed with this. I just really think that the value at this point in Denver's history, the value of bringing representation closer to the people and creating smaller, more representational districts, it has less to do with the point that Councilman Cashman just made, the'",
        "'speaker_3': 'fact that we don't hear from 60,000 people. Certainly we don't have 60,000 unique contacts in the course of a year with our constituents. It has more to do with representing tighter, smaller communities of interest at the district level.'",
        "'speaker_3': 'And the question here is whether you value that or do you value continuing the At-Large positions, which give the people of Denver three representatives to to to rely on. I side with the choice of having the more representative districts.'",
        "'speaker_3': 'And the thing that pushes me over the edge is the. The low profile that the races get, the low voter turnout that they get, which makes me question how represented representative they are of the the citizens of Denver.'",
        "'speaker_3': 'So thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Flynn. Councilmember Quinn each.'",
        "'speaker_9': 'Thank you. Council President. I'm taking my Zen pill today. I appreciate all the speakers. Thank you. To the community who signed up to speak. I agree with those who suggest we should move past the process conversation. Everyone who's described the lack of input and community meetings is correct.'",
        "'speaker_9': 'And here we are debating the substance. So that's where I will focus. In taking my Zen pill. I'm trying to step back and imagine what this conversation sounds like to others. And I think that I respect that. It might not have been intended this way, but to imply this council is so special compared to other elected bodies'",
        "'speaker_9': 'perhaps needs a little reflection. The population of the state of Colorado has more than quintupled. Quintupled. The average constituency in a House district office district would have been 20,000 residents in 1950. It would have been up to 34,000 in 1971, the year we've decided to benchmark our conversation to today.'",
        "'speaker_9': 'Today it's 87,000. And you're right. Our jobs are very different than those of the House of Representatives. They, for example, have to have other jobs, and they're paid a whopping salary of $40,000 today, and they had to fight to double that.'",
        "'speaker_9': 'If I benchmark their salaries with these years, they might have been virtually nothing. So you're right. Our jobs are different. We're paid full time, year round. We have health care benefits and retirement. They have to have two jobs and they represent more constituents than us.'",
        "'speaker_9': 'And just as diverse of issues. Just as diverse issues. Let's look at our other boards, our TDI, single issue. Really perhaps less complicated job, perhaps transit dependency versus commuters. They're paid the whopping salary of $12,000. They have to have another full time job, not another part time job.'",
        "'speaker_9': 'They have to have a full time job to live. And so to suggest that our jobs are different is true, but perhaps not in the way intended. Let's move fast forward to our school board, also a single entity.'",
        "'speaker_9': 'We could say less complex, except it's children. It is our future that they're responsible for and they're paid a salary of zero. Again their districts, far more constituents, far more constituents than ours. Fewer districts, more constituents. Zero salary.'",
        "'speaker_9': 'And, by the way, zero staff. I don't point this out to shame anyone I pointed out to say at a certain point, I guess I invite us to reflect on our humility. It is a privilege to do these jobs.'",
        "'speaker_9': 'And yes, they are hard. But I see no other body. The US Congress. Right. The population of the United States has doubled and the US Congress, every district has gotten larger. I struggle with finding that we are the most special body in the United States of America.'",
        "'speaker_9': 'That as population grows, the only answer and the only just answer is to try to shrink the district size and to keep up with that no matter what size the body is, no matter what the best practice research is about.'",
        "'speaker_9': 'For example, when a body functions the best, there are certainly councils that have 50 members and they have smaller districts. I'm not sure they meet the test for the most functional governing body. I'm not sure of a level of collaboration.'",
        "'speaker_9': 'I don't know what it's like for a member of the community to lobby that body to make change and have to count 50 votes as a as a community member trying to make change. But all of these things.'",
        "'speaker_9': 'Right. I think the question of. The humility to say it's a privilege to do these jobs and they're hard and we're no more or less important than these other elected officials. And it's simply a point of reference. Right.'",
        "'speaker_9': 'So that's one argument we've had tonight is this idea that because of population change, we must we must have more districts. Right. So I've just addressed why I think that. I'm not sure that's true. But let's talk about some of the other arguments that have been brought forward.'",
        "'speaker_9': 'What do you do? So we had two kinds of arguments. In addition to this population, one, we had theoretical arguments, which is really tough. This is why the Zen is so important. So a theoretical argument about how at large council members are more likely to align with the administration?'",
        "'speaker_9': 'Well, the only way to dispute a theoretical argument is to get into real examples, which is awkward. Right. I voted against the mayor earlier this evening. My council colleague, Councilwoman Ortega, has voted against the mayor numerous times. I voted against the mayor before I voted against a very popular budget.'",
        "'speaker_9': 'You know, we could start to refute with individual facts. I can talk about Carol Borg and running the first, you know, probably the main budget amendment in a decade, giving a raise to city workers, you know, over the mayor's opposition.'",
        "'speaker_9': 'I can give the juggling cart fighting the gel. The only way I can fight theoretical arguments is with facts from real life. And then it sounds like we're in the personal and everyone wants to not be in the personal.'",
        "'speaker_9': 'This is not personal, except when you put a theoretical argument on a slide. Then we have to talk about whether it has proven true in reality, right? Whether the At-Large seats have in fact championed policies that have been counter right.'",
        "'speaker_9': 'To the interests of people of color. Right. Whether the large seats, for example, have.'",
        "'speaker_13': 'Proposed.'",
        "'speaker_9': 'Anti-Discrimination ordinances non-cooperation with ICE ordinances for, you know, for immigrant members of our community, whether they have been the first member from the LGBTQ community or the first Latina to be in this seat, we have to we have to get personal, because that's what you have to do.'",
        "'speaker_9': 'If you're faced with theoretical arguments, you have to say, are they true? Have they actually been true in reality? And perhaps there are those who feel that they have been. And that's their that's their prerogative. But we can't leave a slide deck with theoretical and then not dig into whether those things have been realities in the actual'",
        "'speaker_9': 'people who have served in the actual seats over the actual decades that we're talking about. And then we get into some actual numbers. So another set of arguments we heard tonight was about how not competitive the At-Large seats are.'",
        "'speaker_9': 'You know, that's a that's a fact. And so, you know, so it's interesting, the At-Large seats have not gone without challengers in several decades. There have been challengers in every single race. And yet there have not been challengers.'",
        "'speaker_9': 'I gave these facts last week. If anyone wants to review, I'll pull them out. But there have not been challengers in dozens of district council seats. So if competitiveness if competitiveness is the factor we're looking at, then we need to look at both kinds of seats.'",
        "'speaker_9': 'We could go on and on all kinds of numbers, right, about who's been in representative of every fact that was given about an at large seat. We could give a similar fact about a district seat, so it doesn't help us distinguish.'",
        "'speaker_9': 'So in the last At-Large race, you know, the two winners won by you know, we went in the 70,000 range and the 90,000 vote range. All right. If you divide that by 11, it averages about 6 to 8000 votes.'",
        "'speaker_9': 'Respectfully, respectfully, there are district council members up here who were elected with fewer votes or about the same. So if we're going to say, well, it's not enough votes, it doesn't count, then are we going to use the same math and the same evaluation stick for the district council seats?'",
        "'speaker_9': 'Are we going to say that those seats aren't appropriate? I get the majority argument, and if we wanted to have a debate about plurality seats versus majority seats, then that's the debate we should have. But I feel a little bit like it's a debate about spaghetti on the wall.'",
        "'speaker_9': 'Here's a good reason to get rid of the seat, and here's a good reason to get rid of the seat. And each one of them has the facts on the counter point. So what are we debating? Here's my sense of what we're debating.'",
        "'speaker_9': 'We're debating whether we think there is a difference. And whether we think that difference has a value. And I can see there are places where there's no difference. I study the bills the same way you do. I, you know, ask questions of agencies the same way you do.'",
        "'speaker_9': 'Maybe even a little tougher. Sometimes I respect them and love them. I'm sorry. Sometimes my questions are tough. So some ways our jobs are the same, but then there are ways they are different. And I'm going to I'm going to ask rhetorical questions.'",
        "'speaker_9': 'I didn't ask this during question and answer, but do you open an email and look at the bottom to see the address where the person is writing from? Have you counted up the number of constituents? So in a in a I from many times in this dais have heard council members say I got thousands of emails and'",
        "'speaker_9': '13 of them were from my district and they all agreed with the way I'm about to vote. I never, ever read the address at the bottom of an email, ever. I respond to them all the same. Sometimes I check with a district council member to see if they have already started a case.'",
        "'speaker_9': 'Whether they have an opinion on this, do they have more information than I have? Right. I check with them. I don't know whether my office has ever sent someone to district council office and said, good luck. Have fun.'",
        "'speaker_9': 'We check, we collaborate. Sometimes we hear back, sometimes we don't. But I respond the same. That's different. When I was asked to prioritize projects for the bonds. I mean, this is another rhetorical question. Who here prioritized a substance abuse treatment center?'",
        "'speaker_9': 'Who here prioritized a homeless shelter? Right. Who here prioritized something that wasn't a district asset? It's different. It's different. So we can acknowledge there may be some differences. And then the second question is, is there value? And I think that that is where you get into a personal judgment.'",
        "'speaker_9': 'Some people who testified today testified that they don't like the votes and the way that they've been served by their at large council members. Interestingly, some also testified that they didn't like or get served by their district council members.'",
        "'speaker_9': 'So, again, I'm not sure that you can sort through that and come up with an answer. So where we are, I think, is whether there is value in the structure. Is there value in the structure of having someone who doesn't check an address before they respond or, you know, account for the feedback?'",
        "'speaker_9': 'Is there a value to having multiple representatives to choose from? Is there a value to voters in getting a say over one fifth of this body instead of 1/13? If you think those things have value, then it's appropriate to continue this to to to continue these seats and not force us into an expensive, contentious election when we'",
        "'speaker_9': 'could be focused on other things. There are other things on this coming ballot that require attention. And by putting every idea that comes along on the ballot, you are asking the community to spend money, resources and energy on something that isn't a high priority, maybe in terms of housing people or fixing our transportation challenges.'",
        "'speaker_9': 'So so that's my, you know. Way of bringing together the debate I've heard over the last meetings. And that is why I asked my colleagues respectfully to honor the value of their voters in their constituents being able to choose and have these options, have this structure before them, and to vote no on this proposal tonight.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Council member Ken each council pro tem Torres. Thank you, Madam President.'",
        "'speaker_9': 'It's it's interesting. I've heard two arguments.'",
        "'speaker_7': 'Tonight for.'",
        "'speaker_0': 'The proposal. One needing more districts to serve Denver and the other. Do we need or want At-Large members? And I've heard. Statements referring to both things I struggle with this year. Census numbers a lot and fear that my district was one with a severe undercount.'",
        "'speaker_0': 'Projecting based on the American Community Survey, which was the map in the slide deck, says that my district should be closer to 63,000 residents. The actual census numbers that just came out put it closer to 56,000. I think a citizenship question proposal dampened numbers in my district.'",
        "'speaker_0': 'I think people didn't want to fill out their census in my district, which means I've got to add 10,000 more residents, and possibly that means two or three more full neighborhoods to District three. And that I really struggle with.'",
        "'speaker_0': 'I think the resource side is something that we've got to fix. It's not up for the voters to fix. We've got to fix our budget. We've got to fix the way that.'",
        "'speaker_7': 'We.'",
        "'speaker_0': 'Request and expand and allocate direct resources to us. I think this is much more about the argument of who are we representing and why. I struggle that the question feels flawed and we didn't have enough time to change it.'",
        "'speaker_0': 'So why didn't we choose 13 district in two at large? I'll be a guest tonight for publishing and. Will determine kind of final next week. Thank you. Thank you, Counselor Pro Tem Torrance. Next up, we have Councilmember Clark.'",
        "'speaker_1': 'Thank you, Madam President. I just wanted to give.'",
        "'speaker_2': 'A big thank you to Councilman Herndon, who I know was one of the first.'",
        "'speaker_1': 'People who talked to me about this and just, you know, as an idea.'",
        "'speaker_2': 'And throughout bouncing ideas. Big thank you to Councilman Flynn and Councilwoman CdeBaca.'",
        "'speaker_3': 'For their work in putting this together and getting.'",
        "'speaker_2': 'Us to this point. And thank you to the citizens. I mean, we heard from citizens who've been trying to raise this issue for many, many years.'",
        "'speaker_1': 'And are very passionate people.'",
        "'speaker_2': 'Passionate and people who I.'",
        "'speaker_1': 'Respect tonight speaking on both sides of the issue. So thanks to everybody for that. I think this proposal is a good idea. I think that, as others have articulated, now is the right time. And I'm sorry that this has turned into something that put people on the defensive and that people thought was personal, because for me, it'",
        "'speaker_1': 'absolutely was never that. I believe that our citizens.'",
        "'speaker_3': 'Are better served with smaller.'",
        "'speaker_1': 'Districts. Our citizens are better served if there are fewer.'",
        "'speaker_2': 'Of them trying to get the attention of their representative and fewer.'",
        "'speaker_1': 'Of them fighting for time with their representative. I think, as I said before in committee, I think that's one of the magical things about local municipal representation is its accessibility. And that's something worth.'",
        "'speaker_3': 'You know, fighting for and preserving.'",
        "'speaker_1': 'And I think that this proposal would.'",
        "'speaker_4': 'Would fix.'",
        "'speaker_1': 'The drift away from that that we're seeing. I think that it will be a real shame that given the timing of redistricting and both of these seats being empty, that voters wouldn't at least get to make this choice at the ballot box.'",
        "'speaker_1': 'Whether they agree with me in the end or not. I think they should be able to choose. I know that there have been some complaints about not having enough time for us needing.'",
        "'speaker_3': 'To understand what we're referring.'",
        "'speaker_1': 'And that's been debated on both sides. But the other thing that I'll just say is that this is not complicated. This is not something that voters will be confused about. This is a simple choice about how our citizens would like to be represented by the city council.'",
        "'speaker_3': 'There are pros and cons that we have heard.'",
        "'speaker_1': 'On each side. This is not a 100% on either side, but our citizens can navigate that and they should have a choice on how they want to be represented. I don't mind at all. In the end, if this is referred and it were to fail, if the.'",
        "'speaker_3': 'People of Denver were to.'",
        "'speaker_1': 'Disagree with me on that scale of how I've weighed and landed on those pros and cons. But I do think that it would be a real shame if we fail to allow them that choice or fail even here at publication to get it to second reading.'",
        "'speaker_1': 'So I will definitely be voting to allow to make them to make that choice, not just on publication but also on final. And it looks like it's going to be close, but I sincerely hope that we will refer this to the ballot and let the people choose about the representation.'",
        "'speaker_1': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Clark, Councilmember CdeBaca.'",
        "'speaker_7': 'Thank you. I just want to thank my colleagues who co-sponsored who supported us up for this conversation and everyone for their robust comments tonight. I think that the quality of the dialog that we've had is what indicates this is important for the voters to discuss.'",
        "'speaker_7': 'I want to address the comment that we heard during public comment that the racism piece of this wasn't an argument that was valid or that it was a myth. And I heard Councilman Flynn reiterate that it was not a myth.'",
        "'speaker_7': 'And, you know, anyone who knows history and what was happening in this country in 1968 or anyone who simply listened to our presentation, could see that the Voting Rights Act, the lawsuit against the City Council for Discrimination, and the sheer fact that in a city of our size and stature, we've only had two At-Large council members who'",
        "'speaker_7': 'are people of color. Councilwoman Ortega and Councilman Santos. That's indicative of, you know, the fact that there is racism and discrimination embedded in the current structure. Debate happens when the voters get a voice. There are very few instances in the work that we do when voters get a vote to make their debate meaningful.'",
        "'speaker_7': 'We often only allowed debate in the form of one hour courtesy, public comments, or maybe a community discussion where we're making the rounds to tell our communities about our proposals and their decision making power in those instances is nonexistent.'",
        "'speaker_7': 'We don't ask people to show up and base our decisions on their input as much as we say we do. It's obvious that most of the time the decision is already made by the time the debate occurs. I think that Councilwoman Kenney accurately pointed out that it is a privilege to do our jobs and many people do'",
        "'speaker_7': 'the job of legislation for free or without staff. That's a problem. That's a huge problem. That's a structure that yields a much more privileged representative who can afford to make. Laws for free or with limited efficacy because their family will still eat.'",
        "'speaker_7': 'Their family will still have a roof over their head and their campaigns will still get funded. That structure inherently is the problem that leads to not having adequate representation for marginalized people. This is personal. This is personal to every constituent who's not getting the level of service or access they deserve from their council members.'",
        "'speaker_7': 'It's personal for those constituents who are downgraded when time is limited and a powerful voter or business is competing for council members time. My favorite argument throughout this process came from a supporter who compared the value of this proposal to the value of smaller class sizes.'",
        "'speaker_7': 'We've said many times that smaller class sizes translate to more individualized attention from a teacher. In this case, the point is exactly the same. Smaller districts translate to more individualized attention and the ability to recenter the margins or what campaigns and candidates call low propensity voters.'",
        "'speaker_7': 'I love our dialog tonight, but again, the structure of our government should not be decided by 13 of us. We should be allowing the voters their doval voice in this conversation. All we are asking with this proposal is for the voters to have the opportunity to chime in whether they agree or not.'",
        "'speaker_7': 'None of us here are attached to an outcome. I would love to see my side of it, but I'm not attached to that outcome. I would love to see the voters have this discussion. The small amount of people who've chimed in thus far are not representative of Denver.'",
        "'speaker_7': 'We have a responsibility to always keep the people at the top of this government hierarchy and depriving them the opportunity to vote on this is demoting them in that hierarchy. Please. We did it earlier. We had this discussion with the bond proposal and their short runway, which was even shorter than our runway on this proposal.'",
        "'speaker_7': 'Please show the voters of Denver that you think they're intelligent and worthy of governing with those of us who they have given the opportunity to represent them. All we're asking is to send it to the voters. So give them a voice.'",
        "'speaker_7': 'Thank you. I hope you vote yes tonight.'",
        "'speaker_0': 'Thank you, Councilmember CdeBaca. And now go ahead and give my comments before we vote to publish this or not. You know what we're really talking about tonight? We've talked about at large, we've talked about the districts, we've talked about our budgets.'",
        "'speaker_0': 'And it has been a really great discussion. And we're talking about how we can, as elected officials in a very different environment, serve our constituents better, how we can be more intentional in how we're engaging them, what we can do to make sure that their voices are heard.'",
        "'speaker_0': 'And one of the things that has been very obvious to my constituents in District 11 are the lack of conversation that they've been able to engage in about this very, very short process. We've referenced back to the bond, but there were telephone town halls that were citywide that they used reverse robo calls to try to engage folks'",
        "'speaker_0': '. There were many, many different stakeholder meetings. And you can always say that there wasn't enough, but there was at least that. And I am the elect the elected representative of my council district. And I take that very serious because I want to hear from my constituents.'",
        "'speaker_0': 'I want them to understand what I'm voting on either for or against, and that they'd have an opportunity to weigh in and tell me what they think I should do. And that is something that hasn't happened through this process.'",
        "'speaker_0': 'I've got many, many constituents that are just asking why? Why are we doing this now? It's too rushed. We haven't had a chance to understand what the different options are. We've talked tonight about potentially going up and the number going down.'",
        "'speaker_0': 'That's something that I think our constituents should be able to really weigh in on and then we would debate it and then we would refer it to the rest of the voters is usually how the process works. And you know, with group living, we had went back to have that time and still it's on the ballot to'",
        "'speaker_0': 'possibly be repealed. And so there is no perfect dynamic in this. But what I know is that my constituents have not had the time to really vet this and they have asked me not to support this. And I'm going to do what I was elected to do and represent them, albeit I might feel differently about, you know'",
        "'speaker_0': ', having more elected representation on this body. That is a conversation that we need to really have and we need to vet what is that going to cost the taxpayers of the city and county of Denver by adding seats potentially or, you know, with the proposal now still be 13, but that's additional staff, etc..'",
        "'speaker_0': 'And lastly, you know, the budget issue and council offices maybe not having all of the resources that they need. I have to commend my colleagues who are serving on the budget working group and then alongside myself and central staff representation.'",
        "'speaker_0': 'We're working very hard to right size our council budgets and the city council budgeting process that is well documented. We've done a lot of that work. We've communicated to this body through our operations meeting meetings, and we're increasing the amount of money that is going to the district offices as well.'",
        "'speaker_0': 'And so with that being said, we just need more time to fully vet this and talk with our constituents on why we would be referring this to the ballot at this point in time. Council. Bill 20 1-908 is on the floor for publication.'",
        "'speaker_0': 'Madam Secretary, Roll Call on Council Bill 908, please.'",
        "'speaker_8': 'Cashman.'",
        "'speaker_2': 'Nay.'",
        "'speaker_8': 'Ortega. They? CdeBaca, I. Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_8': 'Herndon Hines. Can each.'",
        "'speaker_9': 'Name.'",
        "'speaker_8': 'Sandoval. Nay Sawyer.'",
        "'speaker_7': 'I.'",
        "'speaker_8': 'Torres. I. Black. Mary Clarke.'",
        "'speaker_1': 'I.'",
        "'speaker_8': 'Madam President May.'",
        "'speaker_0': 'Madam Secretary, closed the voting and announced the results.'",
        "'speaker_8': 'Seven days, six eyes.'",
        "'speaker_0': 'Seven nays Council Bill 20 1-200908 has failed our pre adjournment announcement. But before I go there, I'd like to thank the community members who spoke tonight as well, the folks who emailed us and most definitely the council members who sponsored this bill to move it forward.'"
    ]
}