{
    "Wastewater Enterprise Revenue Bonds Series 2016 for Storm Drainage Projects.": [
        "'speaker_3': '757 and 758 four 757. I have Espinosa, Flynn, Ortega and Nu make sure that's right. And four 758 I have Espinosa, Flynn and Ortega, so. Right. All right, great. And we will pull up 757 and find out what you all would like to do with this.'",
        "'speaker_3': 'Councilman Espinosa? I won't comment. What would you like to do with this on 757?'",
        "'speaker_8': 'Just comment.'",
        "'speaker_3': 'Okay. Can I just go down the list and ask Councilman Flynn, what would you like to do with it.'",
        "'speaker_0': 'Mr. President? Just a comment.'",
        "'speaker_3': 'Okay, great. Councilman Ortega, what would you like to have for a vote, please? Right. Councilman Espinosa, will you put put council bill 75 seven on the floor for adoption to be published? Sorry.'",
        "'speaker_8': 'Yeah. Thank you, Mr. President. I move that council bill 757. Be order published.'",
        "'speaker_3': 'It has been moved and second it. You okay, Madam Secretary? Okay. Great comments by members of Council. Councilman Espinosa.'",
        "'speaker_8': 'I actually didn't have a comment, but I did want to call it out for others to comment.'",
        "'speaker_3': 'That is very nice of you. Councilman Flynn, go ahead.'",
        "'speaker_0': 'Well, fortunately, I do have a comment. Thank you, Mr. President. I struggled with this one a lot because I was one of those members who voted against the fee increase that that goes to in part in great part to to pay for this this bond issuance.'",
        "'speaker_0': 'And one of my misgivings was the state of the engineering and the lack of of of solid cost estimates. But I was able, in just in the last day or so to meet with staff and satisfy myself that that the costs are based on good, hard unit cost estimating and a good scoping.'",
        "'speaker_0': 'I believe that because I lost that vote, because we increased the fee over mine and I think to other members votes. I think that my duty now is to make sure that the city's project is done properly and to oversee it properly, but not to obstruct it.'",
        "'speaker_0': 'So I plan to vote yes. Thank you.'",
        "'speaker_3': 'Great. Thank you. Councilman. Councilman. Let me do Councilman Ortega and then Councilman Neal.'",
        "'speaker_9': 'Thank you, Mr. President. I'm not going to be long winded because I've been very vocal on this particular project. This is the Plat to Park Hill Drainage Project that was tied to the I-70 project using part of the funding from I-70.'",
        "'speaker_9': 'I didn't support it then and I plan to vote no tonight. Thank you.'",
        "'speaker_3': 'And thank you so much, Councilman.'",
        "'speaker_10': 'New York. Mr. Ross, I had a question. Great. George Delaney. Yeah. Where is he now?'",
        "'speaker_3': 'Yeah, he just came in. Probably the. Yeah, George, come on up. And Leslie, you probably should follow and just get the whole team up here. You can you can start your questions as they're walking up. Continue.'",
        "'speaker_10': 'The consultant report was sent to us over the weekend, along with the resolution for tonight. And George, I think you and I talked this afternoon about the issue in the consulting room for saying that the bond issue really is going to fund the the storm drainage and that the senator sewer expense would really be funded by fees'",
        "'speaker_10': '. And but then in the resolution, it says that the bar is going to fund both the storm drainage and the sanitary sewer. And just a little confusing to me from what the consulting report said and the money that's needed for storm drainage versus what's needed for senator sewer lines.'",
        "'speaker_10': 'Maybe your chance to explain to.'",
        "'speaker_3': 'Sure. Please, George.'",
        "'speaker_0': 'Thank you, Mr. Chairman. I'm George Delaney, chief operating officer.'",
        "'speaker_11': 'For Denver Public Works. The consultant study, as you referred to, does clearly indicate and as we had told you at the time we did, our rate increases that sanitary are planned for the Sanitary Storm Capital Improvement Program Plan was to fully fund it with cash.'",
        "'speaker_11': 'Our the only borrowing was going to be for the storm projects specifically for the plant the Park Hill project. And what what I've been told is the reason that the proclamation says sanitary mentioned sanitary. And it is because for full disclosure, as we're doing the plan to Park Hill project, there may be some sanitary work that needs'",
        "'speaker_11': 'to be done, a line that might need to be moved, a line that might need to be repaired or replaced as part of that project. So there may be some bond money actually used for sanitary as in the context of that project.'",
        "'speaker_0': 'Not as a standalone. We're not borrowing money for sanitary sewer IP as it's as it's being proposed.'",
        "'speaker_11': 'But only as a an incidental portion of a plot to Part Park Hill project. So it's more of a full disclosure that potentially that could happen. It's not our plan to use any of the debt money, however, for the basic C sanitary capital program.'",
        "'speaker_10': 'So you really don't feel you feel there'll be sufficient money with the bond issue and the fees for sanitary sewer and there won't be a need to ask the taxpayers for additional rate increase versus fees.'",
        "'speaker_0': 'Right. Our our entire capital program.'",
        "'speaker_11': 'For sanitary will be on a cash funded basis with the fees that were approved effective July 1st. This would only be an incidental spending of some debt money if there was a need for it in the context of that project.'",
        "'speaker_10': 'Thank you, George. Thank you very much. Thank you, Mr. Burns.'",
        "'speaker_3': 'Yeah, thank you, Councilman. No, thank you, George. Filling. You're going to have to stay up here, Councilman Espinosa.'",
        "'speaker_8': 'Yeah, no, I just wanted to clarify why I my bizarre comment, we are in a software change and so normally I'm able to sort of real time see that we have respondents and since we had to do this well in advance of the meeting, I wanted to make sure that this bill was called out because I felt'",
        "'speaker_8': 'that there were might be others. So sorry about that, I think.'",
        "'speaker_3': 'Thank you for the explanation, Councilman Cashman.'",
        "'speaker_11': 'Thank you, Mr. President. I'll just echo Councilwoman Ortega. I voted against the fee increase because of my perception of the connection of the Platt Park Hill Project with the I-70 project and my dissatisfaction with what I believe is the shortfall of the Colorado Department of Transportation's efforts to mitigate the impact of their proposed development on nearby homeowners'",
        "'speaker_11': '. So I will vote against this tonight and will continue to do so. Thank you.'",
        "'speaker_3': 'All right, Councilman. Thank you. Looks like we don't have anyone else in the queue to speak. Madam Secretary.'",
        "'speaker_5': 'Raquel Ortega.'",
        "'speaker_9': 'No.'",
        "'speaker_5': 'SUSSMAN My black eye. CROOKS I'm sorry, Clark. Espinosa No. Flynn Hi. Gilmore. I. Herndon, I. Cashman. Carnage. Lopez. I knew, Mr. President.'",
        "'speaker_3': 'I was voting in the results. It's yours.'",
        "'speaker_5': 'Nine eyes. Three knees. We're missing a missing one.'",
        "'speaker_3': 'Councilman Ortega, did you vote?'",
        "'speaker_6': 'I did.'",
        "'speaker_3': 'Okay, we are missing one person. I believe we have 13 council members on my county council.'",
        "'speaker_5': 'Councilwoman Black.'",
        "'speaker_3': 'Councilwoman Black. Okay.'",
        "'speaker_5': 'How was the vote? So an irony. I'm sorry.'"
    ],
    "Property Acquisition for Platte to Park Hill Stormwater Systems Project.": [
        "'speaker_3': 'Your councilwoman was I? So that's tonight's three nays. Yeah. Council about 757 passes. Okay. Please pull up. 758. Okay. Councilman Espinosa, what would you like to do with this?'",
        "'speaker_8': 'This one? I'd like to call for voting.'",
        "'speaker_3': 'Okay. Please, Councilman, put this bill on the floor to be published.'",
        "'speaker_8': 'Thank you, Mr. President. I move that council bill 758 be published.'",
        "'speaker_3': 'All right. It's been moved and seconded. Councilwoman Espinosa.'",
        "'speaker_8': 'Simply similar to the previous comments that this is the acquisition of land for these this 39th Avenue channel that. And so my comments sort of are familiar, I mean, along the lines of what Councilman Cashman just mentioned. So I will be voting no on this bill as well.'",
        "'speaker_3': 'Okay, great. Not great that your vote. No, but thank you, Councilman Flynn.'",
        "'speaker_0': 'This was for president. The same remarks as before. I think that having voted no on a fee and having a lot of questions about whether this project should proceed, but after having met with staff, I see it as my duty now to see that the project is done correctly and not to obstruct it.'",
        "'speaker_0': 'So I'll vote yes. Thank you.'",
        "'speaker_3': 'Great. Thank you. Count. Councilwoman Ortega.'",
        "'speaker_9': 'My comments that I shared earlier apply to this one as well.'",
        "'speaker_3': 'Thank you, Councilwoman Ortega. Okay. Madam Secretary. Raquel.'",
        "'speaker_5': 'Espinosa. No. Flynn. I. Gilmore. I. Herndon. I. Cashman. Carnage. Lopez. High knew. Ortega. No. Sussman. High. Black, high. Class high. Mr. President.'",
        "'speaker_3': 'High. Close. Voting in US results.'",
        "'speaker_5': 'Ten eyes, three days.'",
        "'speaker_3': 'Okay. Got to right that time tonight. Three A's Council Bill 758 passes. We are now. There are no other bills. Call it out. We are now ready for the BOP block votes. All of the bills for introductions are now ordered published.'",
        "'speaker_3': 'I also want to remind, as folks are leaving, that we don't want anyone standing because it's a fire hazard. There are plenty of seats up in the front and I do believe we have overflow tonight. So I just wanted to let that be known.'",
        "'speaker_3': 'Councilman Espinosa, are you ready for the black votes?'",
        "'speaker_8': 'We'll see. I don't know about this new system.'",
        "'speaker_3': 'Okay. Councilman, please put the move that you think the resolutions and bills for deduction be adopted. With them both.'",
        "'speaker_2': 'Together. So.'",
        "'speaker_8': 'Kelly. I don't think the screen changed.'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Did your screen.'",
        "'speaker_8': 'I mean it.'",
        "'speaker_3': 'And Councilman because 757 758 have already passed. You don't need to mention them.'",
        "'speaker_8': 'Let me grab my actual agenda, not the electronic version. So just resolutions or bills for introduction or both?'",
        "'speaker_3': 'All of them. Okay.'",
        "'speaker_8': 'So thank you, Mr. President. I believe that resolutions be adopted and bills for final consideration be placed on final consideration and do pass and block for the following items. 60 are Council Bill 16 059408250622. 0755. And that's it.'",
        "'speaker_9': 'Point of order.'",
        "'speaker_2': 'Yes.'",
        "'speaker_9': 'That's for adoption, correct? That's for final.'",
        "'speaker_3': 'No, he's supposed to read all of them. And so.'",
        "'speaker_9': 'But he placed them on final. But they're for adoption.'",
        "'speaker_11': 'Yes, correct.'",
        "'speaker_5': 'It's it's both the bills on final and.'",
        "'speaker_3': 'Yeah. Madam Secretary, can you go to his screen and it's because the screen does if he scrolls down, he could. Oh, there we go now.'",
        "'speaker_8': 'Didn't I just rattle those up? Okay. Let's try that again. But I still have that. Thank you, Mr. President. I move that, resolutions be adopted and bills on final consideration, placed on final consideration, and do pass in a block for the following items.'",
        "'speaker_8': '594, eight, 25 and 755.'",
        "'speaker_3': 'Yes, I keep, keep, keep going.'",
        "'speaker_5': 'No, that's okay. Just those three.'",
        "'speaker_3': 'Yeah, but I thought we're doing resolutions and bills for introductions.'",
        "'speaker_5': 'He did not. Introduction final.'",
        "'speaker_3': 'Okay, we got it all. Go ahead. Madam Secretary.'",
        "'speaker_5': 'Black Gold.'",
        "'speaker_6': 'I.'",
        "'speaker_5': 'Clark II. Espinosa, I.'",
        "'speaker_0': 'Flynn, I think i. Herndon, I.'",
        "'speaker_5': 'Cashin Can each. Lopez All right. You. Ortega I. SUSMAN Mr. President, I would. 30 Nice.'",
        "'speaker_3': '13 Eyes The bills on resolution and bills for introduction have passed. Is that correct?'",
        "'speaker_5': 'Bills on final have passed and resolutions were adopted.'",
        "'speaker_3': 'Okay, we've got a new system. Everyone will get it. We'll get it. Okay, great. Madam Secretary, are there any other bills that are are hanging fire? Okay, good. Tonight there will be a combined one hour courtesy public hearing on Council Bill 625 626 regarding affordable housing programs and a one hour courtesy public hearing on Council Bill 760'"
    ],
    "Ordinance on Housing Fund, Linkage Fee, and Property Tax for Affordable Housing Programs.": [
        "'speaker_3': 'Nine eyes, four nays. Counsel 25 as amended passes now councilmembers we are putting Councilman Espinosa, please put Council Bill 626, as amended, to be placed upon finer consideration and do pass. Mr. President.'",
        "'speaker_8': 'Thank you, Mr. President. I move the Council Bill 6 to 6, be as amended, be placed on final consideration and do passed.'",
        "'speaker_3': 'It has been moved in second to it. Members of council. I'm going to let Councilman Herndon go in, but please don't feel the need to you know, I think you spoke on both wheels. But Councilman Herndon.'",
        "'speaker_0': 'This president to weigh this conversation even further would seem disrespectful to those waiting for the next courtesy one hour public hearing. So I forego.'",
        "'speaker_3': 'Councilman Herndon, thank you. Um, it's been first and second. Any other comments? Madam Secretary, roll call.'",
        "'speaker_0': 'Herndon, I.'",
        "'speaker_5': 'Cashman they can each name. Lopez. They knew Ortega. Sussman Merry Black.'",
        "'speaker_6': 'I.'",
        "'speaker_5': 'Clark.'",
        "'speaker_3': 'Clark stepped out.'",
        "'speaker_5': 'I stepped out. ESPINOSA Hi, Flynn. Gilmore. No, Mr. President.'",
        "'speaker_3': 'No. Please close vote in the results.'",
        "'speaker_5': 'Sorry. One moment. Four Eyes, eight nails.'"
    ],
    "Plan Amendment for 38th & Blake Station Area Height Amendments.": [
        "'speaker_3': 'Four eyes, eight knees. Council Bill 626, as amended, has failed. Councilman Espinosa, please put Council Bill 760 on the floor.'",
        "'speaker_8': 'Thank you, Mr. President. I move that council bill 76 to be placed upon final consideration and do pass.'",
        "'speaker_3': 'It's. I see. I need a second. Great. Thank you, Councilwoman Sussman. It has moved and moved in second at the public here of Council Bill 760 is open. May we have the staff report process?'",
        "'speaker_13': 'Good evening, council members. Thanks for hanging in there. Thanks, everyone, for hanging in there. And congratulations on just 1/2.'",
        "'speaker_3': 'Hey, as you're exiting, could you please could you please lower your voice just so we can get going on this council? Bill. Thank you.'",
        "'speaker_13': 'So again, congratulations. And I am a barge with the Department of Community Planning and Development here to bring the 38th and Blake Station area height amendments to you for final consideration. These are amendments to five plans that overlap in the 38th and Blake Station area.'",
        "'speaker_13': 'It's a bit unusual to specifically amend plans in this way. There there is a reason we know, of course, and just previously discussed the level of change going on throughout the city of Denver. But this area, of course, is just right at the vanguard of that change.'",
        "'speaker_13': 'It's changing so rapidly and there's so much development opportunity. And and there also is a lot of public investment that has already gone into this area and that will go into this area. And that presents an opportunity more technically.'",
        "'speaker_13': 'These five overlapping plans have obscured the vision, I would say, for heights in this, the most critical area right around the station. And and we seek to improve and clarify that. And then throughout the process of looking at the height amendments, some things came up that we'll also discuss in terms of the need for new tools to'",
        "'speaker_13': 'promote higher design quality in the area. And you're you haven't escaped yet. Affordable housing is also part of this discussion. So I mentioned the public improvements here. You're all aware of the Brighton Boulevard streetscape improvements that are are just starting really significant improvements there.'",
        "'speaker_13': 'The Planned River, North Park, the new commuter rail station at 38th. And Blake, together, they represent essentially hundreds of millions of dollars worth of public improvements in the area where this plant amendment will occur. And I think that that relates to a concept that I want to discuss a little bit regarding value capture.'",
        "'speaker_13': 'And that is the idea that with all of this investment, that the community that the public is putting into this area, along with the idea that actually it might be more appropriate for there to be even more intense level of private development near the station than was anticipated in the previous plans.'",
        "'speaker_13': 'But that provides an opportunity to capture some of the value that all of this creates for the community, specifically in the form of higher quality design and the integration of affordable housing into the station area. And that's what we heard really specifically from the community throughout this process, that high density tower development.'",
        "'speaker_13': 'Yes, it's appropriate. It's it has to provide benefits. This sets a little bit of a of a new precedent, this idea for specifically capturing value in an area like this. But I think it's something and I and I know Brad Buchannan, the director of Community Planning and development, feels this way, too, that this is an important precedent'",
        "'speaker_13': 'to set and this is an important or a very appropriate place to do it. The 38th and Blake area to look at how all of this investment, all of this development potential can really specifically produce benefits for the community beyond just the development itself.'",
        "'speaker_13': 'So and then just looking at that, the technical reasons for amending the plan, those five overlapping plans start with the 2003 River North Area Plan. There was a stationary plan in 2009, the Northeast Downtown Neighborhoods Plan in 2011, and then the 2014 Globeville plan and most recently the 2015 Elyria and Swansea.'",
        "'speaker_13': 'A neighborhood plan all make recommendations that overlap at least some part of the area that we're talking about tonight. A lot of them agree, or at least are clear, that the newer plan sets precedent over the older plan.'",
        "'speaker_13': 'But you have to look at all of these different plans to figure out what's going on. And it tells a story that's that's a little hard to read. Also the most recent plan earlier in Swansea, a neighborhood plan, you know, in some cases it says things like taller building heights may be appropriate in certain locations or that'",
        "'speaker_13': 'provide community benefits but doesn't say what those locations are or what the benefits are. We're we're fixing that with these plan amendments. So before I I'll run through the the four major recommendations of the plan. The process began early this year.'",
        "'speaker_13': 'Tim Watkins, with Community Planning and Development, was the project manager throughout most of the process. As many of you know by now, he's moved on to a job in Utah, which is where he's lived for years. So that's the whole it was a long time coming.'",
        "'speaker_13': 'And so Tim is no longer with the department, but he he really ran a very inclusive public process for this amendment effort that included four major public workshops. Thanks to the folks at XDA for hosting those we had, you know, I think more than a couple hundred people at that, at least one of them.'",
        "'speaker_13': 'So they were very well attended. This hearing tonight, the final adoption hearing concludes the the adoption process. But we actually are ready to move into implementation right away. Essentially, this is these are very targeted amendments. And we're looking at doing the implementation for the higher building design quality that I'll talk more about and the integration of affordable'",
        "'speaker_13': 'housing, essentially starting tomorrow, if you give us the green light. So the the recommendation of the plan amendments, the first and kind of most overarching recommendation is to promote taller building heights that some that support transit oriented development or TOD in the station area.'",
        "'speaker_13': 'And that means what we heard as part of the the community process develop these amendments that taller heights are appropriate particularly near the station platform than were recommended in the previously adopted plan. So just to be clear, the this these amendments do recommend taller heights.'",
        "'speaker_13': 'But those taller heights would have to come with transitions to surrounding neighborhoods. Cole and Curtis Park have the most exposure, but also Globeville and Elyria. Swansea, and that those taller heights have to come along with the provision of community benefits.'",
        "'speaker_13': 'So this is an important map in the plan amendments. It's on page seven of the of the plan amendments in your packets. It's a little bit more complex than the typical heat map in a plan because it's showing two different things.'",
        "'speaker_13': 'The colors, the red, for instance, that's around the station area marked by a T there shows the maximum incentive height, showing that as 16 stories near the station platform. But we're also showing those those white numbers and the white lines are showing what the maximum base heights are.'",
        "'speaker_13': 'And what that is, is are the heights that are recommended by all those overlapping, existing adopted plans. Typically, when we had a new plan, we'd be setting those aside and moving on. In this case, there's there's a couple of specific reasons to keep those heights on the book and on the books.'",
        "'speaker_13': 'We're calling them Base Heights. Number one is just to clarify where we're starting from when we say that the development that takes advantage of the heights that are enabled by this plan amendments provides community benefits. So it's the development clearly that's above those heights that are in white.'",
        "'speaker_13': 'Number two is more technically that we're we're able to clarify the status of map amendments that will be coming through the system. So at least two MAP amendments in this area will come to you before we're able to create the tools that would require the higher design quality and the integrated affordable housing.'",
        "'speaker_13': 'But what we're saying is that. Map amendments that seek only the heights that were recommended in the previous plans that don't seek to take advantage of these new, taller heights can be appropriate in the interim. But the plan amendments are very direct in saying that map amendments that seek the taller building heights, for example, 16 storeys at'",
        "'speaker_13': 'the platform would not be appropriate until the tools have actually been developed to compel the community benefits to to require integrated, affordable housing and higher design quality. So that first recommendation to promote Taller Building Heights comes along with the need to promote height transitions.'",
        "'speaker_13': 'Here we're looking from a point in the whole neighborhood. If you look at this viewpoint right now, you wouldn't see much down there at the end of the street if that area around the platform were built out. According to the currently adopted plans, it might look something like this off in the distance.'",
        "'speaker_13': 'The plan amendments would allow for taller building heights over there. So you might see something like this, but those taller building heights would come along with the specific community benefits. Recommendation number two really just gets more specific about the need to adopt a regulatory approach to ensure greater design quality throughout the station area.'",
        "'speaker_13': 'Talks about what greater design quality means a little bit more specifically or what it would seek to achieve in terms of active and walkable public realm, minimizing parking visibility and how and how we intend to more specifically accomplish that or regulate the higher design quality.'",
        "'speaker_13': 'So just visually looking at what higher design quality might mean, it might mean that there's mass reduction in buildings, that these bigger buildings have to be broken down into smaller parts or can't just be big boxes, that there's greater activation at the pedestrian level, like taller ground floor heights or more specific requirements about ground floor uses.'",
        "'speaker_13': 'These images on the upper right, you'll see screened parking is one of the things that is in the category of higher design quality specific requirements about the design of any structured parking that's visible from the street. And then I mentioned mass reduction kind of on the left center slide there, meaning that, yes, the plan amendments are saying'",
        "'speaker_13': 'that taller buildings are appropriate, but that doesn't just mean a 16 storey box say that there's going to be a tool applied to compel something to be happening with that box, whether it's upper story setbacks or or other mechanisms that break down the mass and scale of the building.'",
        "'speaker_13': 'Recommendation number three is to establish the river corridor as an amenity and a resource. This was something that most people that we talked to in the planning process really felt strongly about, that we needed to be very clear on how the river should be treated.'",
        "'speaker_13': 'And what that means specifically is that it should be treated as if it were a primary street in terms of what level of transparency would be required, and that all of these tools that will require higher design quality should should be applied to the frontages facing the river as well.'",
        "'speaker_13': 'The final recommendation regards the integration of affordable housing into the station area. And talks about the increased heights as an incentive for affordable housing built within walking distance of the station. And that this needs to be coordinated with citywide, affordable housing programs.'",
        "'speaker_13': 'We now have a new citywide affordable housing program. As of moments ago, the intent is that we develop a tool subsequent to the adoption of these plan amendments that works with the new citywide regulations to promote affordable housing that's actually provided specifically within this area.'",
        "'speaker_13': 'And will will go through a separate process to actually develop those tools. So there's still some unknowns with it. But the basic objectives are it it promotes housing that's there by the station and that it works with this system that you just adopted.'",
        "'speaker_13': 'So we're not using different metrics. We're requiring the same kind of housing. The final part of the plan, amendments on beginning on the last page, just get a little bit more specific about the next steps. The really important one being this are regulatory and policy strategies saying that, yes, you know, we are directed with adoption of these'",
        "'speaker_13': 'plan amendments to move forward with tools such as a design overlay district to implement regulations or recommendations for greater design quality and for integration of affordable and mixed income housing near the station area. And I'll just mention, and I think a couple of members of our steering committee may speak about this when I'm finished as well.'",
        "'speaker_13': 'But the River North R.A. has been working for some time on a request for a design overlay district for River North that really addresses many of the ideas that came out as part of the 30th and Blake Station area process.'",
        "'speaker_13': 'And what we're looking at doing is taking that design overlay request and using that as the foundation for for what greater design quality means at 30th and Blake and then throughout the rest of of river north as well.'",
        "'speaker_13': 'The moving forward recommendations also just emphasize that some of the more general recommendations in those previous plans really need to be emphasized specifically in terms of public investment strategies and the need to continue partnerships. Those are more broad recommendations that we continue to work on those things as opposed to the really that specific first recommendation that we'",
        "'speaker_13': 'move forward right away with the implementation of the regulatory tools. And just to know the way that will accomplish or that we plan to accomplish the plan amendments is to have them as a standalone document, as you saw in your package.'",
        "'speaker_13': 'But then to on the covers of all of the affected plans to note that that part of the plan has been amendment amended and that you should review the other the newly adopted document. So I'll just go there's a lot more detail about this in your staff report, so I won't spend much time here, but just running'",
        "'speaker_13': 'through the criteria for adoption of a plan or plan amendments in this case, the first being plan consistency and staff finds that the proposed plan amendments are consistent with the Denver Comprehensive Plan and the relevant plan amendments that are listed on this slide, which include the five plans that will be updated.'",
        "'speaker_13': 'That an inclusive public process was used to create the plan amendments. As I mentioned previously, there were four big public workshops as part of the process. This was all assisted by a great steering committee, which included representatives of all of the affected RINO's.'",
        "'speaker_13': 'They met very regularly throughout the process. Tim Watkins actually went to a lot of neighborhood meetings and gave presentations and answered questions throughout the process. And we had the usual electronic outreach, including a website. The final criteria is that the plan or plan amendments take a long term view, and we find that the 30th and Blake stationary'",
        "'speaker_13': 'amendments establish a vision framework that will guide change in the neighborhood for the next 20 years and that that's an appropriate long term perspective. So our staff recommendation, based on the findings of the plan amendment, is consistent with the Denver comprehensive plan and applicable supplements.'",
        "'speaker_13': 'Then an inclusive public process was utilized and that the plan includes a long term view is that City Council adopt the plan amendments as a supplement to the Denver Comprehensive Plan. Thank you.'",
        "'speaker_3': 'Thank you. Well done, Abe filling in for our friend. We're going to call up our eight speakers tonight. That's okay. And I'm sure there will be plenty of questions. Maybe not at this hour, but so stand by, Joe Noble.'",
        "'speaker_3': 'First up, Cindy. Cindy Candy CdeBaca. Do not see her. Mike Duggan. Do not see him. Jamie Lynn Co. Jamie's back there and then bring up. Oh, no, no. Miguel is not here. John, he. Come on up. You each have 3 minutes.'",
        "'speaker_3': 'Go ahead, John.'",
        "'speaker_10': 'Good evening, counsel. My name is Joel Noble. I serve on the board of directors of Curtis Park Neighbors. The position for Curtis Park neighbors will be given later by John Hayden. Curtis Park Neighbors President. I served on the steering committee for this effort representing Curtis Park neighbors and wanted to give a few reflections on the process.'",
        "'speaker_10': 'The first is this is very rare that we amend plans enter neighborhood cooperation a couple of years ago adopted a zoning and planning position statement. That platform that among many other things said it should be possible to amend plans.'",
        "'speaker_10': 'Plans take a long term perspective and last 20 years. But sometimes things change in the public's view for what should happen. And it's going to take a long time if the public's view has shifted to see that reflected in a new plan.'",
        "'speaker_10': 'Well, how do we know that the public's view has shifted? It's not a problem that we have many different plans overlapping in this area. The issue is that the plans show an evolution in thinking. So if you were to go back in the slide deck, you would see that the very latest plans, the clearest wants a plan'",
        "'speaker_10': 'that comes down to 38th Street envisions up to 12 stories on that side of the street, whereas the plan right across 38th Street and again, this is an a mixed use area. I envision much lower heights, only five stories maximum.'",
        "'speaker_10': 'And you have to look at the at the total result of all these overlapping plans and say this was not thought through because they were done piecemeal and they were done piecemeal with disjoint map segments. And that points to the vision of the community evolving over time, but not being fully captured.'",
        "'speaker_10': 'And so we were able to take the public's call for the ability to have a plan, amendments with a clear, crying out for map amendments and do that here. The process was wonderful. I think they captured it at a high level.'",
        "'speaker_10': 'But because plan amendments are rare, we have visitors from other neighborhoods not in the area coming to see what was going on. Is, is someone getting away with something here? Is the public really being represented? And I think when they saw that lots of community members, residential neighbors were represented as well as the business owners and property'",
        "'speaker_10': 'owners, they were satisfied that this process was proceeding as it should and we stopped seeing them at the meetings. But it was good that we watched their processes are working right. I don't have a lot of time left, so I just wanted to finally touch on the visualizations, the the SketchUp visualizations that you saw.'",
        "'speaker_10': 'If you look this direction, if things were built to the maximum the current plans had, here's what your view would be. And in this new plan, here's what it would be were crucial to assuring neighborhoods. What are you buying into?'",
        "'speaker_10': 'What does it look like in the distance? Especially the whole neighborhood, which is the closest residential neighborhood to the platform? You'll see in your packet letters of support from all the residential neighborhoods nearby. And I hope you lend us your support.'",
        "'speaker_3': 'Thank you, Mr. Noble. Excuse me. Did you see Kennedy, see tobacco or no. Okay. Okay. We'll go straight to Jamie. Let's go.'",
        "'speaker_6': 'Good evening, counsel. Thanks for the opportunity to comment. My name is Jamie Lygo. I serve as the executive director for the Rhino Art District, the Rhino Business Improvement District, the Rhino General Improvement District. I'll keep my comments brief tonight, but I just want to say, first of all, thanks to Councilman Brooks, thanks to CPD, who did a'",
        "'speaker_6': 'tremendous job, thanks to all the neighborhood participants that were involved in this process. It was an incredibly strong show of kind of community input and support for what we went through. You all know by now that Rhino is a place that likes to do things completely differently.'",
        "'speaker_6': 'They like to challenge convention, and I love that. It's a neighborhood that set the standard for trying to challenge the conversation and push. We are at the epicenter of urban growth in the neighborhood and we are a developing neighborhood.'",
        "'speaker_6': 'So we have the opportunity to do that. So I just want to say a couple of things about this that I saw from the process that the neighborhood really supports, just so you know. First of all, obviously, the affordable housing component is really important, but also the opportunity to use density, the density conversation as a way to'",
        "'speaker_6': 'push a conversation about what our neighborhoods should look like for people, for bicyclists from the public realm perspective, and how we can encourage transit oriented development in a way that also supports building neighborhoods that will stand the test of time as they develop out.'",
        "'speaker_6': 'And I believe this process has really addressed that in a really beautiful way. And the outcome we've gotten to is supported and celebrated by the neighborhood. And you can't ask for much more than that. So thank you very much.'",
        "'speaker_3': 'Thank you. Okay. Let's see who's here. John Hayden? Yes.'",
        "'speaker_8': 'Good evening. Members of Council. I am here as the president of Curtis Park Neighbors and I wanted to let you know that our board voted in favor of this amendment. In addition, we had a presentation at our general meeting done by CPD that was remarkable in that at the end of the meeting, almost all 50 people in'",
        "'speaker_8': 'the in the neighbor that came to the meeting were like, Yeah, let's do it. So I was pretty excited that we have something that, that our community is fully behind here and we are coming to you saying, yes, please bring density here, bring affordable housing to our community.'",
        "'speaker_8': 'We want to see that happen. And so we support this.'",
        "'speaker_3': 'Thanks. Thank you. Can you say that again? I'm just joking. Let me get Andy Feinstein and Justin Grove.'",
        "'speaker_14': 'Good evening, counsel, and thank you for giving us the opportunity to speak this evening. I just want to augment a lot of the comments. Everybody else said, you know, we just we just witnessed a very robust debate and discussion on affordable housing.'",
        "'speaker_14': 'And as Jamie took one step back, sorry, I am the cochairman of the right now our district. I'm a resident business owner and property owner in the district. And I've been there for over seven years. So very invested in neighborhood.'",
        "'speaker_14': 'We just witnessed a terrific conversation on affordable housing. And as Jamie mentioned, we in Reno really pride ourselves on doing things different. And we believe that this opportunity to, you know, move on from the intent of all these plans going back to 2003, which was to have as much density as possible around the station.'",
        "'speaker_14': 'Unfortunately, when these plans were created in 2003, 2009, 2011, as Abe showed you, even then, the intent was to maximize density on the station. When they were created, no one foresaw 3000 people a month moving to Denver, the 4500 people a month moving to the metro area.'",
        "'speaker_14': 'So we believe and I know that to combat these challenges that we have, like affordability, like ground floor activation, we got to build up and we want to do this. You know, we want to do this at our station.'",
        "'speaker_14': 'And we've worked very collaboratively, very robustly with the public conversation to to get to this point. And thanks to Councilman Brooks, his leadership speed has been unbelievable. And our steering committee, I think we're there. So we welcome your support.'",
        "'speaker_14': 'We're excited about this opportunity. And hopefully Reinoehl can serve as a template for the whole city of how to incentivize affordability for other people to move down that path as well. So thank you.'",
        "'speaker_3': 'Thank you, Mr. Feinstein. Justin Kroft Last but not least.'",
        "'speaker_13': 'Thank you, President Brooks. I want to also echoed the sentiment that this was a pretty amazing process with multiple neighborhoods involved and I think great leadership from city staff, from Councilman Brooks and from the steering committee. My name is Justin Croft.'",
        "'speaker_13': 'I'm a resident of coal. I work in Reno and I was on the steering committee. I am the chairman of the Reno bid. I think what's so interesting about this process is this very easily could have been more of a technical exercise to align planning documents.'",
        "'speaker_13': 'It also could have accidentally been a way to just entitle a bunch of ground without anything tied to it. Instead, the community really prioritized this idea that we want to get the best parts of density and not the worst parts of density.'",
        "'speaker_13': 'And that takes a little bit of thinking around the policy that would be attached to adding extra density around the station. Some of the ideas that we talked about with getting the best parts of density were making sure that the district is walkable, that the population that is moving in is really supporting local goods and services.'",
        "'speaker_13': 'The idea is that they're buying art. They're buying beer from our breweries. They're supporting retail. They're supporting office. They're supporting services in the district, increase civic engagement, diversity of incomes and cultural exchange really happening on the street. These are markers of a vital urban neighborhood.'",
        "'speaker_13': 'Some things that can happen if you don't plan correctly, are more of a drive in, drive out situation. Vertical suburbanization, I like to call it. So the idea that you have these buildings around the transit center that people really are treating similarly to if they lived in a multifamily building or even a single family building out in'",
        "'speaker_13': 'the suburbs, I'm not getting some of those benefits there by clogging streets. People are driving to every single kind of goods service job that they need. What is the benefit of really having that kind of density around a transit station in the first place?'",
        "'speaker_13': 'And if we're ending up with a more homogeneous population and not a more diverse population, it seems like we've failed in that regard to the ideas that since we always talk about building more density around transit to take advantage of it, if instead we're adding more cars to the street, we've probably failed in that.'",
        "'speaker_13': 'We talk about really wanting to increase affordability around transit citywide, and if in fact we're creating a more homogeneous situation, we've probably failed at that. So the idea behind this plan is really tying it to these two factors design with the idea being that you activate the street, you create commercial spaces on the ground floor that thereby'",
        "'speaker_13': 'reduce the need for everyone to have to drive to every good and service job that they need to attend. And then also requiring affordability, but making it a density bonus in effect, so that as a developer it's working better for you, or at least as well economically, while providing a great situation for some of the lower income'",
        "'speaker_13': 'folks that are at such a critical piece to a diverse neighborhood. So in closing, I just want to say thank you for the time, and I ask that you please support this.'",
        "'speaker_3': 'Thank you, Mr. Kraft. All right. This concludes our speakers questions by members of council. It comes from an article.'",
        "'speaker_9': 'So I am thinking, Mr. President, I'm. Trying to understand the direct interface with the other stationary of plans. So such as, you know, 41st and Fox. I mean, they're they're on the maps in these documents. And it's not clear if this particular bill tonight is having the effect of ultimately increasing the density in those areas without those'",
        "'speaker_9': 'having to come back here. Yeah. Can somebody just.'",
        "'speaker_3': 'Councilwoman? I can do that. And even if I miss a beat, let me know. So these are just the neighborhood plans. This is the 30th in Blake's stationary plan. This is northeast downtown area plans, this Globeville or Swansea neighborhood plans.'",
        "'speaker_3': 'And we're amending those. So this has nothing to do with 41st and Fox and.'",
        "'speaker_9': 'Colorado and 40. So we're amending the neighborhood plans that address the issue of density as it. Affects the proximity to transit because that's primarily where we're going to be seeing the increase in density, right?'",
        "'speaker_3': 'Yeah. But I just I just wanted to be clear that we weren't amending the other station area plans, as you stated in your first question. And and I don't know if you heard Abe at the beginning, a lot of these oh, it was Jill Noble.'",
        "'speaker_3': 'A lot of these plans were conflicting with one another because they were started a very different times in the earlier global or Swansea. A plan in particular had, as Joel was saying, 12 on on one side of the street in a different.'",
        "'speaker_3': 'So what we were trying to do is say how can we bring some congruency to all of these plans together and in the process raise the question, are we at the right heights around this station area? Have we taking full advantage of this infrastructure?'",
        "'speaker_9': 'So let me just clarify that with an additional question. So it's because those neighborhood plans all in some way touch on the 38th and Blake that we're having to amend and update those neighborhood plans.'",
        "'speaker_3': 'Yes.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_3': 'Councilwoman Black.'",
        "'speaker_7': 'Thank you. Quick question, Abe. It's just about the design guidelines. Is is that something that is required? Only to get the extra height or is it required for all the zoning in that?'",
        "'speaker_13': 'That's a that's a very good question. One thing that we heard when talking about the design quality was that it really was something that the community's looking for in the area, regardless of what happens with the height increases.'",
        "'speaker_13': 'And so there's a little bit of a distinction to be made with the integrated affordable housing where we're saying that's really about the the new increment of height that would be enabled and ensuring that when you're taking advantage of that, you're providing onsite affordable housing.'",
        "'speaker_13': 'The design quality is intended to apply to all projects in the area. However, it's quite likely that some of the specific design requirements would only apply to two bigger projects. For example, the tallest buildings might have the most meaningful mass reduction requirements and that kind of thing.'",
        "'speaker_7': 'Thank you. I think that's great. But the other question is, are they just guidelines as far as shapes and how dense they are and how whatever to step back or is it? Is there like a committee that reviews the architecture?'",
        "'speaker_13': 'No committee except that Reno kind of wants to have its own ad hoc committee. But really what we're talking about here to implement this plan will be effectively zoning requirements implemented through a design overlay, which is a tool enabled by the zoning code to apply specific standards to to a certain area.'",
        "'speaker_13': 'So there'll be there'll be quantitative rules.'",
        "'speaker_6': 'Yeah. Okay. Thank you.'",
        "'speaker_3': 'Mass reduction and things like that. Just to carry on. Don't. Councilman.'",
        "'speaker_10': 'You know, I was looking at the affordable housing about the regulatory approach. What are you are you talking about something different than the affordable housing now, or are you talking about something like inclusionary housing be apply there or or something like inclusionary housing applying to apartments for the first time?'",
        "'speaker_10': 'What are what are we talking about?'",
        "'speaker_3': 'EB I'm going to actually take this one.'",
        "'speaker_13': 'Because I think you're, you're the best person.'",
        "'speaker_3': 'This is one of the more complex ones. But now that we are passed this bill, we feel it gives us a little leeway to start to put this regulatory framework together. We did not want our regulatory framework for affordable housing to conflict with this bill.'",
        "'speaker_3': 'And so you will see both rental units and for sale units covered under this. And the way the way you do it is you incentivize if someone wants to go up to that, well, that's 616 stories. They will be able to do that for a percentage of affordable units.'",
        "'speaker_10': 'So be done with incentives and not penalties like the idea.'",
        "'speaker_3': 'Yeah, well if. Yes.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_3': 'Yeah. Councilman Espinosa.'",
        "'speaker_8': 'I first have to apologize. She's not here. But Susan Sue Powers, because I didn't raise my hand when I was asked if I had any affordable housing groundbreaking. I couldn't remember. But I did get eight units, despite the total loss of affordability that we've had in northwest Denver.'",
        "'speaker_8': 'But to this I mean, this is this is a great tool. I really have a this question might be two. Like I would like to hear from maybe three of you that were participants. You know, you guys were both the beneficiaries of having plans that overlapped and needing this sort of discussion to sort of rewrite and revisit'",
        "'speaker_8': 'these these plans. But is there anything in areas? So I'll just be frank. You know, we got the station area up at 41st and Fox Lake Councilwoman Ortega mentioned where we do have a stationary plan, but we don't you know, our plans are go back 30 years.'",
        "'speaker_8': 'And with with some vision about when we get around to it in the future. But is there anything in your process that you think that, you know, could could those be could these ideas and these steps be captured without having the plans in place, you know, because the outcome is valuable, invalid.'",
        "'speaker_8': 'And we do have some direction in our stationary plan. And it's important where where you're going with with this forum design guidelines and standards and the incentives for affordability that we capture that in in that area as well.'",
        "'speaker_8': 'If you've been paying attention and hopefully you haven't, we've had other discussions about Globeville and Forty-firsts and Fox and sort of the LAC, I mean, the constant rezoning, but the lack of tools to actually implement the vision of the Globeville plan.'",
        "'speaker_8': 'So having been through it all, you know, can we go from 0 to 2 this without having those incremental plans in place? And A, you can do it. But I'd also like the guys that did the the lifting from the community.'",
        "'speaker_8': 'Do you think the community is prepared to do that.'",
        "'speaker_2': 'As well as they're.'",
        "'speaker_0': 'Going.'",
        "'speaker_13': 'To turn it over to any of.'",
        "'speaker_3': 'You? I think John Noble and Josh, you guys want to just answer?'",
        "'speaker_10': 'I'll give it a try here. So the what happened here and why this happened here first is in a city that values affordable housing and is concerned about a lack of affordability, accelerating a lack of affordability in the Reno arts district, where the arts is in their name, they're seeing that artists not be able to afford to'",
        "'speaker_10': 'live there anymore. That caused a coming together to say, we understand there's a citywide thing, the inclusionary housing ordinance that's been revised. We understand that there's a new and better approach being taken, but none of that is going to require that the affordability be right here and driven by the Reno Arts District, need to keep affordability, especially'",
        "'speaker_10': 'if it can be preferred towards artists. Maybe that's not in the regulations, but but encouraged that that brought the conversation here. First, it's my belief that if we figure out how to do incentives, zoning, right, where if you do this, if you afford this affordability, you get significantly higher development potential, then this is something we can replicate'",
        "'speaker_10': ', adapt and learn from at other station areas because it's been commented on by council here tonight. It's it's a shame that although we're getting more density around station areas, it's generally market rate and being near a station is hot and so that gets bid up and there's not a lot of affordability unless you're lucky enough to have'",
        "'speaker_10': 'a nonprofit, do some land banking in that area. And then you get sort of one thing that's affordable, but you don't generally incentivize affordability. So I think this is a laboratory and we're going to try we've we've tried incentive zoning in Denver before, not too far from here, Arapahoe Square.'",
        "'speaker_10': 'There were far incentives that essentially nobody ever took advantage of. So we had a lots of discussions to say, how can we do this better? And part of it is not asking too much that people won't want to do it, but also offering a significant enough bonus.'",
        "'speaker_10': 'If you look at the difference between the numbers and the colors on the map on page seven, you'll see it's a significant bonus that we hope people will choose to take and have. The affordability not only happen, but happen here.'",
        "'speaker_8': 'Yeah, actually, you're the right person. And this is going to go to both of you guys. And this is not intended to sting, but I would like to have you guys on record. So there's both numbers. I mean, there's numbers and colors.'",
        "'speaker_8': 'There's checkerboard mean dashed lines, defining where those numbers are. How fluid are those lines? Because remember, we've had other rezonings where there's clear delineation on a map where people have negotiated and discussed where those where these heights are supposed to be.'",
        "'speaker_8': 'Now we're talking about where these bonuses are supposed to be. But if you have a developer that wants to cross that line, is, is that part of the plan?'",
        "'speaker_10': 'I'll try as a community member and then hand it to the office. These these were refined and refined and refined with multiple community meetings, and they moved by half a block. And if you look at some of the shading in the Cole area, on the right side of the diagram, you'll see them stepping down in these very'",
        "'speaker_10': 'deliberate stair steps. So as a community member, I would be disturbed if if these didn't describe an envelope within which buildings were built.'",
        "'speaker_8': 'Great. I have that on record. Is that the intention of CPD as well?'",
        "'speaker_13': 'Yes, the intention is that this map guides future map amendments. The area in particular that Joel just described is one where, you know, there might be a little bit of interpretation necessary to decide exactly where the boundary is.'",
        "'speaker_13': 'But the intent is pretty clear that the development is stepping down towards the neighborhood and will be furthering that conversation. When we look at the tools that are in the design overlay as well to see exactly how that's going to be accomplished.'",
        "'speaker_3': 'Can I bring Justin up as well? Justin, we actually Councilman Espinosa, you're going to feel really proud right now. We actually had the conversation because you brought it up. Obviously, it was in my district when you brought it up.'",
        "'speaker_3': 'But we it was I want you to give your interpretation of a community's perspective in dealing with that developer who took that line further than than it had in the actual plan document.'",
        "'speaker_0': 'Sure.'",
        "'speaker_13': 'So you're talking about there's a developer I mean, you're talking about the same example between Larimer and Walnut Street. You know, you got five stories that stops Mid-Block, but the language is a little bit ambiguous. So on the one hand, if you've got a neighborhood that's not particularly.'",
        "'speaker_13': 'Organized. I think that can be a real negative because it'd be pretty easy to push that line. Fortunately, I think we have been having conversations for three or four years now about what livability looks like in our district and our tools to be able to influence that have been somewhat limited when it comes to development specifically and'",
        "'speaker_13': 'even more specifically, more institutional type development that isn't modeled after more of a mixed use sort of format. So if you've got a community that really I think has its priorities identified and can use the fact that changing that zoning requires the developer to get the community's support or they're not going to get the community support vocally'",
        "'speaker_13': '. It's actually a way to influence the design. So because we didn't have a design overlay and because of that full block development, I mean, it's a full block, it will have a massive impact on the community for its life for 50 plus years.'",
        "'speaker_13': 'So that development had no active ground floor uses its, you know, its active uses or the leasing center in the gym in the typical situation. So we were able to sit down with them and have what was initially a pretty difficult conversation, but actually turned into a fairly amicable one where we said, if you activate these corners'",
        "'speaker_13': ', if you move your live work units to Walnut Street to help activate that space, because artists could potentially use those as galleries as well, then we will support this shifting of this line. And I think that the the way that the neighborhood actually lives shifting that line has less of a negative impact than four sides of a'",
        "'speaker_13': 'dead block development. That's an entire city block. So but I think the prerequisite for that is that the neighborhoods already had the conversation, really worked out what its goals are, and then is able to use that tool to sort of implement those and influence the design.'",
        "'speaker_13': 'So I would say for the entire process, the really the same thing applies where, you know, the end result of this is there's value that's being given, there's entitlement that's been given. And so how do we capture it and make sure that there's a give back factor to the community or all the work that leads up to'",
        "'speaker_13': 'that is what is that give back factor and why is it important? And how do you build sort of, I guess, unity around those ideas? So, you know, we started with neighborhood meetings with seven people in 2012 and said, what is regional look like in the future?'",
        "'speaker_13': 'What is a really urban, livable neighborhood look like? And right now it's a little bit of a blank slate and then tracked through a lot of those priorities over years. When faced with this opportunity and said there's an ask that there be additional height given we had the conversation, what is the tradeoff?'",
        "'speaker_13': 'What are the downsides of potentially giving away this density? And how do we turn this into a positive for the community?'",
        "'speaker_8': 'Are there plans? Is there is there language already in there or plan to be language that you can't even if you have ground for activation, that you can't have 100% residential development in certain locations?'",
        "'speaker_13': 'Or we are contemplating that for the design overlay.'",
        "'speaker_8': 'Okay, great. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Espinosa. Councilman. And thank you, Jason. Councilman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. I wanted to ask a question of either Justin or maybe even Joel about. Whether the issue of train safety came up, where we're talking about adding, you know, higher densities of people adjacent to this particular, you know, station area where obviously there there's an interest to see more development happening.'",
        "'speaker_9': 'But the the issue of train safety is something that we've been talking about, particularly where we have, you know, these corridors that carry freight and specifically flammable liquids and hazardous materials. And so can somebody speak to whether or not that issue came up at all?'",
        "'speaker_9': 'And, you know, as part of this this big picture planning for this area. So if you do speak to it, it did not.'",
        "'speaker_13': 'But yeah, I don't think it it really came up. Joel, did you have anything you wanted to add or Andy?'",
        "'speaker_9': 'I mean, I understand the entire area is not next to the track.'",
        "'speaker_14': 'And Councilwoman in.'",
        "'speaker_9': 'The area where I mean, we know that that corridor, you know, will have development on both sides of those tracks. And so where we have development that will be happening adjacent to the tracks. I'm just curious to know whether that was even discussed, because it's a real issue.'",
        "'speaker_14': 'So, Councilman, you have actually we've talked about this, I think, for a couple of years now, and it's a it's a absolutely justifiable concern. And we did not discuss it. You know, if you look at the riverfront area behind Union Station, you've got development on all sides of those tracks throughout that entire area.'",
        "'speaker_14': 'And I don't see why this would be any different. So we just it wasn't something that came up in the course of our steering committee discussion.'",
        "'speaker_9': 'Well, and you need to know that those residents who live down in that area are some of the very first people who started raising this question as a real concern. And it would be different if we didn't have the kind of flammable liquids that travel through this city and oftentimes stage in the center of the city and'",
        "'speaker_9': 'more frequently actually stage in this very corridor where we're talking about this development, where the potential impact to human life and property could be catastrophic, you know, with the wrong situation occurring. And so just planning appropriately for how we deal with that becomes really vital to ensure that we're doing our job.'",
        "'speaker_9': 'When we say we're truly addressing health, safety and welfare of the communities that we're going to, you know, encourage to live. And or work in these developments that happen to be right next to, you know, trains to carry these products.'",
        "'speaker_9': 'So I appreciate you addressing the question. I just raise the concern and we will continue to do that. We have work that was done by a working group that was chaired by our fire chief. We've got a report that was submitted to the mayor.'",
        "'speaker_9': 'We've got next steps to then meet with the development community before our agencies start to actually utilize the recommendations that came out of that. And so stay tuned. This issue is not isolated to this corridor. We have this challenge all across the city where we will have transit lines adjacent to these freight lines and where we will'",
        "'speaker_9': 'see continued pressure for large and higher density development, where I think it's inherent or incumbent upon us to really be looking at doing the right thing.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank you. There's no more questions. A public hearing for Council Bill 760 is now closed. Comments by members of council. I call on myself. Why not? Right. It's 11:00. The last bill was the most important bill that I've been a part of.'",
        "'speaker_3': 'And since I've been on city council, this bill is probably. The most intriguing cool bill that I've been a part of. And here's why we had the number was actually 250 people at the meeting and there were architects, developers and folks from coal Curtis Park, Whittier, Gloria, Swansea during a time of Platt to Park here.'",
        "'speaker_3': 'So they actually showed up to the meeting upset and came by and came back in all of the tables that there were intermixed with all of these professionals. And we had one of the most fruitful discussions. And I think that's why you see an empty room and not pitchforks and, you know, everything else, because we really did'",
        "'speaker_3': 'have a good conversation around, you know, we don't want to be bolder. So let's talk about heights because if you don't have the ability for density in a city. It's a supply and demand factor. And so your homes are going to be mostly expensive.'",
        "'speaker_3': 'And so we had a great discussion. This is not over. This is just the plan amendment. The last time a plan has been amended in the city of Denver, 90 to 91, I believe it is. So this is really cool.'",
        "'speaker_3': 'And we hope that we can continue doing this, that small area plans do get a chance to get amended, be amended for more certainty for for neighbors and business folks alike. So I will be supporting this. You will see us again at a legislative rezoning once the regulatory framework of affordable housing has been set.'",
        "'speaker_3': 'Once the overlay district of the design standard. When I got to I got to think, you know, Justin Croft and a lot of folks at Rhino for really working hard on that. But thank you CPD for your involvement.'",
        "'speaker_3': 'And if you hadn't done this before and I feel like you're super flexible. And Tim in Utah, Salt Lake City somewhere. Thank you, buddy. You've been amazing. Councilman Lockett. Councilman Espinosa.'",
        "'speaker_8': 'Oh, yeah. Just thank you to Abe. Thank you to Tim. If you're watching and CPD and all the stakeholders help get this hate amendment through. It was a real pleasure when it came to committee to see this, because this is exactly what we've been thinking we needed to be doing for a long time.'",
        "'speaker_8': 'And I'm a proponent for wisely incorporating density in mixed income developments near TOD sites. So I believe these height amendments are a step in the right direction along with your guidelines and standards that are in the future. So just well done, well done to CPD staff and the community and everyone involved.'",
        "'speaker_8': 'So thank you.'",
        "'speaker_3': 'AS Hear that. ESPINOSA Well done. All right, Councilman Clark.'",
        "'speaker_0': 'Thank you, Mr. President. Lots of talk about density and affordable housing. I just wanted to, before it got away, point out that what this does in terms of focus on the river, I think is unique in Denver and I think can set a precedent for how we treat the river and development that the river is not the'",
        "'speaker_0': 'back where you put all of your utilities and all of the bad stuff that we treat the river as a street, as a main street, as the front door to your building. And I think that's absolutely critical as we continue to revitalize and restore our river.'",
        "'speaker_0': 'And I hope that this is kind of we can all look back as we're walking up and down the riverfront in Denver for decades to come and say this is what really started not making that voluntary anymore, making that something that we as a city value and that we require.'",
        "'speaker_0': 'So I thank you for that. I'm really excited. Thank you, Mr. President.'",
        "'speaker_3': 'And thank you, Councilman Clark. Great comments, Councilwoman Black.'",
        "'speaker_6': 'I think it's really incredibly cool.'",
        "'speaker_7': 'And so kudos to all of you. And someday in District four, maybe we'll have one plan. Maybe someday we can amend it.'",
        "'speaker_3': 'But that Councilwoman Black, that was the perfect way to end tonight is remove to say Madam Secretary Rocha.'",
        "'speaker_5': 'Black Eye Clarke, I Espinosa Flynn, I. Gilmore, I. Herndon, i cashman. Kenny Lopez. I Knew Ortega Susman. Mr. President.'",
        "'speaker_3': 'I close vote. Announce the results.'",
        "'speaker_5': 'Councilwoman Black.'",
        "'speaker_3': 'Councilwoman Black. You are hanging fire keeping.'",
        "'speaker_5': '39. Wow.'"
    ]
}