{
    "Proclamation for the Housing Authority of the City and County of Denver's 80th Anniversary.": [
        "'speaker_0': 'Thank you for bringing that forward, Councilman Ortega. Next up, Councilman Lopez, when you read Proclamation nine, eight, seven.'",
        "'speaker_2': 'Yes, I will. Proclamation number 18. I'm sorry. Proclamation number 97 Series of 2018 recognizing the housing authority of the city and county of Denver's 80th anniversary. Providing quality, affordable housing and community revitalization. Whereas the U.S. Housing Act of 1937 was passed to provide decent, safe and sanitary dwellings for families of low income.'",
        "'speaker_2': 'And. WHEREAS, The Denver City Council passed an ordinance legalizing the creation of a local housing authority on September 2nd, 1938, appointing a five member board to guide the agency and set its housing policies. Whereas, September 2nd, 2018, marks the 80th anniversary of the Housing Authority and the city of the City and county of Denver.'",
        "'speaker_2': 'The Denver Housing Authority, which has provided thousands of families, seniors, veterans and disabled individuals with quality and affordable housing in communities, offering empowerment, economic opportunity and a vibrant living environment. And. Whereas, DHHS earliest primarily focused on I'm sorry.'",
        "'speaker_2': 'Whereas the earliest housing primarily focused on the needs of World War Two era defense workers providing cost effective housing for employees of the Rocky Mountain Arsenal. And today, VHA manages and serves over 12,000 family members and nearly 2300 units in Denver's first road type family development.'",
        "'speaker_2': 'And. Whereas, the 1960s and eighties brought the NE as from from the 1960s to the eighties, brought the need for housing for seniors and VHA, built senior high rises, adding 500 new units of senior housing. The Seventies fostered resident advocacy and leadership, establishing the Central Resident Council and emphasizing resident self-sufficiency.'",
        "'speaker_2': 'Those years also brought the first tenant based Section eight housing certificates, the first home ownership program, and dispersed housing. And. Whereas, the 1990s, DHEA evolved to building homes and lives through partnership and community revitalization, launching partnerships with the Area Higher Education Campus.'",
        "'speaker_2': 'It launched the first tour. I mean, sorry, the first of four bridge projects in partnership with the University of Denver to increase graduation rates for children in the housing DHEA, forge mixed income, mixed use housing and energy efficiency through its award winning Benedict Park Place.'",
        "'speaker_2': 'And. Whereas, today, DHEA leads the nation in creating healthy, safe, vibrant, transit oriented, sustainable and mixed income communities of choice and transforming neighborhoods under the direction of a nine member board and leadership of an executive team and staff.'",
        "'speaker_2': 'DHEA is committed to working in partnership with the city, business, community and nonprofit organizations, community and residents. And. WHEREAS, DHEA, a quasi municipal agency, develops, owns, operates and manages a portfolio now of over 12,000 units and housing choice vouchers, providing affordable housing to more than.'",
        "'speaker_1': '26,000.'",
        "'speaker_2': 'Very low, low and middle income individuals, which over 50% are children, representing over 10,500 families with average incomes of 12,709. For families and seniors. Average seniors. Average income 13,851. Whereas DHB employs over 300 individuals providing over $69 million to the private sector in housing assistance payments for the Housing Choice Voucher Program and contributes over 81 million into'",
        "'speaker_2': 'the $81 million into the economy for new construction, rehabilitation, modernization and preservation of affordable housing. And. Whereas, in 2018 and beyond, DHS Focus on Innovation and Social Ventures include the Youth Empowerment Employment Academy, Osage Cafe, Friends of the West, Denver Renaissance Collaborative.'",
        "'speaker_2': 'Connect Home. Denver Bridging. Denver Bridging the Digital Divide Real Estate Development, Living Green Eco Districts, Solar Gardens, New Markets, Collaborative Spaces and private public partnerships providing a variety of housing opportunities in and for Denver. Now, therefore, being proclaimed by the city, by the council, the city and county of Denver, Section one, that the Council of the City'",
        "'speaker_2': 'and County of Denver recognized the housing authority of the city and county of Denver's 80 years of providing quality, affordable housing and community revitalization. Section two that the Clerk of the city and county of Denver shall affix the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the housing'",
        "'speaker_2': 'authority of the city and county of Denver.'",
        "'speaker_0': 'Thank you. Councilman Lopez, your motion to adopt.'",
        "'speaker_2': 'Mr. President, I move that council proclamation number of nine, eight, seven series of 2018 be adopted.'",
        "'speaker_0': 'And has been moved and seconded comments by members of Council. Councilman Lopez.'",
        "'speaker_2': 'Thank you, Mr. President. Living in the shadow of the Westwood Homes for most of my life. My first understanding of community was the playground, the old playground at the Denver area. Housing authorities, Westwood Homes. Three languages I learned.'",
        "'speaker_2': 'Well, obviously. English. English. My broken Spanish. My, my. I call it my, my, my, my total of Spanish from last word and Vietnamese. All my friends were from that those. They spoke those three languages. And it was there where you understood community and it was there where you understood not just community, but other people.'",
        "'speaker_2': 'Other people and where they're from, but their struggles are. It was there as a city council man where we in during the renovation of those Westwood Homes. And we we created gardens. And to see folks who would be gardening separately, usually garden together, sharing food, sharing culture, and being able to do this in peace.'",
        "'speaker_2': 'Being able to do this away away from war torn countries. Being able to do this with their families and in dignity in Denver. And I got to tell you, a lot of us have been either from other parts of the country or been around other parts of the country.'",
        "'speaker_2': 'When you say public housing. It's different when you come to Denver and say, excuse a term I just grew up with the term and say, Oh, oh yeah, those are the projects. And they're like, What? Those aren't projects.'",
        "'speaker_2': 'Seriously, those are the projects. Yeah, those are nice. Compared to other cities. You have to see this from a from a perspective from around the country. There is a standard of living that Denver has upheld. There's a standard of living that everybody, A.J. has worked for.'",
        "'speaker_2': 'And now that standard of living is ever changing and ever evolving, because I get this all the time and I know I want to. I just I just I just want to say this on the record, because a lot of people get confused when they cruise down Mariposa.'",
        "'speaker_2': 'Over there in the lower and the west side. Right just right down the street like 11th and Mariposa they say all. So you got rid of the projects, huh? You got rid of all those folks. That's terrible. Where do they all go?'",
        "'speaker_2': 'And I'm like. It's still there. What are you talking about? Yeah. Those high rises, those fancy old buildings. Uh huh. The fact. The public housing units. Are almost indistinguishable. From market rate. Reduced rate. Any other neighborhood? Any other units?'",
        "'speaker_2': 'Means that we're doing our job. And that is being able to provide a unit to somebody who is in need. Without the stigma. But instead with dignity. Right. And for that, I have to say, 80 years of hard work.'",
        "'speaker_2': 'And you're still not done yet. There's plenty more to go. And I couldn't be prouder of this team. Can be proud of this leadership, but especially of the resident councils and all those folks who I know growing up who have become not just in now, folks who just live in the community, but leaders, some of our strongest'",
        "'speaker_2': 'leaders have come out of these resident councils. So this leadership thing is is a real deal. And I could be I can be more proud of that. So. From one Denver native to plenty more. Keep doing a great job.'",
        "'speaker_2': 'I'm proud to carry this proclamation, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Councilwoman Cannick.'",
        "'speaker_5': 'Thank you, Mr. President. I had the distinct honor of speaking at the gala, one of the 17 or 19 events you're having this year to celebrate. I'm just teasing. It's good. It's good to celebrate all year long. Anyway, it was a distinct honor to be there with the mayor and him and talk a little bit about the'",
        "'speaker_5': 'impact of the housing authority, I think. Councilman Lopez, thank you for bringing this forward. And I think you did an amazing job. So just to underscore for me, I think, first of all, I don't talk about housing anymore in my work.'",
        "'speaker_5': 'I'm trying hard to make the switch to homes. What we do is we build homes, which is places where people live. And, you know, the DHS has been building homes for a very long time, but it has been about the people.'",
        "'speaker_5': 'I mean, Paul mentioned the three languages. Now we've got dozens and dozens. And I think that when I think about what it means to someone who, for example, might be in the twilight of their life, they're a senior and this is probably the last home they're going to have.'",
        "'speaker_5': 'And that is where they are going to, you know, be hopefully with stability, with the ability to afford food because their home is is more affordable and be able to really in dignity, you know, end their lives. People with disabilities.'",
        "'speaker_5': 'Right. Who might not have the ability to work in the traditional way that we often think of to earn enough to pay market housing prices. So. So regardless of whether it's the immigrant family who's getting started, the family that maybe has lost a parent and really needs to get back on its feet and it's a very temporary'",
        "'speaker_5': 'situation or the for household who may need to live in this housing for for their life. These homes are really, you know, about that opportunity and about that dignity. And then what I think has been amazing watching the eight year transformation is the way that DHS has moved beyond the home and the community of people there to'",
        "'speaker_5': 'thinking about places. So one of the things that was striking to me as I kind of started doing housing work in this city 15 years ago, is that DHS is always thinking about what does this whole neighborhood need?'",
        "'speaker_5': 'Right. So if there's a food gap for their residents, it's a food gap probably for their neighbors to or what does, you know, having a safe sidewalk in a safe environment feel like when you're walking around. So it's not just about the people who live in the homes.'",
        "'speaker_5': 'It's about that entire community and thinking about transformation in ways that really benefit the broader neighborhoods where where you own homes. And, you know, I guess the one thing I want to say to about this is that we think a lot about your multifamily housing.'",
        "'speaker_5': 'But one of the secrets I think of the housing authority is that across the city, in single family homes and duplexes that you would never know are residents of that. You know, these homes that we call them scattered site and I happen to live on a block and the best yard on my block and the dearest neighbor'",
        "'speaker_5': 'I have, I won't name her because I want to respect her confidentiality, but is a resident and lives in your home and her pride in how she takes care of it and her family, her son and her grandson live with her and just the opportunity it gives her to live in a neighborhood and thrive.'",
        "'speaker_5': 'Right. That integrated way of living. So so it's not just these big, tall multifamily buildings, but you may have a Denver housing authority neighbor and you might not even know it nearby. So we really have to get beyond our stereotypes and think about this agency.'",
        "'speaker_5': 'The last thing I will say is that thinking beyond just the home, thinking beyond just the the community is then thinking about our entire city. And so in my almost what are we at seven, seven and a half years, seven and counting years I have sat at I don't know how many policy tables with the Housing Authority'",
        "'speaker_5': 'as a thought partner thinking about big catalytic ideas. We saw them here for the housing fund expansion, bringing forward the bond dollars, the live program. Many of the other really when we worked on revisions to the inclusionary housing ordinance, every policy conversation you all are there is thought partners.'",
        "'speaker_5': 'I often think about it is Ismail, but there's a whole team. Many of you are here, Ryan and Stella and others, Chris Carr before you and many others. So so you are thinking with us as partners about the overall realm of housing.'",
        "'speaker_5': 'And I think that to me is like the depth of partnership. It's it's about the physical, it's about the the integration, and then it's about this big picture ideas. And so I have found that my work would not have been possible over these years without your partnership and without all that you bring.'",
        "'speaker_5': 'So thank you for what you've contributed and happy 80th. It's very exciting.'",
        "'speaker_0': 'Thank you, Councilwoman Kennedy. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you. I want to extend my congratulations and thanks to you as well for their 80 years of existence. I had the great pleasure of working with DHEA because I had four of their larger developments in in my former district, Curtis Park, Lincoln Park, Stapleton and Craig Newton and.'",
        "'speaker_9': 'I had the great pleasure of of working with Kevin Markman when he was the director. So Carpio my my former colleague, Bill Radcliffe, when he was there, when I worked for Sell, Bill had a long history as well.'",
        "'speaker_9': 'Some of the comments I wanted to make were about the scattered sites and just the the role that VHA is playing in helping us really accelerate, addressing the need for so many people who are struggling in this city today because of the significant rise in our housing costs and the fact that our our wages have not kept'",
        "'speaker_9': 'pace with the cost of housing in this city. And. You all just stand in the you know, in that place where you fill that gap for so many families and the fact that we've been able to bring forward, you know, with the help of the mayor, the $150 million that will be bonded, that will really jumpstart your'",
        "'speaker_9': 'Sun Valley project and the Westwood West Ridge project that will bring those units online much faster than you probably otherwise would have been able to do so. And that's only half of the money you all will be administering that with other nonprofits and trying to help bring online units in in other areas of the city.'",
        "'speaker_9': 'And that is so important. And without you all willing to stand in that place to help us accelerate that, we'd we'd see we wouldn't see that light at the end of the tunnel for so many families that are struggling.'",
        "'speaker_9': 'And I just, again, want to say thank you for for that work that you have done, the partnership that you all have had with other nonprofits. I know you did a lot of work with the Denver Road Home Program and provided vouchers for homeless families.'",
        "'speaker_9': 'When the Denver Road Home Program was kicking off and trying to give people a place to to live. And I again, I just can't say enough thanks for the important work that you're doing in this city. And and congratulations to your entire team and your board for the great work you guys do every day.'",
        "'speaker_9': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Madam Secretary. Raquel.'",
        "'speaker_7': 'Lopez. I knew Ortega.'",
        "'speaker_5': 'SUSSMAN Black.'",
        "'speaker_1': 'BROOKS Hi. Flynn here.'",
        "'speaker_7': 'Grier. Gilmore. Herndon. Cashman can eat, Mr. President.'",
        "'speaker_0': 'All right. Madam Secretary, please close voting in the results.'",
        "'speaker_7': '12 days, 12 hours.'",
        "'speaker_0': 'Proclamation, nine, eight, seven has been adopted. Councilman Lopez, is there someone you'd like to bring up to accept the proclamation?'",
        "'speaker_2': 'Yes. I'd like to bring up the executive director, Ismael Guerrero. And anybody else who you would like to bring up as well. Mr. Garrett. Great. Good evening and good to be with you as you all again. Ismael Guerrero, DHS executive director.'",
        "'speaker_2': 'And thank you for the proclamation for the kind words from the council. It's appropriate that we started the evening talking about Denver's great sports teams, because I have to tell you that we definitely have the best housing and community development team at the Denver Housing Authority in the country.'",
        "'speaker_2': 'I would dare say, given all the great work that we're doing and we know that nothing great happens without teamwork. And so we have a great and deep bench at the Housing Authority, starting with our board of commissioners who have to thank all of you.'",
        "'speaker_2': 'City Council approved. We have a great leadership team there that really lets us run with our ideas and our creativity and providing great vision for the organization overall. Also, as I said, have a deep bench here with some of my senior leadership team.'",
        "'speaker_2': 'And I would say collectively just in this room, we have over 80 years of service to the housing authority already. And if you add up among the staff, you probably have a thousand years of service to the city, given the depth and the many staff members who have been with us for four decades, really.'",
        "'speaker_2': 'And we have great community partners throughout the city. We can do what we do without our nonprofit partners, our neighborhood partners. Councilman Lopez mentioned our resident council board. Our resident leaders are unparalleled in the country in terms of their commitment to their neighborhoods, for their residents, and to the authority overall to our areas.'",
        "'speaker_2': 'And thank you, Councilwoman Ortega, for mentioning my predecessors. You know, 80 years of history, you cover a lot of ground, have a lot of accomplishments and build on the success of the past. Sal Carpio, my predecessor, was fantastic, really did a lot for the organization and for the city overall.'",
        "'speaker_2': 'And Kevin Markman before him is still active on the Housing Advisory Committee. I'm still committed to serving the city of Denver. Even now, when we think about celebrating 80 years, we're really looking forward as much as we're looking backwards at our accomplishments.'",
        "'speaker_2': 'And I just wanted to share with you, some of you have already mentioned just briefly. We're really moving beyond housing in terms of the work that we're doing, understanding that great neighborhoods and improving the quality of life of residents is more than just offering them a great unit to live in.'",
        "'speaker_2': 'You heard earlier in the proclamation some of our new social ventures that we're launching, including the Youth Employment Academy, our Osage Cafe, friends of the H.A., the Connect Home, Denver, which is bridging that digital divide. And our metropolitan solar farm out east of DIA is powering hundreds of public housing and affordable housing units around the city.'",
        "'speaker_2': 'So those are things that we're doing now looking beyond housing to really how do we change lives and impact the neighborhoods that we're in. We're also really excited now, looking forward to be a partner, a stronger partner with the city.'",
        "'speaker_2': 'Now that the five year housing plan has been completed and the goals and the work ahead of us has been made clear. I'm very proud that the Housing Authority staff is really stepping up to the challenge and and being part of the solution to the city's housing challenges.'",
        "'speaker_2': 'You heard earlier the live Denver program that was approved earlier this summer, the bond initiative that you all approved just a couple of weeks ago, which we're excited to be launching over 2000 units we expect to be delivering between in the next 3 to 5 years there.'",
        "'speaker_2': 'And soon you'll be hearing more about the West Denver Renaissance Collaborative and the work we're doing in to stabilize neighborhoods in southwest Denver. So those are all exciting work that we have looking ahead in the immediate future, but intend to continue to be a strong partner with the city over the next eight years.'",
        "'speaker_2': 'And finally, as Councilwoman Kenney mentioned, this has been a year long celebration for us. There's a lot of people to recognize, a lot of accomplishments we want to acknowledge and celebrate and our partners. And we are going to have a capstone event in December, our 80th anniversary gala.'",
        "'speaker_2': 'We're looking forward to not just bringing coming together with our partners who've helped us build the neighborhoods and the housing and the programs that we offer. But also as a capstone event, it'll be a fundraiser for our residents services that we offer throughout the city to youth.'",
        "'speaker_0': 'To adults.'",
        "'speaker_2': 'To seniors and disabled. So we're hoping to raise a good amount of money at the end of the year to have some funds going forward to improve and expand our resident programs. So with that, I'll thank you again for the proclamation and for recognizing the city and county of Denver Housing Authority service to the city of Denver'",
        "'speaker_2': '. Thank you very much.'",
        "'speaker_0': 'Thank you so much. Thank you, Councilman Lopez. And enjoy your most. Thank you. All right. And Councilman Lopez, you're back up now with Proclamation 1988. Thank you.'"
    ],
    "Alley Vacating with Reservation in Council District 5.": [
        "'speaker_0': 'Street and Leeds, still dry and under pending. No items have been called out. Uh, looks like we're good. So, Madam Secretary, will you please put the first item up on our screens? And, Councilwoman, can you please put Council Bill 394 on the floor?'",
        "'speaker_5': 'Yes, Mr. President. I move that council bill 18 dash 0394 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. Councilwoman Sussman, your motion to postpone.'",
        "'speaker_5': 'I move that final consideration of Council Bill 394 be postponed to Monday, September 17th, 2018.'",
        "'speaker_0': 'It has been moved, if I can get a say and seconded questions or comments by members of Council Councilwoman Sussman.'",
        "'speaker_5': 'Thank you, Mr. President. Some of the interested parties in this matter where we requested a postponement to Monday, September 17th, because tonight is a Rosh Hashanah holiday and they would not be able to attend this meeting.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. See no other questions or comments, Madam Secretary. Roll call.'",
        "'speaker_7': 'Sussman. Black Brooks. Flynn. Ah. Gilmore. Herndon. Cashman. Canete, I. Lopez. New. Ortega. Mr. President.'",
        "'speaker_0': 'I am secretary. Please close the voting in this result.'",
        "'speaker_7': '11 Eyes.'",
        "'speaker_0': '11 Eyes. Final consideration of Council Bill 394 has been postponed to Monday, September 17th. That concludes the items to be called out. All other bills for introduction are ordered published. We are now ready for the block vote on resolutions and bills on final consideration.'",
        "'speaker_0': 'Council members remember that this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call out an item for a separate vote. All right, Councilman, can you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_5': 'Yes, I move that resolutions be adopted and bills and final consideration be placed upon final consideration and do pass in a block for the following items. All series of 2018 828 913 nine 3934 938 925 920 89049059099 ten 926 931 930 2879 891 893 604 816 832.'",
        "'speaker_5': 'And that's it.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_7': 'Black. Hi, Brooks.'",
        "'speaker_1': 'Uh, Flynn. Hi.'",
        "'speaker_7': 'Gilmore. I heard in Cashman can eat. I knew Ortega. SUSSMAN Hi, Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please call the voting. Announce the results.'",
        "'speaker_7': '11 eyes.'",
        "'speaker_0': '11 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 880 approving the service plans for the creation of the 4201 Arkansas Metropolitan District number one and 4201 Arkansas Metropolitan District number two a required public hearing on Constable 881'"
    ],
    "Service Plans for 4201 Arkansas Metropolitan Districts No. 1 and No. 2.": [
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Council Member Can you please put Council Bill 880 on the floor?'",
        "'speaker_5': 'Yes, I move that council bill 18 dash 880 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded and the public hearing for council bill 80 is open.'",
        "'speaker_2': 'May we have staff report?'",
        "'speaker_11': 'Good evening. My name is Andrew Johnston with the Department of Finance and I'm here to give you the staff report on Council Bill 1880 series of 2018 four, which wishes for an ordinance approving two service plans for a new for new metropolitan district supporting the redevelopment of 4201 East Arkansas Street.'",
        "'speaker_11': 'The districts are called 4201 Arkansas Metropolitan District number one and 4201 Arkansas Metropolitan District number two. The service plans are being submitted for City Council approval on behalf of CR F Arkansas LLC pursuant to the requirements of Special District Act sessions.'",
        "'speaker_11': '30 2-1, Dash 201 and more particularly 30 2-12 of 4.5 of the Colorado Revised Statutes. The service plans contain the district's purpose, powers, requirements and financing plan. The district shall be responsible for compliance with the city's municipal code rules, regulations and policy and all other applicable laws.'",
        "'speaker_11': 'The District shall ensure that the District's public improvements are designed and constructed in accordance with the standards and specifications of the city and other governmental entities having jurisdiction. It is anticipated that one of the proposed metropolitan districts will encompass the project's residential property, while the other metropolitan district will include all the commercial property located within the project'",
        "'speaker_11': '. The new metropolitan districts together will be responsible for coordinating the financing, acquisition, construction, completion operation and maintenance of all public infrastructure and services within and without of the service areas, including without limitation street and sidewalk improvements, parking infrastructure, water, storm drainage detention and sanitary sewer improvements, landscaping, irrigation, public spaces and traffic and safety controls and their related'",
        "'speaker_11': 'improvements. The new metropolitan districts will have the power to raise revenues pursuant to the authorities granted by the Special District Act, including the imposition of up to 50 mills plus rates, fees, tolls and charges for debt and district operations and maintenance.'",
        "'speaker_11': 'The total estimated cost of the public improvements necessary to serve the contemplated development are approximately $24.2 million. In order for the new metropolitan districts to have the fiscal wherewithal to provide the funding for the upfront costs of the public improvements needed in the service area, the new metropolitan districts shall each have the ability to issue debt and'",
        "'speaker_11': 'impose a debt levy to provide the funding for the upfront infrastructure costs. The 4201 East Arkansas Street site is not currently located in an urban renewal area. The developer is actively engaged with the Denver Urban Renewal Authority for authorization to use tax increment financing at completion of the current plan.'",
        "'speaker_11': 'Provide at completion. The current plan projects a residential and commercial mixed use development. The development plans include approximately 150,000 square feet of commercial space, 150 units of deed, restricted, affordable onsite housing and additional market rate housing. Approval of the service plan establishes the following.'",
        "'speaker_11': 'There is sufficient existing and projected need for organized service in the area. The existing service in the area is inadequate for president and projected needs. The districts are capable of economically providing sufficient service to the area within the proposed boundaries.'",
        "'speaker_11': 'The land and the proposed development to be included does and will have the financial ability to discharge the proposed indebtedness on a reasonable basis. The facility and the service standards will be compatible with the facility and service standards of the city.'",
        "'speaker_11': 'Staff recommends approval of the service plans. The applicant, their representatives and city staff are here tonight to respond to any questions regarding this council. Thank you.'",
        "'speaker_0': 'Thank you. We have six I believe six individuals signed up to speak this evening. So if you're signed up to speak tonight, if you could come up to this front bench and if we could make room for our speakers.'",
        "'speaker_0': 'And then as soon as I call your name, step up to the podium and you may begin your your thoughts as the time will start to elapse. So first up, we have Kristin Bearer.'",
        "'speaker_5': 'Mr. President, council members. My name is Kristen Baer. I'm with the law firm.'",
        "'speaker_7': 'Of White Bear and.'",
        "'speaker_5': 'Tanaka and Waldron.'",
        "'speaker_7': 'We represent the.'",
        "'speaker_5': 'Petitioners in this matter. I am proposing your approval of tonight's service plan and the bill.'",
        "'speaker_7': 'That's before you. I would like to put on record that notices have been prepared and were sent.'",
        "'speaker_5': 'Out according to statute in the city's requirements. Thank you for your time and consideration of this matter and I would be happy to answer any questions you.'",
        "'speaker_7': 'Might have regarding the districts.'",
        "'speaker_5': 'Or the service plan specifically.'",
        "'speaker_0': 'Thank you. Thank you very much. Next up, Christmas card.'",
        "'speaker_11': 'Thank you. On Christmas card with the control group. I'm representing the applicant. We really appreciate your time tonight. And I'm here for questions. We are in support of the application.'",
        "'speaker_0': 'Thank you. Thank you very much. Next up, Sam Sharp.'",
        "'speaker_2': 'Good evening. And Sam Sharpe with D.A. Davidson, a company where the.'",
        "'speaker_1': 'Investment banker to the applicant and happy to answer questions.'",
        "'speaker_0': 'Thank you very much. Next up, Florence seven.'",
        "'speaker_5': 'Good evening. My name is Florence Seaborn. 1140 South Forest Street, the Virginia Village neighborhood in Denver. I'd like to make a statement and also a request regarding the transparency of the process by which metro districts are created in Denver.'",
        "'speaker_5': '22 metro districts have been proposed in Denver since the beginning of the year, just over two per month on average. Metro districts are overlay districts with perpetual existence and significant authority. Metro districts levy additional property taxes. They borrow money, incur indebtedness and issue bonds.'",
        "'speaker_5': 'They manage control and lease property within their boundaries. They acquire property and expand their boundaries. They manage control, supervise construction, operation and maintenance within their boundaries. They fixed charge and collects collect fees for services, programs and facilities, and they enter into contracts with public utilities and municipalities.'",
        "'speaker_5': 'A five member board governs the Metro District. A majority of metro districts at the time they are formed have no residents. So the board is the developer. Currently, only developers. They're hired. Law firms, city council and interest city departments are aware of metro district proposals.'",
        "'speaker_5': 'Denver's registered neighborhood organizations are not noticed of Metro District proposals in their boundaries, and neighbors are unaware of metro districts forming in their neighborhoods. A Metro District's development impacts surrounding property values. Commercial components in a district pass on additional tax caused to neighbors who avail themselves of that district's goods and services.'",
        "'speaker_5': 'When I asked Community Planning and development about notice to RINO's, the reply was this and I quote The law firms representing the creation of metro districts typically send these notices out to all taxing entities with three within three miles of the new district.'",
        "'speaker_5': 'It's not a notice sent out by the city and county of Denver. In this particular case, they probably chose to also notice the rentals. But when I asked White Bear, any claim is Bear advised that no notice was sent to the RINO's because Colorado a revised statute does not require it.'",
        "'speaker_5': 'As a Denver native, born, raised and still happily living in Virginia Village, I find that people are engaged and often take advantage of the opportunity to educate themselves. I think it's a reasonable expectation of neighbors and our anos to be courtesy noticed about processes which impact us since there is only one public hearing for the creation of'",
        "'speaker_5': 'Metro District Service plans. I think it's even more reasonable to courtesy notice Arnaud's of the public hearing. I request that Arnaud's be courtesy noticed for all future metro districts. Frankly, anything less is at odds with Denver's emphasis on open, visible, accessible, empowered, impactful, engaged and inclusive governance.'",
        "'speaker_5': 'Courtesy Notices. Good policy. I ask you to make it part of this process as well. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_3': 'Good evening. My name is Chairman Sekou. I'm the founder of. Organizer for the Black Star Action Movement for Self-defense. Advocacy group for poor working, poor homeless. And. Students, senior citizens. First of all, it feels good to be back after being absent for a while.'",
        "'speaker_3': 'And. I want to. Take this opportunity to. So thank you for being here. And also for putting up with some. Language that wasn't necessarily appropriate for the body. There was no intention to demean or to negate what is happening here in terms of importance.'",
        "'speaker_3': 'There's no excuse for that. And. So thank you. And thank you, General Patton, for not throwing me out of here. For using the. Langford's. Even though it was in the Bible. So. Listen to what the previous speaker said.'",
        "'speaker_3': 'It's absolutely true. And. Thinking about this process and doing something different. There was a word that popped up in my brain in terms of this process called metropolitan districts. And it's all Greek word and it's called esoteric. And this is an adjective that describes the people place or thing intended for or likely to be understood by only'",
        "'speaker_3': 'a small number of folk with a specialized knowledge or interest. For example, tonight, a city council meeting in Denver. In attendance, there were 12 elected officials full of esoteric knowledge with very little practical, common sense. Like what she was talking about.'",
        "'speaker_3': 'That should already be there as mandatory. And you're right it. We do something that needs improvement. Why not? It won't make us a better city. And as we seek greatness. There also has to be goodness. See. See, Hitler was a great man, but he wasn't necessarily good.'",
        "'speaker_3': 'Metropolitan, state, metropolitan districts are great things, but they're not necessarily good. So are we seeking greatness in the greatest city, always seeking to be a good city where we can talk about homes or no more than structures? Or is home a place where there's love, there's care, there's overwhelming good feelings about being there and that there's a'",
        "'speaker_3': 'support system there and it's unconditional. Is home no matter what club, that nobody gets thrown under the bus and nobody is left behind, even the ones that we don't necessarily like in our own families. So home is more than just a building.'",
        "'speaker_3': 'It's a place for folks to have their dreams fulfilled. So. And so in this metropolitan district, I support it. I really do because I know that. Councilman Cashman understands what I'm saying. And I know that the proper oversight will go down.'",
        "'speaker_3': 'So some of the things that she talked about will be done. Whether it's in the law or not because it's right to do. And it's not going to hurt you to do it. And I know you'll take the risk of being criticized by your.'",
        "'speaker_3': 'Double the numbers for overage. Well, they underage under the table. To get paid for the interests of why they do what they do. So they keep this on the down low. And that's the history. After 15 years of being down here, that's a history.'",
        "'speaker_3': 'That's the way it's been going down. So we have an opportunity with fresh blood and folks coming in or blood going out, that there's a possibility of a new way of doing things that says nothing about the people going out or the people coming in, but talking about a new way, how to do this thing so that'",
        "'speaker_3': 'we advance our city so that it becomes the Emerald City. An example for other cities, not only in this state, not only in this nation, but this entire world. Why not? What we got to lose by having an Emerald City green like mountains space like we talk about with this Pledge of allegiance, things that we do and'",
        "'speaker_3': 'all the other rituals that we do. We talk about purple mountains of majesty and what. And then in such an environment. We have the wherewithal to match the environment which is pristine with government. So that is trusted again by the people and that their voices are not just listened to or heard, but taken to heart.'",
        "'speaker_3': 'That, Hey, we can do this, man. We can do this. So considering some of the things that she talked about and. Some of the things that I may have missed. I feel kind of strange up here talking after being an absence.'",
        "'speaker_3': 'I thank you very much for your time. And I honored General Patton by sitting down.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_12': 'Good evening, members of Council. My name is Jesse Paris. Black Star Action Movement. Denver Homicide Law and also 2019. Candidate for City Council at large. What we have here seems to be another form of lack of transparency on part of this council.'",
        "'speaker_12': 'And I feel a constituency to know what's going on. It's a shame we have to have public comment to find these things out about what's going on with these metro districts. I don't understand why Arnaud's were not notified prior to this.'",
        "'speaker_12': 'It seems like this very disingenuous way of doing things. I had a few questions. The first one was the property developer says something about upwards of 150 units of affordable housing. I wanted to know what was the AMA level on that and also who was going to be occupying these units?'",
        "'speaker_12': 'Because we have widespread gentrification going on all throughout the city. So my question is, what are the members of this council going to do about the homeless crisis that we have in this city and a lack of not affordable but obtainable housing?'",
        "'speaker_12': 'We need to change the narrative because it's not affordable. Affordable for who? We need attainable housing. We need assessable housing. Yes, I know you approved the $150 million to the affordable housing fund, but that's still not enough because it's not affordable.'",
        "'speaker_12': 'It only is going to matter if the housing is affordable and obtainable and obsessive. And you keep screaming that you're for an inclusive city, but yet you're displacing people of color, black and brown people all over this city.'",
        "'speaker_12': 'It's very disingenuous and we're tired of it. So, like my elder said, we have more people coming. It's time to drain the swamp, if you will, and put some fresh blood in that actually has the concerns and listens to the concerns of the citizens of the city.'",
        "'speaker_12': 'Long term citizens of the city, not the transplants that just moved in here recently, the past five, ten years, but the people that have been here for over 20, 30, 40 plus years, whole generations that are being displaced right now as I speak.'",
        "'speaker_12': 'So with that being said, I am against this until I can get full clarification on what is the army level for these 100 plus units that were proposed to be developed. And also clarification to these Arnaud's that this will not be happening anymore and they will be notified whenever there is a metropolitan district being set up in'",
        "'speaker_12': 'their neighborhoods. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council? Councilman Cashman.'",
        "'speaker_1': 'Yeah. Andrew, do you ever if you'd step up, please. Would you explain? So the developer has a rezoning request and it'll be coming before a planning board later this month and the council in the next couple of months after that.'",
        "'speaker_1': 'They've got a turf request in. Why is the Metro District proposed at this point?'",
        "'speaker_11': 'Sure. That's a really good question. Comes to timing. And interestingly enough, the right now, the reason we're seeing so many metropolitan districts coming through city council is there's a TABOR election in November. And so metropolitan districts can go to every TABOR election to get their levies authorized and go through the creation process.'",
        "'speaker_11': 'And then there's also every other May is a typical TABOR election for metropolitan districts, but this upcoming 2019 is not. So there's a lot of ones that are may be on the cusp of all their planning activities and all of the typical zoning conversations.'",
        "'speaker_11': 'And so you're seeing a few of them that are a little bit ahead of the curve, if you will, so that they can be prepared with the district once they get through the zoning and tip requirements that don't require TABOR.'",
        "'speaker_1': 'Thank you. Another question, this is just metro districts in general. What is the advantage to the developer of of forming a metro district rather than simply recouping their costs in higher lease rates?'",
        "'speaker_11': 'Sure. What one of the there's a lot of things you can do with a metropolitan district, but primarily at its core function is to do public infrastructure. And those costs, if you can. There's many ways to try and do that financing, as you alluded to.'",
        "'speaker_11': 'And one of those ways is to have with a metro district, have a special tax that's put on top of people's tax bill and you can pay for those upfront costs with the increased taxes. If you don't have that the other way, you've got to pay for those costs one way or another.'",
        "'speaker_11': 'And that would be through higher costs of either selling properties being developed or higher lease rates. So it's a little bit of a trade off of trying to find that sweet spot between increased taxes and a lower cost of property.'",
        "'speaker_1': 'Okay. Since you're up there, I'll ask you this, maybe a question for Ken Trump. I'm just wondering where the turf application process is at this point.'",
        "'speaker_11': 'I don't know that answer, unfortunately, but I do know that they're in conversations. Do you have. Okay. And we just completed a condition study that was completed at the end of August. So Dora's working through the application now in a much more formal, an expedited manner.'",
        "'speaker_1': 'Okay. Thank you. Appreciate that. Are you going to we'll move separately in comments, Mr. President.'",
        "'speaker_0': 'Yes. After we closed the hearing.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Cashman. Seeing no other questions. The public hearing for Council Bill 80 is closed. Comments by members of Council Councilman Cashman.'",
        "'speaker_1': 'Thank you, Mr. President. It is slightly odd to have the the metro district kind of out of sync. I understand why we've been getting this flood and why this is happening. And so I'll be approving this district tonight.'",
        "'speaker_1': 'I wanted to address Mr. Sebring's comments. You know, when when we started public comment before council, my thought was we have 13 people up here doing their best to do a good job and we have 700,000 people in the city and county of Denver.'",
        "'speaker_1': 'And there are probably a bunch of good ideas out there that don't always come from council. And I think that's that's one of them. I see no reason why Metro District shouldn't be added to the list of items that that are referred to are a notification.'",
        "'speaker_1': 'So I'll be carrying that forward from this point. So thank you so much for your comment.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_7': 'Katherine can eat. LOPEZ All right. New Ortega. SUSSMAN Black Brooks. Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_7': 'Gilmore. Herndon. Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please. Because voting announced the results.'"
    ],
    "Service Plan for 2000 Holly Metropolitan District.": [
        "'speaker_5': 'Now, we were missing 112 eyes.'",
        "'speaker_0': '12 eyes, constable. 880 has passed. Councilwoman, will you please put Council 81 on the floor?'",
        "'speaker_5': 'Yes, I move that council bill 18 Dash 881 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved. Can I get a second? It has been moved and seconded. The public hearing for Council Bill 881 is open. May we have the staff report?'",
        "'speaker_11': 'Good evening. I'm Andrew Johnston with the Department of Finance. And here to give you your staff report on Council Bill 1881 series of 2018, which is for an ordinance approving a single service plan for a new metropolitan district supporting redevelopment at the site located at 2000 South Holly Street.'",
        "'speaker_11': 'The district is called 2000 Holly Metropolitan District. The service plan being submitted to City Council approval is on behalf of CR F Holly LLC, pursuant to the requirements of the Special District Act. Sections 30 2-12001 and more particularly 32 Dash 1 to 4.5 of the Colorado Revised Statutes.'",
        "'speaker_11': 'The service plan contains the district's purpose, powers, requirements and financing plan. The district shall be responsible for compliance with the city's municipal code rules, regulations and policy and all other applicable laws. The District shall ensure that the District's public improvements are designed and constructed in accordance with the standards and specifications of the city and other governmental entities'",
        "'speaker_11': 'having jurisdiction. The new Metropolitan District will be responsible for coordinating the financing, acquisition, construction, completion operation and maintenance of all public infrastructure and services within and without the service area, including without limitation street and sidewalk improvements, parking infrastructure, water, storm drainage detention, sanitary sanitary sewer improvements, landscaping, irrigation, public spaces and traffic and safety controls and improvements.'",
        "'speaker_11': 'The new metropolitan district will have the power to raise revenues pursuant to the authorities granted by the Special District Act, including the imposition of up to 50 mills plus rates, fees, tolls and charges for debt and district operations and maintenance.'",
        "'speaker_11': 'Once the district imposes a debt mill levy, the district's operations and maintenance mill levy cannot exceed ten mills. The total estimated cost of the public improvements necessary to serve content contemplated development is approximately $3.8 million. In order for the new Metropolitan District to have the fiscal wherewithal to provide the funding for the upfront costs of the public'",
        "'speaker_11': 'improvements needed in the service area, the new metropolitan district shall have the ability to issue debt and impose a debt mill levy to provide funding for the upfront infrastructure costs. At this time, 2000 South Hadley site is not currently located in a urban renewal area, and a developer is not seeking authorization from the Denver Urban Renewal Authority'",
        "'speaker_11': 'to use tax increment financing. At completion of the current completion. The current plan projects the residential and commercial mixed use development to include approximately 140 to 180 for sale residential units and either 40 to 60 affordable senior housing apartments or 5000 square feet of commercial space.'",
        "'speaker_11': 'Approval of the service plan establishes the following There is sufficient and sufficient existing and projected need for organized service in the area. The existing service in the area is inadequate for president projected needs. The district and the districts.'",
        "'speaker_11': 'The district is capable of economically providing sufficient service to the area within the proposed boundaries. The land and proposed development to be included does and will have the financial ability to discharge the proposed indebtedness on a reasonable basis.'",
        "'speaker_11': 'And the facility and service standards will be compatible with the service and facility standards of the city. Staff recommends approval of the service plans. The applicant, their representatives and city staff are here tonight to respond to any questions regarding this bill.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_0': 'Thank you. Mr. Johnston, you've been down here a lot. Thank you for all your good work. I do fear that at the end of the year and our council awards ceremony, you're not going to fare well in the best PowerPoint presentation category.'",
        "'speaker_0': 'But we do appreciate all the work that you put in and thank you for that presentation. We have five individuals signed up to speak this evening. I think you're probably all sitting right here in the front already. But if you're not, come on up.'",
        "'speaker_0': 'First up, Kristin Baer.'",
        "'speaker_7': 'Good evening.'",
        "'speaker_5': 'Again, Kristin Baer.'",
        "'speaker_7': 'With the law firm of White Bear Brinkley.'",
        "'speaker_5': 'Tanaka and Waldron. And again, we represent the petitioners in this matter. I am.'",
        "'speaker_7': 'Wholeheartedly for the passage of this.'",
        "'speaker_5': 'Bill and would welcome any questions you might have regarding the service plan of the districts. Thank you.'",
        "'speaker_0': 'Thank you very much. Next up, Chris Scardino.'",
        "'speaker_11': 'I'm Crispus Guardian with the control group. I represent the applicant. And again, we're in support of putting this matter district in place. And I'm here for any questions that I can answer.'",
        "'speaker_0': 'Thank you very much, Sam Sharp. Sam Schaap with D.A..'",
        "'speaker_2': 'Davidson and Company. You are the financial.'",
        "'speaker_1': 'Consultant to the applicant here for questions.'",
        "'speaker_0': 'Thank you very much. Chairman Secret.'",
        "'speaker_3': 'Yes. Chairman Sekou likes saw some movement self-defense as a group of poor working poor homeless people. Senior citizens. Students. Again. We. Support. This metropolitan district. Thinking about. What's right about it as opposed to what's wrong about it and what's wrong about it.'",
        "'speaker_3': 'Councilman Guzman has committed himself. Mr. Sekou.'",
        "'speaker_0': 'Thank you for your. If you could just refer to the. Our expectations refer to the council as a whole not to individual council members. Think you can please continue.'",
        "'speaker_3': 'Okay. I can use a name as I would.'",
        "'speaker_0': 'You can just address us as a body instead of picking out individual members. Thank you.'",
        "'speaker_3': 'All right. So. Strike that. So what's right about this thing is that it can be. And it shall be. To. For the development of the city and the neighborhoods. And when we have. Folks who are willing to step up to invest.'",
        "'speaker_3': 'In the city and especially on this one, where they coming out their pocket, they're not asking for the financing and and getting folks caught up in future debt and they see the possibilities of them. Making a contribution to the city and in the process they get something out of this too.'",
        "'speaker_3': 'It's a win win thing. It's a win win thing. Now, the caveat is not why are we doing it, but how we do it, how we do it. And if we apply the standard of. The greatness and goodness of the possibilities that can happen with it, with our actual behavior in doing what we say we going to'",
        "'speaker_3': 'do. Then this is a good thing, especially for poor, working, poor and homeless people, because there's a lot of jobs in this part of jobs in this city's bangin jobs. And I just came from the gemstone show after the Coliseum.'",
        "'speaker_1': 'Oh, man. Big.'",
        "'speaker_3': 'Great. When I saw people at stops and they were doing construction, there were no black workers there. Now what?'",
        "'speaker_5': 'Like, how could you do this?'",
        "'speaker_1': 'How could you have all this going on? Ain't no black folk working.'",
        "'speaker_3': 'And we got black folk on the council. Come on, now. Talk to me. So saying one thing out, one side to mouth and then doing something else. And that's not critical. That's just the way things have been going.'",
        "'speaker_1': 'On.'",
        "'speaker_3': 'And on and on with no one having the courage to stand up and do it because they don't want to risk their careers, their political associations, their friend, whoever they've been hanging out with for the last something died before they got up in here.'",
        "'speaker_0': 'Sherman Sager, again, thank you so much for speaking. As far follow our expectations state to the topic that we're discussing. And again, number three is no remarks about council members personality, appearance or perceived motives.'",
        "'speaker_3': 'Did you change some rules? I didn't. Is this supposed to be read out loud so we understand this thing?'",
        "'speaker_0': 'Those are just our expectations. Same rules we've always had while.'",
        "'speaker_3': 'We come up here. No, I didn't know this is for this. And you didn't even explain this suggestion before you had the conversation.'",
        "'speaker_0': 'These have always been our rules. Your time is ticking.'",
        "'speaker_3': 'So people will know what is about to win is up here. We can follow rules.'",
        "'speaker_0': 'My chairman said. What do you have? Do you have any comments?'",
        "'speaker_3': 'Study and ask, Is it okay if I take this with me so I can read this? The first time I ever seen this in 12 years, it's sitting up here.'",
        "'speaker_0': 'Thank you very much. Next up, Jesse Pierce.'",
        "'speaker_1': 'It was.'",
        "'speaker_12': 'Yeah. Jesse Paris. Denver Homicide. Low Black Star Action. War for Self-defense. So the Council at Large Candidate 2019 August stated previously The way these metro districts are operating and the way council is working with them is very disingenuous and a disservice to the people.'",
        "'speaker_12': 'That you are supposed to be representing. This just seems like another way of masking the widespread gentrification that's going on in the city. Gentrification, just a nice way of saying ethnic cleansing. The city is becoming where it wants to be once again.'",
        "'speaker_12': 'White only exclusive, but under the inclusion of inclusion. There's nothing inclusive about any of this stuff, especially if you're not being transparent with the citizens of this city. We find this very faulty. And once again, I am against this.'",
        "'speaker_12': 'If you do not disclose this information to the Arnolds. If you are not disclosing this information to the public, we need to know these things. So with that being said, I'm against this. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there questions from members of council? Councilman Ortega.'",
        "'speaker_9': 'I just want to clarify whether or not this particular application is going to either need or be requesting tax increment financing. Can someone from the team address that?'",
        "'speaker_11': 'Not on this site.'",
        "'speaker_9': 'Okay. Just the other one. Yep. And then Andrew wanted to ask you a question about the legislation that creates metro districts is very, very clear and very prescriptive. But I don't remember seeing anything in there that would preclude local government from being able to require notification.'",
        "'speaker_9': 'So can you just speak to that? I know Councilman Cashman said that he would intend to bring that forward. I think that's a reasonable request on all of these. And I'm sure that the community was notified this was part of the process during the public meetings that were being held.'",
        "'speaker_9': 'And I know there were a number of them with the community, but can you just speak to that?'",
        "'speaker_11': 'Absolutely. There. You're right. There have been a number of community meetings about the development on both the Holly and the Arkansas side with a lot of involvement there. But when it comes to the actual legal requirements in the Colorado Revised Statutes, it is very prescriptive.'",
        "'speaker_11': 'And it does say that it's only to all the taxing entities within a three mile radius of the proposed district site. But there's nothing precluding the ability of of going the extra mile and including our in-house.'",
        "'speaker_1': 'Great.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega. Councilwoman Sussman.'",
        "'speaker_5': 'Thank you, Mr. President. This is just a small item, but I notice that committee and tonight that in the information we have on our agenda and also in the bill that was filed, that the word south is not there in South, Holly, and the word east is not there in Arkansas.'",
        "'speaker_5': 'And I'm just wondering if that's going to result in you're having to refile the bill because those are not the addresses.'",
        "'speaker_11': 'It will not. It's been a confusing thing all along, actually. They chose the name of the metropolitan districts by their legal name, creating them as just 2000 Holly and 4201 Arkansas. But the sites have site directions in their addresses, either being on South Holly or on East Arkansas.'",
        "'speaker_11': 'So but that will not require any new notifications.'",
        "'speaker_5': 'Interesting.'",
        "'speaker_0': 'Thank you. Yes. Thank you, Councilwoman Sussman. Seeing no other questions. The public hearing for Council Bill 881 is closed. Comments by members of Council. Councilman Cashman. Thank you, Mr. President.'",
        "'speaker_1': 'Yeah, for the reasons I mentioned earlier. I will approve this. But with your indulgence, Mr. President, something I neglected to speak about regarding the Arkansas site that I just want to get on the record. Part of the problem I have with taking these things out of order, out of what would seem like a logical order.'",
        "'speaker_1': 'While there's no proscriptive, this must be done in this order to be approving these metro districts. I have concern that there may be some inference of an indication on feelings towards either the TIFF application or the rezoning that will follow.'",
        "'speaker_1': 'And it should be clear that that is not the case. The developer and the city are presently working on a development agreement that we don't know what that looks like yet. We don't know what the outcome of Dora's evaluation of the TIFF request is, so we really have nothing on which to consider either of those items.'",
        "'speaker_1': 'So any comments made tonight, at least from this chair and I suspect from my my colleagues, are simply about the creation of these districts. And I would also say that I'll just reinforce the need to add this to the R.A. ordinance, because I was I think I've been at all but one of the public meetings.'",
        "'speaker_1': 'And if metro districts were mentioned, it certainly was not emphatic enough to stick with me as far as knowledge of that from those meetings. I have been briefed on them, but that's my recollection. Apologies if I missed something in the meeting process.'",
        "'speaker_0': 'Thank you. Councilman Cashman. Councilwoman Black.'",
        "'speaker_5': 'Thank you, Mr. President. I think that's a great idea to let our RINO's know. But just to be clear, these plans really are just a funding mechanism to build infrastructure, which is then turned back over to the city.'",
        "'speaker_5': 'It's just a way to fund those things. It's not a development plan or anything like that. So I just wanted to be clear on what they are and aren't. Okay.'",
        "'speaker_0': 'Thank you, Councilman Black. Seeing no other comments, Madam Secretary. Oh, Councilman Brooks.'",
        "'speaker_8': 'Thank you, Mr. President. I'll be supporting this. I just wanted to chime in on this notification process. I appreciate the effort to make sure the Arnaud's do this. I would say if if it is notified to Arnaud, as I just said in Arnaud.'",
        "'speaker_8': 'Actually, I was at a neighborhood that did not knows a hundred people there and they did not know who their R.A. was. So we need to have a conversation about other folks outside of Arnaud who are in the neighborhood.'",
        "'speaker_8': 'They've been in the neighborhood, but they aren't connected to a specific Arnaud. So I'd love to have a conversation with you, Councilman, on that.'",
        "'speaker_0': 'Thank you. Councilman Brooks, seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_7': 'Cashman. Cannick, I. Lopez All right. New Ortega. SUSSMAN Black Eye.'",
        "'speaker_1': 'Brooks Flynn, I.'",
        "'speaker_7': 'Gilmore, Herndon.'",
        "'speaker_1': 'Hi.'",
        "'speaker_7': 'Mr. President.'"
    ],
    "Rezoning of 12680 East Albrook Drive from S-MX-12 to OS-A.": [
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting and thus results choice. 12 hours, countable. 881 has passed. Councilwoman, can you please be accountable? 791 on the floor.'",
        "'speaker_5': 'Yes, I move that council. Bill 18, does 791 be placed upon final consideration and do pass?'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 791 is open. May we have the staff report?'",
        "'speaker_5': 'Yes. Thank you, Mr. President. Members. Counsel. Good evening. I'm Courtney Livingston. And with me planning and development. I'm here to present on a rezoning for 1260 East Albrecht Drive and Council District eight in the Montebello neighborhood, the size is about five and a half acres, and the proposal is CPD on behalf of Denver Parks and Recreation is'",
        "'speaker_5': 'requesting to rezone the property from as the Max 12 to OSA to align the zoning with city ownership and use as a public park. As I just mentioned, the subject's site is zoned as Max 12. The surrounding properties are as max 12 as well.'",
        "'speaker_5': 'We also have some form of Chapter 59 zoning surrounding the property to the north, R3 to the south, before waivers to the West Bay. You are one you go to. In terms of the existing context for the land use.'",
        "'speaker_5': 'As I said, the park is the property is currently under construction for the open space park. It is showing is currently vacant. But on this map we have various commercial, retail and institutional uses surrounding the property as well as industrial to the south.'",
        "'speaker_5': 'This is showing the property and site photos of the site we have showing it that is under construction currently. And here is photos of the surrounding context. We have Denver Health Building to the west. North, you'll see the multifamily to the east, just general commercial, retail to the south, industrial warehouses and to the west.'",
        "'speaker_5': 'You have an extended detention base and that is serving flows from the industrial warehouses to the south. The proposal is to rezone the property to OSA. The OSA district is open space public parks district. It's specifically intended for parks and open spaces owned, operated or maintained by the city and county of Denver.'",
        "'speaker_5': 'In terms of the process. We had our public planning board hearing on July 11th and it was unanimously approved. Lee was on July 31st. In terms of public comment, we had a letter of support from Montebello 2020, the registered neighborhood organization.'",
        "'speaker_5': 'Three additional letters of support from various organizations in the area. We also received a timeline and update of the Mount Belo Open Space Partnership, an acquisition that is in your packet. And so we'll go through a step through the criteria for approving a rezoning.'",
        "'speaker_5': 'First one consistency with adopted plans. There are four adopted plans that apply to this rezoning the comprehensive plan Denver Parks and Recreation Game Plan Blueprint. Denver and the Montebello. Green Valley Ranch Neighborhood Plan. For the comprehensive plan. The request is consistent with several comprehensive plans strategies for use as parks and open space.'",
        "'speaker_5': 'And we also have the game plan and the request is consistent with several of the game plan policies as well as the OCA district will allow for greater flexibility to support the partnership with Environmental Learning for Kids. And with Blueprint Denver, the concept land use is town center and the ozone district supports the town center land use'",
        "'speaker_5': 'by better integrating a park into the town center. And it is an area of stability. And the goal for area stability is to allow some change in development. The proposed MAP amendment to OSA creates a better alignment between the use and the zoning, and both of those are consistent with Blueprint Denver.'",
        "'speaker_5': 'With the Montpellier Green Valley Ranch Neighborhood Plan from 1991. It contains various policies supporting community services, parks and open space uses. The proposed rezoning is consistent with the My fellow GBR plan, and the plan has various policies that support those open space uses.'",
        "'speaker_5': 'So we'll look at the other review criteria two through five. The rezoning will result in uniform application of the OSA district regulations across the site. It furthers public health, self safety and welfare as it furthers adopted plans. The justifying circumstances.'",
        "'speaker_5': 'The change in the area is that the city has property has been conveyed to the city transfer city. There is an approved site development plan already on the property under the Max 12 in the construction of the Montebello Open Space Park is already underway.'",
        "'speaker_5': 'It is consistent with the neighborhood context and zoned district purposes. Ten. As I mentioned, it's the open space context. That context is specifically for to support various active passive recreational uses. And also the OSA Zone District is specifically the A is specifically for parks owned operating or maintained by the city and county and Denver, which this is'",
        "'speaker_5': '. So in conclusions, committee planning and development recommends approval of the application based on finding. All review criteria have been met. Thank you. That concludes my presentation.'",
        "'speaker_0': 'Thank you very much. We have four individuals signed up to speak this evening. So if you signed up to speak on this one, if you could make your way to the front bench there and I'll call you up in order.'",
        "'speaker_0': 'And again, your time will start as soon as your name is called and you reach the podium. First up, Loretta Pineda.'",
        "'speaker_5': 'Good evening. Welcome. My name is Loretta Pineda, and I'm the executive director for Environmental Learning for Kids, and I'm here to answer any questions you might have.'",
        "'speaker_0': 'Thank you very much. Next up, Mark Taber. Good evening. I'm Mark Taber with Parks and Recreation. And we wholeheartedly support not only this zoning change but also.'",
        "'speaker_1': 'The use as it is being developed right now is.'",
        "'speaker_0': 'Open space park and an environmental education center. I'll be happy to answer any questions you have. Thank you very much. Next up, Chairman Sekou.'",
        "'speaker_3': 'Chairman Zuku doesn't need to say all that other stuff or just get started.'",
        "'speaker_0': 'You can just get started. Okay, good.'",
        "'speaker_3': 'All right. First of all, thanks. I missed class. I was gone. Thank you for the instruction. I will be no public perception that he was interrupting me being rude, but that wouldn't have meant I wasn't having it all.'",
        "'speaker_3': 'It was just informing me how it was working. I didn't know. And I thank you for your courtesy of helping me out with that in the hallway. So, Mr. President. We support this. His only change. Because it's consistent with what's going on with the development out there now, with massive projects going up and buildings going up in'",
        "'speaker_3': 'the air. Folks. From here. This used to be in in this neighborhood. And I grew up in this neighborhood. We need some air, man. We need some space. And we need some brass for the kids somewhere to go play.'",
        "'speaker_3': 'And a safe place environment and a good place to go walking around, you know, exercising and stuff like that, feeling at home. You know, healthy physical fitness, mental wellness and. Spirit of lifting space. Space. This is the wild, wild west.'",
        "'speaker_3': 'We need space, space, space. Now, we have an issue, though, in that public safety. Protection of folks walking around so they can feel safe. And I'll give you an example. As businesses growing and a development a city and people coming in from other areas of the country.'",
        "'speaker_3': 'We're also attracting that which is so good. Say That ain't so good. And then the to the police about incidents that happens to people in the neighborhood of little. Example is candidate run for city council just attacked in West Side.'",
        "'speaker_3': 'At a train station with his bus on there. And the police did like what? But if that had been you, you, you, any of the body could have been in the papers due to due to investigation. All that ain't nothing happened.'",
        "'speaker_3': 'It was like. Oh, well. How am I going to feel safe now? I'm going to say. And I'm running for elected official, and I'm a good guy. Can't walk from a train station home without getting attacked because his bike is a trigger for folks who want to steal it.'",
        "'speaker_3': 'That ain't from here. And that's one of the things we have to protect against, because as we attract all of this, we track in good will, tracked and bad. We've tracked an ugly. And this thing could easily become real interesting and unmanageable.'",
        "'speaker_3': 'Like the city of Chicago. We have to be careful about how we go about doing all this. But those open spaces must be sacred. They've got to be sacred. If we don't protect nothing else, where there's playgrounds and kids and senior citizens come in there and people jogging around the park and just relaxing so they can get'",
        "'speaker_3': 'ready for the grind to Monday. That's got to be sacred space, not just open space sacred. And so as we go about doing this thing, think about the police protection that's got to be included in the plan. How much money are we going to need here?'",
        "'speaker_3': 'We're going to need here to manage this here without being obtrusive. So don't look like it's no armed camp. But you're going to need to add that to this idea because we're growing way too fast with resources trying to catch up.'",
        "'speaker_3': 'The development is pushing us as opposed to us. Pushing to develop. So we caught up. So we got so this thing down. And then suddenly we got speed this thing up and as we slow it down for stability so we can keep going, we got to protect territory.'",
        "'speaker_3': 'We got to protect the land. We got to protect, first of all, the children, the women. Senior citizens. The ones that are most vulnerable to these outside elements. So. I say that I didn't break the rules. No, that's okay.'",
        "'speaker_3': 'I had to do all that.'",
        "'speaker_0': 'Did great.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Thank you. Thank you. Next up, Jesse Paris.'",
        "'speaker_12': 'Good evening. Jesse Paris Blackstar. Some Movement. Denver Homeless out loud. Candidate for City Councilor at Large 2019. I have mixed feelings about this. On the one hand, it seems like a good idea on the surface to put a open space park where there used to be a park and ride use service people of Northeast Denver, which was'",
        "'speaker_12': 'torn down. And now people in northeast Denver have to go all the way to 40th and Peoria to catch the train to get to downtown Denver, opposed to having to go to the Montebello Park, a ride where this site is located.'",
        "'speaker_12': 'My whole thing is we don't need any more permanent patties and barbecue. Becky, is this predominately black and brown neighborhood? If you put a park here, what is going to stop these transplants, these gentrifiers, these newbies from calling the police on people for just simply barbecuing in the park, simply having a get together in a park?'",
        "'speaker_12': 'That is my concern. So if I also I want to know what it's all going to be here is it's going to be a park. Is it going to be a garden with what is all this? And tell me.'",
        "'speaker_12': 'So if I get some clarification on, I greatly appreciate it. All right. Thank you.'",
        "'speaker_0': 'Thank you very much. That concludes our speakers. Are there any questions from members of council councilwoman? Can each.'",
        "'speaker_5': 'Thank you. Mr. President, I just had a quick question, and I just had never caught this before. And maybe it's because this is one of our first of several partnerships the is doing. But you mentioned it was a city owned, operated and maintained.'",
        "'speaker_5': 'But I actually think that the agreement with the environmental learning for kids has them doing some maintenance and maintaining of this. And so I just want to clarify that everything is okay with the zone district that you don't have to have city all three of those being done by the city.'",
        "'speaker_5': 'Just can you clarify to me I just want make sure that we're good with the arrangement we have and the zoning. Yeah, you can definitely you can be owned but maintain there's many different OSA zone properties that are owned by the city, yet maintained or leased to a different entity.'",
        "'speaker_5': 'Okay, got it. So note no incompatibility. All right. Thank you.'",
        "'speaker_0': 'Thank you, councilwoman. Can each councilwoman or it.'",
        "'speaker_9': 'So I was just trying to understand if it was elk that was the applicant or if it was the city of Denver that was the applicant. And I was trying to look through these documents and that wasn't real clear.'",
        "'speaker_5': 'Right. So the city and county in Denver is the applicant. So community planning and development, the department, we are the applicant on behalf of Denver Parks and Recreation as they have the partnership formerly without. Okay.'",
        "'speaker_9': 'And how much of the land actually. So it's my understanding there's a structure being built on the site that it's not all just open space, is that correct?'",
        "'speaker_5': 'Currently, and that's in the phase two. The site development plan has phase one and phase two on the property. Phase one is the open space park and phase two would be the the Environmental Learning Center.'",
        "'speaker_9': 'So is there any limitation that Parks and Rec has for how much? Structure can be on their parks.'",
        "'speaker_5': 'So that would be with the ozone zone district. It is up to the executive director, Happy Haines, and I believe it is 2500 square feet before it has to go to city council for additional approval.'",
        "'speaker_9': 'Do we know the size of the building that's proposed for the building for that site?'",
        "'speaker_5': 'I'm not 100% sure. So I'll let Loretta answer that question. Thank you. Council on Woman Ortega. Right now, the building will be 7800 square feet. That's the plan. So if there's some other process we need to go to.'",
        "'speaker_5': 'Well, we'll have to see. Okay, we do that.'",
        "'speaker_9': 'But you don't propose. I mean, I know you're probably just raising the money to build that right now. So do you propose it any time in the future that it would grow or it's really intended to use the building to then interface with the park?'",
        "'speaker_5': 'Right. Yeah. The open space, it's one acre is dedicated to the building and the 4.5 acres are dedicated to open space. So with that much open space, hopefully we can still.'",
        "'speaker_9': 'That's a helpful explanation because that that wasn't clear from looking at the information that was provided to us. Okay. I think those are all the questions I have. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega, Councilwoman Gilmore.'",
        "'speaker_5': 'Thank you, President Clark. Courtney, could you go to Slide eight on the presentation? I just want to make sure it's clear that this has always been, you know what, I might be on the wrong slide. It's the slide that has.'",
        "'speaker_5': 'Yep. That one right there. The previous one. And this one for the Nets. Yeah, that one right there. So this has always been raw, undeveloped land, correct? That's my understanding, yes. And so the park and ride that was referenced is actually to the west of this parcel of land.'",
        "'speaker_5': 'And so this isn't on the current RTD park and ride that has been vacated. Now, the RTD is that concrete, you know, to the north, I guess would be northwest. So you see the corner of Peoria and Walbrook, it would be just to the east of that that concrete area.'",
        "'speaker_5': 'That's the park and ride. Okay. All right. Great. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. Seeing no other questions. The public hearing for Council Bill 791 is closed. Comments by members of Council. Councilman Herndon.'",
        "'speaker_1': 'Thank you, Mr. President. I don't think Councilman Gilmore, she took my first point.'",
        "'speaker_2': 'This is not where the parking ride is going.'",
        "'speaker_1': 'I was going to make that correction. Thank you for that. This is a no brainer. I'm a huge.'",
        "'speaker_2': 'Fan of what environmental learning for kids has been doing under your leadership. Thank you for that. And of course, we have to give.'",
        "'speaker_1': 'Huge.'",
        "'speaker_2': 'Kudos to your predecessor who created environmental learning for kids. So I will.'",
        "'speaker_1': 'Look to.'",
        "'speaker_2': 'My left and look for my colleague, Councilwoman Gilmore.'",
        "'speaker_1': 'Thank you for that, for educating our youth. And so I welcome anyone to come out to this space once it is done to learn about our environment and how important it is no matter where you live, because anyone could benefit from that knowledge.'",
        "'speaker_1': 'So I want to thank you for your.'",
        "'speaker_2': 'Leadership as we move forward. Best of luck as you continue to fundraise.'",
        "'speaker_8': 'For this cause. I know they were still still working to get to our total goal, but I certainly hope my colleagues will support this because this is a great cause for the Marbella community and beyond.'",
        "'speaker_0': 'Thank you, Mr. President. Thank you. Councilman Herndon. Councilman Brooks.'",
        "'speaker_8': 'Yeah, thank you, Mr. President. A couple of things. One, I'll be supporting this because it is in conjunction with the criteria we need to approve rezonings. This falls right in line with that. So I'll be supporting it to environmental learning for kids.'",
        "'speaker_8': 'You know, I think it really touches the kids of the neighborhood, which I appreciate. And so to get kids of color in the neighborhood, connect it with the environment is huge. So I just really appreciate you all doing that.'",
        "'speaker_8': 'And three, 18 years ago, I lived at our Brook Apartments on our brook. And so this is like really exciting to see this area getting so much attention. And so thank you all for your hard work on this.'",
        "'speaker_8': 'I think the city to for for really parks and rec for being proactive on on doing open space in the city. I think it's a critical time. I think we're going to look back on this time and say if we hadn't had done this and increased our acreage of open space in the city, we would not have'",
        "'speaker_8': 'had such incredible greens in our city. So thank you for all your hard work.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilwoman.'",
        "'speaker_5': 'Thank you, Mr. President. I also agree that the criteria have been met, and we'll be happy to support this rezoning today. I just wanted to share my recollection of getting toured this site back in, I think it was 2014 and it was, you know, at that point we were just doing an, you know, tour, just just the'",
        "'speaker_5': 'two of us. And there, sure enough, was a totally unscheduled school class that was going around and comparing weeds to native plants and just, you know, as high school students. I don't remember if they were from Montebello, Ohio, where they were from.'",
        "'speaker_5': 'But anyway, so so this community was already trying to interact with this space and create an open space. I mean, sometimes it's like when you let the community use a space, you can they'll tell you what it's going to be.'",
        "'speaker_5': 'And so and then I juxtapose that with doing neighborhood night out at the Albrecht apartments where what they do is they empty out the parking lot for neighborhood night out. And it is just so many children. You can see all of them playing and you just imagine that most of the time they can't do that because their'",
        "'speaker_5': 'cars parked there. And so just the proximity of it to, you know, some really much needed high density housing but without, you know, that big open space to play, I just think that the synergy is you couldn't imagine a better kind of way to make use of urban infill to do a park.'",
        "'speaker_5': 'So and just lastly, having had a few years of experience converting a place into open space, we have no idea how much where Councilman Gilmore and the new leadership and Parks has done to get here. So it's just exciting to see a vote on this.'",
        "'speaker_5': 'We've had a couple other little midges come through, but this one's a big one. So congratulations to everybody who's worked on it for all these years because it's it's it's more than this slide show could ever tell us.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_0': 'Thank you, Councilwoman Kennedy. Councilwoman Gilmore.'",
        "'speaker_5': 'Thank you, President Clark. I was kind of reviewing the history of this site and my work on it, and we started this conversation in 2006. My daughter is 14 years old and just started high school. She was two years old when we started.'",
        "'speaker_5': 'Working on this project. And so from that standpoint, you know, having founded Environmental Learning for Kids, we had all of our community meetings in our home in Mount Bello.'",
        "'speaker_9': 'And when we.'",
        "'speaker_5': 'Ran out of space in our backyard and we couldn't fit 75 people in our backyard to do leadership programs and education for young people in their families. The kids and the families in Elk said, Why don't we have a place in the community so that we have a home, we have the Gilmore House, but that's not our'",
        "'speaker_5': 'home. We want this in the community for us. And so after 12 years in the making of robust community outreach, engagement, education, advocacy, it's nice to see us finally get here to rezone it because the schematic that's up there, there's a 7-Eleven to one corner, and we had a social path that ran through this property that went'",
        "'speaker_5': 'right from the 7-Eleven car wash, straight over to a marijuana store and a payday loans and a liquor store. So we had people.'",
        "'speaker_9': 'Utilizing.'",
        "'speaker_5': 'The property. But to break that up and to create an education zone, an open space, a park is something that has definitely been a labor of love and happy to support this tonight and see where it might go forward.'",
        "'speaker_5': 'So thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. Councilman Nu, I just want to support two is going to be a wonderful educational facility for kids. I just can't wait to see it happen. It's really exciting and thank you and all of the supporters.'",
        "'speaker_0': 'And I especially want to thank one of my constituents and Bennett, who's been a real active supporter of this program. And so she she's just as party or more as passionate about this as she was helping me with the minority or weirdness legislation we had earlier did it earlier than last year.'",
        "'speaker_0': 'So graduation is what you're doing and it's going to be a wonderful facility. And thank you for all your leadership in what you're doing. Thank you. Thank you, Councilman. Using no other comments, I'll just end with that. I'm happy to support this.'",
        "'speaker_0': 'Thank you for the great presentation showing how it meets the criteria for rezoning. Outside of that, it's really exciting to see something come forward to change the zoning that this will be a permanent addition to our public park system and our public spaces.'",
        "'speaker_0': 'Thank you to parks. But on top of that, it's not just a park in a community. This is a park that that was built by the community. And having spent my entire career working in environmental education, health is the gold standard for working in this community, specifically working with kids and with youth, and doing the critical work'",
        "'speaker_0': 'that is connecting communities of color, kids of color to careers in wildlife, biology and natural resources. I mean, it's the it's the measuring stick that every other nonprofit that is working in this space is working towards. And so to see all of that come together where you have just this gold standard of a nonprofit partner and you'",
        "'speaker_0': 'have a piece of property that is vacant and underutilized and a place where we can build a park and have that nonprofit immediately activate it and just take the work, the great work that they're doing to the next level in a way that the city could never do on our own, never bring that level of expertize, that'",
        "'speaker_0': 'level of engagement. It's it's really exciting to see and I'm thrilled to be able to support this tonight. Thank you to our current leadership and past leadership. Very exciting day and excited to vote yes for this one. So with that, Madam Secretary, roll call.'",
        "'speaker_7': 'Herndon. I can eat. Lopez. I knew Ortega. Sussman Black. Brooks.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Flynn, I.'",
        "'speaker_7': 'Gillmor, i. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting. Announce the results. 1212 hours council bill 791 has passed. On Monday, September 17, the Council will hold a required public hearing on council will eight five approving the service plan for the creation of the Denver Rockdale Metro Metropolitan District and a required public hearing on Council Bill 944 approving the service plans'"
    ]
}