{
    "Contract Approval for Pea Boulevard Design and Construction Services at Denver International Airport.": [
        "'speaker_0': 'Nothing has been called out under Bill's on final consideration, though, items have been called out and under pending. No items have been called out. And I miss anything. All right, Madam Secretary, if you please put the first items up on our screens.'",
        "'speaker_0': 'Councilman Hines, you've called out Resolution 586. What would you like us to do with this resolution?'",
        "'speaker_5': 'Thank you, Mr. President. I would like to call out 586 for a separate vote.'",
        "'speaker_0': 'Thank you, Councilman Hines. Councilwoman Black, would you please put Resolution 586 on the floor for adoption?'",
        "'speaker_1': 'I move that Resolution 586 be adopted.'",
        "'speaker_0': 'It has been moved and seconded questions or comments by members of council. Councilman Hines.'",
        "'speaker_5': 'Thank you, Mr. President. I also want to I want to thank the airport. So we just as you may know, we just got inaugurated today and and then we had photos and then we had lunch and then we had more photos.'",
        "'speaker_5': 'And I want to thank the airport for all the work that you have done to educate us on this issue that we have to vote on right now. And and it's kind of a difficult, difficult position for the for the new folks to immediately be here and and and and guide policy.'",
        "'speaker_5': 'But I believe that the reason we're here tonight is because the voters asked us to lead. And and so we're we were elected to serve four years. So here we are. I think all my questions have already been answered in the back and in the back and forth of through email and in person communication.'",
        "'speaker_5': 'So I'm happy to make a statement. Or should I make. Should I wait until other people have questions that they may want to ask the airport?'",
        "'speaker_0': 'We're doing questions and comments, so you're free to do other. Let me do a quick check in. Councilman Flynn and Councilman Cashman. Do you have comments or questions? A question, if you don't mind, Councilman Hines, I'll go to Cashman first since he has some questions.'",
        "'speaker_5': 'Don't mind.'",
        "'speaker_0': 'Thank you very much, Councilman Cashman.'",
        "'speaker_6': 'Yes, thank you, Mr. President. And I do have a couple of questions, some of which we went over last week, but I think they're pertinent for our new members. So one thing new that came before me this week is concerns expressed that there are a lot of employees at the airport that are kind of hamstrung by no'",
        "'speaker_6': 'or very little help with transportation to the airport. They end up having to park and lodge far from from their job site and are looking for more help. Is the airport doing anything along those lines?'",
        "'speaker_1': 'Sure. So at the airport, in addition to the city employees at the airport, there are 44 employers that offer Igo passes to their employees. That being said, that's the cost of an eco pass is a large burden for either an employer or that individual to bear coming out to the airport.'",
        "'speaker_1': 'So we as a team have been working in partnership with Dr. COG on implementing their way to go program more comprehensively out at the airport. What their way to go program does is they have a partnership with Enterprise Rent, a car that provides large 15 person vans, pays for the insurance, pays for the gas.'",
        "'speaker_1': 'And all you have to do is have one dedicated driver that commits to driving the car for the team. And that program is about $20 a month that could either be paid by the employee themselves or subsidized by the employer.'",
        "'speaker_1': 'And we think doing an analysis, we've run the zip codes of every employee working at the airport. And we think that's one step that will help a lot of folks that are either not located near transit or have, you know, economic barriers to using for, for example, the airline.'",
        "'speaker_1': 'So that's that's one example of what we're working on. We're also working with RTD to see what we can do to reduce some of those costs for specifically employees who are trying to get out to the airport each day.'",
        "'speaker_6': 'Do you have any clue, Rachel, as to how many employees are taking advantage of these programs or on their own or taking mass transit as opposed to how many are driving their own vehicles?'",
        "'speaker_1': 'I don't have the exact data in terms of employees that are using these programs. There's sort of a mix. I have data on how many people are coming through, either on the airline or RTD or some of these Vanderpool programs.'",
        "'speaker_1': 'But we don't differentiate. I don't or I don't have the data on which are employees and which are travelers. That being said, one of the things we're working on, we've partnered with RTG and Dr. COG, and they're coming both to the all city employee picnic and the all airport employee picnic with a brief survey to try and'",
        "'speaker_1': 'understand those demographics a little better so that we can target transportation solutions specific by the type of work you're doing out at the airport, what shifts you may have when you're arriving, when you're leaving, and what mode of transportation you're using now, and why you might not be choosing some of the multi-modal alternatives that we offer.'",
        "'speaker_6': 'Okay. One more question, Mr. President. Last week, and we had a rather lengthy discussion on this bill. And one of the things that was talked about was the airport had made a commitment to start a structured conversation with the Denver Park Streets Partnership over one of our larger advocacy groups pushing for multimodal solutions and reduction of single'",
        "'speaker_6': 'person auto traffic. Has anything happened yet in that regard?'",
        "'speaker_1': 'Yes. So in addition to sending some follow up information to those folks, we were able to collect a little bit more data than we had at the ready Monday evening. So we sent along that information and we have scheduled an initial meeting with them for the first week of August with ten representatives, leadership and the Streets Partnership'",
        "'speaker_1': 'Organization.'",
        "'speaker_6': 'Okay. Thank you. That's for Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Oh, I see. Councilman Ortega, do you have questions or comments?'",
        "'speaker_4': 'It's a request.'",
        "'speaker_0': 'A request.'",
        "'speaker_4': 'Just.'",
        "'speaker_0': 'To do that before we get into comments here. Okay. Go ahead.'",
        "'speaker_4': 'So we also have the Northeast Denver Transportation Connection entity that works in Montello, the G.S. neighborhood. So those neighborhoods along that I-70 corridor. And I would just encourage that when you have that meeting that they be included as well, because they are the team for that corridor, that that quadrant of the city, so that we're making sure'",
        "'speaker_4': 'that we've got inclusiveness as part of the conversation, because they work very closely with these grassroots low income communities.'",
        "'speaker_1': 'Absolutely. That's very helpful to know. And like I said last week, we're always interested in the more intelligent people we have around the table, the more likely we are to come up with solutions to these complex issues.'",
        "'speaker_4': 'And I just want to acknowledge that we also have our TDI board member, Ingeborg Petit, who is in the audience, and she happens to be the director of ETSI. She's in the back row, so make sure you to get connected to exchange cards.'",
        "'speaker_1': 'Thank you. Perfect. Thank you, Councilwoman.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. All right, Councilman Hines, you go ahead with your comment.'",
        "'speaker_5': 'Thank you. So, again, thank you to the airport for all the work you've done and all the stakeholder engagement and and member engagement for us. It's my first day. It is. I believe it's our job in government to shape Denver's future.'",
        "'speaker_5': 'In this situation, we have an opportunity to shape the future of a region instead of just the city and county of Denver, because of the strength and importance that that the airport has. I'm really concerned about our planet.'",
        "'speaker_5': 'Climate change is real. And we need to make. We need to take steps. We need to take immediate, bold steps to to make sure that we take care of our planet. And actually, it's not our planet that's going away.'",
        "'speaker_5': 'It's our habitability on the planet that is at risk. And increasing lanes and allowing more single occupant vehicles, I don't believe is the right answer for us as we shape the future. The second thing, in addition to the planet, is multimodal transit.'",
        "'speaker_5': 'So I ran a lot. I'm one of my primary platform ideas was on the planet and climate change. The second was on multimodal transit. We're expecting an additional 200,000 people to move to Denver, the city of Denver by 2040.'",
        "'speaker_5': 'And while we might be able to extend lanes on Penna, we can't widen six or eight. And and we want I believe we should encourage people in the city of Denver and beyond, but in particular, District ten, to try to have alternatives to cars.'",
        "'speaker_5': 'And so I'm a little concerned about feeding the traffic monster and having more more lanes. I also have a concern about citizen engagement. And the airport was in our back and forth over the weekend. And today has helped allay some of those fears.'",
        "'speaker_5': 'And and as I understand, there was a robust conversation with Dr. COG. And but I also want to make sure that we have conversations. We have the northeast area plan that was just adopted. I didn't see Penny in it, but but thank you for sharing with me that that Penny was specifically called out in the Dr. COG'",
        "'speaker_5': 'plan. So I just want to make sure that if we have public funds, it should have public accountability. And I recognize that the airport is a little different than other areas of the city. I also recognize that the airport has a different kind of focus than than many areas of the city.'",
        "'speaker_5': 'As far as specific neighborhood engagement and. And that really puts me in a tough spot with having being inaugurated and then immediately having to make a decision. So. Should I tell you how I'm going to vote?'",
        "'speaker_0': 'That you are more than welcome to or not.'",
        "'speaker_5': 'So I will. I. I intend. Just as I. As I'm fighting for increased citizen engagement. I think it would be remiss of me to make a decision tonight with the short time frame. And and so I will likely abstain because it would be hypocritical of me to say we need to the airport needs to engage the community'",
        "'speaker_5': ', but then me not have a meaningful engagement with the airport. So I will likely abstain.'",
        "'speaker_0': 'Thank you. Councilman Hines, Councilman Flynn, you were in here and then you disappeared, and I think I might have done that. Are you still in the queue for comments? You can make people disappear. I did. I didn't mean to.'",
        "'speaker_0': 'Can I. Can I give you a list? Councilman Flynn, the floor is yours. Thank you. I would respectfully ask my colleagues to support this. And I say this as someone who, as a journalist, wrote about the development of the plan to do the airline and the airport and then who worked at RTD as a project manager on'",
        "'speaker_0': 'that very project and as someone who, since the day the airline opened, has never driven to the airport. I've only ever used the train. But I recognize that it cannot be the only option because, as Councilman Hines pointed out, the unique nature of the destination and of the travelers there.'",
        "'speaker_0': 'I did a little math over the weekend, which is always dangerous, but I think it's correct that even if every airline trip in the course of a day, there are 144 trips of four car trains. And even if everyone was at Crush Load, as we used to call it, when I was at when I was a project'",
        "'speaker_0': 'manager for communications, they told me, don't call it Crush Load, but even if every car was packed to the gills, don't count luggage don't count, strollers don't count wheelchairs don't count bicycles. And we carry about 800 people. And over those trips over the course of a year, you would have to fill every trip from 315 in the'",
        "'speaker_0': 'morning when 800 people aren't going to catch planes yet until 130 in the next morning. When Service Day ends, you would have to fill every train to carry just the originating and destination passengers who are flying out of or flying into Denver if they were to use the train.'",
        "'speaker_0': 'So we have to keep up maintenance and expansion. Yes. Of the roadway. And I want to remind folks that the roadway also carries busses, shuttles, hotels, shuttles, mountain shuttles. So there's a lot of multimodal travel that has to use the Penn Boulevard as well.'",
        "'speaker_0': 'The whole idea of multimodal travel is to offer options that work for whatever reason. You need to choose whatever it is you're choosing. And if we don't keep up with that, we will have. Right now, Penn Boulevard concrete is turning 30 years old, some of it this year.'",
        "'speaker_0': 'So some of it needs to be replaced. And the the expansion of lanes, three new lanes, one of which is dedicated to the commercial traffic, which carries multiple passengers, carries the busses, the shuttles, the hotel busses, etc., to the commercial level five.'",
        "'speaker_0': 'So this is a project I think is needed in the overall integrated mobility network to serve the airport. And I urge people to vote. Yes, thank you. Thank you, Councilman Flynn and Councilwoman Sawyer.'",
        "'speaker_7': 'Thank you, Mr. President. I just wanted to take a minute to thank the airport staff for really being very open to all of our questions, working on the weekend and going above and beyond to get us a lot of information so that we could educate ourselves and be able to make this vote if we felt comfortable doing'",
        "'speaker_7': 'it tonight. So thank you very much for all of your hard work on that. And I just wanted to comment that what Councilman Hines said is absolutely correct, right in the issue of induced demand is a major problem in widening roads and we need climate change action now.'",
        "'speaker_7': 'But that said, I think the airport is a very different place in that it is the number one revenue driver in the state of Colorado and that it is the number five largest airport in the country. And that means that unlike many of the other decisions that we make as a council, this doesn't just affect the city'",
        "'speaker_7': 'of Denver. This affects the region and the country and the world in some ways. And so while I absolutely agree that climate change is a concern and that we need to we need to do a better job of working on different all different modes of transportation and finding funding for that.'",
        "'speaker_7': 'In this case, I think, you know, when there are people coming from Wyoming, when there are people coming from the mountains, when there are even families coming from Denver, my family. You guys have. What we look like trying to get to the airport.'",
        "'speaker_7': 'It's ridiculous. So, you know, being able to provide different options, even if that means waiting the road, even if that's really not what we want to do, I think is valuable in this case. And and I also think that we need to remember that that really is only 6% of this part of the project, that there's so'",
        "'speaker_7': 'much more here, including bringing some economic I'm sorry, environmental benefits to the airport in terms of moving the parking lot for Lyft drivers, Uber drivers, taxi drivers, limo drivers closer to the terminal so that they won't have to drive as far.'",
        "'speaker_7': 'It gives them a better quality of life and shows that we respect the work that they do and that we want to be supportive of them as our first line of customer service coming for people coming out of the airport, because right now they sit idling in their cars in a lot and they use porta potties if'",
        "'speaker_7': 'they need to go to the restroom. And this provides them a place where they can have running water, where they can have, you know, heat or air conditioning lights where they can turn off their vehicle so they're not idling for an hour while they're waiting for a ride.'",
        "'speaker_7': 'And I just wanted to point those things out as well, that that this is a tough call because it is, you know, we need to to move on climate change. But at the same time, we've got these two other big issues where we are providing our workers a better quality of life.'",
        "'speaker_7': 'And we are recognizing that this is in some ways an international access issue. So thank you very much for your time.'",
        "'speaker_0': 'Thank you, Councilwoman Sawyer. Councilwoman CdeBaca.'",
        "'speaker_1': 'First of all, I would also like to thank the airport staff for making themselves available and for answering the questions throughout the weekend. I'd also like to thank the Honorable Councilman Espinosa for helping us to postpone this vote until now.'",
        "'speaker_1': 'I think it's really ironic that my first vote is very similar to Espinosa's first vote, when he had to vote on I-70, which deeply impacted my life as I lived three blocks away from the I-70 expansion and catalyzed my race.'",
        "'speaker_1': 'I do want to really stress the importance of understanding that we have to make we have to have priorities in this city. And Councilman Flynn noted that we, even if packed to the brim, are our trains would only transport 800 people per day.'",
        "'speaker_1': 'I think that's then an impetus for us to start talking about adding rail cars instead of continuing to incentivize bad behavior. We know our planet is on fire. We know what the risk is of induced demand, and so we know better.'",
        "'speaker_1': 'Why aren't we doing better? Councilman Flynn also mentioned expansion and maintenance in the same sentence, and I think those are two very different things. Maintenance is one thing and expansion is a very different thing. And so, yes, we absolutely have to continue to maintain our roads, the ones that currently exist, but we do have to curb our'",
        "'speaker_1': 'use of single occupant vehicles. And this is not the way to do that, especially to the airport. I live one block away also from the A-Train, and that is a system we are spending a lot of money on, continuing with lawsuits and everything.'",
        "'speaker_1': 'And I think that we have to understand and recognize that we have limited resources when it comes to multimodal transportation. And our multimodal transportation is suffering here in this city and not advancing in the way we need it to.'",
        "'speaker_1': 'And so we need to do better and understand the real impacts of how we spend every single dollar. And this 93 million is a significant amount of money to be making a decision on in my first evening. But I do think that there is a reason for me to encourage my colleagues to vote no on this, and'",
        "'speaker_1': 'that is how I will be voting. So thank you. And there are also other ways to integrate Lyft and shared ride services in a more streamlined fashion, in a in an efficient way. And all we have to do is look to other cities.'",
        "'speaker_1': 'We don't have to reconstruct what is available. There are other ways to integrate them into the shuttle services, the shuttle lines where people are picked up.'",
        "'speaker_0': 'Thank you, Councilwoman CdeBaca. Councilwoman Gilmore.'",
        "'speaker_4': 'Thank you, President Clark. I very much appreciate the comments and the direction of my colleagues on council. I know that this is a difficult decision, especially given your first night. And I want to also thank the airport and the immense work that they've done.'",
        "'speaker_4': 'We just finished up 20 months of community engagement that was very robust, that was very intentional with the far northeast community, and that includes Montebello Park Field, High Point, Green Valley Ranch. I did that work in collaboration with Councilman Herndon as part of the Far Northeast Neighborhood Planning Initiative.'",
        "'speaker_4': 'And the community is very engaged. They have lived with this issue for over 25 years. Pena Boulevard, by default, is their only way into and out of the community. And, you know, the airport in 2016 did some revolutionary work in getting Congress and the Appropriations Committee to really allow us to treat Pena as.'",
        "'speaker_4': 'A city and county of Denver roadway versus only a Denver International Airport road. If we are not able to do improvements on this roadway, there was talk of it having to be a toll for folks to get out to the airport.'",
        "'speaker_4': 'Now, we know we never want to do that because that would stifle our growth. That would be hard for residents. That would be hard for other folks. And so with that work that George and his team did, they were able to negotiate with the Federal Aviation Administration to allow the airport to put funds on to airport, but'",
        "'speaker_4': 'then also look at phases two, three and four. And I want to be part of the conversations moving forward. I want to hear all of your new ideas. And how can we address this? Because I have constituents that can't get to work.'",
        "'speaker_4': 'And these are constituents that have food trucks, that work in construction, that own their own businesses. They have work vehicles that multi mobility isn't necessarily going to work for them. They have to drive on our roadways. And we, for over 25 years in the far northeast, have not had the investments nor appropriate expansion of our roadways, especially'",
        "'speaker_4': 'when you're talking about 56th Avenue and Penn Boulevard. Our life and safety is sometimes at risk because of bumper to bumper traffic that we have on these roadways. And so I look forward to the ongoing conversations. But respectfully, I do ask my colleagues to vote in favor of this.'",
        "'speaker_4': 'And a reminder that in 2019, we are going to see almost 70 million passengers coming through Denver International Airport, and we need to make sure that we can accommodate that. But then moving forward to making sure that we're getting those single occupancy vehicles off of our roadways all throughout the city and the region and allowing us also'",
        "'speaker_4': 'to grow in a responsible way in the far north northeast. Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore, Councilman Cashman.'",
        "'speaker_6': 'Thank you, Mr. President. I was pleased to join Councilman Espinosa and a number of votes against the I-70 project, and we don't need to go into the politics of that. But I felt its impact on the community, etc. made that a project that was ill conceived.'",
        "'speaker_6': 'I feel differently about this project for a number of reasons, as Councilwoman Gilmore alluded. The road was was built to handle a different volume of traffic. Then. Then it turns out our airport is generating in the numbers in the future keep going higher and higher.'",
        "'speaker_6': 'I believe the A-line was built. The stations were built to accommodate eight cars as opposed to four.'",
        "'speaker_1': 'So the airport, in trying to futureproof our station, built our station to allow for eight cars. We also built for an entire nother people mover to be built. And and at the airport, however, RTD built the rest of the stations to accommodate four cars.'",
        "'speaker_6': 'Right. Thank you. There's limitations on while the the airport, the A-line and the station was built to accommodate another people mover of a current landscape has no idea where that might come from. I believe FAA guidelines prevent the airport from constructing that.'",
        "'speaker_6': 'The plan as it exists is not just widening lanes. In addition to the the the ride share facility, it's going to make the those that need to circle back to the terminal quicker and safer and easier. I just think that this while when I first saw this bill come through and saw Lane widening, the remaining hairs rose'",
        "'speaker_6': 'on the back of my neck. And it was something that I started grumbling and cussing about under my breath. But after looking at it in more depth, I think it's something that is justified. And so I will be supporting it this even.'",
        "'speaker_0': 'Thank you, Councilman Cashman. At some point you have to tell me what that experience of feeling of having remaining hairs is like. I see no other comments. I will just add quickly, I will echo a lot of what's already been said.'",
        "'speaker_0': 'But you know, for me, first of all, it is so exciting to hear this new council. And when I say new council, I'm not saying new members because we are one council or 13 individuals, but we are one body.'",
        "'speaker_0': 'We get to make one decision. And so this new council, I'm so excited to hear how this new council is talking about climate change. And I hope that we will take big actions quickly because we don't. We might be elected to serve for four years, but we can't wait around four years to to make some big decisions'",
        "'speaker_0': 'when it comes to the climate. For me, with this, in addition to what's been said, I just want to point out a couple of things that I've been getting emails on. Only 6.4% of this contract is expansions when he mentioned that.'",
        "'speaker_0': 'Of that expanded lanes, there are three lanes. One is a bus shuttle lane and the two others are about safety moving in and out. Right now we have areas where it is chaos getting in and out. And so that expansion is really revolves around that.'",
        "'speaker_0': 'And there's a small portion of this contract. Also a lot of emails about rather spend this money on sidewalks and stuff like that. This is airport money. This is not your tax revenue. This money can't be spent on those things.'",
        "'speaker_0': 'It has to be spent at the airport. It's money that is generated at the airport and can only be spent on the airport. So just want to set that straight. So I will be voting to support this this evening.'",
        "'speaker_0': 'Madam Secretary. Raquel.'",
        "'speaker_3': 'Hines.'",
        "'speaker_5': 'Epstein.'",
        "'speaker_3': 'Black. I see tobacco. Nei Flynn. I Gillmor.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Herndon, i.'",
        "'speaker_3': 'Cashman. Kasich, i. Ortega. By Sandoval. I. Sawyer.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Torres, i. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting. Announce the results.'",
        "'speaker_3': '11 eyes, one knee, one abstention.'",
        "'speaker_0': '11 eyes, one nay, one abstention. Resolution 586 has been adopted. That concludes the items that have been called out this evening. All bills for introduction are ordered, published and were now ready for the black vote on resolutions and bills on final consideration.'"
    ]
}