{
    "Park Building Plan for Green Valley Ranch Recreation Center Natatorium Addition.": [
        "'speaker_8': 'The project itself really addresses a huge gap in our services in Northeast Denver and the lack of an aquatics facility in this area. This was actually a project funded by the Elevate Denver Bond in 2017, and it had great public support, as we did urban planning and outreach, and we were thrilled that it made it to the'",
        "'speaker_8': 'final list. And we embarked on the design and outreach process in 2019. You can see the timetable there of the public meetings. We did two public meetings as well as a youth focus group meeting. And then because of COVID and quarantine, we actually ended up doing a final video instead of a final public meeting, which we wouldn't'",
        "'speaker_8': 'otherwise have done, but really great participation throughout, great feedback from the community and really what the community let us know that they wanted. Most were activities for all ages and interests, lap lanes as well as areas for lessons and classes in the pool.'",
        "'speaker_8': 'And at the bottom you can see the most important thing was make it fun. They wanted unique things that were not found elsewhere in other pools within our system. They wanted it to be unique and really reflect the community.'",
        "'speaker_8': 'So that is what we heard through our outreach process. The site itself. Here's an aerial view. You can see the pond in the background, the recreation center to the left and the gymnasium here in the center, the school over to the right, and then the location of the new pool.'",
        "'speaker_8': 'Surprisingly, it looks like it was designed to fit right there because it actually was when the recreation center was initially designed and built, a pool was intended to be part of it. Due to budget reasons, it wasn't able to be done at that time, but it was designed for the pool to be done in the future.'",
        "'speaker_8': 'And we are now, thankfully at that point where we can finish the vision that was set up at at the beginning many, many years ago.'",
        "'speaker_1': 'Oops. Sorry. Not the right thing.'",
        "'speaker_8': 'The pull itself and you can see here there's a an aerial view showing the layout of the new pool location, really trying to to capture all of the desires and and wants of the community. There is. See if I can strike this.'",
        "'speaker_8': 'Sorry. So the existing rec center, the gymnasium, the pool addition itself is about 16,200 square feet. The maximum height of the new building is about 41 and a half feet tall. And the amenities really include a four lane lap pool, a leisure pool with a zero depth entry and aquatic play features for all ages and stages.'",
        "'speaker_8': 'Really, really took a lot of time thinking about how we can program this pool for swimming lessons, lifeguard training, aqua aerobics, water walking, and, of course, lap swimming. So really wanting this to be a robust natatorium to provide all of the services and amenities and programing that go along with with a facility of this type.'",
        "'speaker_8': 'So here are some interior views, renderings of what the space will look like in the left image. You can see that we have the the leisure pool in the foreground and then the water slides themselves, the stairs going up to this area where while you're waiting to do one of two different water slides, we have a big'",
        "'speaker_8': 'bay window with views out to the mountains so that while kids are waiting their turn, they can look out and see the beautiful Colorado landscape really wanting to kind of celebrate and provide that opportunity. Because while you're up there waiting, why not have something great to look at?'",
        "'speaker_8': 'This other image on the right you can see is from underneath those slides, looking back towards the rec center and you can see the leisure pool in the foreground and the black hole in the background. And some of the aquatic play features over to the left.'",
        "'speaker_8': 'That will be fun and splashy and hopefully very exciting. From the exterior perspective, one of the main features, the signature features of this facility is this water slide that will go out of the building around a couple of times and back in and is the most unique water slide that we will have in our system.'",
        "'speaker_8': 'So very excited to be able to bring this to northeast Denver where I know it will be much loved. You can see that window that I referred to here are again, really making a feature out of that and wanting to take advantage of the height to capture those views and just provide a moment for, you know, the'",
        "'speaker_8': 'children using this to really be able to take in the full front range and the view that is so stunning from out here. And then the vision or I'm sorry, the image on the right shows what this will look like in the evening at night with these transparent windows down below and this translucent panels up above that'",
        "'speaker_8': 'will have this nice light glow and really wanted to create a landmark and an icon that the community can be proud of and happy to see when they drive by. So the timeline, as you can see, we as part of this process, we notify all the relevant registered neighborhood organizations within a certain radius of the site.'",
        "'speaker_8': 'So that was done in late April. The LUDIE Committee occurred on May 4th, Mayor Council on May 11th. We are now at May 17th, the first reading and public hearing. There will be a final reading next week on May 24th, and that will be the extent of the council process.'",
        "'speaker_8': 'And just to summarize, we are formally requesting approval of the Park Building Plan for the indoor pool addition at Green Valley Ranch Recreation Center at Town Center Park. And we look forward to any public comments, questions and any other information we can provide about this very exciting project that we are thrilled to be about to start construction'",
        "'speaker_8': 'on.'",
        "'speaker_0': 'All right. Thank you very much, Michael. And we're going to go ahead and ask you if you would take down the screen sharing there and we'll go ahead and reconvene here. Thank you. Tonight, counsel has not received any written testimony on Council Bill 517, and we have one individual signed up to speak this evening.'",
        "'speaker_0': 'Jesse Perez is our speaker. And so we'll go ahead and. Get Jesse here into the queue. All right. We're going to go ahead and start out with our public speakers, and we'll start with you, Jesse.'",
        "'speaker_6': 'Yes. Good evening, members of council. Can I be hurt? Yes, I'd be hurt.'",
        "'speaker_0': 'Mm. Go ahead.'",
        "'speaker_6': 'My name is Jesse. Mission Personal Representative for Black Star Action Movie for Self Defense Positive Action Crewmember for Social Change is as well the Unity Party of Colorado and for a long black mold. We are in favor of this rezoning tonight for this water park.'",
        "'speaker_6': 'Um, I think this would be an added addition, a great addition to the Northeast Denver area. Give the kids something to do. Oh, uh. Oh. We're pretty sure you guys are going to go. We were a favorite. It was only tonight.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. That concludes our speakers questions from members of Council on Council Bill 517. Give me a minute here. All right. Seeing no questions of counsel. The public hearing is closed. Comments by members of Council on Council Bill 517.'",
        "'speaker_0': 'Not seen any hands raised, though. Go ahead. Censuses in Council District 11, in the district that I present, and this has been decades in the making. Very easily over 20 years we've been waiting in the far northeast for an indoor pool with all the bells and whistles and fun and splashy is an awesome way to describe it'",
        "'speaker_0': ', Michael, because this is something that we're very excited about and it brings a lot around fun and family fun, especially for our young people as well, but also our older adults because there were amenities that we included as well for older adults.'",
        "'speaker_0': 'And this really for the first time, we're going to be able to have comprehensive swimming lessons for members of the community as well. And so I respectfully ask my colleagues to vote in favor of this tonight and not seen any other hands raised for other comments.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 517. We.'",
        "'speaker_4': 'Whack.'",
        "'speaker_3': 'I. Peter Barca. I. Quick.'",
        "'speaker_1': 'All right.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_5': 'I earned it.'",
        "'speaker_1': 'I.'",
        "'speaker_6': 'I.'",
        "'speaker_5': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_5': 'Kenny, I. Sandoval.'",
        "'speaker_7': 'I.'",
        "'speaker_5': 'Sawyer.'",
        "'speaker_3': 'I. Or as I.'",
        "'speaker_5': 'Madam President.'"
    ],
    "Rezoning of 8120 West Tufts Avenue in Marston.": [
        "'speaker_0': 'I. Madam Secretary, close the voting and announced the results. 12 hours 12 I Council Bill 20 1-0517 has been ordered published. Thank you, Michael. We appreciate you being here this evening.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'All right. Moving on, Councilmember Cashman, would you please put Council Bill 356 on the floor for final passage?'",
        "'speaker_2': 'Yes, council president. I move that council bill 20 1-0356 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and I think I got Councilman Herndon there with that second they're required public hearing for council bill 356 is open. May we please have the staff report?'",
        "'speaker_4': 'Yes. Thank you. Council President. Let me share my screen. Right. Can you see that and hear me?'",
        "'speaker_0': 'Uh huh.'",
        "'speaker_4': 'Go ahead. Okay, great. Thank you. I'm Libby Adams with Community Planning and Development. And I'll be presenting the MAP Amendment for 8120 West Tufts Avenue. This application is located in Council District two in the Marston neighborhood. The applicant is requesting tourism from PD to 52 to S-Max three.'",
        "'speaker_4': 'This site is located along West Tufts Avenue, just west of Wadsworth Way. It's just it's just under five acres. And it's the site of an existing car dealership. EOD 252 is within the former Chapter 59 zoning code. It allows for the B4 uses but is mostly allowed for an auto park.'",
        "'speaker_4': 'It has a floor area ratio of 1.14 to 1 for the entire PD and then a floor area ratio of 2 to 1 for each individual site within the pod. It's currently used for commercial and retail. And you can see kind of the western side of Wadsworth Way is mostly commercial retail.'",
        "'speaker_4': 'And then as you move farther west and then east of Wadsworth Way, it's multi-unit residential. This slide shows the existing building form and scale with the subject site on the bottom right, left hand side of the screen. And you can see there are several other dealerships in this area and some other auto oriented uses.'",
        "'speaker_4': 'And then there's multi-unit just to the north of across Tufts Avenue. This application was complete at the beginning of January and on January 10th, an informational notice to property owners within 200 feet and registered neighborhood organizations was sent out on or at the end of March, planning board unanimously recommended approval of this item on the consent agenda'",
        "'speaker_4': '. And to date, staff has not received any comments from neighboring property owners or registered neighborhood organizations. The Denver zoning code has five review criteria which must be met in order for a rezoning to be approved. The first is consistency with adopted plans, and there are two plans that are applicable to this site.'",
        "'speaker_4': 'And in a comprehensive plan. This meets several of the strategies, but most notably it will provide by resorting to some x three will provide basic services and a variety of amenities to the area, and it could encourage mixed use communities where residents can live, work and play in their own neighborhoods.'",
        "'speaker_4': 'And Blueprint. Denver The future neighborhood context is suburban. These areas have a range of uses. The block patterns are regular and streets are curvilinear. The future place type in blueprint. Denver is community corridors. These provide a mix of office, residential, commercial and retail uses.'",
        "'speaker_4': 'With heights generally up to five stories. And then the future street type of Tufts Avenue is a local street. And these can have a variety of uses, but most notably their residential. The growth area strategy is community centers and corridors.'",
        "'speaker_4': 'This is where we anticipate to see 20% of new jobs and 25% of new housing by 2040. And then blueprint also includes specific policies. So this one is the Denver land use and built for general policy three strategy, which really encourages the rezoning of properties from the former Chapter 59 Code into the Denver Zoning Code.'",
        "'speaker_4': 'Staff also finds it meets the next two criteria the reason you will result in uniformity of district regulations and it will further the public health, safety and welfare by rezoning a property from the former Chapter 59 into the Denver Zoning Code, which is in compliance with our adopted plans.'",
        "'speaker_4': 'Additionally, it won't have a negative impact by rezoning one property out of an existing pad. There won't be a major negative impact on the remainder because there is a maximum floor area ratio for each site within the PD.'",
        "'speaker_4': 'So that will prevent any shifting of density in the properties that remain. Staff also finds there's a justifying circumstance and that the city adopted the Denver zoning code in this property remains in the former Chapter 59 code. And lastly, this proposed rezoning is consistent with the suburban neighborhood context.'",
        "'speaker_4': 'The mixed use zone districts purpose and the specific intent of the next three school district. Therefore, staff finds that all five criteria have been met and recommend approval. And that concludes the staff presentation.'",
        "'speaker_0': 'All right. Thank you, Libby. Tonight, council has not received any written testimony on Council Bill 356. And we have two individuals signed up to speak this evening. And our first speaker is Cole Bearer. It looks like. Okay, we're going to start out, I believe, with coal.'",
        "'speaker_0': 'A bear. If I mispronounce your name, call, please correct me.'",
        "'speaker_6': 'No, no problem. Members of council. Let's call Harbor last year silent.'",
        "'speaker_8': 'It's an old, old German name.'",
        "'speaker_6': 'So, yes.'",
        "'speaker_1': 'I'm.'",
        "'speaker_6': 'I'm the applicant's representative and I'm just really here to ask questions. You think Libby did a great job explaining everything and really stand up job helping us through this process? So that's all I have to say.'",
        "'speaker_0': 'All right. Great. Thank you. Call. Our next speaker is Jesse. Paris and Jesse. Earlier, we were having a little bit of difficulty with your Wi-Fi. So hopefully we've got a good signal here. But if you start breaking up again, we might just ask you to turn your video off.'",
        "'speaker_0': 'But go ahead and start out this.'",
        "'speaker_6': 'Okay. Good evening. Members of council. My name is Justin Bashar Paris and I'm representing for Black Star to move the first positive action to move for social change as well as the Unity Party of Colorado and for Black Nose.'",
        "'speaker_6': 'And I'll be the next mayor of Denver in 2023. We're just rezoning tonight. I just wanted to know if there was a traffic study done on this stretch was a very heavily populated stretch of was worth so much to do if there was a traffic study done on the stretch of walls where someone could please answer that'",
        "'speaker_6': 'question. I would greatly appreciate it. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. And that concludes our speakers this evening. Questions from members of Council on Council Bill 356. All right. Looks like we have a question from council member Flynn.'",
        "'speaker_1': 'Thank you, Madam President. I can't find the race hand feature on the iPad here. Nope. Raising my real hand. And, Libby, maybe you could just clarify. My understanding is that this reasoning that there is no actual redevelopment proposal accompanying this, that this is simply to remove a very restrictive piece of the PDF that requires that there be'",
        "'speaker_1': 'a primary use of new car sales if there is to be used car salesman along with it, that this rezoning will allow the primary use of selling used cars. Is that do I understand it correctly?'",
        "'speaker_4': 'Yes, that is correct.'",
        "'speaker_1': 'Okay. Thank you, Madam President. That's all we have.'",
        "'speaker_0': 'All right. Thank you, Councilmember Flynn. Next step, we have Councilmember two for us.'",
        "'speaker_3': 'Thank you. Let me a slightly unrelated question. The neighborhood plans for this area. I noticed the far southwest is not coming up for a neighborhood planning initiative. But you said it's slated to have 20% of Denver's future growth.'",
        "'speaker_3': 'Is that did I hear that accurate?'",
        "'speaker_4': 'Yeah. So in Blueprint, it's designated the growth area as community centers and corridors. So together all community centers and quarters throughout the city, we anticipate to see the 20% of new jobs and 25% of new housing.'",
        "'speaker_3': 'Okay, got it. You don't have a date, do you, of when the far southwest is coming up for neighborhood planning initiative? I don't know. Okay. Just curious. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilmember Torres. And seeing no other hands raised for questions. The public hearing is closed. Comments by members of Council on Council Bill 356 Council Member Flynn.'",
        "'speaker_1': 'Think about.'",
        "'speaker_0': 'The.'",
        "'speaker_1': 'Fact that, yes, all dogs can learn new tricks. I wanted to comment on this. When this Southwest Auto Park was initially zoned after annexation in the 1970s and a bunch of court cases that upheld and and rejected some of Denver's annexations down here in South Jefferson County.'",
        "'speaker_1': 'I was writing about this at the Rocky Mountain News, and I asked my one of my predecessors, Councilman Ted Hackworth, why on earth you would want to be so restrictive as to set up this entire stretch of Wadsworth, a primary retail order as basically a haven for auto dealers, particularly when it is on the edge of Denver'",
        "'speaker_1': 'and is surrounded by Lakewood, Jefferson County, little town and places like that where people who buy their cars in Denver nevertheless don't pay their sales taxes in Denver, when you buy a car, you pay your sales taxes to Golden or to a little town, to Arapahoe County or to Jefferson County.'",
        "'speaker_1': 'And I never understood why my head was so intent on on having auto dealerships here. So I am very, very pleased to be able to be part of the dismantling of a little bit of the very restrictive period requirements that were placed on this to allow the sale of used cars that were certified pre-owned.'",
        "'speaker_1': 'If you're trying to sell me a three year old car, you're going to certify it's pre-owned. I already know that. But this will allow allow the former Alpine GMC Buick to become a used car dealership on Tufts Avenue.'",
        "'speaker_1': 'And being in the middle of one of the most dense multifamily residential areas of my district, just about four blocks from where I live, actually, it's that also has the possibility at some point of becoming multifamily housing as well.'",
        "'speaker_1': 'And as many of the places, Madam President, where we thought there would be auto dealerships, we now actually have some pretty large multifamily apartment complexes. So the best laid plans of the eighties don't always turn out to be appropriate in the 20 teens.'",
        "'speaker_1': 'And with that, I would ask my colleagues to support to support me and in making this change. Thank you.'",
        "'speaker_0': 'Very good. Thank you, Councilmember Flynn. And I definitely think that this meets all of the criteria, and I'm happy to support it this evening as well. Madam Secretary, roll call on Council Bill 356, please.'",
        "'speaker_1': 'When I.'",
        "'speaker_5': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_6': 'Hines I.'",
        "'speaker_2': 'Cashman All right.'",
        "'speaker_5': 'Can each right. Sandoval.'",
        "'speaker_3': 'I swear. I was. I. Black. I see the. I.'",
        "'speaker_1': 'All right.'",
        "'speaker_5': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary closed the voting and announced results.'",
        "'speaker_5': '12 hours.'",
        "'speaker_0': '12 eyes council bill 20 1-0356 has passed. All right. Or on to our third public hearing this evening. Councilmember Cashman, would you please put Council Bill 370 on the floor for final passage?'",
        "'speaker_2': 'Yes, council president. I move the council bill 21, dash three seven to be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has moved and I think I got Councilman Herndon or yeah, councilman got one again. So we are opening the required public hearing for Council Bill 370. May we please have the staff report? And welcome back, Val.'"
    ],
    "Rezoning for 3030 North Newton Street in West Highland.": [
        "'speaker_4': 'Thank you, Madam Council. Let me share my screen and I am going to turn off my video because I'm a little glitchy on my end. I don't know if it's the storm that apologies me.'",
        "'speaker_0': 'Sounds good.'",
        "'speaker_4': 'Are you able to see full screen Madam Council? Madam President, apologies. Okay. Yep.'",
        "'speaker_0': 'We got it.'",
        "'speaker_4': 'Getting used to it. This is my second one. So here we go. Another your rezoning for you all. Nothing too exciting, but I'll try to go quickly. Good evening. My name is Valerie Arara, associate city planner with CPD and I will be presenting a rezoning case for the subject property located at 3030 North Newton Street.'",
        "'speaker_4': 'The request is for urban single units C one to allow for a detached accessory dwelling unit or for short adu in the rear of the loft. The subject. Property is within District one under Councilwoman Sandoval and is located within the West Highland neighborhood.'",
        "'speaker_4': 'The subject property is currently set about 6350 square feet with a zone width of 50 feet. The existing zoning, the subject property and the surrounding properties in all directions. Are you, as you see, which allows for urban houses with a minimum zone, lot of 5500 square feet to the north along west 32nd Avenue is umx2 and ums'",
        "'speaker_4': 'three and a block to the south is c mpi two zoning. Furthermore us you a makes up most of the eastern portion of residential low and to the north you also have SUV. The site is a single unit residential land use with a mix of two unit and multi-unit existing uses in the neighborhood, as well as some'",
        "'speaker_4': 'commercial office and public. Quasi public. This property is within the Wolfe Place Historic District. The subject site is within I'm sorry, that has a period of significance spanning from 1883 to 1926, and the property is subject to additional design review through the Landmark Division.'",
        "'speaker_4': 'The subject property is mid-block with alley access. There is an existing primary single unit structure and a detached, detached garage accessory structure currently on the lot. Nearby properties are shown on the top and bottom of the screen. In terms of process the map.'",
        "'speaker_4': 'And then it went to planning board on Wednesday, March 31st, where the item was recommended approval on the consent agenda. The rezoning was moved forward to a final hearing of city council by the Land Use Transportation and Infrastructure Committee or Looby on consent and is being heard today.'",
        "'speaker_4': 'For public outreach staff received a response from the West Highland Neighborhood Association, which states Land Use and Planning Committee of W, H and A remains neutral to proposed minor rezonings for ADU allowance. The entire neighborhood co-op or ANC, also sent an email expressing support of ADU programs and streamlining the process.'",
        "'speaker_4': 'To date, staff has received three emails from nearby neighbors included in the application stating no objection to the proposed rezoning. As you know, the Denver zoning code has five review criteria. The first is consistency with adopted plan, starting with comprehensive plan 2040.'",
        "'speaker_4': 'Staff found this rezoning to be consistent with several strategies shown here from the Comprehensive Plan 2040, more specific to equity affordability and inclusivity from the Plan 2040 Vision Elements. Staff found this rezoning to be consistent with the goals listed here that encourage increased development of housing use units close to transit, a greater mix of housing options in'",
        "'speaker_4': 'every neighborhood for all individuals and families, and ensuring that every neighborhood provide a complete range of housing options. In speaking to environment and climate, Vision Element staff found that this reasoning is consistent with the goal listed here that encouraged encourages promotion of infill development where infrastructure and services are already available.'",
        "'speaker_4': 'Blueprint. Denver maps this area as the urban context. And Residential low, which consists of predominantly single and two unit uses on smaller lots and allows for accessory dwelling units to be thoughtfully and appropriately integrated where compatible.'",
        "'speaker_3': 'Oops.'",
        "'speaker_4': 'Sorry. You must miss. Four criteria. Number two and three staff found that this rezoning is consistent with adopted plans, and the proposed rezoning will result in uniform application of the zoned district building form, use and design regulations, and it will further public health, safety and welfare through implementing adopted plans and facilitating increased housing density.'",
        "'speaker_4': 'Staff found that the proposed rezoning is justified through a city adopted plan, which we know is the blueprint. Denver Land Use and Transport Transportation Plan that was updated in 2018. And finally, the context zone, district purpose and intent of U.'",
        "'speaker_4': 'S, uc1 are all appropriate for this particular location, giving the surrounding area and the adopted plan guidance. Given the finding that all review criteria have been met, Stapp recommends approval of the rezoning. Approval of a rezoning is not approval of a proposed specific development project.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Val. We'll go ahead and have you stop the screen sharing right on this evening. Council has not received any written testimony on Council Bill 370, and we have one individual signed up to speak this evening, and our individual speaker is Jesse Perez.'",
        "'speaker_0': 'We'll go ahead and get Jesse into the queue. There you go. Go ahead with your comments, please, Jesse.'",
        "'speaker_6': 'Yes. Good evening, counsel. My name is Jesse, listed on Paris. Move for self defense, positive action coming in for social change as well as the Unity Party of Colorado in front frontline black nose. And I'll be the next mayor of Denver in 2023.'",
        "'speaker_6': 'We're in favor of this rezoning tonight. It meets all five of the criteria. So there's really nothing I can say that's going to change the vote on this. I just wanted to know what the demographics of this occupation are, because we keep having this same issue with this brother named John Johnson, who's trying to get this rezoning'",
        "'speaker_6': 'in the same district. So if someone could please answer that question, I would greatly appreciate it. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. That concludes our speakers questions from members of Council on Council Bill 370. Councilmember Sandoval.'",
        "'speaker_7': 'Thank you, Madam President. One question, Valerie, because this is in a historic district. Does this to 80 years have to go through the design review process and get approved by the Landmarks Preservation Commission?'",
        "'speaker_4': 'Yes, Councilman Sandoval. That is correct. The subject property is subject to additional review by our landmark division.'",
        "'speaker_7': 'Perfect. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sandoval. And seeing no other hands raised for questions. The public hearing is closed. Comments by members of Council on Council Bill 370. Councilmember Sandoval.'",
        "'speaker_7': 'Thank you, Madam President. This is within the West Highland Neighborhood Association. And as the letter stated, the R.A., the registered neighborhood organization, did not take a stand for an accessory dwelling unit. But one thing I would like to say, because it is in this vicinity, is my council aide Naomi Judd presented to the West Highland Neighborhood Association'",
        "'speaker_7': '. And I think we have our eyes set on rezoning West Highland to allow accessory dwelling units. So more will be coming in from Council District one. We've been reached out to by numerous constituents of minor who are dealing with one off rezoning and it seems like there is a need to be had a more comprehensive approach like'",
        "'speaker_7': 'I've done in other neighborhoods so that surveys come in. So stay tuned. But for this one, I believe it meets all the criteria and it also does get a little bit more scrutiny and design review because it is within one of the two historic districts with in that neighborhood.'",
        "'speaker_7': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Sandoval. Councilmember Hines.'",
        "'speaker_6': 'EU Council President. Thank you CBD for your amazing report. Good job on your second one. Taking inspiration.'",
        "'speaker_0': 'All right. Thank you, Councilmember Hines. All right. And looking at the criteria, it does meet all of the criteria for this rezoning. And so happy to support this this evening as well. Madam Secretary, roll call on Council Bill 370.'",
        "'speaker_3': 'Sandoval.'",
        "'speaker_7': 'I.'",
        "'speaker_3': 'Sawyer, I. Torres. I. Black I. CdeBaca, I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'All right.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_6': 'Hi. Hi.'",
        "'speaker_5': 'Cashmere.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'Can I.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results. 12 hours, 12 Eyes Council Bill 20 1-0370 has passed. Council Member Cashman Would you please put Council Bill 391 on the floor for final passage?'"
    ],
    "Rezoning of Property in Globeville from Industrial to General, Main-Street.": [
        "'speaker_2': 'Yes, Council President. I move the council bill 20 10391 be placed upon final consideration and. Do pass.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'Thank you. It has been moved and we've got a second in there from Councilmember Hines. They required public hearing for council. Bill 391 is open. May we please have the staff report? And I see we have Scott Robinson here.'",
        "'speaker_0': 'Let me see, Scott. I don't know. We're not hearing. Or at least I'm not hearing your audio. All right, now it looks like you're muted. Now you're not. But we're still. Do you want to try to leave the meeting, Scott, and come back into it?'",
        "'speaker_0': 'And we can hang tight here for just a second. Okay. Go ahead. All right. Well, go ahead and allow Scott to hopefully get back into the meeting and get his audio connected up correctly. For the public. We are on Council Bill 391.'",
        "'speaker_1': 'Can you hear me now?'",
        "'speaker_0': 'I can. There you go, Scott. You're back. All right. Nothing like a quick moment of panic right before you're going to do something. But go ahead if you want to, go ahead and share your screen.'",
        "'speaker_6': 'Yes. Sorry about that. Thank you, Madam President. And members of Council Scott Robinson with Community Planning and Development. This is a request to rezone 49, 49 and 4995 North Washington Street and 49, 30 and 4934 North Pearl Street from I am x 3 to 2 and five.'",
        "'speaker_6': 'The property is located in Council District nine in the Globeville neighborhood. It is at the southwest corner of 50th Avenue and Washington Street and then extends Southwest over to Pearl Street. It's about two and a half acres. And the property is owned by the city and is being positioned by our Department of Housing Stability for an RFP'",
        "'speaker_6': 'for development of an affordable housing project. Which I'll touch on a little bit more in a bit. And then Jennifer SIEGEL from Post is also here to talk about that in more detail. As I mentioned, the property is zoned.'",
        "'speaker_6': 'I am x three, which is industrial mixed use for a three storey maximum height and it also has the go to which is the billboard use overlay. You can see surrounding properties are a mix of industrial, industrial mixed use and urban center mixed use zoning.'",
        "'speaker_6': 'The subject property was a car dealership and you can see it is surrounded by a mix of industrial uses and also single unit residential uses in this area. Here you can see the subject property in the bottom right photo and then some of the surrounding properties in the other photos.'",
        "'speaker_6': 'So as I mentioned, the property is owned by the city and the host will be issuing an RFP to find a development partner for it. The federal funding that was used to purchase the property requires that a minimum of 50% of the housing developed on site be affordable and no more than 80% alive.'",
        "'speaker_6': 'But it is hosts intent to exceed both of those requirements. That being a higher percentage of affordable and offering lower levels of affordability below 80%. Host also intends to include community serving users on the property in the RFP.'",
        "'speaker_6': 'As I mentioned, Jennifer SIEGEL can discuss that in more detail. He proposed zoning. As I said, it is GMAC five. That is general urban context, main street zoning with a five storey maximum height that would allow the townhouse drive thru and shopfront building forms up to five storeys or seven feet.'",
        "'speaker_6': 'It requires significant build to and transparency requirements in the mainstream zoning that allows a range of commercial, residential and civic uses. This went to the planning board on March 34, 31st and received a unanimous recommendation of approval and went to the committee on April 6th.'",
        "'speaker_6': 'That has not received any public comment on this application, although HOST has been doing extensive community outreach to understand the community's needs and desires in shaping the RFP. As you know, in order to approve a rezoning, the city must find that these five criteria have been met.'",
        "'speaker_6': 'The first criterion is consistency with adopted plans. There are four plans that apply to this property. The first is Comprehensive Plan 2040, as described in the stat reports that finds that the proposed rezoning is consistent with multiple strategies from Plan 2040.'",
        "'speaker_6': 'Putting these relating to mixed use development and infill development in terms of equity stuff on the proposed rezoning consistent with these two strategies from the Equitable, Affordable and Inclusive Vision Element Backup Plan 2040 relating to providing a variety of housing options in appropriate locations.'",
        "'speaker_6': 'And in terms of climate fines, the proposed rules are inconsistent with these two strategies from the environmentally resilient. There's an element, again, relating to infill development and mixed use walkable development. The second plan is Blueprint Denver. The future context designation for the property is General Urban, which calls for a mix of uses in street activation consistent with'",
        "'speaker_6': 'the general urban context of the proposed GMC five zoning. The future place designation is community center, which again calls for a mix of uses, ideally up to eight storeys, a strong degree of urbanism which would be provided by the proposed GMC 510 district.'",
        "'speaker_6': 'Washington Street is a commercial arterial calling for a mix of uses and bringing buildings up to street. And then 50th Avenue and Pearl Street are both locals providing that property, accessing connection, and then the city's plans growth area strategy.'",
        "'speaker_6': 'This falls under community centers and corridors, calling for 20% of new jobs and 25% of housing by 2040, which would be furthered by the proposed GMC five zone district. The third plan is the global neighborhood plan from 2014.'",
        "'speaker_6': 'The land use concept for this property is a mixed use, which calls for employment and a variety of mid to high density housing options, with a maximum of five storeys in height consistent with the GFC five zoning. Also calling for linking the building to the street, which the main street zoning would do a good job of, and'",
        "'speaker_6': 'also providing a broad range of housing types and price levels which this being a city affordable housing project would also advance that goal. And then the final plan is housing and inclusive. Denver, which is the city affordable housing strategy that calls for leveraging publicly owned land like this to provide affordable housing and providing development in mixed income'",
        "'speaker_6': 'and mixed use developments. As the intent is with this property and the proposed GMC five zoning would allow. So step finds the proposed rezoning consistent with adaptive plans. And the first criterion meant the second criterion is uniformity of district regulations.'",
        "'speaker_6': 'Staff finds the proposed rezoning would result in uniform application of the GMC five zone district. The third criterion is to further the public health, safety and general welfare of city staff finds the proposed rezoning would do so by implementing the city's adopted plans and that the James five zoning would provide extended community services and also require building'",
        "'speaker_6': 'for design elements that promote a walkable environment. Creating more health and safety. The fourth criterion is justifying circumstances on proposed rezoning justified by changing changing conditions. There has to be changes in this neighborhood turning over into more of that mixed use corridor that the plans call for.'",
        "'speaker_6': 'Then also the adoption of both the Globeville plan and Blueprint. Denver calling for that change justify the rezoning. And the first criterion is consistency with neighborhood context, zoning, district purpose and intent. Staff finds the proposed rezoning would facilitate the and consistent with the general urban context and the purpose and intent of the five zone district.'",
        "'speaker_6': 'Without specifying, all five criteria are met and recommends approval. And then, as I mentioned, Jennifer SIEGEL is also here to walk through the RFP process that you like to see that.'",
        "'speaker_3': 'Hey. Thanks, Scott. My name is Jennifer SIEGEL. I'm a housing development officer with the Department of Housing Stability, also known as host. And next slide, please. Since host is the applicant for this rezoning, I'm providing a brief overview of the request for proposal process we intend to follow to ensure that the site is developed for affordable housing'",
        "'speaker_3': 'in conjunction with the community priorities. As Scott mentioned, the city acquired the site with federal funds, specifically HUD Community Development BLOCK Grant. This funding source requires that the subsequent use serves households out of below 80% of the area median income.'",
        "'speaker_3': 'But please note that this is the maximum income allowed by that funding, and we expect that the final development will serve households at lower incomes. And did you term in the community priorities for the site host held to listening sessions last year.'",
        "'speaker_3': 'And we will incorporate those priorities into the RFP and we intend to issue this RFP in the second quarter of this year, approximately June. And we expect to select a qualified development partner as a result of that RFP.'",
        "'speaker_3': 'Next slide, please. And here you can see an overview of the timeline. And please note that this is an estimate and could change. Once the hours our RFP is issued. We'll provide a response time of about eight weeks so that the closing date will likely be mid to late summer depending on the issue state.'",
        "'speaker_3': 'The selected respondent will be notified in the fall, probably around October and then negotiations will commence regarding the disposition of the land and that will take some time and will likely be completed by March, around March of 2022.'",
        "'speaker_3': 'That selected respondent needs to demonstrate this site control in order to apply to the Colorado Housing and Finance Authority for federal low income housing tax credits for the rental component of the site. And we expect that application to be submitted in the fall of 2022.'",
        "'speaker_3': 'And the construction starting completion portions on this timeline here assume that tax credits will be awarded from that application and that other financing could be secured. However, that's not really within our control and the timeline will be delayed if that financing can't be secured in that timeframe.'",
        "'speaker_3': 'Next slide, please. The review panel will include city staff with expertize in housing finance, site development and land use. Additionally, three community representatives are going to be selected through an application process and they will participate as non-voting members of the review panel.'",
        "'speaker_3': 'As you can see, the review process will be highly technical to ensure that the selected proposal meets the requirements for the RFP is financially feasible and can be completed in a timely fashion. Next slide, please. This process is modeled after the successful RFP process that was used for the East Colfax properties.'",
        "'speaker_3': 'At 8315 is Colfax. The RFP process was used to select Mercy Housing as a developer and are in the process of moving forward with a rental development that will serve households with a wide variety of incomes and will also include an early childhood education center.'",
        "'speaker_3': 'Next slide, please. And finally, Hostess captured those community priorities during the listening sessions, and they include both rental and homeownership development, providing units that can serve families so large size units and housing that meets a wide variety of income levels.'",
        "'speaker_3': 'Additionally, several community uses were identified, including potentially a grocery store, fresh food market and an early childhood education, shared space or library. So those are the various priorities that were captured, and we intend to incorporate those in the RFP.'",
        "'speaker_3': 'And thank you. And I can answer any questions that you are the community has.'",
        "'speaker_0': 'All right. Well, thank you, Scott and Jennifer, for the great presentation. And this evening, council has not received any written testimony on Council Bill 391. And we have one individual signed up to speak this evening and we'll go ahead and get Jesse Paris back in the queue here.'",
        "'speaker_0': 'All right. Go ahead with your comments, Jesse.'",
        "'speaker_6': 'Yes. Good evening. Members of council, those watching at home. My name is just the bishop here. And I'm represented for Black Stars to move for something pretty. Oh, Colorado and front line black nose. And I'll be the next mayor of Denver in 2023.'",
        "'speaker_6': 'We're in favor of this rezoning tonight. We have a housing crisis. I'm glad the city is finally realizing that we have a housing crisis and it's making it is due to create affordable housing, housing that people can actually afford years after the fact.'",
        "'speaker_6': 'So we are in favor of this rezoning tonight. I wanted to know what the army levels are going to be for this specific property that's in question. I heard something about 30%. But how many units specifically are going to be at 30%, 30 to 80%?'",
        "'speaker_8': 'What is the.'",
        "'speaker_6': 'Army level range going to be for this proposed rezoning and some I could please answer that question. I would greatly appreciate it. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. And that concludes our speakers this evening. Questions from members of Council on Council Bill 391 Council Councilmember Hines.'",
        "'speaker_6': 'I thank you, council president. I apologize if this was already in the presentation. I had to use the restroom anyway. The only question that I have is we're intending for the city to purchase the land. Ah, well, I think I understand is right.'",
        "'speaker_6': 'We're going to purchase the land. Are we then going to give that to a community partner or are we going to do like a long term lease, like 99 year lease or how how how is the ownership going to work on this?'",
        "'speaker_6': 'And I apologize.'",
        "'speaker_3': 'Okay. Yeah, actually, I wasn't addressing the presentation. I mean, if we model the that East Colfax, that land was provided to mercy housing. I think it you know, a nominal $10 rate. So the expectation is that it will be provided to the selected respondent at a very nominal cost and that will provide them with the site control'",
        "'speaker_3': 'that they need.'",
        "'speaker_6': 'When you say provide, you mean sell or lease?'",
        "'speaker_3': 'Well, I say so. If it's $10, there's always a potential that it could be leased as well. But right now the plan is to sell the property. But that could potentially change if the city had decided to lease the land.'",
        "'speaker_3': 'But currently it's intended to be sold. So, you know, $10.'",
        "'speaker_6': 'I, I don't think that that will change my vote tonight, but it would be if we're purchasing it, it would be great for us. I mean, just long term to have to retain the land effectively. It would be the same for for mercy housing if we were to lease it for a dollar or $10 a year.'",
        "'speaker_6': 'But but just I'm just thinking about I think Councilmember Sandoval has said seven generations. So, you know, if we're going to purchase the land, maybe we could the the financial amount would be the same in the end for the for the housing developer.'",
        "'speaker_6': 'But just seven generations from now, we would have more assets as a city. Anyway, thank you. Thank you. Council President.'",
        "'speaker_3': 'Okay. Definitely. I'll. Communicate that.'",
        "'speaker_0': 'Okay. All right. Thank you, Jennifer. And thank you, Councilmember Hines. And seeing other hands raised for questions. The public hearing is closed. Comments by members of Council on Council Bill 391. Council members say tobacco.'",
        "'speaker_3': 'I don't have any questions.'",
        "'speaker_0': 'Okay. All right. Sounds good. Seeing their hands raised. Madam Secretary, roll call on Council Bill 391 place.'",
        "'speaker_3': 'CdeBaca. I, Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_5': 'Hines.'",
        "'speaker_6': 'I.'",
        "'speaker_5': 'Cashman. I can. I, Sandoval.'",
        "'speaker_7': 'Hi.'",
        "'speaker_3': 'So you. I. Torres. I. Black eye.'",
        "'speaker_5': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results. 12 Eyes. 12 Eyes. Council Bill 20 1-0391 has passed all right are pre adjournment announcement on Monday May 24th Council will hold a required public hearing on Council Bill 20 1-0515 approving a proposed and Arco market development agreement by and among the city and county of Denver, J.V.'"
    ]
}