{
    "2018 Work Plan, Budget and Mill Levy for the Gateway Village General Improvement District.": [
        "'speaker_2': 'And speakers must stay on the topic of the hearing and must direct their comments to members of Council as a whole. Remain from profane and obscene speech and please refrain from individual or personal attacks. All right. Council is now convened as the board of directors for the Gateway Village General Improvement District Council.'",
        "'speaker_2': 'When we get more where you please put Resolution 1240 on the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I move that Resolution 1240 be adopted.'",
        "'speaker_2': 'All right. It has been moved in second at a public hearing for resolution 1240 is open. May we have staff report. Michael Carrigan.'",
        "'speaker_6': 'Yes, good evening. Board members. Michael Kerrigan from Department of Finance, Special District Team. I'm here to give you the staff report and request approval for the Gateway Village General Improvement District 2018 Annual Work Plan and Budget. The district is located in north in the northeast section of the city, northwest of I-70 and Chambers Road intersection.'",
        "'speaker_6': 'It consists of approximately 243 acres on the eastern border of Montebello. It is completely developed and primarily consists of residential property. Responsibilities include maintaining the landscape in parks within the District City Council approve the formation of the Gateway Village General Improvement District by ordinance number 551 series 1994 and establish City Council as the ex-officio board of Directors'",
        "'speaker_6': 'of the District. The creation of the ordinance also created the District Advisory Board made up of property owners within the guide. The ordinance specified that such District Advisory Board should conduct and manage all affairs of the district, as has the authorized agent of the Board of Directors, including its financial and legal affairs.'",
        "'speaker_6': 'Pursuant to Resolution Number 32 Series 1995, the City Council authorized the District Advisory Board to create a work plan and budget for approval by the Board of Directors annually. The Gateway Village Guide 2018 Budget proposes overall expenditures and fund transfers of $1,764,200, with total revenues of $602,643.'",
        "'speaker_6': 'The district will assess 20 bills on real property within the district during 2018. The district plans to undertake a major landscaping beautification project. Landscape improvements are anticipated to include tree lines and tree monuments and improvements to the detention and drainage channels.'",
        "'speaker_6': 'The district expects to spend up to $750,000 for the improvements. Construction is expected to start during 2018, with the possibility of continuing through 2019. City staff has reviewed the 2018 Budget and Work Plan and recommends it for approval.'",
        "'speaker_2': 'All right. Thank you. We have one speaker this evening. Jeffrey Earp.'",
        "'speaker_0': 'Yes. Good evening. My name is Jeffrey Erb. I'm general counsel for The Guide, and I'm here to answer any questions.'",
        "'speaker_2': 'All right. Thank you, Mr.. Thanks for being here. You can have a seat. Now, any questions by members of council? Seeing none. Public hearing is closed. Comments by members of council. Seeing none. Madam Secretary. Raquel.'",
        "'speaker_3': 'Black. Hi, Clark.'",
        "'speaker_0': 'Hi.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_0': 'Hi.'",
        "'speaker_3': 'Gilmore. Herndon, Cashman Canete. Lopez Susman. Hi, Mr. President.'",
        "'speaker_2': 'I please. I was worried as a result.'",
        "'speaker_3': 'Ten eyes.'"
    ],
    "2018 Work Plan and Budget for the 14th Street General Improvement District.": [
        "'speaker_2': 'Ten eyes. I'm sorry. This toll for you. Tonight's counsel bill 1240 is passed. Congratulations. All right. We are now a city council convening as the board of directors for the Denver 14 Street General Improvement District. Councilman Gilmore, please put Resolution 1241 on the floor.'",
        "'speaker_4': 'Thank you, Mr. President, and move that Resolution 1241 be adopted.'",
        "'speaker_2': 'All right. It has been moved and seconded. Michael Carrigan. You're back up.'",
        "'speaker_6': 'Good evening once again. Board of Directors Michael Carrigan from Department of Finance, Special District Team. I am here to provide the staff report for the 14th Street General Improvement District and request approval for the 2018 budget. And we're planning approval and work plan.'",
        "'speaker_6': 'The district is located along 14th Street from Market to Colfax and generally includes all parcels along both sides of 14th Street. It was created by council and approved by the electors in response to the 14th Street Initiative to create Denver's downtown Ambassador Street.'",
        "'speaker_6': 'The initiative began in 2005 and visualized 14th Street as a promenade and a major gateway to the downtown area. The plan contemplate the plan contemplated streetscape improvements and related public infrastructure. Stakeholders included private property owners, public officials and business organizations participated to establish the conceptual design for 14th Street in 2009.'",
        "'speaker_6': 'The City Council approved the formation of the 14th Street Guide. The district was established to acquire finance, operate and maintain street improvements. The district's creation ordinance calls for the JD to at least annually pass a work plan and budget.'",
        "'speaker_6': 'The ordinance in 2009 create the J.D. and its companion ordinance created a district advisory board. The District Advisory Board. Also the District Advisory Board, after a notice and hearing, recommends that board of directors, the proposed work plan and budget, including maintenance charges and capital charges before you tonight.'",
        "'speaker_6': 'During 2018, the district plans to continue maintaining district amenities including but not eliminated, not limited to tree planter and flower pots, landscape maintenance, signage, repairs, trash removal and holiday light installation. The work plan, budget and charges includes total revenues of $565,759, which is comprised of $255,292 in maintenance charges and banner rental rental revenue plus $310,463 in capital'",
        "'speaker_6': 'charges for the repayment of debt used to finance the capital enhancements along 14th Street. City staff has reviewed the 2018 budget work plan and recommends it for approval.'",
        "'speaker_2': 'All right. Thank you, Mr. Carrion. We have one speaker for this public hearing, Beth Maskey.'",
        "'speaker_5': 'Good evening. I'm Beth Moisi, and I'm with Serve as the executive director for the Denver 14th Street General Improvement District. And I'm here to answer questions.'",
        "'speaker_2': 'All right. Thank you. You can have a seat. Members of council counts for questions. Councilwoman, can each.'",
        "'speaker_4': 'Thank you, Mr. President. This has been a dramatic transformation, and this street is just amazing to spend time on it compared to ten years ago. How much or does any of this budget include paying back some of those major infrastructure changes?'",
        "'speaker_4': 'Or is it more just the smaller things like the tree boxes and things that you mentioned that kind of complemented the actual curb gutter, you know, work that was was done.'",
        "'speaker_6': 'So the 14th Street Guide actually issued $4 million of bonds, which put the amenities on top of the major street improvements. So the city of Denver had gone in. Was the 2010. The Better Denver Bonds Program 2000 to.'",
        "'speaker_2': '2007 oh four The Better Team.'",
        "'speaker_6': 'Gets Better Denver Bond Program 2007 Before My Time Yeah so city Denver came in and put down the base enhancements and then the guy put the $4 million of of enhanced enhancements on top of those base improvements. So for the 2018 budget that's captured in the capital charges and it is $310,463 is being used to pay back'",
        "'speaker_6': 'the debt that they installed those improvements.'",
        "'speaker_2': 'All right. Thank you, Councilwoman Kinch. Any other questions? All right. Public hearing of 1241 is now closed. You know, to Councilwoman Keen interest point, I just wanted to say, I represent this district and this was one of the first project bond projects that I got a chance to work on from the better to offer bond.'",
        "'speaker_2': 'And it was very innovative because we charged different zones along 14th Street, the premium zone, and I mean really took that idea and went along with it on other areas of my district and it is transformed. It's incredible.'",
        "'speaker_2': 'And so I think we've done an incredible job there. And I want to thank everybody for being a part of it, because one could each.'",
        "'speaker_4': 'Yeah. I just wanted to say, I think it's looking great and I would like to just please share kudos with the advisory board folks who are still working on the management. It's you know, it's amazing. Thanks.'",
        "'speaker_2': 'Great. Okay. This concludes our comments. Madam Secretary. Raquel.'",
        "'speaker_3': 'Black.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Clarke All right. Flynn, I. Gillmor, I. Herndon Cashman Canete Lopez. Sussman Hi, Mr. President.'"
    ],
    "2018 Work Plan and Budget of the RiNo Denver General Improvement District.": [
        "'speaker_2': 'I police course one witness results. Tonight's ten eyes count about 1241 has passed. Congratulations OC Council is now convene as board of directors for the Reno Denver General Improvement District. Councilman Gilmore, please put Resolution 1242 on the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I move the Resolution 1240 to be adopted.'",
        "'speaker_2': 'All right. It has been moved and. We have a second. Let's get a mover first.'",
        "'speaker_3': 'But it's not. Gilmore and Herndon.'",
        "'speaker_2': 'Oh, God. Okay, it's on there. Good. It's the second public hearing for 1242 is now open. Michael. And again, man, you are on a roll.'",
        "'speaker_6': 'Thank you. Thank you. Board members, Michael Kerrigan, again, Department of Finance. And before you tonight to give the staff report and request approval for the Reno Denver General Improvement District 2018 Annual Work Plan and Budget. The district is located northwest of downtown and includes residentially and commercially assessed properties around the Brighton Boulevard corridor.'",
        "'speaker_6': 'Generally. Generally, the JDI is centered on Brighton Boulevard, stretching from I-70 in the north to 29th Street on the south, bounded east by the Union Pacific Railroad line and to the west by the Burlington Northern Railroad Line. The guide supports infrastructure enhancements and maintenance in the Rhino area, including streetscape enhancements to Brighton Boulevard.'",
        "'speaker_6': 'City Council approved the formation of the Rhino Denver General Improvement District by ordinance number 309 Series 2015 and establish City Council as the ex-officio board of Directors of the District. The ordinance also created a district advisory board comprised of property owners within the district.'",
        "'speaker_6': 'The ordinance specified that the advisory board should subject to the approval of Board of directors, conduct and manage all affairs of the of all affairs of the District as the authorized agent for the Board of Directors. The District Advisory Board has created the 2018 Budget before you tonight.'",
        "'speaker_6': 'The Budget proposes overall expenditures of $787,954 and overall revenues of 770 $770,617. Of these revenues, the district will generate approximately $500,000 through the levy of four mills on real property for general operating purposes. It will also generate approximately $250,000 from the imposition of capital charges assessed on a lineal Fred on a lineal footage basis for properties adjacent'",
        "'speaker_6': 'to Brighton Boulevard for the repayment of $3 million of debt that were used to fund the capital enhancements along Brighton Boulevard. The city staff has reviewed the 2018 budget work plan and recommends it for approval.'",
        "'speaker_2': 'All right. Thank you, Mr. Carrion. We have one speaker tonight. Jim Local. You're up.'",
        "'speaker_5': 'Good evening, counsel. I'm Jamie Lythgoe. I serve as the manager of the Reno Denver General Improvement District. And I'm just here to answer any questions you have. Great.'",
        "'speaker_2': 'All right. Questions by members of council. Jamie, just one quick question that can just help remind the audience who is listening and council members when you all will start. You know, we know Brighton Boulevard is under construction, but 28th, the 40th will be complete soon.'",
        "'speaker_2': 'Will you all start the enhancements?'",
        "'speaker_5': 'So the enhancements will be put in starting in the spring. So there right now, actually this week, they're laying the 35th, the 38th section of the concrete roadway, which is a big step. They're getting a lot of the roadway done before the weather turns cold.'",
        "'speaker_5': 'They will work over the winter to finish the concrete improvements. And then in the spring, the trees and the plantings and the street lights and everything will go in. So it'll all be by the time summer warm weather gets here, it'll be complete.'",
        "'speaker_2': 'So you will be spending money from this year come this time spring or when you execute those contracts and things.'",
        "'speaker_5': 'So the way we did this partnership with the city is we issued $3 million worth of debt. We took out a $3 million loan last summer. It was completed in the end of June in 2016. We took out that debt and we wrote a check to the city for the 3 million, and they're managing that 3 million'",
        "'speaker_5': 'as part of the overall project. So they'll be expanding their accounting for it separately. But they they're actually contracted to put all those improvements in for us. So that will happen through their contract. And then there's a one year warranty period on the improvements and we start maintenance on them next year.'",
        "'speaker_5': 'So we've just been building up a reserve knowing that maintenance is coming and we need to be prepared.'",
        "'speaker_2': 'Which is a smart way to do it for coordination of a pretty complex project. All right. Thank you. Yeah. Any other questions by members of council? All right. The public hearing is closed. Four 1242 comments by members of council.'",
        "'speaker_2': 'I will just encourage members of council and even folks in the audience to go take a tour of what's going on on Brighton Boulevard. 100% transfer. Transformation of of Brighton. And I hope you've been on Brighton before. I'm sure many people have.'",
        "'speaker_2': 'But what's going on is going to be incredible and we're really doing some innovative things out there, so I'll be glad to get a chance to do this and please thank everybody on the board, advisory board for all their hard work.'",
        "'speaker_2': 'All right. It's been more than a second. Madam Secretary, roll call.'",
        "'speaker_3': 'Black Eye.'",
        "'speaker_0': 'Clark, I. Flynn, I.'",
        "'speaker_3': 'Gilmore, I. Herndon, I. Cashman Canete, Lopez Susman.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_2': 'I am pleased to announce the results tonight. Tonight, Resolution 1242 has passed. All Rights Council is now reconvene on Monday, December 18, 2017. Council will hold a required public hearing on Council Bill 1210 changes only to have classification for 3944 North High Street in Cole.'"
    ]
}