{
    "Rezoning of 3435 North Albion Street in Northeast Park Hill.": [
        "'speaker_0': 'No items have been called out under. Let me see. Under. Bills for an addiction. No items called out. There are no bills on final consideration this week under pending. Councilmember Herndon has called our bill 20 1-1528 for a vote.'",
        "'speaker_0': 'Madam Secretary, would you please put the first item on our screens? Thank you. Councilmember Hines, will you please put Council Bill 21, Dash 1528 on the floor.'",
        "'speaker_2': 'And move the council bill 21, dash 15 to 8 to be taken out of order.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Comments and questions by members of Council on Council Bill 21, Dash 1528 Councilmember Herndon.'",
        "'speaker_2': 'Thank you, Madam President. We need to vote to move this item out of order so that we can postpone final consideration due to the posting requirements.'",
        "'speaker_0': 'All right. Thank you, Madam Secretary. We don't have anybody else in the queue to ask questions. Madam Secretary, roll call on Council Bill 21, Dash 1528, please.'",
        "'speaker_3': 'CdeBaca AI Clerk.'",
        "'speaker_2': 'All right. Flynn All right.'",
        "'speaker_1': 'Herndon Hi.'",
        "'speaker_3': 'Hi. Cashman.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Ortega, I.'",
        "'speaker_3': 'Sandoval, I. Sawyer, I. Torres.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Work. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results.'",
        "'speaker_3': '12 Hours.'",
        "'speaker_0': '12 eyes Council Bill 21 Dash 1528 may be taken out of order. Councilmember Hines, would you please put Council Bill 21, Dash 1528 on the floor for final passage.'",
        "'speaker_2': 'And move the Council Bill 21, dash 1528 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Herndon, your motion to postpone, please.'",
        "'speaker_2': 'Yes, Madam President. I move the council bill 21, Dash 1528 with its public hearing be postponed to April 4th, 2022.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Comments and questions by members of Council on Council Bill 21. Dash 1528. Councilmember Herndon.'",
        "'speaker_2': 'Thank you. Council President. This item did not meet the posting requirements, so that's why we have to postpone final consideration to the date stated.'",
        "'speaker_0': 'All right. Thank you. You don't have anybody else in the queue, so we'll go ahead and continue. Madam Secretary, roll call on the postponement of Council Bill 21, Dash 1520.'",
        "'speaker_3': 'CdeBaca.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Herndon High. Cashmere Ortega, I. Sandoval, I.'",
        "'speaker_0': 'Sawyer, I. Torres, I.'",
        "'speaker_5': 'Black Eye.'",
        "'speaker_2': 'Clark. All right.'",
        "'speaker_3': 'Flynn. All right, Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': '12 Eyes.'",
        "'speaker_0': '12 eyes. Final Consideration of Council Bill 21 Dash 1528 with this public hearing has been postponed to Monday, April 4th, 2022. That concludes the items to be called out. All bills for introduction are ordered for induction or ordered published.'",
        "'speaker_0': 'Council members remember this is a consent or block vote and you will need to vote. Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Hines, would you please put the resolutions for adoption on the floor?'",
        "'speaker_2': 'Yes, ma'am. I move that resolutions be adopted in a block for the following items. 20 2-0180 20 2-0181. 2220 2-018 220 2-019 720 2-019 820 2-019 920 2-0170 20 2-018 320 2-0190 20 2-019 220 2-014 220 2-0020 322 Dutch 020 422.'",
        "'speaker_2': 'Dash 0260. 20 2-0123. 20 2-019 422. Dash 0195. 20 2-0261.'",
        "'speaker_0': 'Thank you. Councilmember Hines. And we haven't moved. We're going to need a second if we can get one. Thank you, Councilman. Madam Secretary, roll call, please.'",
        "'speaker_3': 'CdeBaca.'",
        "'speaker_2': 'I ask I. Flynn All right.'",
        "'speaker_1': 'Herndon Hi. Hi.'",
        "'speaker_3': 'Hi. Cashman. Ortega. Sandoval. I swear.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Torres.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Black eye. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '12 eyes.'",
        "'speaker_0': '12 eyes. The resolutions have been adopted. Our pre recess announcement tonight. There will be a required public hearing on Council Bill 22, dash 0028, changing the zoning classification for 1468 Tennyson Street in West Colfax and a required public hearing on Council Bill 22, Dash 004 for changing the zoning classification for 3178 South Dayton Court in Hampden.'"
    ],
    "Rezoning Property for Accessory Dwelling Unit at 1468 Tennyson Street.": [
        "'speaker_8': 'Residential properties have 24 hours until they have to shovel. Let's all do our part to keep Denver's sidewalks safe for everyone. Denver 311 and Pocket Gov are helping you navigate Denver City Services.'",
        "'speaker_7': 'Clearing sidewalks after snowstorms helps ensure the safety and mobility of our entire community. This is important, especially for senior citizens and people with disabilities. What's inconvenient to you could be dangerous or even life threatening to them. Be sure to shovel your entire sidewalk.'",
        "'speaker_7': 'A wheelchair needs a minimum of 36 inches to pass, and if your property has a curb ramp, be sure to clear that entirely as well. Residents and businesses alike need to help make our community safe and accessible for all.'",
        "'speaker_1': 'One. 11111111.'",
        "'speaker_0': 'If you have signed up to answer questions only, please state your name and note that you're available for questions from council. Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted.'",
        "'speaker_0': 'We will alternate between.'",
        "'speaker_4': 'In-Person and virtual for efficiency.'",
        "'speaker_0': 'By calling in-person participants and then alternating to virtual speakers. Speakers must stay on the topic of the hearing and must direct their comments to council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole, and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilmember Hines, will you please put Council Bill 20 2-0028 on the floor for final passage.'",
        "'speaker_2': 'And move the Council Bill 20 200 to be placed upon final consideration and to pass.'",
        "'speaker_0': 'It has been moved and seconded. The required public hearing for Council Bill 20 20028 is open. May we have the staff report?'",
        "'speaker_4': 'Thank you very much, Councilwoman Thrace. Good evening, counsel. My name is Valerie Arara, senior city planner with community planning and Development. I will be presenting an 80 year rezoning case for the subject property located at 1468 North Tennyson Street.'",
        "'speaker_4': 'The applicant's names are Matt and Lindsay Waste, and they'll be joining us virtually this property in Council District one with Councilwoman Son Duvall. And is located within the West Fox statistical neighborhood. The subject property is currently our standard 6250 square foot zone lot with a width of 50 feet.'",
        "'speaker_4': 'The request is to go to urban single unit C one to allow for a detached accessory dwelling unit in the rear of the lot. In terms of zoning, the site and the surrounding properties to the northeast and west.'",
        "'speaker_4': 'Are you, as you see, to allowing urban houses with a minimum zone, lot of 5500 square feet to the west and east? The zoning is your 2.5, which is a multi-unit district that allows up to two and a half storey rowhouse building farms.'",
        "'speaker_4': 'To the north is West Colfax Avenue, which is classified as a main street arterial. For existing land use. The site is single unit residential and surrounded by single two and multi-unit existing residential land uses in the neighborhood to the north along with cold facts.'",
        "'speaker_4': 'Existing uses include a mix of commercial, retail, public, quasi public and mixed use. For existing building form and scale. The subject property is on the north side of the block with Alley Access and is located just south of West Colfax Avenue.'",
        "'speaker_4': 'There's an existing primary single unit structure and a detached garage accessory structure currently on the lot. Nearby properties just south of the site are shown on the screen. The property in Orange is classified multi-unit residential and the bottom left photo is looking down.'",
        "'speaker_4': 'Tennyson. In terms of process. This MAP amendment went to planning board on Wednesday, January 5th, where the item was recommended approval on consent agenda. The rezoning was moved forward to final hearing of city council by the Land Use Transportation Infrastructure Committee on consent on January 18th and is being heard today.'",
        "'speaker_4': 'To date, staff has not received any written input from any of the registered organizations that were sent notice. And there's also been no public comment. The Denver zoning code has five review criteria. The first is consistency with adopted plan, starting with Plan 2040.'",
        "'speaker_4': 'I found this rezoning to be consistent with several strategies shown from the Comprehensive Plan 2040 for equity and environmental resiliency. Equitable, equitable, affordable and inclusive goal staff found the rezoning to be consistent with Goal two strategy a creator creating a greater mix of housing options in every neighborhood for all individuals and families that can be found on'",
        "'speaker_4': 'page 28. And in speaking to the climate and environmental resilient vision elements, staff found this rezoning to be consistent with the goal listed. Environmentally Resilient Goal eight Strategy A promote infill development where infrastructure and services are already in place that can be found on page 54.'",
        "'speaker_4': 'Blueprint. Denver maps this area as the urban neighborhood context. Future places is residential low, which consist of predominantly single and two unit uses on smaller lots and allows for accessory dwelling units to be thoughtfully inappropriate, appropriately integrated. Where compatible.'",
        "'speaker_4': 'Additionally Blueprint Denver guidance provides support through policy for diversify housing choice through the expansion of the aid to use throughout all residential areas and then strategy a city wide approach to enable aid uses preferred until the holistic approach is in place individual rezonings to enable to use in all residential areas, especially where proximate to transit are appropriate'",
        "'speaker_4': 'unless there is an a neighborhood plan supporting adus rezoning should be small an area in order to minimize impact to the surrounding residential area. Looking at the West Colfax Neighborhood Plan of 2006, we have support provided through the Urban Neighborhood District Goal two focused on density and promoting discrete increases in residential densities within established residential districts.'",
        "'speaker_4': 'We also have recommendation one of the urban neighborhoods Stability support the efforts of the Zoning Code Task Force to update residential zone districts and ensure the provision of appropriate design and development standards for additions, infill and redevelopment in established urban neighborhood areas.'",
        "'speaker_4': 'Recommendation three on building types is established vocabulary of urban neighborhood building types promote the construction of these buildings within appropriate locations. In urban neighborhood districts include a range of building types that permit discrete increases in residential densities, such as carriage houses, multiplexes, small apartments, townhouses or road houses.'",
        "'speaker_4': 'Looking at criteria two and three staff found that this rezoning is consistent with adopted plans. The proposed rezoning will result in uniform application of zoned district building form, use and design regulations, and it will further the public health, safety and welfare through implementing adopted plans and facilitating increased housing density.'",
        "'speaker_4': 'Four criteria for justifying circumstances. Staff found the proposed rezoning is justified through a city adopted plan. And finally, for criteria five, the context zone districts purpose and intent of USC. One are all appropriate for this particular location, giving the surrounding area the adopted plan guidance and the location of the site.'",
        "'speaker_4': 'A small nuance is that us you see two allows for tandem house duplex and detached adu building forums specifically on corner lots that are on either collector or arterial streets. This property is not on one of those corners, so they can't do any of those building forms.'",
        "'speaker_4': 'They could right now only do attached ads by going to us, you see, one, they will be allowed to construct that detached adu that they are requesting. Given the findings that our review criteria have been met. CPD Recommends City Council Approve Application 2020 1i00160 based on finding our review criteria have been met.'",
        "'speaker_4': 'Approval of a rezoning is not approval of a proposed specific development project. Thank you very much. I'll take questions.'",
        "'speaker_0': 'If there's questions. Thank you, Val. We have one individual signed up to speak this evening. Jesse Paris is joining us online.'",
        "'speaker_1': 'Greedy members of council may be heard.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_1': 'My name is Jessica. Some parents and I'm representing for Black Starts a movement for self-defense, defense, positive action for social change, as well as the Unity Party of Colorado. It is Denver Residents Council in Fort Long Black Nose and I'll be the next November 2023.'",
        "'speaker_1': 'I'm in favor of rezoning tonight. As the stated on general public comment, we have a housing crisis. Any time now we have an opportunity to increase our housing stock. That is great. I don't know exactly what the occupant is using this associate building for.'",
        "'speaker_1': 'If they're using it for Asian parents or if it's going to be a short term rental, I could answer that question or those questions. I would greatly appreciate it. Thank you.'",
        "'speaker_0': 'Thank you, Jesse. Questions for members of Council on Council Bill 22, Dash 0028. Councilman Sandoval.'",
        "'speaker_6': 'Thank you, Madam President. Thank you for the presentation. So in our zoning code, are there any other areas other than this area in West Colfax that have this particular zone district?'",
        "'speaker_4': 'You know, Councilwoman Sandoval, that is a great question. Off the top of my head, I'm not sure this is the first time I see a case with this scenario. I'm not sure of CPD leadership or if there's someone else that might want to respond to that from our department.'",
        "'speaker_6': 'Oh. You. You in here and.'",
        "'speaker_4': 'And but I'm we're happy to follow up with you if this is my first case to see this scenario like this with the C2.'",
        "'speaker_6': 'Can you go over the uses again on one of your slides the U.S. use to.'",
        "'speaker_4': 'Absolutely. So right here on the first bullet, you, as you see to allows tandem house duplex and detached accessory dwelling unit building forms, specifically on corner lots that are on collector or arterial streets. So this property is not on one of those corners nor one of those street classifications.'",
        "'speaker_4': 'And so in order to do a detached ADU, they will need to go to this one.'",
        "'speaker_6': 'So do you have a map with all of the parcel sizes?'",
        "'speaker_4': 'Not with me in this presentation, no. The closest is just looking at the zoning map and the existing land use in built form.'",
        "'speaker_6': 'Okay. So this particular if you can if you go to this map, all of the houses on the corner, even though it would probably be they look I can look it up on the Internet, but they look like about the same zone lot.'",
        "'speaker_6': 'It doesn't matter. They so that corner units could build an excess detached accessory dwelling unit, tandem house or duplex, but all the interior homes could not. Correct?'",
        "'speaker_4': 'That is correct. Because of the corner lot limitation. Yes.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_0': 'Yes, ma'am. Thank you. I know other council members in queue for questions. The public hearing is closed. Any comments by members of Council on Council Bill 22, Dash 0028. Councilwoman Sandoval.'",
        "'speaker_6': 'Thank you, Madam President. Pro Tem. My office attempted to do a overhaul on the zoning over here. We didn't get as much participation as we like, so therefore I didn't move forward with a legislative rezoning for this area.'",
        "'speaker_6': 'But I feel like this is an area toward zoning code. There's only 300 and some odd houses in the whole entire city that have this zoned district. And it does not seem fair to the everyone else who are in the interior homes to not have the ability to have a detached accessory dwelling unit.'",
        "'speaker_6': 'When I did a deep dove on 1468 Tennyson Street with our planning department and asked them why they usuc2 zoned district was created, I did not get any clear answers. Nobody quite understood why these areas and I think it's only like 300 some odd parcels are zoned this way.'",
        "'speaker_6': 'So I would ask my colleagues to please approve this rezoning. The owners, Matt and Lindsay did as much outreach as possible so that we could do a legislative rezoning so they didn't have to be have to bring this forward on a one off.'",
        "'speaker_6': 'And unfortunately, at that time, we didn't get the traction that we needed. So I would respectfully ask my colleagues to support this. Thank you.'",
        "'speaker_0': 'Thank you. Seeing no other members of council in queue. Madam Secretary, roll call on Council Bill 22, Dash 00280 CdeBaca.'",
        "'speaker_3': 'Sandoval.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Sawyer.'",
        "'speaker_0': 'I. Torres. I.'",
        "'speaker_3': 'Work. I. Clarke.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Flynn, I kill more. Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Cashman. Ortega. I apologize, Madam Pro Tem. I should have closed with you.'",
        "'speaker_0': 'I think.'",
        "'speaker_3': 'You have ten eyes.'",
        "'speaker_0': 'All right. Madam Secretary, close the voting. Announce a result.'",
        "'speaker_3': 'Tonight.'"
    ],
    "Rezoning of 3178 South Dayton Court for Accessory Dwelling Unit.": [
        "'speaker_0': 'Tonight, Council Bill 22 zero 0 to 8 has passed. Councilmember Hines, will you please put Council Bill 22, dash zero zero for four on the floor for final passage?'",
        "'speaker_2': 'My pleasure. I move that constable 20 2-004 for be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded the required public hearing for Council Bill 20 2-0044 is open. May we have the staff report? I really.'",
        "'speaker_5': 'Just a minute.'",
        "'speaker_0': 'Okay. Go ahead and introduce yourself.'",
        "'speaker_4': 'I'm Libby Adams with Community Planning and Development, and I will be presenting the MAP Amendment at 3178 South Dayton Court as soon as the PowerPoint opens. Okay. So this application is located in Council District four in the Hamden neighborhood, and the applicant is requesting to rezone from suburban single unit F to Suburban Single Unit F with waivers'",
        "'speaker_4': 'to allow for an accessory dwelling unit. The applicant has proposed waivers to allow the aid to use the detached edu building form and then to waive the minimum zone. Lot depth of 150 feet. As stated previously, the property is currently zoned SNCF, which allows the suburban house building form on a minimum zone.'",
        "'speaker_4': 'Lot size of 8500 square feet. This site is currently occupied by a single unit home with single unit and park uses surrounding the site. This slide shows the existing building form and scale with the subject property on the upper right hand side.'",
        "'speaker_4': 'Then a postcard notifying neighboring property owners within 200 feet of the site was sent out on October 19th. Planning Board unanimously recommended approval on January 5th of this year. And to date, staff has not received any public comment.'",
        "'speaker_4': 'The Denver zoning code has five review criteria that must be met in order for a rezoning to be approved. The first criterion is consistency with adopted plans. This rezoning will meet several of the strategies and comprehensive plan 2040, including creating a greater mix of housing options in all neighborhoods and promoting infill development where there's already services and'",
        "'speaker_4': 'infrastructure in place. And then in Blueprint Denver this the neighborhood context is classified as suburban. These areas are a range of uses from single uses to commercial corridors, and then block patterns are generally irregular with curvilinear streets. And Blueprint identifies this property as the low residential place type, and these place types are mostly single unit residential uses'",
        "'speaker_4': 'on larger lots and accessory dwelling units are appropriate. And then both South Dayton and Dartmouth Place are local streets, which are mostly characterized by residential uses. The Growth Area Strategy and blueprint. Denver is all other areas of the city.'",
        "'speaker_4': 'This is where we anticipate to see 10% of new jobs and 20% of new housing by 2040. And then blueprint also includes specific policy recommendations. So land use and vote form housing policy for strategy states that individual rezonings to allow AIDS are appropriate and should be small and area.'",
        "'speaker_4': 'And then Blueprint Policy five discusses removing barriers to constructing use and then Blueprint also has guidance for when to use waiver. So it recommends limiting the limiting the use of customized zoning tools like waivers to unique and extraordinary circumstances.'",
        "'speaker_4': 'So customized zoning tools are most effective when a standard zoned district does not exist to implement our adopted plans. So CPD uses waivers in situations where the waivers help solve an issue the department is committed to resolve through a future text amendment.'",
        "'speaker_4': 'So, as seen on the previous slide blueprint, Denver recommends removing barriers to Adus through a text amendment. Until those changes are made, it's appropriate to consider individual rezonings to allow adus and the suburban context currently has a limit has limited adu district options.'",
        "'speaker_4': 'So this waiver is a bridge to a district that will be created with the ADU Use and Denver project. And so staff believes this is an appropriate circumstance to use a customized zoning approach. Staff also finds the requested zoning meets the next two criteria.'",
        "'speaker_4': 'It will result in uniformity of district regulations and will further the public health, safety and welfare by providing a new type of housing in a largely single unit area. And then blueprint serves as the justifying circumstance for this rezoning in its recommendation to allow to use in all residential areas.'",
        "'speaker_4': 'And lastly, the proposed rezoning is consistent with the suburban neighborhood context, the residential districts and the specific intent of the SUV Zone district. So based on finding all five review criteria, have the net staff does recommend approval. And that concludes my presentation.'",
        "'speaker_0': 'Thank you, Livy. We have one individual signed up to speak this evening. Jesse Paris is joining us online.'",
        "'speaker_1': 'You're ready? Yes. Good evening. Members of Council for Black Star. Can you hear me? My name is just a the person I'm a present for. Black Star salute a self defense positive actually come in for social change as well as the Unity Party of Colorado and East Denver Residents Council and front line black males.'",
        "'speaker_1': 'And I'll be the next November 2023. I'm in favor of this rezoning to make it meets all five of the criteria. Consistency what adopt the plans uniformity of district regulations for this public health, safety and wellness. Justifying circumstances and consistency with neighborhood context and so district purpose.'",
        "'speaker_1': 'And since I'm in favor of rezoning, I just wanted to know what this idea was going to be used for so I could please answer that question. I would really greatly appreciate it. Thank you.'",
        "'speaker_0': 'Council on Council Bill 22, Dash 004 for Councilwoman Black.'",
        "'speaker_5': 'Thank you, Madam Pro Tempore. Thank you, Libby. You just said something at the end, which is contrary to something that I believe. So you referred to the ADA in Denver Advisory Committee. And you said something about that committee making a recommendation about changing the zoning for ADAS.'",
        "'speaker_5': 'And it's my understanding that's not what that committee is doing.'",
        "'speaker_4': 'That's yeah, I won't change the zoning. My understanding and we do have Josh Palmeri is here from the Eighties and Denver project, but that one of the potentials is that more adu districts may be created, people will have to rezone into them.'",
        "'speaker_4': 'But I think the the creation of new districts.'",
        "'speaker_5': 'Okay, good. I just wanted to clarify that. Um, so. This is an interesting application in a very suburban neighborhood. If you look at it on a map like every street is a dead end and there's paths and park.'",
        "'speaker_5': 'And it's a it's a lovely neighborhood, but I have concerns about the building form. And I know that I've talked to you about this before, but this house is a single story and it's surrounded by one story. Houses, potentially someone could build a two story house five feet from the back fence.'",
        "'speaker_5': 'Is that correct? Correct. And I think that was really my only question for now, all that my fellow council members asked questions and then I'll probably get back in the queue. Okay, thanks.'",
        "'speaker_0': 'Next in the queue, Councilman Ortega. Thank you, Madam President. Pro tem. My questions are about in the application. It makes reference to 150 feet. Is that the that lot depth on the frontage of the property?'",
        "'speaker_4': 'So that would be the depth from the street frontage to the rear and that. So we only have one ADU district in the suburban neighborhood context and it requires a lot depth of 150 feet. And so that's why that's waived because the waivers point to the form standards for RSU F one.'",
        "'speaker_0': 'Okay. So looking at the photographs of the homes in the neighborhood, it looks like there's a very long set back in the front of these properties. Is that consistent throughout the block?'",
        "'speaker_4': 'Yes, I would say so.'",
        "'speaker_0': 'Okay. So then how much space does that leave in the back for an end to you, given the fact that part of the law is already taken up by a front yard excuse me? And then it has a single family home, and now we're talking about putting a unit in the back.'",
        "'speaker_0': 'So I'm just trying to understand how much of that 11,900 square feet is actually available for construction of a another single family home? And is there a limitation on the size that it can be?'",
        "'speaker_4': 'Yes. So there is a limitation on the size as far as the actual square footage that would be in the backyard that could be taken up for you. And I don't know the exact numbers for that. I do know it needs to be in the back 35% of the lot.'",
        "'speaker_4': 'And given this lot size of 11,900 square feet, you know, I would imagine that that still leaves a general. I know that this particular applicant has already worked with development services on the site plan.'",
        "'speaker_0': 'And so does the developer, the homeowner available to answer any of the questions.'",
        "'speaker_4': 'That Gavin built.'",
        "'speaker_0': 'Gavin Belt Pldt. Nope. He's not online. Okay. So nobody's here representing the applicant. They're just letting you all present it to us without being available to answer any questions. That's unfortunate. Okay. Is this an HOA community?'",
        "'speaker_4': 'I did not know that, Councilman. No, she's.'",
        "'speaker_0': 'Okay. So we wouldn't have any of those e2e restrictions that they have to deal with. I think those are my only questions. So. Thank you. Thank you, Councilwoman. Councilman Flynn.'",
        "'speaker_2': 'Thank you, madam president. Pro tem Libi the you mentioned that in blueprint rezonings for Haiti use are appropriate, particularly when a text amendment may be in the offing. You mentioned Josh is in the audience. Josh, could you come up and take a couple of questions pertinent to this application?'",
        "'speaker_2': 'Because I'm very concerned about the prospect that a vote on this tonight by this body might prejudice the outcome or predetermine or dictate an outcome for a process that hasn't even started. So when when is your first meeting?'",
        "'speaker_2': 'Is it's this Thursday. Yeah. Good afternoon. Council Josh Omari, senior city planner, CPD. Thank you. Yes.'",
        "'speaker_1': 'As Councilwoman Black alluded to earlier in.'",
        "'speaker_2': 'The meeting, our first meeting is this Thursday, this evening. I'm sorry, could you speak a little more into the mic for me? Yeah, thank you. Yeah. I also would not want to speculate on that process and what the outcome might be.'",
        "'speaker_2': 'We are kicking off this Thursday. It will be ideally a one year process. And so we'll be back for you guys and adoption.'",
        "'speaker_1': 'In early 23. But without knowing, you know, kicking off the process, having the discussions, we're not sure what building form will end up with.'",
        "'speaker_2': 'Josh, could you tell us what what is the full scope of the project? What are the areas they will look at? Are there any areas they will not look at? Yeah, certainly. So we are implementing land use recommendation five from Blueprint Denver, which is tasked with removing barriers to a new construction.'",
        "'speaker_2': 'So not only looking at what zoning regulations are getting in the way of construction issues, but also building context sensitive form standards. And so currently the ADA standards are the same. Citywide, you can do.'",
        "'speaker_1': 'A 24 foot all edu.'",
        "'speaker_2': 'Building form throughout the city. Mm hmm. And so we know that potentially that it doesn't match with all of our other contexts. And so we're going to look really closely at suburban context neighborhoods and figure out what the setbacks should be there, what the height should be, etc., etc..'",
        "'speaker_2': 'Okay. And as I think that Councilwoman Black brought up the this application, if this lot in question 3178 South the court if it were 25 feet deeper, this would be a straightforward application reason to assess. You have one presumably correct?'",
        "'speaker_2': 'Or maybe Libby is more. No, I think everyone still allows the tandem house form in this district, so it's unique in that sense. This application waves the tandem house. Correct. Yeah. So we would also we would want to waive that and I think as well, if this was the straightforward Adu rezoning.'",
        "'speaker_2': 'Correct. Libby, is that the other waiver? Is there waiving the the tandem house?'",
        "'speaker_4': 'So we're not we're only waiving in the 80 you use for the tandem house will not be allowed. But that isn't allowed. Use and building form in the SCAF one.'",
        "'speaker_2': 'Correct. Okay. So we're not we're we're just doing a waiver. This is on. Yeah.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_4': 'You're using by waiving. Yes.'",
        "'speaker_2': 'Yeah. The context here is is on is difficult for some people to grasp because usually a waiver means you're giving up something. And here we're using a waiver to give or.'",
        "'speaker_4': 'We're waiving here. And so the tandem house is not permitted in these waivers.'",
        "'speaker_2': 'Right. Okay. And Josh, how many how many meetings do you anticipate this group to have? I think there were going to be for now we have seven meetings guaranteed and room for an eighth meeting just in case if we need to really hash out some of these details.'",
        "'speaker_2': 'So eight meetings throughout the year. Okay. All right. Thank you. Thank you, Madam Pro-Tem.'",
        "'speaker_0': 'Thank you, Councilman Hines.'",
        "'speaker_2': 'Thank you, President Pro tem. So there are five criteria with which we should make our decision, correct? Correct. Then only those criteria. Nothing else? Correct. So if someone were to ask you, I'd like to know what the area will be used for.'",
        "'speaker_2': 'Kim, is that a question that we can use the answer to shape our decision?'",
        "'speaker_0': 'Well.'",
        "'speaker_2': 'Thank you. Thank you, Madam President. Pro tem.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman Sandoval.'",
        "'speaker_6': 'Thank you, ma'am. President pro tem. Um. Thank you, Libby. Thank you, Josh. A couple of questions. When the application came in to CPD, did the applicant come up with the idea for waivers, or was this a collaboration with CPD and the applicant?'",
        "'speaker_4': 'Yeah, I would say it was a it would be a collaboration just because when they came in, they said they wanted an EDU. And we currently don't have a district that will allow them to have what they wanted, which is a detached adu.'",
        "'speaker_4': 'And so that's where the collaboration and looking at CPD policy and a waiver might be the best fit at this time.'",
        "'speaker_6': 'And how was the decision made to waive that? So if you went to a standards and district with a that allows accessory dwelling, does it automatically allow a tandem house form as well?'",
        "'speaker_4': 'So the SDF one is the only one that also allows the tandem house building form.'",
        "'speaker_6': 'And that's the zone district that's closest to this area.'",
        "'speaker_4': 'Correct? That's the only district within the suburban neighborhood context that currently allows the 82 use and building form. So it also allows that tandem house building form.'",
        "'speaker_6': 'Okay. And have there been? Outreach to the neighbors. Have you heard anything from the neighbors on this application?'",
        "'speaker_4': 'I have not heard anything from the neighbors. In the applicant's narrative, he did say that he reached out to the registered neighborhood organizations, and I believe he did speak to his neighbors. I have not received any comments.'",
        "'speaker_6': 'So in these areas that have this suburban form and usually that means that they don't have alleys. I have some areas in inspiration point that have don't have alleys and they usually are not your traditional rectangles or not.'",
        "'speaker_6': 'They're probably a little bit different. How do these building building firms, such as an accessory dwelling unit, do? Have we looked at any of the unintended consequences of building an accessory dwelling unit with standards that are meant for more of a probably, I don't know, like the one we just did, the urban town, the form in northwest'",
        "'speaker_6': 'Denver, where it's predominantly a rectangle zone. It's deeper, meaning they get it's the front zone on the front light for the public, for the front lot is smaller and it goes deeper in the back and you have alley access.'",
        "'speaker_6': 'Even if you don't have the access, I don't have the access and I live in as an urban zone, but I do have still that traditional rectangle zone. Have we looked at unintended consequences and how these building firms actually exist in the built environment?'",
        "'speaker_6': 'Because I think that's something that is important and that's why we have this edu task force is looking at these unintended consequences of trying to fit a circle into a square peg.'",
        "'speaker_4': 'Mm hmm. Yeah. So, I mean, my answer to your question was, yeah, that's why we have the AIDS in Denver project. And I would also say that these waivers, they point to the as you F-1 standards. And so if those get changed based on the aid use in Denver project, this law will still have to comply with'",
        "'speaker_4': 'that. So it doesn't point to specific like it has to be five feet from the property line so say that you use in Denver project does come up with a different step back from the rear this project would have this development would have to follow that if it's done after that project.'",
        "'speaker_6': 'And remind me when my last question in that zone district, can you go 2.5 stories as well with that other how high can you go? It's 24 feet.'",
        "'speaker_4': '24 feet over the primary. So we have the primary is two and a half storeys across the whole zone lot.'",
        "'speaker_6': 'Okay. And then the health talk in the Adobe, the detached 24 feet.'",
        "'speaker_4': 'So 30 to 35 feet for the primary, depending on width across the whole zoned lot and then 24 feet for the adu.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Cashman.'",
        "'speaker_2': 'Yeah, thank you, Madam President. Pro tem. Let me just more direct this planning. Think it makes sense? To zone a 24 foot structure five feet from a back property line. With this, with this project, the edu project, beginning with that being acknowledged as a problem area, I'm mystified how we get a recommendation to do that.'",
        "'speaker_4': 'Yeah. You know, I think we we have guidance that says 80 users should be permitted in all of our residential areas and we have applicants that are coming forward. And so I think, you know, we we kind of have to work with the standards that we have.'",
        "'speaker_4': 'And so we have this guidance that says 80 you should be permitted here from our in our plans. And so I think that's why we did this waiver. And I think that's why we did the waiver the way we did.'",
        "'speaker_4': 'Because, like I said, if you know the applicant, sometimes these processes take time to actually develop. And so if the views and project comes in with something different and changes the text, then this will still be subject to that change because it just points to the standards.'",
        "'speaker_4': 'And so, you know, Josh's project here could change what the actual ADA will look like on the site.'",
        "'speaker_2': 'Okay. Thank you for your answer.'",
        "'speaker_0': 'Thank you. And Councilwoman Black.'",
        "'speaker_5': 'Thank you. Along those same lines, did you guys consider halting these in suburban sound districts until after this process?'",
        "'speaker_4': 'Yeah. So my understanding is that I don't think CPD has the authority to. Stop projects to do a moratorium on use in urban context. But that could be in the question.'",
        "'speaker_5': 'You know, that makes sense for, you know, can you commit to that piece? Hi, Nate.'",
        "'speaker_1': 'I sincerely believe that members of Council, Navy Services and City Attorney, Councilwoman Black, can I have your repeated questions as I have a little trouble hearing?'",
        "'speaker_5': 'So we were wondering if CPD considered not. Supporting these applications in suburban zone districts until after the advisory committee some of its work so just. A temporary pause to the. 80 rezonings in suburban sound districts until after the committee makes its recommendations.'",
        "'speaker_1': 'That that would be a policy consideration either for council or CPD. Um. And there would be. Something that that you could take up as a council or take to CPD management to see if they'd be willing to do something like that.'",
        "'speaker_5': 'Okay. Thank you. Libby, I have a question. The applicant's not here. And then you said you knew that he had talked to building services. Do you know anything about his proposed plans?'",
        "'speaker_4': 'I do not know specifics. I just know that he has spoken to them.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Cashman. You're not an excellent Councilman Flynn.'",
        "'speaker_2': 'Thank God the President made in your reply. I seem to recall in the last term of Council we we issued a moratorium on slot homes. Until we figured out how we wanted to alter the rules and regulations and the zoning criterion for slot homes.'",
        "'speaker_2': 'And so we did not accept any new applications for that building form until we settled that. So would this be this policy you say would be in our hands, or is this something, in your opinion, CPD could simply.'",
        "'speaker_2': 'Since Josh's committee is just getting started, say, you know, look where we have tons of zoned districts that allow you to use and we will continue to process those. But for areas where we're going to study how to incorporate them into the context and character of suburban context and other zoned districts where we might not have the'",
        "'speaker_2': 'Dash one available, we're not going to process any. It's going to just going to be a year. Heck, if we approve this tonight, this fellow might not be able to get his permit for another two years. The way you are considering my my neighbor trying to build a deck took nine months to get a deck permit.'",
        "'speaker_1': 'Right. Moratorium is certainly one option that council would have, but there would be legal criteria that council would have to meet in order for a moratorium to.'",
        "'speaker_2': 'I'm sorry. Could you speak up a little more? I'm sorry. What's into the mike.'",
        "'speaker_1': 'Okay. Yeah. So a moratorium would be an option that council could pursue, but they would have to, of course, check with Legislative Council and make sure whether or not for that type of more time would meet the criteria.'",
        "'speaker_2': 'But would it be something appropriate for CPD to administratively say, we're not going to consider applications with waivers at this point until this process is done?'",
        "'speaker_1': 'Well, I think that's a question for CPD management, but I, I don't think that that is probably the direction that CPD would like to pursue, because there's so much guidance within the current comprehensive plan and blueprint Denver that are calling for addus throughout the city.'",
        "'speaker_2': 'Certainly. Certainly. But the blueprint also has direction to do certain things in order first, such as this study, which has not yet been done. So. All right. But they don't have there's no legal prohibition to them saying we're not going to consider issuing waivers or recommending rezonings with waivers until the new standards are figured out.'",
        "'speaker_2': 'No legal bar to that.'",
        "'speaker_1': 'I'm not understanding your question. I'm sorry.'",
        "'speaker_2': 'Could could CPD say to applicants who come in like like this one, that there is no zone district that allows in to you on 125 foot deep lot in suburban context. If you were 150 feet deep, you could go ahead with it.'",
        "'speaker_2': 'But we're not going to process applications for rezonings that rely on waivers from current forms in the code, current standards in the code. Until this effort that kicks off on Thursday comes up with consistent standards that we will then follow.'",
        "'speaker_2': 'Is there a legal bar to CPD taking that policy with the public?'",
        "'speaker_1': 'Well, if if council approved this rezoning with waivers, then the applicant could move forward with building their aid. Right.'",
        "'speaker_2': 'That's that wasn't my question. How could CPD say to an applicant, we are not going to advance this application?'",
        "'speaker_1': 'They could or they could advance the application with a recommendation of denial if that if that's the direction they wanted to go.'",
        "'speaker_2': 'I understand that they currently they wouldn't want to do that. Thank you. That's all.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman Sandoval.'",
        "'speaker_6': 'Thank you, Madam President. To answer Councilman Flynn's question about the moratorium. That was Councilman Espinosa. And Councilman, we knew who proposed the moratorium, and they used the criteria that we were trying to solve a problem for. There's only a certain reason why you can use a moratorium.'",
        "'speaker_6': 'So I've often thought about that in certain in certain areas of development. So it gets complicated when the moratorium. But I do understand that we do have this process and it does seem like we don't have a zone district in this area.'",
        "'speaker_6': 'And I know that it it it's not best practices to use waivers and conditions on anything in rezoning. I know that's not looked highly upon for CPD. So for you to be coming forward with a recommendation to use waivers for an accessory dwelling unit.'",
        "'speaker_6': 'I don't think I've ever seen that before. I'll just say that. Thank you, Madam President.'",
        "'speaker_0': 'Okay. Thank you, Councilman Hines.'",
        "'speaker_2': 'Thank you. Madam President, pro tem Nate. Sorry to bring you up again.'",
        "'speaker_0': 'They? We have a question for you.'",
        "'speaker_2': 'Welcome back. So the so I'm going to go down the same kind of line of question. I think that Councilmember Flynn was going down so we could, as a council, pass something that issues a moratorium on any new development at all if we wanted to.'",
        "'speaker_2': 'Is that right?'",
        "'speaker_1': 'Yes, sir. That would be legislative.'",
        "'speaker_2': 'And and we could, as a council, pass something that limited to use in suburban contexts if we wanted to.'",
        "'speaker_1': 'That is also correct.'",
        "'speaker_2': 'But it is not possible for us to consider and pass that before we pass what we're considering right now tonight. Is that right?'",
        "'speaker_1': 'That's correct. So.'",
        "'speaker_2': 'Okay. So while we could consider that, that is only theory and conjecture until we make a determination tonight. Yes, sir. Okay. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. I see no others in Q Libby, just one question that I have on Slide 16, I think. Strategy. Just if you can clarify for me, it says unless there is a neighborhood plan supporting any use and we don't have a neighborhood plan here, rezonings should be small in area in order to minimize impact to the'",
        "'speaker_0': 'surrounding residential area. What does that mean, small in area?'",
        "'speaker_4': 'Yeah. So for us, you know, a lot of times it's these individual rezonings that come in. You know, the an impact of one eighth you won't necessarily be a huge impact on the surrounding area. Now, that doesn't preclude the neighborhood wide aviaries because we have other guidance that talks about large legislative rezonings.'",
        "'speaker_0': 'Okay. So the area is are there other edu rezonings that have come through in this neighborhood?'",
        "'speaker_4': 'I do. I don't know in this specific neighborhood, but I know that there have been others that have gone through in the suburban context.'",
        "'speaker_0': 'Okay. Did those those revised F-1?'",
        "'speaker_4': 'Yes. The one that has gone through, I think went to SC F1 because it would have met the parameters of the depth and the size.'",
        "'speaker_0': 'Can you remind me what the F one depth is?'",
        "'speaker_4': 'Yeah. So it's 150 feet and then a minimum zone lot size of 8500 square feet.'",
        "'speaker_0': 'Got it. Thank you. Okay. I don't have any other questions, seeing no one else in queue. Public hearing is closed. Comments by members of Council and Council Bill 20 2-004 for Councilwoman Black.'",
        "'speaker_5': 'Thank you, madam pro tempore is the the other one that was approved actually was in this neighborhood and. There were a lot of questions about it, including some opposition. In this neighborhood and in my district, we're starting to see some of these applications pop up.'",
        "'speaker_5': 'And I do have constituents who don't want to use. There's those people. I actually am very supportive of ideas. Well, I also have heard from a lot of people who are very concerned about the building for. And they live in a suburban neighborhood.'",
        "'speaker_5': 'They don't have an alley. And the thought of having a two storey structure looming over their back fence with windows, looking in their backyard, shading their garden is not something that they bargained for. And I I've never used the health, safety and welfare criteria.'",
        "'speaker_5': 'I don't believe as a reason not to vote for something. But I am not going to support this for that reason. It's just not something that community members bargained for when they moved to these suburban neighborhoods. And while I do support HD use, I feel like we need to have an agreed upon building form that is more'",
        "'speaker_5': 'conducive to these kinds of neighborhoods. These houses are all single storey, and someone could build a two storey structure five feet from the neighbor's fence. And I'm just not comfortable with that. And without the applicant being here to answer questions.'",
        "'speaker_5': 'I'm sorry, I just don't think this is something I can support tonight, but thank you for your work and I really look forward to being on the committee and resolving this so we can move forward with rezonings in the future.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn.'",
        "'speaker_2': 'Thank you, Madam Pro-Tem. In my analysis, this application fails to meet four of the five criteria. I don't believe it's consistent with adopted plans. Sometimes it seems to me that we cherry pick statements and adopted plans here and there with which the application can be seen as consistent.'",
        "'speaker_2': 'And it does in the ones that we choose to highlight in the staff report or the presentation. But then we ignore other statements in the plans with which the application is inconsistent. So in blueprint land use and built form recommendation for a study quote study and implement allowances for aid use study and implement allowances for 80 use'",
        "'speaker_2': ', including those attached and detached from the primary home in all neighborhood contexts and residential zone districts use an inclusive community input process to respond to unique considerations in different parts of the city. This recommendation was not done and this application is not consistent with that 40 recommendation and blueprint quote A citywide approach to enable aid to use'",
        "'speaker_2': 'is preferred until a holistic approach is in place. Individual rezonings to enable to use in all residential areas, especially where proximate to transit parenthetically which this one is not, are appropriate unless there is a neighborhood plan supporting a to use rezoning should be small an area in order to minimize impacts to the surrounding residential area.'",
        "'speaker_2': 'So here the property is in a suburban context district that would accommodate a rezoning if it met the form standards currently in the code. But it does not it's only it has insufficient lot depth blueprint would support a rezoning to F1 is consistent if the parcel were 150 feet deep.'",
        "'speaker_2': 'But in light of the fact that in three days the city is kicking off a project to come up with the recommended standards. Waivers are inappropriate and in my view, not consistent with Blueprint's guidance on 82 rezonings are proceeding after an inclusive community process and study prior to implementation.'",
        "'speaker_2': 'And then finally in Blueprint five, see states revise detached adu form standards to be more context sensitive, including standards for height, mass and setbacks. We've done none of that in the context of this application. Mr. Pomeroy's committee is going to come up with those, and I'm sure that in a year's time we will have something like that'",
        "'speaker_2': ', so that, as the councilwoman said, where you have a parcel with a one storey house in the front, you don't end up with a two storey separate dwelling unit five feet from the back, from the neighbor's back fence.'",
        "'speaker_2': 'So we have not yet revised those form standards. And Blueprint says we should do that. We have not done it. CPD staff and Josh, you might remember this. I pulled my hair out when I got these emails. CPD staff recently sent a representative of a property owner in my district.'",
        "'speaker_2': 'To me, he was applying to rezone a property for an idea in a district that as of now doesn't even have such an option in the code. I think it was opseu c 6000 square foot lot minimum, which it matter was 6200 square feet, but there was no way for me to form for that.'",
        "'speaker_2': 'So this representative told me that he was advised to come to me and to the R.A. with a remit, with a proposal to rezone it into a totally different context. Urban edge right in the middle of this vast sea of suburban context, we were going have one parcel on a lot in Brentwood that would suddenly have an'",
        "'speaker_2': 'urban edge context completely not appropriate. And my understanding is that maybe he might have misunderstood the guidance from staff when when they sent him to me. But I certainly hope we don't get any any more represent any more applications like that.'",
        "'speaker_2': 'The next criterion I believe, it fails to meet is uniformity of district regulations. It's not consistent unless this criterion is completely meaningless. The very nature of this request is precisely to be inconsistent with the s as you f zone district regulations.'",
        "'speaker_2': 'That's the point of the of the waivers. I don't believe it meets the fourth criterion justifying circumstances. In fact, in my view, the circumstances justify holding off on this rezoning because the project is coming up in three days to come up with the standards and building form standards and regulations for ADA use in areas like suburban without'",
        "'speaker_2': 'alleys. This application puts us, this Council, in the position of signaling to the advisory committee that has yet to meet what the outcome should be and we should not be determining the outcome this way. We could end up with an inconsistent zone district in this.'",
        "'speaker_2': 'In this instance, if we were to approve this, as I mentioned, we had a moratorium on the new slot home form. I know that we don't have time to do that here. But for that reason, though, Madam Pro-Tem and colleagues, I'm going to vote against this application.'",
        "'speaker_2': 'I also don't believe, by the way, that it meets Criterion five consistency with neighborhood context description for the reasons I've already stated, which I think are very obvious. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Hines.'",
        "'speaker_2': 'Thank you, President Pro Tem. The stakeholder process that we're about to kick off hopefully will change the policy that we currently have. But we should make a decision to nine based on the policy we currently have. We shouldn't kick off a stakeholder process that would retroactively go back and apply to this, or we shouldn't try to predict'",
        "'speaker_2': 'what that stakeholder process might give us and a year or so in the future and try to vote tonight based on what we think that stakeholder process might give us. I'm not saying that your other ideas are right or wrong.'",
        "'speaker_2': 'I just mean we shouldn't try to. That seems like a lot of work. It seems like way more work than just using the criteria that we have today to judge today. Thank you.'",
        "'speaker_0': 'Councilwoman Sawyer.'",
        "'speaker_4': 'Thanks, Madam President.'",
        "'speaker_0': 'Something that Councilman Hines just said I think is really important. And I just wanted to flag Councilman Flynn talked about it a little bit as well. We need to follow the procedures we have in place. And the purpose of putting.'",
        "'speaker_4': 'The form base zoning code.'",
        "'speaker_0': 'In in 2010 was so that we didn't have waivers anymore.'",
        "'speaker_4': 'And whether a waiver is.'",
        "'speaker_0': 'Granting something or whether a waiver is limiting something.'",
        "'speaker_4': 'The use of waivers is pretty rare.'",
        "'speaker_0': 'And so to me that says this doesn't belong in this district at this time. And so I'm also going to be an alternate thinks thank you seeing no others in Q I know one of the things that we've discussed a lot in West Denver are issues in lots that are smaller than the current criteria allows.'",
        "'speaker_0': 'And so but we've also seen single family homeowners fit to, I think, the neighborhood context and not exactly go to full entitlement either. So I think there is some flexibility around desiring and wanting to see things like 80 use permitted to be built, built in anywhere in Denver and working with residents and homeowners to make sure they'",
        "'speaker_0': 'they fit. If they tore down that single family home, they can build a bigger home. It takes up much more of the envelope of that property without, you know, without rezoning either or or additional waivers. So I appreciate, I think, the discomfort with flexing what is currently in the zoning code, but I don't know that it was'",
        "'speaker_0': 'it necessarily goes against, I think, the intention of blueprint. I will I think this one, though, really does, I think call into question a couple issues that have come up with smaller lot sizes and just guidance on whether something that applies in an F one with 25 additional feet still applies as is in a smaller lot.'",
        "'speaker_0': 'So I think that kind of guidance is desired here. And one of the things that I won't be supporting it tonight either, but I do know that that is one of the things that CPD is responding to in terms of really making it use accessible and flexible for lots of different lot sizes.'",
        "'speaker_0': 'So I appreciate that from the department that the public hearing is closed. Oh, we already did that. Right. Uh, Madam Secretary, roll call on Council Bill 22, dash 004 for.'",
        "'speaker_3': 'Black. Clark.'",
        "'speaker_2': 'No. FLYNN No. Herndon No.'",
        "'speaker_3': 'Hines No.'",
        "'speaker_2': 'Cashman No.'",
        "'speaker_3': 'Ortega No. Sandoval No. Sawyer No. Madam President?'",
        "'speaker_0': 'No. Madam Secretary, closed the voting and announced the results. Ten days, ten days. Cancel Bill 20 2-00 for four has failed. There being no further business before this body. This meeting is adjourned.'"
    ]
}