{
    "Proclamation for Indigenous Peoples Day.": [
        "'speaker_0': 'All right. Right on. Thank you, Councilwoman Sandoval. All right. Proceeding along. There are no presentations this evening. There are no communications. There is one proclamation being read this evening. Counsel Pro Tem Torres, will you please read Proclamation 20 1-1202.'",
        "'speaker_7': 'Thank you, Madam President. Proclamation number 21, dash 1202 in observance of the sixth annual Indigenous People's Day in city and County of Denver. Whereas the Council of the City and County of Denver recognizes that the indigenous peoples have lived and flourished on the lands known as the Americas since time immemorial, and that Denver and the surrounding communities'",
        "'speaker_7': 'are built upon the ancestral homelands of numerous indigenous tribes, including the southern Ute, Ute mountain tribes of Colorado. And. Whereas, the tribal homelands and seasonal encampments of the Arapaho and Cheyenne peoples along the banks of the Cherry Creek and South Platte River in Confluence gave bearing to future settlements that would become the birthplace of the Mile High'",
        "'speaker_7': 'City. And. Whereas, Colorado encompasses ancestral homelands of 48 tribes, and the city and county of Denver and surrounding communities are home to descendants of approximately 100 tribal nations. And. WHEREAS, on October 3rd, 2016, the Council of the City and County of Denver unanimously passed Council Bill 16, Dash 801, officially designating the second Monday in October of each'",
        "'speaker_7': 'year as Indigenous Peoples Day in Denver, Colorado. And. Whereas, the Council of the City and County of Denver continues to recognize and value the best contributions made to the community through indigenous peoples knowledge, science, philosophy, arts and culture.'",
        "'speaker_7': 'And through these contributions, the City of Denver has developed and thrived. And. WHEREAS, the Council of the City and County of Denver acknowledges that the health, wellness and safety of our indigenous community is of paramount importance for current and future generations to thrive and contribute to our whole community.'",
        "'speaker_7': 'And. Whereas, in the vein of promoting wellness, healing and Safety, it was an indigenous community members diligence persistence that exposed an active and nearly 150 year old state proclamation that threatened the health and personal safety of the Indigenous community.'",
        "'speaker_7': 'And. Whereas, that same Indigenous community members leadership brought formal and public rescission of that ongoing historical trauma contributor. Now, therefore, be it proclaimed by the Council, the city and county of Denver, the that the Council of the City and County of Denver celebrates and honors its cultural and foundational contributions of indigenous people to our past, present and'",
        "'speaker_7': 'future, and continues to promote the education of the Denver community about these historical and contemporary contributions of indigenous people. That the city and county of Denver, Colorado does hereby observe October 11th, 2021, as Indigenous Peoples Day, and that the city and the Kirk of the city and county of Denver shall attest and affixed the seal of the'",
        "'speaker_7': 'city and county of Denver to this proclamation, and that the copy be transmitted to the American Indian Commission and the Colorado Commission on Indian Affairs.'",
        "'speaker_0': 'Thank you, Counselor Pro Tem Torres. Your motion to adopt.'",
        "'speaker_7': 'I move that proclamation 20 1-12. Oh, to be adopted.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Comments by members of Council Counsel Pro Tem Torres.'",
        "'speaker_7': 'Thank you, Madam President. It is an honor to continue to acknowledge today through proclamation. It was our District three predecessor, now Clerk Lopez, who carried this bill with the work of the American Indian Commission. So I thank them, I think his work.'",
        "'speaker_7': 'But overall, I really do think that community for ensuring we are reflective, we are accountable and we are transparent when it comes to acknowledging, correcting, including and prioritizing our indigenous community in Denver. So thank you to the commission.'",
        "'speaker_7': 'Thank you to Rick Williams and your family. And thank you to all of our organizations who carry on this work.'",
        "'speaker_0': 'Thank you. Council Pro-Tem Torres. Councilwoman Ortega.'",
        "'speaker_7': 'Sorry. I'm not sure if that's on.'",
        "'speaker_0': 'So I'm sure now. Okay, go ahead.'",
        "'speaker_7': 'Gentlemen, tourists, thank you for bringing this forward again this year. I think it's important to acknowledge the presence and contributions that our native community has contributed to the city of Denver. Our our history originated down at the Confluence Park.'",
        "'speaker_7': 'And speaking of Parks Councilwoman Commission, I have served on a committee that has looked at a number of our city parks and other properties that have looked at whether we should be renaming or reframing and educating our community.'",
        "'speaker_7': 'And there are a number of those that have been recommended to move forward to the Parks Department for some renaming. And so that is in follow up to a lot of this work that has continued since Councilman Paul Lopez brought this forward.'",
        "'speaker_7': 'So I just want to acknowledge that and those of you who have been part of those discussions. So thank you very much. Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Ortega. And I'll just go ahead and chime in here. I really appreciate my colleague, Council Pro Tem Torres, continuing on this tradition and sponsoring this proclamation. It's very important and it provides the correct history that we want to make sure and continue on within our communities and really appreciate all of the support and work'",
        "'speaker_0': 'that our partners, especially our commission and community members, continue on doing this work to make sure that we are acknowledging folks in the proper way. And so with that being said, Madam Secretary, roll call, please.'",
        "'speaker_5': 'Sandoval.'",
        "'speaker_7': 'I. Torres I.'",
        "'speaker_2': 'Last class if1i Herndon.'",
        "'speaker_1': 'I High High.'",
        "'speaker_5': 'Cashman.'",
        "'speaker_1': 'High.'",
        "'speaker_5': 'Kinney.'",
        "'speaker_7': 'I.'",
        "'speaker_5': 'Ortega Sawyer I Madam President.'",
        "'speaker_0': 'I Madam Secretary, close the voting and announce the results.'",
        "'speaker_5': '12 Hours.'",
        "'speaker_0': '12 eyes Proclamation 20 1-1 to oh two has been adopted. Counsel Pro Tem Torres will go ahead and start the timer. But I understand we've got a few more folks this evening. And so we want to give people the respect and time to accept this proclamation.'",
        "'speaker_0': 'And so we'll go ahead and hand it over to you.'",
        "'speaker_7': 'Thank you so much. And it's my honor to welcome up Christina maldonado, Bad Hand and Danielle Walker, co-chairs of the American Indian Commission. All right. Okay.'",
        "'speaker_4': 'Right. Thank you. I'm Cristina maldonado, Barron and co-chair the Denver American Indian Commission. My parents have been a part of the Denver community and native community for a long time, and now me being their youngest, being here is a very meaningful thing for me.'",
        "'speaker_4': 'And I will let Daniel Andrews. I'm here to stay quiet, be washed and to be with you. My chappy, my papa Lakota not E-R was lata. Not a tradition going in Manhattan, Denver, Colorado, L.A.. I greet you all, my relatives.'",
        "'speaker_4': 'I My name is Danielle Skywalker. I am Papa Lakota from the Standing Rock Sioux Nation, or also known as the great Sue Nation of the North Dakota. And I just really want to say thank you so much for recognizing indigenous people.'",
        "'speaker_4': 'Recognizing that we're still here, we're still contributing in very good, positive, thriving ways in this community, and we will continue.'",
        "'speaker_7': 'To do so.'",
        "'speaker_4': 'Thank you so much. And now we'd like to introduce Rick Williams, who is an elder in our community, to come up and say some words as well. And I just want to say, as he's coming up here, that he was the one that led the charge of the 157 year old banishing that proclamation where it made it'",
        "'speaker_4': 'legal until August of 2021 to kill Native Americans. And he was the one that decided that that's absolutely wrong. And we can't even believe that that was part of current day history.'",
        "'speaker_1': 'Oh my, don't calliope, let alone better.'",
        "'speaker_8': 'Leila Washtenaw Indigenous Day is a very good thing.'",
        "'speaker_9': 'It's been a long time coming. My great, great great.'",
        "'speaker_8': 'Grandfather was Whitehorse. He was part of the military societies that lived here for generations and generations and generations. When I learned, I wanted to learn more about him. And when I started that investigation, I found the proclamation that was still a law that allowed citizens of Colorado to kill Indians.'",
        "'speaker_8': 'We got it removed was a great victory.'",
        "'speaker_1': 'But it's only the beginning. I challenge each and every one of you to read two books.'",
        "'speaker_8': 'The huge must go and chief left hand, and you will learn the real history of Colorado.'",
        "'speaker_1': 'You will learn that.'",
        "'speaker_8': 'The city of Denver.'",
        "'speaker_2': 'Was culpable.'",
        "'speaker_8': 'In the taking of Indian land in 1861.'",
        "'speaker_1': 'You will learn that.'",
        "'speaker_8': 'This land that we're living on right now. Was disputed by a federal district attorney who said this land was never ceded and nothing was ever done about it.'",
        "'speaker_1': 'You will learn a lot.'",
        "'speaker_8': 'About the history of Colorado, but I think most of all. And it's you know, it's really sad to know that because of this history, there were no reservations on the front range of Colorado nor on the Eastern Plains.'",
        "'speaker_8': 'And it was because of one word genocide.'",
        "'speaker_9': 'All of the proclamations.'",
        "'speaker_8': 'Led to the Sand Creek massacre, which virtually eliminated the people from the Eastern Plains and the front range. And that's the legacy we have today.'",
        "'speaker_1': 'I thank you again. I appreciate it. In Oklahoma, Dr. Roxie Romulo.'",
        "'speaker_4': 'Now. I'd also like to welcome Rafael Maldonado back and he is our artist recipient for Artist Award 2020.'",
        "'speaker_1': 'I am off. I am running out of bad hand. I am an indigenous American comic artist. I do have some work here that I'd like to share. Assuming I can figure it out. I've never been good at this stuff, so I apologize.'",
        "'speaker_1': 'Um. I created a book called Pia, and the lead character is a nine year old little girl who is surviving on her own in a post-apocalyptic world where everything is just kind of gone to the wayside. And we are now prey for every little, little and big creatures that are around.'",
        "'speaker_1': 'She gets separated from her dad, and she's surviving by learning the lessons that he was teaching her throughout their childhood and now trying to find him on her own. So all these little creatures kind of just represent the struggles that our children are going through currently in life.'",
        "'speaker_1': 'It's also a book to represent the strength that our children have and the fact that they can carry on and the surprises that they have to show us as parents and even elders. I do collaborate with local artists and artists around in the US.'",
        "'speaker_1': 'The first cover here was actually by my wife Cristina maldonado. That hand, the second one in the row there it was by AC Kanellis. He is a local artist native. And that third one there is by Andrew Sanchez.'",
        "'speaker_1': 'He's out of New Mexico. And then this fourth one over here, the little cute one was by a real close friend of ours named Bob Parks. And he's a local resident as well. So I like to kind of get out and show a little more diversity with everybody.'",
        "'speaker_1': 'This is currently a book that I'm going to be working on with Richard Crow Song out of Seattle. It is Billy the Boy Bomb, and it takes place in the nineties and it deals with a lot of trauma that's on the reservations, but also with a superhero stick to it as well.'",
        "'speaker_1': 'So it's dealing with kids that are coming to terms with what's going on in their world and one boy standing up to everything and trying to right what's wrong and standing up to injustice. But yeah, that's pretty much it.'",
        "'speaker_1': 'I mean. And thank you very much.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_0': 'Well, very good. Well, thank you all for joining us this evening. And we appreciate you sharing your stories and the work that you're continuing on and sharing the couple of books and what we can do to continue to educate ourselves about this.'",
        "'speaker_0': 'And so really appreciate you being here. And it's an honor to acknowledge and celebrate Indigenous Peoples Day and all the accomplishments and the history as well. Thank you. Counsel Pro Tem Torres. All right. We're going to go ahead and move on in our agenda this evening.'"
    ],
    "Professional Services Agreement with World Wide Technology, LLC for CISCO Equipment Maintenance.": [
        "'speaker_0': 'No items have been called out under pending. No items have been called out. Madam Secretary, please put the first item on our screens. Councilmember Sawyer, will you please put Council Resolution 1084 on the floor for adoption and.'",
        "'speaker_4': 'The solution 20 1-108 or be adopted.'",
        "'speaker_0': 'Thank you. It has been moved and seconded comments by members of Council on Council Resolution 1084. Councilmember Sawyer.'",
        "'speaker_4': 'Thanks, Madam President. This is an on call contract. And as you know, I have a lot of concerns about agency use of on call contracts for particularly for many millions of dollars and over an extended number of years.'",
        "'speaker_4': 'So just call it out so that I can vote no. Had a great conversation with tech services earlier today about potentially making some changes so that we as counsel get some reporting on these kinds of on call contracts from tech services so that we maintain oversight of the money while still allowing the city to function like it'",
        "'speaker_4': 'should. So hopefully those conversations are coming back. Thanks.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer. Madam Secretary, roll call on Council Resolution 1084.'",
        "'speaker_5': 'Sandoval.'",
        "'speaker_6': 'Hi.'",
        "'speaker_5': 'Sawyer. Torres.'",
        "'speaker_2': 'Black eye.'",
        "'speaker_5': 'Clark. Eye for an.'",
        "'speaker_9': 'Eye.'",
        "'speaker_5': 'Herndon.'",
        "'speaker_6': 'I know Cashman.'",
        "'speaker_5': 'I can teach Ortega. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close of Iranian. Announce the results one day.'",
        "'speaker_5': 'Ten eyes.'"
    ],
    "Amendatory Agreement with the Colorado Coalition for the Homeless for Emergency Shelter and Health Services.": [
        "'speaker_0': 'Ten eyes. Council Resolution 1084 has passed. Madam Secretary, please put the next item on our screen. Councilmember Steuer. Go ahead with your questions on resolution one 1 to 7, please.'",
        "'speaker_4': 'Thinks that a president I believe host is here. Thanks for being here, you guys. Just a couple of questions about this. So it's a it's an amendment to a contract that already exists, this contract. What is the original?'",
        "'speaker_4': 'How much is the original contract for? So the original contract and the amendment are the same amount. So this amendment is a no cost amendment just to extend the term. And the total cost is $932,358. Okay, great. And so it's a it's just a term extension.'",
        "'speaker_4': 'How long is it being extended until? Seven months total. So going from a previous end date of January 31st of 20 to out until August 31st of 22. Okay. And does is maintenance of properties included in this contract?'",
        "'speaker_4': 'No, this is just a contract for the provision of integrated health supports as part of our COVID response under the Emergency Solutions Grant Coronavirus Relief Fund. So this is particular to the Coalition for the Homeless Provision of Integrated Health Services at one particular shelter location.'",
        "'speaker_4': 'Okay, great. So do you know how much we have contracted with CCH over the course of just this year? I don't have that number. But through many contracts throughout the Department of Housing Stability. Okay. Do you know how many partnerships, separate partnerships we have with CCH in the city?'",
        "'speaker_4': 'Contracted partnerships. I don't have that number either, but could work to get that to you. Okay. Appreciate it. Just so we have several properties in District five that and CCH has failed to maintain them, has struggled to be responsive or accountable to the residents, to residents of the buildings themselves, residents of the neighborhood that the buildings are'",
        "'speaker_4': 'located in. Resident failed to be responsive to the council office. It's it's a little bit concerning. We have to have six month check in meetings with the residents of the buildings, the two neighborhood organizations, the council office, the police, the Department of Transportation and Infrastructure host as an invited the city attorney's office has been invited.'",
        "'speaker_4': 'And so I'm just a little bit concerned about the number of contracts that we have and with CCH and how many, you know, that we are giving them extended responsibility when they are not maintaining the current agreements that they have with our community.'",
        "'speaker_4': 'Thank you for sharing that feedback. I think that's something I definitely want to talk with the Coalition about. I know in our space of homelessness resolution they are really vital partner, particularly around the the efforts we have around street outreach, the efforts we have around supportive housing and the efforts that we have around integration of health care'",
        "'speaker_4': '. And so the I, I just want to say, you know, they're a really crucial partner to the city of Denver. And so it sounds like we have some work to do to work on that partnership, particularly around your concerns of property management.'",
        "'speaker_4': 'And so I will absolutely bridge a connection back there and see how we can work to to improve communication and feedback about the efforts that they're doing. I really appreciate that. Thank you. And I recognize that they are, you know, really important partner to our city.'",
        "'speaker_4': 'But I do think it is concerning that they are not held accountable for their existing contracts, that we continue to extend contracts and create new contracts with them. Does this contract cover the Coliseum? No. This is particular to the shelter at 4600 East 48th Avenue.'",
        "'speaker_4': 'Okay. So who then is in charge? Which of our partners is in charge of management of the Coliseum? So our contract for operations at the Coliseum is between the Salvation Army and the Department of Housing Stability. Okay. There's also additional staffing provided through Bayard Enterprises.'",
        "'speaker_4': 'And then overall, many of the overall maintenance issues related to the Coliseum are actually handled directly by the city through arts and venues and our city facilities teams. Okay, that's good to know. Our office received some really concerning emails regarding an.'",
        "'speaker_4': 'Elderly gentleman who is currently residing in the Coliseum, who is wheelchair bound and who has purchased his own shop vac to to clean up the sewage that is backing up underneath his bed. Can you explain why that is happening and what steps have been taken to ensure that that is no longer going to continue to occur?'",
        "'speaker_4': 'Yes. So we'll work to provide some more formal feedback as we get all of the resolution worked out. But I also received that email on Friday afternoon and we sprung into action with our partners at arts and venues getting plumbing on site immediately.'",
        "'speaker_4': 'They have since dealt with the backflow issue and I understand as of today's report that everything is back to functioning normally. Ultimately, this emergency COVID shelter that was set up at the Coliseum is providing residential spaces in a building that was never designed for that, with infrastructure lacking to handle the amount of human waste that that it's'",
        "'speaker_4': 'seeing every day. And so we're working with our partners at arts and venues and city facilities to work on some regular clean out of that. But definitely. Appreciate that that issue is flagged to us and we're working to resolve it, as well as working to address where folks are situated, if there are ongoing concerns around this particular'",
        "'speaker_4': 'backflow. Okay. I appreciate that and would really appreciate an update because how many seats does the Coliseum have? Seats? Yeah. Do you know? No, I don't know. I think it's somewhere around 10,000. So that's a. That should have capacity.'",
        "'speaker_4': 'How many people are staying at the Coliseum right now? So we have a capacity of 425. It's a mixture of the you know, during an event, you might have up to 10,000 people at once. But it's the all day, every day where and here's how it's explained to me as well as I sometimes folks flushing things that'",
        "'speaker_4': 'don't belong in toilets. So there's there's often some infrastructure. Part of what we put forward in our ARPA requests around helping to support for infrastructure improvements are things like waste grinders in the in our plumbing at big buildings like this to help handle in the future if we have to repurpose buildings for residential shelter that can help'",
        "'speaker_4': 'handle that load. Okay. I really appreciate that. Thanks for bringing into action and sorting that out. It's an incredibly concerning report and I hope we don't ever hear anything like that again, but thank you for being responsive to it and thanks for your partnership and all of your hard work and everything you're doing to oversee all of'",
        "'speaker_4': 'our shelters right now. Thanks, Madam President. Thank you.'",
        "'speaker_0': 'Thank you, council members, for your for the record, do you want to go ahead and introduce yourself and share what agency you're with?'",
        "'speaker_4': 'Yes. I'm Angie Nelson, deputy director of the Department of Housing Stability, overseeing homelessness resolution and Housing Stability Division.'",
        "'speaker_0': 'Very good. Thank you, Angie, for being here. All right. That concludes the items to be called out this evening. All bills for introduction are ordered published. Council members remember, this is a consent or block vote and you will need to vote I.'"
    ],
    "Rezoning for Accessory Dwelling Unit at 3428 West Moncrieff Place.": [
        "'speaker_0': 'Please wait until our meeting. Host Promote you to speaker. When you're promoted, your screen will flash and say Reconnecting to meeting. Please don't leave the meeting. You will be reconnected and will need to turn on your camera if you have one.'",
        "'speaker_0': 'And your microphone. You will see your time counting down at the bottom of your screen. Once you finish speaking, you will change back to participant mode and see your screen flash one more time. All speakers should begin their remarks by telling the council their names and cities of residence and if they feel comfortable doing so.'",
        "'speaker_0': 'Their Home Address. If you've signed up to answer questions, only state your name and note that you're available for questions of counsel. Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted.'",
        "'speaker_0': 'Will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating to virtual participants. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech.'",
        "'speaker_0': 'Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilmember Sawyer, will you please put Council Bill 939 on the floor for final passage?'",
        "'speaker_4': 'I move the Council Bill 20 1-0939 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. The required public hearing for Council Bill 939 is open and we have Fran here and we have the staff report, please.'",
        "'speaker_5': 'Great. Um. Great. Good evening, members of City Council and associate city planner with Planning Services. And tonight we're looking at a rezoning request for 3428 West Moncrieff Place. The subject property is in Council District One represented by Councilmember Amanda Sandoval.'",
        "'speaker_5': 'In the West Highland neighborhood. The property is located mid-block between Julian Street and Laurel Boulevard along Moncrieff Place. The site is 4625 square feet and currently contains a single unit home. The applicant is requesting to rezone from U.S., U.K. to U.S. U.K. one to allow for an EU at the rear of the property.'",
        "'speaker_5': 'All other forms and new standards will remain the same. The property is currently in the urban single unit Asian district, which allows for a minimum zone lot size of 3000 square feet. As you can see on the map, the surrounding properties are also shown us a to the east, north and west of the property.'",
        "'speaker_5': 'But south you can see some GM you eight zoning and you may see three to the southwest. The current land use for the site is single unit residential and in the immediate vicinity. The area's land use are mostly other residential uses with a parking lot right next to the property to the west and a multi-unit residential building'",
        "'speaker_5': 'to the south. Shown on these photos. The character of the neighborhood is mostly residential. The subject property can be seen on the top right image of the slide. Throughout the rezoning process, application modifications had been provided according to Code Requirements Planning Board recommended approval analysis on August 18, and to date, staff has not received any letters from'",
        "'speaker_5': 'the public or any. Now moving on to the Denver zoning code, we have five review criteria that we must find. The request map amendment is consistent with the five with you. The first criteria is consistency with the adopted plans.'",
        "'speaker_5': 'There are two plans applicable to his rezoning. The first one is comprehensive plan 2040. The second one is Blueprint Denver. Stated in the staff report. The rezoning is consistent with several goals in the comprehensive plan 2040. This MAP amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead to'",
        "'speaker_5': 'an environmentally resilient Denver by promoting infill development where infrastructure and services are already in place. Now moving on to the consistency with Lupe in Denver. The subject property is mapped as part of the urban neighborhood context. The future places map designates the subject property as low residential place like this place types have predominantly single and two unit'",
        "'speaker_5': 'uses and accessory dwelling units are appropriate. Moncrief Place is designated as a local street, which is mostly characterized by residential uses. The growth area in in Denver is all other areas of the city. This area is anticipated to see 10% employment growth and 20% housing growth by 2040.'",
        "'speaker_5': 'Finally blueprint also includes specific policy recommendations. Housing policy number four focuses on diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas. Stuff also finds that the requested signing meets the next two criteria. The rezoning will result in uniformity of district relations and will further the public health, safety and welfare primarily through its'",
        "'speaker_5': 'implementation of adopted plans. The justified circumstance for this rezoning is clear. The plan sees the approval of the existing U.S. UAS en district. The city has adopted the Comprehensive Plan and Blueprint Denver, a stated throughout this presentation. The proposed rezoning meets the intent of this plan's.'",
        "'speaker_5': 'Overall, the proposed rezoning is consistent with the urban neighborhood context residential districts and the you as a one zone district. With that, a recommend approval based on finding all review criteria has been met.'",
        "'speaker_0': 'All right. Thank you, friend, for the staff report. And this evening, we have two individuals signed up to speak and they are both joining us online. And our first speaker is Simon, Toronto.'",
        "'speaker_2': 'I suspect that these are.'",
        "'speaker_1': 'Hello, everybody. My name is Simon Taranto and star daughter Luna. We're the property owner and applicant of the change. We recently welcomed our second and third kids as twins to our family and we love our house and neighborhood and are looking for ways to help our family come help us.'",
        "'speaker_1': 'So our main motivation for the ADA expansion is that we can stay here and have our family come help, help us. We gathered input from our neighbors through this process and we're requesting that the City Council vote to approve Council Bill 210939 and rezoning 3428 West Moncrief place to usou a a1 to allow for an 80.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'All right. Thank you very much, Simon, and your little helper there. Appreciate that. Our next speaker is also joining us online, Bruce O'Donnell.'",
        "'speaker_1': 'Hello there. Madam President, can council hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Thank you. Good evening. Bruce O'Donnell and I've been helping the applicant on this application and consistent with staff's recommendation for approval and planning board's recommendation for approval and the consistency with adopted plans. I also asked the City Council to approve Council Bill 20 1-0939 Rezoning 3428 West fifth place to you sue A1 to allow for you and'",
        "'speaker_1': 'I'm available to answer any questions that count. Members of Council have it. Thank you.'",
        "'speaker_0': 'All right. Thank you, Bruce. That concludes our speakers for this first hearing. Questions from members of Council on Council Bill 939. And we have first up, Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Madam President. So I'm not sure who to direct this to. But first of all, these are very narrow lots. And I. Can you clarify what the minimum size is that can actually squeeze another building on a lot?'",
        "'speaker_7': 'Or is this intended to be an addition to the existing structure?'",
        "'speaker_5': 'The applicant didn't specify if he was going to build a detached edu or an attach, but I mean, he could do either the Lord would allow it be sure that the lot is 35.5.'",
        "'speaker_7': 'So is there a minimum size then that the building. If it's a detached. Does it have to be significantly smaller than the structure in the front assuming it's in the back?'",
        "'speaker_5': 'Well, it's going to have to comply with the setback. So it's going to have to comply with the I don't know if it's three or five would set back on the side and then in the back. So as long as it complies with the setback, that's what the building can as wide as it can go.'",
        "'speaker_7': 'So let me ask the applicant if he'll come back on to just let us know if he's looking to do a separate structure or just add on to the existing structure. Simon, would you mind coming back on?'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Thank you for the question. We would be planning to do a detached fracture. Were you able to hear me? Sorry, but I'm sorry. Could you repeat the question? I lost the first few words.'",
        "'speaker_0': 'Go ahead, Councilwoman, if you want to restate your question.'",
        "'speaker_7': 'Simon, will your structure that you're requesting this rezoning for be attached to the existing building, or are you looking at a separate building on the site?'",
        "'speaker_1': 'Got it. Thank you for the question. Can you can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Perfect. Thank you. It would be a detached building.'",
        "'speaker_7': 'I'm just curious how big of a structure you're able to get on such a small lot?'",
        "'speaker_5': 'It doesn't allow more than 645. I'm pretty sure that the number four.'",
        "'speaker_7': 'Is that square feet 645. Okay. So that's not a big structure then?'",
        "'speaker_5': 'No. So it has different tiers. So depending on the lot size. So if it is smaller than 6000 square feet, I think it's 650. And then if it is between seven 6007 thousand, it's 845. And then anything bigger than 7000, it's like a thousand square feet.'",
        "'speaker_5': 'So it has tiers depending on.'",
        "'speaker_7': 'The size of the loft, depending on the size of one. Okay. Thank you. I have no further questions.'",
        "'speaker_0': 'Uh, Councilwoman Bruce O'Donnell has his hand up virtually. Did you want to hear from him? Sure. Okay, you can go ahead.'",
        "'speaker_4': 'So, Bruce.'",
        "'speaker_1': 'Thank you, Madam President. I was just going to explain exactly what Fran just explained, that the zoning code on a lot of this size has a maximum limit of 650 square feet for an 80. A detached 80.'",
        "'speaker_7': 'You so much.'",
        "'speaker_0': 'All right. Great. Thank you, Bruce. And thank you, Councilwoman Ortega. We don't have anyone up in the queue for any other questions from members of council. The public hearing is closed. Comments by members of Council on Council Bill 939.'",
        "'speaker_0': 'And we'll start out with Councilmember Sandoval.'",
        "'speaker_7': 'Thank you, Madam President. Thank you, Simon. This application meets all the criteria, so I would ask that my colleagues support it. My office has met with the West Highland Neighborhood Association, which this property is located within, to see if they would like to go within legislative rezoning or to allow accessory dwelling units throughout the neighborhood.'",
        "'speaker_4': 'They are still deciding that.'",
        "'speaker_7': 'So until that time, we will continue to see one offs throughout this neighborhood. Thank you. And I ask my colleagues to support this this evening.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval, and I agree with you. This meets all of the rezoning criteria and happy to support it this evening. Madam Secretary, roll call on Council Bill 939.'",
        "'speaker_5': 'Sandoval.'",
        "'speaker_2': 'I. Yeah.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Torres.'",
        "'speaker_7': 'Black eye color.'",
        "'speaker_1': 'Eye.'",
        "'speaker_5': 'For an.'",
        "'speaker_1': 'Eye.'",
        "'speaker_5': 'Herndon.'",
        "'speaker_2': 'Eye.'",
        "'speaker_5': 'Catching I.'",
        "'speaker_1': 'Can.'",
        "'speaker_5': 'Each eye. Ortega, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_5': '11 Eyes.'"
    ],
    "Map Amendment for Signage Allowances at Union Station.": [
        "'speaker_0': '11 Eyes Council Bill 20 1-0939 has passed. Thank you, Fran. I we'll go ahead and move to our second hearing. Councilmember Sawyer, will you please put Council Bill 944 on the floor for final passage?'",
        "'speaker_4': 'I move that council bill 21 does 0944 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. The required public hearing for Council Bill 944 is open. May we have the staff report?'",
        "'speaker_8': 'Hi, certainly. Good evening, council. I'm Brandon Shaver, senior city planner CPD presenting an official map application for 1901 West Street, 1600 and 20th Street and 1601 19th Street, requesting a rezoning from Pdg 19 to Pdg 26. As this request is a party to city rezoning and is closely linked to an approved, comprehensive signed plan and a forthcoming'",
        "'speaker_8': 'comprehensive site plan Amendment staff found it important to highlight the following. The current PD G 19 was adopted in November 2018, and the current comprehensive site plan, or CSP, was approved in December of 2020. Comprehensive signed plans allow for flexibility in same types, same area and same location, more so than can be achieved through the regular sign'",
        "'speaker_8': 'regulations in Article ten of the Denver Zoning Code. This flexibility is offered in exchange for a higher degree of design and use of high quality materials and require enhanced review by staff and other design professionals depending on where the project is located in the city.'",
        "'speaker_8': 'In this case, the Comprehensive Signage Plan was reviewed by Landmark Preservation Staff to ensure compatibility with the abutting historic district. All elements of PD G 19 are proposed to be carried forward and the new PD, including the design standards and Guidelines and includes the inclusion of two unique signs in the current Comprehensive Sign Plan, with allowances for'",
        "'speaker_8': 'animation and limited offsite advertising varying between the types. These types include the Content Plaza, canopy screen and the open space area and dynamic banner ground signs along the Wynkoop Promenade. As I mentioned, a forthcoming comprehensive site plan amendment is anticipated to go in from the planning board and then on to the zoning administrator in the coming weeks'",
        "'speaker_8': '. And they will provide more detail on the public art and screen component, which could include a design review board or design board and a nonprofit organizations to use for curation, as well as a reporting mechanism to demonstrate compliance with the duty and mitigate any potential negative impacts.'",
        "'speaker_8': 'As some councilmembers may have noticed of the dynamic vendor, ground science and content plaza canopies screen are currently in operation on the site from 9 a.m. to 11 p.m.. This was due to the applicant's request to activate Configure Square in advance of and during the All-Star Game events that occurred in July.'",
        "'speaker_8': 'They were also granted a variance by the Board of Adjustment on July 13th to extend the temporary use permit and continue operation of these sites. There are other areas and districts in the city where these special site allowances are granted.'",
        "'speaker_8': 'These include the downtown Denver Theater District and Station, the National Western Center and the Billboard Use Overlay. In many of these instances, a planning document was adopted by council that spoke directly to the desire to allow special signage.'",
        "'speaker_8': 'The requirements and restrictions tied to these allowances can be found in the respective sections of the Denver Zoning Code. There are a number of considerations that were taken into account and staff reviewed this request. These include the unique, unique site configuration.'",
        "'speaker_8': 'And Jason has previously mentioned the fact that the subject site is on one's own, not that the billboard use overlay cannot be mapped where it does not currently exist and the public benefits provided by this party request. Now moving on to the requests, it's in Council District nine, represented by Councilwoman CdeBaca in the Union Station disco neighborhood'",
        "'speaker_8': '. As previously mentioned, current zoning on the site is June 19 and there are a number of zoning designations surrounding the subject site, including eight, which is light industrial at Coors Field, IMX eight to the northwest, lower downtown zoning across 19 Emwazi streets and pads to the west and southwest.'",
        "'speaker_8': 'Again. Pdg 19, was approved in late 2018. It is based on the DA's 12 plus zone district, which can be found a few blocks to the north and east and at a high level. This PD provides a tailored building forms of private open space requirement and a parking maximum.'",
        "'speaker_8': 'Existing land use on the site is shown as vacant as this data was last compiled before construction of McGregor Square had commenced. When updated, the site would show a mix of uses including commercial, retail, multi-unit, residential and mixed use in office.'",
        "'speaker_8': 'Surrounding land uses include mixed use multi-unit residential across the Wynkoop Promenade and 19th streets, office entertainment, cultural land use at Coors Field and vacant land uses to the east of the site. These photos give you a sense of the building, form and scale on the area with the subject property and the wynkoop promenade under construction at the'",
        "'speaker_8': 'top left. And the photo on the bottom right is an example of the historic context in which the subject property is adjacent to. As previously stated, this party request would formalize the inclusion of two unique sign types across the site, each with their own minimum percentages of public art and screen share.'",
        "'speaker_8': 'These same types would allow for animation and limited offsite advertising, with further restrictions on signs within 50 feet of the lower downtown historic district to respect the character and minimize impacts for drivers along Wynkoop Street. Additionally, the Pudi outlines and enhanced CSP requirements at the site that would provide more guidance on the public art and screen share'",
        "'speaker_8': 'component and contain a reporting mechanism to demonstrate compliance with the duty and mitigate any negative impacts should they arise in the future. Informational notice of this application was sent in early March and the Planning Board public hearing was continued on July 21st to August 18th to allow the applicant team to respond to questions raised by the board'",
        "'speaker_8': '. Notice of today's meeting was sent on September 20th and as a present to comments and received a letter of support and position. Letter for the party were received by the LoDo District R.A., as well as a letter from the condo building across Wynkoop Promenade supporting the extension of the temporary use permit.'",
        "'speaker_8': 'So based on the comments received at the July 21st planning board hearing here you can see the changes that the applicant made to their proposal, and ultimately it was recommended for approval on an 8 to 1 vote at the August 18th meeting.'",
        "'speaker_8': 'I'll quickly go through the first five criteria, beginning with consistency, with adopted plans. We have four plans for land use guidance here. We find this request to be consistent with many of the strategies and plan 2040. So I move directly to Blueprint, which maps this as a downtown neighborhood context.'",
        "'speaker_8': 'This is the densest and most active context in our city that gives prominence to the pedestrian realm. And this joining requests as it's based on a downtown district is consistent with the context map, the featured places map designates.'",
        "'speaker_8': 'This is a regional center. These places have the widest customer draw and provide a 24 seven live work and play environment. This rezoning request is consistent with the future place designation as it creates an environment for an active and lively pedestrian experience with urban building forms.'",
        "'speaker_8': 'Four Street types, both 19th NYC are classified as downtown arterials. These streets are surrounded by intense land uses and have a very high degree of building coverage which also cater to pedestrians. 20th Street, at the northern edge of the property, is a mixed use arterial, which is also characterized by a varied mix of land uses and multistory'",
        "'speaker_8': 'buildings with continuous building frontages. The requested property district is consistent with these street types because it allows for a variety of land uses at an intense scale focused around pedestrians. For Growth area strategy. Regional centers are anticipated to absorb 50% of new jobs and 30% of new housing by 2040.'",
        "'speaker_8': 'The proposed party allows for housing and job opportunities consistent with this plan direction. We also have additional recommendations from Blueprint that speak to updating or assigned code regulations to recognize changing technologies and limiting the use of custom zoning.'",
        "'speaker_8': 'In this case, a standard zone district does not exist to implement adaptive plans. Thus, custom zoning through the use of the PD was found to be appropriate and supported by CPD staff. Moving to the downtown area, a plan which was adopted in 2011.'",
        "'speaker_8': 'This plan has key recommendations relevant to the site. It calls for prioritizing pedestrians through the encouragement of housing and active ground floors. It also promotes enhancing the public realm and providing venues for outdoor activity while transitioning appropriately to the lower downtown historic district.'",
        "'speaker_8': 'The proposed PDE, with its high floor for heights, transition and building height special attention to the Wynkoop Promenade and private open space agreement is consistent with the downtown area plan. Next we have the Central Valley Comprehensive Plan Amendment from 1991.'",
        "'speaker_8': 'This guides the redevelopment of the Valley into a neighborhood with a mix of uses, open space and pedestrian network, strong connections to downtown, and a unique character that complements downtown. The subject site is identified as general mixed use, which includes office, retail, housing, entertainment and hotel, while specifically stating that light industrial uses are not allowed.'",
        "'speaker_8': 'The plan recommends mid-rise building heights as appropriate for this area and that the building index or the planned index should consider. The steering committee assumed a height of about 140 feet for these mid-rise areas. Here you can see the plan also identifies a primary pedestrian route across the site at the location of the current Wynkoop Promenade.'",
        "'speaker_8': 'Lastly, the plan identifies the site as being within the plan's sub area, which includes specific guidance that lower downtown's scale and character should set a precedent for the scale and quality of future development in pedestrian and bicycle access should be provided.'",
        "'speaker_8': 'It also calls for a small, open public space, and that development on the site should strengthen Moto's mix of uses. Therefore, the proposed rezoning is consistent with the CPV plant amendment as it will result in uses consistent with the plan.'",
        "'speaker_8': 'Facilitate compatible building form and design. Allow building heights that are generally consistent with the mid-rise height guidance. Provide an enhanced pedestrian connection recommended in the plan and provide open space coupled with design standards and guidelines that will ensure quality compatible development.'",
        "'speaker_8': 'Moving for the next two criteria. The rezoning would result in the uniform application of zoned district building form, use and design regulations, with the PD being based on a downtown zone district. It would also protect the public health, safety and welfare through implementing adopted plans and requiring enhanced design standards, open space amenities and custom sign regulations to'",
        "'speaker_8': 'mitigate negative impacts to surrounding properties. Significant development and redevelopment in and around the Union Station neighborhood, coupled with the city adapted plans that call for enhanced pedestrian amenities in downtown areas, serve as appropriate justifying circumstances. This rezoning is also consistent with the neighborhood context zone, district purpose and intent statements as it uses the 12 plus as a'",
        "'speaker_8': 'base with tailoring to ensure compatibility. There are also five additional PD specific review criteria that apply to this case. To begin, this PD is consistent with the intent and purpose of such districts as a customized approach is needed to address the unique downtown location while respecting the immediate historic context.'",
        "'speaker_8': 'Similarly, the beauty is not intended as a vehicle to develop the site and consistent with the surrounding contexts or to enhance economic feasibility as it is based on the downtown neighborhood context and is intended as a mechanism to ensure development is consistent with what adopted plans call for.'",
        "'speaker_8': 'The party must also create significant public benefit. These benefits include. The inclusion of public art, opportunities for family friendly events and private open space with within urban building forms. The rezoning also meets the next three specific criteria as it complies with the Vision 9.6.'",
        "'speaker_8': 'There is no standard zone district available to apply downtown appropriate science standards to address the uniqueness of the site, but that multiple variances waivers were conditions and the pre establishes permitted uses that are compatible and the same as the Ds220+ Zone District on which it is based.'",
        "'speaker_8': 'The party is also consistent with the last criterion, as it provides customization largely based on existing building forms found in the zoning code and incorporates design standards and guidelines based on those proposed square that are tailored to address adjacency to lower downtown, the Wynkoop Promenade and the private open space requirement.'",
        "'speaker_8': 'With that, CPD staff recommends approval of this rezoning request, finding that all ten review criteria have been met. That concludes this presentation and team is present in person if you have questions.'",
        "'speaker_0': 'All right. Thank you, Brandon. And this evening, we have seven individuals that signed up to speak. Our first three speakers are going to be in person. And so first up, we have Sean Maley.'",
        "'speaker_1': 'Signed up to answer questions. So I have only answers to questions if you have them. Thank you so much.'",
        "'speaker_0': 'All right. Very good. Thank you, Sean. Next up, we have John Young, new SKUs.'",
        "'speaker_7': 'So, you see.'",
        "'speaker_0': 'I might have missed pronounce it. I'll let you go ahead and correct me, sir.'",
        "'speaker_1': 'Thank you. It's Joni on a shoe ski, and I'm here just to answer questions.'",
        "'speaker_0': 'All right, very good. Our next speaker is Hal Roth.'",
        "'speaker_1': 'Good evening, Madam President and council members. I'm here to speak. So I'm Helle Roth with the West Flight LLC, the developer of the Gregor Square 2001 Blake Street, Denver. We're delighted to be before you tonight with an amendment to our PWD MacGregor Square that will complete the activation and placemaking for the over 50,000 square feet of open'",
        "'speaker_1': 'space that is accessible to the public. As you heard in the staff report, the purpose of this piece is to allow for specific types of signage, mainly video, which are appropriate in a downtown outdoor plaza context. Nearly all the signs are internal to the site, which serve to activate the 30% of open space on the site, enhance'",
        "'speaker_1': 'the pedestrian and events experience, and provide public benefits to arts, local nonprofits and small businesses. These signs were always part of our project and the design for the Content Plaza and were included in all of the presentations and renderings that we presented to you back in 2018.'",
        "'speaker_1': 'Since that approval, we continue to work with the city on our comprehensive sign plan and were informed in July of 2019 that we needed to amend the period to have video. We have been working with the city ever since on this amended PD and the related CSP.'",
        "'speaker_1': 'The video features are designed to attract people, their families, children and events to the plaza and enhance the widen the walkway or promenade, as Brandon referred to it, and are part of the 50 to 80 trail. We will also display a significant amount of art and have a screen share component to promote local nonprofits, public messaging and'",
        "'speaker_1': 'local small business all at no charge. The content for these elements will be helped by an advisory board, which will include representatives from the neighborhood, arts and nonprofit communities. We have also discussed partnerships with local art schools. The broader public benefits associated with McGregor Square include transforming an old parking lot into a redevelopment that will provide $125'",
        "'speaker_1': 'million for capital improvements over 30 years for Coors Field, at no cost to the city or the taxpayers and a larger generation of sales, private lodging and property tax revenue to the city. We'd like to thank the city staff who have spent countless hours with us on this project, as well as all the community groups and our'",
        "'speaker_1': 'closest adjacent neighbors for their input and support in this process. This is truly a project where all the collaboration with the neighborhood made the project what it is today and much better than when we started. Thank you. And we are available for questions.'",
        "'speaker_0': 'All right. Thank you very much. The rest of our speakers are joining us online. And I have next David Tweed. And so, David, if you could please raise your hand.'",
        "'speaker_2': 'We'll.'",
        "'speaker_0': 'Move you over to make sure you can. Share your comments with us. Okay. Go ahead, David.'",
        "'speaker_1': 'I'm just here to answer questions as necessary.'",
        "'speaker_0': 'All right. Thank you. Next up, we have Caroline White.'",
        "'speaker_7': 'Madam Chair, I am.'",
        "'speaker_4': 'Also here to answer questions.'",
        "'speaker_0': 'All right. Thank you. And then we have Rick, Nina, man. Go ahead, Rick.'",
        "'speaker_1': 'Good evening. My name is Rick Denman. I live at 1735 19th Street. I'm the board president for one Wynkoop Plaza. Essentially, our front door opens directly onto the winter walkway and faces directly at the Rally Hotel at McGregor Square.'",
        "'speaker_1': 'I wanted to attend today to again share why the LoDo condominium community supports the proposed zoning change at seven 1901 wasI. And to give kudos to my neighbors at McGregor Square for everything they've done and how great they've worked with us throughout the planning, construction and the operation of the development.'",
        "'speaker_1': 'The leadership of McGregor Square and the Rockies have communicated with residents and local businesses so as not to create undue or unforeseen problems. Naturally, with a project of this scope and magnitude, things come up. But I must share that these items were dealt with quickly and professionally and with good follow up communication.'",
        "'speaker_1': 'One Wynkoop Plaza, the LoDo and Ballpark communities were engaged in meetings and dialog right from the very start, including the acceptance of proposals from developers prior to the Rockies taking this project in-house. The project team told us exactly what was going to happen and when they listened to our concerns and actually made some changes so as not'",
        "'speaker_1': 'to create problems for us and other neighbors down the road. Following the construction, which we all survived, thankfully, we are still speaking to one another and prior to the opening of McGregor Square, residents were extremely concerned. What we could expect from the operation of such a large development prior to the opening, the McGregor Square leadership at giving'",
        "'speaker_1': 'us guidelines about operations and curfews on lighting, sound, live events and use of what I call the Jumbotron. I must say that our residents are very pleased with the McGregor Square team as they have more than lived up to their commitment to Curfew's noise and light and disruption.'",
        "'speaker_1': 'I can't imagine how we could have been more open and had better communication and responsiveness from our neighbors across the walkway. The long term benefits of having an urban resort out our front door far outweighs some of the dust and disruption we experienced during the build.'",
        "'speaker_1': 'Like so many other redeveloped urban communities around the country, this project brings new vibrancy to LoDo and downtown. It makes our city more of a destination spot. I regularly get asked while on my daily walks past Union Station, How does how do I find McGregor Square, which is the way to McGregor Square?'",
        "'speaker_1': 'The triad of Coors Field, Union Station and McGregor Square truly are the crown jewels of downtown Denver. Thank you very much. And thank you for your service to our community.'",
        "'speaker_0': 'Thank you. Our last speaker we have is Fabio Hilliard. And it doesn't seem like we have had Fabio joining us online and not in chambers. And so that's going to conclude our speakers this evening. Questions from members of Council on Council Bill 944.'",
        "'speaker_0': 'Councilmember Hines.'",
        "'speaker_1': 'Thank you. Council President. I also want to thank CBD for the presentation. I thank you the applicants for for being here tonight. I agree with with CBD. This is the core of the urban core and the density should be here.'",
        "'speaker_1': 'I also want to agree with the the plans that have been adopted as far back as the CPV plan in 1991 about how this should prioritize pedestrians and cyclists. So further, I want to thank Mr. Roth for acknowledging the 50 to 80 trail.'",
        "'speaker_1': 'It's very important to me and I and I think I think it will be transformative for our city center. I've heard that this location has a little bit of a hiccup. And so regarding the 50 to 80 trail.'",
        "'speaker_1': 'And so I wanted to ask if perhaps I'm inaccurate. So if I could ask either Mr. Roth or one of the applicants to the the question that I heard, the the hiccup that I've heard is that cyclists, as they go by in McGregor Square, will be required to dismount, even if it's along the 50 to 80 trail'",
        "'speaker_1': ', which is somewhat counter to the intent of the trail. And I just, you know, since. Since there is a bit of a transformative project just like this is. Perhaps I'm incorrect, but if someone could answer that question, that'd be great.'",
        "'speaker_1': 'Thank you. Skip. Thank you, Councilman. We have during games when there's heavy pedestrian traffic. Ask bicyclists to dismount for safety reasons. Now, if there are games or events going on, that's certainly something we can look at to to allow that.'",
        "'speaker_1': 'We would hope a bicyclist, though, would realize they need to be at a slow speed going through there. Oh, and during games that totally make sense. I mean, I've been to a game there. I'm sure that pretty much everyone who's watching this has as well.'",
        "'speaker_1': 'And, and it is probably unsafe for cyclists to be there in such a pedestrian friendly area outside of games. I, I just want to make sure that, that we are willing to take a look at the trail. The, the trail is not really meant to be a, a place for speed racers.'",
        "'speaker_1': 'It's really meant to be more of a community building trail. And so I would hope that cyclists would be at a slow speed throughout the trail. And if people are really intending to use commuting speeds, they would use other, other avenues.'",
        "'speaker_1': 'But but I want to. I guess I just ask you, you're willing to take another look at the the dismounting during non-game times? Yes, absolutely. Okay, great. Thank you. Thank you. Council president.'",
        "'speaker_0': 'Thank you. Councilmember Hines. The public hearing is closed. Comments by members of Council on Council Bill 944. All right. Not seen any. I'll go ahead and chime in, seeing that this does meet all of the criteria as presented.'",
        "'speaker_0': 'Happy to support it this evening and ask my colleagues to do so as well. Madam Secretary, roll call on Council Bill 944.'",
        "'speaker_5': 'All.'",
        "'speaker_2': 'I work. I climb. I flinch.'",
        "'speaker_5': 'I tendons.'",
        "'speaker_6': 'I.'",
        "'speaker_7': 'Cashmere.'",
        "'speaker_5': 'I can eat. I. Ortega. Sawyer, i. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_5': '11 Eyes.'",
        "'speaker_0': '11 Eyes Counsel Bill 20 1-0944 has passed. And before we go into the pre adjournment announcement, we have a member of our central team who I would love to come up a little closer or the Channel eight cameras can definitely get you.'"
    ]
}