{
    "Proclamation for the National Western Stock Show, Rodeo and Horse Show.": [
        "'speaker_1': 'Councilman Brooks. Katherine Brooks, would you please read the proclamation? 13.'",
        "'speaker_5': 'Thank you, Mr. President. I certainly will. Now, this isn't just an irregular discharge. This is Proclamation 13, welcoming the 110th National Western Stock Show, Rodeo and Horse Show to Denver. Whereas the annual National Western Stock Show Rodeo and Horse Show opens in Denver for the 110th time on January 9th, 2016.'",
        "'speaker_5': 'I just want to say we would have done this last Monday, but we didn't have council, so that's why we're a little late. Whereas the National Western Stock Show is a storied treasure of Denver's past with a unique and colored history dating all the way back to 1906.'",
        "'speaker_5': 'And. Whereas, Mayor Robert W Spear declared Wednesday, January 31st, 1906, Denver Stock Show Day an official holiday in the city of Denver so everyone could partake in the first ever stock show. It was on this day that banks, department stores and other businesses and every corner of Denver shut their doors at noon while streetcars bustle and hustled'",
        "'speaker_5': 'from the 15th street loop every 3 minutes to the stockyards and the Burlington Railroad rush. Special trains from Denver use Union Depot from the round trip charge of $0.25. Wouldn't it be nice to live here that day? And whereas, today, the primary mission of the National Western Stock Show is to educate urban and suburban citizens about the'",
        "'speaker_5': 'importance of understanding and preserving Colorado's Western heritage and agriculture, providing city kids hands on experience with farm animals, and to host one of the largest professional rodeo horse shows. And. WHEREAS, The National Western annually attracts more than 600,000 visitors from all 50 states and 40 foreign countries and contributes approximately $100 million to Denver's economy.'",
        "'speaker_5': 'And. Whereas, activities during the 15 day event include Wild West shows, horse shows, dancing horses, super dogs, a myriad of types of livestock, our expert expedition and also Colorado's largest trade show. And. WHEREAS, the voters of the city and county of Denver generously supported funding, the new vision of the National Western Center that sets in motion a'",
        "'speaker_5': 'new year round, a new year round destination of gold, promoting new out-of-state tourism that would generate job growth for generations to come and plan that will position Denver as a global player in the 21st century agriculture that were vanced.'",
        "'speaker_5': 'The knowledge of healthy food production and and safety at an international scale. Now therefore be a proclaimed by the Council of the City and County of Denver, section one that the Council hereby enthusiastically you can see by our dress welcomes the 110th Annual National Western Stock Show Rodeo Horse Show to Denver extends its best wishes and other'",
        "'speaker_5': 'exciting, exciting and successful year and encourages Denver residents to saddle up and enjoy the show. Section two that the clerk in the city of the county of Denver shall attest, in effect, a seal of the city and county of Denver to this proclamation, and that the copy be transmitted to the National Western Stock Show, Rodeo and Horse'",
        "'speaker_5': 'Show.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. I make a motion that we adopt Council Bill 13.'",
        "'speaker_1': 'A proclamation.'",
        "'speaker_5': 'Proclamation 1326.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilman Brooks.'",
        "'speaker_5': 'Thank you, Mr. President. This is one of one of our most exciting proclamations, because I think the National Western stock shall just have such a storied history. It's who we are in Denver. And I think that's why you have so much buy in of so many councilmembers up here and why you have 650,000 people, the number of'",
        "'speaker_5': 'citizens in Denver that go to the stock show facilities within a 15 day period. It is incredible. And I also want to say that the stock show broke a record on their opening day that 47,000 people was the normal record.'",
        "'speaker_5': 'But just this Saturday, 50,000 people descended upon that facility, that aging facility, and had a great time. It was incredible and we are so excited to be a part of this. But what makes this special this year? Is Denver.'",
        "'speaker_5': 'Just approve one of the largest bonds in Denver's history, the largest bond to Denver history, over billion dollars to see the whole facility transformed so that we can take this vision of the stock show to the next level from the communities of global response here to the rest of the world, so that we can really take this'",
        "'speaker_5': 'agriculture and this urban ag experience to the rest of the world so we can understand what it means to feed the rest of the world. And so we're really excited about this. And I think what I'm most excited about, number one, every precinct in Denver voted in favor of to see.'",
        "'speaker_5': 'So we're so grateful for Denver voters. And the neighborhoods that were closest to the stock show voted the highest percentages, a 73%. So that says a lot about the outreach that was done and that says a lot about what the neighbors believe and see and believe what that area can be.'",
        "'speaker_5': 'And so in an age where I think there's a lot of controversy between development and neighbors, this is one example of a development that came together and saw that the community is just as important as the facility. I'm so, so excited to be a part of that in my last little piece because I see we got some'",
        "'speaker_5': 'folks who want to say a couple words is I just love them. My kids love this. And Kelly, if you can just put that on the screen, this this young lady right here is an urban chick, okay? She lives in a concrete jungle, jungle of coal neighborhood, but she loves animals and she wants to be a veterinarian'",
        "'speaker_5': 'one day. And her favorite thing to go to is rodeos. And when we get these kind of urban kids excited about agriculture and the agrarian lifestyle, I think that's the connection that is priceless that we're making around the stock show.'",
        "'speaker_5': 'And that's what the National Western Stock Show has been about for the last hundred ten years. So I'm happy to support this. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks, Councilwoman Ortega.'",
        "'speaker_9': 'Councilman Brooks, thank you for bringing this forward. Excuse me. I had the benefit of representing this area of town for 16 years when I served on the council my first time around and had the benefit of working directly with National Western in their many requests to ask the city to help them to grow in a bigger way'",
        "'speaker_9': '. And it was in this most recent conversation, an effort with the Hancock administration that the package was able to be put together that went before the voters and approved the $800 million, complemented with the 200 million that the CSU was able to get for this incredible vision for this site.'",
        "'speaker_9': 'It will certainly transform this area. There will be additional acreage added on to the site of full buildout, 170 acres compared to its 90 acres today. The. Future opportunities with the new partners. As Councilman Brooks alluded to, I think pose some just incredible, an incredible future for the city of Denver, not only looking at how we address'",
        "'speaker_9': 'food sustainability and the work that CSU does and working with our agricultural community, the opportunities for young kids to be able to go to the site and learn about, you know, the. The life of people who raise cattle for for beef that we consume.'",
        "'speaker_9': 'You name it. The opportunities are just incredible for those of you who are consumers. I want to encourage you all to go and take a look at the exhibits that they have. There are some incredible exhibitors that have jewelry and Western apparel for both men and women, as well as, you know, equipment that you can buy for'",
        "'speaker_9': 'the livestock industry. But the economic surge that we see in January is not only a result of attendees showing up and paying the ticket price, but it's a lot of those purchases that we see from many of the products that are on display at the event.'",
        "'speaker_9': 'I just want to congratulate National Western on 110 years of commitment to this city as well as congratulate them in the recent success of the ballot initiative that passed that will allow us the opportunity to ensure that they're here for another hundred years.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you. Governor Ortega, Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. It's always been a a very good thing to see this proclamation every year, every year that I've been on council. And that's eight years already. This is now. I've been able to see this proclamation of different people come up in front of it, from Pat Grant to Paul Andrews and now the Honorable Terrance'",
        "'speaker_7': 'Carroll, who come to receive this little later. But and then to see different iterations of of of cowboy hats and and shirts and just to be part of this to see the parade come through downtown Denver is awesome.'",
        "'speaker_7': 'To see the Longhorns come through, to watch the Mexican rodeo extravaganza that happens as part of the heritage of the western part, a big part of of of the identity and the culture. The word rodeos as a Spanish word, the lucky arrows where it all originates.'",
        "'speaker_7': 'And just to be part of it, you know, if you're not from Denver and you haven't done it yet, go to the stock show. It is, there's much more than meets the eye. And, you know, you walk around those grounds and you see the Denver Coliseum to think of the different things that have happened through the Coliseum'",
        "'speaker_7': ', the Western Stock Show, the event center, the exhibition hall, even the old 1900s building that still stands. And thank God we're going to preserve it. This is. The stock show is to Denver what the orange is to the Broncos.'",
        "'speaker_7': 'It's the identity. It's our identity. Before there was the Broncos, before there was Mile High Stadium, before there was Coors Field, before there was even Bear Stadium or Mike Nichols Arena or the Pepsi Center. There was the National Western Show.'",
        "'speaker_7': 'Before there was a Super Bowl, there was the National Western Stock Show. That's how important this is and this part of our heritage. Let's go check it out. And those of you who are from Denver for some reason have not visited it.'",
        "'speaker_7': 'Go see it. Go see it now, because you're going to experience what the change will be. Go walk along that area along the Platte River. That's going to be turned into thriving parkland. A mile of it, right? And it won't just be something that happens in November.'",
        "'speaker_7': 'I mean, not November, but January. It'll be year round. There'll be outdoor amphitheaters. There'll be connections and infrastructure. Right. That connected a neighbor that will reconnect the neighborhood to the rest of the grid. It'll help. It'll help do things that we just haven't done right all these years.'",
        "'speaker_7': 'I remember during the tour of the stock show almost nine years ago and looking at the infrastructure and looking at the needs. And it was leaky. It was rickety. Was historic buildings that were just falling apart before our very, very eyes with no mechanism and nothing to help preserve it.'",
        "'speaker_7': 'And now that we do go visit it now so you can be part of that change, go experience touching those austere. And they're so beautiful. You walk in there and it's like, man, these guys look like they made it out of velvet.'",
        "'speaker_7': 'Who do think this makes such a tasty burger? I'm just kidding. Just don't name them. Don't make the mistake that I go in and I say, Hey, what's up? And I make a name for the cow or the sheep.'",
        "'speaker_7': 'And I realize, man, I shouldn't have done that. I feel guilty later, but it's just such an amazing, amazing experience. Amazing for the kids. It's amazing for everybody. Just enjoy it. Anyway, I just wanted to share that little piece and congratulations to the stock show.'",
        "'speaker_7': 'Congratulations to Denver once again, the Mile High City. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilman Flynn.'",
        "'speaker_10': 'Thank you, Mr. President. First, I would like the secretary to make note of which members have the black hats and which have the white gray. Secondarily, though, and seriously, I wanted to echo Councilman Brooks in his remarks about the voters of Denver overwhelmingly approving something that is going to make a vast difference to this city, not just'",
        "'speaker_10': 'to Elyria, Swansea, but to this whole city. And we often have talked about a stock, at least I recall when I was at the newspaper covering stock shows. In fact, I recover that. I remember the media parties, which were quite eventful, but we talked about it in terms of reflecting Denver's heritage and its history and how it'",
        "'speaker_10': 'made us look back to our past. But I want to tell you that this year, again, to echo Councilman Lopez, that I think this year we should look forward to the future and say that what we see there at the stock show is not a reminder of our past.'",
        "'speaker_10': 'It's a harbinger of our future. And so I, too, look forward to coming back down the road and seeing the changes and the improvements that will be made in those communities because of the thanks to the voters of Denver.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Councilwoman Gilmore.'",
        "'speaker_9': 'Thank you, Mr. President. You know, I grew up in Rush, Colorado, and so I was that for each kid who during the summers was washing steers and using a whole bunch of aqua net to make sure that, you know, I'll just leave it at that.'",
        "'speaker_9': 'If you don't know what Aqua Net is used for with steers and when you're showing them, I'll leave that to the Internet for you to research. But, you know, I moved up here to Denver to go to school when I was 18.'",
        "'speaker_9': 'And it's just a great reminder of, you know, agriculture, the West, the northeastern plains. And, you know, I'm proud to say that my mom was a barrel racer and my dad was a brand inspector. And so those agricultural roots go very deep and I'm never too far from home.'",
        "'speaker_9': 'I thought moving to Denver, you know, the agriculture and the West and the traditions, you know, I was in the city now, but it's really nice to come full circle and the resurgence of, you know, concentrating on where our food comes from, how we manage natural resources and conservation.'",
        "'speaker_9': 'I think it's going to be very wonderful for not only the city but the entire state. And I predict that we're going to have tourists from all over the world coming and seeing the innovative things that we're doing here in Denver.'",
        "'speaker_9': 'And so I just wanted to congratulate the folks again and proud to be a fourth generation Coloradan. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilman Espinosa.'",
        "'speaker_5': 'You know, probably the only place more rural than brush is where I spent my teen years, which is rural Sublette County, Wyoming. That is county number 23. If you're looking at the plates, which means it's the least populated in the state of Wyoming, which is saying not very much.'",
        "'speaker_5': 'That said, I do encourage everyone to go there because if you put I mean, go to well, not to I'll go to Sublette County because it's actually some beautiful, mostly unspoiled land. But that's a whole different story. I'm encouraging everyone to go to the stock show.'",
        "'speaker_5': 'And the reason is, is because if you type in raise cattle in your app store, there is no app for that. There's a different sense of time. It's life spans, it's generations. And it's whenever, whenever the calf in the barn makes some noise, you've got to respond.'",
        "'speaker_5': 'There's seasonal things where you're moving cattle, you're switching fields. And in branding season, I don't know if they still brand. That's how long it's been since I've been that guy. Yeah, but learning about rustlers and being a puncher and.'",
        "'speaker_5': 'And B, being a wrestler in junior high and being a puncher in high school, those are terms that still mean something in the ranch land. And so go there, understand that this has this has real world impact on how we move forward with the project that we just funded.'",
        "'speaker_5': 'Because what you're going to find, it's people out there with a with a not a work ethic that we don't have, but a real solid work ethic that is enviable. And because when they start something, they started to finish it.'",
        "'speaker_5': 'And when you do something, you do it right. And so we remember what we're doing and who we're doing it for throughout this this project at the stock show, we will have great outcomes. So go there, experience it, meet the people, see what they've done because they're going to be out there doing it tomorrow like they did'",
        "'speaker_5': 'yesterday and generations from now, like they did generations before. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. I forgot to say a few things, but it is interesting that Councilman Espinosa said the word puncher. I think I was a punchy in high school anyway. Oh, no, I. I wanted to really hone in on a few things.'",
        "'speaker_7': 'And as we look to our future and say, you know, there's a lot of the some of the things that we just didn't do right that we have the opportunity to do again. And I think, you know, when we tour that stock, shall we find out?'",
        "'speaker_7': 'Not very many people from the neighborhood were working there. And that's important. From laying concrete to erecting structures and building a new and doing the landscaping and even the sails and and from every aspect of the labor force.'",
        "'speaker_7': 'We have to do a better job in creating those opportunities all throughout Denver, but especially for those neighborhoods surrounding this dog show. Right. And it's those jobs. It's their future. It's a sustainability, but it's also that sense of ownership.'",
        "'speaker_7': 'Right. We can put on a cowboy hat and a cowboy shirt and say, oh, we're part of the stock show or cowboys, but and we're part of the West. But truly, truly, the hands that are building this new center, the hands that will lay those bricks, the hands that will shake you and we shake your hand when'",
        "'speaker_7': 'you walk in there and greet folks in the stockroom. We have to make sure that we participate at a local level as much as possible. And here's the other thing, too. For decades that that stock show has been so close to the neighborhoods in the north.'",
        "'speaker_7': 'Right. You think that all the ag all the education about food and so many people still living in a food desert. We have to fix that. And we have to fix it in a way that that that when you when you go when you go to that area, you will never hear anybody say anymore.'",
        "'speaker_7': 'There's no grocery store out here. We don't have access to fresh food. Right. We have to fix that with all that acreage, whether it's a market like they were talking about. Great. That's absolutely great. Let's make sure that there's access and make sure that the owner snap.'",
        "'speaker_7': 'Let's make sure that we are creating that opportunity for the whole area of Denver in spans council districts that even spans counties. Right. Let's go in there and it's create a great opportunity. Let's bring the AG back into households, even if has to be with refrigerator to start.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez. Any other comments? Proclamation 13. I just I second all the comments from the council members. I was there on Saturday, Colorado versus the world. It was a great event to be there with my family.'",
        "'speaker_1': 'I am really excited and looking forward to my seven month old. Not only seven months, but participating in the mutton busting though with the death grip that he has on his mother's hair. Sometimes when she's feeding him, I think he could do he could be very successful right now.'",
        "'speaker_1': 'But it is exciting to see the future of the stock show and what is about to be what is going to become of that. So, so thankful to be a part of it. So, you know the comments, Madam Secretary, call Brooks.'",
        "'speaker_6': 'Clark. I. Espinosa. I. Flynn. I. Gilmore. I. Cashman. I can eat. Lopez. I knew.'",
        "'speaker_4': 'Ortega I. Black tie. Sussman Hi.'",
        "'speaker_6': 'Mr. President. Hi.'",
        "'speaker_1': 'Council woman can each. Thank you, Madam Secretary, please cast a vote now for the results. 3939 Proclamation 13 has been adopted. Councilman Brooks, is there somebody in the audience you'd like to invite us to the podium to receive the proclamation?'",
        "'speaker_5': 'Let me look around. Yes, I'd like to call up our first, the honorable Terrance Carroll, first African-American speaker of the House in the state legislature, and also a board member of the National Western Stock Show.'",
        "'speaker_7': 'Glad to see you. Have a nice hat on. I couldn't done a better job if I picked it myself. Oh, wait, I did.'",
        "'speaker_5': 'You're the one to fix this girl.'",
        "'speaker_7': 'First, I'd like to thank the members of the City Council for this proclamation. But I would be remiss if, on behalf of our President, our chairman, and my fellow board members and the entire national Western family that didn't think the residents of the city and county of Denver for showing their great faith in us by overwhelmingly passing'",
        "'speaker_7': 'to see it ensures that the National Western will be in this great city for another 110 years and beyond, well beyond. Any of us will be here, but our children and our grandchildren and great grandchildren will be able to see this great institution continue, hopefully in perpetuity, but definitely for a long, long time that the rest of'",
        "'speaker_7': 'us can even contemplate. And so it's actually a great thing for Denver, a great thing for Colorado, and it's a great thing for the entire nation. So I definitely want to thank you for that. And I want to also say that we had a record day on Sunday as well, and we broke another record.'",
        "'speaker_7': 'And I think the only thing that keeps us from breaking more records is that we're running out of the space at the national western complex and thanks to to see will go from having on average 650,000 folks who show up at the National Western every year to closer to 1 million folks who show up at the National'",
        "'speaker_7': 'Western during those 16 days in January hopefully will expand beyond that. So once again, thank you very much and extend the personal invitation for you all to come out to my ranch if you want to do some branding, because if there's no branding, that's a possibility of having Rocky Mountain oysters because the two go hand in hand'",
        "'speaker_7': '. Councilman Kennish, you'll enjoy it there. Deep fried man. And deep fried. Do we even have tofu oysters.'",
        "'speaker_1': 'If that to make you feel better?'",
        "'speaker_7': 'Again, thank you very much. And thank you for your support of the National Western and the Western Stock Association and everything that we do. And I look forward to seeing you all out at the grounds over the next 16 days or so as we have a good time down there.'",
        "'speaker_7': 'And and I know you'll spend money, but I just want to encourage you to spend even more money when you go down there. Some good stuff down there. Thank you.'",
        "'speaker_1': 'Thank you to the honorable Terrance Carroll. Thank you, Councilman Brooks, for that as well. We're going to get that frog. It's fitting to have the former speaker when the session starts on Wednesday, find that you're not going to be there.'",
        "'speaker_1': 'He does not miss it. Best of luck to the two as the session does begin on Wednesday. All right. That was the only proclamation. We're on to the resolutions. Madam Secretary, would you please read the resolutions.'",
        "'speaker_6': 'From business development 982 resolution and oppose Fourth Amendment to agree between Parsons Transportation Group, Inc. and City and County of Denver related to terminal and landslide area redevelopment at Denver International Airport 1989, a resolution approving a purchase order between City and county.'"
    ],
    "On-Call Construction Contract with MW Golden Constructors.": [
        "'speaker_6': 'Resolution Approve any post contract between City and County Interlock Construction Corporation for on call Construction Services 50 resolution approve any post contract between city and county ever and am Golden Constructors Rockwall Construction Services 51 resolution approve any post contract between city and county offering spectrum General Contractors Inc. for on call construction services in 52, a resolution approving'",
        "'speaker_6': 'new post contract between City Encounter and Turner Construction Company for on call Construction Services 853 Resolution approve any post contract between city and county for O'Neil Construction Company of Colorado for Uncle Construction Services 54 A Resolution for Universal Contract between City and County Wilderness Construction Company for Uncle Construction Services 959 Resolution Preventive Post First Amendment to Concession'",
        "'speaker_6': 'License between City and County Denver Wilshire LLC 960 Resolution Approving Concession License with Tim Fun LLC to operate Boat Paddleboat Right Bike Rentals and Food Services at Washington Park and City Park 974 Resolution lane out opening in 77 real property as part of city streets and parcel land as West Florida Avenue near intersection of South Fetter Boulevard'",
        "'speaker_6': 'and West Florida Avenue 975 resolution laying out openness to fishing certain real property as part of city streets as in parcel land at the Cota avenue at the intersection of South Jackson Street into. So to Avenue nine any resolution laid out opening establishing a certain real property part of city streets in some parts of Atlanta's East Evans'",
        "'speaker_6': 'Avenue, intersection east of Annette Avenue and South Jasmine Street. 85 resolution lane out of many steps in certain real property as part of city streets and parcels of land as West Colfax Avenue, near its intersection with Ninth Street.'",
        "'speaker_6': '986 A resolution grading vocal print at Downing and P Tower, LLC, to encroach in the right away at 1600 Downing Street. 996 Resolution laying out opening steps in certain real properties by city streets to some parcel of land.'",
        "'speaker_6': 'Peoria Street near its intersection with 39th Avenue 997 resolution laying out, opening and establishing certain real properties part of the city street system parcel of land at Peoria Crossing, nearest intersection II 38th Avenue 998 resolution lane out opening establishing certain real property as part of city street system of parcel land as East 39th Avenue, intersection with Perez'",
        "'speaker_6': 'Street 999 resolution lane out opening establishing certain real properties part of city street system parcel and as Denver place near the intersection of East 39th Avenue and Perez Street from Safety and Well-Being 977 a resolution Lee authorizing the mayor and other proper officials of the city and county of Denver to enter into a collective bargaining agreement with'",
        "'speaker_6': 'the Fraternal Order of Police. Denver Sheriff Lodge, 27 For the years 2016 to 2017. Resolution 11 Resolution authorizing approving expenditure Premiere from the from the appropriation account designated liability claim some $40,000 per year to Rathod Hey LLC In full satisfaction of the November 2nd, 2015 order issued by the District Court for the city and county of Denver'"
    ],
    "Rezoning of 770 South Federal Boulevard in Council District 7.": [
        "'speaker_4': 'I sure will. Mr. President, pro tem, I move that council bill 891 be placed on the floor for final consideration.'",
        "'speaker_7': 'Thank you. Councilwoman, it has been moved in second in a public hearing for council bill 891 is open. May we have the staff report? David Gasper. From Community Planning and development.'",
        "'speaker_5': 'Guzman-Lopez Councilmembers David Gaspar, principal city planner and community planning and development. Happy to be here tonight for the rezoning of 770 South Federal Boulevard. This is a rezoning that would go take be a one with waivers as former Chapter 59 zoning to the BMX three zone district.'",
        "'speaker_5': 'This is in Council District seven, Kathleen Clark's district, right on Federal Boulevard and Atmore, Moorpark on the far western edge. If we zoom in to the location a little bit closer, it's at the intersection of Federal Boulevard and Ohio Avenue.'",
        "'speaker_5': 'It's on the east side of federal really essentially between the major arterials of Alameda and Mississippi. The request here tonight is to rezone parcel just over a an acre in size, 45,000 square feet. It's currently a single story church.'",
        "'speaker_5': 'The property owner, Central Federal Investors is requesting the rezoning to allow for mixed use development. And Representative Dennis McClean is here to answer any of your questions to him. The rezoning is from be a one with waivers. That's a commercial zoning and the old code.'",
        "'speaker_5': 'The waivers reduce CFR the buildable amount in the area to 1 to 1 from 2 to 1 in limited the amount of uses to the annex to read. I'll quickly go through the existing context the zoning, the transit service on the corridor, land use and building and scale existing zoning on site.'",
        "'speaker_5': 'There is still be a one with waivers both to the north and south. The same zoning and beyond. That impacts three is also on the map. To the west there is B2 and to the east. In the Upper Park neighborhood is Eastside.'",
        "'speaker_5': 'So that's single unit urban edge transit. This is an enhanced transit corridor. RTD has significant amount of service on here with four routes providing a high frequency service on Federal Boulevard. Route 11 is the nearest east west route exposition on the northern border of the block.'",
        "'speaker_5': 'If we look at the land use, as I mentioned, the church surrounded by commercial and residential uses quickly through there's the church there looking from federal single storey, surrounded by parking. Out of the north, there's two and a half storey apartment buildings to the west, single story strip, commercial to the south, additional apartments.'",
        "'speaker_5': 'And on the east backside of the property, essentially, this is, I believe, Elliott Street, where there's the single family residences process. Notice of receipt of the application came in late September. Planning Board was scheduled their public hearing on November 4th.'",
        "'speaker_5': 'At that time, Ashmore Park, a neighborhood association, did speak in favor of the rezoning. I went to a plan committee in November and we're here in front of you tonight and January the next three. It's urban edge, neighborhood context, mixed use, and it's three stories, maximum heights.'",
        "'speaker_5': 'We'll go through the review criteria, mainly focusing on review criteria. Number one, consistency with the adopted plans. We have a comprehensive plan 2000 blueprint, Denver and the Ashmore Park neighborhood perimeter plan to look at for a review criteria.'",
        "'speaker_5': 'There is significant consistency with adopted plans through the comprehensive plan with promoting infill development at the site. We zoom in a little bit more to Blueprint Denver. The land use concept is commercial corridor and it is an area of change.'",
        "'speaker_5': 'We look at federal for many features through classification. It is a commercial arterial and an enhanced transit corridor. So the next three fits very well with Blueprint Denver. We zoom in with Ashmore Park with the neighborhood plan was adopted in 2000.'",
        "'speaker_5': 'There is strategies that speak directly about redevelopment along the transit corridors and promoting having rezonings for tomorrow mixed use transit sporting development also strategies to target new commercial retail to come to Ashmore Park and to promote commercial industrial areas, good investment opportunities.'",
        "'speaker_5': 'So there is significant consistency with adopted plans here through those three documents. There also is uniformity district regulations. The mx3 is mapped along Federal Boulevard near the property and along other commercial corridors. The application is consistent with furthering public health, safety and welfare with just varying circumstances.'",
        "'speaker_5': 'There is change in changing conditions at the site since the zoning, which dates back to the seventies. There has been the adoption of the plans I just mentioned, in particular the neighborhood plan in 2000. Also the adoption of the new Denver zoning code, which has mixed use districts that implements the goals of those adopted plans and that'",
        "'speaker_5': 'redevelopment along commercial corridors that align with the mixed use zoning standards that were not prevalent at the time of the existing zoning adoption all lead to a justifying circumstance of changed conditions, and there is also consistency with neighborhood context.'",
        "'speaker_5': 'If you look at the urban edge neighborhood context, it does speak of being characterized by low scale buildings, except for some mid-rise commercial mixed use structures, particularly at nodes and along arterial streets. And it makes you zoned districts in particular intended to promote safe, active and pedestrian skilled development in those areas.'",
        "'speaker_5': 'So with that, CBT does recommend approval of the rezoning of 770 South Federal Boulevard from B A-1 with waivers to the Annex three zoned district. Based on all on finding all review criteria have been met. You're for any questions.'",
        "'speaker_7': 'All right. We have one. Thank you for the staff report. We have one speaker this evening. Dennis McLean, if you want to come up to the podium. And forgive me if I'm not pronouncing your last name right.'",
        "'speaker_5': 'That's okay. McLean Council Members Dennis McLean City with McLean Commercial Addresses 4007 Bryant Street. Denver, Colorado 80211. I'm just here to answer any questions that you guys may have about our project.'",
        "'speaker_7': 'Thank you. That concludes our speakers questions from members of Council Councilman Ortega.'",
        "'speaker_9': 'Mr. MacLean, would you mind coming to the microphone, please? Can you give me an idea of what you're planning to do with the site?'",
        "'speaker_5': 'You know, we're not sure we bought the site some time ago and the zoning is pretty interesting.'",
        "'speaker_7': 'On the site. Typically, it's my.'",
        "'speaker_5': 'Understanding when the new zoning came around Denver, anything that had a waiver just got not looked at. So we bought the site knowing that someday we redevelop it and it's gone.'",
        "'speaker_9': 'So you have no immediate future plans to level the building and to put something else in there? Not immediate. Okay. And about how many acres is the site?'",
        "'speaker_5': 'It's about 1.17. It's about 47,000 square feet. Roughly three. Pretty good sized parcel on federal.'",
        "'speaker_9': 'Right. I'm familiar with it. Okay. Thank you.'",
        "'speaker_7': 'All right. Thank you. Councilman Ortega. Councilman Flynn. Thank you, Mr. President. Pro tem.'",
        "'speaker_10': 'Dennis, can you answer? Is this property vacant right now?'",
        "'speaker_5': 'It is not.'",
        "'speaker_10': 'Vacant. It is not. Is it? Is there a church, a congregation still meeting in it?'",
        "'speaker_5': 'We have a couple groups that meet in there regularly. We have English as a second language group that meets in there and a couple churches that use.'",
        "'speaker_10': 'A customs or a couple of churches.'",
        "'speaker_5': 'Of different church groups that do things in there.'",
        "'speaker_10': 'I see. And you haven't given them notice or how they are month to month arrangements?'",
        "'speaker_5': 'They're all month to month. They know that we're working on something.'",
        "'speaker_10': 'Okay. Thank you very much. That's all.'",
        "'speaker_7': 'Are there any other questions for members of council? All right. This public hearing is closed. Comments by members of council will go to Councilman Clark where this is located. Thank you. Thank you, Mr. President. Pro tem. This is, you know, something that is right in my district.'",
        "'speaker_7': 'And I want to commend the applicant. The original application that came through was for a different zoning classification, and my neighborhood organization had expressed some concern with that. And I was actually at the meeting that Mr. McLean came to with the park neighbors and he introduced himself, had talked about, you know, his history with this city and'",
        "'speaker_7': 'then said to this community, I don't want to build something that you don't want in your neighborhood. So tell me what you would like. What zoning would you like? And we just hear so much, you know, sitting up here and in the news about when zoning is contentious and about developers and neighbors not working together and to'",
        "'speaker_7': 'sit there and watch that and then see this come forward with full support from the neighborhood organization, I think is a model for how we can have neighborhoods and developers working together to move Denver forward to bring positive, engaged use to a corridor that needs it that the neighborhood wants it at.'",
        "'speaker_7': 'And so I will be enthusiastically supportive of this tonight, and I would encourage my colleagues to do the same. I think this is one where we really got it right, and that's because we had a developer who really cared about the property that someday he will develop.'",
        "'speaker_7': 'And and as I heard him, you know, just as I can go say, I don't know what I'm going to develop, I'm sure that that's because he's going to sit down and talk to the neighborhood about what they want.'",
        "'speaker_7': 'And I think that that is something that is really spectacular and the way that we should have our community and our developers as a city working together to build this city. So I'm enthusiastically supportive tonight. Thank you. Councilman Clark, are there any other comments from city council members?'",
        "'speaker_7': 'All right. Before that, I'll make a comment. I used to represent this this area. I'm right across the street. You guys will probably know this from if you've ever sat down at the first 75 or the crawling crab and looked out outside the window as you're enjoying your bowl of this is what you're staring at and it'",
        "'speaker_7': 'is this whole property. The good thing about this property is that under the old chapter 59, this would you I think you would be able to allow a junkyard here at one point. And that's how outdated the zoning was here.'",
        "'speaker_7': 'So to move 4amx3, which allows that mixed use, allows, you know, residential income and commercial to mix. This is exactly the vision for four federal boulevard. It's been underutilized under visualized and it looks like this is the right move.'",
        "'speaker_7': 'And Councilman Clark, I think you're exactly right. I think this is a good example of what happens when there's good communication ahead of time and when there's collaboration and with the community. So having said that, Madam Secretary, Roll Call.'",
        "'speaker_6': 'Clark Espinosa, Flynn, I Gilmore, I Cashman. All right. Can each. Lopez I knew Ortega I.'",
        "'speaker_4': 'Sussman Black, I.'",
        "'speaker_7': 'All right Madam Secretary close to voting. Announce the results. Lebanese Lebanese Council Bill 891 has passed. Thank you very much for attending tonight. There is no pre adjournment announcement and seeing that there's no other business before the body, this council meeting is adjourned.'"
    ]
}