{
    "Proclamation for NCAA Spring Sports Festival at Metropolitan State University.": [
        "'speaker_6': 'YMCA has various community centers here in the area. In addition to that, individuals, student athletes, NCAA personnel are going to be volunteering and stuffing backpacks with NCAA swag, so to speak. Shirts, hats, pens, pencils, so that the community really remembers what took place over this period of time.'",
        "'speaker_6': 'And so we're really excited again about the athletic component that's a part of this. But one of the key pillars of Division two is service. And you're going to see that here throughout the week, throughout the festival. And so when the NCAA does individual championships, you can understand the impact that it has on an individual basis.'",
        "'speaker_6': 'But if you think about the fact there's going to be six national champions crowned in one place, how much more impactful is going to be with 1100 student athletes being involved in the community and making Denver a better place?'",
        "'speaker_6': 'Thank you. Thank you. And then also, if I can, you know, this is. A large undertaking for years to say the least four years in the making. And so it's because of the vision. Dr. Jordan. People have come before me, the previous athletic director.'",
        "'speaker_6': 'I also have my assistant athletic director, Aaron Hilder, here, who has served as the primary liaison with the NCAA, who is taking care of logistics to make this happen. So I also want that to be on record as well.'",
        "'speaker_6': 'And we appreciate her efforts for that. Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Dr. Jo. And thank you, Dr. Graham. Thank you, Councilman Brooks, for bringing this forward. All right. We are moving on proclamation 351. Councilman new, will you please read Proclamation 351?'",
        "'speaker_5': 'Thank you, Mr. President. I'm so pleased to be a part of this proclamation. I'm so glad to see the families of our fallen officers here tonight. So. Proclamation 351. Whereas the Denver Police Department has 157 year history of providing law enforcement for the citizens of Denver.'",
        "'speaker_5': 'And. Whereas, during the 157 year history, during nearly 10,000 individuals have served the citizens of Denver as Denver police officers. And. Whereas, every year, law enforcement officers die while protecting our homes, our families and our loved ones. And.'"
    ],
    "Proclamation for Myrna Hipp Day.": [
        "'speaker_1': 'Thank you, Chief. I thank you. Thank you all. And thank you, Councilman Nu, for bringing that forward. All right, we we do have one more proclamation. Proclamation 352. Councilwoman Ortega, will you please read Proclamation 352?'",
        "'speaker_8': 'I would be happy to. Proclamation number 352, honoring Myrna Hipp for her public service and declaring May nine as Myrna Hipp Day. Whereas Myrna Hipp moved to Denver in 1976. Graduated cumulative. Cumulative from Metro State College and lived and worked in Denver until she passed away on March 27, 2016.'",
        "'speaker_8': 'Whereas Denver City Council wishes to recognize Myrna Hipp for her almost 25 years of service to the city of Denver and her dedication to providing affordable housing and community service to those in need. And. Whereas, Morris served as Deputy Director of the Office of Economic Development during Mayor John Hickenlooper's administration and as Director of Housing and Neighborhood'",
        "'speaker_8': 'Development Services under Mayors Wellington Webb and Federico Pena. Whereas, Myrna was responsible for the implementation of Denver's affordable housing programs from the 1980s through the 2000. She oversaw the city's investment of more than $175 million in affordable housing development and preservation, and more than $50 million in other neighborhood improvement projects that Denver residents continue to benefit from'",
        "'speaker_8': '. Whereas, Myrna served on the Denver Housing Authority Board of Commissioners for 12 years, providing vision and leadership to transformative redevelopment, including the villages at Curtis Park, Benedict Park Place, Mariposa District, Sun Valley Transit Oriented Development Planning. And. Whereas, accomplish these feats while providing love and support to her loving husband Ernest, her son Rick KIPP, her daughter Lisa'",
        "'speaker_8': 'tunstall, Lenski and her brother and her brother grandchildren, other family members and friends throughout the community. And. Whereas, the city would like to honor Myrna here posthumously for her dedication to the city and her lifelong commitment to affordable housing and neighborhood services.'",
        "'speaker_8': 'Now, therefore, be it proclaimed by the Council of the City and County of Denver that the Council of the City and County of Denver. Acknowledgment of him for her public service and declares Monday, May 9th, as merely hip day section two that the clerk of the city and county of Denver shall affix and attest the seal of'",
        "'speaker_8': 'the city and county of Denver to this proclamation, and that a copy be transmitted to the family of Myrna Hip.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Your motion to adopt.'",
        "'speaker_8': 'I move for the adoption of proclamation number 352.'",
        "'speaker_1': 'It has been second hand comments. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. So Mirnas life is weaved through these three proclamations that we've heard tonight. Mirna was an alum of Metro State College, which we just celebrated earlier this evening. And in her role, when the District one police station was closed down after they moved from their site in the Jefferson Park neighborhood over to Sunnyside.'",
        "'speaker_8': 'She was involved in putting that site out to bid and making sure that affordable housing was part of that project. And the work that Mirna did with the nonprofit and I see a number of them here in the audience tonight of ensuring that the role they played in this community in building and providing affordable housing units across'",
        "'speaker_8': 'the city was so vital to the survival of many of our families. And that's even more so important today as we have seen the price of housing escalate. Some of those very projects exist in my own neighborhood of Highland, where they are the only affordable housing left in that neighborhood.'",
        "'speaker_8': 'And so the work that she did was just so important to all of the families who benefited from this. I have enjoyed serving on the board of a nonprofit housing development group that worked very closely with Maria, and through that relationship, was involved in securing some city funding along with others, as is the process that all of'",
        "'speaker_8': 'these nonprofits go through to to be able to provide this housing. In her work at the Office of Economic Development, which has gone through different iterations with different names over the years, the Community Development Agency model cities. But in in her work, she funded many other community programs.'",
        "'speaker_8': 'I can remember representing Globeville, Swansea, Elyria and working to try to get, you know, some of the alleys paved in the neighborhood and, you know, some of the other neighborhood services, like a recreation center in the community. And it was the community development block grant funds that she was involved with helping to administer for low income neighborhoods'",
        "'speaker_8': 'across the city that truly benefited as a result of her work. I want to thank her family, her husband Ernest, her daughter Lisa, her son. Rick and her grandson, Miles, who she was just so proud of for you lending money to all of us and sharing her with the city, people that she worked with every day and'",
        "'speaker_8': 'with the communities that she served and was so proud to do. And I just can't imagine how how much her her passing has left a hole in your heart. But I know that many of us share that that pain with you as well, because she was such a dear friend to to so many people.'",
        "'speaker_8': 'And I just. I thought it was so important to be able to take a moment. In honor of her many years of contribution to this city and to all of the people who truly benefited from her work. Thank you, Mr. President.'",
        "'speaker_8': 'I just ask that this be supported, adopted by my colleagues.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. President. First, I would like to ask the secretary to add my name as a sponsor. I did respond last week, but it's not on the not on the list. I want to make sure that it doesn't go unnoticed, that our careers mirnas and mine had crossed paths several times, many times over the years.'",
        "'speaker_7': 'And I was just truly shocked, too, when whenever someone leaves us so suddenly just shocked at the news. And I'm very sorry to hear it, but I do want to make sure that my name is on there as a as a co-sponsor.'",
        "'speaker_7': 'And thank Councilwoman Ortega for bringing this forward. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. Thank you, Councilman Ortega, for bringing this proclamation forward. And thank you to the family for being here, for sharing Moreno with us. I, I met Myrna when I was barely out of high school into college, and I was working in the community in the West Side in West Denver.'",
        "'speaker_6': 'And the first time I met her, she was just this really strong woman that wore the city seal on her lapel and knew a heck of a lot more about my neighborhood than I did. And she spoke of this vision.'",
        "'speaker_6': 'She looked at she worked with different community leaders. And for me, you know, seeing her than there there are people you you grow up associating. With with with different things. Different organizations have an aspect. When I looked at her, I saw the city.'",
        "'speaker_6': 'And I knew that that mariner meant well and her work will never be forgotten. One of the most impressive and most memorable recollections I have was being in the in the gymnasium over at St Joseph Church on Sixth Avenue.'",
        "'speaker_6': 'And it being packed. We had I don't know how many residents in there talking about my Lincoln Park plan, talking about, you know, the future of our neighborhood. And there was Myrna front and center facilitating the discussion, know how many different organizations and people were there.'",
        "'speaker_6': 'But you know, that was her that was in that was her element. And I will always remember her that way. Now, I could just say that. I was able to actually have a conversation not too long ago with her and to see her and to shake her hand and give her a hug.'",
        "'speaker_6': 'And she patted me on the back. And we just kind of shared that moment. And I'm glad that that's the moment that I get that I get a. Save up here and in my my chest forever. So thank you for sharing her with us.'",
        "'speaker_6': 'You know, we'll always remember her service to the city. We're always be grateful her fingerprint will last a very long time here. Thank you, Councilman, for bringing this forward.'",
        "'speaker_1': 'Thank you, Councilman Lopez, Councilwoman Canete.'",
        "'speaker_9': 'Thank you, Mr. President. Thank you, Mr. President. I, too, would like to be added as a co-sponsor. I think I missed this one when I was out of the office last week and I only met Mirna a few times.'",
        "'speaker_9': 'I was working for a nonprofit organization and she was on the board of Making Connections. Denver at that time was certainly involved somehow in that work with the Annie Casey Foundation, and I remember her having very high standards and her saying to us that we better not just say we're going to do some work in a community'",
        "'speaker_9': 'or say we're going to be advocates for affordable housing. Better really deliver if we're going to get funding and if we're going to, you know, hold ourselves out as doing this work. And so I appreciated those high standards.'",
        "'speaker_9': 'It was certainly she was a presence in our work in that we were always thinking how would Mirna evaluate what we were doing, would we meet her standards? And so even though I didn't know her well, she influenced my work through those high expectations.'",
        "'speaker_9': 'And so obviously her legacy on housing is one that we will always be appreciating. So thank you to her family for allowing us to recognize her in this way. And thank you to Councilwoman Ortega for your acknowledgment. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Canete. Any other comments? Proclamation three five, two, three. None. Madam Secretary, welcome.'",
        "'speaker_3': 'Ortega I. Susman. Brooks. Clark. Espinosa. Flynn.'",
        "'speaker_7': 'Hi.'",
        "'speaker_3': 'Gilmore, I. Can each. Lopez. I knew. Mr. President.'",
        "'speaker_1': 'Hi. Madam Secretary, please quote Vali Nasr adopts.'",
        "'speaker_3': 'A Lebanese.'",
        "'speaker_1': 'Lebanese 352 has been adopted. Councilman Ortega, someone you'd like to invite to the podium to receive the proclamation?'",
        "'speaker_8': 'Yes, absolutely. So I just want to first state that Mirna did not want to have any kind of fanfare. Honoring and recognizing her. And it took a little bit of convincing that really was to allow all of us to be able to come together and share with the family how much Mirna was loved by so many people'",
        "'speaker_8': '. So I want to invite her husband Ernest to come to the podium on behalf of the family and if you could maybe introduce the family to us. And while he's doing that, I'd like to ask those who are here in honor of Mirna and all her many, many wonderful contributions to the city would please stand.'",
        "'speaker_8': 'Thank you. Thank you. Ernest.'",
        "'speaker_7': 'Thank you. First of all, I'm sorry the cops left because when Myrna died Easter morning, the first people that showed up were the cops. And. They were amazingly good. I wasn't very you know, I was really kind of out of it.'",
        "'speaker_7': 'But that guy, I and I still have his card and I'm going to send a note to the chief about how professional that guy was. So it's not just the people who die. Who are we should honor but but but them all.'",
        "'speaker_7': 'I'd like to introduce Bernice family, Rick Hipp, her son, Lisa Costa Lansky, her daughter and her wife, her husband Chris Costa Lansky. And their sons, Brett Costa Lansky. And Miles Hirsch. Miles Mirna told me one time that her job was to spoil Miles and and with everything Myrna did, she did well.'",
        "'speaker_7': 'And she did that very well. Very well. So thank you very much for for for recognizing her and and and she didn't like she didn't want accolades. But we think it's pretty cool. So thank you very much.'",
        "'speaker_8': 'Mr. President, I just want to. I want to also thank Ernest for his years of service to the city as a former city employee as well. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Ortega, three great proclamations this evening. Council job. We're on to the resolution. So, Madam Secretary, will you please read the resolutions.'",
        "'speaker_3': 'From business development 308 resolution to set a public hearing for the formation and adoption of the Five Points Business Improvement District 309a resolution authorizing expenditures and the Economic Opportunity Special Revenue Fund, Temporary Assistance for Needy Families, Case Management, Employment and Training.'"
    ],
    "Public Hearing on Five Points Business Improvement District Formation.": [
        "'speaker_4': 'Just come in, Mr. President. Go right ahead. So, public council members, this is Bill 308. What this resolution does is set a public hearing 531 Tuesday, the day after Memorial Day, for a public hearing for the business improvement district of wait for it.'",
        "'speaker_4': 'Well, 10th Street. Five points, which we're so excited for. This will actually be heard tomorrow in the Business Development Committee. For those of you who can make it to that, so just wanted to alert you to that on Friday, the petitions have been signed and filed by the clerk's office.'",
        "'speaker_4': 'So we are moving through the process. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks, any other comments on three eight? Scene nine. We will move on to the next 1 to 97. Councilman Espinosa, what would you like for us to do this?'",
        "'speaker_4': 'I'd like to call it out for a separate vote.'",
        "'speaker_1': 'And certainly let's first get that on the floor. Councilman Ortega, could you please have 297 ordered published?'",
        "'speaker_8': 'Yes, I move that council bill 297 be ordered. Published.'",
        "'speaker_1': 'It had been moved and seconded. Comments. Councilman Espinosa.'"
    ],
    "Alley Vacating Ordinance in Council District 3.": [
        "'speaker_4': 'You. Yeah, I'm going to read actually from a paraphrased email that I sent not on this particular parcel, but it's the exact same situation. And I've asked that other situation, vacation, alley vacation be brought to committee to talk about this very issue.'",
        "'speaker_4': 'So I'm bringing this request to the attention of the Denver of Denver residents. This is a land grab utilizing city policy that gives considerable deference to developers with total disregard for the impact on the surrounding community. For 100 years, Northwest Denver has had these mid-block carriage lots that have been de facto open spaces.'",
        "'speaker_4': 'Since 2010, the city with a complete lack of foresight created zoned districts that allow a destabilizing amount of lot coverage and density in historically single family and duplex neighborhoods. Prior to 2010, these mid-block carriage lots existed almost solely in.'",
        "'speaker_4': 'In. Means being more creative in the earliest days of Denver. So these are square lots with a with a carriage lot that exists for actually for more of a public facility historically if these. So when a developer makes a request for these land parcels, we charge them $1,000 application fee and two $300 additional fees to give them'",
        "'speaker_4': 'the right to take. I mean, to have tens of thousands of dollars of development land developable or land. So if this vacation is found to be technically feasible, the request proceeds unchecked and the developer will gain the ability to develop and sell additional square footage and units.'",
        "'speaker_4': 'That would not be possible without this vacation. And there is no recourse by the adjacent property owners when this is requested because it is a technical consideration only. So that said, it then falls upon council after everybody else has vetted it and said, well, there's no technical violation, is there actually any need to actually vacate this land'",
        "'speaker_4': '? And so when we vote on these items, we're voting on whether it's acceptable or not for us to to, to, to to surrender this land. Now, I understand there's policies and we're I've asked that we look at to how we dispose of these properties because other municipalities don't do it the way we do it.'",
        "'speaker_4': 'And I understand that we do it by some amalgamation of state statute and city charter and in our own policies. But this is these are occurring since 2010 in our historic neighborhoods that have these square blocks, which is the original town of Highlands.'",
        "'speaker_4': 'And unfortunately, where we have GMU three zoning, which is fairly egregiously dense land coverage with minimal parking standards, you're taking you're allowing new development into the center core of a block where these units look into the backyards of house after house after house after house.'",
        "'speaker_4': 'And we're not getting anything as a city in return for this. And I just my question, why? So I would like to I called this out for a vote because I, I don't see despite the technical lack of technical and feasibility, I don't see any reason or purpose to to grant this property moving forward.'",
        "'speaker_4': 'I do see a need to maintain this sort of open space that we have historically had in this city. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. With all due respect to my colleague, Councilman Espinoza, this is Council District three. And first of all, this is the other than watching the mayor council and realizing there was an issue with it, I understand that there's a larger policy question on vacation rallies.'",
        "'speaker_6': 'But first of all, I you know, this isn't the highlands, this is the Slums Lake area. This particular area in Irving along 17th between Irving and Hooker is pretty highly developed. And it would. You know, it's basically chasing down jumbo jet fuel.'",
        "'speaker_6': 'And on the runway, this development has always taken, already taking place, and it has substantially changed the character of this particular area. So the the second I think is an issue, and I wanted to call on our assistant city attorney, Mr. Broadwell.'",
        "'speaker_6': 'There's an inference of us getting something for the vacation. It's my recollection that in state statute, that's illegal. That prevents us from the city from getting compensated for any kind of vacation to an alley. Is that right, Mr. Burrows?'",
        "'speaker_6': 'There's something that I guess is can you help clarify that that question?'",
        "'speaker_5': 'Mr. President? David Broadwell, assistant city attorney, the the state statute doesn't make it illegal.'",
        "'speaker_6': 'The state statute doesn't.'",
        "'speaker_7': 'Require compensation for a.'",
        "'speaker_5': 'Vacation. It's silent on the question of whether or not you can charge. Traditionally, the city attorney's office has expressed concern about.'",
        "'speaker_6': 'Charging for real estate as an.'",
        "'speaker_5': 'Asset that the city didn't pay for to begin with.'",
        "'speaker_6': 'And in the absence.'",
        "'speaker_5': 'Of a provision for.'",
        "'speaker_6': 'Compensation in the statute.'",
        "'speaker_7': 'We've interpreted it strictly by the book following the procedures.'",
        "'speaker_6': 'Following the criteria.'",
        "'speaker_5': 'In the statute, without adding a compensation element. As a matter of custom and practice, I think Councilman.'",
        "'speaker_7': 'Espinosa was alluding to that.'",
        "'speaker_5': 'But it doesn't flat out say you can't charge. It's just been interpreted by us for years to.'",
        "'speaker_7': 'Say that we shouldn't.'",
        "'speaker_6': 'Thank you, Mr. Broadwell. And like I said, that's a larger policy discussion, I think. I don't see it fit or necessary to to hold this up until we have that policy discussion. You know, this has its due process and it's moving through counsel.'",
        "'speaker_6': 'This was brought up relatively recently. So like I said, I think when it comes to the character and the area. You know, this is not unique in any way in that particular corner, in that particular part of the city.'",
        "'speaker_6': 'So and I haven't had any kind of public. No. I mean, nobody's called my office opposed to it or concerned about it. Certainly nobody in that particular area. So thank you. I think that I'll just I'm going to vote for this to move it forward.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_8': 'I have a couple of questions on this. The first one is just trying to clarify. I know we've seen development all up and down 17th Avenue in this area. Is this a site that has already been developed and that this land has been incorporated into?'",
        "'speaker_1': 'Can somebody has just come?'",
        "'speaker_8': 'Angela.'",
        "'speaker_9': 'Hi there. Angela Casey is for Denver Public Works. And I believe they are in the process of of creating the development. Now, I don't know how far along they are and in the development.'",
        "'speaker_8': 'Okay. I know sometimes this is a chicken and an egg situation, but I think before we allow development and I'm not sure that we actually have had other situations where the development starts and then we come back and do the vacation later.'",
        "'speaker_8': 'But if for some reason City Council decided not to approve one and the development had already started, I think that puts this body in the city in a very precarious situation. So I think at a minimum, we would want to make sure that the the vacation of any street or alley takes place before, you know, the development'",
        "'speaker_8': 'is allowed to begin.'",
        "'speaker_9': 'That that that is usually the case. And in fact, I believe now that this this situation is coming back to me there. There the owner the property.'",
        "'speaker_3': 'Owner owns.'",
        "'speaker_9': 'Like the adjacent property. And so is just asking for a vacation to complete the parcel.'",
        "'speaker_8': 'Okay. I know we had another one of these in the Jefferson Park neighborhood where the city was asked to vacate land. And this allowed, you know, a pretty high density development to go in where there was some parking challenges.'",
        "'speaker_8': 'And I don't know how much we're addressing the parking issue as part of this, but I think it's important to make sure that all those details are covered as part of the project before, you know, it's allowed to proceed.'",
        "'speaker_8': 'And so I'm just trying to get clarification on this one before I know how I'm going to vote on it. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Espinosa, you back up?'",
        "'speaker_4': 'Yeah. So? So I can almost be assured that they're not moving forward with the development because they don't have this right today. They can develop their existing parcel that fronts the street to whatever GMU three allows, but they can't develop on the carriage lot because it not habitable units because it doesn't address the street.'",
        "'speaker_4': 'So what this vacation does then allows them to connect these two parcels and develop an additional six or so units on that on that property, all deeply. Right, smack smack in the center of this square block. This is exactly what's going on in Jefferson Park.'",
        "'speaker_4': 'Time and time again, more recently, this is the first one that's come up since I've been on council, which is why I'm opining here and I'll opine more heavily on the one that is in my district. But more recently, this is the exact case of the Anderson House and I did not sit on this dais for that'",
        "'speaker_4': '. Otherwise I would have countered the developer, I mean, the arguments that were laid out there. But the reality is, is that when you when a homeowner who owns these parcels sells them individually, they have a certain value. But when you vacate this valuable land that joins these two parcels.'",
        "'speaker_4': 'Now you've increased the development potential dramatically. And so this was the case in the Anderson House where the homeowner had three distinct parcels and two of them, I mean, two were separated from one through a vacation. The city vacated that land, and that's where that $1.6 million valuation came from, because now you've added that additional development potential'",
        "'speaker_4': '. So it's not lost on me that three days after that property was sold, the developer then turnkey that whole development for $2.26 million, making more money in three days than the prior owner had made in 30 years. And so that's what's going on here.'",
        "'speaker_4': 'The developer has acquired both parcels with this, with certain development rights on one and not on the other. By virtue of us vacating it, we're granting significant additional development potential. And in again, this is not through a rezoning process.'",
        "'speaker_4': 'It's not through a public process. The only reason we're talking about it is because I called it out. And and this is if you look at the character of that block, aside from what's going on on 17th Avenue, you don't have this sort of density.'",
        "'speaker_4': 'And you didn't historically, you know, you had a certain amount of density in the former, what I believe would have been R3, but it had open area requirements and and more parking requirements than what we allow in the GMU today.'",
        "'speaker_4': 'And so this is character altering and dramatic. And so I am going to I'm articulating all this because this is a conversation that never occurred in 2010 aside from in local areas, and it hasn't occurred until now. And so I'm going to be talking about this now, and I respect the votes where they go.'",
        "'speaker_4': 'But we need to have this discussion because there aren't. The good news is there's so few of these square parcels in the city of Denver with these cares lots that this won't be happening very often, but there are still a few and they still impact surrounding neighborhoods.'",
        "'speaker_1': 'Councilman. Thank you, Councilman Espinosa. Councilman Lopez, you back?'",
        "'speaker_6': 'Thank you. Like I said, with all due respect, this is not a rezoning. And the second thing is that it's an open kind of parcel. And it's an alley that needs to be vacated. Is going to not going to dramatically change the character of this particular block.'",
        "'speaker_6': 'It's something that, you know, we see these alley vacations go through all the time without any major hiccups. And there are some absolutely in in the north side that, you know, that prompts a closer look. But this is not one of those.'",
        "'speaker_6': 'At least not not from what I can tell in this area. And I said in Council District three, you know, fortunately, you know. We don't have that that issue up there. So most of this area has been developed the way it is with the heights that it has.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez, Councilman Brooks.'",
        "'speaker_4': 'I'm not getting into this debate, but I just want to have this a clarifying question. Don't you notify neighbors, council people for any Ali vacation?'",
        "'speaker_9': 'Yes. Okay. We have a public process.'",
        "'speaker_4': 'Okay. I've been through about four or five of these. And I know that it's a huge public process for for our neighbors. And I just wanted to make sure that folks didn't think that the city was sneaking through alley vacations.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks. All right. Hey, Councilman Espinosa. You betcha.'",
        "'speaker_4': 'I know. I got notified. What is the actual notify notification that goes to adjacent property owners?'",
        "'speaker_9': 'I believe there's a notification that goes out to the ages of property owners, to the RINO's in the area as well.'",
        "'speaker_4': 'I believe there.'",
        "'speaker_9': 'Is a sign posted physically on the property with a with an email address and contact information for people to reach someone to give public input.'",
        "'speaker_4': 'So was there any public input received?'",
        "'speaker_9': 'No.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_9': 'In that. And just for the record, that when we submit those vacations, when we submit our ordinance requests, if there is public comment or any.'",
        "'speaker_3': 'Or anything that we are.'",
        "'speaker_9': 'Not able to resolve, we'll let you know in the ordinance request.'",
        "'speaker_6': 'Okay.'",
        "'speaker_1': 'Thank you. Thank you. Thank you. Well, that's another think, Angela. And the other comments, questions to 97. All right. It's on the floor. So seeing no comments, Madam Secretary, roll call.'",
        "'speaker_3': 'ESPINOSA No.'",
        "'speaker_7': 'Flynn Hi.'",
        "'speaker_3': 'Gilmore I can each. Lopez I knew Ortega. Susman. Brooks Clark.'",
        "'speaker_6': 'All right.'",
        "'speaker_3': 'Mr. President, I.'",
        "'speaker_1': 'Councilman Ortega.'",
        "'speaker_8': 'I'm sorry.'",
        "'speaker_1': 'Thank you, Madam Secretary. Please close me now. So, results.'",
        "'speaker_3': 'Ten eyes, one knee.'",
        "'speaker_1': 'And eyes one day 297 has been ordered published. All right. That was all that were called out. So all of the bills for introduction are ordered published. We're ready for the block votes. Councilman Ortega, could you please put the resolutions on the floor for adoption and a block?'",
        "'speaker_8': 'Absolutely. For resolutions. Number 3083093 1034 315. 301302 316 299 and three or four. All be ordered published.'"
    ]
}