{
    "Proclamation for Paint-A-Thon Day in Denver.": [
        "'speaker_0': 'Thank you, Councilmember Sandoval. All right. Seen no other speakers this evening. Four announcements will go ahead and move on. There are no presentations. There are no communications. And there is one proclamation being read this evening. Councilmember Ortega, will you please read Proclamation 21, dash 909.'",
        "'speaker_0': 'Thank you, Madam President. Happy to do so. Proclamation number 21, Dash 909. Recognizing the annual brother's redevelopment and Denver employee volunteer opportunities into fun day in the city and county of Denver on Saturday, August 14, 2021. Whereas, through a partnership with Denver employees Volunteer Opportunity, otherwise known as Depot and Brothers redevelopment in 85 plus Denver employees will'",
        "'speaker_0': 'volunteer their time to paint homes of deserving senior homeowners. Four Brothers Redevelopment of 43rd painted sign and. Whereas, all painting will be completed free of charge for homeowners saving the city's fixed income seniors thousands of dollars in home maintenance costs.'",
        "'speaker_0': 'And. Whereas, volunteers will be beautifying homes and preserving home values in Denver area neighborhoods as a result of their participation. And. WHEREAS, The Paint a Fun is a great way to show city employees take pride in the community and care about its residents.'",
        "'speaker_0': 'And. Whereas, the paint often truly makes a difference in the line of in the lives of many Denver residents. Now, therefore, be it proclaimed by the Council of the City County of Denver that the Denver City Council recognizes the date August 14, 2021 as brothers redevelopment in paint upon date in the city and county of Denver, and'",
        "'speaker_0': 'that the work of the city and county of Denver shall a test and affix the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the depot board. Thank you. Councilmember Ortega.'",
        "'speaker_0': 'Your motion to adopt. I move for the adoption of Proclamation 20 10909. All right. We've got the proclamation to be adopted. It has been moved and seconded. Comments by members of council. Councilmember Ortega. Thank you, Madam President. I was honored to be asked to bring this forward.'",
        "'speaker_0': 'I knew the former president, Joe Heatherton, and his co director. I guess I'm not sure that's the right title, but him and many martinis are the two that started Brothers redevelopment, which has been around for many, many years.'",
        "'speaker_0': 'And the Pentagon is one of many programs that they have done that serve the Denver community. And we as a community are are truly blessed to have them as an organization to do this work and to do it in conjunction with our city employees who volunteer their time to go out and help do some of these improvements'",
        "'speaker_0': 'on people's homes that had an opportunity to be at numerous properties and assist with some of this work that takes place. And there's a lot of camaraderie that happens as people are out there working hard. And I know our elderly folks in our community who have benefitted from this are truly grateful because they otherwise would not be'",
        "'speaker_0': 'able to afford to have these improvements done because of the fixed incomes that so many of them are on. So I just want to extend my appreciation to Brothers redevelopment, congratulate them for doing this for 44 years, and to our city employees who continue to do this important work in our community as well.'",
        "'speaker_0': 'I want to say a big thank you to them as well. Thank you, Councilmember Ortega, and happy to support this this evening, especially where we have Denver employees volunteering and supporting the great work that Brothers redevelopment does in the community as well.'",
        "'speaker_0': 'And so happy to support that. Madam Secretary, Roll Call Ortega.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Did you get my vote? I said I. All right. Thank you. Council member.'",
        "'speaker_6': 'Sandoval.'",
        "'speaker_8': 'I.'",
        "'speaker_5': 'Sawyer, I. Torres. I am black.'",
        "'speaker_6': 'I see.'",
        "'speaker_5': 'Tobacco. I.'",
        "'speaker_1': 'Clark, I.'",
        "'speaker_0': 'Flynn. I can't.'",
        "'speaker_4': 'I.'",
        "'speaker_6': 'Cashman. I can.'",
        "'speaker_5': 'Each i.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce results.'",
        "'speaker_6': '12 Eyes.'",
        "'speaker_0': '12 eyes. Proclamation 20 1-909 has been adopted. We have 5 minutes for the proclamation acceptance. Councilmember Ortega, we'll go ahead and start that timer. And I believe we have Chad LeBlanc, who's going to be joining us for the the acceptance.'",
        "'speaker_0': 'Correct. Chad, I just want to thank you for your 14 years as the volunteer manager that has been working with this program and all the volunteers that come in assist Brothers redevelopment with this great program. So the floor is yours.'",
        "'speaker_4': 'Thank you. Thank you, City Council for this proclamation and for your support of Denver employee volunteer opportunities and housing organizations like ours at Brothers Redevelopment. Since 2005, Depot and Brothers Redevelopment have partnered to serve our elderly and disabled neighbors by painting their home exteriors, cleaning up yards, performing light repairs, and by strengthening our strengthening our community bonds'",
        "'speaker_4': 'through service. Denver employees are indeed from the community and for the community. In the life of the devil painter THORNE 1700 diva volunteers have donated 13000 hours of time to paint 116 homes for deserving Denver residents. The value of this volunteer time is nearly $300,000.'",
        "'speaker_4': 'This Saturday, 100 volunteers from a wide variety of city and county departments will add to this legacy and lend a hand to six aging homeowners who would otherwise not be able to have this work done. It would cost our average plaintiff, an applicant, 25% of their yearly income to have their home paid by a contractor.'",
        "'speaker_4': 'So volunteers are not only providing a practical service, but they're also saving our vulnerable neighbors money for things like food, utilities and health care. Thank you. Denver City and county employees for being leaders in our community. Additionally, in 2021, brother's redevelopment is actually celebrating our 50th anniversary as a Denver based nonprofit housing organization.'",
        "'speaker_4': 'Brothers Borden Staff is a hardworking, creative team with a passion for providing safe, affordable, attainable housing and housing solutions with our community. Thank you for working with us to serve our cities housing vulnerable for 50 years. Thanks for your time.'",
        "'speaker_0': 'Thank you and thank you for all the work that you're doing on behalf of our residents as well in Denver. All right. We're going to go ahead and move along. Madam Secretary, please read the bills for introduction.'"
    ],
    "Non-Displacement of Workers Ordinance for Contractors on City Property.": [
        "'speaker_0': 'All right. Thank you. Do a recap. Under resolutions, no items have been called out under bills for introduction. No items have been called out under bills for final consideration. Council Member Cunneen has called out Bill 818 for comments under pending.'",
        "'speaker_0': 'No items have been called out. Madam Secretary, please put the first item on our screens. All right, we've got it up. Council member each. Please go ahead with your comments.'",
        "'speaker_7': 'Thank you. Council President Gilmore And this bill is an extension of a current executive order we have that protects workers who are doing essential services on city property for things like janitorial, security, etc. to be able to keep their jobs if the contractor they work for changes over as the city periodically rebuilds that work.'",
        "'speaker_7': 'But it also expands those protections to essential workers in more categories, particularly many of the workers at our airport who do baggage or clean aircrafts or push passengers with disabilities. So all of those workers who really we rely on and we came to understand during this pandemic how essential they really are.'",
        "'speaker_7': 'They showed up to work when they needed to to keep things running, or many of them lost jobs, as we, you know, dialed down the amount of service we needed in buildings. So in many ways, they were impacted in both ways.'",
        "'speaker_7': 'These protections are common sense. They are efficient. They help to make sure that we keep the security protocols high and that our city runs efficiently. They're good for businesses because you kind of have a ready made workforce when you start over rather than losing people who want to find new jobs before their contract turns over.'",
        "'speaker_7': 'We talked about it at length at committee, but I wanted to call it out because I think for me personally, this bill is a sign not only of this council's commitment that the airport and the mayor's office and all the administrative agencies who partner with us to look at all the details.'",
        "'speaker_7': 'But it's our city's commitment that the important benefits of the airport and the important benefits really do need to flow to everyone. I know we talk a lot about gentrification on this council and we talk about it in the housing sphere.'",
        "'speaker_7': 'And, you know, really the truth is that a good paying job that you can keep is also an anti gentrification or displacement force. At one point, the airport found that at least about a quarter of the folks who worked at the airport lived in Denver.'",
        "'speaker_7': 'We know that we're an employer for the entire region and that's a good thing. You know, it's good that we have enough jobs for residents of many communities. But if you think about it, those workers, many of them who live in far northeast Denver, many of them who live in west Denver, they are in their neighborhoods facing'",
        "'speaker_7': 'those rising housing costs, facing all the other challenges we talk about. And their ability to keep their jobs sustainably is linked to their ability to stay in our city, too. And so I believe that if we're going to be comprehensive, right, in thinking about our airport as an economic agenda or engine, that these policies that make sure'",
        "'speaker_7': 'that the jobs, first of all, are good jobs. Right. With the wages we described. Second of all, are sustainable jobs with policies like worker retention. And then third of all are just jobs. Right. That they have good voices on the job, are not fired for organizing or for being engaged in activities that are protected, that those types'",
        "'speaker_7': 'of things are what make that economic engine valuable to the regular people of Denver who may not be frequent fliers. Right. It's valuable to all of us as passengers. But that economic engine piece has to mean something to the workers at all incomes.'",
        "'speaker_7': 'And so I think this completes the vision. Right, these types of policies that we've been addressing. And so I want to thank the workers who came to testify during committee, the staff and the folks who represent them from Unite Here and SEIU Local 105 And I share this with my colleagues at committee.'",
        "'speaker_7': 'But, you know, this is a union neutral policy. The majority of workers who are protected by it probably aren't represented by a union. But these are policies that really fill in those gaps for all of those workers and make sure that they're on a level playing field.'",
        "'speaker_7': 'And so for that, I'm really proud that it's on the consent agenda tonight. There will be no dramatic vote count here, but I thought it was important because of what these workers have been through over the last year, because of how really collaborative and meaningful this conversation was, where all the players in our city agencies and council'",
        "'speaker_7': 'members and workers where we're working together. I want to thank the airlines who participated in the conversation and gave us feedback that resulted in some changes, but I just thought it was worthy of comment before we passed it along in the consent agenda, I want to thank my colleagues for their support, especially you, President Gilmore, as the'",
        "'speaker_7': 'host of our airport, been very engaged in the conversation. So thank you to all and look forward to the consent vote.'",
        "'speaker_0': 'All right. Thank you very much, Councilmember Kinney, and likewise, want to thank the folks that are working at it, Dan, and the leadership at the airport as well. But then also, I would be remiss if I didn't thank you for your leadership and partnership, especially in working with Unite Here and SEIU as well, and so happy to'",
        "'speaker_0': 'support this tonight. It's important and it stabilizes our families in the community and also the airport as well. All right. Not seen any other items called out. That concludes that recap portion. All bills for introduction are ordered published.'"
    ],
    "Zoning Change for 945 North Irving Street in Villa Park.": [
        "'speaker_0': 'We have three public hearings tonight for those participating in person. When called upon, please come to the podium and on the presentation monitor. On the wall you will see your time counting down for those participating virtually. When called upon, please wait until our meeting hosts promote you to speaker.'",
        "'speaker_0': 'When you promoted your screen will flash and say Reconnecting to meeting. Please don't leave the meeting. You will be reconnected and will need to turn on your camera. If you have one and your microphone, you will see your time counting down at the bottom of your screen.'",
        "'speaker_0': 'Once you have finished speaking, you will change back to participant mode and see your screen flash one more time. All speakers should begin their remarks by telling the council their names and cities of residence and if they feel comfortable doing so, their home addresses.'",
        "'speaker_0': 'If you've signed up to answer questions, only state your name and note that you are available for questions of counsel. Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted.'",
        "'speaker_0': 'Will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating to virtual participants. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech.'",
        "'speaker_0': 'Direct your comments to council as a whole and please refrain from individual or personal attacks. Council Councilmember Black, will you please put Council Bill 5 to 3 on the floor for final passage?'",
        "'speaker_5': 'I believe that Council Bill 20 1053 be placed upon final consideration.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the re cry. The required public hearing for council bill 5 to 3 is open. May we please have the staff report and we have Edson here.'",
        "'speaker_11': 'Good evening, counsel. My name is Ed Banyas and I'm with Community Government. Before you today we have 945 North Irving Street. It's currently on Eastside and the requesting Eastside one, which is a single unit zone district and the requesting for a single unit zone district with an accessory dwelling units.'",
        "'speaker_11': 'So the the site is located in Council District three and fourth District in Villa Park neighborhood. And the site itself is just over 6000 square feet. It's a single unit residential structure and the request is to allow for an accessory dwelling unit.'",
        "'speaker_11': 'And you. The current zoning is ESU D, which is a single unit zone district to the north. You see ESU, D1 X, which is a single unit zoned district that allows for an accessory dwelling unit as well as E.R. 2.5, which is a row house up to 2.5 storeys in height and directly to the south.'",
        "'speaker_11': 'You already see an ESU, D1, which is a single unit zone district allowing for an accessory dwelling unit. The land use is single unit residential. It's predominantly single unit residential in the area with some two unit and motel unit scattered in open space to the north right next to the trunk station.'",
        "'speaker_11': 'And then the property itself is on the upper left corner. It's a the property is very pushed back. So the vegetation doesn't allow you to actually see the structure, but you can see the front of that property. And then you can see in the overall it's one story structures in proximity to this site.'",
        "'speaker_11': 'So went before the planning board in May and it was approved unanimously and it's before you today. And so far as a president, we've only received one letter of support and it is attached to the staff report. Whenever we have a rezoning, there are specific review criteria that we look at from the Denver zoning code.'",
        "'speaker_11': 'So there are five, and the first one is Kansas City with adopted plans. And we're focusing on three specific plans which are comprehensive plan 2040 blueprint in Denver, a language in transportation plan of 2019 and as well as the Villa Park Neighborhood Plan of 1991.'",
        "'speaker_11': 'So there are several strategies found in comprehensive plan 2040 that the proposed rezonings consistent with that are specified in the staff report. And I would jump into your blueprint in Denver. Groups in Denver classify this area as urban edge, which is predominately residential.'",
        "'speaker_11': 'When we look at the place type, it's classified as low, medium residential, which offers a mix of low and mid-scale multi-unit residential options. And for the street type classification for North Irving, Street is a local street which is primarily served by residential uses.'",
        "'speaker_11': 'When we dove into the neighborhood plan, the Villa Park plan of 1991, their specific strategy and language in this plan that talks about specifically strategy to to discourage development that is incompatible with this the scale and quality of the neighborhood as well as having a it does talk about having a housing vision expressed in the plan that'",
        "'speaker_11': 'is strong and vital residential neighborhood to increase the rate of home ownership, renovate and maintain housing as well as strategy each one a which is enhance the appearance in the quality of the neighborhood housing. As well as the rezoning meets the other review criteria specified in the staff report.'",
        "'speaker_11': 'Therefore, CPD recommends, based on all the findings of the review criteria have been met and staff is available for any questions you may have as well as it is here as well online. Thank you.'",
        "'speaker_0': 'All right. Thank you, edson. And this evening, we have one individual signed up to speak on this hearing, and it's Jesse Paris. Go ahead, please, Jesse. You can speak, Jesse. We're trying to get you into the queue, Jesse.'",
        "'speaker_0': 'I think you're going to have to unmute yourself. Jesse, we're going to have to have you unmute yourself, please. All right. It seems that we're having some problems. We can't, unfortunately.'",
        "'speaker_4': 'Jesse isn't.'",
        "'speaker_0': 'Amusing himself. And so we're going to, unfortunately, need to go ahead and move on. We've tried. Everything that we can. And so we're going to go ahead and continue on with the hearing. We want to allow any questions from members of council on a council bill 5 to 3.'",
        "'speaker_0': 'Counsel Pro Tem Torres.'",
        "'speaker_7': 'Thank you, Madam President. Hey, Edson. I'm going to follow up with a question, but I'm wondering if we have the applicant in queue, Mr. Salas, or is he in chambers now?'",
        "'speaker_0': 'I believe the applicant should be in the queue. And so it's Willie Salas. I have been tell.'",
        "'speaker_4': 'Of Mr. Salazar and the meeting.'",
        "'speaker_0': 'Hi, Mr..'",
        "'speaker_5': 'Silas.'",
        "'speaker_4': 'Hi.'",
        "'speaker_7': 'I'm to asked the property.'",
        "'speaker_4': 'Owners.'",
        "'speaker_7': 'And we've talked about your current house that it sits way at the back of your property. What's your plan for building your edu?'",
        "'speaker_4': 'Right now, it's in very much the conceptual phase. I don't have any. Guidelines that I can really communicate or speak on right now. As you know, the pricing of construction materials is very high right now. So I don't have any immediate plans for what it would look like.'",
        "'speaker_4': 'But I can tell you that I look forward to taking advantage of this new rezoning and adding an 80 in the rear. And that's basically as much as I can say.'",
        "'speaker_7': 'In 80, you in the rear would mean demolishing the current primary house. Right. Which is at the rear of the property.'",
        "'speaker_4': 'Yeah. I think the plan is to demolish the almost 100 year old section of the primary house. Yes.'",
        "'speaker_7': 'Thank you so much. It's just a question for you really quickly whether or not this is a. Um. What Mr. Salis builds. He's allowed to build, attached or detached on the property, right?'",
        "'speaker_1': 'Correct.'",
        "'speaker_7': 'What changes or does anything change if it's an attached edu when it comes to bulk plane? Maximum height, that kind of thing. Cause I recall that the rear had a lower height than the primary. In a detached situation, what happens with an attached.'",
        "'speaker_11': 'So in an attached situation. And. There's setback requirements that he would have to rear set back requirements that he'd have to meet into any situation. He doesn't meet that. So he would have to work with development services to figure out exactly.'",
        "'speaker_11': 'But the code is very specific for this stone district that says in the rear the maximum allowed is 19 feet. If it's an attach and if it was detached, it would be 24 feet. And so in this scenario, he would have to follow those guidelines.'",
        "'speaker_0': 'On foot attached. Okay. That's all I had.'",
        "'speaker_7': 'No additional questions. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, counsel pro Tem Torres and Councilmember Sawyer. I thought I'd seen you up, but maybe your question got answered.'",
        "'speaker_7': 'It got answered? Yep.'",
        "'speaker_0': 'Thanks. All right. Great. Thank you. All right, so you. No other questions from members of council. The public hearing is closed. Comments by members of Council on Council Bill 5 to 3, Council Pro Tem Torres. Thank you, Madam President.'",
        "'speaker_7': 'I just really want to extend thanks to Mr. Salas for approaching our office early today, just to let us know what he was working on. He got ahead of our conversation by probably about a year because we're looking to reason this entire section through our multi neighborhood rezoning.'",
        "'speaker_7': 'So your neighbors will have the same permission.'",
        "'speaker_0': 'As you, Mr. Salas. If this does go through.'",
        "'speaker_7': 'But I just appreciate the communication from the applicant with myself, as well as the R.A. and their neighbors. I look forward to supporting tonight. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Counsel Pro Tem Torres, and I am happy to support this as well, seeing that it meets all of the rezoning criteria. Madam Secretary, roll call on Council Bill 523. Torres, I.'",
        "'speaker_5': 'Black eye, I.'",
        "'speaker_6': 'CdeBaca. Clark. Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Hynes I.'",
        "'speaker_6': 'Cashman.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Can each I.'",
        "'speaker_6': 'Ortega.'",
        "'speaker_0': 'I. I.'",
        "'speaker_6': 'Sawyer.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_6': 'Ten Eyes.'"
    ],
    "Rezoning of Property in West Colfax from U-SU-C2 and U-RH-3A to U-RX-3.": [
        "'speaker_0': 'Ten eyes. Counsel build 20 1-523 has passed. All right. We're moving on to our second hearing. Councilmember Black, will you please put Council Bill six, five, nine on the floor for final passage?'",
        "'speaker_5': 'I move that council bill 20 10659 be placed upon final consideration and do pass.'",
        "'speaker_0': 'All right. It has been moved and seconded. The required public hearing for council Bill 659 is open. May we have the staff report? And I see we have James here with us.'",
        "'speaker_1': 'Good evening. James Van Houser with CPD. Right. Are you seeing my presentation?'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Okay. So today we have a requested rezoning at 1634 through 1680 North Sheridan Boulevard.'",
        "'speaker_0': 'Up. James, we're going to ask you to speak a little bit louder into your mic there.'",
        "'speaker_1': 'Can do.'",
        "'speaker_0': 'You.'",
        "'speaker_1': 'Today we have a proposed rezoning at 1634 through 1680 North Sheridan Boulevard. The request is to go from USC to and you are h382. You are x three. Properties located in Council District one Councilwoman Sandoval's district in the West Colfax neighborhood.'",
        "'speaker_1': 'The site is approximately 1.11 acres and concurrently contains several one and two storey single and two unit residential buildings. The proposed rezoning to Yurek three allows for residential mixed use development and the applicant intends to propose multi-unit residential development on the site.'",
        "'speaker_1': 'Existing land use on the subject properties a single unit and two unit residential. Surrounding area includes mix of park single and two unit residential as well as some multi unit residential land uses. This was before the planning board in early June.'",
        "'speaker_1': 'Planning Board unanimously recommended approval of the rezoning. We've gotten one R.A. comment letter from the Sloan's Lake Citizens Group and five public comment letters from members of the public. Four letters in support and one letter of opposition. Wanted to note briefly the previous action that had taken place on these parcels.'",
        "'speaker_1': 'There was a previous rezoning effort in 2019 to rezone the properties to UMC and UMC. Three Planning Board at that time voted five zero to recommend approval of that application and City Council voted to deny it 10 to 2 at a public hearing held on nine 1619.'",
        "'speaker_1': 'I will note that this is a completely new application with a completely new set of applicants and a completely new zoned district being requested. However, I thought that the previous action might be useful context. Existing zoning is U.S. C-2, which is a single unit zoned district that also allows detached ADAS as well as tandem houses and duplexes'",
        "'speaker_1': 'on certain corner lots as well as the U, r, h3a, which is a real house district. Just adjacent zoning. We have some OSA to the north and Flynn's like park you are H-3 also to the south U.S. two and you are H-3 to the east and across here at End Boulevard in Edgewater and Lakewood.'",
        "'speaker_1': 'There some are two or three and RMF something. Here's an aerial of the site for existing context of the building forming scale. Review criteria. Start with consistency of adopted plans. The proposed rezoning is consistent with a number of COP Plan 2040 goals as elaborated on in the staff report.'",
        "'speaker_1': 'Blueprint. Denver The future neighborhood context is urban, which is categorized by small multi-unit, residential and mixed use areas embedded in one and two unit residential areas and low scale multi-unit buildings are generally appropriate in this context. Looking at our future place type is a residential low medium, which sees a mix of low to mid scale multi-unit residential'",
        "'speaker_1': 'interspersed in single and two unit residential areas and building heights are three stories or less generally. Sheridan Boulevard is a mixed use arterial. 17th is a residential collector and any place to the south is a local or un designated street.'",
        "'speaker_1': 'Future growth strategy is all other areas of the city. Looking at the West Colfax plan. The land use concept for these parcels is the main street a scale of 2 to 5 storeys as appropriate. Creating a comfortable pedestrian environment is a stated goal of the plan, and a linear orientation to the street is also a stated goal'",
        "'speaker_1': 'of this type of land use concept. The Framework plan land use recommendations from the West Coal Flex Plan include supporting infill development as well as promoting a range of housing types and end costs at higher densities in strategic locations, including Main Streets, which as on the previous slide, this falls into.'",
        "'speaker_1': 'The District plan as part of the West Conflicts plan. This is again a main street, specifically the pig and whistle district. With recommendations to rezone to Main Street two and three. Those are old code districts that would translate to EMS five and eight in the current Denver zoning code.'",
        "'speaker_1': 'Staff finds the application consistent with criteria two and three. Justifying circumstance. The applicant cites change or changing conditions in the neighborhood and cites a few, few specific examples. And staff concurs that the change in changing conditions is an appropriate justifying circumstance.'",
        "'speaker_1': 'The application is also consistent with the neighborhood context zone, district purpose and intent. And CPD recommends that Council approve application 20 00168 based on finding or review criteria have been met. Staff is available for questions and we also have the applicant here in person.'",
        "'speaker_0': 'All right. Thank you, James, for the presentation this evening. We have one individual signed up to speak this evening and it's Jesse Perez. And so we're going to go ahead and try to bring Jesse into the queue to speak again.'",
        "'speaker_0': 'And if for some reason, Jesse, we're not able to hear you, we're going to ask you to log off and log back in, but we're going to go ahead and try it before we ask you. Okay. Good deal.'",
        "'speaker_0': 'I think we've got you in. Jesse, go ahead and please begin.'",
        "'speaker_4': 'Yes. Good evening. Members of council, those watching at home when I was just in Paris and I'm representing four black star Exxon Mobil for self-defense positive action for my face also signs as well as the unity party of Colorado and for a long black nose.'",
        "'speaker_4': 'And I'll be the next mayor in 2023. I'm in favor of this rezoning tonight. I just had a few questions. I wanted to know if there had been a study done, a neighborhood study done. Uh, also, what would the army level be for the housing at this location?'",
        "'speaker_4': 'From mixed use to residential well with the house in before this. Am I level B for this? And also, if there was a traffic study done this summer to answer those three questions, either the occupant or members of council, I would greatly appreciate it.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. That concludes our speakers this evening. Questions from members of Council on Council Bill 659. All right. Seen no questions by members of council this evening. The public hearing is closed. Comments by members of Council on Council Bill 659.'",
        "'speaker_0': 'Council Member Sandoval.'",
        "'speaker_8': 'Thank you, Madam President. Um, this application before you today, this property was heard a while ago in front of us and voted down and the new owners have done extensive outreach into the community. And I just want to note that the height increase is pretty much it's not that big.'",
        "'speaker_8': 'The adjacent property to the south, that's where we got the height increase for this property. And one other note to talk about is that along Sheridan I do not have sidewalks on 17th and Sheridan it is a pedestrian path and this redevelopment will allow for sidewalks on Sheridan Boulevard.'",
        "'speaker_8': 'They are dedicating 16 feet of right away the entire length of the property, the block for a tree line and dedicated sidewalks. I ask my colleagues to support this. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. And we are. Working on. I know that we had Councilmember Ortega. She had her hand raised. And so we're I'm getting some direction from our legal counsel. I'm going to go ahead and gavel back in and open the public hearing back up.'",
        "'speaker_0': 'And so we're going to do that so that we can include questions by Councilmember Ortega. All right. We have reopened the public hearing for Council Bill 659. Councilmember Ortega, please go ahead with your questions. Thank you, Madam President.'",
        "'speaker_0': 'I had lost audio there for a minute. I couldn't hear what was being said, but my questions for specific to the consolidation of the land or the assemblage of I.'",
        "'speaker_4': 'Am.'",
        "'speaker_0': 'Just trying to get an idea of how many units can now be built on that site, because that then raises some questions about whether the ingress and egress will be offered Sheridan or whether it's going to be off a 17th Street or maybe even 16th, because both Sheridan and 17th are busy streets.'",
        "'speaker_0': 'And it depends on whether you can take a left in from 17 to the site or, you know, just how that's going to work. I think it's going to be really important. It may be that the applicant is just looking to rezone for right now and doesn't have any immediate plans to move forward with the construction.'",
        "'speaker_0': 'But I think just understanding some of that will be really important to ensuring that we don't have accidents along that corridor. That is one of the streets that previous council members from this district have tried to ensure that we've got sidewalks along Sheridan Boulevard because there aren't any and we have a bus stop.'",
        "'speaker_0': 'And oftentimes you see people with strollers trying to walk their kids on a slanted dirt area that is very unsafe. This is the next block over. But all all of those factors just kind of come into play, particularly with this block as well.'",
        "'speaker_0': 'So I wanted to just ask those questions. I think maybe some of that can be addressed by our city staff from CPD, but maybe the applicant as well. All right. Thank you, Councilmember Ortega. We're going to go ahead and start out with James and then I believe we have the applicant here.'",
        "'speaker_0': 'So we'll just ask you to introduce yourself as well. But go ahead, James.'",
        "'speaker_1': 'Thank you for the questions. Councilman Ortega. Generally, we wouldn't get into site development plans at the rezoning stage. All of the, you know, requirements for egress and ingress have, you know, have to meet our standards and be built to our code provisions.'",
        "'speaker_1': 'However, I do believe the applicants have submitted in step already in anticipation of this rezoning. So I will defer to the applicant if he'd like to answer some of your specific questions, because I think there are specific answers in this case.'",
        "'speaker_4': 'Thank you. Hi. Thank you. Consul Mac Yardeni with us.'",
        "'speaker_1': 'Architecture 4164 Irving Street. Thank you for taking the time tonight to review this.'",
        "'speaker_4': 'We have, as Amanda stated.'",
        "'speaker_1': 'Reached out to the neighborhood pretty extensively to understand concerns, desires and mitigate as many of the impacts of the development as we go forward. As stated, we have already submitted our concept step. We wanted to understand further with Dottie and transportation as well.'",
        "'speaker_4': 'As access points.'",
        "'speaker_1': 'Throughout the site. We are going to have those meetings here later on Wednesday and we'll have better understandings. We have not performed any traffic studies at this time. However, we have had conversations with both CDOT and transportation about the upcoming improvements that are going to occur along both Sheridan and 17th, trying to make sure that we work'",
        "'speaker_1': 'with.'",
        "'speaker_4': 'The affected ingress and egress for the site to the question of total number.'",
        "'speaker_1': 'Of units under the new zoning, we have currently planned for 60 units and looking at parking that at a 0.75.8 ratio to mitigate any off site parking. The price point that we have tried.'",
        "'speaker_4': 'To.'",
        "'speaker_1': 'Identify going back to the previous question has really been to build a smaller product to fill in that missing metal by not building that concrete podium and keeping it a surface parking, we're able to build these.'",
        "'speaker_4': 'At a.'",
        "'speaker_1': 'Lower cost and therefore offer them to the community at a lower cost. Those numbers are still to be determined as we go through the construction process. And then, as Amanda stated, reconstruction of the entire length of Sheridan Boulevard with a future eight foot tree line and an eight foot sidewalk that is multi-modal, serving that connection between the'",
        "'speaker_1': 'Colfax corridor and the park, really trying to create that gateway for Denver. Any other questions?'",
        "'speaker_0': 'All right. Thank you. We're going to go ahead, Councilwoman. Take care of your fist. A follow up, clarifying question on whether or not that was intended to be a for sale product or a rental project.'",
        "'speaker_1': 'It's currently in the for sale or sorry for rent.'",
        "'speaker_0': 'Or rent a rental car. Okay. Thank you so much. Thank you, Madam Chair. All right. Great. Thank you. And thank you, Councilmember Ortega. And seeing that, we wrapped up the questions by members of council. The public hearing is closed and we've had comments by Councilmember Sandoval.'",
        "'speaker_0': 'I want to give it a moment if there's any additional comments by members of council. CNN. I'll go ahead and chime in that I do believe this meets the rezoning criteria and will be supporting it this evening as well.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 659.'",
        "'speaker_5': 'Sandoval. I swear, I. Torres I. Black I. Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'Hynes. Hi Cashman. I can each.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Take it. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_6': 'Ten Eyes.'"
    ],
    "Rezoning for Accessory Dwelling Units in Sloan Lake and West Colfax.": [
        "'speaker_0': 'Ten Eyes Cancer build 20 1-659 has passed our third public hearing tonight. We're on to it. Councilmember Black, will you please put Council Bill 7 to 0 on the floor for final passage?'",
        "'speaker_5': 'I moved that council bill 20 1-070 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. I'm not seeing the second here. Oh, there we go. Thank you. It has been moved and seconded. The required public hearing for council bills. 7 to 0 is open. And we've got Libby here. So may we get the staff report?'",
        "'speaker_12': 'Yes. Okay, good. It's on the screen and you all can hear me. Yes. Okay, great. I'm Libby Adams with Community Planning and Development. And I'll be presenting the map amendment in Sloan Lake and West Colfax to allow for to use.'",
        "'speaker_12': 'This application is sponsored by Councilwoman Sandoval. The Map Amendment reasons. All single unit residential properties and Sloan Lake and then six properties in West Colfax neighborhood to allow for accessory dwelling units. This application is located in districts one and three in the Sloan Lake and West Colfax neighborhoods.'",
        "'speaker_12': 'The proposed rezoning includes about 1400 properties or 239 acres bounded by Sheridan Boulevard, Federal Boulevard, 17th Avenue, and then 29th Avenue. The proposed Map Amendment intends to rezone properties between Sheridan Boulevard and Lowe Boulevard and then Irving to federal from U.S. to U.S., U.S. one.'",
        "'speaker_12': 'And then properties between Lowe Boulevard and Irving Street, from U.S. B to U.S. U, B1, and then properties between about Grove and Federal. From us you see what the use overlay three to use U.S. you see one with the use overlay three.'",
        "'speaker_12': 'So the proposed zone districts are the same as the current zone districts, except that they allow for an accessory dwelling unit. Either the accessory dwelling unit use either within the primary structure or within a detached structure. As I just stated, the existing zoning is us sub us you see and us you see with the use overlay three'",
        "'speaker_12': 'and you can see the surrounding zoning. It's mostly single unit two unit and then park an open space to the south. These single unit districts all allow for the urban house building form with heights from 30 to 35 feet.'",
        "'speaker_12': 'And then the US you see what the use overlay three. That's the historic use overlay that does allow for some limited office and commercial uses within a portion of the what are coalfield historic district. This lone leg view plane is applicable to the southern portion of this rezoning.'",
        "'speaker_12': 'So this results in a building height limit of 16 feet directly east of Sloane Lake Park and then 61 feet closer to Federal Boulevard. However, the Denver Revised Municipal Code Section ten 137 does allow for new structures to be constructed up to 35 feet in height so this new plane won't have any impact on any single unit'",
        "'speaker_12': 'development in this area. There's also a historic district in the area that's closest to Federal Boulevard. And so this is the Witter Witter Coalfield Historic District. And all proposed accessory dwelling units in this area are subject to design, review and approval from the Landmark Preservation Commission.'",
        "'speaker_12': 'So the site and the surrounding properties are mostly single unit residential uses. There's also some two unit multi-unit and public quasi public uses located within the subject rezoning and then surrounding it. There's a variety of residential office and commercial uses, as well as parks and open space directly south.'",
        "'speaker_12': 'Here are some images of the area within the proposed rezoning. So the top pictures proposed to be re zoned to us. You see one the middle pictures in the area proposed to be reserved to U.S. would be one.'",
        "'speaker_12': 'And then the bottom picture, U.S., U.S. one with these overlay three. And then this shows some of the properties surrounding the rezoning. So you can see some of the commercial sites on 29th Avenue and then Federal Boulevard and then, of course, Sloan's Lake Park directly south.'",
        "'speaker_12': 'So District one council office began the outreach for this rezoning last fall. It included fliers, two virtual town halls and an online survey. And this map amendment was complete at the end of March. And then this went to planning board in mid-June where they unanimously recommended approval.'",
        "'speaker_12': 'The Sloan's Lake Citizens Group took a straw poll at one of their meetings earlier this summer, and most in attendance were in support of the proposed rezoning. Staff has also received eight letters of support in support of the proposed rezoning, citing a desire inappropriateness for a slight increase in density in this area.'",
        "'speaker_12': 'And then the council office also provided 30 letters with the application in support of the rezoning. And then we've also received ten letters in opposition, citing concerns such as traffic density, height, and that this rezoning could allow for multi-unit and commercial uses.'",
        "'speaker_12': 'However, this rezoning does not allow for any duplexes, triplexes or additional commercial uses. So because this rezoning is legislative, there are three review criteria that are applicable. The first is consistency with adopted plans, and there are four plans that are applicable to this area.'",
        "'speaker_12': 'The proposed MAP amendment is consistent with several of the strategies in the comprehensive plan which are outlined in the staff report and on this slide. Blueprint. Denver maps this area as the urban context. So the proposed zone districts are consistent with this plan direction a predominantly residential areas that are generally single and two unit uses.'",
        "'speaker_12': 'And then the proposed zone districts are consistent with the future places mapping of this area as low residential, which is mostly single and two unit uses and where accessory dwelling units are appropriate. Most of the future street types are local as also residential arterials and collectors.'",
        "'speaker_12': 'And all of these street types are mostly characterized by residential uses, which is consistent with the proposed residential zoning. The growth area strategy is all other areas of the city. This is where we anticipate to see 10% of new jobs and 20% of new housing by 2040.'",
        "'speaker_12': 'So allowing a slight increase in density by allowing 80 use is consistent with this growth area strategy. There are also several other policies and blueprints that this rezoning meets. So the first is policy for of the land use and built form section on housing, which talks about diversifying housing choice through the expansion of accessory dwelling units throughout'",
        "'speaker_12': 'all residential neighborhoods. The second is land use in built form general policy 11, which talks about implementing plan recommendations through large scale city led or city led legislative rezoning such as this one. And then the land use and built form general policy five talks about the importance of mitigating involuntary displacement, which I'll discuss in the further slides'",
        "'speaker_12': '. So all large map amendments such as this one should be guided by the equity concepts that are found in Blueprint Denver. So the Access to Opportunity Score is a composite of the Neighborhood Equity Index developed by Denver's Department of Public Health and Environment.'",
        "'speaker_12': 'Proximity to high capacity transit and access to centers and corridors. This area has moderate access in this category, with access to transit being lower and access to centers and corridors vary throughout the neighborhood. So the proposed rezoning to allow for adus in Sloan Lake and a portion of West Colfax will bring more residents to an area that'",
        "'speaker_12': 'has greater access to health care and parks and open space. And the proposed rezoning will not have a direct impact on creating new centers and corridors, as it will only allow for residential uses. The vulnerability to involuntary displacement score is calculated by the Department of Housing Stability and based on median household income, percent of renter occupied units'",
        "'speaker_12': 'and the percent of residents with less than a college degree. Sloan Lake scores as vulnerable based on higher median house price, scores as less vulnerable based on higher median income, having a lower percentage of renters and higher educational attainment than Denver as a whole.'",
        "'speaker_12': 'Whereas the six properties in West Colfax score as vulnerable on all three indicators. So this proposed MAP amendment will provide opportunities for existing homeowners to supplement their income, while also increasing housing options in the neighborhood, allowing people with a greater range of incomes to live in the area.'",
        "'speaker_12': 'And it may prevent it from becoming vulnerable. The housing diversity score includes five measures. So the percentage of middle density housing, home size, diversity ownership versus rental housing costs, and the number of income restricted units in the area.'",
        "'speaker_12': 'The western portion of Sloane Lake and the properties in West Colfax are considered less diverse. For the four measurements shown in bold, while the eastern portion of Sloan Lake is seen as are students having a greater housing diversity.'",
        "'speaker_12': 'So this map amendment to allow it to use will introduce a new housing type and bring more renters to a largely owner occupied single unit area. And then for jobs diversity. So this map shows the mix of jobs in the area with the dominant industry depicted by color.'",
        "'speaker_12': 'So this area has a higher proportion of retail jobs in the city as a whole. However, as you can see, there's good chunks of the map that don't are represented by a color. And that's because there's not enough data for us to determine which job is significant in this area.'",
        "'speaker_12': 'So and this map amendment will have a negligible impact on jobs diversity. And then housing and inclusive. Denver was adopted in 2018 and contains recommendations that are directly relevant to this MAP amendment. The plan recommends expanding the development of Adus as they incentivize affordable and mixed use housing.'",
        "'speaker_12': 'So the proposed MAP Amendment, which will expand access to Adus and is therefore consistent with this recommendation. And then the West Colfax plan is applicable to just the six properties that are at 17th and Meade. And this neighborhood concept for this area is urban neighborhood, which allows for single unit carriage houses, duplexes, row houses, townhomes and small'",
        "'speaker_12': 'apartments with heights two, 1 to 4 stories. So the proposed rezoning to allow adus in this area is consistent with the urban neighborhood guidance. This Map amendment will result in uniformity of district regulations, and it furthers the public health, safety and general welfare by implementing Blueprint Denver and by allowing more residents in an area that has greater'",
        "'speaker_12': 'access to health care and parks and open space. And it will also further the general welfare body of the city by providing housing, diversity and opportunities to help residents at a range of income levels continue to live in the neighborhood.'",
        "'speaker_12': 'So based on finding, all three criteria have been met. Staff recommends approval of this rezoning, and that concludes my presentation.'",
        "'speaker_0': 'All right. Thank you, Libby. And this evening, we have three individuals signed up to speak and all of them are joining us online. And so we'll go ahead and go to our first speaker, Alan Cowgill.'",
        "'speaker_4': 'Hi. My name is Ellen Cowgill. I live in the 2100 block of Newton Street. First of all, I went to I am a member of the Stones Citizens Group. I'm not speaking on behalf of the group, but I am a member.'",
        "'speaker_4': 'I want to thank Councilwoman Sandoval for her community outreach. Her team members, Manny and Naomi, have been at many of our meetings over the last few months walking us through the process. I think this is a great addition to our neighborhood.'",
        "'speaker_4': 'Anything that we can do to add more affordability. I myself, we just bought our house six years ago and there's no way we can afford it today. So I would welcome more folks to share this neighborhood with, and I'm really appreciative of the work that councilwoman sent them.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jesse Paris.'",
        "'speaker_4': 'Yes. Members of council, those watching at home, those that are in the chamber. My name is just Elizabeth and I'm representing four black sites to move for self defense, positive social change, as well as the Unity Party of Colorado in front line black males.'",
        "'speaker_4': 'And I will be the next November 2023. I'm in favor of this rezoning tonight. We need accessory dwelling units in all areas of the city, not just District one or three, but all districts of the city. I supported any use when I ran for City Councilor Large in 2019, when I got almost 15,000 votes with no money'",
        "'speaker_4': ', and I will continue to support them in 2023 when I run for mayor. So I am for support of this rezoning tonight. My. Thank you.'",
        "'speaker_0': 'Thank you, Jesse. Our last speaker is Patrick Murphy.'",
        "'speaker_4': 'Hi. Yes, I just want to call calling. I live at 2811 Utica Street in Councilwoman Sandoval's zone. And this this option for to use is a is a great step forward for our neighborhood. The presentation did a great job at the macro level.'",
        "'speaker_4': 'I just wanted to talk a little bit about the micro level and with the micro that we will be able to for for my family at this point, we will be able to actually have my, my, my ailing mother come and live with us in the next couple of years because of because of this resolution, it helps'",
        "'speaker_4': 'out so much for little micro micro scenes like that. And I appreciate you all for doing this. And we really look forward to having this aid. You are this age, you past. Thank you very much.'",
        "'speaker_0': 'All right. Thank you. And thank you to our speakers for joining us. All right. We're going to go ahead and move on. Questions from members of Council on Council Bill 7 to 0. Council member Hines.'",
        "'speaker_4': 'Thank you. Council President You mentioned Sloan's Lake, Sloan Lake. Um, I don't know what you call it. Is it Sloan Lake? Sloan's plural lake? Is it Sloan's possessive lake? Can you help me solve that riddle?'",
        "'speaker_12': 'Yeah. So, Councilman Sandoval, correct me if I'm wrong, but my understanding is the statistical neighborhood is Sloan Lake, and the park is Sloan's Lake Park.'",
        "'speaker_4': 'And the lake itself is flowing. Lakes Lake.'",
        "'speaker_9': 'That? I don't know.'",
        "'speaker_4': 'Okay. Thank you for promoting it. Use in our city. Thank you. Council president.'",
        "'speaker_0': 'All right. Thank you, Councilmember Hines. And we'll get that cleared up. I think we're all going to be Googling, Googling that later. I want to take a quick pause. It looks like we don't have Councilmember Ortega is hand-raised.'",
        "'speaker_0': 'No questions from her. All right. Very good. Then we're going to go ahead. And the public hearing is closed. Comments by members of Council on council bills 7 to 0. Council Member Sandoval.'",
        "'speaker_8': 'Thank you, Madam President. First and foremost, I'd like to thank Libby. Libby from CPD in all your hard work. We started this over a year ago looking at a map of where the current entitlement was and where could we add it.'",
        "'speaker_8': 'So thank you for your due diligence. Second of all, I would love to thank Naomi Grendon for my office, who's my land use planner for North West Denver District one. She goes above and beyond with her community outreach and her due diligence and the way she puts together information in a meaningful and thoughtful manner so people can'",
        "'speaker_8': 'understand it, who don't talk zoning all the time. So big shout out to Naomi and then my other staff. So as we started this process, looking at where I could add accessory dwelling units, we were looking at how many one off ADOS were coming through and Sloan's Lake had the most at that point of time, not the'",
        "'speaker_8': 'most permits pulled, but the most homeowners coming and paying $1,000 and asking for a rezoning. As for the name Sloan's, I think it's called Sloan's Lake Neighborhood with an S. There is lots of back information on that, and I don't think there is a clear answer.'",
        "'speaker_8': 'I think it's Sloan's Lake, Sloan's Lake Park. I put a s on a lot of things that I probably shouldn't put S's on. I grew up talking that way, so it's probably maybe a Latino thing where you go, you add S's to certain things.'",
        "'speaker_8': 'So to 80 use are a perfect way to add gentle density in our single unit neighborhoods, which make up the vast majority of zoning in Denver. If we got a map not long ago from community planning and development that looked at where all the adus are being built and predominantly they're being built in northwest Denver.'",
        "'speaker_8': 'And I will say one thing we do not get for phone calls about accessory dwelling units, and we do not get complaints about accessory dwelling units. Most people don't even know they're there because of the type of gentle density that they're adding into the neighborhood.'",
        "'speaker_8': 'I will say that although we are changing the entitlement this half this evening for these parcels, there's many, many barriers still in the way of building an accessory dwelling unit. I'd like to give a shout out to council mentors, to partnering with me.'",
        "'speaker_8': 'When I looked at the map and I saw that there were six properties in her district, I called Councilwoman Torres right away and asked if I could lead the charge on her behalf of her constituents. She said yes.'",
        "'speaker_8': 'And then we reached out to West Denver Renaissance Collaborative. That's working in the West Colfax neighborhood to bring accessory dwelling units into homes for people who can use them for neighbors or their rent for their family, and to also be able to stay in the neighborhoods that they like.'",
        "'speaker_8': 'So thank you to Renee Martinez Stone and the West Denver Renaissance Collaborative with the release last week of the 2021 House Strategic Plan. I'm hoping resources can be allocated to CPD and host to work on this important topic of accessory dwelling units.'",
        "'speaker_8': 'If we really care about housing, we need to put money where our mouth is. And currently there are numerous barriers to building an accessory dwelling unit and I look forward to CPD bringing forward the task force to address these.'",
        "'speaker_8': 'One of them is a minimum zone lot size. I will be transparent, although I'm adding entitlement to this entire neighborhood. A big chunk of this neighborhood would not be able to build an accessory dwelling unit because of the minimum zone lot size.'",
        "'speaker_8': 'So I will have to tackle that next. I talked to the neighbors and said I would change the entitlement process for them and now I'm going to have to go in and figure out how am I going to deal with the minimum zone lot size so that these parcels can build excess.'",
        "'speaker_8': 'Three dwelling units if they'd so like with that. Thank you. Oh, I would like to think the residents of the Sloan's Lake neighborhood for participating in this survey. We had numerous people fill them out. And interestingly enough, of the people that were surveyed, only, only a very small percentage will actually build them.'",
        "'speaker_8': 'Right now, 32% said they plan do not plan to build an accessory dwelling unit, but would like to have the entitlement. So if you wonder if people read our emails or our postcards, 55% said they received a postcard in the mail and that's how they got involved.'",
        "'speaker_8': 'So for all my colleagues, please make sure that we're continuing to reach out to our neighborhood. And one last thing. Thank you, Naomi, for doing everything in English and Spanish. Although we only got one response in Spanish, it still proves that it's very important to have things bilingual.'",
        "'speaker_8': 'And with that, I ask all my colleagues for support. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. And I'm not seeing any other hands raised. I wanted to make sure we didn't have any hands raised online. All right. Looks good. All right. Well, and I will go ahead and add that seeing this does meet all of the review criteria.'",
        "'speaker_0': 'I'm happy to support it tonight. And thank you, Councilmember Sandoval, for your leadership and partnership with Council Pro-Tem Pro-Tem Torres on this important topic. All right. Madam Secretary, roll call on Council Bill 7 to 0, please.'",
        "'speaker_6': 'Sandoval.'",
        "'speaker_5': 'I. Sawyer, I. Torres, I. Black, I. CdeBaca, I.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'Hi.'",
        "'speaker_4': 'Hi.'",
        "'speaker_6': 'Cashman.'",
        "'speaker_3': 'Hi.'",
        "'speaker_6': 'Ken.'",
        "'speaker_5': 'Each hi, Ortega.'",
        "'speaker_6': 'I. Madam President.'",
        "'speaker_0': 'I am Home Secretary close to voting and announced the results.'",
        "'speaker_6': '11 Knives.'",
        "'speaker_0': '11 Eyes Council Bill 20 1-720 has passed. All right. Our pre adjournment announcement. Thank you, Libby, for a great presentation and for the community members who joined us on commenting on it. On Monday, August 30th, Council will hold a required public hearing on Council Bill 21, Dash 759 changing the zoning classification for 2569 South Federal Boulevard in'"
    ]
}