{
    "Proclamation for Transgender Day of Remembrance.": [
        "'speaker_1': 'Okay. Communications. Do we have any communications?'",
        "'speaker_4': 'None. Mr. President.'",
        "'speaker_1': 'Proclamations. We have three proclamations this evening. Councilwoman, can each we read proclamation 1787 or I'm sorry, 1287.'",
        "'speaker_3': 'Thank you, Mr. President. Proclamation 17 1287. Honoring Transgender Day of Remembrance and celebrating the contributions and resilience of Denver's transgender community. Whereas Transgender Day of Remembrance will be observed on November 20th, 2017, to honor the memory of those whose lives were lost in acts of Anti-Transgender violence, an annual event which began in 1998 with a vigil to'",
        "'speaker_3': 'honor the memory of Rita Hester, a transgender woman who was killed and which now honors all transgender people lost to violence. And. Whereas, a formal vigil honoring those who were lost and the loved ones they left behind will be hosted by the Gender Identity Center on November 20th at 6:30 p.m. to 8 p.m. with a reception to'",
        "'speaker_3': 'follow at East High School. 1600 City Park Esplanade, Denver. And. Whereas, our entire community is diminished when we lose the talents and contributions of any member of our community prematurely, whether due to direct anti-transgender violence or due to suicide or other health effects resulting from trauma or discrimination.'",
        "'speaker_3': 'And. WHEREAS, Denver honors the bravery and resilience of the thousands of transgender individuals who live, work or play in our city in their authentic gender. And although we are proud of the existing protections we have in place for transgender individuals to pursue their lives free from discrimination in Denver and in Colorado, we reaffirm a commitment to ongoing'",
        "'speaker_3': 'efforts to promote full inclusion of transgender individuals in the city. And. WHEREAS, we honor the outstanding organizations that serve as resources to transgender individuals in Denver, including the Gender Identity Center of Colorado, which specializes in providing critical supports and services to the transgender community.'",
        "'speaker_3': 'The GLB Community Center of Colorado, which opened in 1976 and has grown to become the largest community center in the Rocky Mountain region and provides social, educational and support programs for the transgender community. One Colorado, a leading advocacy organization for LGBTQ Coloradans and their families, which works to expand health care access for transgender Coloradans and to remove'",
        "'speaker_3': 'other barriers they face in everyday life and the work of our own LGBTQ commission, which partners with the community to advance social, economic and political equality through their unique position within the city and county of Denver. Now, therefore, be it proclaimed by the City Council of the City and County of Denver, that section one that the city'",
        "'speaker_3': 'council, the city and county of Denver solemnly declares November 20th as Transgender Day of Remembrance and Section two that the Clerk of the city and county of Denver shall a test and a fix the seal of the city and county of Denver to this proclamation, and that a copy be delivered to the LGBT Community Center of Colorado'",
        "'speaker_3': ', the Gender Identity Center of Colorado, one Colorado and the Denver LGBTQ Commission.'",
        "'speaker_1': 'Thank you. Councilwoman, your motion to adopt.'",
        "'speaker_3': 'I move that proclamation 1287 be adopted.'",
        "'speaker_1': 'It has been moved in second comments by members of Council Council McNeish.'",
        "'speaker_3': 'Thank you, Mr. President. It is with mixed emotions that we consider this proclamation tonight. According to the Human Rights Campaign funds, there have been 25 murders of transgender individuals in our country so far this year. That's an uptick from last year, which was an uptick from the year before.'",
        "'speaker_3': 'The vast majority of these victims have been people of color. And even more disturbing disparity of race in the gender identity homicides that have occurred. The loss of these lives, these talents, these contributions is a tragedy for the victims and their loved ones, and it highlights significant failures in our country.'",
        "'speaker_3': 'The epidemic of transgender violence, unfortunately, begins young. About 16.2% of transgender students experience physical assaults at school, while 32.5% experience physical harassment. But in the midst of all these threats, there is hope. There has been so much this year that has been demonstrating the bravery of our transgender community.'",
        "'speaker_3': 'Coming on the heels of Veterans Day, we have out transgender service individuals who are fighting and so far winning in the courts to keep fighting for our freedoms. At a time when the civilian leader of the military has tried to kick them out and terminate their careers.'",
        "'speaker_3': 'They are fighting and they are winning. Danica Roem is poised to be the first transgender individual elected and to serve in a state legislature when she takes office in the Virginia House of Delegates. She defeated a legislator who tried to stoke fear and deprive transgender individuals of the basic right to use a bathroom that matches their gender'",
        "'speaker_3': '. Now here in Colorado, we have a long, good history. Demonstrate discrimination based on gender identity or expression has been prohibited since 2008. Brave transgender children, their parents, teens and adults continue to work for greater inclusion in schools and in health care.'",
        "'speaker_3': 'There are trainings that are happening every day. There are inclusive health care policies available on the exchange right now today because of the work of these families. But what we know is that misunderstanding and fear still exists. We know this because subtle and overt discrimination still occur in our city, in our state.'",
        "'speaker_3': 'So in addition to the violence the state was founded to bring attention to, yes, this proclamation is a tribute to those who've been lost or harmed. Yes, it's a celebration of the bravery of transgender people who go to.'",
        "'speaker_2': 'Work, go to.'",
        "'speaker_3': 'School, walk down the street, serve in the military, run for office, seek shelter, or do anything they need to do in their daily lives, in their authentic gender. We celebrate that. But it's also a call to action. What are we doing to expand our own understanding of transgender neighbors and coworkers?'",
        "'speaker_3': 'How do we understand the terminology and use the proper pronouns when we are talking about friends or loved ones? Are we actively supporting the fight of our community to be both? To be able to adjust birth certificates? There are bills at the legislature that have been shut down for several sessions to do the simple thing of changing'",
        "'speaker_3': 'someone's birth certificate so they can match their gender. The state has not yet passed that legislation. Are we helping? Are we are we writing our legislators? Do we challenge derogatory language or rigid gender expectations when we hear it in our everyday lives?'",
        "'speaker_3': 'So I'm really proud that our council is not just hosting this proclamation tonight, but we're going to work to educate ourselves better. We're going to hold a training in a few weeks open to all the city council family to learn more about this piece of our community and to understand what their needs are and how we can'",
        "'speaker_3': 'better serve them. And so all of the organizations that are here today are resources to you. If you think you might want to do some of the same training, I encourage you to reach out. So I think these community serving organizations and I think the brave individuals who live their lives each day in spite of the challenges'",
        "'speaker_3': 'and give us hope to continue to work towards that future that we all believe in. And with that, I thank my colleagues for the opportunity to bring this proclamation forward tonight.'",
        "'speaker_1': 'Thank you, Councilwoman. Can each councilman. Clerk.'",
        "'speaker_7': 'Thank you, Mr. President. I can't say anything better than what the proclamation did or what you just did. Councilwoman Canady. So I just wanted to say thank you so much for bringing this forward, for leading on this. And I'm very proud to sit up here with you today and support this proclamation in this community.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'All right. Councilwoman Ortega?'",
        "'speaker_6': 'Well, I want to say ditto to that, but I also want to acknowledge the body of council that sat here and adopted the original ordinance that created equal protection for. Everyone in our community, especially our LGBTQ community. And Kathy Reynolds was the catalyst that brought that legislation forward.'",
        "'speaker_6': 'Her staff person, Judy Gold, worked very hard with the community to get that legislation passed. As you know, it was challenged all the way to the U.S. Supreme Court, and we prevailed. And so I just think it's important to always, you know, remember some of the folks that did the heavy lifting on what has been duplicated and'",
        "'speaker_6': 'replicated across the country, where folks recognize the importance of honoring the contributions of everyone. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega, Councilor Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. Thank you for bringing this proclamation forward. I think it's a very powerful statement from the council. It's a statement of solidarity and which I am proud to stand in solidarity with the community. I think it's super important that we not only passes, but we communicate this in a way so that other cities may'",
        "'speaker_7': 'aspire to do the same thing in not just in Colorado, but around the country. I think Denver is a very important regional city. And people people follow our lead when it comes to stuff like this. They're just waiting on some cities to take the first step.'",
        "'speaker_7': 'You know, we're not the first step, but I think we're an important step. And with this proclamation moving forward, I think, you know, councilman can use this. This is a very strong moment for us. But also, I think I can only think of one word when I think of this struggle and that self-determination and the right to'",
        "'speaker_7': 'self-determination. Right. There's no human being in this world that should be stripped of that right, of human, of of self-determination, let alone in this country, where we have a constitution that enhances that empowers us self-determination. So here's to that solidarity.'",
        "'speaker_7': 'Thank you, Councilman Kenny, for the proclamation.'",
        "'speaker_1': 'All right. Thank you, Councilman Lopez. Thank you, Councilwoman Canete. Let the church say amen. Madam Secretary, roll call. Say louder.'",
        "'speaker_4': 'Can each.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Lopez I knew.'",
        "'speaker_6': 'Ortega Hey, man.'",
        "'speaker_4': 'Sussman.'",
        "'speaker_2': 'Sussman My black eye.'",
        "'speaker_4': 'Clark Hi. Espinosa.'",
        "'speaker_1': 'Flynn, I.'",
        "'speaker_4': 'Gillmor. Herndon. Cashman.'",
        "'speaker_8': 'Hi.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'Hey, man. Please close the voting. Announce the results. 3913 Eyes Proclamation 1287 has been adopted. Councilman, can each. Is there anyone you want to bring up?'",
        "'speaker_3': 'Yes, Mr. President. The Gender Identity Center of Colorado is going to represent all of the organizations being honored. Is Jesse here or Karen and Julie, do you want to go up?'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'Please. Right to the microphone there. Thank you.'",
        "'speaker_7': 'Thank you council members.'",
        "'speaker_8': 'For the proclamation. Hmm. You know, there's nothing that the transgender community needs more than support from everyone else. If it's the one thing that we lack, we are center can take care of helping people.'",
        "'speaker_7': 'We can give counseling.'",
        "'speaker_8': 'We have support groups. But what we don't.'",
        "'speaker_7': 'Have sometimes is.'",
        "'speaker_8': 'Support of other people in the community. And if there's anything that's really important, that's it. And so this proclamation.'",
        "'speaker_7': 'While it may not seem like a lot.'",
        "'speaker_1': 'Means a real lot to us.'",
        "'speaker_2': 'And if from my.'",
        "'speaker_8': 'Hand because it helps raise the poker public awareness of the violence and discrimination that our community.'",
        "'speaker_1': 'Experiences pretty much every hour of every day, not just here, but also across the world. So thank you so much for.'",
        "'speaker_8': 'Helping us do that. And I also want to mention, and I think you did mention that we're having.'",
        "'speaker_0': 'The Transgender Day of Remembrance at.'",
        "'speaker_7': 'East High School at 630 on Monday the 20th.'",
        "'speaker_3': 'And can you share who the keynote speaker is?'",
        "'speaker_8': 'The keynote speaker is going to be Leyla Ireland. And for those of you who may not know who she is, she's a veteran. That's a trans woman. Her husband is a serving veteran that is a trans masculine person.'",
        "'speaker_8': 'So he's in jeopardy of losing his job. And they're doing a lot to fight for that.'"
    ],
    "Proclamation for National Hunger and Homeless Awareness Week.": [
        "'speaker_1': 'Thank you. We got your back. All right. Great. Thank you. Excellent. Thank you, Councilwoman. All right, we're on to the second proclamation. I'm going to have Councilman Ortega please read Proclamation 1290.'",
        "'speaker_6': 'I will be happy to. Proclamation number 1290 Series of 2017 in recognition of 2017 National Hunger and Homeless Awareness Week in Denver, the Denver metro area. Whereas everyone has a right to healthy food and a safe place to live.'",
        "'speaker_6': 'And. Whereas, everyone of any age, background or zip code can be affected by hunger and homelessness. And. Whereas, according to the Colorado Children's Campaign, nearly one in six. Let me say that again. One in six Colorado kids face hunger every day.'",
        "'speaker_6': 'They may receive their only meal at school. And. WHEREAS, thousands of people in Denver work hard to secure a better future but must choose between paying rent, buying needed medications and purchasing groceries. And. WHEREAS, systemic issues of hunger and homelessness have a wide ranging and harmful impact on individuals and on our community.'",
        "'speaker_6': 'And. Whereas, lack of sufficient healthy food stunts, brain development and physical growth diminishes motivation and productivity, hinders education and deteriorates one's health. And. Whereas, support programs for people without enough money for food and housing help build a foundation for a better, healthier lives and a better, healthier Denver.'",
        "'speaker_6': 'Whereas, government agencies, along with food pantries, shelters, faith based groups and other community based organizations strive to address the needs in our community. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one Hunger and Homeless Awareness Awareness Week is intended to educate the public, raise awareness about poverty in our community'",
        "'speaker_6': ', and encourage people to get involved in anti-poverty organizations. In Section two, we recognize that many community organizations do impactful work to fight hunger and poverty, organize volunteers, and provide much needed food and services that lift our entire community, including hunger free.'",
        "'speaker_6': 'Colorado Metro Kerry. Bienvenidos Denver. Inner City Paris. Sid de la Raza Community Ministry and local organized local school organized effort such as Teller Backpack Friends, among many others. Section three November 13 through 19 is declared as Hunger and Homeless Awareness Week, and you are urged to donate to these organizations mentioned or a local food bank in your'",
        "'speaker_6': 'community or the food bank of the Rockies. Section four that the clerk of the city and county of Denver affix the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to hunger free Colorado metro carrying then beneath those Denver inner city Paris said vicious de la, a community ministry and'",
        "'speaker_6': 'teller backpack friends.'",
        "'speaker_1': 'Thank you, Councilman. Your motion to adopt.'",
        "'speaker_6': 'Mr. President, I move for the adoption of proclamation number 1290.'",
        "'speaker_1': 'It has been moved and seconded. It comes by the council. Councilman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. You know, we're fortunate that Denver is a city that has many organizations who who step forward and come to the aid of folks in our community who are struggling. I'm aware of many, many different churches and both nonprofit and for profit organizations that that step up and in provide food to people in our'",
        "'speaker_6': 'community. It's not unusual to see in the park across the street different organizations who come down and provide a meal to people who are in the park, many of whom are homeless or we have. And in many cases, they're both nonprofit and for profit organizations.'",
        "'speaker_6': 'We have a group that serves one meal a month over at Saint Elizabeth's Church, on the area campus that provides a hot meal. And I'm sure there are different organizations there every Sunday after mass providing a meal to two folks in our community when some of our day shelters are closed during the weekends.'",
        "'speaker_6': 'So oftentimes they provide a meal. But when they're closed, you know, that's a day when people otherwise wouldn't be getting food. And so the fact that we have organizations that. Gather their friends and other volunteers to prepare the meals and to bring them down and to to serve them and to not just provide the meal, but to'",
        "'speaker_6': 'to to be a kind face on the other end. Because oftentimes we find that many of our homeless folks feel so isolated. But to learn that we have so many families also in our community that are struggling. And when you see the cranes across our metro area, including our downtown and in all the development and construction, you'",
        "'speaker_6': 'would think that we wouldn't have this kind of poverty and challenge in our community. But it does exist. And this is the time of year when people. You know, open up their hearts and their pocketbooks and they're committed to trying to help their fellow neighbor, their fellow man that that has found themselves in a situation of of'",
        "'speaker_6': 'need. And there's nothing worse than just going hungry and not having access to food. So I want to first say thank you to all of the organizations in the city of Denver that that do this day in and day out or shelters do this day in and day out.'",
        "'speaker_6': 'So I just want to encourage the adoption by my colleagues, and I want to thank Joe Wood for my staff who helped put the proclamation together. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Ortega. And thank you for bringing this forward. See no other comments, Madam Secretary.'",
        "'speaker_4': 'Raquel Ortega. I SUSSMAN High Black. Clark High. Espinosa High. Flynn, I Gilmore. Herndon, I Cashman High Kennedy I Lopez. I knew Mr. President.'",
        "'speaker_1': 'I Please close the voting and announce the results. We have somebody hanging fire. All right, please close voting in us. Results 3913 I Proclamation 1290 has been adopted. Councilwoman, is there anyone you want to bring in there?'",
        "'speaker_6': 'I have a couple of folks, so I'd like to ask Vicky O'Neil, who's the senior vice president with Hunger-Free, Colorado. She'll be introducing Andrea Fuller. And then we have Vincent Marnell with the Teller Backpack Friends, Joyce Neufeld with community ministry and Linda Jamison with Denver Inner City Parish, who will be speaking.'",
        "'speaker_2': 'Go ahead. Thank you, Councilwoman Ortega, and thank you to Joe Wood for coordinating our presence here. And thank you to the entire council for the proclamation. It takes public private partnerships to successfully address a problem in our community like hunger.'",
        "'speaker_2': 'And we've been very fortunate to enjoy very robust and meaningful partnerships with organizations like Denver Human Services. And I want to shout out to their leaders Don Morris and Todd Jorgensen, for their support over the years in tackling this issue and also the many nonprofit organizations, food banks, food pantries in the city who are doing this work'",
        "'speaker_2': '. Like you said, every day we are actually seeing the impacts of these partnerships. When Hunger Free Colorado started in 2009, Colorado had the fastest growing child poverty rate in the United States. And at that same time, our children had the lowest participation rate in the federal food nutrition programs.'",
        "'speaker_2': 'And so, for example, we were 44th in the nation for school breakfast participation and today were 12th. Back then, in 2009, one in six of the general Colorado population were experiencing hunger. Today, that's one in ten. And as you mentioned, today, we're one in six children experiencing hunger.'",
        "'speaker_2': 'In 2015, that number was one in five. So you can see that we're we're moving the needle, but we still have quite a bit of work left to do. And in order to do that, we need the public and private sectors to come together collaboratively to work on solving this very solvable issue.'",
        "'speaker_2': 'Tonight we have Andrea Fuller here to talk for a moment about her experience with this issue. Thank you. Good evening, Council. Thank you, Councilwoman Ortega, for putting this proclamation in order. I want to ask a couple of questions.'",
        "'speaker_6': 'How many of you have ever had to go hungry or.'",
        "'speaker_2': 'Missed a meal, but not by choice? What would you do if you did not know how you were going to feed your family? This is the reality for thousands of mothers, children, fathers and others in metro Denver. Food, health and housing are inextricably linked together.'",
        "'speaker_2': 'And I know this from experience. I am a mom.'",
        "'speaker_6': 'Owner of three small businesses, an entrepreneur.'",
        "'speaker_2': 'I have completed two college degrees. I work from 7 a.m. to almost midnight most days and work 6 to 7 days per week. And yet rent.'",
        "'speaker_6': 'Is over 50%.'",
        "'speaker_2': 'Of my income. And without snap, I would not be able to buy.'",
        "'speaker_6': 'The food that.'",
        "'speaker_2': 'All of my family needs to stay healthy and to continue working. I have had to skip meals or eat less. I have.'",
        "'speaker_3': 'Experienced illness due to not.'",
        "'speaker_2': 'Eating enough. There's absolutely no reason that anyone in this great state or city should go hungry. It is thanks to organizations such as Hunger Free Colorado and many others that were mentioned, including Metro Caring. And the opportunity to advocate through them that I am here in front of you today.'",
        "'speaker_2': 'This proclamation is a start, but there's so much more that we need to do. Affordable housing must be built and more prominently intentionally placed throughout the city. Laws and policies promoting less food waste and more readily accessible.'",
        "'speaker_6': 'Resources.'",
        "'speaker_2': 'In areas used most, such as Montebello, Globeville and North Park Hill, providing preventative health care. All of these needs are within reach if we work together as policymakers, advocates.'",
        "'speaker_6': 'Businesses, nonprofits and the community. Thank you for listening. And let's put words.'",
        "'speaker_2': 'And proclamation into real action. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_6': 'Is Vincent here? Vincent Munnell with the Tiller Backpack program.'",
        "'speaker_7': 'I can't echo her sentiments enough. Thank you very much for seeing me. This was a very kind surprise with the tell it back to our program. If anybody here knows the Teller Elementary, we're in Congress Park. We have a pretty simple goal.'",
        "'speaker_7': 'We have a lot of kids that come to school for food. Kids shouldn't have to go to elementary school for food. They should want to learn. They just want to play. They should want to be kids. They should want to be led and mentored.'",
        "'speaker_7': 'They shouldn't in a community such as ours that was built on giving. It was built on taking care of one another that come together for any number of reasons. They're always there with with an open hand. Yeah. We have kids who walk to school past my very house.'",
        "'speaker_7': 'The Just want a bite to eat. So we we recognize the need about three years ago. Unfortunately, every year the need has grown. We went from helping five families to seven families, and now we're up to about 34.'",
        "'speaker_7': 'It's it's a very, very unfortunate circumstance when you live in a community that's surrounded by. For sale signs for homes that are, you know, seven or $800,000. And we have we have families that can't put food on the table for for young minds.'",
        "'speaker_7': 'So this is definitely a step in the right direction. The Tell Her Backpack program is it's a lofty goal to help end childhood hunger. But with, you know, with steps like this and with with groups like the Tell It Backpack Program and every other group, it's it's definitely achievable goal.'",
        "'speaker_7': 'Thank you very much. Thank you.'",
        "'speaker_6': 'Thank you. And then we have one last speaker. Excuse me. I think we have two more Joyce Neufeld and then Linda Jemison.'",
        "'speaker_2': 'Well, thank you for allowing us to be here tonight and for also this proclamation. My agency, Community Ministry of Southwest Denver, serves about 35,000 individuals a year, and that's just a drop in the bucket in southwest Denver. So making people aware of hunger and homelessness is really important.'",
        "'speaker_2': 'And Andrea is an example of who we see the most of. It's the working poor. It's not necessarily a lot of homeless people, but it's the working poor people who struggle on a daily basis to put food on their tables.'",
        "'speaker_2': 'During the past two years, about six major food pantries have closed. Denver Urban Matters was one of the most recent that closed and that impacted the whole Colfax corridor there. They're moving their work to Saint Francis Center, but that's becoming more and more common that the smaller pantries are closing.'",
        "'speaker_2': 'Even the bigger pantries are closing due to lack of funding. So although we're aware of hunger and homelessness this week and especially during Thanksgiving holidays, we see a lot of people suddenly increase their awareness. It's all year round.'",
        "'speaker_2': 'The people are hungry. And so I'd ask that, you know, every day is Hunger and Homeless Awareness Week, and that every day we can have an impact on the lives of the kids. And organizations like Hunger Free Colorado are making a huge, huge impact, as well as all the other agencies that impact in so many different ways'",
        "'speaker_2': 'the garden, the food rescues. So many agencies are working together to make a difference in this community. So don't forget us all the rest of the year, not just at this time. Thank you.'",
        "'speaker_6': 'Thank you for that important reminder. Linda Jamison, are you here? Okay. Come on forward, Larry. And then, Mr. President, Rudy Gonzales from Sid Vicious would like to make a few comments as well.'",
        "'speaker_7': 'Good evening. My name's Larry Martinez with Denver, inner city Paris. I'd like to say thank you to Councilwoman Ortega as well as the rest of city council for this proclamation and helping raise awareness. This is a very important issue and one that is solvable.'",
        "'speaker_7': 'You know, we live in a state where one out of nine people in Colorado struggle with hunger. I echo a lot of what was already said here tonight. The work that these organizations are doing is is very important.'",
        "'speaker_7': 'Inner city parish, we're distributing over 35,000 of food every month and we're serving 1100 and duplicated individuals every month. And that number continues to grow and grow. And here, you know, at the same time, we're having organizations close and resources are getting more scarce.'",
        "'speaker_7': 'So like Joy said, you know, remember us throughout the year and Colorado gives us also coming up and remember us then. Thank you.'",
        "'speaker_6': 'Thank you. Rudy, are you going to be the one speaking? Okay. If you can come forward. This is Rudy Gonzalez with Sid Vicious. La Raza.'",
        "'speaker_7': 'Yes. Thank you, Councilwoman Ortega. Thank you. Council. City Council. With me is Neva martinez, Ortega, who's our director of our emergency services program for Servicios de la Raza. We're a probably the largest one stop culturally responsive, linguistically specific provider in the state now providing multiple human services.'",
        "'speaker_7': 'And one of our turnkey programs is emergency services, which we have been providing our communities now for probably over 35 years. And we're a 45 year old agency fiscal year. We served over 170,000 of food to 15 to 16000 people.'",
        "'speaker_7': 'And that's infants, that's children, adolescents, disabled veterans, homeless, foster care. Every population you can think of, we have served we serve our elderly. We work with them on a lot of different levels to try to keep them sustainable and in their home hygiene.'",
        "'speaker_7': 'In-Home. So. We want to thank you for this proclamation, Councilwoman, and thank you for all of your votes. It is important we are serving those in crisis, the vulnerable, trying to get them to a safe level, a table level, and get them to thriving.'",
        "'speaker_7': 'And so I just want to introduce Neva martinez, Ortega, who has a little challenge for a city council.'",
        "'speaker_2': 'Thank you, really. And thank you again, Councilman Ortega. As Rudy mentioned, we always struggle with funding in these programs. And currently our basic emergency services program, Food Pantry, is completely unfunded. But we are still working with our community partners and relying on our community to still make our holiday season and our everyday food bank happen.'",
        "'speaker_2': 'So I brought you all a little gift in bringing up this proclamation of a reusable grocery bag with our information, but also an opportunity to participate in our holiday events where we'll be providing 900 food boxes to the community.'",
        "'speaker_2': 'So I don't know who to give this to to give to you all. Thank you. But but with that is an opportunity to to help our organization and helping our community provide those food boxes.'",
        "'speaker_1': 'Thank you and thank you, Councilwoman Ortega. Right. Councilwoman Black Last Proclamation, 1291, please.'"
    ],
    "Contract Approval for Architectural and Engineering Design Services for Concourse Expansion at Denver International Airport.": [
        "'speaker_1': 'Under. Yes. And Councilman Gilmore has also called out Resolution 1219 for a vote. Is that all correct, everyone? Okay, great. Under bills for introduction, we have nothing called out. Under bills for final consideration. We have nothing called out and under pending.'",
        "'speaker_1': 'We have nothing caught out. Madam Secretary, please put your 16, 17, 18 on the screen. Councilman Espinosa. Why don't you put the 16, 17, 18 on the floor? Okay. I move that resolutions 12, 16, 12, 17 and 1218 be adopted in a block.'",
        "'speaker_1': 'Right. It has been moved and seconded. Councilmember as a council councilman. ESPINOSA Actually, originally, I just was going to call it out to explain why I was going to abstain. But I do now have a couple of questions if the airport is here.'",
        "'speaker_1': 'Yep, I think we have a representative from the airport here. Not that representative, but there you go back there. Aaron Barraza and Aaron. Sorry to do this to you, but I did get a very thorough reply from an email from the airport.'",
        "'speaker_1': 'And of course, that just tickles my my brain on these matters. So the. This is going to be a cost savings. I mean, it'll come at risk. All the contracts are come at risk, correct?'",
        "'speaker_7': 'Sure. Yes.'",
        "'speaker_1': 'What mean? How much of the fee is the at risk fee?'",
        "'speaker_7': 'Answer. Good question. I'm going to bring up our senior vice president of airport infrastructure management. Mark Baker. He knows this stuff in more detail than I will.'",
        "'speaker_1': 'Know, colleagues, if this came up in committee. I apologize. I won't go very long into this.'",
        "'speaker_8': 'Good evening, Councilmembers and Councilman Espinosa. Thank you for that question. We have worked very diligently with all our contract partners in preparation for this resolution and all of agreed to take a 3% as a part of the work out at the airport to assist us in delivering the gates that are so badly needed by the airlines.'",
        "'speaker_1': 'I assume that the contracts have the normal costs, the contract, the seating law. That's what's confusing me. And the normal cost savings, not just the at risk component, but the normal cost savings. If the construction sort of comes in early and below budget, below the GMP, I should say.'",
        "'speaker_1': 'Sure. The normal cost savings structures are there that we would normally see in a GMP contract. Is that correct?'",
        "'speaker_8': 'That's correct.'",
        "'speaker_1': 'So in in this arrangement, does the CRM or the GC or do both share in the cost savings?'",
        "'speaker_8': 'Let me yeah. Let me turn to our director or senior director for infrastructure. And he's been working the intimate details. He'd be able to kind of address that more thoroughly. Mr. Adam.'",
        "'speaker_1': 'Thank you for bringing Evan. I'm glad I'm asking, because then you guys were just sitting there in vain.'",
        "'speaker_8': 'I'm Mark Adams, the senior director of development at the airport. And so in the construction manager's contracts, we have.'",
        "'speaker_7': 'A contingency.'",
        "'speaker_8': 'Built in for them to use. At the end of that project, that's an 8020 split. 80% of that comes back to the airport, 20% goes to the contractors. The rest of the contingencies and other costs that are built into the overall program all go back to the airport.'",
        "'speaker_7': 'If it doesn't get spent.'",
        "'speaker_1': 'The contingencies but so the at risk fee is is preserve to always correct but the actual contingencies are split this way or 100% to the airport. But you said the contractors is that so that 20% is that just to the GC or the CRM?'",
        "'speaker_8': 'So the CRM is the GC is correct.'",
        "'speaker_1': 'Great. Because the reason why I'm asking is if we're on time and below budget or early and below budget, that does not happen by accident. But it's not also just a glorious CRM that made that happen. There are a lot of subs involved.'",
        "'speaker_1': 'Is there some sort of cost sharing structure that I should know about related to the subs that are working on these projects?'",
        "'speaker_8': 'We don't because our relationship is just with the CMG C, we don't have a look into those relationships, so I don't have an answer.'",
        "'speaker_1': 'I did want to bring this up just more sort of mindful to my colleague Wayne New, who's working on other sort of contracts, measures related more towards those subs, less towards the primes and the people on top that we deal with directly.'",
        "'speaker_1': 'So thank you very much. All right. So my rest is just comments. So I, I, I'm a I really just called this out so I could abstain mostly because I wasn't quite I didn't get myself up to speed on the inventive ideas that were brought by by this these groups on these contracts to adequately wrap my head'",
        "'speaker_1': 'around the request, as you can see, I'm sort of asking sort of normal, fundamental questions for me at this late hour. So I'm just going to be abstaining. Thanks, colleagues. Okay. Councilor Flynn, you still want it?'",
        "'speaker_9': 'Yes, sir. Got. Thank you, Mr. President.'",
        "'speaker_1': 'Do you see that I rhyme there? I don't know if you saw that.'",
        "'speaker_9': 'No. Sorry, sir. Thank you. I this is the first contract I've seen come through here and as well in my experience covering large infrastructure projects to use this delivery method. And so I was skeptical at first and I wanted to thank the airport staff for providing great additional detail on how the procurement went down, because you don't'",
        "'speaker_9': 'like to be the first to try something here in this market because there's always a risk. But I was very much persuaded by the information that through Aaron was was provided to me. And I look forward to keeping an eye on this project as it moves forward and adds these much needed gates to the airport in and'",
        "'speaker_9': 'particularly in seeing how this this delivery method works and whether it might be applicable to other projects, maybe as the bond comes forward. So thank you very much, Mr. President. That's all.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Councilman Ortega.'",
        "'speaker_6': 'Thank you, Aaron. I'm going to follow up with a question that I raised earlier. I think it's important to know who the subs are and what the percentage that each of those subs will be getting on both of these two contracts.'",
        "'speaker_6': 'Can you share that with us?'",
        "'speaker_7': 'Sure. So first, I can let you know that the Division of Small Business Opportunity assigned a 24% goal to each of the construction contracts and 18% going to each of the design contracts. The right now, since the gate, the gates aren't designed yet.'",
        "'speaker_7': 'There are no. Maybe we be commitments just yet. Construction on the construction projects with any companies in particular. Once we get a little bit further down the road, then that's when those companies will be coming into play. But the SBA has approved the compliance plan that the contractors have submitted.'",
        "'speaker_6': 'But we do have some that have been selected, right?'",
        "'speaker_7': 'Yes. So once again, I'll call Mark Big or Mark Adams.'",
        "'speaker_6': 'So I just think it's helpful to know I mean, I asked this question often on many of our contracts. I like to know what the goals commitment are that we're setting for the the minority and women businesses that are in our community that try to take advantage of work just like many of our primes do with with'",
        "'speaker_6': 'these big projects that the city is doing. So can you share that with us?'",
        "'speaker_8': 'Absolutely. So, you know, we're happy with both of the CMG C firms in that they both did joint ventures with with, you know, from larger firms that have these experiences to local firms. I mean, turners with flat irons holders with FCA, the Turner Flat Irons team also has an associate partner to it with Gilmore Construction.'",
        "'speaker_8': 'I believe that's the only commitment that's been made. They helped in the process of putting together the response to the RFP or excuse me, to the RFQ, and they were part of the team during the selection process. I believe that's the only commitment.'",
        "'speaker_6': 'And that's just on the Turner contract. What about on the Holder?'",
        "'speaker_1': 'They are.'",
        "'speaker_8': 'Correct. They do not have any commitments at this point. Again, because we haven't designed anything. We haven't built out anything. They don't have any commitments.'",
        "'speaker_6': 'So the 24, 24% on each will come once the design is finished and you get ready to move forward with the the actual construction. So one of the things I think would be important because once we approve this, you know, we won't know who those folks are.'",
        "'speaker_6': 'So I think having an update brought back to committee would be important so that we know who the local firms are. They get to benefit from this work.'",
        "'speaker_8': 'Absolutely. I believe we're committed to doing a quarterly update on this program as it goes for the next three years. So we'll definitely do that.'",
        "'speaker_6': 'Great. Thank you.'",
        "'speaker_1': 'All right. Thank you, Councilman Ortega. We're going to put all three of these on. Madam Secretary, they are on 16, 17, 18. It's already been moved to the second it roll call. Please. Espinosa abstain. Flynn I.'",
        "'speaker_4': 'Gilmore, I. Herndon Cashman can. Lopez. I knew. Ortega I. Susman. Lark. Clark. I. Mr. President.'",
        "'speaker_1': 'I please I was wondering as the results.'",
        "'speaker_4': 'To advise one abstention.'"
    ],
    "Contract Approval for Concourse Gate Expansion Project at Denver International Airport.": [
        "'speaker_1': '12 eyes one abstention. Resolution 1617 eight 1216 2017 1218 have been adopted. All right. We're going on to 1219. Will you please put that up, Madam Secretary? Councilman Espinosa, will you put Resolution 1219 on the floor for adoption?'",
        "'speaker_1': 'I move the resolution to 19th May 1219 be adopted. Then I say, do not. No, I said, okay. All right. We got each other's back here. All right, it is. Adobe has been moved and seconded. Councilman Gilmore.'",
        "'speaker_2': 'Thank you, President Brooks. I will be abstaining from voting on 1219 due to my brother in law's construction company having an interest in this project. Thank you, President Brooks.'",
        "'speaker_1': 'That's right. Thank you, Councilwoman Gilmore and Councilman Espinosa, you. I have now a question. And it's mostly because of that last response and this abstention. I sort of don't. It makes me sad, uncomfortable that the response is that, you know, you only had the one maybe be and it's related to this abstention.'",
        "'speaker_1': 'That said, these are joint ventures. So was wasn't there a partner I mean, when was the joint venture created prior to the selection? And in this or after the selection of this, maybe.'",
        "'speaker_8': 'We could control. So, again, Mark Baker, senior vice president of the airport for Infrastructure, those joint ventures were determined prior to the selection of the teams. They were a part of the teams as they competed for eventual selection.'",
        "'speaker_8': 'And I'd also like to mention, you know, all four are represented here this evening, have come to show their support for what we're doing at the airport. They view the goals that we have set as a floor, not as a ceiling, that this is an opportunity to grow capacity for the community of Denver.'",
        "'speaker_8': 'They're committed to doing that. They have shared with members their commitment to development and intern programs and helping us not only at Denver to do the work we need to do, but to leave us with a vast resource across the community of Denver and within Colorado to draw upon on future opportunities.'",
        "'speaker_8': 'So we see this as a great partnership with people that are committed to not only meeting, but exceeding those goals as we work toward all of the opportunity that this provides for the community of Denver in the state of Colorado.'",
        "'speaker_1': 'Okay. Yeah. So my concern is more from my colleague, you know, if if you know, there is no conflict of interest, but to avoid even the appearance of perception, you know, the the the obsession is is a is a is a rational move.'",
        "'speaker_1': 'Might want to get a more broad opinion on on the joint venture component as well going forward. I would you. Yeah. Just airing that out there. Okay. It has been moved and seconded. 1219 is on the floor. Madam Secretary, Roll Call.'",
        "'speaker_4': 'Gilmore. Epstein. Herndon. Catherine Kennedy. Lopez. I knew Ortega. I. Susman.'",
        "'speaker_2': 'I black eye.'",
        "'speaker_4': 'Clark. All right. Espinosa.'",
        "'speaker_1': 'Abstain.'",
        "'speaker_4': 'Flynn, I Mr. President, I please.'",
        "'speaker_1': 'I was wondering about the results.'",
        "'speaker_4': '11 I two abstentions.'",
        "'speaker_1': '11 I two abstention. 1219 has been adopted. This concludes the rest of items that needs to be called out. All other bills for introduction are ordered published, were now ready for the block vote on resolutions of bills for final consideration.'",
        "'speaker_1': 'Council members remember this is a consent or block vote. You will need to vote I. Otherwise, this is your last chance to call out an item on a separate vote. Councilman. Councilman Espinosa, will you put the resolutions for adoption and bills for final consideration for final passage on the floor?'",
        "'speaker_1': 'All right, I move that resolutions be adopted in bills on final consideration, to be placed upon final consideration and do pass in the block for the following items. All Series 17 1172 1181, 1183, 12, 15, 12, 2711 82 1028 1120.'",
        "'speaker_1': '1282 1283 1177. 1143 1173 02i get there and. 1243. Thank you. Not 1143. 11 7709. 1164. And that is it. And I should be I should clarify. Seven or nine was 0709. Thank you. All right. Madam Secretary, how you feel about that?'",
        "'speaker_4': 'Good. That was good.'",
        "'speaker_1': 'Okay. If it's good with you, it's good with us. LAWYER How do you feel? Don't you start? Okay. I think we got it. All good. All right, it's been. Was it? Madam Secretary?'",
        "'speaker_2': 'Raquel Black.'",
        "'speaker_4': 'I Clark. Espinosa. Flynn, I Gilmore. Herndon Cashman. Kenny Lopez. I knew Ortega I.'",
        "'speaker_2': 'Sesan I.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'I. Please close the voting. And that's the results.'",
        "'speaker_4': '13 eyes.'",
        "'speaker_1': '13 Eyes. The resolutions have been adopted and bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing council bill 1022 Change the zoning classification of 20,000 2001 to 25 East 18th Avenue in City Park West.'"
    ],
    "Rezoning of Property at 2001-2005 East 18th Avenue in City Park West.": [
        "'speaker_1': 'Speakers must stay on the topic of the hearing. They must direct their comments to council members. They must refrain from obscene speech and direct your comments to the Council as a whole. And please, no personal attacks. Councilman Espinosa, will you put Council Bill 1022 on the floor?'",
        "'speaker_1': '1022. A move that council bill 1020 to be placed upon final consideration and do pass. All right it's been moved and second it. The public hearing for counsel bill 1022 is open. May we have the staff report the results at all.'",
        "'speaker_6': 'Good evening, Theresa and Sarah with community planning and development. This is a map amendment for property at 2001 through 25 East 18th Avenue. It is located in City Council District nine in the City Park West neighborhood. And at the nine five.'",
        "'speaker_1': 'No, I'm just.'",
        "'speaker_6': 'I'm sorry.'",
        "'speaker_1': 'Did I just. I messed up. Keep going.'",
        "'speaker_6': 'All right. At the northeast corner of 18th Avenue and Ray Street, a block southeast of the Presbyterian St Luke's Medical Center, and four blocks east of Saint Joseph's Hospital, three blocks west of City Park. Property is 6250 square feet.'",
        "'speaker_6': 'It is a vacant duplex structure that is being renovated. A property owner is just modernizing the commercial uses allowed on the property to be in line with the adjacent properties. Again, the request is to rezone from a chapter 59 pad number 107 to General Urban Multi-unit.'",
        "'speaker_6': 'I'm sorry, mixed use three stories. So it is in the general urban neighborhood. That's right to my notes characterized by single unit two unit multi-unit residential with a in a variety of building forms, low scale commercial embedded in residential areas.'",
        "'speaker_6': 'So. Sort of your typical old Denver neighborhood. Existing context. Again, the zoning is that Chapter 59 PD. There is a view plane from City Park and the Natural History Museum that governs that governs the height on the property.'",
        "'speaker_6': 'And the allowed height is 73 feet. The property again is a vacant duplex that's being renovated. So the number 107 was adopted in 1985. It allows the old chapter 59 are for land uses, and that was their residential office that had some limited retail.'",
        "'speaker_6': 'And so north of the property is a general urban residential office. Three story east, north and south east is the x three, same as the proposed, and then west is a medical office building that's zoned campus h two, which is among the campus zone districts, is a transitional zone district.'",
        "'speaker_6': 'So again, sublet properties vacant adjacent uses. Multi-family commercial civic with the hospitals, a very healthy mix of uses in this area, the property you can sort of see behind the trees. But I just wanted to give you an idea of the height of the surrounding structures and kind of the variety of uses in the area, the property'",
        "'speaker_6': 'itself. You can see at the top of this slide, I'm on slide 11, just let's see, I can get my directions mixed up behind the property. Is the buildings on the upper right directly adjacent to the properties on 18th Avenue is the picture on the bottom.'",
        "'speaker_6': 'Right across 18th Avenue is the multi-unit condominium building and then a medical building across directly across race street on the upper left, all about well up to three stories or more. So informational notice on this went out in July, a notice of a complete application planning board hearing on September 6th, and the board unanimously voted to recommend'",
        "'speaker_6': 'approval of this. There was one person who testified who was the neighbor adjacent behind who really was there just to find out information about the rezoning. And then this was at the Land Use Committee on October 3rd and passed through committee.'",
        "'speaker_6': 'So we're here tonight for the public hearing. There are a number of registered neighborhood organizations in the area, but today we have no public comment on this application. So the plans that apply are Plan 2000, Blueprint Denver and a 1986 Uptown Neighborhood Plan, which I have to state was a very pleasant plan to work with.'",
        "'speaker_6': 'Its its recommendations seem to still hold up. So plan to 2000 tells us to encourage quality infill development to promote mixed use development, to encourage positive change and diversity while protecting our traditional character of our neighborhoods. To identify areas where increased density and new uses are desirable and can be accommodated, and to support retention of our businesses'",
        "'speaker_6': 'in the city. Blueprint Denver The land use concept is single family residential. Those are areas which are predominantly residential but which do have a smaller employment base generally embedded in the neighborhoods. And it is in an area of stability where of course we want to preserve our neighborhood character but also allow some reinvestment in our neighborhoods.'",
        "'speaker_6': 'Future Street classification for East 18th Avenue is a mixed use arterial. These are the types of streets that have a high degree of mobility, and a mixed use are generally located in our higher intensity mixed use areas, commercial areas and mixed well commercial and residential areas.'",
        "'speaker_6': 'Ray Street is an undesignated local street. The property is also within the quarter mile buffer of an enhanced transit corridor, which is York Street. And so those are areas where we want to have supportive land uses and policies for to support transit.'",
        "'speaker_6': 'The Uptown Neighborhood Plan, like I said, was adopted in 1986. It that plan vision is for an urban village to have distinct districts that are distinct in their building densities and mixture of land uses that is distinct from downtown, that is livable and economically vital.'",
        "'speaker_6': 'General plan recommendations are to reinforce the distinct districts in the area, to reinforce the distinctions between the districts, to encourage mixed use projects and to encourage housing. The district that the plan that this property is in is in the City Park West District.'",
        "'speaker_6': 'On the district map in the plan, those recommendations are to encourage housing, to encourage compatibility between new development and the existing residential and the well residential character of the District 4/18 Avenue to improve the pedestrian character and have hospital support and destination retail on East 18th Avenue and then retail recommendations to concentrate the retail uses on the'",
        "'speaker_6': 'east west streets particularly. Well, 18th Avenue was specifically named there and that the retail uses should be concentrated around. Some of the present retail development. So with that, staff believes that this application is conforming to our plans, that we are furthering the uniformity of district regulations by.'",
        "'speaker_6': 'Using our standard zone districts versus our custom zone districts, and that we're furthering the public health, health, safety and welfare by allowing this reinvestment in the property, by implementing our plans. Justifying circumstances are changed conditions. There are a number of new developments in the area, starting with the hospital redevelopment and a lot of new townhomes and condos'",
        "'speaker_6': 'in the area. So staff believes this is an appropriate changed conditions. And we did talk a little bit about the character of the general urban neighborhood context, multi-unit, single unit, residential in a variety of building forms, low scale commercial embedded within the residential areas, residential uses along local streets, but some commercial located along mixed use arterials such'",
        "'speaker_6': 'as 18th Avenue and then the Jim X three specific intent to promote safe, active pedestrian areas and to enhance the convenience and enjoyment of transit, walking and shopping and. That's about it. So with that, staff recommends approval.'",
        "'speaker_1': 'All right. Thank you, Mr. Sarah. We have two speakers this evening. We when I call your name, just come to the front bitch and I will start now. Adrian Weatherby and Alison Altair is. Out there is this study.'",
        "'speaker_1': 'Come sit down here. Mr. Wetherbee, your first 3 minutes.'",
        "'speaker_9': 'Thank you. First of all, for your public service. Thank you for supporting all of the issues that the first time bore witness to this evening. I was impressed. And I owe you that, I think. Thank you. My name is Adrian Weatherby.'",
        "'speaker_9': 'I work for a small architectural firm in northwest Denver. Our address is 3628 West 32nd Avenue. I am here representing this rezoning application. I wanted to thank Teresa as well. And Eugene, thank you for your work. The Planning Commission and the city staff again for the work on this application.'",
        "'speaker_9': 'As Teresa mentioned, the purpose of the application was remove restrictive code and allow a more modern set of commercial uses on the property. The property owner does not have any current plans to demolish the existing structure. The current plan is to renovate the first four units for commercial use and a second floor for apartments.'",
        "'speaker_9': 'We're looking forward to rehabbing the existing building, getting tenants in and making it a contributing member of the neighborhood. In terms of community outreach. We met with Capitol Hill United Neighbors several months back and took comments from them.'",
        "'speaker_9': 'We've reached out several times since then, and our understanding is that the neighborhood organizations are relatively neutral on this application. I'm happy for myself and our attorney, Allison L Terrace, to answer any questions the council members may have otherwise.'",
        "'speaker_9': 'We respectfully request your approval of this application.'",
        "'speaker_1': 'Miss others.'",
        "'speaker_2': 'Good evening, members of Council. Thank you for your time tonight. My name is Allison Altares. I'm counsel for the property owner and I'm only here to answer questions if you have any of my addresses. 319 Eudora Street.'",
        "'speaker_1': 'Great. All right, thank you. This concludes a comment portion. Any questions by members of council? I have one quick question. Is the owner of the property actually here? Out here? Okay. So so you guys are representing the owners.'",
        "'speaker_1': 'We had a conversation in committee around possible uses and obviously this is part of a food desert. We talked about, you know, grocery store. It uses things like that. Has that been talked about with the owner? Things like that?'",
        "'speaker_9': 'I think we mentioned that in kind of a summary of of meetings that we had previously to the owner. It was a very favorable meeting, we thought, and relayed some of those kind of ideas. I still think he's an undetermined at the moment as to what he might do other than restore it initially on the upper level'",
        "'speaker_9': 'for tenancy renters and some sort of commercial use on the lower level, although.'",
        "'speaker_1': 'So he will be using retail. We know that at the lower level, but he hasn't decided what what retail tenants would be in there. Okay, Councilman Espinosa. Yeah. Just a quick question for Teresa since hopefully you deep dived into that that uptown village.'",
        "'speaker_6': 'The small lot parking or.'",
        "'speaker_1': 'No. Normally that that's what I ask everybody that loonie. Yeah please don't bring that up. Yeah. There was a lot of forward thinking comments that you referenced here on that, you know, 31 year old plan. Mm hmm. You know, so hopefully, you know, these are things that we continue to sort of talk about debate.'",
        "'speaker_1': 'And now it's part of Denver. Right. I'm just curious because there are always some dated components. Did it talk about parking in this area and what did it speak to?'",
        "'speaker_6': 'Well, at the time the plan was written, there were multiple parking lots. I mean, the neighborhood was just a lot of parking lots. And in talked spoke very negatively about being parking lots for downtown.'",
        "'speaker_1': 'So I'd be it would be even it'd be fun. And maybe I'll busted out to see all the forward looking comments that are that are that resonate that you that you quoted, that resonate with a lot of our plans today.'",
        "'speaker_1': 'But it'd be interesting to see that because they were so impacted by all those surface laws that if they were actually language towards away from parking, that too would also be consistent with movements you see towards.'",
        "'speaker_6': 'Today, towards redevelopment. Yeah.'",
        "'speaker_1': 'So yeah, I've got my questions answered on the small committee, so thank you. Good. I'm glad yours were answer because mine weren't. All right. Thank you, Councilman. Thank you, Councilman Espinosa. Seeing no other questions by members of comment, public hearing is is now closed.'",
        "'speaker_1': 'Comments by members of council. Any comments by members of council? All right. CNN's Madam Secretary, recall.'",
        "'speaker_2': 'Black eye. Clark.'",
        "'speaker_1': 'Right.'",
        "'speaker_4': 'Espinosa. Flynn. I. Gilmore. I turned in Cashman. Kenny Ortega. Mr. President.'",
        "'speaker_1': 'I. We've got very nice results.'",
        "'speaker_4': 'Someone's. Sorry someone's.'",
        "'speaker_2': 'Missing. Okay.'",
        "'speaker_1': 'How about now? There we go. We got it.'",
        "'speaker_4': 'Tonight.'",
        "'speaker_1': 'All right. Ten Eyes counts about 10021022 has passed. Congratulations. Thank you. All right. City council sitting as the ex-officio as the board of directors for the Denver 14th Street General Improvement District, the Reno General Improvement District, the Gateway Village General Improvement District will hold public hearings on Monday, November 20th, related to that 20,018 work plans and budget'"
    ]
}