{
    "Proclamation for Milender White's Contributions to the Rose Andom Center.": [
        "'speaker_1': 'All right. Thank you. Seeing no other comments. We will check on presentations. Madam Secretary, do you have any presentations then?'",
        "'speaker_3': 'Mr. President, how about communications?'",
        "'speaker_1': 'Do we have any communications?'",
        "'speaker_3': 'None, Mr. President.'",
        "'speaker_1': 'We do have one proclamation this evening. Councilman, do you please read Proclamation 71?'",
        "'speaker_5': 'Yes, Mr. President, even though this is all about the Rose ad on the Senate tonight, and it's wonderful to read this proclamation to really honor one of the major contributors to the Rose and Center. So like to read this proclamation favorite, Melinda White tonight honoring Melinda, huge contributions to the Rose Angel Center and the community and the'",
        "'speaker_5': 'city and county of Denver. Whereas Melinda White is an innovator in construction, delivering outstanding projects based on proven systems and advanced technology. And. Whereas, Melinda White is the fastest growing company established in Colorado in 19 1997 and employs over 120 individuals.'",
        "'speaker_5': 'And. Whereas, 2017 marks Melinda White's 20th anniversary managing construction projects in 31 states. And. Whereas, Melinda White demonstrates an outstanding commitment to community service through volunteer projects, fundraising efforts and donation of services and materials. And. Whereas, Melinda White supports over 50 children's charitable organizations through the cause and Denver Day Iraq.'",
        "'speaker_5': 'And. WHEREAS, The Rose Annually Center strives to improve the lives of domestic violence victims by facilitating better access to services and staff of community organizations and government agencies in a single, safe location. And. Whereas, Melinda White managed the construction of the Rose and Loan Center at cost.'",
        "'speaker_5': 'And. Whereas, the following completion of the Rose Angel Center, Melinda White made a substantial cash donations directly to the Rose Angels Center. Now their be therefore be it proclaimed by the County Council of the City and County of Denver, Section one, that the Council of the City Kennedy honors Melinda White for their commitment to the Rose Anthony'",
        "'speaker_5': 'Center and Community Service in Denver. Section two that the Clerk of the City and County Denver Show attest and affixed the seal of the city and county of Denver to this proclamation and that a copy be transmitted to Byron Hoy, presidency of Melinda White.'",
        "'speaker_1': 'Thank you, councilman. Knew your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. Move that proclamation. 71 be adopted.'",
        "'speaker_1': 'It has been moved in. Second comments by members of Council. Council in New.'",
        "'speaker_5': 'It was just wonderful. Today, as a group of us took a tour of the Rosie on the Ellen Center. And what a beautiful facility it is. It's just gorgeous. Yeah, I just couldn't describe how pleased we are as we toured and and not only see all the coordination of all the services that are providing care for victims'",
        "'speaker_5': 'of domestic violence, but just seeing how beautiful the construction was and the design of that building and is a wonderful job. We're so proud of that center and its location and its history and Denver and I couldn't be more proud to be a sponsor for this proclamation tonight.'",
        "'speaker_1': 'Thank you. Councilman now, Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. I wanted to thank Councilman Nu and the staff of the center and the folks associated with it for that tour this afternoon. It was my first opportunity to go into that building that having worked in this neighborhood for 35 years, I've seen that building go through a lot of different uses and permutations.'",
        "'speaker_6': 'But I have to say this is one use that I think is the most valuable to the community of anything that's occurred in that building. It looks much bigger inside than it does from the outside. I was amazed at how much service they're going to be able to provide in there, and I really welcome that as a'",
        "'speaker_6': 'new approach to to dealing with domestic violence cases. And I just wanted to thank Councilman New again and the staff, the Center for arranging the tour this afternoon.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilman Ortega. Thank you, Mr. President. I just want to add my $0.02 as well and express my appreciation to Melinda Wright for the additional contributions that you all made to ensuring that this project was done. I know it was something that was talked about for a very long time under Mitch Morrisey, and he helped kind of bring'",
        "'speaker_0': 'it to fruition. And I was part of the tour and just being able to go through and see how functionally efficient the building is going to operate is is pretty exciting to see that you've got all the different components in one place so that when a victim is is being tended to, I guess is the right word'",
        "'speaker_0': 'as opposed to treated. They get everything in one location as opposed to in the past, they'd have to go to multiple places. And if you're somebody that had just left your home, you didn't have transportation. You had to schlep your kids around trying to do all of that and get the services and resources you need.'",
        "'speaker_0': 'It was very, very challenging. And in some cases, women weren't getting what they needed. And so being able to have all of that in one place is pretty exciting. And I look forward to just seeing the kind of impact that hopefully it will have where we begin to see some of our domestic violence stats go down as'",
        "'speaker_0': 'a result of the great work that will be happening out of this location. So thank you all for the tour and for the great work that you're doing along with all of our other community collaborators that provide domestic violence services.'",
        "'speaker_0': 'And I know the. DA's office and the police department utilize their resources from that they get from court fees that help provide some of the cost to many of our organizations to provide these services to the people in need in our community.'",
        "'speaker_0': 'And so I want to say thank you to them as well. Thank you, Mr. President.'",
        "'speaker_1': 'Yeah, thank you, Councilwoman Ortega. And I'll try my $0.02. You know, this this proclamation is about the Rosanne Center and the company that helped build it. And there's an incredible that we're doing this for the Rosanne Center. But I happen to know a couple of things about the construction company Melinda White and what they've done in the'",
        "'speaker_1': 'city of Denver from work at Union Station to affordable housing products, also at the airport as well. And so they have been an incredible organization. But, you know, I know Brian and Jeanie. And so it's it's one thing about the work that you do.'",
        "'speaker_1': 'It's another thing to be just good people and they're just great people. And so we just want to thank you for just how you care about Denver. And it's more than just business. It's about relationships as well, and it's about seeing Denver succeed.'",
        "'speaker_1': 'So thank you with that, Madam Secretary, roll call.'",
        "'speaker_3': 'New Ortega I. Sussman. Black Eye. Espinosa. Flynn I. Gillmor, i. Herndon. Can each. Mr. President.'",
        "'speaker_1': 'I please close voting or announce the results?'",
        "'speaker_3': 'Ten Eyes.'",
        "'speaker_1': 'Ten Eyes proclamation 71 has been adopted. Councilman knew. Is there anyone that you'd like to bring up to speak tonight?'",
        "'speaker_5': 'First of all, I like Margaret Abrams to come up and executive director of the Rosen Center, just to say a few words about the center.'",
        "'speaker_3': 'Good evening. Thank you so much. For those of you that took time out of your busy schedule to come on the tour today. We were delighted to host you. And if any of the rest of you want to come at any point in time, we'd be happy to have you come visit as well.'",
        "'speaker_3': 'I think the Rosie and Jim Center is has been such an amazing example of a public private partnership that the city can be very proud of with the city partnering, community agencies partnering. And certainly Millender White was an incredible partner in the success of this project as well.'",
        "'speaker_3': 'Just to say a few words about what we're doing, the you've already heard that it really is about bringing all of the resources together under one roof. We know domestic violence is is an issue with a lot of complexity that no single resource or agency really can address.'",
        "'speaker_3': 'In there, in there, a single entity. So it really has been an amazing process to bring together of a wide variety of resources and groups to better serve domestic violence victims and their kids, including the police department, the DA's office, the city attorney's office, some of the community partners involved or Safe House.'",
        "'speaker_3': 'Denver Project Safeguard. Colorado Legal Services Coalition for the Homeless Servicios de la Raza Mental Health Center of Denver has their children's program involved there as well as, like I said, the police department. So we're very pleased at the Rosie and Him Center to be able to bring together community organizations and government agencies working together to provide for'",
        "'speaker_3': 'the needs of individuals and families and by co-locating the staff and crucial services in one place. Not only do these organizations provide more and better coordinated services, but victims and their families can access a full range of resources and hopefully be able to access services proactively because they are there.'",
        "'speaker_3': 'We are already seeing those positive results from the families that have accessed services at the Rosie and of Center. We opened for business June 29th. We've served about 750 victims that have come through the door, bringing 250 children with them.'",
        "'speaker_3': 'And we've only just begun to get the word out that we are there. So we're very pleased to continue to get the word out and see what a great impact this is going to have on the Denver community.'",
        "'speaker_3': 'Developed as a family justice center model. This is the first one in the Rocky Mountain region, and our goal was there's about 90 family justice centers open across the country. And we certainly want Denver to be one of the best in the country.'",
        "'speaker_3': 'And that's our that's our goal. And certainly we were incredibly pleased to partner with Millender White because it was more than business for them. And that became very apparent as we worked with them on this project that they really embraced the goal of what we were trying to do and to help create the vision of what we'",
        "'speaker_3': 'wanted the Rosie Center to be in in being a warm, welcoming, safe place for victims and their kids, to be able to come and receive services in a way that victims can feel dignified and respected and how they do that.'",
        "'speaker_3': 'So we could not be more proud to be partnering with the Millender white services and what the what the outcome has been.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_5': 'I also like to recognize Maggie Morrissey, who's sitting here as the wife of our former D.A., Mitch Morrissey, who is one of the leaders in helping organize and fundraise for this whole center. So we couldn't be done without Maggie and and also Josh Handling, who's everybody knows around everywhere.'",
        "'speaker_5': 'And it's amazing he's not here. But I want to mention him and recognize his contribution and his. It was wonderful to hear him on the tour today talk about the history. He and Maggie talking about the history of the center and and what they did personally to help bring success to the center.'",
        "'speaker_5': 'But today's all about Melinda White and what your contribution to the center and loved Byron White to come up and and say a few words.'",
        "'speaker_4': 'Thank you. Well, I would be very remiss to not first of all, thank Maggie and Margaret, because without your leadership, we wouldn't be here. So thank you very much. Mr. President, Council like to thank you very much for this distinguished honor.'",
        "'speaker_4': 'Specifically want to also thank Councilman New. Melinda White is a home grown company. We started in Arvada 20 years ago. We started as a small business, two guys in a basement. We've now grown to an organization that's about 120 employees, something that we're very proud of from the Denver Union Station to the expansion of Concourse C at'",
        "'speaker_4': 'DIA for Southwest Airlines to this beautiful building in 2012 when we renovated it. We've built many projects that are part of the fabric of this community. We're very proud of our culture of giving back. We started this company when we were pretty young, and we knew that giving back with our successes was very important to us.'",
        "'speaker_4': 'And so over the years, we would have donated in excess of $1,000,000. And I don't say that name or that number to brag, but to point out that giving back is a company that has success is important and important to, I think, all of the businesses that are able to have success.'",
        "'speaker_4': 'But how? Our most recent success at the Rosatom Center, though, is probably our most proud achievement. So all these generous people standing next to me. Are very part of continuing the culture of our organization of giving back. Again, thank you for this wonderful honor.'",
        "'speaker_4': 'It's something we'll always remember and cherish. Thank you.'",
        "'speaker_1': 'You know, Milliner White are they're big buff fans, too. So I think that's important to point out as well. Maggie, thank you for your hard work and I'm excited to get ahead. I didn't get it. Get over there and see it today.'",
        "'speaker_1': 'I'm excited to get over and see it. We've been hearing incredible things. So thank you so much. All right. Now we are moving on. Madam Secretary, resolutions. Will you read the resolutions.'"
    ],
    "Second Amendatory Agreement with Kofile Technologies for Online Access of Historic Records.": [
        "'speaker_1': 'And I get that right. Okay, great. Madam Secretary, please bring up the first bill 1139 resolution. Councilman Flynn, your comment.'",
        "'speaker_6': 'Thing. Mr. President, I was going to make a comment, but I see that the clerk is here. Deborah Johnson, I wonder if you might want to come up, because I would make my comment in the form of a question.'",
        "'speaker_6': 'When we see contracts come amended with amendments for an amount that takes it over $500,000 when it would have ordinarily come to the council word over 500. And this this particular contract was led, I think, in 2013 for an amount that was about $500 under the threshold, and now we're amending it for another four years.'",
        "'speaker_6': 'So I'd just like to get your perspective on why you contract it that way, because we're always suspicious when it's done that way, that the foot in the door was to avoid coming to us in the first place.'",
        "'speaker_6': 'So and I know this is something that really needs to be done in your office. So. Clark Johnson.'",
        "'speaker_3': 'Thank you. Councilmember Flynn Yes, this is an amendment to an existing contract and basically that says two fold. Number one, we're extending the support and maintenance on the contract for another three years. And the reason we reopened the contract because we bought another module two for the on the existing contract.'",
        "'speaker_3': 'So that would be easier for the citizens to search for documents that are currently in our repository, about 11 million different documents.'",
        "'speaker_6': 'And this will take documents that are pre like mid-eighties and before and make them readable and searchable online searchable.'",
        "'speaker_3': 'It's key. We do have older documents out there, but it's not really easy to search. And we're buying a tool to make it much easier for citizens to search for those documents.'",
        "'speaker_6': 'Okay. And then just one last thing. Is this something that could not have been foreseen in the original contract that it came in $500 below the threshold where it would have had to come to us before?'"
    ],
    "On-call Program Management Agreement for National Western Center Campus Development.": [
        "'speaker_3': 'Well, the tool was just developed, and we're one of the first cities to use this tool with the existing vendor. So it was unforeseen at the time because it wasn't developed back in 2013.'",
        "'speaker_4': 'All right.'",
        "'speaker_6': 'Thank very much, Mr. President.'",
        "'speaker_1': 'Yeah, thank you. All right. Let's see. We're going to let's bring up the next agenda item for a vote council bill 1317. Is that okay? Councilman New. Will you please put this on the floor?'",
        "'speaker_5': 'Thank you, Mr. Rose. I move that resolution 16 dash 1317 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilman Espinosa.'",
        "'speaker_4': 'Yeah. The reasons why I'm calling this out for a vote is this. This resolution grants complete contracting latitude for up to $14 million for program. Managing that is TBD. To get this 14 million figure, the mayor's National Western Center office simply took 3% of the National Western Centers to see voter approved funds of 276 million.'",
        "'speaker_4': 'Well, it was stated that this number represents best practices. It is a very healthy amount for program management at this scale. Program management fees typically range from 1% to 5%. The higher percentages are typically found on relatively inexpensive projects.'",
        "'speaker_4': 'Once you enter the millions and tens of millions of dollars, program management fees move closer and closer to 1%, which tends to be a significantly large dollar amount. Well, I have faith that the NWC can and will capture the entirety of the NWC program management needs for the funds that will likely be allocated tonight.'",
        "'speaker_4': 'The millions of dollars in latitude that this generous contract provides makes me uncomfortable. By voting for this resolution, Council will choose to distance themselves and therefore the people of Denver out of a project that our voters supported based on certain outcomes.'",
        "'speaker_4': 'Once the contract is approved, the program management work that will be scoped will not require a vote by council. That distance is neither necessary or warranted. And for that reason, I will be voting no.'",
        "'speaker_1': 'All right. Thank you. I am going to. Since Councilwoman Kanis, did you. I saw you just pop in.'",
        "'speaker_3': 'Well, I wanted to ask Kelly to come forward, ask him a question, but I am happy to defer to you, Mr. President. And if you don't ask it, I'll turn back in. But go ahead.'",
        "'speaker_1': 'Yeah, yeah. No, I. I think we may be asking similar questions, but maybe not. Kelly, can you come up? This obviously is in District nine. And and I'm going to ask you a very specific question. And this was on consent.'",
        "'speaker_1': 'It came off of consent so we could have a conversation about this. I think we went into detail about you having the city's best interests, but more important, the constituents best interests, 856 million reasons why. But tell us a little bit about Councilman Espinosa talked about the furthering that this contract what what would bring for council and'",
        "'speaker_1': 'I just want you said this already but please. Sure.'",
        "'speaker_5': 'Sure. So for purposes of discussion, my name is Kelly LEED, and I'm the executive director of the Mayor's Office of the National Western Center. And I appreciate the question. And, you know, because this is this is actually when you add in both the public money and the private money for the first couple of phases of this project'",
        "'speaker_5': ', it's a $1.1 billion project that's been essentially approved by the public to advance. And, you know, we the National Western Office was established by the mayor in January of of this year to specifically make sure that there are very tight connections back to the city and to the council and to the citizens of Denver.'",
        "'speaker_5': 'You know, a lot of times when you bring on these program management teams, the entire effort is turned over to them. That does create separation. I would tell you the exact opposite happens. Here is what we've done is built.'",
        "'speaker_5': 'We are we are building an embedded team to him, which will be would be the program management team is embedding six people into the National Western Center office team. Those six people report to me directly. We are building a structure by which we advance this program which will take numerous years to complete.'",
        "'speaker_5': 'It includes if you know, and there's no single tenant for this project. We have obviously Colorado State University as a tenant and we have the Western Stock Show Association as a tenant. So we and we have funding coming from those respective partners as well.'",
        "'speaker_5': 'So this is a multilayered project that requires a level of expertize that I think stage two brings to this to this experience and to this team. So long story short, what this allows us to do, it's an it's a task based contract.'",
        "'speaker_5': 'So we will be issuing task orders with very specific deliverables to to and to our consultants to deliver. We fully intend and have continued to do in this dates back to my days in the NBCC. We go to LUDI and provide continuous updates to Ludy on our progress.'",
        "'speaker_5': 'We establish an annual workplan every march. We will do that again. We will report that work plan with milestones to the council and to the public. And then we will report out on our progress, not just on the delivery of the milestones, but on our budget, our scope and our schedule.'",
        "'speaker_5': 'As we move this project along, I will tell you that we're still at a place where we don't know what we don't know. And by that I mean is we're going to start to assemble the team that will begin to put detail to this effort and we will begin to put in front of councils a whole range'",
        "'speaker_5': 'of contracts in order for us to to implement this program over the course of the next the next several years.'",
        "'speaker_1': 'Thank you, Councilwoman Canete.'",
        "'speaker_3': 'Thank you, Mr. President. I'm just going to ask two narrow follow ups. So first question. This contract is for program management. It is not for construction of management. We are not seeding the future construction contracts that will be occurring on this.'",
        "'speaker_3': 'That is.'",
        "'speaker_5': 'Correct. Program continuing.'",
        "'speaker_3': 'Right. They will continue to come through the council process? That is correct. Okay. Second question is, this is not the first time we've had program management services. I'm thinking about the better Denver bond. How analogous would you say this role is to that?'",
        "'speaker_3': 'In terms of my understanding, the better Denver bond approach is that is about extending, for lack of a better word, the human power of the city for a time limited project without us bringing on permanent have to ease that we might not need at the end bring in some special expertize.'",
        "'speaker_3': 'How analogous would you say?'",
        "'speaker_5': 'I would say there there's a lot of analogies. I mean, I think the the the embedded structure that we're creating specific for this program, which is pretty unique, has some of its own unique features. But I think that idea of bringing an extended team on to add to the city team, knowing that we just don't have enough'",
        "'speaker_5': 'full time staff to do it, is, is an appropriate analogy. You know, the one and I think one of the things that came out of committee was, well, what's the legacy of. The program effort. And so I think, you know, Stephanie Reid is here with me.'",
        "'speaker_5': 'She's from Public Works and is a young and up and coming program and project manager. She's going to get to experience, along with other project managers in the city, the creation of this project. And so the legacy of a project like this is the experience that Stephanie and other project manager, city project managers are going to get'",
        "'speaker_5': 'that will allow the next generation of leaders in the city to do big programs like this. So we're very committed to doing that. But I think the analogy of better Denver and that role is is pretty close.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'All right, Councilman, as soon as I see Councilman Councilwoman Ortega in the queue, go to her real quick.'",
        "'speaker_0': 'Thanks. Can we have a couple of questions? So at the beginning of this project, there were some conversations about community benefit agreement and what that might look like. Has there been any progress in identifying any of those issues with the community?'",
        "'speaker_0': 'I know you meet with them on a regular basis. Some of them sit on. I'm not sure which level of committee because I think you've got multiple levels of committees involved in having input into the project. But can you just give us an update of kind of where that's at?'",
        "'speaker_5': 'Sure. So, you know, the group I think you're specifically referencing is the Citizens Advisory Committee, and that was actually founded by the Western Stock Show Association at the very beginning of our planning effort back in 2013, 2014, before we started the master plan.'",
        "'speaker_5': 'And that group of 27 people that live or work in those communities have been with us from day one. In the core of those 27, the core group continues to meet on a monthly basis with us. They played a huge role as an example as we worked through, you know, we did the neighborhood plans first, so we'",
        "'speaker_5': 'approved the Globeville plan first and at the end of 14 and then the Elyria Swansea plan in early 15, and then the National Western Plan was approved in March 15. That was intentional because we wanted to make sure that the neighborhoods really helped drive the kinds of improvements they wanted to see in their neighborhood.'",
        "'speaker_5': 'And so what's interesting about the National Western plan is it's not only a master plan for rebuilding the National Western Center, but it's specifically pulls things from those neighborhood plans that we then in turn have to implement. So in terms of benefits, there are direct physical connection improvements that were pulled out of the neighborhood, plans that could'",
        "'speaker_5': 'reconnect the site to both Globeville, to the West in response to the East. The second would be is obviously we've talked a lot about with council and I think this will really heat up this year now that we have a real project is the range of workforce development opportunities that can occur at the local level as well'",
        "'speaker_5': 'as at the city's citywide level. Obviously we have a huge challenges in making sure we have the next generation of skilled workers to deliver projects of this scale. And so I certainly see the National Western Project playing a big role in helping make sure that we're starting at the neighborhood level and building opportunities all the way from'",
        "'speaker_5': 'middle school through high school and beyond as we build the next generation of workers. And then lastly obviously would be the non construction related sort of things that happen. How do we leverage a project like the National Western to make sure that a community like Globeville or Swansea ends up with a grocery store or multiple retail outlets'",
        "'speaker_5': '? Projects of this scale allow for those things to happen. And so I think we have at least the right set of community. You know, Citizens Advisory Committee would be a one of many that we use in order to get that input.'",
        "'speaker_5': 'But I think we have the building blocks based on what came out of the CAC to make sure that we're continually listening to and understanding what it is the neighborhood wants and how do we translate that into either physical improvements or what I call soft infrastructure improvements over the course of a project like the National Western.'",
        "'speaker_0': 'So my my next and last question is about. Where we are without going into details about properties, but where we are with the overall acquisition and where we are in terms of target of bumping up to how much we've allocated for acquisition of properties.'",
        "'speaker_5': 'I'm so glad you asked that question, Debbie, because I just so happen to have the report right here. Look at that. So every month the Department of Real Estate issues an update on where we are with land acquisition.'",
        "'speaker_5': 'There are 38 private parcels that we have to acquire within the boundaries of the National Western Center and as of December, which was our last report we issued. Let me get to that page here. We had under some level of control 17 of those 38 parcels.'",
        "'speaker_5': 'So about 45% of the parcels, give or take. We're under control in some level of control. And by control we mean we've come to terms with them. We've executed a purchase and sale agreement or we've actually closed.'",
        "'speaker_0': 'So that does not. Well, let me just ask, does that include the properties that we've acquired outside of the national western boundaries that would potentially be used for relocation of some of those? No, there's only one.'",
        "'speaker_5': 'Okay. And that's 5300 Franklin. And the reason we acquired that parcel, so that's it's literally just north of our boundary campus boundary. And the reason we acquired that parcel is it's got rail access and we have customers that are in this mix of private companies that we have to relocate that require rail service.'",
        "'speaker_5': 'So it made sense to us to acquire that parcel just north of site and offer that up as part of our overall compensation of relocating those business and keeping them in Denver.'",
        "'speaker_0': 'Okay. In my light, I do have one last one.'",
        "'speaker_5': 'And I have a response to your last piece. You know, obviously, we're still in active negotiations, so I'm not you know, we issued 200 million in April of last year. But I will tell you right now, we are tracking right where we need to be in terms of of acquiring those parcels and being more or less on'",
        "'speaker_5': 'budget with the money we've allocated for land acquisition.'",
        "'speaker_0': 'So we part of the the overall focus needs to. It involves the relocation and the Rock Island Railroad has.'",
        "'speaker_5': 'Not the the consolidation.'",
        "'speaker_0': 'Has has that made progress in terms.'",
        "'speaker_5': 'Of it depends on the day. I'm being very honest it depends on the day. We have had as of late some very productive meetings with the Denver Rock Island. So for the general audience, the Denver Rock Island is a short line rail company.'",
        "'speaker_5': 'It's privately held by the Mars family and it runs through the site. They have two sets of tracks, one that runs through the current National Western Drive and one that runs along the river side of tracks that run along the river.'",
        "'speaker_5': 'We've been very focused on trying to consolidate the tracks off the river and consolidate them down the center of the site. And I think as of late we've had some very productive meetings. We had a really good meeting with them this last Friday.'",
        "'speaker_5': 'And I and I feel like we're starting to make some real progress of understanding what their needs are, how we pull this consolidation off and what that ultimately looks like. But this will be a big year for that discussion with the Denver Rock Island, and that includes moving some of their customers.'",
        "'speaker_5': 'So it's not as simple as just consolidating rail. It includes moving customers and keeping them as an active line. I will tell you, I mean, one good sign is we had two fast lane grants that went through the federal Department of Transportation and in both cases, the Denver Rock Island signed letters of support for those fast lane'",
        "'speaker_5': 'grants. So we're still awaiting the outcome of the most recent. So, you know, those are, I think, pretty good indicators that at the end of the day, we're going to figure out how to work as partners with them, because rail is such an important part of the history of the site, and it's important that rail continues to'",
        "'speaker_5': 'be a part of that story.'",
        "'speaker_0': 'Thank you, Carl.'",
        "'speaker_1': 'Yeah, thank you. I'm Kevin. Um, Councilman Flynn, I will go to you. I was just going to cut you off because I want to let everybody know that we had. This is a huge project and it's so big and so important.'",
        "'speaker_1': 'We have quarterly meetings in the Luti committee. Thank you, Councilwoman, for letting that happen. And we go into deep detail on all of these issues. So if folks are wanting more information on these complex issues like rail consolidation, things like that, we should definitely be at the meeting.'",
        "'speaker_1': 'I want to zero us in on this particular bill that's in front of us because we have some more tonight. Councilman Flynn, I'm sorry.'",
        "'speaker_6': 'Thank you. I mean, Mr. President, just a quick follow up then, and you can rule it off topic if you want. But Councilwoman Ortega asked about real estate acquisition. Kelley, I'm wondering, are you on target on schedule with those third with those 17 out of 38 acquisitions, is that where you thought you would be a year and'",
        "'speaker_6': 'a half ago?'",
        "'speaker_5': 'Yeah, we you know, obviously without you know, we didn't start officially till April of this last year. So we had less than a full year to acquire, but our goal was about 50% per year. So we're right on target where we need to be.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. Thank you. Councilman Flynn, Councilman Espinosa, you're back up.'",
        "'speaker_4': 'Yeah. So one quick clarification. At committee at Ludy, it was five people and tonight it's six. So how many?'",
        "'speaker_5': 'And it's five embedded. And then there's Eric Anderson is the sixth. Eric is part of the design team that's.'",
        "'speaker_4': 'A separate.'",
        "'speaker_5': 'That's a contractor working part of to. But he's going to be spending a lot of time there. But he's not part of the official embedded.'",
        "'speaker_4': 'Five and part of this resolution.'",
        "'speaker_5': 'That is correct.'",
        "'speaker_4': 'And that's a separate half million dollar three year.'",
        "'speaker_5': 'No, you're talking about Eric.'",
        "'speaker_4': 'That's a different that's SSI.'",
        "'speaker_5': 'Yes, that's where we run. Eric Anderson is part of the stage two team and was part of the original team that did our master plan in 2015.'",
        "'speaker_4': 'Okay. To many Eric's now.'",
        "'speaker_5': 'To and Eric. Yes.'",
        "'speaker_4': 'So Eric this Eric is part of six.'",
        "'speaker_5': 'That is.'",
        "'speaker_4': 'Correct. Okay. Okay. And then you in again, I, I stress that I do believe that NWC can and will deliver on what you're saying. Even with this healthy contract and you have operated in the way that you're talking about with these reports back.'",
        "'speaker_4': 'But the thing that I want to stress is that those are reports only informational and briefings. There is no council action report with regard to those those status updates. And in these on call contracts, is that correct?'",
        "'speaker_5': 'Once you approve the contract? That is correct.'",
        "'speaker_4': 'Okay. And so that's. So that is that is my concern, because we could just as well enter into a CMG contract that would work essentially the same way for the totality of the construction work that will eventually need, need to happen.'",
        "'speaker_4': 'And that would continue to keep the direct community and the citizens groups that you mentioned and their needs at arm's length and distant from all elected representatives and advocates except for the mayor. And that's that's that is a to me, a legitimate concern, given the sort of needs that have been long string since stressed and that you're'",
        "'speaker_4': 'very much well aware of and you have a matrix of needs that we continue to not move in advance on in any sort of with any sort of rigor. And so well, we're carving out $14 million for a very healthy contractor in this regard, and we will continue to do so.'",
        "'speaker_4': 'There's a community there that has long been ignored and still very much has needs. And I would really stress that we start acting on those.'",
        "'speaker_1': 'And our response to that. Thank you, Kelly, for being up here. Let me just say to my council members and folks who are watching a little bit of this process before a bill, before action even gets to city council.'",
        "'speaker_1': 'We have an executive oversight committee for the National Western Center comprised of city council members, the partners, which is CSU, the National Western Center. Some folks from the city, which is a legal team, Kelly, leads that time. But we also have a neighborhood representative, Drew Dutcher, as well.'",
        "'speaker_1': 'And those meetings are open to the public. This is a transparent process. And in researching some of these complex projects, this is a best practice. And I think, Councilwoman, can each kind of identified what we should be focusing on here?'",
        "'speaker_1': 'This is programmatic, not construction. During a construction contract, you do give up a lot of oversight, but programmatic, you bring an expertize in that you don't currently have. And so I will be supporting this. And, Madam Secretary, we are we we have a mover and a Senator Rocha Espinosa.'",
        "'speaker_3': 'No.'",
        "'speaker_4': 'Flynn, I.'",
        "'speaker_3': 'Gilmore I Herndon. I can each new Ortega assessment i. Black I. Mr. President.'",
        "'speaker_1': 'I police voting announce results.'",
        "'speaker_3': 'Nine eyes, one nay.'"
    ],
    "Resolution to Settle a Liability Claim Involving the Denver Police Department.": [
        "'speaker_1': 'Nine eyes, one one nay. Resolution 1317 has passed. Can you please. Has been adopted. Can you please pull up 66 Resolution 66 for Councilman New. And 67. Madam Speaker, can we do this in a.'",
        "'speaker_5': 'Block of time?'",
        "'speaker_1': 'Okay. Yeah. Can we do this in a block? Madam Secretary?'",
        "'speaker_3': 'No, we can try it.'",
        "'speaker_1': 'Madam Secretary says we can try because we have a new system. Our favorite friend, it's called Granicus. And it may not allow us to do this, but maybe it can. We can do it on a on a public or a vote.'",
        "'speaker_1': 'Let's come up with. No, go ahead.'",
        "'speaker_5': 'Thank you, Mr. Perez. I move the resolution 17 0066 and 0067 be adopted.'",
        "'speaker_1': 'All right. It has been moved in second it. Yeah. Councilman, no comment.'",
        "'speaker_5': 'I just called for a vote because I was I was unable to be briefed on on both of these. And I missed the committee where the discussion was held and just need to abstain from this vote.'",
        "'speaker_1': 'All right. It has been moved and seconded. Any other comments? Madam Secretary, roll call on 66 and 67.'",
        "'speaker_5': 'New state.'",
        "'speaker_3': 'Ortega.'",
        "'speaker_0': 'I had turned in a little late. I did not also have an opportunity to get briefed. So I'm going to abstain as well. Thank you.'",
        "'speaker_3': 'Sussman i. Black Eye Espinosa, I. Flynn Gilmore, i. Herndon, i. Cashin can each. Mr. President, I.'",
        "'speaker_1': 'All right, please close the voting and US results.'",
        "'speaker_3': 'Eight eyes, two abstentions. Eight.'",
        "'speaker_1': 'I still have six abstentions. Resolution 66 and 67 have been adopted. All right. That brings us to the conclusion of all our bills caught out. All of the bills for introduction are now ordered published. We're not ready for the block vote on resolutions and bills for final consideration.'",
        "'speaker_1': 'Council members, please remember, this is a consent or block. Vote for you and you'll need to vote. Otherwise, this is your last chance to call out an item. Councilman, will you please put the resolutions for adoption and the bills for final consideration on final passage on the floor?'",
        "'speaker_5': 'Thank you, Mr. President. I move that resolutions be adopted and bills on final consideration be placed upon final consideration and do pass. And a blog for the following items. 17 Dash 006 17 Dash 007 717 Dash zero zero 1317.'",
        "'speaker_5': 'Dash zero zero 14. 17 Dash zero zero 1516 Dash 11 3916. Dash 1244. 16. Dash 1339. 17. Dash 0008. 17 Dash 0005. And one bill for final consideration. 16. Dash 1341.'",
        "'speaker_1': 'I think you've got a mark, Madam Secretary, that you get them all.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'All right. All right. It's been moved a second. Secretary Raquel.'",
        "'speaker_3': 'Black. I. Espinosa. Hi. Flynn.'",
        "'speaker_5': 'Hi.'",
        "'speaker_3': 'Gilmore. Herndon. I need new. Ortega. Assessment. Hi, Mr. President.'",
        "'speaker_1': 'I please close the voting. And as a result, ten eyes.'",
        "'speaker_0': 'Ten eyes.'",
        "'speaker_1': 'The bills. Well, let me see here. The bills have in place. Resolutions and adoption have been on. Final consideration have now passed since there are no public hearings. If there are no objections from members, the Council will not take a recess.'"
    ]
}