{
    "Rezoning of Property at 2698 South Federal Boulevard.": [
        "'speaker_2': 'Testimony is recorded in any item presented to the Council are marked as exhibits and become a part of the public record. Public hearings for 573 is now open. May we have a staff report?'",
        "'speaker_3': 'Good evening. So community planning and development. This is a rezoning or a map amendment. Location of the property is 2698. Federal South Federal Boulevard. The proposal is to rezone the property from suburban multi-unit three storey to suburban mixed use.'",
        "'speaker_3': 'Three storey. So the property is located in Southwest and in the City Council District seven in the College View South Plant neighborhood. This gives you a little closer view of the location. It is on the northeast corner of Yale Avenue, West Yale Avenue and South Federal Boulevard.'",
        "'speaker_3': 'It is about 9000 square feet. Currently a single family structure or office structure. Property owner is requesting this rezoning to allow the existing office use. And again, the proposal is to rezone from suburban context multi-unit three storey to suburban context mixed use three storey.'",
        "'speaker_3': 'So the suburban neighborhood context is consisted of single family, multi-unit, commercial strips, commercial centers, office parks, single unit and multi-unit. Residential uses are usually located away from commercial streets and resident and arterial streets. Multi-unit, on the other hand, and commercial uses are located on arterial arterial streets and collector streets.'",
        "'speaker_3': 'The street and block pattern can be very different when we usually have a modified grid, sometimes not alleys, sometimes not detached sidewalks, cul de sacs. So our block shapes vary, and we have pictures here that kind of give you a flavor of what the suburban neighborhood context is.'",
        "'speaker_3': 'So the surrounding the existing zoning, as I said before, is suburban context, multi-unit, three storey height limit. There is a view plane that covers the property from Ruby Hill. So the height limit on the property would be 98 feet.'",
        "'speaker_3': 'Obviously, a three storey building isn't going to be that high. So the new plane is going to have very little effect. The current land use is an office and the current building form is this one story structure. This just gives you a little bit of context on the zoning surrounding it.'",
        "'speaker_3': 'The property. Where it says SMU three and s 12. All of this property was zoned R for under former Chapter 59, which was our highest density residential zone district under Chapter 59. And in the 2010 citywide rezoning was re zoned to fit the context a little bit better of the existing structures.'",
        "'speaker_3': 'So the. 612 directly across federal is a 12 storey building. It's a senior housing facility. And then the surrounding buildings to our property, to the subject property are three storey multi-unit structures and then a little south. We've got a pretty that's the kind of a strip mall and another pudi across from that and more residential three storey'",
        "'speaker_3': 'that ended up being CC three a little further south of that. And then in the larger context, we've got an elementary school to the east and then more commercial along Federal Boulevard in here. So as I said earlier, the existing use is office.'",
        "'speaker_3': 'The surrounding uses are multi-unit 112 storey and then several three storey. And the vacant property just east of our site that shows up white on this existing land use map is currently there are currently some three storey townhomes under construction on that property.'",
        "'speaker_3': 'So that this just gives you a flavor for what's surrounding our our property. So the upper left is the property itself. It was a single family home that was rehabbed into an office building, the 12 story office. I mean, senior housing is on the bottom left.'",
        "'speaker_3': 'And then the two, three story multi-unit to the north in the upper right, the three story townhomes under construction to the east of the property in the middle. Right. And then lower right is the across from that across from that, another three story multi-unit structure.'",
        "'speaker_3': 'So a planning board heard this on August 5th and unanimously recommended approval of this on September 2nd. This application was heard at the Neighborhoods and Planning Committee and it was moved on to the full council floor. And then, of course, here we are today and all of the proper notices and sign postings have been made.'",
        "'speaker_3': 'The Arnaud's affected by this are the College View Neighborhood Association, Denver Neighborhoods Association Inc. In our neighborhood cooperation and we have had no public comment on this application. So you're well aware of the criteria, consistency with adopted plans, uniformity of district regulations, furthering the public health, safety and welfare.'",
        "'speaker_3': 'Justifying circumstances and consistency with neighborhood context and zone district. Purpose and Intent. So the pertinent plans for this property are a comprehensive plan. 2000 and Blueprint. Denver. There is no local neighborhood plan. So a comprehensive plan tells us to support the creation and growth of neighborhood business to encourage quality infill development that's consistent with the character of'",
        "'speaker_3': 'the surrounding neighborhood and to continue to promote mixed use development. Blueprint. Denver The land use concept is commercial corridor for Federal Boulevard. These are linear business districts, usually oriented to arterial streets with high frequency transit routes. This is an area of stability where we want to maintain the character of the area and area while accommodating some new'",
        "'speaker_3': 'development and redevelopment. As far as for future street classification, South Federal Boulevard is a commercial arterial. These are. Our streets that serve a citywide function for mobility mostly. And. Our commercial streets obviously balance that mobility with access to business.'",
        "'speaker_3': 'A federal boulevard in on the Blueprint Denver map is also an enhanced bus transit corridor. These are corridors where we want to study, enhance transit and where we want to incentivize it with the possibility of mixing uses or transit friendly uses.'",
        "'speaker_3': 'UCL Avenue is an undesignated local street, but across Federal Boulevard on the west side of Federal Boulevard, Yale Avenue is a residential arterial street. So staff believes that. This application is consistent with our blueprint Denver Comprehensive Plan 2000 and that it will have no effect on the uniformity of district regulations as this as Annex three will be'",
        "'speaker_3': 'treated the same as every is mx3 in the city, and that by implementing our plans, we are furthering the public health, safety and welfare. The justifying circumstance is. Changed conditions. Per the Denver Code zoning code, the land or its surrounding environs has changed or is changing to a degree that is in the public interest to encourage the'",
        "'speaker_3': 'redevelopment or to recognize the changed character of the area. Sorry, I'm losing my voice. Let me take a sip of water. So the changed condition here is that the property had already been being rehabilitated or rehabbed into an office right about the time that the city was doing a citywide rezoning and zoning it for multi-unit.'",
        "'speaker_3': 'Unaware that the property was being changed, the use of the property was being changed. So we're trying just to acknowledge that change in the use of the structure with this rezoning. So we did talk a little bit earlier about neighborhood context, the suburban neighborhood context.'",
        "'speaker_3': 'These commercial uses on arterial streets in our suburban neighborhood context are fairly common, along with the adjacent multi-unit structures. The other commercial buildings on the block. We believe that this all forms a commercial strip on Federal Boulevard that's consistent with this suburban neighborhood context and the specific intent of the S-Max three zone district and applies to these'",
        "'speaker_3': 'areas in intersections where local and collector streets at a scale of 1 to 3 intersect with those corridors. And we believe the commercial corridor is very accepting of this kind of mixed use zoning as is. I said as I said before, our enhanced transit corridors, we want where we want to encourage a mixture of uses that support'",
        "'speaker_3': 'transit. So we do believe that this is this application is consistent with the neighborhood context and the zone district purpose and intent. And we do recommend approval of this application.'",
        "'speaker_2': 'Thank you, Mr. Sarah. We have to speak or sign them, and I'll call you both up. First is Garrett Jones. Second one is that Texar? So, Mr. Jones, you can come on it.'",
        "'speaker_0': 'Good evening. My name's Garrett Jones. I'm the owner of this proposed site and in short purchased the property early 2009 and commenced rehabbing the property into its current use, which is my office. During that period of 6 to 8 months of remodeling and going through the process with the city of Denver, the letters that were sent out'",
        "'speaker_0': 'about the overlay rezoning process that was happening back then were being sent to the previous owner and not to myself. And so I was unaware of what was going on with Denver's rezoning structure. And so I applied and was granted permission to commercialize the building and put in the ramps and all the necessary things to to receive'",
        "'speaker_0': 'a certificate of occupancy and deeded the city part of my frontage to meet their criteria that they needed to meet to make it a commercial building. A few years ago, I went to test the market and actually put the property up for sale and received two offers on it.'",
        "'speaker_0': 'But neither one could close simply because I wasn't aware it wasn't zoned commercial. So that ensued. The process of applying to have it resumed, and that's where I'm at now. The difficulty in having it as an SME U3 building is it doesn't have a kitchen or even a bathtub or a shower or anything that a residential property'",
        "'speaker_0': 'would have to be able to market the property as a residential property. The whole units commercial was just a sink toilet and a drinking fountain. So that's, in short, why I'm here.'",
        "'speaker_2': 'Thank you, Mr. Jones. Okay. That Texas.'",
        "'speaker_0': 'Fat tax of 4535. Julian Street, Denver, Colorado. Mr. President, for the second time, I have to object to the fact that this Council clearly has a different set of rules of speech for speech that it supports as opposed to free speech it's supposed to.'",
        "'speaker_0': 'Tonight, the room was allowed to be overcrowded despite the council rules. And interestingly, the same people who were cut off when they sought to do a demonstration in opposition to the camping ban were tonight allowed to engage in a loud demonstration and were not expelled from the room as they were previously.'",
        "'speaker_0': 'It is simply unconstitutional to treat speech that you support.'",
        "'speaker_2': 'Mr. Text and speech. Are your comments really? Thank you. All right, that concludes our speakers. Now time for questions from members of the council. Councilwoman, can each.'",
        "'speaker_6': 'Thank you, Mr. President. Just a quick question for Teresa. Why is commercial not an acceptable use in the SMU? What is the mix of uses if it's not commercial? Is it just retail and residential that's allowed in that zone district?'",
        "'speaker_6': 'I brought a copy. Oh, my goodness. Multi-unit. Okay. That's. Yeah, it's. Are you? I think my colleague just answered my question. I agree. I think I was I was misremembering what the acronym stood for. A unit, melting unit.'",
        "'speaker_3': 'And there are not very many commercial uses.'",
        "'speaker_6': 'All right. Got it. Thank you. Thanks, Kendra.'",
        "'speaker_2': 'Thank you. Councilman McKinney, Councilman Clarke, you have a question for the microphone.'",
        "'speaker_0': 'Thank you, Mr. President. Yes. So I just want to clarify in the report, it says that when this was converted to commercial, it was an allowable use in the old zoning. And it was just missed that it had been converted.'",
        "'speaker_3': 'No, when it was converted was in 2000, late 2009. We were in the process of redoing our zoning code and taking a look at all of the zoning citywide. So this was zoned R four, which is another multi-unit zoned district.'",
        "'speaker_3': 'So when we took a look at this building and it looked like a residential structure and the structures around it were multi-unit, we zoned the whole area multi-unit thinking this was a being used as a residence.'",
        "'speaker_0': 'And I'm sorry, maybe I didn't clarify my question up in the report. It says that at the time it was zoned r four and that the office use was an allowable use under the R for zoning. Is that.'",
        "'speaker_3': 'Correct? Yes.'",
        "'speaker_0': 'Okay. So at the time it was converted, it was an allowable use and then the zoning was changed, which made it not in law will use after it had already been converted because of what we citywide rezoning. Thank you.'",
        "'speaker_0': 'Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Carter. Any other questions? Public hearing is now closed. Time for comments, Councilman Clark.'",
        "'speaker_0': 'Thank you, Mr. President. And and thank you for the hard work on this, Miss Lucero. You know, for me, this isn't an easy one to support. I think we're fixing something. That was a glitch in the changeover. It was converted.'",
        "'speaker_0': 'It was a it was an allowable use when it was converted. And some were got an oversight that has affected our the land use that was allowed and permitted at the time. So I will be voting to support this.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you. Any other comments on 573? Scene on Madam Secretary, roll call.'",
        "'speaker_5': 'Clark. I Espinosa. I Flynn. I Gilmore. I. Cashman. High can each. I Lopez. Hi new Ortega. I assessment i black. I Brooks.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Mr. President, hi.'",
        "'speaker_2': 'Madam Secretary, please, for the vote in our results. 1339 as Council Bill 573 has passed. All right. Next one is 615 as amended. Councilman Brooks, will you please put Council Bill 615 as amended on the floor?'",
        "'speaker_4': 'Yeah. Thank you, Mr. President. I put Council Bill 615 as amendment on the floor. Final consideration to pass.'",
        "'speaker_2': 'It has been moved and seconded. Public hearing on 615 is now open. May we have that for.'",
        "'speaker_10': 'Thank you, Mr. President. And good evening, council members. I'm Kyle Dalton with the Department of Community Planning and Development. This application is at 620 West First Avenue and is includes a portion of 90. Galapagos Street is located in Council District seven and it's in the Baker Statistical neighborhood, midway between Santa Fe and Broadway and midway between sixth'",
        "'speaker_10': 'and Alameda. It. The rezoning faces First Avenue east of Gallup Peg and it's along the west side of the alley, and it's on the eastern edge of what's known as the Industrial Crescent area of Denver. It is located outside the Baker neighborhood historic Landmark District, which is shown on this slide with the Goldenrod dash line.'",
        "'speaker_10': 'The historic district is to the east and this is to the west outside of the historic district. The property to be risen is 6340 square feet. It includes a four unit to I'm sorry for you in a two story residential building on a 4600 square foot parcel.'",
        "'speaker_10': 'And then the remainder of the property is included with the larger 90 Galapagos Street property, which has a one story office building and accessory surface parking. And the property owners are the ones making the request. They are requesting rezoning in order to enable a zone lot amendment to conform their zone lots to their current parcel lines.'"
    ],
    "Rezoning of 620 West 1st Avenue and 90 Galapago Street in Council District 7.": [
        "'speaker_10': 'There's not a specific development proposal here, and if nothing else, this slide will really explain why they're here before you. Tonight has to do with a parcel line adjustment that was done since the time of zoning in 2010.'",
        "'speaker_10': 'So before with the map that's on the left, it shows how the parcels were previously split with 90 Galapagos being A to the West and 620 West first being be to the east. After that time, the then owner adjusted the parcel line through an assessment, through assessment and sold parts of the parcel separately but did not do'",
        "'speaker_10': 'a zone lot line adjustment with it with the Development Services Department. So what happened was it changed the parcel lines which are shown in red to what you see on the right hand side afterward today. So a is 90 Galapagos and includes the surface parking that goes all the way to the alley b is 620 west first'",
        "'speaker_10': 'avenue includes the four unit residential and surface parking behind it, but the zone lot lines remain the way they were before. So what? So the result is that on the parcel A that one parcel owned by one owner is actually split into two zone lots at one part, one zone lot, and then a portion of another zone'",
        "'speaker_10': '. What if they were to rezone? They could do a zone lot amendment to conform their zone. Lots to their parcel lines would be separate from each other, but because the area marked and B to the east is zoned for 2.5, it has a minimum zone lot area of 6000 square feet.'",
        "'speaker_10': 'So in the urban rowhouse 2.5 story zone district, there's a minimum lot area and they cannot amend. There's a lot below the minimum allowed in the zone district. If they were to rezone to a different district that didn't have that minimum lot area, they could amend their zone lot and then be separate from each other.'",
        "'speaker_10': 'And so that's why they're here requesting to rezone the property. A And on all of the rest of this half block are already zoned. IMX three has the industrial mixed use three storey zone district. The requesting to rezone the B portion of the property into that same IMX three zone district that the rest of the half block'",
        "'speaker_10': 'already serves. And and importantly, the IMX three zone district does not have a minimum zone lot size. So if they if this rezoning were approved, they could then amend their zone lot to conform to their current parcel boundaries, be separate from each other for zoning purposes, and not have to need the other's permission for coming in and'",
        "'speaker_10': 'getting his own permit to build a fence or whatever they may do in the future on the property. Again, there's no current development proposal. The IMAX three zone district does allow industrial, commercial and residential uses up to three stories in height.'",
        "'speaker_10': 'There are also protected district standards in the building form standards that relate to this property because it is adjacent to the yards, 2.5 to the east. So here's a map of of that zoning. Already you can see the balance of the half block IMX three to the east and to the north is that urban real house 2.5'",
        "'speaker_10': 'zone district. As you move further to the west, closer to the railroad tracks, it grows in industrial character, stepping up to IMX five on the map and then into our more general and heavy industrial districts. As you move further to the west and south to the north and east is a solidly residential rowhouse neighborhood.'",
        "'speaker_10': 'There also is on the Galapagos Street block, some old code zoning that's similar in nature in terms of allowing commercial mixed uses. If you look at the existing use pattern, again to the north and east, it's pretty solidly residential.'",
        "'speaker_10': 'As you move south and west, you find some office and commercial and industrial mixed in with multi-unit residential. Terms of building form and scale, this area is generally 1 to 3 stories in scale. You can see the the photo two at the top shows some two story homes located east of the subject property.'",
        "'speaker_10': 'The subject property is shown in the middle photo. That's the two storey four unit building that's there. The lower photo shows the one storey 90 scale office and to the right are three storey multi-unit residential that have been built just to the south.'",
        "'speaker_10': 'So in terms of process, this application began about four months ago and we provide a notice of receipt of the application on June the first at a planning board public hearing in August, proceeded to Neighborhoods and Planning Committee on September 2nd and has its final public hearing tonight.'",
        "'speaker_10': 'For public comments. We received only one on this application that was received from the Baker Historic Neighborhood Association Register Neighborhood Organization, who had a meeting of their full general membership, voted to recommend approval of this application, and no other comments have been received.'",
        "'speaker_10': 'The Planning Board held a public hearing on August 19th to consider this application and after testimony from the applicant, the unanimously recommended its approval. So I'll, I'll browse through the five review criteria which do apply. The first is consistency with adopted plans.'",
        "'speaker_10': 'We have comp plan 2000. We have Blueprint Denver. And importantly, there's a small area plan adopted since the time of Blueprint Denver, the 23 Baker Neighborhood Plan. So first, turning to the citywide comp plan 2000, as we've explained in further detail in the staff report, we do find it's consistent with many of the strategies in comp plan'",
        "'speaker_10': '2000, including enabling and promoting mixed use development, encouraging quality infill development in a way that's compatible with surrounding character of the neighborhoods. So we find it consistent with that plan. Blueprint Denver, adopted in 2002, identified a different plan direction than the later Baker Neighborhood Plan in 2000 to identify this entire block as single family duplex, which are'",
        "'speaker_10': 'areas moderately dense and primarily residential, but with some complementary small scale commercial and in it identified this area as an area of stability where the goal is to identify and maintain the character of the area. You can see the Blueprint Denver map.'",
        "'speaker_10': 'I created the the transition from stable residential to area of change, industrial and employment and mixed use right along Galapagos Street. Both of the streets at issue here are residential in nature. First Avenue's a collector street Galapagos and designated local.'",
        "'speaker_10': 'But the 23 Baker Neighborhood Plan provided a refined direction from the direction that we had previously had in Blueprint Denver. So the site here is shown in the yellow dashed line and the heavy blue dash is the historic district again.'",
        "'speaker_10': 'But you can see in the Baker Neighborhood Plan that the direction for both area of change, stability and for land use has changed. So it following the small area planning process it was the neighborhood in the in the area plan adopted by council identified that both sides of galloping go would be an area of change comprised of'",
        "'speaker_10': 'residential and office and a blend of uses from the residential area, which is the yellow area to the solidly industrial area, the blue area to the west. So in both respects, the Baker Neighborhood Plan changed the area of change designation as well as the land use designation supporting a mix of residential and office on both sides of'",
        "'speaker_10': 'Gallup ago, which is reflected in the current zoning. The goals articulated for that area of change directly address this this rezoning request. Again, it's about creating a logical change between the residential to the east and the heavier industrial to the West, providing a range of office and residential uses that allow property owners flexibility over time.'",
        "'speaker_10': 'It does specifically call for reinvestment in the light industrial and commercial properties in this area, and that we should support rezoning applications that allow for a mix of uses. So all these goals from the Baker Hood Neighborhood Plan in 2003 were pointing to a solution that we have on the books today, like our IMX three industrial mixed'",
        "'speaker_10': 'use, three storey zone district. So we do think the application is consistent with the Baker Neighborhood Plan. It also would be uniform in its respect to rate district regulations as as the same regulations would apply as they do to other annex three zoned districts.'",
        "'speaker_10': 'And it furthers the public health, safety and welfare, primarily through the implementation of the city's adopted plans. Here, the change that just provides a justifying circumstance for the rezoning is the change of an ownership that's resulted in the current situation that the property owners have with the split zone.'",
        "'speaker_10': 'Zone lot, as well as recent development on Galapagos Street, has actually reinforced the character as identified in the Baker Neighborhood Plan, with three storey residential and mixed use development that that all support that this kind of continuation of the rest of the half block in the IMX three zone district.'",
        "'speaker_10': 'So we do find that there's a justifying a circumstance for the rezoning. And then turning to consistency with the neighborhood context zone, district purpose and intent statements. The IMX districts are designed for a more urban context where you have a rectangular street grid and to provide a transition from mixed use in I.A. and IP areas while accommodating'",
        "'speaker_10': 'a variety of uses. And then specifically IMX three is for an area for with local or collector streets and where three stories is desired. And really, this this area seems like the perfect fit for that kind of a context, description and zone district purpose in intent statements because it already contains that mix of uses.'",
        "'speaker_10': 'Three stories is the character of the area and there's already IMX three zoning on the rest of the block. So we do think that the site and the rezoning request are consistent with those statements. And so having reviewed against all five criteria, we find that all have been met and the staff recommends approval.'",
        "'speaker_2': 'Thank you. We have one speaker, Enrico Cascio.'",
        "'speaker_4': 'Good evening, Mr. President, and council board members. I mean, there is there is very little I can add, really, given this very comprehensive presentation that I did. I mean, I think what I like to stress is that really for us, the need is is to to to be able to get these two owners to not be dependent'",
        "'speaker_4': 'on on each other. And that was the main reason why we we started this process. I'm not really fully understanding how much work it was going to entail. But so, I mean, I'll be really happy to address any question you may have otherwise if if there are no questions that I would kindly ask you to, to support'",
        "'speaker_4': 'this request. Thank you.'",
        "'speaker_2': 'All right. Now time for questions from members of council. Any questions from members of council? Councilman Espinosa.'",
        "'speaker_4': 'Just for you, Councilman Brooks, I would like to speak to Tim. Or not. Tim. Abe. So I'll.'",
        "'speaker_2': 'Keep going. You'll get it.'",
        "'speaker_4': 'Right? Right. See, it's not just you, Kyle. The what is the minimum? And this is sort of not relevant. But you said there is no minimum zone lot for I am x three. What is the minimum lot sizes in order to reason time x three?'",
        "'speaker_10': 'There's no minimum area to Arizona. Wow.'",
        "'speaker_4': 'So a two by two square foot I mean a four foot square foot parcel could be mean. A zone like could be created and imx three.'",
        "'speaker_10': 'That's theoretically possible. That's right. Yeah. You know, in this case, there wouldn't be a minimum even if there were a minimum, because they're zoning to the center near adjacent to the minimums wouldn't apply. Even if there would be if.'",
        "'speaker_4': 'There wasn't, there would be the 6000 square foot or what is there? There's no minimum.'",
        "'speaker_10': 'There is no minimum for the mixed use districts.'",
        "'speaker_4': 'No, I'm asking that because that it's a flexible zone district and it's something that I might want to consider elsewhere. Then the last one. You referenced the change in ownership as sort of the Article 12 trigger for change of conditions.'",
        "'speaker_4': 'That is not a hardship in the eyes of the Board of Adjustment, but it is a hardship in the eyes of CPD because, I mean, where does due diligence in that process sort of play into play a role at this level?'",
        "'speaker_10': 'So yeah, the change in ownership is one of the justifying circumstances that we identified, one of the changes that we found that apply to this property. A rezoning does not have to meet the hardship criteria of a variance.'",
        "'speaker_10': 'And so it it's not the same as the hardship that a board of adjustment can.'",
        "'speaker_4': 'I'm just saying that because you didn't state it in your testimony, but it was the word hardship in the connection with this change of ownership as a hardship was in the presentation.'",
        "'speaker_10': 'Sure. Yeah, yeah. The property owners definitely are experiencing this as a hardship as it makes it difficult for them to do work. It's not the same as needing to meet the hardship criteria for a variance in the code though.'",
        "'speaker_4': 'Okay. Yeah. Thanks.'",
        "'speaker_2': 'Thank you, Councilman Espinosa. Councilman Flynn.'",
        "'speaker_0': 'Thank you, Mr. President. Kyle. Just a quick question. I saw in the presentation that Baker has started Neighborhood Association voted to support this. No other comments were received, but I didn't see anywhere in here what other neighborhood associations were notified of this.'",
        "'speaker_0': 'Are there any other nos other than ANC and Denver Neighborhood Association that cover this particular area and were they notified?'",
        "'speaker_10': 'Sure, yeah. All of the registered neighborhood organizations that claim territory within 200 feet of the property were notified 21 days in advance of this hearing, as well as the other hearings and public meetings. So in addition to ANC and the Denver Neighborhood Association, the Baker Historic Neighborhood Association, Santa Fe, Santa Fe Drive Redevelopment Corporation, and the Denver'",
        "'speaker_10': 'Urban Resident Association, which is a new citywide organization, were all notified.'",
        "'speaker_0': 'Thank you. That's all.'",
        "'speaker_2': 'Thank you, councilman flynn. Catherine that follows you back up.'",
        "'speaker_4': 'Kyle, while you're up here. I do want to apologize to you directly because as soon as I'm sort of reflecting on like I have two Baltimore pictures flashing in my head, I'm like, there's no resemblance that I'm very sorry for for uttering their name.'",
        "'speaker_4': 'So thank you so much.'",
        "'speaker_2': 'Thank you, Catherine. Any other questions? CNN public hearing is now closed. Time for comments. This is in seven. So this is this is it. We had council Councilman Clark. It says Brooks on the script. I knew that wasn't right.'",
        "'speaker_2': 'Councilman Clark.'",
        "'speaker_0': 'Thank you, Mr. President. You know, I think this. Thank you for the presentation. I think this clearly meets the criteria for a rezoning and also cleans up our zoning in this area and provides these homeowners with the opportunity to exercise their right as homeowners to act independent of one another.'",
        "'speaker_0': 'And so for that, I will definitely be supporting this tonight. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Clark. Councilman Espinosa.'",
        "'speaker_4': 'I just wanted to. I spared my colleagues the sort of my comments on the last rezoning. But on this one, I just wanted to sort of emphasize that this is a this is a 40 a pretty flexible zone district with some pretty interesting development requirements next to a protected zone district across the alley.'",
        "'speaker_4': 'And and with the sort of combination of what they're asking for and the small area plan that's in place, this is sort of, to me, an example of when it when all the things that are in place to sort of support a rezoning without a sort of future plan, this is this is this is how it in'",
        "'speaker_4': 'my humble opinion, it should be done.'",
        "'speaker_2': 'Bank Accounts mechanism. Any other comments? 615 as amended. Scene? None. Madam Secretary. Roll Call.'",
        "'speaker_5': 'Clerk I. Espinosa.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Flynn, I. Gilmore, I. Cashman I can eat. Lopez. I knew Ortega. Sussman Black eye. Brooks. I miss Mr. President.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Madam Secretary, please, for the vote in the results. 3939 615 as amended has passed no pre adjournment announcement seen no other business before this body. This meeting is adjourned.'",
        "'speaker_6': 'Denver eight TV's Your City, Your Source.'",
        "'speaker_1': 'Denver eight. On TV and online. To stay connected to your community, your city, your source.'"
    ]
}