{
    "Proclamation for the National Western Stock Show and CSU Spur Campus.": [
        "'speaker_0': 'We're not seeing any other hands raised. And so we're going to go ahead and move on this evening. There are no presentations. There are no communications. There is one proclamation being read this evening. Councilmember Ortega, will you please read Proclamation 22, dash zero zero for one, please.'",
        "'speaker_0': 'Yes, ma'am. Be happy to do so. Proclamation 20 2-0041. Welcoming the 116th National Western Stock Show, Rodeo and Horse Show to Denver and celebrating opening of the CSU Spur campus as part of the Reimagine National Western Center. Whereas, the 116th National Historic Stock Show, Rodeo and Horse Show opened in Denver on January the eighth.'",
        "'speaker_0': 'And. WHEREAS, National Western structure celebrates the Western heritage of Denver in Colorado and showcases the diversity of Western culture throughout through the Mexican Rodeo Extra Extravaganza and the MLK Junior African American Heritage Rodeo. And where, as National Restaurant Stock shows, Colorado State University and the city and county of Denver are building a new campus at the National'",
        "'speaker_0': 'Western Center and have engaged the adjacent Globeville, Elyria, Swansea communities as neighbors and partners and where, as the new National Western Center is taking shape with the opening of the world class Stockyards and Stockyards Event Center, as well as the VTA building, the first of three buildings at the new CSU Spur campus is to be celebrated.'",
        "'speaker_0': 'And. WHEREAS, the campus will be an international center of excellence in agricultural innovation, education, research and technology and entertainment serving the needs of the urban and rural Colorado. And. WHEREAS, National Restaurant Stock Show, known as the Super Bowl of Livestock Shows, attracts more than 700,000 visitors and more than 40 states and 30 countries and contributes $120 million'",
        "'speaker_0': 'to Denver's economy. And. WHEREAS, National Restaurant Stock Show has established a scholarship program for Denver students to educate the next generation of leaders in traditional and emerging fields in agriculture to address local and global issues. And we're as CSU spur focused on education, innovation, research and service to community has partnered with the schools and nonprofits in the'",
        "'speaker_0': 'Globeville, in Elyria, Swansea and Neighborhoods to provide educational programing services in partnership, particularly in the areas of food, health and water. Whereas CSU has created the first scholarship for students from Globeville areas once a year to support their education and any CSU system at any CSU system campus.'",
        "'speaker_0': 'Whereas 2022 will feature over 100 events over the 16 day running, including rodeos for dance animal exhibitions and judging horse shows, children's farmyard and much more. Whereas the National History Stock Show has committed to implement the Public Health Protection Plan approved by the Department of Public Health and Environment.'",
        "'speaker_0': 'Now, therefore, be it proclaimed by the Council, the city and county of Denver that the 116th National Western Stock Show, Rodeo and Horse Show is welcome to Denver, and residents are encouraged to saddle up and enjoy the entertaining and educational events at the show.'",
        "'speaker_0': 'The opening of the Beta Building, the CSU campus's first facility is to be celebrated. And number three, that the clerk of the city and county shall a test and affix the seal of the city and county of Denver to this proclamation.'",
        "'speaker_0': 'And then a copy will be transmitted to the Western Stock Show Association and CSU Spur. Thank you, Councilmember Ortega. Your motion to adopt a move for the adoption of proclamation number 20 20041. Thank you. We've got the motion and the second to move the proclamation to be adopted this evening.'",
        "'speaker_0': 'Comments by members of Council. Councilmember Ortega. Thank you, Madam President. Typically we do this the week before the stock show actually launches. Somewhere in the communications we we missed that. So wanted to get that on our radar. Obviously, with COVID, you know, large crowds.'",
        "'speaker_0': 'The precautions have been put into place. And, you know, it was drawn to some of our attention that there was some language in part of the communication from a national western that said it would be lightly enforced. That has been taken out.'",
        "'speaker_0': 'It's been changed to ensure that the safety of everybody at this event is going to be taken care of. But this is, you know, National Western did not have a an event last year because of COVID. And this year, you know, because there had been more protections.'",
        "'speaker_0': 'Everybody we were assuming everybody is getting the vaccines so that we're we're all protecting each other. But this event really does bring the urban and the rural communities together. It's a great education opportunity, especially for our kids. I don't know if DPS is taking kids out there this year, but for for many inner city kids, they've never'",
        "'speaker_0': 'seen farm animals up front where they can pet some of the small chickens and, you know, some of the the potbelly pigs and other animals that are brought to the event. This really gives our economy a shot in the arm every January when the economy seems to decline somewhat after the holidays.'",
        "'speaker_0': 'And so, you know, those revenues will stream in to our city coffers and help offset the costs of some of our other services that we provide back to the community. I understand Councilman Herndon will be making an announcement that I don't want to steal his thunder, but I think you'll have something fun to share with us anyway'",
        "'speaker_0': '. I just would encourage all of my colleagues to support this tonight. I see Councilman Hines is wearing his cowboy hat. But you know, this this is a fun event. The precautions are being taken. If you have an opportunity to go and take your families, just make sure you mask up and, you know, wash your hands.'",
        "'speaker_0': 'Use the sanitary products to keep your hand sanitized and. We'll all keep each other safe. So. Just hope you all support this tonight. Thank you. Thank you, Councilmember Ortega. We've got Councilman Hines. You're next.'",
        "'speaker_1': 'Thank you, ma'am. I, I, i live. You know, as everyone knows, I live here in district ten, right in the center of the city. And before I forget, I actually got the idea of wearing the hat from Councilmember Black.'",
        "'speaker_1': 'She she did it first. But I actually grew up in a small town in East Texas or acts outside of a small town in East Texas. And I was kind enough to be invited to attend a national Western.'",
        "'speaker_1': 'Go to the National Western facility on Friday. And it reminded me a lot of where I grew up and hadn't really thought about the Expo Center and negative negativities, which had the the rodeo and the socks show for for East Texas.'",
        "'speaker_1': 'But it was a whole lot of fun and brought up a whole lot of memories. So I want to thank the National Center for all you do and and particularly this talk show, because it brought back memories of childhood.'",
        "'speaker_1': 'Good memories of childhood. So thank you so much.'",
        "'speaker_0': 'Wonderful. Thank you. Councilmember Hines, Councilmember Herndon.'",
        "'speaker_1': 'Thank you, Madam President. I want to thank Councilwoman Ortega because I thought about that last week and said, hey, we didn't do the stock show proclamation, so I'm glad that we're able to do it. Sadly, the weather and the cold temperatures didn't allow the parade to happen.'",
        "'speaker_1': 'But excited and moving forward and not not an announcement, but I am I'm very excited that my son C.J. will be mutton busting in this stock show season in a couple of weekends. And he is more excited than I am.'",
        "'speaker_1': 'We've been practicing on some pillows here in in the Herndon household. So we're excited to participate and look forward to that. And I want to wish everyone a great stock show season. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Herndon I wondered what the announcement was going to be and that couldn't be any better of an announcement. What a memory for for both you and him. And so good luck to C.J. on that. I know when they used to when somebody used to win it, you might get some animal like a rabbit or'",
        "'speaker_0': 'a chicken or something. And I think they just give trophies. So thankfully, you're not going to go home with any additional pets. Councilman Herndon, this evening, I am more than happy to support this proclamation as well and will go ahead and follow through with the vote here.'",
        "'speaker_0': 'Madam Secretary, roll call, please. Ortega. I. Sandoval. I. Sawyer, I. Torres. I am black.'",
        "'speaker_3': 'I see tobacco.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Flynn.'",
        "'speaker_1': 'He ha. I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_1': 'I. Can, I. Can. I.'",
        "'speaker_0': 'Can eat. I. Madam President, I. Madam Secretary, close the voting and announce results. 13 Eyes. 13 Eyes. Proclamation 20 2-00 for one has been adopted. We have 5 minutes for a proclamation acceptance. Councilmember Ortega, we'll go ahead and start that five minute timer.'",
        "'speaker_0': 'And it looks like we've got both of your speakers there. And so I'll go ahead and let you introduce them. Yeah. So I want to introduce Paul Andrews, who's the CEO of the National Western Stock Show, and then Tony Frank, who is our CSU chancellor.'",
        "'speaker_0': 'If you walk and if the floor is yours.'",
        "'speaker_1': 'Well, thank you. Members of council, can you hear us okay? We're both in my office. Okay. All right. Well, first of all, thank you. That is quite a moving proclamation. Uh, on behalf of the board of directors of the Western Stock Show Association.'",
        "'speaker_1': 'And I sit here next to Tony Frank, the Chancellor issue, but he's also a board member of the nation of Leicester and stock shall be wholeheartedly accept the proclamation. And thank you for your great dedication to the National Western Stock Show and your great dedication to the City of Denver in these trying times over the weekend we'",
        "'speaker_1': 'had 86,000 people attend in two days for the National Western. I think most of you know that about 60% of our show is outdoors, so we feel very good about what we've done here. Working with Denver Health and the Mass of the Doors, both signage in Spanish and English.'",
        "'speaker_1': 'And I can tell you from personal witnessing, 99% of the people that come through those doors have a mask on that they brought from their their place. And if they forgot it, we've got one for them. So we feel good about that.'",
        "'speaker_1': 'And boy, we're off to a great start. Three nights of PBR bull riding start tonight and the crowds are coming in strong for that. And our rodeo series starts up again here this Thursday night, and our horse shows start up again this Thursday night after the PBR exit.'",
        "'speaker_1': 'So thank you again for all that you do. And let me now turn to my colleague, Tony Frank, so he can tell you all about the CSU buildings that have the grand opening as well. First of all, thanks to all of you for the proclamation.'",
        "'speaker_1': 'Thanks very much for your service to the city of Denver. We're proud to have to have been a longtime partner with the stock show literally since the stock show opened. As Paul continues to remind me. The president of CSU used to pay students a quarter to come to the stock show.'",
        "'speaker_1': 'We no longer pay students to come, but we still love the partnership. We're very proud to be partners in this project. The neighbors of Globeville, Elyria and Swansea have been very welcoming to us, helping us to get on our feet as an anchor institution, and we look forward to being partners there with them for for a very'",
        "'speaker_1': ', very long time. You heard mentioned in the proclamation of the scholarship, which is something we're also very proud of and look forward to expanding. Our Vina building had its ribbon cutting on Friday, its grand opening. It's on Saturday, which is CSU day at the stock show.'",
        "'speaker_1': 'The Terra and hydro buildings will open later in this year. And we hope you'll all have a chance to come out and see these facilities. We think that over their lifetime, they'll make a big difference for a lot of young men and women paving a pathway to college for the next generation.'",
        "'speaker_1': 'Thank you so much.'",
        "'speaker_0': 'Thank you both. Thank you both. Thank you, Councilman Ortega, for sponsoring the proclamation. And Chancellor Frank and Mr. Andrews, we appreciate all of your work on behalf of the stock show and this important event, but then also economic driver for not only our city but the surrounding cities in Colorado and even outside our state.'",
        "'speaker_0': 'And so thank you very much and good luck to all of the rodeo contestants out there and especially C.J. Herndon. We'll be rooting for that little buster as he does the button bustin. All right. Very good. Thank you, Madam Secretary.'"
    ],
    "Second Amendment to Contract with Hensel Phelps Construction Co. for the Great Hall Project at Denver International Airport.": [
        "'speaker_0': 'Under resolutions, Councilmember CdeBaca has also has called out Resolution 21, Dash 1516 for a vote. Councilmember Sawyer has called out Resolutions 21, Dash 15, 16, 15, 17, 15, 18 and 15, 19 for a vote. And Councilmember Hines has called out Resolution 20 2-0005 for comment under bills for introduction.'",
        "'speaker_0': 'No items have been called out under bills for final consideration. No items have been called out under pending. No items have been called out. Madam Secretary, please put the first item up. Council Member State Abarca, would you please put Council Resolutions 21, 15, 16, 21, 15, 17, 21, 15, 18 and 21, 15, 19.'",
        "'speaker_0': 'On the floor for adoption.'",
        "'speaker_3': 'Yes, I move that council resolutions 21, 15, 16, 15, 17, 15, 18 and 15, 19 be adopted in a block.'",
        "'speaker_0': 'Thank you. It has been moved. May you get a second? Second. Thank you. Council Member Sawyer Comments by members of Council on Council Resolutions 15, 16, 15, 17, 15, 18 and 1519. Council Member Sayed Ibaka.'",
        "'speaker_3': 'Yes, thank you very much. I'll be brief. I wanted to go on record not supporting these. These are totaling over $1,000,000,000 for our airport and taking our renovations out to the year 2028. I don't believe that in the last year of this mayor's tenure, it's appropriate to incur that kind of debt for our airport without a comprehensive'",
        "'speaker_3': 'visioning process and without really recalibrating after our last major renovation, which is currently still happening. So that is why I'll be a no on these tonight.'",
        "'speaker_0': 'Thank you. Councilmember CdeBaca. Councilmember Sawyer.'",
        "'speaker_3': 'Thanks, Madam President. I'm also going to be a no on these this evening. Our airport is probably the most financial, most important financial asset we have as a city. We know it's the number one economic driver in the state.'",
        "'speaker_3': 'And it doesn't just serve Denver, it serves the entire front range and the entire region. But just because an airport is incredibly valuable and important doesn't mean they're beyond the oversight of the council. And I do. You know, when I proposed ban on flavored tobacco, we found it appropriate to hold three committee meetings and a public hearing'",
        "'speaker_3': 'talking about the merits of the legislation. The airport is requesting over $1,000,000,000 in additional funding. But a 90 minute committee hearing was all that we had. I was hoping and hoping that we could move to a date certain to delay the contracts for further discussion, but unfortunately was overruled.'",
        "'speaker_3': 'And since then, I've asked the airport a number of questions, and they were answered in a very brief and vague way. So, for example, I asked, why are there only three milestones stated in this contract? The last one is specified to 2023.'",
        "'speaker_3': 'The project is expected to continue until 2028. And the response was they'll be special specified in the individual task orders and be memorialized on the public dashboard. That's not an answer and certainly not one. We're talking about over $1,000,000,000 in contracts.'",
        "'speaker_3': 'So I want to be really clear. I think the airport is a completely worthwhile investment. I believe that we need to finish the security upgrades that we started with great hall phases one and two. And I think given the proper time, these contracts would be worthwhile to approve.'",
        "'speaker_3': 'But I'm very disappointed at the rushed process, the lack of partnership with council and discussions with community, and the cavalier attitude towards $1,000,000,000 worth of funding. And so because of that lack of transparency and accountability in the process, I'm going to be a no vote tonight.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Steuer, we have Councilmember Cashman.'",
        "'speaker_1': 'Next. Yeah. Thank you, Madam President. This is a tough vote for me tonight. When the original Great Hall contract came before the previous council. Councilwoman Ortega, then Councilman Espinosa and myself sought expert counsel from an outside agency to evaluate the contract, but were stopped by our city attorney who felt our actions were outside the scope of our'",
        "'speaker_1': 'charge as council members. Since that time, voters have given us the power to seek professional services as needed. And I believe these contracts are just the type of situation that was being considered when we were given that authority.'",
        "'speaker_1': 'As a couple of councilmembers said to me recently, It's a great idea. I wish you'd have raised it two months ago. Well, I believe it was a good idea then. I think it's a good idea now. Now it's an opportunity missed.'",
        "'speaker_2': 'I do believe the bulk of the work proposed in this contract makes sense.'",
        "'speaker_1': 'And I actually believe we have a good team in place that ten airports are cities unto themselves and the numbers on work that needs to get done do get large. But while these large scale design construction contracts are far less convoluted than the former 34 year public private partnership, this is a $1 billion plus deal that I'",
        "'speaker_1': 'think in view of the mess that preceded it, deserves an in-depth look by a fully objective third party. Without that in-depth investigation, I'll need to vote no tonight. Thank you, Madam President.'",
        "'speaker_0': 'And you, Councilmember Cashman. Councilmember Ortega. Thank you, Madam President. So I think everybody knows I voted no on the first contract when it came to us as a P3 deal for some of the reasons that were spelled out by Councilman Cashman, but for a lot of other reasons in terms of just not sharing the budget with us'",
        "'speaker_0': '. We were, you know, unless we actually signed a non-disclosure agreement and met in a. One of our conference rooms on the fourth floor City Council. And you had to know what question you were asking. We never saw the full budget.'",
        "'speaker_0': 'That is completely different from this time around. And the information that was shared with us was was by the applicant themselves, the contractor, not by the city folks, although we did have some a couple of people from the city in the room.'",
        "'speaker_0': 'So this is a whole different process from what we went through last time around on the first phase. And, you know, once it was approved by council to move forward, I supported the project getting completed and getting us at a place where we get it right.'",
        "'speaker_0': 'Obviously, you know, what has happened has has occurred. I do know and Councilman Flynn, you may want to talk about this, that the airport has committed to coming back and walking through, you know, the lessons learned and and just, you know, helping us understand exactly what happened and why it went south.'",
        "'speaker_0': 'But we have a project that was promised to the public that part of addressing the safety and the security of moving the TSA check in from level five up to level six was going to happen. And right now we will have we have a hybrid.'",
        "'speaker_0': 'We have half of that traffic down on level five and the other portion of it on level six, I believe we have to complete it. Yes, it is a big, expensive price ticket. I've had the opportunity to meet with our bond counsel and our legal advisor to the airport.'",
        "'speaker_0': 'They do an incredible job working with our team and I am very confident that the safety precautions in looking at the fiduciary responsibilities of our airport have been thoroughly looked at and address both with our external experts as well as our internal folks that run and manage our airport on a day to day basis with the number'",
        "'speaker_0': 'one focus always being safety and security and being the best functioning airport that keeps our cost per employment, you know, low and we're right in the middle even with this package and the refinance that's going to come back to us in 2022.'",
        "'speaker_0': 'We're still going to be right in the middle of where all the other airports are. So this doesn't like tip the scales to the point where our airport is no longer affordable to the average non-business traveling public. And those were some of the questions that I have asked of our legal advisors.'",
        "'speaker_0': 'I did share with all of you the questions that I asked and the answers that we got back. And after going through that process again, you know, not having had that opportunity the first time around to really see the budget and to understand the implications to our airport and to the city, I feel like they've done a'",
        "'speaker_0': 'thorough job in addressing that. So I'm comfortable with this moving forward tonight. The last thing I would say is at any time council can ask them to come back and give you regular updates of exactly what's happening with the progress of the project and not wait for milestones to occur.'",
        "'speaker_0': 'Council has that that right to ask the agency, as we do with any of the agencies, to come in and tell us what's going on. So, you know, lots of jobs in the meantime are are created for folks, both, you know, the construction jobs and then the permanent jobs that will will be part of that because we'll'",
        "'speaker_0': 'have more concessions that will be back in in the main terminal. But in general, I think this is important for the city. And when you look at what we're spending on this compared to what other U.S. airports are spending right now to do upgrades and expansions where, you know, we're right on target to be doing what we'",
        "'speaker_0': 'need to do to not only address the safety problem, but at the same time be able to address some of the the maintenance within the Great Hall that need to be done as part of this process. So thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega, Councilman Flynn, you're up next.'",
        "'speaker_1': 'Thank you, Madam President. One of the keys for me in moving this forward in the first place was the commitment from Manager General. What do we call an executive director is called manager of aviation. So Washington is commitment to to produce a public.'",
        "'speaker_1': 'Lessons learned report in a short term 90 to 120 days after that committee meeting because I was hesitant to move forward without a complete and public accounting that of of what had happened to the P-3. I want to thank Councilwoman Ortega for pretty clearly outlining the situation at the airport right now.'",
        "'speaker_1': 'It's a mess. It's a mess. And the failure of the P three left it a mess. Of no vote on his contract is a vote to keep it a mess. And I believe we can't do that. I regret that we have to undertake it in the way we have.'",
        "'speaker_1': 'I regret that the P-3 failed, but we can't leave our kitchen renovation halfway done and the additions to our house, which are just the foundation. It simply has to be completed. And the way forward, I think, has been very transparently outlined by the airport management.'",
        "'speaker_1': 'Any member of this council could have had any number of of briefings, see the numbers, see the process. The reason that there are that there are milestones when they go out to 2023 was answered by airport staff in their memo back to us that that said because it's being designed in phase three, the design is not done'",
        "'speaker_1': '. You can't establish milestones for for design that isn't yet done. Hensel Phelps Contractor Principal one Here is a CMG C, what they call CMG C Construction Management and Construction Manager, General Contractor. I'd say it's a very successful method under which Hensel Phelps will probably self perform very little of that $900 million, but they will oversee bid packages'",
        "'speaker_1': 'as the design is done. They will be competitively bid outwork our our construction community. A lot of companies that need work at disadvantage companies, minority women owned companies are going to get the opportunity to bid. The airlines are asking for this.'",
        "'speaker_1': 'And frankly, an airport that was designed for 50 million passengers with only 40% of them going through the terminal, is now dealing with 69 million passengers in 2019, 60% and more of whom are going through the terminal. We are over twice the design capacity.'",
        "'speaker_1': 'We have passengers over twice the design capacity of the gypsum terminal. It's simply a mess. If you were out there from 1995 until as I said last week, until 19 guys with box cutters changed our aviation world, you were out there in those opening years.'",
        "'speaker_1': 'You know what that terminal looked like. That's what it needs to be. Again, this gets us there. I'm comfortable with the with the contract now. And I wanted to thank Phil and his team for answering every question that council had on.'",
        "'speaker_1': 'I think it's been very transparent and I ask that that my colleagues support this contract. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Flynn. Councilmember Hines.'",
        "'speaker_1': 'Thank you. Council President. I have a few quick points. You know, after 26 years, any project needs some significant maintenance work. And other airports like JFK have $10 billion in bonds underway. We're lucky that Dennis is in there and is a smaller price tag as it is, particularly since we haven't done any major renovations in that time'",
        "'speaker_1': 'other than the four of Project and Ferrovial obviously started. They commenced their construction in an interesting spot and when they exited, it made it difficult for us to accomplish the project, particularly what we said to the people this obviously before my time, but what we said to the people we were going to do and that was, as'",
        "'speaker_1': 'Councilmember Friend mentioned, people with box cutters. We want to make sure that security is is maintained in our airport. And our airport was designed before those box cutter folks made us realize that we needed additional security in our airports around the world.'",
        "'speaker_1': 'We have already outgrown our airport. As Councilmember Flynn said, we're the third busiest airport in the world in 2021, and we need to make sure the airport is ready for that continued growth because we're just going to get busier.'",
        "'speaker_1': 'And I also want to make a note that the airport has its own bonding authority as an enterprise of the city. So I know constituents have reached out about why don't we use that bond money for housing or transportation.'",
        "'speaker_1': 'Well, I agree. We need more investment in housing and transportation. We can't do it with airport funds. The bonds for the airport can only be used for the airport. And then I just want to say the last thing, you know, we're removing a third party from the driver's seat and placing the airport there.'",
        "'speaker_1': 'So as Councilmember Flynn also mentioned, this is no longer a P3. This means that we have an opportunity for additional oversight and an opportunity to hold Denver employees as an DEN leadership directly accountable. And of course, we'll be watching for praise for success or, you know, should the project go off track, you know, the appropriate countermeasures.'",
        "'speaker_1': 'So thank you. I will be voting yes. Thank you, Charles President.'",
        "'speaker_0': 'Thank you. Councilmember Hines, County Council Member Sandoval.'",
        "'speaker_3': 'Thank you, Madam President. I have given a lot of thought to this contract. I think it will probably be one of the biggest contracts that I vote on during my time in office. I don't remember working for Councilwoman Montero or Espinosa and then being having the ability to vote on $1,000,000,000 contract.'",
        "'speaker_3': 'So I feel a lot of weight on my shoulders. And I thought about it and I contemplated this. And my predecessor. Councilman Espinosa, was a no vote on the contract because some of the things that Councilman Ortega had mentioned, the change orders, we there wasn't transparency in the contract.'",
        "'speaker_3': 'There is no way to bring the contract forward to fruition unless we got it done. And it was on a third party who wasn't located in the United States after giving it thought about what's best for Denver and what's best for our travelers.'",
        "'speaker_3': 'I think it's important for one thing is we can't just say we're adding four more years to this. I've been asking people in my district when when will that contract, when will the airport be done? And they all think it's going to be done in four years.'",
        "'speaker_3': 'I think it needs to be clear that this will not be done until 2028, 2029, because I don't think that the average person in Denver even knows that timeframe. So I think we need to do a better job again to talk about the extent of this contract and how long it will push it out.'",
        "'speaker_3': 'I like the analogy of the councilman telling me about reports I live in an auction and if I were just to update my kitchen and not update my friend to it would work very well. So I think that the whole entire airport can use an update.'",
        "'speaker_3': 'I was able to use Southwest and I will say it was a great experience. I had an awesome experience. That whole entire new little area is it's welcoming, it's great and it's like Denver needs. So with that, I'll be supporting it.'",
        "'speaker_3': 'Me? Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. And I'll go ahead and round out the the comments here before we vote on it. Ben is in my council district, too, and it is such a massive economic engine not only for the region, but really for Denver residents who work out there.'",
        "'speaker_0': 'And comments that my colleagues have made. I'm right along with those in favor because we need to address the security. We need to look at ongoing remodeling and maintenance that we might need. And then we also need to look at the growth that we're seeing across the nation with other airports, and we need to stay competitive with'",
        "'speaker_0': 'that as well. And so I will be voting in favor of this contract tonight. Madam Secretary, roll call on Council Resolutions 21, dash 15, 16, 15, 17, 15, 18 and 15, 19.'",
        "'speaker_3': 'CDEBACA No. Sawyer Now.'",
        "'speaker_0': 'Torres. I. Black.'",
        "'speaker_3': 'I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_1': 'I. Hi, i.'",
        "'speaker_0': 'Cashmere.'",
        "'speaker_1': 'No.'",
        "'speaker_3': 'Can each I.'",
        "'speaker_0': 'Ortega, I. Sandoval, i. Madam President, I. Madam Secretary, please close the voting and announce the results. Three names.'",
        "'speaker_3': 'Ten eyes.'"
    ],
    "Fourth Amendatory Agreement with Kimley-Horn and Associates for Broadway Bicycle Facility Design.": [
        "'speaker_0': 'Ten Eyes. Council Resolutions 21, 15, 16, 21, 15, 17, 21, 15, 18 and 21. 15, 19 have been adopted. Madam Secretary, please put the next item up for us. Councilmember Hines, go ahead with your comments on Council Resolutions 22, dash 0005.'",
        "'speaker_1': 'Thank you. Council president. This is a talking about the Broadway protected bike lane. I just. I know this is in my district. This is not in my district. I want to thank Councilmember Clark for for allowing me to call this out when I guess I have the purview to call it.'",
        "'speaker_1': 'But anyway, so I did want to to talk in favor of of this contract. I as as people know, I believe we all deserve the freedom to get from A to B safely, no matter how we choose to get there.'",
        "'speaker_1': 'And I'm excited that this early protected bike lane will soon receive permanent treatment. I know that Denver and Dottie specifically are working hard to install bike lanes quickly, and they're using a paint and post method that allows us to do that rapid implementation.'",
        "'speaker_1': 'It also allows us to test bike lane implementations before significant infrastructure infrastructure investment is wasted. In other words, we're making sure we get the curves and angles right. But the best protected bike lane has more permanent infrastructure in place, so it's creates stronger barriers between bikes and cars.'",
        "'speaker_1': 'It's better looking infrastructure that fits in with the look and feel of concrete curbs, concrete medians, etc., and fits better in our neighborhoods as well. It helps. It also helps cyclists feel safe that cars won't sneak into the bike lane, which they haven't, which happens all the time, or delivery vehicles or city vehicles or people dropping off'",
        "'speaker_1': 'passengers. Happens all the time. So finally, I recognize that the best infrastructure goes from people from where people are to where they want to go. So I think it's important that the Broadway protected bike lane continue north from the border of Lucky District seven into District ten.'",
        "'speaker_1': 'What might be called a perfect implementation is if it were to continue all the way through District ten northern border. Thank you. Council President.'",
        "'speaker_0': 'Thank you, Councilmember Hines. All right. That concludes the items to be called out this evening. We're going to go ahead and move on to our block vote. All bills for introduction are ordered published. Council members remember this is a consent or a block vote and you will need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember CdeBaca, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_3': 'Yes, I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in a block for the following items. 2114 5721 1501 2115 4722 1422 522 622 722 822 922 1021 1508 2115 3721 1539 2120 2116 one 1503.'",
        "'speaker_0': 'All right. Thank you. It has been moved. May I get a second? Thank you. Councilmember Hines. Madam Secretary, roll call. Black.'",
        "'speaker_3': 'I see tobacco. I.'",
        "'speaker_0': 'Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Flint.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_1': 'By Hines. I.'",
        "'speaker_0': 'Carson.'",
        "'speaker_3': 'I can eat. I.'",
        "'speaker_0': 'Ortega. I. Stand over. I. Sawyer. I. Torres. I. Madam President, i. Madam Secretary, close voting and announce results. 13 eyes. 13 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass.'"
    ],
    "Rezoning of 8890 East Lowry Boulevard in Lowry Field.": [
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Council member Sayed Abarca, will you please put Council Bill 20 1-1371 on the floor for final passage?'",
        "'speaker_3': 'Yes, I move that council bill 21 1371 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 1-1371 is open. May we have the staff report? And I believe we have Libby. Kaiser from Community Planning and Development. Presenting this evening.'",
        "'speaker_0': 'Go ahead, Libby.'",
        "'speaker_3': 'Yes, sorry it took a second just to be.'",
        "'speaker_0': 'Promoted as a panelist and as an aside as well. I've been having some Internet issues tonight, so if I get cut off.'",
        "'speaker_3': 'Stacey and Zack do have my presentation and I'll try.'",
        "'speaker_0': 'To hop back on on my phone. All right. Sounds good, LIBBY All right, so I will pull up my presentation. Real good. Yes.'",
        "'speaker_3': 'Okay, great.'",
        "'speaker_0': 'So good evening. I am Libby Kizer of CPD. And we're looking at a rezoning request for 8890 East Lowry Boulevard. The property is in Council District five, represented by Councilwoman Amanda Sawyer. And it's near the east side.'",
        "'speaker_3': 'Of the Lowry Field neighborhood.'",
        "'speaker_0': 'The property is located south of the Roundabout at Lowry Boulevard and Yosemite Way. The property is approximately 7.2 acres and includes a private baseball field owned by the high school. And a surface parking lot is also on site.'",
        "'speaker_0': 'The property is currently zoned R four with waivers, which allows a church, park, school or theatrical studio less than 37 feet tall. The applicant is proposing to rezone to the suburban mixed use of five storey district, which would allow a variety of residential, civic, commercial and industrial uses and the general shopfront.'",
        "'speaker_0': 'Drive thru services and drive thru restaurant building forms. The existing zoning, which allows very limited development on the site, is a holdover from former Chapter 59. Adjacent zone districts include B three and oh one, which are also former Chapter 59.'",
        "'speaker_0': 'Surrounding districts from the current code include open space as well as community corridor, multi-unit and mixed use of three and five stories. The site is subject to the Loughery design guidelines, which define development expectations beyond the zoning code and address site circulation and parking, architecture, signage, lighting and landscaping.'",
        "'speaker_0': 'It's important to note that while the assignment x five zone district allows building heights up to five storeys or 70 feet, the design guidelines generally limit building heights to four storeys in the commercial context, which applies to multi-family and commercial developments.'",
        "'speaker_0': 'This means the rezoning would allow a maximum building height of 50 feet, which is 13 feet taller or one storey more than what is currently allowed. The Lowry Design Review Committee is responsible for ensuring these guidelines are met.'",
        "'speaker_0': 'As the site is larger than five acres, staff conducted a large development.'",
        "'speaker_3': 'Review.'",
        "'speaker_0': 'To determine if a large development framework was warranted. Typically, a framework plan is needed if an adopted plan calls for it, and or if future development will require establishing, extending, expanding or otherwise changing the arterial or collector street grid.'",
        "'speaker_0': 'An existing regional stormwater system or accessible park open space while the site is over five acres. Staff determined a large development framework was not required as the existing adopted plan. The Lowery Reuse Plan already specifies land use, urban design and transportation goals for the area.'",
        "'speaker_0': 'In addition, infrastructure needs for the area are mostly constructed, including the transportation network, open space system, water and wastewater lines and stormwater facilities. Furthermore, site specific issues will be adequately resolved through other regulatory processes, including site development plan review, and the applicant has conducted a community information meeting and additional public outreach, as would be required with the'",
        "'speaker_0': 'large development framework process. For context, regarding the immediate vicinity of the site, the areas land use is a mix of public, quasi public, open space office, industrial, multi-unit and single unit use as the top photo shows the of the property, which is a fenced off field.'",
        "'speaker_0': 'The middle photo shows the 55 acre Great Lawn Park to the north and the bottom photo shows additional open space to the south. A three storey office building exist to the northeast across Yosemite Street with the Big Bear Ice Arena, which is estimated to be approximately six feet tall and a three story physical rehabilitation center to the'",
        "'speaker_0': 'southwest along Lowry Boulevard. Throughout the rezoning process, application notifications have been provided according to code requirements. To date, staff has received three letters from the Lowry United Neighborhoods R.A. documenting their evolving position regarding the rezoning. One initially supported the rezoning contingent on the applicant providing at least 10% of the units at 80% of the area median income'",
        "'speaker_0': 'as well as enhancements to the trail along Westerly Creek, west of the subject property and a permanent easement for public use of the trail while the applicant drafted a good.'",
        "'speaker_3': 'Neighbor agreement.'",
        "'speaker_0': 'Documenting these commitments. Lunt declined to sign the agreement based on additional public outreach and limited capacity to enforce the agreement once current position is neutral. Staff has also received comments from approximately 54 individuals expressing concerns that the rezoning allowing a taller building is too intense for the area.'",
        "'speaker_0': 'Redevelopment of the baseball field would reduce open space and obstruct views, and there will be impacts upon the transportation network. In addition, 16 individuals and or organizations have advocated for the rezoning as it will facilitate the provision of senior housing in the Lowry community and will enable the high school to complete capital improvements and provide scholarships and'",
        "'speaker_0': 'additional learning opportunities to its students. All comments have been provided to City Council. Although a good neighbor agreement wasn't executed. The applicant and the Department of Housing Stability have finalized a voluntary housing agreement that ensures 10% of the senior housing units will be provided to residents earning no more than 80% of the area median income.'",
        "'speaker_0': 'The applicant also intends to identify trail improvements and dedicate a trail easement during the site development plan process. Moving on to the Denver zoning code criteria, it must be found that the requested MAP amendment is consistent with these five criteria.'",
        "'speaker_0': 'As a reminder, staff only evaluates the proposed zone district and not a specific development in regard to criteria one. There are three adopted plans that apply to the requested rezoning, including Comprehensive Plan 2040 Blueprint, Denver and the Lowry Reuse Plan, as stated in the staff report.'",
        "'speaker_0': 'The rezoning is consistent with several goals in the comprehensive plan, particularly as they relate to providing more housing choices for seniors to age in place and promoting infill development where infrastructure and services already exist. The proposed rezoning is also consistent with the suburban neighborhood context defined in Blueprint Denver as the proposed S.M. X District facilitates commercial development'",
        "'speaker_0': 'along main corridors near residential areas. As for the future place type, the subject property is designated as other park and open space which are privately owned parks and open spaces, and as such, their use could change in the future.'",
        "'speaker_0': 'Blueprint Denver says that when larger open spaces are proposed to change, this should include a community visioning process. However, staff felt a community visioning process wasn't worn on this site because it's a smaller site, and the Lowry reuse plan already envisioned appropriate land uses for the community.'",
        "'speaker_0': 'When contemplating the consistency of the rezoning with Blueprint, Denver staff consider the surrounding future place types, including community center along Lowry Boulevard and campus to the north. Community Center typically provides a mix of uses in larger and smaller scale buildings, with a height up to five stories.'",
        "'speaker_0': 'While the campus place type tends to be dominated by single institutional uses and are often multistory. In this context, the SE mixed five district is a good fit for the subject property. The rezoning request is also consistent with the future street types defined in Blueprint.'",
        "'speaker_0': 'Denver as Lowry Boulevard is a mixed use arterial and Yosemite is a residential arterial. Mixed use arterials support a varied mix of uses, including retail office, residential and restaurants and buildings are typically multistory. Meanwhile, residential arterials support primarily residential uses, but may also include schools, civic uses, parks, small retail nodes and other similar uses.'",
        "'speaker_0': 'The proposed SM X5 district allowing a mix of uses, including residential, is consistent with these street descriptions as it is intended to be applied to areas or intersections served primarily by collector or arterial streets. Looking at Blueprint Denver's growth strategy, the city generally directs growth to key centers, corridors and high density residential areas that align with transportation'",
        "'speaker_0': 'options. Nevertheless, limited growth is desired in all other areas of the city specifically 10% of jobs and 20% of housing by 2048. They propose, as a mixed five zone district, is appropriate in this growth area as it will facilitate housing for those at least 55 years old, including an assisted living and memory care facility that will provide'",
        "'speaker_0': 'jobs. Furthermore, the proposed rezoning helps implement the blueprints on a policy related to converting former Chapter 59 zone districts to the current Denver zoning code. The proposed rezoning is also consistent with the Lowry reuse plan, which designates the subject property with a mix of three land use categories including residential education, campus and community service, retirement housing and'",
        "'speaker_0': 'managed care facilities such as those proposed for within the residential category according to the plan. The intent is to allow flexibility to respond to market demand within a range of acceptable land uses. New construction is envisioned in addition to reuse of existing structures.'",
        "'speaker_0': 'The rezoning is also consistent with criteria two, three and five, as stated in the staff report, in regard to criteria for the fact the property retained the former Chapter 59 zoning after the city adopted the current Denver zoning code in 2010 is the most applicable justifying circumstance for this rezoning.'",
        "'speaker_0': 'In conclusion, CPD recommends approval of the rezoning request. Thank you, Libby. Appreciate the staff report tonight. Council has received 38 written comments on Council Bill 20 1-1371. There are no submitted comments in favor of the application and 38 submitted comments in opposition of the application.'",
        "'speaker_0': 'All members of Council that are present have certified that they have read each of the submitted written comments. Do any members need more time in order to read all of the written testimony that was submitted? Seen none. Council Secretary.'",
        "'speaker_0': 'Let the record reflect that all written testimony both in favor and in opposition of Council Bill 20 1-1371 has been read by each member of council and all written testimony will be submitted to the official record of the hearing this evening.'",
        "'speaker_0': 'We have 27 individuals signed up to speak and we're going to go ahead and get started. Our first speaker this evening is Matt Overman. And we'll go ahead and have a timer that will show you the last 30 seconds that you have available.'",
        "'speaker_0': 'Please go ahead, Matt.'",
        "'speaker_1': 'And you guys hear me?'",
        "'speaker_0': 'Yes. And we ask that you introduce yourself for the public record.'",
        "'speaker_1': 'Great. Hi, my name is Matt Norman. I'm with United Properties. We are the applicant and developer for the site. We spent the past year here plus working on plans for this site and working with the community's key stakeholders.'",
        "'speaker_1': 'Want to extend a thank you to the community for the time they spent in collaborating with us. They've really helped us make this a better project than it was on day one and special thanks to the city of Denver staff, specifically Libby Kiser with planning and Brad winding with hosts for the time they spent working with us'",
        "'speaker_1': 'on this project. A couple of key points I want to make as it relates to plans for our site. First, we're very excited to provide to what our knowledge is the first age restricted, affordable rental units in Denver, with 10% of those units as affordable units at the 80% rate.'",
        "'speaker_1': 'This site was actually exempt from providing any affordable housing or paying linkage fees due to previous agreements that were in place for Lowry as it relates to affordable housing. But we wanted to go above and beyond, and we heard from the Lowry community that it was also important to them that we had an affordable option with this'",
        "'speaker_1': 'development. Secondly, I want to talk about how we're going to be improving the open space experience based on, again, community feedback. We will be adding a public trail easement along the west side of the site, along an existing path that's there but is on private land.'",
        "'speaker_1': 'We're also adding site improvements to improve that trail experience along eventually creek. This will protect the trail system connectivity between the north and south side of Lowry Boulevard in perpetuity. Important to note that this site's not public open space.'",
        "'speaker_1': 'It's private open space, the field not open to the public. And it was never part of Lowry long term plans that this remain private open space. Third we know there's a lot of existing concerns with traffic and pedestrian activity along Yosemite and the roundabout that have been a focus of the neighborhood neighborhood for several years, more specifically'",
        "'speaker_1': ', the speed with which some vehicles travel through that area. These problems are not a volume problem. They're not significantly impacted with this added development. And Yosemite and Lowry, we're really designed to take these additional traffic flows. So the problems that exist here, our existing issues.'",
        "'speaker_1': 'With that being said, we do want this to be a safe situation for the community as well as our residents. We've held meetings specifically with Dottie in East Park on this topic to discuss these issues. We'll continue to do so and we do want to be part of the solution and taking action on what needed improvements there'",
        "'speaker_1': '. Lastly, just wanted to say what a great use this senior living will be for this site. This use applies to so many of the criteria that are set forth in Blueprint Denver and the other plans and those criteria about the they talk about senior living are in place for good reasons on a high level.'",
        "'speaker_1': 'Colorado has the second fastest growing population of people over over 60 in the nation. So the need and demand for these types of residential and commercial developments is growing at a rapid pace. Most importantly, you know, our communities give senior citizens a place they can really thrive in their later years in life that provides a community of'",
        "'speaker_1': 'people at the same stage of life. And this is really a unique age in place, offering people who live in Lowry and Denver can stay in their community long term. With that, we respect respectfully ask the City Council, approve our application tonight.'",
        "'speaker_1': 'Thanks for your time and will be available for questions.'",
        "'speaker_0': 'And. Q Our next speaker this evening is Marcus partner.'",
        "'speaker_1': 'Good evening, council members. This is Mark. As partner. I am here for questions. I am in support. I certainly can provide some additional background on the community outreach, but I am here for questions. Thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker is Monti force. I believe you're unmuted, Monty. Go ahead, please.'",
        "'speaker_1': 'Yes. This is my fourth. I'm the executive director for the Lowry Redevelopment Authority, and I'm here only this evening, not in support of or against. Just to answer questions about maybe some of the historical background that might be necessary or questions that might come up.'",
        "'speaker_0': 'Thank you. Our next speaker is Phil Workman.'",
        "'speaker_1': 'Hi. Good evening. So, Workman 130 Rampart Way, Suite 225. I'm a Lowry resident of 18 years. Also a proud matchbox parent. Match up is a. Or your high school that has a diverse population of students throughout the entire city, every council district in the city and county of Denver.'",
        "'speaker_1': 'We conducted a community outreach for the proposed rezoning where we conducted over 35 community meetings and many more individual meetings with neighbors and stakeholders. These include small group meetings as well. Specifically, one East Park neighborhood. Larry Business Alliance.'",
        "'speaker_1': 'Larry Design Review Committee. Larry Redevelopment Authority. Although we are still dealing with COVID, we have some of the meetings in person and a majority via Zoom. Those virtual meetings were also made available for review by the community. We utilize social media, physical posting of the property, certified mail and social media, and a combination of certified mail and'",
        "'speaker_1': 'fliers as well, and a combination of all of those. And I will admit, sometimes that is still even that is an imperfect side. One of the basic tenants of our outreach strategy or outreach strategy has always been to listen and to respond to the concerns of the community as best as we can, and also to enable a'",
        "'speaker_1': 'process for open communication, not only during the rezoning, but throughout the entire development process in response to the concerns we heard throughout this process. We have addressed community concerns regarding affordable housing, parking, trail accessibility and collaboratively working with the Lowery community and existing issues with traffic and safety.'",
        "'speaker_1': 'And in response to these, we might we are looking to memorialize these agreements, and there will be some discussion here and the future of how we are going about to memorialize those agreements and those things that we have heard as concerns of the community as part of this process.'",
        "'speaker_1': 'Every step of this process has been done in a thoughtful matter with the community in mind from the formulation of the RFP by the Archdiocese and selection of United Properties to the library design review process to the community outreach process and responses.'",
        "'speaker_1': 'And with your support this evening, we look forward to move to the next process, we have already said, for the Foundation for Ongoing Community Engagement. Thank you very much for your time and we would appreciate your support this evening.'",
        "'speaker_0': 'Thank you. Our next speaker is Kaylee Robinson.'",
        "'speaker_3': 'I am just.'",
        "'speaker_0': 'Here to answer questions. Would you mind introducing yourself for the public record? Keely Robinson Norris.'",
        "'speaker_3': 'Design 1101.'",
        "'speaker_0': 'To be an extreme. All right. Great. Thank you. Our next speaker is Dana Hoffman.'",
        "'speaker_3': 'Hi. Good evening, counsel. This is Dana Hoffman. I'm with the Denver Department of Transportation Infrastructure. I'm on the community design team. I'm just here to answer some questions that may come up around transportation projects in the area. Thanks.'",
        "'speaker_0': 'All right. Thank you. Our next speaker is Marco CAVANAUGH. US. And I believe Marco is joining us via telephone this evening. If I'm not mistaken, our producers have Marco's phone number that they can look for. Or Marco, if you want to hit Star nine to raise your hand, we can get you moved in.'",
        "'speaker_0': 'Right. And doesn't look like I'm seeing Marcus in the queue right now. And so we're going to go ahead and move on here. Next, we have Norman Schwab. Norman, please go ahead.'",
        "'speaker_1': 'I am Norman Schwab. I reside at three, two, three Altman way in Denver. I speak on behalf of 80 East Park residents who signed and submitted public hearing testimony on January six. My comments are drawn from that letter.'",
        "'speaker_1': 'We are opposed to the zone. It s2fm you five. We ask the city council one to postpone the recent decision until the developer in residence can resolve the intensity of use, location of uses, buildings and design compatibility to remand the case to city staff to consider the less intensive SMU three zone.'",
        "'speaker_1': 'Given that a floodplain designation, high water table and utility easement constrained development on portions of the site and because surrounding land uses, the existing zoned designations are less than ten, including height and three removed the good neighbor agreement referred to in the Zone Report from the record.'",
        "'speaker_1': 'The developer put this forward, but the Lowry United Neighborhoods Board has not agreed to it. The height allowed by the reason would lead to extremely intensive use of the developable portions of the site. The high water table prevents underground parking.'",
        "'speaker_1': 'Recent developments along Lowry Boulevard is three stories in height. Single family homes along Yosemite way are two stories. Zoning along Lowry Boulevard and nearby is a mix of SW in U five, SMU three and other zones. Most of the zoning limits heights to three stories.'",
        "'speaker_1': 'East Park residents particularly oppose a large four story parking garage putting up against the neighborhood on Yosemite Way and the Sports Boulevard entrance to the regionally significant Lowry Sports Complex Park. What other large park in Denver has a four story parking garage at one of its major entrances.'",
        "'speaker_1': 'Are there any other four story parking garages in Lowry? We believe the answer to both questions is no. The parking garage would create a dead zone for pedestrians and bicyclists on the existing Yosemite sidewalk, an important connector to valued open space and recreation.'",
        "'speaker_1': 'It is not compatible with Lowry plans and design guidelines to minimize the impact of parking on neighboring properties. Lowry has been planned as a walkable, well-designed, pedestrian community. Recent multifamily developments in Lowry have ramped housing units around parking or put it underneath residential units.'",
        "'speaker_1': 'That is not so here. The location and visibility of the parking garage is problematic. The developer has said that it cannot be located elsewhere on the site. Please postpone a decision on this rezoning and remand it to staff for further review.'",
        "'speaker_0': 'Thank you, Norman. Our next speaker this evening is we're going to go back to Marco Cabana. Where was Cabana was. Go ahead, Marco, please. And you're going to have to unmute yourself.'",
        "'speaker_1': 'Good evening. This is Marco Cabaniss with Duty Transportation and engineering supervisor for the Transportation Review Team. So we work in partnership with CPD and and arrange for for the concept plan to get around through the department so that it gets all the, the eyes on it that we want to do a thorough traffic and transportation review.'",
        "'speaker_1': 'So I'm here to answer questions tonight.'",
        "'speaker_0': 'All right. Very good. Thank you, Marco. And we're going to go ahead and move back to our list. Paul Brandus.'",
        "'speaker_1': 'Good evening, city council members and happy New Year. My name is Paul Venice. As an introduction, I served on Denver's Expanding Housing Affordability Committee, as well as the Board of Lorrie United Neighborhoods. R.A. But to be clear, I am here not to represent either organization.'",
        "'speaker_1': 'My opinions are my own. My family has lived in Murray for six years. We live about one mile away from the site in question. The affordable housing crisis is extremely important issue for me. Our family actually moved to Denver from Boulder six years ago, partly due to skyrocketing cost of living in Boulder.'",
        "'speaker_1': 'I believe that the unaffordable housing prices in Boulder are that mostly due to restrictions that the municipality has placed on new development. Denver's population has exploded. Murray needs to contribute to this solution with new housing units that this development will provide.'",
        "'speaker_1': 'Murray also needs a commitment to long term affordable housing for our community that the free markets otherwise wouldn't provide. I'm proud to live in Murray Plan community, where the development of income restricted housing has been a cornerstone of our legacy.'",
        "'speaker_1': 'Mandates for affordable housing are part of the origin story of Lowry, as they were core provisions in the sale of the Air Force base to allocate homeless housing units back in 1994. When I first heard about this development here in Lowry, a group of us raised the issue of ensuring that provisions would be made for allowing low'",
        "'speaker_1': 'income housing units. The developers are receptive to feedback and have worked with hosts to negotiate the affordable unit agreement that you see today. For that reason, I am here to speak in support of the zoning request and believe that it meets all criteria as the developer shared their plans for the property.'",
        "'speaker_1': 'Many voices of opposition to the rezoning and project have come forward, mostly from immediate neighbors who are concerned about traffic views and density. While we may want to point blame to the developer for the developer for not appeasing nearby neighbors, I believe that the root cause of the opposition is due to a broken zoning application process that'",
        "'speaker_1': 'does not require site plans to be submitted in conjunction with zoning applications. The reality is that no one here actually knows the design of the site that will be ultimately built. This is a result of the system of the city has in place, not the fault of the developers.'",
        "'speaker_1': 'That said, the one unique thing to us here in Lori that lets me sleep at night is the fact that we do have a unique ability to control the design of the site design plans. The Lowry Community Master Association is our home and has a Larry Design Review Committee that is comprised of community members, architects and landscape'",
        "'speaker_1': 'architects to utilize a four phase process to evaluate proposed plans. I believe that the Larry Design Review Committee will hold the developer to the high standards that they have held all developers to, and that Larry's voice will be protected and amplified through the Audi RC as it relates to traffic concerns.'",
        "'speaker_1': 'My understanding of recent studies show that traffic speeds and pedestrian volume volumes that did not warrant additional interventions. I do urge you to continue to monitor the traffic condition of the site. Thank you for your time and for the opportunity for us to make a small dent in the affordable housing crisis and approve this zoning request.'",
        "'speaker_1': 'Best wishes to you and your loved ones. See you next time.'",
        "'speaker_0': 'Thank you, Paul. Our next speaker this evening is Ryan Padilla.'",
        "'speaker_1': 'Hello? Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Oh, thank you for your time. I'm here to speak against the rezoning to a mixed five. I personally believe the the site does not lend itself to a high density use. The sewer easement that runs through the property makes it very difficult for the site design to be flexible.'",
        "'speaker_1': 'The floodplain issues on the property in the high groundwater table, if you develop it at a high density, it's going to lead to a large parking garage being required. And having a four storey parking garage in front of a park is an eyesore for the neighbors.'",
        "'speaker_1': 'It's going to. It's I agree with what someone said earlier about the dead space being created along that sidewalk along Yosemite way. And I believe the pedestrian safety. I live at 500 Yosemite way and I have to walk across the roundabout to the bus stop.'",
        "'speaker_1': 'And going in and having traffic coming in and out of the new complex is going to be very dangerous, especially in the winter. I just having a four storey development on that site is not a good idea. I'd urge the Council to reconsider a lower density development due to the site constraints that will not involve a massive'",
        "'speaker_1': 'parking garage right in our neighborhood. I think that will be a for my time. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Morgan Spencer. Hold on one sec.'",
        "'speaker_3': 'Sorry. Okay. Hi, I'm Morgan Censor. I am a library resident and I am speaking in support of the rezoning.'",
        "'speaker_0': 'I have two children.'",
        "'speaker_3': 'In preschool here in LA and I enjoy the opportunity to take advantage.'",
        "'speaker_0': 'Of all of the carefully planned.'",
        "'speaker_3': 'And balanced parks, open space and everything the library reads about the Library Master Association provides.'",
        "'speaker_0': 'I think that this proposed development.'",
        "'speaker_3': 'Is perfect to use without putting in more multi-unit apartment buildings. I wish this resident was residents was open ten years ago for my grandmother who is looking for senior residences and had to go down the Highlands Ranch. And as I continue to grow my family here in Lowry, I think about my parents and having them close by'",
        "'speaker_3': 'and just having this sort of opportunity in this neighborhood, I think would bring a lot of wonderful experiences and not monetary wealth, but wealth to the neighborhood. So I thank you for your time and supporting this rezoning effort.'",
        "'speaker_0': 'Thank you. Our next speaker is Megan Brady.'",
        "'speaker_3': 'Hi. My name's Megan Brady. I'm a resident of the East Park neighborhood in Lowry here. I live just across the street from the proposed development on Yosemite Way, and I am here to oppose it for a variety of reasons.'",
        "'speaker_3': 'I know Norman and Ryan touched on this earlier with the high water table preventing parking beneath the property for residents, which is not in line with the surrounding design of the Lowry neighborhood. As somebody who will be looking at this every day directly at the parking garage, this is a huge concern for me because this is not'",
        "'speaker_3': 'why I moved to the area. I think this will also significantly decreased property values on our side of the neighborhood. The sewer easement in the middle prevents the property from being able to put the parking in the middle to wrap the building around the residences around.'",
        "'speaker_3': 'So again, just limiting the options they have there and in the floodplain on the side of the creek prevents them from building too close to that side of the property, which means this development will be right up against Yosemite Way.'",
        "'speaker_3': 'Adding this number of residents to the neighborhood will significantly increase the density of cars and pedestrians throughout the area, which I think will increase the danger and hazards of an already hazardous intersection due to speed and density. So I am again asking the Council to oppose this rezoning request.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jarrett Lehrer Way.'",
        "'speaker_1': 'All right, I. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'I thank you. I wanted to share there a way. 1300 south to the streets. I am. I actually work for the Denver Archdiocese. And this is a project that I've been working on for a bishop bishop matchup of high school.'",
        "'speaker_1': 'I wanted to thank the council and committee members and the public for allowing me to speak this evening. We started this process nearly two years ago where we met with the CMA and other stakeholders in the community and asked them questions on what would be a good benefit for the community.'",
        "'speaker_1': 'Because we the the baseball field is underutilized. We only use it for practices in the spring. It's very expensive and some games and games for the Loughery baseball team, but it's very expensive to maintain. And the school, which is going on 15 plus years old now, needs significant upgrades in its infrastructure.'",
        "'speaker_1': 'So we decided to pursue a rezoning and selling of this property through an RFP process based on the feedback that we received from and Mary and the stakeholders and the community prior to ever engaging any developers. We had ten developers who submitted on this project and we chose the United Development Team due to their their concept of'",
        "'speaker_1': 'providing senior housing for the community. Because a market study shows there is actually a need for senior housing and living and aging in place and in this community. We thought that it would be the least impactful to the community based on low cars and traffic counts.'",
        "'speaker_1': 'It would also provide jobs because there will be some support with the development's senior assisted living as well as, you know, living, independent living. And we also felt there was a great need for Bishop Match Path High School.'",
        "'speaker_1': 'With the money generated, we could do the much needed infrastructure improvements and provide scholarship opportunities to our students. I think Phil had said this before, but knowing we had 200 plus students that come from all over the Denver metro area, but also in every district in the city of Denver, it's a very diverse student body.'",
        "'speaker_1': 'We also have almost nearly half the students are on some type of scholarship or assistance. So this money would be greatly needed for this for this, for the needs of match both. And I think this is a great addition to the neighborhood having worked in and around the Lowry neighborhood on different development projects for over 20 years'",
        "'speaker_1': '. Thank you for your time and I thank you for your consideration. And I hope that you support this this redevelopment, this rezoning request.'",
        "'speaker_0': 'Thank you. Our next speaker is Chad Crean.'",
        "'speaker_1': 'Hello. My name is Chad Crane and I live at 470 Yosemite Way. I'm opposed to the rezoning of the area, to the zoning that they are requesting. I agree with Norman that it should be looked at as possibly the lower zoning, where it would limit the density of what could be built on this site for the reasons'",
        "'speaker_1': ', again, that have been mentioned, the flood water plane, the amount of density that will bring more traffic, although people seem to say it won't we that live on the street can say with very honest and true opinion that it will bring more.'",
        "'speaker_1': 'And I have some concerns about the safety for people that will be at the park and people that will be living at this center with having a structure on this large on this spot and site. I think that I do commended that they are looking to do this for senior living opposed to other multi-unit housing or apartments'",
        "'speaker_1': ', but I feel that it should be postponed. On making this vote or change until there is better clarification of exactly how this site will be laid out, especially to with the garage site being four stories. Again, as people mentioned, there is nothing else in Lowry that is four storeys high for a garage site for this kind of'",
        "'speaker_1': 'use. If we're going to have something here, let's make it something that blends in with the neighborhood and the surrounding area a little bit better. So thank you.'",
        "'speaker_0': 'Thank you. Our next speaker has been ro henninger. Monroe. You'll have to go ahead and unmute yourself. Monroe HENNINGER. Go ahead, please. Are you there, General?'",
        "'speaker_1': 'Yes. Can you hear me?'",
        "'speaker_0': 'Yes. Go ahead, please.'",
        "'speaker_1': 'I'm sorry. My name is Monroe Manager. I live at seven, six, nine, eight East seven Drive and Lowry in the North Lowry Development. I've been there for over 20 plus years. I'm in support of the rezoning of this for a couple of reasons.'",
        "'speaker_1': 'First, firstly, right now it's a private ballpark. So none of the Lowry residents have access to any of the land or the land surrounding it. My understanding is that with additional trails added to the neighborhoods surrounding there, that.'",
        "'speaker_3': 'We will have.'",
        "'speaker_1': 'Additional places where the whole community can enjoy some of the open space there. Thirdly, as you know, a son in law who's had a.'",
        "'speaker_0': 'Father in law in.'",
        "'speaker_1': 'A nursing home and had to travel great distances every day to get there. And a lot of the residents and Lowry having parents that are reaching the age where a nursing home would be necessary. I believe that having a closest is important.'",
        "'speaker_1': 'And so I'm in full support of this. I hope you do, too. Thank you very much.'",
        "'speaker_0': 'And you. Our next speaker is Stephanie Crane.'",
        "'speaker_3': 'Everybody hear me okay?'",
        "'speaker_0': 'Yes, go ahead.'",
        "'speaker_3': 'All right. Good evening, council members, and thank you for the opportunity to speak tonight. My name is Stephanie Crane and I'm a 12 year resident of East Park. I live it for seven years now anyway. And I will be able to see this new development from my front porch.'",
        "'speaker_3': 'So it's very near and dear. But tonight, I want to focus on the density of this development. In a letter that was dated May 19th, 2021, the developer requested that the LaRouche Design Review Committee approve a variance allowing our buildings to exceed the 45 foot height restriction by up to five feet, to give them the flexibility with'",
        "'speaker_3': 'the final dimension and design of their buildings. I think it's important to note that this now a 50 foot building height that they're requesting, would not include mechanical screening. A building of this height does not fit into the landscape of the East Park neighborhood.'",
        "'speaker_3': 'This parcel of land is currently a baseball field, as many have said. To the far end of the large sports park at Fairmont, and Lowry is a one story office building that houses the Colorado Department of Public Health with ample surface parking lot.'",
        "'speaker_3': 'It would seem out of place to have a 50 foot building as you enter into another residential neighborhood and park. In addition, a building of this magnitude designed to butt up against the sidewalk would provide little to no snowmelt, causing an increase of icy road conditions at an already unsafe roundabout and adjacent sidewalk that's used daily by'",
        "'speaker_3': 'pedestrians, runners and cyclists. The developer has also asked for an increase in parking spaces a lot in one and a half spaces per unit for the adult. I'm sorry, the active adult rental and 0.8 spaces for assisted living and memory care.'",
        "'speaker_3': 'But to me that seems odd that this development would need these additional spaces, given that they have repeatedly stated that many of their senior residents have either downsized to one car and rely on public transportation, or that the memory care residents are not allowed to drive or even own cars.'",
        "'speaker_3': 'So the current parcel of land already has a significant amount of surface, lot space and mature trees that will now be removed to accommodate this large four storey above ground parking garage. We are told that this development will be between 260 and 300 units.'",
        "'speaker_3': 'Seems like the largest Colorado project for assisted living and memory care. I guess my question is why does this have to be so massive given what we know about the parcel of land? We know that there are constraints doing the flood plains, high water table, sewer easement.'",
        "'speaker_3': 'Our biggest concern is this four storey above ground parking structure that will sit right along Yosemite Sports Boulevard. All other parking structures in Florida seem to be two stories within a commercial area of the neighborhood, and they're either underground or wrapped.'",
        "'speaker_3': 'And this doesn't seem to be the case for this particular structure. We do understand that loan land zoning changes occur and we're not against this particular development, but it is extremely severe and it doesn't fit within the current landscape of the community.'",
        "'speaker_3': 'So I'm just asking you to please reconsider what you plan on.'",
        "'speaker_0': 'Allotted for each speaker. We're going to go ahead and move on to our next speaker. Leo Nyholm.'",
        "'speaker_3': 'Okay. I have to go. Good evening. My name is Jarrell Nyholm. I live at 8031 East Bay Avenue. I've been a resident for a little over five years. Thank you for your time. And I would like to express my support for the project.'",
        "'speaker_3': 'As an architect and a resident. I am fully in support of a variety of types of resident residential and uses. Excuse me, in the neighborhood. And I believe that the senior living is needed. And I think it's perfectly located because it's close to transportation and it's close to parks.'",
        "'speaker_3': 'And in addition to that, I fully trust, I think it was Paul that mentioned the Larry Design Review Committee, and I fully trust their professional standards as residents or as additional opportunity for input. And I believe that that particular process hopefully will address the concerns of some of the residents have.'",
        "'speaker_3': 'That's all I had. Thank you again for your time. I appreciate it. Have a good night.'",
        "'speaker_0': 'Thank you. Our next speaker is Julie Zimmerman. Okay. It looked like we had Julie in the queue. Well, there we go, Julie. Julie Zimmerman, we'll have to have you go ahead and meet Julie.'",
        "'speaker_3': 'Sorry. Can you hear us?'",
        "'speaker_0': 'I'm sure I can hear you, Julie. Go ahead.'",
        "'speaker_3': 'Please. Thank you so much. Thank you very much for having us. Meaning we appreciate all of you. I I live at 520 Yosemite way. We are the second home in from Yosemite and fifth avenue. So we were the second home essentially built in this part of Larry East Park.'",
        "'speaker_3': 'And we live across the street directly from this new build as it we very much oppose the development of this. And I would like to show that primarily people who are in support of this do not live in East Park.'",
        "'speaker_3': 'As far as open space, there is one block of open space I think is very important that the city council understand that it is one block basically that they are seeing. The developer says that they will make this wonderful place.'",
        "'speaker_3': 'It's not a huge area. It's a block. You can come and look at it within by you. It's beautiful, but it's not a big space. I think it's an area in which they are willing to acquire some development, productivity and money to do this.'",
        "'speaker_3': 'As far as a senior community, there was one closed at Lowry Boulevard, which was replaced recently with, I think, alas, I don't know how you say it, Alice or Glass or whatever in that multi unit rental property is.'",
        "'speaker_3': 'So it seems to me very much this is about money. Finally, as far as community outreach, primarily they reach out to people within 200 feet of this building. We are the second closest home to this property that is being proposed to be built up by Matt and his associates.'",
        "'speaker_3': 'And we received a flier, as they say, but due to work, we're unable to make that meeting. But they did not. They, despite what they say, there has not been a big outreach as far as traffic and the decrease in travel between those 55 and up.'",
        "'speaker_3': 'I will be 55 on Saturday and I have a 13 year old, so I travel plenty and I have parents who are approaching 80 who live in East Park as well, not with us than in a different single home unit.'",
        "'speaker_3': 'And they travel all the time, including picking up our children because we both work as far as multi residential to the woman who commented on this is a good use. There are 300 plus units scheduled to be on this.'",
        "'speaker_3': 'So thank you to you as a preschool teacher. I so appreciate you. I can't even tell you how grateful I am, but this is not a good use of a property directly across from our home. As far as match clubs we agree, we support Match Local.'",
        "'speaker_3': 'We have a son who went to Regis. We agree in the tradition of that type of education. But I will tell you that other people can purchase can purchase this property.'",
        "'speaker_0': 'Truly, that's the time we have a lot of outreach. Speaker We're going to go ahead and move on to our next speaker, Greg Ryan.'",
        "'speaker_1': 'Hi. Good evening. This is Greg Ryan. I'm in support of this rezoning. I've lived in Lowry for a little over five years now. I moved here in 2016. I first lived off of Lowry Boulevard for about four years, and then earlier this year moved a few blocks north at 1028 Tamarack Street.'",
        "'speaker_1': 'So still a little bit further north. You know, I appreciate the opportunity to live in the city and county of Denver's place is great, really. You know, there's a lot a lot of good stuff going on here. There's a diversity of housing mix in Lowry, and I like that.'",
        "'speaker_1': 'You know, I formerly lived in like a condo and now I'm in a more of a single family home. So, you know, I do appreciate the diversity housing mix and the addition of a senior living residence is perfect for the mix of Lowry and kind of the southeast Denver neighborhood or, you know, just part of the city'",
        "'speaker_1': '. So I hope you can join me in supporting this project. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Scott Zimmerman.'",
        "'speaker_1': 'I know that.'",
        "'speaker_0': 'We can, but we might need you to mute another device there. Scott, I think we've got an echo. Go ahead and try it again.'",
        "'speaker_1': 'Sorry about that.'",
        "'speaker_0': 'There you go.'",
        "'speaker_1': 'All right. Is that better?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay. So I also live at 520 Yosemite Way. And I just wanted to echo a lot of the points that have been made in terms of opposition to this project. I would reiterate that there was a previous senior living facility to the west of where we live and to this proposed development that failed and went under.'",
        "'speaker_1': 'And we also currently have one senior living development called Brookdale, which is in the Lowry Central area. So I'm not entirely sure why we need a second facility. I think that I would reiterate that a lot of the people that are really for this don't live here and will not have to see this every day as they'",
        "'speaker_1': 'drive by it, or just look out their front porch to see this kind of monstrosity of a four storey parking building. I think that the development plan is a little bit disingenuous when they talk about specifically Matt Warman community outreach because we received one flier over the course of two years and other people have talked about social'",
        "'speaker_1': 'media and other community notifications, but a lot of the notifications were through the LC or the Lewellyn and other redevelopment properties which we have no stake in or ability to receive notification. I think that this is an ill conceived project and I think it's being kind of rammed down our throat.'",
        "'speaker_1': 'We understand the plight of Matchbox, but there are other people who will be willing to purchase this property for other mixed use development that doesn't result in the current plan. I have not seen any reference to the Dotti study on traffic, so I can't really comment on that.'",
        "'speaker_1': 'And I was actually quite surprised that they said it's not a really big deal because I witnessed this traffic every day. And I think that the overwhelming sense of the community is that we have not been included in this, irrespective of the developer's notifications or at least attempted notification.'",
        "'speaker_1': 'We didn't really hear about this whole thing until I think, Oh, there was a flier in May and then we had a meeting back, I believe, in December, and that was the extent of their notification. So as you can tell, I'm not in support of this.'",
        "'speaker_0': 'All right. Thank you, Scott. Our next speaker this evening is David Andrews, and I believe David is joining us via phone. And we're going to go ahead and get a manicure. Oh, go ahead. Go ahead, David.'",
        "'speaker_1': 'My name is David Andrews. I'm a resident of Lourey and I want to support this project and the proposed estimates. Five reason. First, because it provides jobs which are so needed these days it sits on arterials, so its traffic impacts should be de minimis.'",
        "'speaker_1': 'Despite other assertions. It's consistent with the reuse plan with Blueprint Denver. It provides affordable units. And as a former employee of the Lowry Redevelopment Authority, I can tell you that this was always private, open space and never in the calculus to remain open space throughout the master planning.'",
        "'speaker_1': 'In addition, there's the old CRC, which is going to ensure that what, however the site plan moves forward, it is responsible and fits within the context. In short, I support the project. Thank you for your time this evening.'",
        "'speaker_0': 'And cue our next speakers, Jesse Paris.'",
        "'speaker_1': 'Yes. Good evening, members of Council.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Yes. My name is Justin Paris. The number of positive for black stocks and more for self defense positive Mexican mafia social change as well as the Unity Party of Colorado and the East Denver Residents Council front frontline black males and I'll be the next November 2023.'",
        "'speaker_1': 'This rezoning is very alarming. It actually hearkens back to the Dennard rezoning. I haven't seen this much opposition since then. 54 letters of opposition, 38 letters in opposition presented to this council. Oh, so much to go on with this.'",
        "'speaker_1': '300 plus units at 80%. Am I the. And am I level $68,592 as of 2019? We have a housing crisis, an affordable housing crisis, and this is not going to help with that. I'm all for housing for seniors.'",
        "'speaker_1': 'I'm all for allowing seniors to age in place. Those are wonderful things. But this rezoning, I don't think is going to get the mark. I really don't. Like previous speakers have already stated this just on a flood plain on a water table, 10% of the units are going to be affordable at 80% AM-I I'm still trying to'",
        "'speaker_1': 'figure out how that's affordable, but that's based off the hood guidelines. Yeah, it's just all around. But I wouldn't be surprised if you pass this tonight, seeing as you passed the marble rezoning a few months back. So I wouldn't be surprised, but I would recommend that's not passed.'",
        "'speaker_1': 'And go back to the drawing board with this. I had a few questions in regards to this rezoning. Has there been a traffic study done because of pretty previous speakers have stated that this sits around a roundabout several roundabouts.'",
        "'speaker_1': 'I'm aware of only one RTD bus route that services this area now would be the six. Has there been a parking study done on the standards? It's going to be a four story garage space here. There's no way for there to be underground parking because it's on a floodplain.'",
        "'speaker_1': 'Um, how many units? One of the speakers said it was going to be 300 plus units. What are going to be the size of the units? Are they going to be one or two bedrooms? This is going to be assisted living or is this going to be independent senior living?'",
        "'speaker_1': 'If somebody could please answer those questions, I would greatly appreciate it. Thank you.'",
        "'speaker_0': 'Thank you. Next up, we have Cathy Head. Hi. Can you hear me? Yes, go ahead.'",
        "'speaker_3': 'I'm Cassie Head and I'm co-chair of our United Neighborhood Line.'",
        "'speaker_0': 'Thanks for giving us a chance to speak tonight. I want to summarize kind of our involvement in this project from.'",
        "'speaker_3': 'The time that we were originally.'",
        "'speaker_0': 'Contacted by the developers. And we're not.'",
        "'speaker_3': 'Taking a stand either pro or an opposition at this point. Lower United Neighborhoods has been in discussion with the senior housing development team, including Matt Oberman.'",
        "'speaker_0': 'And Phil Workman. We were originally contacted.'",
        "'speaker_3': 'And sat in on our project presentation in March of 2021.'",
        "'speaker_0': 'And followed by three meetings with the One committee. One urged that active.'",
        "'speaker_3': 'Living apartments include units for lower income residents, including public access.'",
        "'speaker_0': 'Along.'",
        "'speaker_1': 'It.'",
        "'speaker_3': 'Along the east side of Westerly Creek.'",
        "'speaker_0': 'Benches and trees for that path and that a publicly.'",
        "'speaker_3': 'Accessible pickleball court be.'",
        "'speaker_0': 'Considered.'",
        "'speaker_3': 'The senior housing team has agreed to the 10% low income.'",
        "'speaker_0': 'Units to the project. The lower income rentals are to be codified in agreement with Host. An easement along the path phone can be held by Lowry Community Master Association or the City of Denver. On October 21st, one hosted a town hall presentation.'",
        "'speaker_3': 'Via Zoom for the Lowry Community. Community current.'",
        "'speaker_0': 'Concerns expressed during.'",
        "'speaker_3': 'The October 21st presentation included vehicular site.'",
        "'speaker_1': 'Access.'",
        "'speaker_0': 'Pedestrian safety and traffic.'",
        "'speaker_3': 'At Lowry Boulevard. Just some of the traffic circle and along a summary loss of greenspace preservation of existing mature trees.'",
        "'speaker_0': 'Building height Lowry design guidelines limit to a.'",
        "'speaker_3': 'Height of 45 feet.'",
        "'speaker_0': 'And potential parking conflicts.'",
        "'speaker_3': 'Along Sports Boulevard through two follow up meetings on December 2nd and December 7th, which included city staff.'",
        "'speaker_0': 'It was determined that the pedestrian safety and traffic.'",
        "'speaker_3': 'Issues will be addressed through the.'",
        "'speaker_0': 'Ongoing monitoring by JT.'",
        "'speaker_3': 'And Site Plan Review. Once the city receives a development package, the Lone Board determined after the October 21st community meeting that.'",
        "'speaker_0': 'It does not have the capacity.'",
        "'speaker_3': 'To seek a sufficiently representative vote from.'",
        "'speaker_0': 'The R.A. community to either express or withhold support for this rezoning. The board also determined that rather than executing agenda.'",
        "'speaker_3': 'The provision of lower income housing and the path right of way can be achieved through host agreement and an easement with the City.'",
        "'speaker_0': 'Of Denver.'",
        "'speaker_3': 'Or the LACMA. One appreciates the conversations prepared with United Properties team as well as multiple conversations with city staff.'",
        "'speaker_1': 'And submits this.'",
        "'speaker_3': 'As a record of these interactions.'",
        "'speaker_0': 'Thank you. Thank you for your time. Thanks. Thank you. Our next speaker is Christopher Schenk.'",
        "'speaker_1': 'Good evening. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Excellent. My name is Christopher Shank. I reside at 460 Yosemite Way. I'm eight houses down from the proposed project and. I think most of what has been said tonight is very spot on from those who strongly oppose this project going forward.'",
        "'speaker_1': 'I don't think anyone here is arguing the merits of the project. I think we all think this is a wonderful idea and it's a very good idea. However, this is a horrible place for it to happen. I'd like to reiterate the point from earlier.'",
        "'speaker_1': 'Speakers of those who speak in favor are not the people who will be directly impacted by this on a daily basis. They are not the people who drive by here every day. They are not people who walk their children to the park every day.'",
        "'speaker_1': 'They are not the children who walk their pets in this area every day. And I would go so far.'",
        "'speaker_0': 'As to say that most people.'",
        "'speaker_1': 'Who have spoke in favor.'",
        "'speaker_0': 'Have a financial.'",
        "'speaker_1': 'Issue with either gaining from the property itself or scholarships through the school. We're being told here the traffic will not increase or if it will, it won't be that much. I would really like to know how the addition of 300 extra residents plus their families, plus their friends, plus the employees who will be at the site, will'",
        "'speaker_1': 'not add traffic and safety issues to an already unsafe area. I myself have been involved in two fender benders in that roundabout at Yosemite and Lowry Boulevard. I think that this is not irresponsible use of this site and it is not consistent with the neighborhood nor the neighborhood of East Park.'",
        "'speaker_1': 'I have to iterate again that we as a neighborhood do not feel that there was sufficient community outreach, despite what the developments development the proposed developers have said. Those of us who live on Yosemite, very few of us had any idea this was happening until the rezoning meeting.'",
        "'speaker_1': 'We're talking about public health, safety and welfare, and I cannot see how increased traffic in this area with no plan that's in place is going to support that. So I'd like to say that I am strongly opposed to this process.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Steve Zigler.'",
        "'speaker_1': 'Go ahead. You hear me? Okay? Yes. Okay. Great. My name is Steve Ziegler, and we've been Larry since 2004. My wife and I have three kids, and we also own a business, a radio and a space, actually right across the street from Ashcroft High School.'",
        "'speaker_1': 'This is not going to impact us financially, positively or negatively simply. And if we to grapple with the concerns of the traffic and its impact on our neighborhood. Thank you, Councilwoman Sawyer, for working with me and our neighbors on those issues.'",
        "'speaker_1': 'Much like the East Park neighborhood, our house borders preexisting traffic concerns. Super, super frustrating. It's certainly gotten worse over the years. That being said, this property is not open space. It's its property that's going to be developed. And I feel like what's being proposed is perhaps the most advantageous use for our community outside some sort of police'",
        "'speaker_1': 'substation. But I. I would like to see this pass. We are for it. I'm supportive of senior living, and I think it's a good mix. Overall in Lowry Southeast Denver. I do trust and believe in the Lowry Redevelopment Authority and everything that things will come to an agreeable solution.'",
        "'speaker_1': 'So I hope you join me in supporting this project. Thank you.'",
        "'speaker_0': 'In. Q And our last speaker this evening is Blair Licht and Phil. Go ahead, Blair. Yes, go ahead.'",
        "'speaker_3': 'My name is Larry, looking out of the addresses for 10/17 Street Street.'",
        "'speaker_1': '2210 Colorado Street across the.'",
        "'speaker_3': 'Street.'",
        "'speaker_0': 'Claire, I'm sorry to interrupt you, but for some reason, your audio is really garbled. I wanted to see if if you try again. I know you don't have your camera on, but go ahead. Okay. Dr.. A little bit.'",
        "'speaker_0': 'We'll go ahead and try it again. Go ahead. Okay. Is that better? Yes, I think so. Okay.'",
        "'speaker_3': 'I would like to make reference to that certain letter from me on behalf.'",
        "'speaker_0': 'Of the applicant to the.'",
        "'speaker_3': 'Members of Council dated January 1st, 2022, and to ensure that my letters entered into the record for tonight's public hearing. The letter outlines in detail how the applicant's request for rezoning.'",
        "'speaker_0': 'Of the subject property meets and exceeds each of the criteria for approval of rezoning.'",
        "'speaker_3': 'As established by the code. By way of an update to the aforementioned letter, I wanted to let Council know that the applicant.'",
        "'speaker_0': 'And current owner of the.'",
        "'speaker_3': 'Property.'",
        "'speaker_1': 'Bishop Bishop.'",
        "'speaker_0': 'High.'",
        "'speaker_3': 'School, have agreed on material terms for a community commitment agreement between those two parties which obligate the allocated use for things. First, to enter into the agreement to provide affordable housing in favor of the city of Denver, obligating the applicant to make 10% of the residential units and the active.'",
        "'speaker_1': 'Adult building available.'",
        "'speaker_3': 'To private residents. 80% or less of area median income. Second to work with neighbors, the city and body to strategise.'",
        "'speaker_1': 'With respect to.'",
        "'speaker_3': 'Mitigation measures intended to alleviate or remedy existing traffic conditions on the Assembly and Barry Boulevard. Third, to provide a public open space easement in favor of the city.'",
        "'speaker_1': 'On.'",
        "'speaker_3': 'Over and through the existing Westerly Creek Trail.'",
        "'speaker_1': 'On the.'",
        "'speaker_3': 'Property, which easement will include an application of.'",
        "'speaker_1': 'The property owner.'",
        "'speaker_0': 'To.'",
        "'speaker_3': 'Improve, provide and maintain benches and other amenities along that trail. And finally, to pursue.'",
        "'speaker_1': 'Opportunities.'",
        "'speaker_3': 'For publicly available recreational.'",
        "'speaker_1': 'Programing.'",
        "'speaker_3': 'On the property subject to city approved. Otherwise, I'm here tonight to answer questions about any of the agreements the applicant has entered into or has agreed to enter into with.'",
        "'speaker_1': 'Respect to.'",
        "'speaker_0': 'The application.'",
        "'speaker_3': 'Thank you in advance.'",
        "'speaker_0': 'Thank you. I'd like to thank all the members of the community who joined us tonight for the public hearing. That concludes our speakers. We're going to move to questions from members of Council on Council Bill 21, DASH 1371.'",
        "'speaker_0': 'Council Member Sawyer.'",
        "'speaker_3': 'Thanks, Madam President. I really want to just first thank the community members for coming out and speaking on this issue. It was really helpful to identify a number of the questions that I have for tonight. So to start, I want to ask about the current zoning on the property.'",
        "'speaker_3': 'So Libya, I think maybe this is a question for you in terms of or possibly if Monti force is still on, I believe it might be a question, a historical question for the LRA, the LRA Redevelopment Authority, but wondering how so?'",
        "'speaker_3': 'So first, Monti, when what year exactly was the the Lourey community and all of that property conveyed from the U.S. Air Force to the city of number?'",
        "'speaker_0': 'And Monty, if you go ahead and reintroduce yourself for the public record before you respond.'",
        "'speaker_1': 'This is Monty Force. I'm the executive director for the Lowry Redevelopment Authority. My address is 130 Rampart Way. Denver 80230. And again, I'm not justifying for or against in just offering any. Historical perspective that I can help with, and I might be fuzzy on some of the facts.'",
        "'speaker_1': 'It's been a while since this property was conveyed. The property from the Air Force to the Redevelopment Authority for implementation into the master plan was done over a number of years, starting all the way back to 1994. So great.'",
        "'speaker_3': 'No, that's great. So so in general, what I was asking was, you know, when did when was the Library Redevelopment Authority, I guess instituted and what? And so my follow up question to that is, what was the property zoned as back then when in its original form?'",
        "'speaker_1': 'When the property came to Denver from the Air Force, there was it wasn't zoned. All of the zoning had all the property had to be zoned into Denver.'",
        "'speaker_3': 'Oh, okay. Great. Thank you. So so I guess follow up question to that and maybe I'm not sure if you're the person to ask about this or not, then the current zoning on the property is ah four. So when the property was conveyed from the Air Force, was there a discussion about what the, what the zoning was'",
        "'speaker_3': 'going to be. Because we re zoned city council resolved all but 20% of the city in 2010 into the new zoning code, and this property stayed in the old zoning code in the Chapter 59 zoning code. So I'm wondering, was that a a specific decision that was made at that time of conveyance?'",
        "'speaker_1': 'No. The Air Force, first of all, wasn't involved in the zoning process ever. And often times we tailored zoning to meet the intended uses that we were selling the property for. So the words Bishop match above may have come to us.'",
        "'speaker_1': 'I don't recall the details exactly asking to put in a ball field. So then we looked for zoning through our zoning consultants to come up with his own district. That would satisfy that need.'",
        "'speaker_3': 'Okay. That's good to know. Thank you. So. So the current zoning on the property is ah, for which allows for today a senior living facility to be built on the site. So I'm I guess a little I'm trying to unwind them.'",
        "'speaker_3': 'The issue of is that is that the waivers that that then ensure that it that we have to go through this rezoning. I guess I'm I'm trying to get the background on that.'",
        "'speaker_1': 'I think I'm probably the wrong person to answer that question.'",
        "'speaker_3': 'I think.'",
        "'speaker_1': 'Differently.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_1': 'Yeah. That's what I'm happy to answer. That's okay. This is Marcus Pok near 4700 East Sixth Avenue. I am a consultant to the applicant. Mr. Foresman is correct that oftentimes when LRA did transfers, they would put a deed restriction on the property and then find the appropriate zone district.'",
        "'speaker_1': 'So, Councilwoman, this is zoned for today. I'm looking at the ordinance in front of me. It's a 1998 zoning on this subject property, as Libby mentioned, at the very beginning. It allowed, again to reflect that this was transferred to an educational use.'",
        "'speaker_1': 'We waived out, which is traditionally how we did things in the early days of Lowri. We waived out all of those other uses except for those educational things. So a church, a school or a theatrical studio could still be on the site.'",
        "'speaker_1': 'And as Libby said, at less than 37 feet tall today. So that could happen today. There are restrictions on that. And Councilwoman, you are correct in the existing are for an old chapter 59. Senior housing is a permitted use and a house assisted living facility is a use by special review.'",
        "'speaker_1': 'So that has always been contemplated. I would also mention just quickly that in that Lowery reuse plan, as you saw and was noted in the presentation, it also showed that senior housing is allowed in that Lowery reuse plan always envisioned for this use at that site.'",
        "'speaker_3': 'Okay. Great. Thank you. I really appreciate that. So the so I guess follow up question to that for Libby. You mentioned that blueprint. Denver has identified this parcel as a future use open space. Is that correct?'",
        "'speaker_0': 'That is the current future place type. But the plan acknowledges that that applies to large, private, open spaces that are likely to turn over due to their private nature.'",
        "'speaker_3': 'Got it. Okay. And then is anyone from Parks and Rec here? I would love to just ensure that, you know, is Parks and Rec going? Is there a plan? Or would Parks and Rec be willing to purchase this land for open space for the city of Denver?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'We do have a representative here, Kathleen, but Becky should be on. If we can promote her.'",
        "'speaker_3': 'Kathleen, if you could just hit the raise hand button, maybe so that they can find you in the ten and ten these lists. That'd be great. Thank you.'",
        "'speaker_0': 'All right. There you go, Councilwoman Kathleen.'",
        "'speaker_3': 'Hey, Kathleen, thanks so much for being here. Really appreciate it. I just want to reiterate my question in case for some reason, you were not able to hear it while you were getting switched over. This would be a lot easier to do in person, I think.'",
        "'speaker_3': 'But just want to confirm, is the is Parks and Rec willing to purchase this land for open space use for the city and county of Denver? Kathleen Levesque with Denver Parks and Recreation and Denver Parks and Recreation has not had any conversations with the property owner about purchasing this land and does not have any intent to purchase'",
        "'speaker_3': 'it. Okay, great. Thank you. I appreciate that clarification. So then let's so open space. Matt, maybe you can answer this question for me. It seems like we have sort of a discussion ruins here or a disagreement between the Lowry reuse plan and Blueprint.'",
        "'speaker_3': 'Denver.'",
        "'speaker_0': 'What is Blueprint Denver?'",
        "'speaker_3': 'I guess what was your sort of take on that in the application?'",
        "'speaker_1': 'Thank you for the question, Councilwoman Sawyer. Um, I, I guess I would reiterate what Libby said on how it is designated for private space and future use, that it can be turned over for private development. I think we're we're very we're very much in line with many of the criteria and blueprint.'",
        "'speaker_1': 'Denver, you know, as it relates to the context of of other surrounding designations there, if you look at the future place and street types in the future neighborhood context, they call out for community center suburban neighborhood context. I mean, those are all good fits for for what we're planning here and for this senior living use.'",
        "'speaker_3': 'Okay. Great. And Matt, while I've got you, I just want to also confirm. So you do you have a signed agreement with host that you will dedicate 10% of the of the spaces or the units to affordable at 80% am I.'",
        "'speaker_1': 'Yes, we signed it. Host doesn't sign it unless the reason becomes formalized. But yes. And Brad, I hope Brad's on. He could speak to that as well. Host If you would like to see.'",
        "'speaker_3': 'It, looks like Brad just raised his hand. Perfect. Thank you.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_3': 'And while we're waiting, Brad. Yeah, I think we're waiting for.'",
        "'speaker_0': 'Going to get him in here. There we go.'",
        "'speaker_3': 'Hey, Brad, thanks for being here. Just wanted to confirm with hosts that that agreement is signed, sealed and delivered.'",
        "'speaker_1': 'Confirms we have it executed by the winner in our contracting system for authorization on our side if and when the rezoning is approved.'",
        "'speaker_3': 'Okay, great. Thank you so much. And can you please just introduce yourself for the record?'",
        "'speaker_1': 'Sorry. Hi, everyone. Brad wanted staff for housing stability or host the city and county of Denver.'",
        "'speaker_3': 'Perfect. Thank you so much. Really appreciate that. Okay, so there were a few issues that were identified. There was the sort of disagreement between Blueprint and the Lowery reuse plan with regards to the future use type. Libbi, when when blueprint when there is a neighborhood plan because there are many neighborhoods in the city of Denver where there'",
        "'speaker_3': 'is no neighborhood plan. What does Blueprint say about which one controls the neighborhood plan or blueprint?'",
        "'speaker_0': 'The neighborhood plan typically controls.'",
        "'speaker_3': 'Okay. So in this case, then that does that mean that the Lowery redevelopment plan, as put in place when all of those parcels were transferred over, is the controlling document that we should be looking at here.'",
        "'speaker_0': 'Correct? Yeah. Usually with our analysis.'",
        "'speaker_3': 'Whenever there's a neighborhood plan.'",
        "'speaker_0': 'Like, for instance, if blueprints on Bruce's five stories are appropriate and a neighborhood plan says three stories is appropriate.'",
        "'speaker_1': 'Usually we would go with the.'",
        "'speaker_0': 'Three stories that's in the neighborhood plan. So typically we defer to that smaller area plan that had kind of more targeted input from the public.'",
        "'speaker_1': 'Then Blueprint Steinberg, which was a citywide process.'",
        "'speaker_3': 'Okay, great. I appreciate that. I just want to you know, as I'm going through the criteria that we are, the five criteria that we're required to look at, I want to make sure that I understand, you know, whether this is consistent with the adopted plans, because we have two adopted plans that are potentially not in line with'",
        "'speaker_3': 'each other. Right. Okay, great. So the so the neighborhood plan is what's going to what's going to guide us there and the neighborhood plan. Can you just refresh my memory on what the neighborhood plan says for this this parcel?'",
        "'speaker_0': 'The neighborhood plan calls for a mix of uses and that include residential education, campus and community service. And within that residential category, retirement housing and managed care.'",
        "'speaker_3': 'Facilities are specifically listed. Okay. Great. Thank you. Really appreciate that. And then the the open space section. This may be another question for you. So you can you explain to me the easement and what's happening? Tell me more specifics about what's happening there.'",
        "'speaker_1': 'Sure. So a couple of things. So there's an existing trail that goes along the west side of the site along Westerly Creek. Unfortunately, that trail is on private land. The land that we are, we are purchasing. It's been used as a public trail.'",
        "'speaker_1': 'I don't know for how long, but it's so it's being used that way. So one of one of the ask through the community outreach was, can you can you put a public trail easement over this, which will protect effectively forever protect this trail to actually be a true public trail.'",
        "'speaker_1': 'And it provides great connectivity there between a bunch of the trail system that's on the South and a bunch that's on the north. So we will be doing that as part of this. And the bounds of that easement and exactly where it falls will all be flushed out through the process that we go through with with the'",
        "'speaker_1': 'city there. And then in addition to that, through the again, through the community feedback, we're going to be enhancing that trail experience. You know, no specifics really on what that would be. We've talked about at adventure that trees but you know making that a better trail experience there along Westerly Creek that will now be a public trail'",
        "'speaker_3': '. Okay. And then I believe someone mentioned briefly pickleball courts. What is what's that?'",
        "'speaker_1': 'Yeah. So that was another thing. Through the feedback, they requested that we tried to put a publicly accessible pickleball court there, which we do plan to do if we do run into any.'",
        "'speaker_3': 'Issues there.'",
        "'speaker_1': 'With with noise issues, that that is our just our one concern. We would figure out something, something else to put there. That was it was less noisy but was a publicly accessible recreational activity. So that was something that was asked of us and that we will be doing with this development.'",
        "'speaker_3': 'Okay, great. I appreciate that. And then so that is I appreciate that you have stated your commitment here at the rezoning hearing on the public record. Is there signed paperwork on that?'",
        "'speaker_1': 'There is not currently, as I think Blair's Blair stated, we are doing a community commitment agreement that we're now working through with Matchbox. You know, the history there of the Jena was spoken about by a few folks. And, you know, we we drafted that in plan with Lorne at one point.'",
        "'speaker_1': 'And unfortunately for us, we we just found out recently here that that, you know, wasn't that they were not capable of of of reviewing and executing that. So we did reach out to a couple other entities. LOWRY Redevelopment Authority, the.'",
        "'speaker_1': 'Lowry Community Master Association, you know, looking to find another party to do a put on that agreement. Unfortunately, those folks also didn't have the the ability to do that. So we are drafting an agreement that will show that with with Matchbox, who is the seller of our site, and we'll be there in the community there long term'",
        "'speaker_1': '. And so the other, you know, but the other mechanisms that are in place there, as you mentioned, the critical piece, the affordable housing, right. We have the agreement with host and the trail easement, the trail improvements. Those can can be handled through the process as well as the publicly accessible recreation activities that we'll put on the site'",
        "'speaker_1': '. We can handle that all through the process. The Denver.'",
        "'speaker_3': 'Okay. Great. Thank you. And the the parking lot. So we heard a lot of comment from the public about the parking lot. Can you talk me through that?'",
        "'speaker_1': 'Yes, sure. I mean, the site plan is something is definitely still in flux, having been through the SDB process yet and in a in an effort to be open with the community and get feedback, you know, we're showing them some very early plans of what we we have planned for the site.'",
        "'speaker_1': 'And I think in the most recent one we showed, we have shown a four storey above structure or above ground, part of the structure at the corner of Sports Boulevard and Yosemite. That that plan, while it is still in flux, it has not been done in a vacuum.'",
        "'speaker_1': 'Folks here have mentioned the Lowry Design Review Committee. We've been through several conversations and iterations of that site plan with them, working with them to see what their thoughts were on best ideas for where to locate an above ground structure here.'",
        "'speaker_1': 'So I think it's it's it's a little bit premature on the on the conversation there. You know, I will say, I know people are concerned about looking at a parking structure, you know, that will be screened again. LOWRY So lucky in that they have these gatekeepers that protect the architecture of.'",
        "'speaker_1': 'LOWRY And, you know, this these further steps will take in the process. They'll be there to enforce the Lowry design review guidelines that have dictated everything that's been built there. Lowry.'",
        "'speaker_3': 'Okay. Great. Really appreciate that. And I will just say, as an aside, I think there was a speaker earlier who mentioned the way the process works. And I want to just make sure that it's clear for all of the residents and the public what we're talking about here.'",
        "'speaker_3': 'So the the rezoning process happens first and then the site development review process happens second. And so as council, we can only look at the criteria that we're allowed to look at in terms of rezoning. But it's good to get an idea of some of the feedback that the community has had for you and some thoughts about'",
        "'speaker_3': 'that. And it's good to know that the design review board in Lowrey is has very specific requirements and that you're in conversation with them as well. Okay. So then I want to ask a question of, I guess, one of the representatives from Dotty about the traffic.'",
        "'speaker_3': 'This is an area that my office has spent a significant amount of time with the police department and with Daddy working on. And so I know that there was a community meeting. I was not there because as a quasi judicial role that I have in this rezoning to vote yes or no, I can't I couldn't be there'",
        "'speaker_3': 'to hear the discussion. So curious if I can get a report on the conversation and what may have come out of that in terms of potential mitigation of the issues?'",
        "'speaker_0': 'All right. We've got Dana Hofmann ready to answer that question, Councilwoman.'",
        "'speaker_3': 'Hi. Deena Hoffman again. Department of Transportation Infrastructure. I'm the community designer for this area. Councilman Sawyer, I can speak to that meeting. So we did have a meeting with the East Park community. It was hosted by LUHN. And the intent of that meeting, just for the record, is was to talk through existing transportation issues, not issues very'",
        "'speaker_3': 'specific to the potential impacts of this rezoning and redevelopment. In terms of the meeting content, so some of it was just hearing concerns from a community about transportation in the surrounding area. I would summarize that as primarily speeding safety issues within the traffic circle there at Yosemite and other traffic circles and excuse me, roundabouts there and the'",
        "'speaker_3': 'other roundabouts in the area. And then also some requests for additional crossing treatments. Dottie has looked into some of these concerns prior to that meeting and also subsequent to that meeting and some of the concerns we've heard more recently brought up by this development.'",
        "'speaker_3': 'One of the changes that will be coming as a result of that additional analysis are some safety improvements at the roundabout there, and those will primarily be done with signage and striping, and it will better clarify essentially which lane assignment cars will be entering into making sure that folks are traveling at an appropriate speed as they enter'",
        "'speaker_3': 'into the roundabouts. I have the draft work order available, which I can share with council if you'd like. There are just minor modifications being made to that before it's approved and it goes out. So that's probably the most significant change that's being made at this point in response to community concerns.'",
        "'speaker_3': 'We are going to look at some additional crossing treatments. There are none that are approved at this point. I hope that helps. Yeah, that was great. Thank you. Really appreciate that information. And, you know, oftentimes when we have a development like this, the developer makes a commitment to do a traffic study during the site development review plan'",
        "'speaker_3': 'and potentially even make some upgrades or enhancements to to the, I guess, the roadways, the travel ways outside of but adjacent to the development. Has anything like that happened here, Dana? Do you know or maybe Matt, maybe you can speak to that.'",
        "'speaker_3': 'Yeah. Dana, go.'",
        "'speaker_1': 'Ahead. I guess I'll go ahead, Dana.'",
        "'speaker_0': 'But we'll make sure to hear from both of you. So, Dana.'",
        "'speaker_3': 'Matt may want to speak to this and Marco also could speak to this as well. So we don't have any specific commitments from the developer, although, you know, we've definitely heard interest and doing best interests for the neighbors.'",
        "'speaker_3': 'What I am aware of is that some a traffic study would be conducted once the development was ongoing. Some specific requirements we've asked for if that traffic study was done. So so Marco could speak in more detail about what they would have to look at moving forward.'",
        "'speaker_3': 'But there aren't any commitments at this time. Okay. Great. Matt, did you want to jump in? Thanks, Dana. Did you want to jump in and fill out some some of that information further?'",
        "'speaker_1': 'Sure. I mean, I'll just reiterate that we want to be part of the solution here and we want it to be safe for our residents as well as the community. Right. So certainly we were doing a full traffic study through the typical process here in Denver for through the ACP and the civil design.'",
        "'speaker_1': 'And it's expanding the scope of that to collect some more data points to to help Doddy come up with ideas or solutions here. I mean, we're definitely open to doing that and we want to be a part of the solution here and see how our development could help alleviate some of these concerns.'",
        "'speaker_3': 'Okay, great. And so is there have you committed to I guess it's hard without a good neighbor agreement based on the inability of any one particular organization within Lowry to have the I guess, the ability to do a good neighbor agreement.'",
        "'speaker_3': 'Have you committed to that in some other way, or what does that look like?'",
        "'speaker_1': 'Not at this time other than obviously, you know, we're here saying it now on public record that we want to be a part of the solution. And and, you know, we're going to be long term members of this community.'",
        "'speaker_1': 'So we want to be a part of that. We we spoke to the the agreement with Matchbox that we're working on. So that's an avenue we could potentially take there. But I guess that's yeah, we're we are still working through that.'",
        "'speaker_1': 'So.'",
        "'speaker_3': 'Okay, great. Appreciate it. I've got a few other questions, but I know that there are a couple of other council members with their hands up in the queue. So I'm going to step back and let them answer their questions.'",
        "'speaker_3': 'And then if my questions are not answered based on the things that they ask, I will pop back into the queue. Thanks, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer. We're going to go ahead and go to Councilmember Flynn.'",
        "'speaker_1': 'Thank you, Madam President. I'll be brief. I just have one question. I need a clarification. Libby, can you tell me, reading through the staff report on this five story, three story, the existing zoning allows three stories. The request is for a five story zoning, but the Lowry design guidelines limited two apparently to four stories.'",
        "'speaker_1': 'And so I'm a little concerned why we selected the SMU five rather than the SMU three with waivers to four stories, rather than just giving a blanket entitlement to five stories. When we did Loreto Heights, we did SMU three along along federal, but with a waiver to allow up to five stories.'",
        "'speaker_1': 'And so why what is the mechanism in the rezoning that we're being asked to vote on tonight that would guarantee that it will not be five stories, but it will be, in fact, limited to 50 feet.'",
        "'speaker_0': 'I appreciate the question. It is a rather convoluted story with what's existing and what's allowed with the some X viruses. LOWRY But the Lowry Design Review Committee will be reviewing this in tandem with the site development plan process.'",
        "'speaker_0': 'And so any development within this area is going to have to meet the design guidelines and go through that review process, which would limit the building to four stories slash 50 feet. So that is the mechanism.'",
        "'speaker_1': 'Okay. Is there a mechanism within the Lowry? That's that's all the way on the other end of town. I don't get out that far all that often. So I'm just curious, is there anything in the Lowry design guidelines process that allows it to be changed down the road?'",
        "'speaker_1': 'In other words, that we're we're letting loose. We're being asked to let loose an entitlement for five storeys, 70 feet. Could those design guidelines change down the road as early as this design review on this project prints, for instance?'",
        "'speaker_0': 'And that is a really good question. I do know that they did have a older version of design guidelines, and the one that they have now is only a couple of years old. And some of their terminology and some of the ways that they're addressing things have changed.'",
        "'speaker_0': 'But I don't know how much like they're. The design guidelines themselves and height limitations have changed.'",
        "'speaker_1': 'Okay, so I understand, you know, things change. Times change. This was 1994. Could Marcus Parker maybe address that? That Marcus, you were there at the time. Can you tell us what is the process with the design guidelines and how how can they be revised or would they be revised within the life of this project?'",
        "'speaker_1': 'Absolutely. And Councilman, I just want to stay on record again that all the RC we've actually already started and going through that process and LOWRY And so this site actually going through it is already capped at that 45 feet that we talked about.'",
        "'speaker_1': 'It's interesting, Councilman. It kind of is somewhat out of order the way it happens there. But we actually and that's why the community knows a lot, if you will, about the suggested parking garage and so forth, is because there is this process.'",
        "'speaker_1': 'So, Councilman, we have gone through there as to your question. There may be a way somebody mentioned that you didn't get a variance for some of the structures on the roof, but all across. LOWRY There is a height limitation.'",
        "'speaker_1': 'And, Councilman, that has been true. The only thing I read, though, is that existing buildings like the hangar immediately to the west of us is 67 feet. So the big bear ice arena, which is right there, is actually something that's higher than that.'",
        "'speaker_1': 'We certainly will not get there. So, Councilman, we will stay at that 45 feet. Okay. Thank you. I think the hangars were there long before ABC, long before the people were there. That's right. Thanks. Thank you, ma'am. That's all I have.'",
        "'speaker_0': 'All right. Thank you. Councilman Flynn. Marcus, for the public record, would you please introduce yourself?'",
        "'speaker_1': 'Absolutely. Marcus Park, near 4700 East Sixth Avenue, consultant to the developer.'",
        "'speaker_0': 'All right, great. And prior to you, we had Libby Kiser, our community planning and development planner. And so thank you, Councilmember Flynn. We're going to move to Council Member Sandoval. We're going to have to have you a new councilwoman.'",
        "'speaker_0': 'For some reason, we're not hearing your audio. Okay. We're going to go ahead and see if you can work on that or if we need to have you leave the meeting, councilman, and bounce back in. We can certainly do that.'",
        "'speaker_0': 'Councilman Cashman, do you want to go ahead and go ahead with your questions?'",
        "'speaker_1': 'Yes, thank you. Just one quick question. Whether it's from Marcus or the developer, if there's someone there.'",
        "'speaker_2': 'That can answer.'",
        "'speaker_1': 'I'm I'm just wondering, a lot has been made people concerned about the view of the parking garage. We see a lot.'",
        "'speaker_2': 'Of developments.'",
        "'speaker_1': 'Now and now a days where the parking garage is wrapped by the residences.'",
        "'speaker_2': 'Is is that an option? Has it been.'",
        "'speaker_1': 'Considered? Just wondering. Yeah. Councilman. All this joker. Marcus Falkner consultancy. The Development. We have started that process. As I mentioned, the DRC. We will have to go through the full step and want those neighbors, particularly the neighbors immediately across the street to be involved in that.'",
        "'speaker_1': 'So, Councilman, we did show some massing and I think, frankly, that's what shows brought those comments forward. I think that massing we will go through that architectural review and talk about screening all of that. I would note that someone who's been involved in Lowery a long time, councilman, this is a wonderful thing that we're dealing with, is'",
        "'speaker_1': 'actually parking structures immediately across the street. It's a very large parking field. And that really leads to kind of something that I don't think is the the type of context that we want to develop today. So we are working through those challenges.'",
        "'speaker_1': 'Councilman, I guarantee you those neighbors will be involved. Lowery has a great process that that LDR. So, yes, sir, there are some slight limitations on that, that low water table. But we will work through those issues with the neighbors and find the proper screening.'",
        "'speaker_1': 'All right. Thank you, Marcus. Appreciate it.'",
        "'speaker_0': 'All right. Thank you, Councilman Cashman. Next up, we have Councilmember Sandoval.'",
        "'speaker_3': 'Can you hear me now?'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Okay. I had to tell the woman the technical difficulties. The matrix is in the computer. So I don't know who this question will go to, but when Larry was built out, how much affordable, affordable housing was developed with this master plan?'",
        "'speaker_1': 'So, Councilman, I'll defer to Marni Fauci if he is still on. One thing I will note if he's maybe getting promoted is that we were subject to the original Ice Age ordinance, so we had inclusionary housing throughout the site.'",
        "'speaker_1': 'We greatly exceeded LRA, greatly receded that 10% limitation. So, Councilman, there was an agreement for all of Lowry, including Boulevard one, which is the last phase that was developed on the west side of Quebec. So this subject property, if you will, Councilwoman, was already subject to that agreement, to a preexisting agreement.'",
        "'speaker_1': 'The neighbor said that's not enough. We frankly agreed with them. We said we wanted to go further. And we believe this is the first senior housing deal that actually has a deed. Restricted affordable housing agreement in place with host.'",
        "'speaker_3': 'So you're saying what I hear you said was like 10%. So 10% of housing. So including single unit homes, single family homes, 10% of apartments. Because I know Central Park had like a specific master plan where they had a portable housing developer.'",
        "'speaker_3': 'Who was your affordable housing developer?'",
        "'speaker_1': 'Councilman, I'm sorry again, if I'm blind and don't know if money force can answer it. So you let me jump in.'",
        "'speaker_0': 'Monte is on so we might take it over. And Monte, if you want to introduce yourself for the public record.'",
        "'speaker_1': 'Marty Faust. I'm the executive director for the Lowry Redevelopment Authority. And the. Affordable housing for all of Lowry was entered into? Well, first of all, there was the I show. We negotiated a 200 units of for sale units.'",
        "'speaker_1': 'It was in that plan. But overall, affordable housing amounts to about 800 units in Lowry between rental housing for formerly homeless and for sale units.'",
        "'speaker_3': 'Okay. And that was that. Thank you, Marty. And that was throughout the redevelopment of the whole entire project, is that correct? Right. Yeah.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Okay. And then who is your affordable housing developer? Is it same as the developer who built everything? And then were they restricted? Or can you explain that process a little bit?'",
        "'speaker_1': 'It's a fairly complicated but the um we the for sale housing was developed by a land trust. It was not deed restricted. It was a land trust, the Colorado community land trust to develop those properties with help from the Lowry Redevelopment Authority as to affordable housing for the formerly homeless.'",
        "'speaker_1': 'That was done through the Colorado Coalition for the Homeless and some other force or for rent developers as well as we required certain developers when they were developing property to include affordable rentals in the program. It goes to multiple developers.'",
        "'speaker_3': 'Okay, I hear you. I got that. Thank you. And then a comment was just made. And inform us who are as familiar with the whole Lowry development. It was said that during the site development plan that there would be participation by the public.'",
        "'speaker_3': 'That doesn't happen in northwest Denver. If a project gets rezoning and a site development plan goes through the process. It's between the community planning and development development services more specifically and all of the processes that go through a site development plan.'",
        "'speaker_3': 'So for those who are watching this, Lowry have a different site development plan that people can actually participate in.'",
        "'speaker_1': 'Who answered this in part. And that is the Lowery Community Master Association has oversight of the Lowry Design Review Committee, and I'm sure that they post their meetings and projects on the website as they're going through the process.'",
        "'speaker_1': 'It'd be better directed actually to the Lowry Community Master Association because they actually now control the design review, that is the community design controls to review it.'",
        "'speaker_3': 'So I understand her design review process. I'm just I'm just confused on how it keeps being said that the public who are on here, who have talked in opposition can be part of this site development plan is I just don't understand where there's a trigger that would have public participation in the State Department then.'",
        "'speaker_3': 'Can someone on the team help me understand.'",
        "'speaker_0': 'That.'",
        "'speaker_1': 'It's all in the what I site I can. Sorry Matt. If you jumped in Marcus partner again, what I cited was exactly what Marnie Faust just mentioned, the elder C Lowry Design Review Committee. Those are public meetings, Councilwoman, that are posted for members of the public to be able to attend.'",
        "'speaker_1': 'And they have a process that goes through that. There's public comments that would be allowed, Councilwoman. And I'm sorry, I don't know if it's at the beginning of the end of the meeting. That is a process, one of the processes that we've already started going through, and they had a public posted meeting and where they allowed that'",
        "'speaker_1': 'to happen. And we will continue to go through that process.'",
        "'speaker_3': 'For the Site Development Fund. And so when you do the site development, spend the whole entire site development spend, so the traffic, the water, wastewater, all of the things that have to be checked off on the site development spend that's posted through this.'",
        "'speaker_1': 'RC Yeah, I think their purview is a little less right councilman than the whole councilwoman and the whole ACP, but all of the elements that are within their purview will be available. I think what we're offering to do and we have done throughout, is to continue to communicate with those neighbors.'",
        "'speaker_1': 'So, Councilman, we're happy to to share some of those details, give updates at the age of the RC process. Lowry is known, as you say, for a little bit of a different process where that is a much more open and involved process that will go through on the site plan.'",
        "'speaker_3': 'Okay. Thank you. And Libya, I have a question for you. So although this is been asked for five story entitlement, did I hear correctly that this whole area has a height cap at 45 feet, which I think is under five stories.'",
        "'speaker_3': 'So even though they're going asking for an entitlement of five stories, they can't build five stories. Is that is that what I'm understanding?'",
        "'speaker_0': 'It is correct. Yeah. Sorry that that's confusing.'",
        "'speaker_3': 'But per the DRC process.'",
        "'speaker_0': 'They had their design guidelines that max height at four stories. And I do believe that the applicant's team is actually pursuing 50 feet instead of the 45 feet. That's typical, but that is still significantly less than the 70 feet that would be allowed with the five storey s-max.'",
        "'speaker_3': 'Okay. That's I think that's a that's a valid point for this hearing, is that although they're asking for more entitlement, that there's already a cap at 45 feet, can one someone from the development team. Is it are you going to 50 feet?'",
        "'speaker_3': 'Is that including all of the equipment on top of the building, the back and the elevator shaft? Or are you going 50 feet plus the age back and elevator shaft?'",
        "'speaker_1': 'Yes, this is metformin with native properties, but we're certainly not far enough along the design process to know exactly what the heights will be. But let me add some clarity on the 50 feet. So we did go through a height variance process, a public process with the DRC to go from 45 to 50.'",
        "'speaker_1': 'And the reason for that is you really you really can't even fit a four storey building with a flat roof and 45 feet. So we made that case to them as well as it allows us to do more articulate architectural articulation along the roofline.'",
        "'speaker_1': 'Right. Going up and down, you know, things that make it look like not one big massive block. So that was really the reason for the 50 feet as it relates to mechanical screening, mechanical penthouses. Yes, that is outside of the 50 feet.'",
        "'speaker_1': 'That's how they've written the Lowry design review code. But you know, those the goal is right to set those back into the middle of the roof. And and you'd have to be standing a pretty good distance away to see those.'",
        "'speaker_1': 'But those are not within that 50 foot 50 foot restriction.'",
        "'speaker_3': 'Okay. I have one question for you. One last question for you. I keep hearing public comment about the water table. Have you or has your team done study that indicates the water tables higher over in this neck of the woods than it is in other places in Denver.'",
        "'speaker_1': 'I can't I can't speak to how it compares to other places in Denver. But, yes, we do have a relatively high ground water table here. You are right next to Western Leigh Creek there. Right. So I think that's part of it.'",
        "'speaker_1': 'I'm not a geotech expert, but yes, we do have some areas on that site that seem to be higher than we might typically see in Denver.'",
        "'speaker_3': 'Okay. Thank you, Madam President, first of all, for my questions.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. And we're going to go ahead and move to Councilmember Ortega. Thank you, Madam President. Some of my questions have been asked, but I did want to ask a couple that have not been asked. I heard some reference to other senior living, one that I don't know if it existed and then went away or'",
        "'speaker_0': 'they had applied for the zoning to do it and it never happened. But Marcus, I see you on there. How many senior living projects are on the Lowrey property?'",
        "'speaker_1': 'Yes, Councilwoman. So just for clarification, there was a senior housing development that was just about the equivalent of four or five, maybe six blocks to the west of the site that went away because, councilwoman, that was a facility that came from the Air Force, had very aged facilities.'",
        "'speaker_1': 'And interestingly enough, when that went away, it became a very intense multi-family development. So that became a much more intense multifamily use. There is councilwoman and existing senior center right out of callback that has a facility there. Matt and his team are experts in this.'",
        "'speaker_1': 'They did a very detailed analysis, market analysis of the site, and there was a remarkable need for senior housing. It's actually reflected in the equity analysis in an ad that went through the zoning and really looked at this was very much needed.'",
        "'speaker_1': 'So we would believe that this is actually a very beneficial use and a very needed use at this site.'",
        "'speaker_0': 'So the market analysis wasn't just of the Lowry community. It was of the broader age population that needs affordable or needs senior housing, but includes the 10% that's in it. Okay.'",
        "'speaker_1': 'That's correct, Councilwoman.'",
        "'speaker_0': 'Okay. And then I wanted to get. The. Lowry folks back on. Because I had a question about the. So the design review process that you talked about with Councilwoman Sandoval. So that was that was to ensure that all the new buildings coming in met that criteria.'",
        "'speaker_0': 'But for the ones that were assumed because some of these properties were of gifted, if you will, to some of those nonprofits. Correct. Monte, are you on? We do have to go.'",
        "'speaker_1': 'Ahead on muted now. Okay.'",
        "'speaker_0': 'Okay. So so the properties that were gifted to nonprofits and this was back when Councilwoman Polly Flowback was the councilwoman of this district. And I remember her and Cathy Reynolds going to Washington and asking for $5 million to assist because there were more nonprofits that had.'",
        "'speaker_0': 'Basically applied for some of those existing buildings. And Marcus just talked about one of them that just went away. Right. But. Some of those nonprofits were given money to go do their projects elsewhere as opposed to on the the Lowry property.'",
        "'speaker_0': 'But for those that did remain. Did they have to go through or if they do upgrades in the future, will they have to go through the design review process?'",
        "'speaker_1': 'Very good memory from those days. Yes. The design review. Just a couple of questions there. But first of all, the design review process holds for any past development that has already occurred and also applies to anybody that is going through the process now for redevelopment of a site.'",
        "'speaker_1': 'We anticipated that there would be redevelopment of properties or you know, it's been 25 years plus since the original buildings were first done here. So, yes, we anticipated that there would be changes and that there would be a need for continued design oversight on redevelopment of properties.'",
        "'speaker_1': 'And yes, there were a number of affordable housing units that were actually created off of Lowry based on the settlement agreement between HUD and numerous parties.'",
        "'speaker_0': 'Right. Okay. Those are all the questions I have. Thank you, Mr. President. Thank you, Monte. All right. Thank you, Councilman Ortega. Councilwoman Sawyer, we've got your back up.'",
        "'speaker_3': 'Thanks, Madam President. I think the vast majority of my questions have been answered. Really appreciate. I feel like there's like so many moving parts here. The history of Lowry is very complicated. And there are, for lack of a better term, a lot of hands in the pot when it comes to anything happening in Lowry, a lot of'",
        "'speaker_3': 'different oversight and then a lot of different community outreach. So I really appreciate all of those different kind of sectors coming together to explain, you know, what is happening here and some of the complicated challenges that are happening with this rezoning, which is why so many questions have been answered.'",
        "'speaker_3': 'I'm wondering, I think sort of final question. If Blair is still in the queue somewhere and Blair, if you don't mind raising your hand, if you are if we could upgrade her. I feel like I just would like some more clarification.'",
        "'speaker_3': 'You know, Matt, no offense. You seem like a great guy. United Properties seems great, but I don't trust you. I would like to know a little bit more about an agreement and what that might look like in terms of, you know, there's a lot of there's a lot of really good promises being made.'",
        "'speaker_3': 'But I would like more certainty the attorney in me needs more certainty than that. So, Blair, if you are back up, would you mind kind of just walking through how that certainty might end up existing? I'd really appreciate it.'",
        "'speaker_3': 'Thanks. Sure this is Blair lifting files. Attorney for the.'",
        "'speaker_0': 'Applicant.'",
        "'speaker_3': 'I missed part of your question while I was being upgraded, so let me know if I don't answer it.'",
        "'speaker_0': 'But the applicant and much boss have come to a material term agreement.'",
        "'speaker_3': 'It's not signed, but we have agreed on the material terms of what we're calling a community commitment agreement. And this is sort of in lieu of some of the things that.'",
        "'speaker_1': 'We have offered to.'",
        "'speaker_3': 'Put in writing in favor of one. And they have said that they're unable to sign an agreement at this time. And so we've taken the.'",
        "'speaker_0': 'Same community.'",
        "'speaker_3': 'Commitments that were intended to go.'",
        "'speaker_0': 'Into that agreement with one and put it into an agreement with us. Because as everyone, you're not as much by much, but.'",
        "'speaker_3': 'We'll be retaining the property across the street by the high school. And so there are three primary components to the.'",
        "'speaker_0': 'Agreement, I would say. The first is obligating us.'",
        "'speaker_3': 'As the applicant properties to sign the agreement to build affordable.'",
        "'speaker_1': 'Housing.'",
        "'speaker_3': 'I think that's in your your pocket and I think you can see that.'",
        "'speaker_1': 'Both us and.'",
        "'speaker_0': 'The applicant is signed that.'",
        "'speaker_1': 'That becomes effective.'",
        "'speaker_0': 'Upon the rezoning getting.'",
        "'speaker_3': 'Approved. The second piece is.'",
        "'speaker_0': 'An acknowledgment by both my.'",
        "'speaker_3': 'Staff and the applicant that there are some existing traffic conditions that are.'",
        "'speaker_0': 'Causing some consternation among the neighbors and some concerns about safety and whatnot. There's a commitment.'",
        "'speaker_3': 'In there for.'",
        "'speaker_0': 'The developer.'",
        "'speaker_3': 'To work with the residents of the neighborhood.'",
        "'speaker_0': 'And members of the community.'",
        "'speaker_1': 'The city.'",
        "'speaker_0': 'And Dottie to strategize with respect to mitigation.'",
        "'speaker_3': 'Measures that are intended to alleviate or remediate those existing traffic conditions.'",
        "'speaker_0': 'So we don't know exactly.'",
        "'speaker_3': 'What those are. We do know.'",
        "'speaker_1': 'What we can.'",
        "'speaker_3': 'Do to assist or are committed to helping with that process and continuing to engage with the neighborhood.'",
        "'speaker_1': 'As we do.'",
        "'speaker_3': 'So. And the third and final piece is an obligation.'",
        "'speaker_0': 'To grant an.'",
        "'speaker_3': 'Open space easement to the city over the existing Westerly Creek Trail and to improve that trail to provide benches and other amenities. The easement itself will also obligate the property owner to maintain those the trail, the benches, any other amenities in perpetuity.'",
        "'speaker_3': 'And then finally, there is an agreement to pursue opportunities for recreational.'",
        "'speaker_0': 'Programing on the property.'",
        "'speaker_3': 'You guys have heard us talk about a pickleball court. I think that the applicant is excited about a pickleball court.'",
        "'speaker_1': 'There's some concerns about.'",
        "'speaker_0': 'Noise and.'",
        "'speaker_3': 'If that isn't the exact public, the available amenities, and we will come up with something else.'",
        "'speaker_1': 'That works for the community to serve.'",
        "'speaker_3': 'Those recreational interests. Okay. Great. Thank you. So I have never heard of this before. And do you know, is this the first time that something like this has ever been done? As far as I'm aware. Yes. It really looks like a good neighbor agreement, to be honest with you.'",
        "'speaker_3': 'But instead of being with an R.A., it's actually with another property owner and with another entity in in the neighborhood. I think Matt had previously mentioned that we had talked to both the FEMA and the LRA to see if they were interested in being a counterparty.'",
        "'speaker_3': 'Right. All agreements need a party and a counterparty. And they had also said that they were unable to sign it for a variety of reasons.'",
        "'speaker_0': 'And so because of I don't want to speak for much about.'",
        "'speaker_3': 'That, because they will continue to be a neighbor. They do have a vested interest in being as a community member and being.'",
        "'speaker_1': 'Supporting.'",
        "'speaker_3': 'That. That's a.'",
        "'speaker_1': 'Concern of.'",
        "'speaker_3': 'Mine and whatnot. And they have the ability to be a counterparty and.'",
        "'speaker_1': 'Enter into.'",
        "'speaker_3': 'This agreement. So I'm not aware that this has been done before.'",
        "'speaker_1': 'But it's still an enforceable agreement between two parties.'",
        "'speaker_3': 'Okay. Great. Thank you. Really appreciate the clarity on that. Thanks so much. Thanks so much, Madam President. That, I think is the end of my question.'",
        "'speaker_0': 'All right. Well, thank you, Blair. And thank you, Councilman Sawyer. The public hearing is now closed. Comments by members of Council on Council Bill 20 1-1371. Council Member Sawyer.'",
        "'speaker_3': 'Thank you, Madam President. This is a tough one, I have to say. Again, I want to thank the community for coming out and not just coming out tonight to speak on this, but repeatedly and really engaging with this potential development and and making it, you know, truly better.'",
        "'speaker_3': 'I have always said that if something is going to be developed, it has to provide a community benefit and it has to be something that works for the community or it's not worth doing it. So, you know, for example, I'm I am also concerned about the the the traffic circles I drive over in this area all the'",
        "'speaker_3': 'time. And it's it's really bad. So I really appreciate Dottie's willingness to engage in this as well and find some solutions during the site process that makes sense for the community and works for the community should this rezoning be approved.'",
        "'speaker_3': 'So, you know, I've talked about the traffic circles and the concerns there and how the developer has gone above and beyond to be willing.'",
        "'speaker_1': 'To.'",
        "'speaker_3': 'Provide some mitigation. I've talked about, you know, the concern of green space, open space and how that kind of doesn't mesh necessarily. Blueprint number doesn't necessarily necessarily mesh. I'm sorry, it's getting late with the with the Lowry reuse plan, but that the Lowry reuse plan is really the thing that the controls here, you know, it's incredibly frustrating'",
        "'speaker_3': 'that, you know, nothing has been done yet in terms of the those roundabouts. But I'm really excited to hear that there are improvements coming and appreciate all of the work that the Lowry United Neighborhoods Traffic and Pedestrian Safety Group has done with Dottie and with the community on that.'",
        "'speaker_3': 'So, you know, that's really exciting. And I think, you know, this has gone on really long, so I'll keep it short. You know, this property is going to be developed, right? Matchbox has said that they have goals that they want to achieve.'",
        "'speaker_3': 'And the way that they as a school can achieve those goals is by selling this property. I looked into it and asked some questions and I know that there were a number of other offers for this property. This was the only one that provided a community benefit at all.'",
        "'speaker_3': 'All of the other ones were more multi-family residential properties, like the ones that we just talked about a minute ago where there used to be an assisted living facility that closed and then was raised and then a number of multi-family units were built on that land.'",
        "'speaker_3': 'So I don't want the same thing to happen here. If we can ensure that there is a community benefit that does help, you know, not only in terms of affordability, but in terms of aging in place and in terms of more options.'",
        "'speaker_3': 'I really am appreciative of that. I also think it's important to note that this developer, not once but twice, was able to say tonight that they are offering something that is doesn't exist in the city and county of Denver right now.'",
        "'speaker_3': 'So not only with the agreement to formalize the open space easements and the, you know, traffic mitigation, but and the outreach to the community. But also then that this is the first of its kind in terms of providing affordable units specifically to seniors.'",
        "'speaker_3': 'Our community is struggling with that, and that will only continue and get worse over time because of the number of people who are aging in East Denver and because right now we are seeing that those people are getting lost to Arizona and to Littleton.'",
        "'speaker_3': 'That's where they go because there's no place for them to age in place in the city and county of Denver that's affordable. And when they're ready to move out of their larger houses for whatever reason, that's the only choice they have.'",
        "'speaker_3': 'So it is really exciting, I think, to see that I think it's going to, you know, fill a community benefit. And and so I'm really, you know, I had to work through the consistency with adopted plans piece. But I think that this is extraordinary what we have been able to get from the community in terms of feedback'",
        "'speaker_3': ', what the developer has said that they are willing to do. It's extraordinary. And, you know, given the fact that it's our fourth with waivers right now. So, I mean, tomorrow there could be a four story set of classrooms built on that site.'",
        "'speaker_3': 'That is, I think, really important to recognize as well. And so, you know, walking through the specific criteria that we are looking at, I am I am hesitant, but I am supportive of this. So. Thanks, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. And I don't have anybody else in the queue. And so I'll go ahead and round out the comments that I do believe this meets the rezoning criteria. I want to sincerely thank the community members who came and testified tonight and the robust questions and answer session that we had to really dig into this'",
        "'speaker_0': 'a bit more. And so I will be supporting this this evening as well. Madam Secretary, roll call on Council Bill 21, dash 1371, please. Sawyer, I. Torres. I am black. I see tobacco. I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Flinn.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_1': 'I. Paint. I.'",
        "'speaker_0': 'Cashman. I can eat. Ortega. I Sandoval. I. Madam President. I. Madam Secretary, close the voting and announced results. 12 Eyes, 12 eyes. Counsel build 20 1-1371 has passed again. Thank you to the community members and city staff who stayed with us for that hearing.'"
    ],
    "Zoning Change for 1200 Eudora Street in Hale.": [
        "'speaker_0': 'We're going to go ahead and move on to the next one. Councilmember say to Baca, will you please put council bill 20 1-1372 on the floor for final passage?'",
        "'speaker_3': 'Yes, I move that council bill 21 1370 to be placed upon final consideration and do pass.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 1-1372 is open and we have Libby Kizer joining us again for the staff report. Yes. Just a second to pull up the presentation.'",
        "'speaker_0': 'All right, great. Thanks, Libby. All right. Here we go on this one. It's a rezoning for 1200 Utah Street. It's an EDU, so should be much more straightforward than the previous rezoning. And this property is also in Council District five, represented by Council member Sawyer.'",
        "'speaker_0': 'And it's in the center of the Hill neighborhood. The property is located near Rose Medical Center, about one block north of Hill Parkway and one mile or one half mile east of Colorado Boulevard. It's approximately 6200 square feet and is currently occupied by a single unit dwelling.'",
        "'speaker_0': 'The properties in the urban single unit C Zone District and the applicant is proposing to rezone it to urban single unit C one to allow for an accessory dwelling unit. The U.S. one requires a minimum size of 5500 square feet and allows for the urban house and detached 82 building forms.'",
        "'speaker_0': 'The maximum height for a house is 30 to 35 feet and 24 feet for the detached adu. The existing property is on UCC and surrounding properties are zoned a variety of districts, including single unit, multi-unit, open space, campus and former Chapter 59.'",
        "'speaker_0': 'The land use in the area is predominantly single unit, with a mix of open space and hospital uses to the Southwest. The subject property is shown in the top photo on the right with other single storey dwellings to the north and west.'",
        "'speaker_0': 'The single unit dwelling exists across both Alvin 12th Avenue to the South with a two storey dwelling. To the east, alleys are prevalent, but garages are a mix of front and rear loaded and sidewalks are generally attached. Throughout the rezoning process, application notifications have been provided according to code requirements.'",
        "'speaker_0': 'To date, staff has received eight public comments, including one in support and seven opposed due to concerns regarding stormwater flooding and solar access. Most of those opposition comments came into today. To approve the rezoning, it must be found that the requested MAP amendment is consistent with five criteria found in the Denver zoning code.'",
        "'speaker_0': 'In regard to the first criteria, there are three adopted plans that apply it to this property, including the comp plan, 2048 Blueprint, Denver and the East Area Plan. Ousted in the staff report. The resigning is consistent with several goals in the current plan.'",
        "'speaker_0': 'A few of those goals relate to providing a mix of housing types and promoting infill development. The rezoning request is also consistent with Blueprint Denver. The subject property is mapped as part of the urban neighborhood context, which is described as containing small multi-unit, residential and low intensity mixed use buildings embedded in single unit and two unit residential'",
        "'speaker_0': 'areas with gridded blocks and alleys. In blueprints under the future. Places MAP designates the subject property as a low residential place type, which has predominantly single and two unit uses and its use are appropriate. Eudora Street and 12th Avenue are categorized as local or on designated streets, which are mostly characterized by residential uses.'",
        "'speaker_0': 'Blueprint. Denver directs growth to key centers, corridors and high density residential areas that align with transportation options, while limited growth is desired in all other areas of the city. Specifically at 10% of jobs and 20% of housing by 2040.'",
        "'speaker_0': 'The proposed MAP amendment is consistent with this growth area as it will facilitate additional housing opportunities. Blueprint also includes specific policy recommendations and housing policy four focuses on diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_0': 'The East Area Plan also supports A2. Use the A2 key policies to integrate them, to integrate them where they are appropriate. The subject property, located in a predominantly single unit neighborhood, is an appropriate location for an ADU, and the rezoning is consistent with the area plan.'",
        "'speaker_0': 'The rezoning is also consistent with criteria two, three and five. As stated in the staff report, in regard to criteria for a city adopted plan is the most applicable justifying circumstance for this rezoning. As mentioned previously, Blueprint recommends allowing A2 use throughout all residential areas.'",
        "'speaker_0': 'Therefore CPD recommends approval of this rezoning request. All right. Well, thank you very much, Libby, for the staff report tonight. Council has received eight written comments on Council Bill 20 1-1372. There are no submitted comments in favor of the application and eight submitted comments in opposition of the application.'",
        "'speaker_0': 'All members of Council that are present have certified that they've read each of the submitted written comments. Do any members need more time in order to read all the written testimony that was submitted? Right. See, no one raising their hand for that.'",
        "'speaker_0': 'I want to double check. COUNCILMEMBER So you're you're good with that? I'm okay. Wonderful. See? None. Council Secretary Let the record reflect that all written testimony both in favor and in opposition of Council Bill 20 1-137 to have been read by each member of council and all written testimony will be submitted to the official record of the'",
        "'speaker_0': 'hearing. We have one individual signed up to speak this evening. Jesse Paris, please go ahead.'",
        "'speaker_1': 'Yes, good evening. Members of council may be heard.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Yes. My name is Jesse with so cast member presented for Black Star maximum for self-defense of the Mexican Man for Social Change, as well as the Unity Party of Colorado and the East Denver Residents Council in Frontline Black News.'",
        "'speaker_1': 'And I will be the next my member in 2023. I'm in favor of this rezoning tonight. We have an affordability housing crisis in this town. So any time there's an opportunity to increase our health system, I'm in full support of like I was when I ran for city council at large in 2019.'",
        "'speaker_1': 'I'm still support of accessory dwelling units all over this town. I'm just concerned about the seven letters of opposition opposed to this 80 you. That is very concerning. But besides that, I am in support of this rezoning tonight.'",
        "'speaker_1': 'You said pass this. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of Council on Council Bill 20 1-1372 Council Member Sawyer.'",
        "'speaker_3': 'I'm president. I promise I have less questions on this one than I did on the last one. I worry it's a lot.'",
        "'speaker_0': 'More.'",
        "'speaker_3': 'Straightforward for sure. But I do know that one of the things that we received in the form letter that was sent to us today was about whether or not the property owner resides on the property and so is the applicant here.'",
        "'speaker_0': 'We will look here ahead. Oh, there we go. We have Katie Buchanan, her hand raised. And so we'll move her over into the panelists. There we go. Katie, if you wouldn't mind, before you answer Councilwoman Sawyer's question, you introduce yourself for the public record, please.'",
        "'speaker_3': 'I can you. Can you see me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Yes, I am Katie Buchanan, and I'm the owner of the property at 1200 Eudora Street. I've owned it since 1998. Great. Thank you so much and thanks for being here. So Denver has a requirement that the if you are applying for rezoning to add an 80 that you live on the property.'",
        "'speaker_3': 'So I'm asking not just whether you own it, but whether you live there. Well, I am not there all the time. You. No, but I am not renting. So so I'm not there all the time. But I am not going to.'",
        "'speaker_3': 'What I would like to do is have a part of the property be for me and then a full time like renter is what is what. My goal in all this is because I'm not there all the time.'",
        "'speaker_3': 'And so I would like someone else to be on the property when I'm not there. And not a short term. A long term. Okay, great. So when you say you're not there all the time, what does that mean?'",
        "'speaker_3': 'Well, I'm also in the mountains. I have a house in the mountains, too. And also, I, I but I vote in Denver and I have I get mail at the house. So I kind of go back and forth between both places.'",
        "'speaker_3': 'Okay. So we don't necessarily have anything specific in the Denver revised municipal code that require you know, that specifies what a, you know, what living on a property means. But there are some very specific requirements in our short term in our short term rental code in the piece.'",
        "'speaker_3': 'In the short term rental code. And it's not are you just the are you registered to vote it at this property? Yes. Is your car registered at this property? It is. Okay. So your driver's license says this driver's licenses, 1200 Eudora Street.'",
        "'speaker_3': 'I could show you. No, it's okay. I don't need to. I just those are the kinds of things that when you would apply for a short term rental, those are the kinds of things that the short term rental that expires and license would ask to ensure that you are a resident on this property.'",
        "'speaker_3': 'And since there's nothing like that anywhere else in the code, I guess I'm sort of asking those questions because that's the that's what you would that's the only place that really gives us any sort of direction on what quote unquote living in the property would be.'",
        "'speaker_3': 'So that's great. If you're, you know, if you're registered to vote at this address, if you are if you're a driver's licenses at this address, if your car is registered at the address, you know, if you have bills that are registered at this address, that would be, you know, essentially what the the city and county of Denver'",
        "'speaker_3': 'would look at to determine whether you live at this address or not. And that's why I was asking those questions. Okay. That's great. Thank you very much. Really appreciate that. Libby The other thing that was a little bit concerning that was brought up in the letter that we received today was regarding flood mitigation and wondering if you'",
        "'speaker_3': 'can just talk me through kind of the that the flood mitigation, whether that's looked at, how that's looked at and those kinds of things. Sure.'",
        "'speaker_0': 'So when we initially deemed this application.'",
        "'speaker_3': 'Complete, we sent it out to multiple referral agencies, as we always do.'",
        "'speaker_0': 'And the Wastewater Division of Development Services approved the rezoning, but did note the redevelopment of the site may require additional engineering, such as preparation of drainage reports, construction documents, erosion control plans, and that construction of water quality and retention basins may be required, as could public and private sanitary and storm sewer mains and other associated improvements.'",
        "'speaker_0': 'So what what that mitigation could look like will be determined through the residential permitting process. It's not something that consideration of would hold up the rezoning. Okay.'",
        "'speaker_3': 'Got it. So that is not something that we can look at in terms of the five criteria that we're required to look at as council members, when we are when we're looking at a rezoning.'",
        "'speaker_0': 'You know, you could consider it under a public health, safety and welfare, but it will be something still vetted through the residential permitting process.'",
        "'speaker_3': 'Okay. So when Mrs. Buchanan goes to actually file a permit, then that triggers the essentially site development review. And that's where that flooding issue, if there is one, would be considered correct.'",
        "'speaker_0': 'So they would determine how much impervious surface she's adding to the property and what that runoff might look like and where it's going and what improvements.'",
        "'speaker_3': 'Might be needed. Okay, great. Really appreciate that. Thank you. And then, Libby, this one last question for you. The third issue that was flagged in that letter was regarding the height of a potential ADU and blocking a neighbors ability to put solar panels on their roofs or something like that.'",
        "'speaker_3': 'So wondering just want to clarify, in this zoned district, what would the max height be for an ADU.'",
        "'speaker_0': 'For an 80 you? The max height is 24 feet tall and that's only allowed on the rear. 35% of these are marked, which is also then that structure is also subject to a minimum five foot setback in bulk lane require or bulk plan requirements that might further push the upper kind of upper height on the building back'",
        "'speaker_0': 'further from a property line in order to make sure that the neighbors maintain some solar access, none of that structure would infringe on the solar access.'",
        "'speaker_3': 'Of the primary.'",
        "'speaker_0': 'House to the north.'",
        "'speaker_3': 'Of this property. Okay. Got it. I think that is it for me. Thinks that I'm president. And thanks so much, Libby, for walking me through that.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer. Councilmember Black.'",
        "'speaker_3': 'Thank you, Madam President. I don't see an attorney in on this meeting, but I just wanted to clarify. You do not need to be a resident of your property in order to apply for the reason you need to be a resident of the property in order to build the EU.'",
        "'speaker_3': 'And applying for the zoning is different than applying for the building permit. So I just wanted to clarify that.'",
        "'speaker_0': 'All right. Thank you, Councilmember Black. And we have Nate Lucero in the attendees, if we can go ahead and have him moved over in case there's another question. But we'll make sure if Nate has any further clarification to your statement.'",
        "'speaker_0': 'Council Member Black. Go ahead, Nate. Did you hear the question or the clarification?'",
        "'speaker_1': 'Yes. Thank you, Madam Chair. I did hear the question or clarification, and Councilwoman Black is correct. You don't necessarily have to. But I think what we're talking about our short term. Rentals to a certain extent. Right. And for those things, you do have to be the primary resident.'",
        "'speaker_1': 'But to put forward an application to rezone, you don't necessarily have to be the owner, but the application has to be authorized by the owner. And again, there you don't necessarily have to be the primary resident of that structure to apply for the rezoning.'",
        "'speaker_0': 'Thank you for the clarification. Yes. And can you go ahead and introduce yourself for the public record?'",
        "'speaker_1': 'Yes. I'm sorry. Nathan Lucero, assistant city attorney.'",
        "'speaker_0': 'All right. Great. Thank you. Councilmember Black. Or you could. Okay. Wonderful. All right. Councilmember Sandoval.'",
        "'speaker_3': 'Thanks, Madam President. Thanks, Libby, for the presentation. When rezonings were coming forward, especially when we got voted into office in 2012 and 2020, they were requiring to go through a site development plan simultaneously because in Denver we don't always have our minimum zone lights match our zone districts, our minimum zone districts.'",
        "'speaker_3': 'So we were trying to catch these ones that actually have entitlement but can't really build. Do you know if that's still the case that when CPD gets a rezoning application that you have the applicant possible through the site development process?'",
        "'speaker_0': 'That's a great question. And for commercial projects, we definitely recommend that they go through the site development plan process and begin with the concept plan review to ensure that their development is feasible under the district that they're requesting.'",
        "'speaker_0': 'But we're having conversations right now with our residential team to understand what their capacity is to review residential projects which don't go through like a full site development plan process, but rather go through a process to get a residential permit.'",
        "'speaker_0': 'And their project is evaluated after the zoning is obtained. And that's kind of a capacity issue. It's something that we're trying to work through and that we will consider moving forward as well. And then determining kind of what the limits are of the zoning versus the parcel are is important as well to make sure that the applicant'",
        "'speaker_0': 'has a clear.'",
        "'speaker_3': 'Picture as to what they're.'",
        "'speaker_0': 'Allowed. So we are working on some.'",
        "'speaker_3': 'Additional tools to make.'",
        "'speaker_0': 'Sure that they know what boxes to check, even if they can't get like a fully vetted plan from the city.'",
        "'speaker_3': 'Okay. So thank you for that. I do know that. Thank you for bringing up the 2.1 about the capacity and when acknowledging that commercial goes through it and not residential. I just want to go on the record and make sure that we talk about the importance of that and being able to bring up the importance of Councilwoman'",
        "'speaker_3': 'Sawyer's point that you have to have a short term rental or a ADU. You have to prove residency. So having that simple ADU checklist seems to be appropriate to help answer some of these questions. One other question on this rezoning.'",
        "'speaker_3': 'Is there an R.A. that I miss.'",
        "'speaker_0': 'That there is an R.A., but they don't take a position on rezonings? The applicant did reach out to. Mr.. Hill Mayfair.'",
        "'speaker_3': 'Yeah. Well, you doors the you doors, the Bellevue Hale is on one side of Eudora and Mayfair neighbors is on the other side. Okay. And one other question to you, Kathy. Have you talked to your neighbors about this?'",
        "'speaker_3': 'Because you have to put up a sign. So it's pretty public process and mailers going out. Yeah, I mean, that all happened. And yes, you talk to me about that public process on your end and what you talk to about your neighbors.'",
        "'speaker_3': 'And did you get questions about solar panels and things of that nature? No, I got no solar panels. The house next door to me is a has been a rental since like. Early 2000, and it's a person from California and they don't do anything to the house.'",
        "'speaker_3': 'They've never. They don't even come out to see it. So. No. So I didn't get the questions from them. But 12 Avenue is obviously is where everybody walks and has their babies and the strollers are going back and forth.'",
        "'speaker_3': 'So I'm sure many people saw it. I actually had calls from people who asked what the process was like. And they said, Well, I'm thinking of doing it, or how did you do it? Or What's it take? I did get it.'",
        "'speaker_3': 'And do you have an alley? Do I have a sari away and an alley in the backyard? Alley, huh? Okay. Did you talk to the do you know the people who you share the alley with on the other side?'",
        "'speaker_3': 'Did you talk to them? Because oftentimes construction with accessory dwelling, it happened in the back. The various portions of the alleys slows down. What did they think about this zone change? You know, I have not talked to him.'",
        "'speaker_3': 'He's a doctor. He's an emergency room doctor. And he he's not home very often. He's divorced also anyway. And so I don't he's he kind of just goes in and out when he's not working. And I didn't know who he is.'",
        "'speaker_3': 'The thing is, is that I had the street there also on 12th Avenue and a detached garage there. So I obviously I'll get advice, but it might end up being along there because of the detached garage rather than in the alley.'",
        "'speaker_3': 'Yeah. So thank you for that. It's important to know and we do give it provide entitlements like we're voting on now. It doesn't mean you build it, but the community process and being able to go to your neighbors and make notes for neighbors.'",
        "'speaker_3': 'The community process is important and that's why we do those notifications is because you are changing the language and the entitlement on your property. Well, thank you, Madam President. That's a.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sandoval. We've got Councilmember Ortega. Yeah. Just a couple of quick questions. So first of all, the size of the lot was that 5500 square feet? Is that correct?'",
        "'speaker_3': 'I think it's 62.'",
        "'speaker_0': 'Okay. Mr.. Read something wrong when I was looking at the report. And then I did want to ask Libby a quick question. Libby, if you can join on. So have you all experienced people who have gone through the ADU process where the lots are very small, and then when they get into actually going through the design review'",
        "'speaker_0': 'process, they can't actually build because. Of setbacks and just not being able to squeeze a lot and squeeze a structure on that lot where there's already an existing housing unit. It's always a concern of ours. But those kinds of issues we try to vet in the pre-application meeting.'",
        "'speaker_0': 'So we look at the size of their law. We look at the zoning that they're requesting and what the minimum lot size is and what the setbacks might be. And so we we try our best to inform them of the constraints that will influence the final outcome.'",
        "'speaker_0': 'But and if they choose to go through with it, they can still go through, even though you might be advising them there will be some serious challenges. Right. Like they might not be able to maximize the footprint based on the setbacks and the law coverage, maximum requirements and whatnot.'",
        "'speaker_0': 'So we do our best to try to to give them a heads up as to what that final design process looks like. Okay. Thank you for that. And just a brief comment so that I don't have to make any comments during the comment session.'",
        "'speaker_0': 'The early access for neighbors who will be impacted by the alley being closed when materials are being dropped off when. I've had a. Then maybe you build across the street from my across the alley from my garage. And there were many times I couldn't get out.'",
        "'speaker_0': 'I've had a couple of flat tires from nails in the alley. So having. Assuming this goes through, having your contractor and you have a conversation with your neighbors that will be impacted will be really important. So that's it.'",
        "'speaker_0': 'Thank you. All right. Thank you, Councilmember Ortega. The public hearing is closed. Comments by members of Council on Council Bill 20 1-1372 Council Member Sawyer.'",
        "'speaker_3': 'It's been a president. You know, I appreciated the opportunity to ask through some of the questions that were raised by the community. But this is clearly consistent with adopted plans, 80 years or something that we talked about over and over and over again during the East Area plan process.'",
        "'speaker_3': 'And it's something that is, you know, a thoughtful way to to introduce gentle density into the area and provide more affordable housing. And so for all of those reasons, I agree that this is consistent with adopted plans and I'll be supporting it tonight.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer and I agree as well that it meets all of the rezoning criteria and we'll be supporting it. Madam Secretary, roll call on Council Bill 21, Dash 1372, please. Sawyer I. Torres I. Like I.'",
        "'speaker_0': 'CdeBaca, I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_1': 'I. Hines i.'",
        "'speaker_0': 'Cashman.'",
        "'speaker_1': 'I.'"
    ],
    "Rezoning of 4151 North Fillmore Street in Elyria Swansea.": [
        "'speaker_0': 'Ortega. Sandoval. Hi, Madam President. I. Madam Secretary, please close the voting and announce the results. 12 eyes. 12 eyes. Council Bill 20 1-1372 has passed. Thank you to the community members and the applicant who joined us. And Libby, I guess you're done tonight.'",
        "'speaker_0': 'So thank you for being here. On those previous two, Libby. Council members say to Barker, Will you please put Council Bill 20 1-1, four, three, two on the floor for final consideration.'",
        "'speaker_3': 'Yes, I move that council bill 21 1430 to be placed upon final consideration and do pass.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. It has been moved. And we've got the second from Councilman Hines. The required public hearing for Council Bill 21, dash 1432 is open. May we please have the staff report? And we have Brandon Shaver here. And she has concerns with.'",
        "'speaker_3': 'This.'",
        "'speaker_1': 'Most definitely council president. Thank you and good evening, members of city council. I'm Brian Shaver, senior city planner presenting at Fish the application for 41, 51 or Fillmore Street. The request here is to go from SUV to new are 2.5.'",
        "'speaker_1': 'This request is in District nine, represented by Councilwoman CdeBaca and is in the other Swansea, a neighborhood. This request is on Fillmore Street between East 41st and East 42nd Avenues. It's just under 9000 square feet. Land area currently occupied by a single unit residential use.'",
        "'speaker_1': 'This rezoning is sponsored by the councilwoman and would allow for a variety of residential building forms at a maximum building have 30 to 35 feet and the property owner here would like to rezone and redevelop the property with three affordable homes for sale.'",
        "'speaker_1': 'Existing zoning again is suv etches urban edge neighborhood contacts single unit lot size mostly SUV in this neighborhood, as well as some light industrial and some industrial mixed use. Again, civilian residential uses are predominant in this part of the neighborhood.'",
        "'speaker_1': 'There is some two unit residential, some industrial and some vacant let some vacant land uses as well. These pictures give you a little bit of a snapshot of what's going on in the neighborhood with the subject property on the top right, which has been demolished in the last few weeks to accommodate new development.'",
        "'speaker_1': 'The information as of this application was out in early August and it was moved forward on a unanimous vote by planning board on November 17th. And today, staff has not received any letters from Arnault's or the public moving to our reasoning criteria.'",
        "'speaker_1': 'There are three plans that impact the subject property, beginning with Plan 2040. You can see here that this request is consistent with the number of the strategies and goals which are organized by vision element. They speak to creating a greater mix of housing options, ensuring a mix of housing types and services for diverse populations, and promoting infill'",
        "'speaker_1': 'development where infrastructure and services are already in place. Moving to Blueprint Denver This is mapped as part of the urban neighborhood context and a low residential neighborhood place type where we see predominantly single into unit uses with some higher intensity residential uses mixed throughout both of the streets.'",
        "'speaker_1': '42nd Avenue and Fillmore Street are local streets, and this fits into our all other areas of the city growth area strategy, where we expect 10% of new jobs and 20% of new housing by the year 2040. This request is also consistent with a couple additional strategies and Blueprint Denver that also speak to diversifying housing options and integrating'",
        "'speaker_1': 'missing mental housing, especially into our low and low median residential areas that score low in housing diversity. As this request is and Nest neighborhood CPD has now taken the stance of doing equity analysis for even smaller parcels that are in neighborhoods that are vulnerable to displacement.'",
        "'speaker_1': 'So the first equity concept here is access to opportunity. The site scores average has lower access to health care and low access to a full service grocery store. Staff feels that this rezoning could possibly increase the number of residential units and therefore the likelihood of those services and amenities that are lacking to locate in this area.'",
        "'speaker_1': 'This does score more vulnerable based on all of our metrics for vulnerability to displacement, as there are lower median household incomes, higher percentage of renters and lower educational attainment. Staff feels that expanding housing opportunities, especially ownership opportunities, could provide wealth building tools and an opportunity for residents to stay in place for housing opportunities.'",
        "'speaker_1': 'The site scores have moderate diversity. There's less missing middle housing, and housing costs are not very diverse. Again, Staff feels that for introducing a new housing type could result in smaller and lower cost housing options and decrease that equity gap.'",
        "'speaker_1': 'And then lastly, for jobs diversity, this area does score more towards innovation. Jobs and staff feels that this rezoning would have a limited to no impact on the job diversity metric. Moving to the neighborhood plan from 2015, a lot of these strategies and recommendations are similar to what you see in Blueprint encourages a mixture of housing types'",
        "'speaker_1': ', expanding the number of residences, also allowing for moderate increases in density, and also upgrading the neighborhood context from urban edge to urban. This better reflects the use of alleys could help limit or prevent curb cuts in the future and continue detached sidewalks where possible.'",
        "'speaker_1': 'And then looking at the land use map for the neighborhood plan, this is map to a single family duplex. And while it's called single family duplex, the plan actually expands and speaks to this categorization of single family duplex, also including rowhouses, townhomes and small apartment buildings consistent with the rezoning request.'",
        "'speaker_1': 'And you can see the maximum building heights map for this area is two and a half stories. Also consistent with the are 2.5. The next two criteria are also consistent. This will result in the University of District regulations and for the public health, safety and welfare through a number of factors including adopt implementing adaptive plans and providing'",
        "'speaker_1': 'additional housing in a neighborhood that has lost a number of units due to I-70 reconstruction and increasing safety by having more eyes on the street as this property was quite dilapidated and has that vacant for a number of years for justifying circumstances there to change conditions that justify this rezoning, the first being change or changing conditions.'",
        "'speaker_1': 'And a particular area in this case, I just spoke to the I-70 reconstruction. We also there's a number of construction projects occurring at the National Western Center and then also city adopted plan. Both the neighborhood plan and Blueprint Denver were adopted since this property was last free zone in 2010 and speaks to increasing that housing diversity and'",
        "'speaker_1': 'preventing missing middle housing. Lastly, it's consistent with the neighborhood context of urban design, district purpose and intent statements which you can find in greater detail in the staff report. That concludes my presentation, and CPD recommends that approval based on training of the review criteria have been met.'",
        "'speaker_1': 'I'm happy to answer any questions.'",
        "'speaker_0': 'All right, great. Thank you for the presentation, Brandon. And tonight, counsel has not received any written testimony on Council Bill 20 1-1, four, three, two. We have four individuals signed up to speak this evening, and so we're going to go ahead and move to those individuals, our first speaker.'",
        "'speaker_0': 'And just a reminder to folks, please introduce yourself. Please introduce yourself and provide us your name and your address or city of residence if you feel comfortable doing so. And our first speaker is Jeff Martinez.'",
        "'speaker_1': 'Good evening, Madam President and members of city council. I'm Jeff Martinez, president of Brothers Redevelopment. And I live at 1650 Olive Street in Denver and it's my pleasure tonight with a great assist from councilwoman say the bucket to submit for your consideration this rezoning request for 4151 Fillmore Street brothers two brothers redevelopment is acquired this site on'",
        "'speaker_1': 'behalf of global area Swansea Affordable Housing Collaborative, which includes the global areas wants it coalition, Carter Community Land Trust and Habitat for Humanity, Metro Denver with the sole goal of developing a triplex on site to add three new affordable units that will be sold to residents of these hard working and proud neighborhoods who are at risk of'",
        "'speaker_1': 'displacement due to gentrification caused by the redevelopment of Central 70 and other. Nearby development is putting severe economic pressure on land in real estate in the area and has been doing so for quite a while. When sold to residents, the units will be placed into the GEOS Community Land Trust, which is owned solely by the neighbors of'",
        "'speaker_1': 'the area now, and that's now known as Dear Collective to be kept in perpetual affordability for a 99 year term. Our efforts to date have received substantial public and philanthropic investment both the city and county of Denver and the Department of Transportation, with granted $2 million each to this vision, which has seen us now acquire a handful'",
        "'speaker_1': 'of sites to place five new homes into the hands of DC residents. It has us on the cusp of developing 5 to 10 new units in the next year, which we're very excited about, including those we're discussing tonight.'",
        "'speaker_1': '4151 Fillmore. The effort has also received substantial financial support from the current Health Foundation. The initiative proves that we can preserve affordability while centering the interests of DC residents that face decades of environmental injustice and economic disparities. It also, as brand and shared, replaces units that were lost due to the seven Central Seven Reconstruction.'",
        "'speaker_1': 'So with that, just pleased to be able to submit this for your consideration the city.'",
        "'speaker_0': 'Thank you. Our next speaker is Jesse Paris.'",
        "'speaker_1': 'Yes. Good evening. Members of council may be heard. Yes. Yes. My name is Jesse with some Paris and I'm represented for Black Star Action, one for self defense, positive action camera for Social Change, as well as the Unity Party of Colorado, the East Denver Residents Council and Frontline Black Hills.'",
        "'speaker_1': 'And I'll be the next term Denver in 2023. Initially I was against this rezoning because I thought it was going to be more gentrification as usual. But upon hearing the previous speaker, I am in full support of this reasoning tonight.'",
        "'speaker_1': 'I support the gas community and in the Senate they're on board with this. I have no choice but to support this. And I'm seeing that this is going to be under the community land trust. That is also a plus and is going to be affordable for 99 years.'",
        "'speaker_1': 'I just have a question. Is this going to be for sale or for rents? How soon? As someone can answer that question, I would really appreciate it. Thank you. And have a blessed night.'",
        "'speaker_0': 'Thank you. Our next speaker is Nolan McDowell.'",
        "'speaker_3': 'The evening. Members of Council. Happy New Year. I'm here in support of the U. rh2 point five zoning. I am the co-director of the Global Irresponsible Coalition and I live in Denver at 4930 Lahore Street. We found this lot and it's a larger lot.'",
        "'speaker_3': 'It's about 9000 square feet. And so we were excited that we could use the same model that we've been using for duplexes, but be able to expand it one more unit. This was a vacant and derelict home. I remember when I was a council aide in about 2013.'",
        "'speaker_3': 'I remember getting a call about this house and all the families of raccoons that were living there. But it has been a safety hazard or to surrounding neighborhoods for at least ten years. As far as I know, this home has been purchased as part of the global response community land trust effort called Events of Substance and the'",
        "'speaker_3': 'Collective. It is a community directed community land trust working to prevent displacement of neighbors and globally response year. We have been building out that pipeline for neighbors to prepare to purchase these homes. These homes are for sale homes.'",
        "'speaker_3': 'They will be numbers 11, 12 and 13 and the community land trust if this passes and our three bedroom, three bath homes sold for $185,000 to families at around 50 to 70%. AMI most of these families are intergenerational families.'",
        "'speaker_3': 'Many have several children. As you saw brothers be development is currently the owner of the land and when the homeowners purchased the the home then the land goes into the community land trust, which is currently being incubated by Habitat for Humanity and the Colorado Community Land Trust.'",
        "'speaker_3': 'In the long term, they will be stewarded in perpetuity by the GC residents who will collectively on this land. This land not only one time contributes to the community and the community efforts, but it will contribute now and then ongoing throughout its life.'",
        "'speaker_3': 'We will we are looking at a modular developer for the site and we've also done a significant amount of community outreach in addition to our board being entirely community members, 19 community members of the globally responsible neighborhoods, we make a big effort to fire just directly around the unit.'",
        "'speaker_3': 'So we've done three different sets of wiring around that neighborhood to talk to. People have actually been able to qualify. One of the people that live across the alleyway who is she's currently living with her two kids, with her parents, and she was able to qualify to be able to move in to one of the homes potentially'",
        "'speaker_3': '. Just across the alleyway so she can be close to her family. We're all overall just super thankful to customers that are back to Brandon for all your support.'",
        "'speaker_0': 'That's the time we have a lot of. Thank you, Noah. Next up, we have Alfonzo Spinner.'",
        "'speaker_1': 'It's the council. Can you hear me?'",
        "'speaker_0': 'Mm hmm. Go ahead.'",
        "'speaker_1': 'Hello. My name is Alfonso Espino. I live at 4716 Gaylord here in Denver. And Luis wants you. I'm also a community organizer with the Jazz Coalition, so of course, I'm here in support of this recent change on Fillmore Street.'",
        "'speaker_1': 'Not only will it add affordable housing for sale units to our community, which are desperately needed, but they're at a level that are also appropriate for the neighbors, as you just heard from Ella. And I just want to reiterate that support and these are the type of projects that city council, the city of Denver should be looking'",
        "'speaker_1': 'towards as examples of ways to fill in the gap for communities that look like ours. And over I'm just proud of the work that has been done by the local people and everyone involved with it. And thank you for those that spoke in support of it tonight.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening. And I want to see if there's any questions from members of Council on Council. Bill 21. Dash 1432. Councilmember Ortega. Thank you, Madam President. Oh, sorry. There we go. Sometimes it works, and sometimes it doesn't.'",
        "'speaker_0': 'When I hit my button. Oh. So my only question and I'm not sure. If it's for Lola or for Jeff. But actually it would probably be for whoever is marketing the units when after they're constructed. Who who is doing the like homeownership counseling to try to find the families and counsel them so that as they are getting'",
        "'speaker_0': 'into a home ownership situation there, they know what all their responsibilities are. I mean, because it's completely different than being a renter where you have a landlord that has to come and fix things when they break down. Obviously, you would want to make sure that you know the.'",
        "'speaker_0': 'What's the word I'm looking for, you know, when you purchase something brand new. The warranties are in place. But when the warranties expire as a homeowner, you then become responsible. So I don't know who wants to address that.'",
        "'speaker_0': 'All right. Well, we have both Jeff and Nolan in the queue, so it just asks for you to reintroduce yourself for the public record. Nolan, do you want to go ahead and start?'",
        "'speaker_3': 'Sure, I can start. No, let me go with the GSA coalition, and thanks for the question. Councilman Ortega. So, yes, we require all of our homeowners to take the toughest 35% of homeowners course. So that's offered by lots of different organizations throughout the city.'",
        "'speaker_3': 'We've done the ones against Spanish in the neighborhood with Del Norte, for instance, Brothers offers them in English and in Spanish and on Saturdays, which works out for a lot of people. So we kind of just whatever works for the homeowner, you know, their timing and now they're all in line, of course.'",
        "'speaker_3': 'So.'",
        "'speaker_0': 'So that's good to know. I didn't realize that that was a requirement, but that is extremely beneficial for anybody buying housing in the city of Denver to go through that process, because it it just helps you understand all of the nuances of becoming a homeowner.'",
        "'speaker_0': 'So thank you for answering that question. I think that's all I have. So thank you. You covered all the questions in your presentation about what sort of appreciate it. All right. Wonderful. Thank you, Councilwoman Ortega. And to the community members who testified during the public hearing as well.'",
        "'speaker_0': 'The public hearing is closed. Comments from members of Council on Council Bill 21, Dash 1432. Councilwoman CdeBaca.'",
        "'speaker_3': 'Thank you. As mentioned by some of the speakers tonight, this is a truly grass led community effort and the real culmination of a series of events that have harmed our community and now is our opportunity to undo some of.'",
        "'speaker_0': 'That harm created. And so I'm proud to have played.'",
        "'speaker_3': 'A role in this, and I invite all of you all to support this tonight. There are no other projects that we've ever had in front of us that guarantee the depth of affordability for the length of time guaranteed by the Gasland trust.'",
        "'speaker_3': 'And they are never, ever community stewards stewarded like this one is. And so this is a really unique opportunity for us to see what it looks like when a community is calling the shots. So please, I invite you all to support tonight.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman CdeBaca. Councilwoman Sandoval. Oh, I think we might still I think we might have trouble with your audio. Again? Oh, no. Do you want to go ahead and. Well, if you want to bounce back off, we've got Councilman Flynn in front of you here.'",
        "'speaker_0': 'I don't know what else to help advise you with it. Councilman Flynn, go ahead with your comments, please.'",
        "'speaker_1': 'Thank you, Madam President. I raised my hand because I saw that Councilwoman Sandoval's having audio problems, so I thought I'd vamp for about 3 minutes on this just to give her a chance to come back in. But as I was listening to Councilman CdeBaca, I just wanted to thank her for hosting me on a tour of her'",
        "'speaker_1': 'district a couple of months ago. And this was one of the sites that we went by. And I believe this is just a culmination, councilwoman, of that effort that you described to me.'",
        "'speaker_3': 'Yes, this is thank you.'",
        "'speaker_1': 'Thank you. And so I'm very happy to support this and obviously meets all the criteria. And thank you, Councilwoman, for giving me that street level. Look at the issues in your district.'",
        "'speaker_3': 'Thank you for coming. And the tour is available to anyone else who wants it.'",
        "'speaker_0': 'All right. Thank you. Up next, we've got Councilmember Sandoval. We've got you back in the queue.'",
        "'speaker_3': 'Can you hear me now? Understand that. Thank you. So I would just like to ask my colleagues support for this as well. I had the privilege and the opportunity to work on the plan with Nolan Miguel as council aids in District nine and to be able to sit here tonight and ask for your support for this is'",
        "'speaker_3': 'the work that has been being built in that community for a very long time. And thank you for your being so steadfast in your dedication and your vision and being a visionary in this area and figuring out how to get this done.'",
        "'speaker_3': 'So I would ask all of you to please support this. It's important to support a plan that was adopted in 2015 and all of the other adopted plans that are called out in this application. Thank you.'",
        "'speaker_0': 'Thank you. Council Member Sandoval. Councilmember Ortega. Okay. Thank you, Madam President. I just wanted to add my support for the application as well. I know that BRE and Habitat have played a really important role in working with the residents of the community and with Chiara collectively in identifying properties and looking at how to utilize the money that'",
        "'speaker_0': 'both the city and C that have made available. A lot of that was focused on trying to ensure there were resources to help replace some of the housing stock that was lost in these neighborhoods as a result of I-70.'",
        "'speaker_0': 'And this is doing exactly what it was supposed to do. And so I'm in full support of this application. Thank you. Wonderful. Thank you, Councilwoman Ortega. And happy to support this rezoning tonight as well. Appreciate the community and other council members comments and invite my colleagues to support it as well.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 21, DASH one, four, three, two. See the market.'",
        "'speaker_3': 'I click.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Herndon i. Hunt I. Cashmere i.'",
        "'speaker_0': 'Ortega. All right.'",
        "'speaker_3': 'Sandoval, I.'",
        "'speaker_0': 'Player.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'Friends. I.'",
        "'speaker_3': 'What I.'",
        "'speaker_0': 'Madam President, I. Madam Secretary, closed the voting and announced results for Vice 12 Eyes Council Bill 20 1-1432 has passed. Our pre adjournment announcement on Monday, February 7th, 2022. Council will hold the required public hearing on Council Bill 20 1-1437 Changing the zoning classification for 901 North Kearny Street in Montclair, a required public hearing on Council Bill'"
    ]
}