{
    "New Article on Construction Defect Claims in Common Interest Communities.": [
        "'speaker_9': 'owners in a common interest community to institute a claim for construction defects. Taking out the words at least, makes it very clear that a simple majority is all that is required, and that no more than, say, a supermajority or even unanimity can be required to proceed under our ordinance.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Flynn, any other comments on the motion to amend? CNN. Madam Secretary, welcome. Oh, I'm so sorry, Councilwoman Gilmore. I looked away. Go right ahead. Thank you. You make fun? Microphone.'",
        "'speaker_3': 'Thank you, Mr. President. I wanted to ask David Broadwell with this change. Any issues or how will that affect when you're talking about deleting the words at least and simple majority, how how that affects this ordinance?'",
        "'speaker_6': 'David Broadwell, assistant city attorney. I believe the meaning of the ordinance will be the same with with the words in or with the words out because and I went back and kind of did some reality checking on this in terms of some other state laws and so forth.'",
        "'speaker_6': 'And often a law will say you need at least a majority to do such and such. Meaning the same thing is you need a majority to do such and such, right? It's just a different way to express it.'",
        "'speaker_6': 'I think Councilman Flynn and perhaps some others were concerned that the use of the word at least might appear to green light something beyond what the ordinance intended. But but I think it's still, at the end of the day, has essentially the same meaning.'",
        "'speaker_6': 'And if you all agree, it's a clarification worth doing. The intent here absolutely is to say city law requires in future common in interest communities that there be a simple majority before a claim is brought.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Gilmore. Councilman Espinosa.'",
        "'speaker_5': 'I apologize if I got something. Clarification on this. Was there a clarification on how ownership would be handled in multiple building situations?'",
        "'speaker_6': 'Not in this amendment. There was some other offline discussion about that issue with a couple of your colleagues. But unless something else happens here tonight, that that issue is not subsumed in this amendment. I understand that. I may be asked about that comment on that issue a little bit further later on when you get past this amendment'",
        "'speaker_6': ', there may be other discussion of the bill where we'll talk about the issue of multiple building type condominium developments.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Spinoza, Councilman Flynn, you back up.'",
        "'speaker_9': 'Thank you, Mr. Brennan. Just to clarify for Councilman Espinosa, he's exactly correct. We did have some discussions and we may have some down the road about the ability to separate out a multiple building project. Mostly, we've had in mind with this bill, we've had in mind single buildings, high rises, etc. But I have some projects in my'",
        "'speaker_9': 'district that consist of 30, you know, 25, 30 buildings and where defects affect only a portion of that. We wanted to maybe look for a path forward to proceed with how best to deal with resolving those, but it's not necessary to do that tonight.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Flynn. Any questions? Comments currently on the motion. And then we'll get to the bill as amended, seeing none. And I'll wait a second. I'm Secretary Rocco.'",
        "'speaker_4': 'Flynn. I Gillmore. I Cashman. I can ege Lopez. I knew Ortega. I Susman Black. Brooks Clark. All right. Espinosa. Hi, Mr. President. I.'",
        "'speaker_1': 'Councilman Cashman.'",
        "'speaker_6': 'I thank you, Mr. President.'",
        "'speaker_1': 'Got it. Thank you, Madam Secretary, please. Because of only now, the results. 3939 as councilor 811 has been amended. Now, Councilman Ortega, we a motion to pass has amended.'",
        "'speaker_7': 'Are we not going to talk about the the bill before we pass it as amended?'",
        "'speaker_1': 'You have. We have to first put on the floor.'",
        "'speaker_7': 'A move that council bill 811 be ordered published as amended.'",
        "'speaker_1': 'A place on final consideration.'",
        "'speaker_7': 'Be placed on final consideration and do pass as amended.'",
        "'speaker_1': 'Got it. Moved in second. Councilwoman Ortega, you're up.'",
        "'speaker_7': 'I wanted to speak more about the issue that was just raised a few minutes ago about the multiple building situation. We've got a number of large developments that will be happening that have been approved by this body. Those projects have not yet been constructed.'",
        "'speaker_7': 'We don't know what the ownership is going to look like. So several of us were engaged in conversations with our city attorney, looking at how we might address that particular issue, where multiple buildings are under the same ownership or the same way, where a defect may only exist in one building.'",
        "'speaker_7': 'But in conversations with our city attorney and I'll let David speak in just a minute. He was explaining that even though the so you would have to engage the whole way for the entire complex, even though it might only affect one building.'",
        "'speaker_7': 'But the fact that a claim would be filed through the highway, in turn affects all those other buildings. And, you know, there may be some things that the state legislature will be looking at related to this or some other concerns, because this particular issue was raised by one of our state senators, and we know that more than'",
        "'speaker_7': 'likely they're going to be dealing with this particular topic again in this next legislative session. And, you know, whether they get there or not is yet to be seen because we know they've been dealing with this particular legislation for the last couple of years.'",
        "'speaker_7': 'But, David, I'd like to ask you to just elaborate a little further on the conversations we've had about why it would be challenging to try to do an amendment that really would not have the effect that we're hoping that it would have where we have multiple buildings under the same nature.'",
        "'speaker_7': 'We.'",
        "'speaker_6': 'Yes. How come it briefly and then be happy to answer any follow up questions as well. Bear in mind that the 50% consent by the unit owner unit owners applies to claims brought by the association so that the Board of the association can't just would not be able to do it unilaterally if if a claim is going'",
        "'speaker_6': 'to be brought in the name of the entire association. That's what would trigger the need for 50% consent. So that's exactly what the bill applies to and all that it applies to. Now, a couple of nuances of this that we didn't talk about last week.'",
        "'speaker_6': 'There are some situations in large and more complex developments where there may be such a thing as a master association and sub associations of unit owners. And if that were the scenario in a particular development, then the majority consent would potentially be in one of these sub associations, right?'",
        "'speaker_6': 'That the entire legal framework and structure of the entire development might allow for the vote to occur in some smaller unit because it's hierarchical and broke broken down that way. So that's a possibility. But but in those kinds of arrangements, but something else to emphasize, again, it's only majority consent for claims brought by the association on behalf'",
        "'speaker_6': 'of the association and not so other scenarios where it's conceivable that you could have claims by individual unit owners or by a group of unit owners regarding defects in the portion of of their unit they happen to own.'",
        "'speaker_6': 'There's no majority consent associated with those kinds of claims. Those are just being brought by the individual unit owners. So the whole 50% thing doesn't even apply to that scenario. Now, the main global legal explanation that we gave to Councilwoman Ortega and to others who have asked this question is that is that bear in mind that the'",
        "'speaker_6': 'purpose of one of the main purposes of the majority consent requirement is because in an association hall unit owners fate is tied together. They have a legal relationship all with one another, including assessments to pay for repairs and so on and so forth.'",
        "'speaker_6': 'If there are problems in the entire association, when an association brings a claim, even if it's related to the defects and only a part of a building or in one building and not others, all the unit owners are brought along in that claim.'",
        "'speaker_6': 'If they're all part of the same association, whatever cloud or whatever cost might be associated with the claim or borne by hall, even if the defects are only in a portion of the project or in one building and not another.'",
        "'speaker_6': 'So the rationale for the bill, having informed consent of everybody in whose name through the association the claim is being broad, would apply even in the multiple building scenario. Everybody's unit is going to be tied up in that.'",
        "'speaker_6': 'If the if if a claim is brought in the name of the association because they're all bound together index in that sort of a legal structure. So we urge you all to consider that and say and understand that the purpose of the bill still applies, whether it's one building or whether it's multiple buildings.'",
        "'speaker_6': 'And we urge you to to keep that particular provision intact for majority concern.'",
        "'speaker_7': 'Mr. President, if I may, I just wanted to clarify that some of us were concerned about how challenging it might be for people in one particular building that was affected where other buildings might not be. And again, we don't know what the make up of the buildings are going to look like for some of the future development'",
        "'speaker_7': '. But in the case where that might exist, the concern was that to get 50% plus one of not only the people in your your building per se, but the entire h.O.H. To then move forward with a claim would be a little more challenging.'",
        "'speaker_7': 'And that's why we were looking at this as sort of a solution to not make it more difficult and more challenging for those folks in that particular building that are affected. Having heard the explanation, I chose not to move forward with an amendment at this time because it doesn't appear that it's going to make a difference.'",
        "'speaker_7': 'And I think it may be important to continue to look at other ways to try to solve this. I mean, I also want to make sure that other people who would be affected have the opportunity to know that a claim is coming forward and the entire complex, if you will, would be affected by the the fact that'",
        "'speaker_7': 'a claim is being filed. And if somebody wants to sell a unit, a unit there, they're not able to do so. So, you know, this may be a conversation that we continue into the future, but at this point in time, I am not bringing an amendment forward.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Cashman, you're up.'",
        "'speaker_6': 'Thank you, Mr. President. As with most of my colleagues and probably most of you out there, I've tried over the last couple of months to come to grips with this issue of how we can nudge the development community into constructing well-built for sale condominiums by reducing the risk of high award lawsuits, while at the same time maintaining'",
        "'speaker_6': 'or bolstering protections that allow redress for homebuyers who are victimized by quality failures in the homes they've purchased.'",
        "'speaker_2': 'Hmm. Excuse me. The bill.'",
        "'speaker_6': 'The bill's been crafted clearly to stimulate construction, to provide additional home buying options to those who want to make Denver their home. While it does give a small nod to the interests of home buyers. When something goes missing in the construction process, the bill is not designed with protecting homeowners interests as its prime directive.'",
        "'speaker_6': 'The element of the bill that that's been discussed of informed consent does make it a bit more difficult to file legal claim instead of a simple vote of board directors. I recognize that the positive side of this is that homeowners won't be caught unaware of the situation that impacts them.'",
        "'speaker_6': 'But Section ten, Dash 203 that talks about this goes into great detail on the seven consequences of filing suit, all of these conditions, except one that lists an approximation of an award. They might look forward to focus on deadlines, costs and liabilities that point out the potential downsides of filing an action that might dissuade someone from going'",
        "'speaker_6': 'forward. This requirement of informed consent for me doesn't follow to the other side of the equation. Section ten Dash 204 states that by taking title to a unit, each owner acknowledges and agrees that the terms of the declaration requiring alternative dispute resolution of construction defect claims are a significant inducement to the declarant willingness to develop and sell'",
        "'speaker_6': 'the units, and that in the absence of the alternative dispute resolution provisions contained in the declaration, declarant would have been unable and unwilling to develop and sell the units for the prices paid by the original purchasers. Ten Dash 204 goes on to say in harmony with the Village Court decision that the ordinance, quote, expressly prohibits any future'",
        "'speaker_6': 'amendment to the declaration that would modify or eliminate the requirement for alternative dispute resolution absent the consent of the declarant. My my researches has brought forth the fact that these declarations often include provisions that might tilt arbitration in favor of the builder by limiting the scope of the arbitration proceedings tend to allow for means that not only'",
        "'speaker_6': 'can the HRA not remove the requirement for arbitration, as was the landscape possibility before of LIGO. But it also means as well that any conditions that are part of the declaration that may limit the scope of the arbitration may not be altered either.'",
        "'speaker_6': 'With all of these warnings in mind, I would think similar codification of the seller's responsibility to inform homebuyers, with similar emphasis about the precise meaning and implication and limitations that might be inherent in the arbitration agreement. In the sales agreement in a true way declaration, including in-depth explanation of the fact that arbitration is a means of dispute'",
        "'speaker_6': 'resolution, does not necessarily carry with it the same protections of a trial in a court of law and may carry with it substantial costs, not necessarily attendant to a court proceeding. It appears to me that the things that I'm looking for that would provide the consumers the most, the support they're craving require changes to Colorado's Uniform Arbitration'",
        "'speaker_6': 'Act. It is this act is my understanding, that allows the arbitrator to establish the format that will govern dispute resolution. And that format has no requirement to follow the structure. You may be. Miller with in a court of law important to changes important changes to state law are needed before I will be able to play the role'",
        "'speaker_6': 'I had hoped to play in support of this bill. So I will be unable to support it this evening.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Councilman Espinosa.'",
        "'speaker_5': 'So, you know, there I, I have several developments in my own district that have a sort of combined two building scenario, one where one building is, in fact, bigger than the other. So if you had a problem in the smaller building, meaning in the let's say the larger building, you could, then what you're saying is get get'",
        "'speaker_5': 'the majority of that one building. And then if they're all part of the same H okay, encumber the other building. Is that correct?'",
        "'speaker_7': 'The vice versa.'",
        "'speaker_6': 'If majority consent, if there's one association and majority consent is obtained from the unit owners in that association, a claim can go forward.'",
        "'speaker_5': 'Okay, so then can the covenants, the initial covenants be written to prevent sub associations from being created?'",
        "'speaker_6': 'It's sorry to prevent what from being created by association.'",
        "'speaker_5': 'So say you say you're in that situation where one building is is is got the problems and the other building doesn't because maybe there was a contractor change after recognizing that the failings of one and so let's just say that everyone in the development is altruistic enough to sort of agree that we're going to let we're going'",
        "'speaker_5': 'to we're going to split our away. We're going to hit our 51% and divide one building from the other. Could could the covenants be written to actually prevent that from happening?'",
        "'speaker_6': 'Well, at some point I may have to beg off in terms of some of the technical hypotheticals you're raising. But as I understand it, they basically, if it's hard wired in originally to the covenants that there's going to be one association you buy in this development, you're a part of the association and you wanted to change to'",
        "'speaker_6': 'a different structure that would require an amendment to the covenants. And the Colorado Common Interest Ownership Act very specifically says amendment can occur without majority consent or up to 67%, depending upon how it was written originally. Right. But but you'd have to go through the an amendment process for the original covenants to be able to go to'",
        "'speaker_6': 'a different governance structure. I think in answer to the hypothetical that you're raising.'",
        "'speaker_5': 'No, that's good. And it means the same threshold to subdivide is the same threshold to to agree to to get into the claim to file a claim.'",
        "'speaker_6': 'Well, just to be clear, hypothetically, it could be more because Kiawah allows covenants to put in in order to amend has to be at least 50 can be up to two thirds. So and I understand and others, again, have more real world experience in the room than I do, but that that is fairly common to have a'",
        "'speaker_6': 'higher threshold for amendments to the covenants, because Kiawah allows that to to be true in Colorado generally. Hmm.'",
        "'speaker_5': 'Okay. Council President, are we offering our comments at this point? Yes. Okay. So that's that's good information, sort of. Uh, I'm still that's not going to change my own thoughts on this matter. So I'm going to say my sort of prepared remarks here, because this directly, my concerns, I do have concerns based on what we were just'",
        "'speaker_5': 'talking about. But I do think that there's an opportunity to correct that down the road if, in fact, these manifest themselves in some sort of way. So the current defect, the current construction defects laws have not stopped construction in this boom.'",
        "'speaker_5': 'We have built lots of single family homes, townhomes, commercial low rise to high rise. One market segment is lagging behind the one market segment that's lagging behind as condos. So this really is, in my opinion, condo defect reform.'",
        "'speaker_5': 'There are no guarantees, but this law is at least an attempt to break the stalemate, making the development process more predictable for the buyer and the contractor alike. I am strongly pro-consumer and pro homeowner, so I will play.'",
        "'speaker_5': 'I will pay close attention to the market and the industry. And if it becomes apparent that buyers are being taken advantage of by this change in a way that is negatively impacts them, I would advocate that Council revisit this law when that if that starts to occur, because I, I do think, you know, there are things like'",
        "'speaker_5': 'this that that give me pause, but not enough because of the sort of strength and transparency of this proposal. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Councilman, do.'",
        "'speaker_8': 'I want to thank David Rowell and our work on our amendment to craft this fine amendment? I think this ordinance would do a great have great effect on increasing the number of condominiums we have constructed for especially for middle income families, as well as for senior citizens.'",
        "'speaker_8': 'I'm looking forward to this passing tonight. I think the thing to remind is the state law schools is closed here. There, gives full protection to homeowners. And this law has no effect on the protections given by the state law to homeowners.'",
        "'speaker_8': 'Homeowners must be protected and they will under the construction defects legislation by the state. I'm hoping that our will be a are willing go along with other municipalities in encouraging the state to look at the state law and and make changes.'",
        "'speaker_8': 'I intend on supporting this tonight and I encourage my colleagues to do so. Thank you.'",
        "'speaker_1': 'Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. I just wanted to add that why is this important? It's because right now for many people who are wanting to buy. There. There is limited new construction for sale housing being built in this city and.'",
        "'speaker_7': 'We have an inclusionary housing ordinance. So anybody that's building over 30 units in the city of for sale units would have to include affordable units within that development. I don't have to tell any of you what a challenge it is for individuals who are trying to purchase in this city, what the price of housing has done to'",
        "'speaker_7': 'making it unattainable for many, many families. And by allowing this to move forward tonight, it ensures that as our development community moves to build more condos in this city. And our hope is that this legislation will assist to some degree in addressing the insurance issue that would then allow these units to move forward.'",
        "'speaker_7': 'It means it it opens up other opportunities for individuals and families who are trying to find something they can afford. Besides the fact that the city has worked very hard and I want to commend my colleagues. Councilwoman Connie Chung, Councilman Brooks, in working with the administration to identify resources and to look at a dedicated revenue stream that'",
        "'speaker_7': 'will assist us in producing more affordable units in this city. It takes time for the units to come online. And, you know, as I indicated earlier, we've got a number of development projects that this body has approved that have not yet been constructed.'",
        "'speaker_7': 'There's a potential that some of those developments can be for sale, as well as rental housing. But it's important that we have a mix of different type of housing in this city that increases or creates the opportunity for a variety of income levels of people to live in this city.'",
        "'speaker_7': 'I don't want to see us become like a manhattan where the only people who can live in Denver are the people who have high incomes and can afford the price of housing. I think it's vitally important to having, you know, the kind of diverse city that we have always been to have that mix of income levels.'",
        "'speaker_7': 'And so that's why I will be supporting this tonight. I will also pay very close attention to the effects that this will have on the purchaser, the consumer. We know that this legislation won't do anything for people who have already purchased and who may have been dealing with issues.'",
        "'speaker_7': 'This only deals with projects moving forward after the legislation is adopted. And so some of us will will look at that carefully. And if we need to bring this legislation back in and deal with it further, will do it.'",
        "'speaker_7': 'We'll do it at that time. You know, some of us are crossing our fingers and hoping that this will result in more units being constructed. We've heard some developers saying they want to wait until there are further changes at the state house before they will, you know, take any steps to build for sale units.'",
        "'speaker_7': 'But, you know, this is all kind of in hopes that this takes moves the needle a little bit further in encouraging developers to take that step and build these for sale units. So thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Brooks.'",
        "'speaker_5': 'Thank you, Mr. President. You know, I made most of my comments when we were in the as I chair the business committee. But I just want to again and my support behind this bill, I think I want to thank David Bravo for putting a well-crafted bill together, one that I think sets a great example for other municipalities'",
        "'speaker_5': 'who are dealing with this in the in the state and also. Sheds light.'",
        "'speaker_2': 'To our to our state.'",
        "'speaker_5': 'Capitals. The folks in the legislators saying, hey, our capital city has taken a bold step in the right direction. You know, in light of the conversation tonight, though, I do want to say that the Business Development Committee would like to revisit this in June after let after the legislature meets so that we can review how we're doing'",
        "'speaker_5': 'on our folks coming to the table on construction and some of these issues and.'",
        "'speaker_2': 'Concerns that I think.'",
        "'speaker_5': 'Council members have that we can address.'",
        "'speaker_2': 'Some of those as well. So I stand.'",
        "'speaker_5': 'Support behind this and I hope that all the colleagues as.'",
        "'speaker_2': 'Well can get on board. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Any other comments? 811 as amended. Steve Nunn Madam Secretary, roll call.'",
        "'speaker_6': 'Flynn I.'",
        "'speaker_4': 'Feel more. Cashman.'",
        "'speaker_6': 'No.'",
        "'speaker_4': 'Kenny Lopez. I knew Ortega Susman. I black Brooks Clark. All right. This Wednesday. Mr. President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_4': '12 eyes one day.'",
        "'speaker_1': '12 eyes one day. 811, as amended, has been placed on final consideration and does pass. I believe that was all the bills that were called out. So we were ready for the block votes. All of the bills for introduction are ordered published.'",
        "'speaker_1': 'Councilwoman Ortega, will you please put the resolutions on the floor for adoption in a block.'",
        "'speaker_7': 'And move that the following bills be placed on final consideration and do pass in the block vote? Council Bill 829 eight 3839 eight 4841.'",
        "'speaker_1': 'Councilwoman Um, those are the right ones, the ones I'm looking at. Are you reading bills on final or the bills for introduction? Resolution URIS You're in. The bills were final. Councilwoman Okay, we're gonna get to those right now.'",
        "'speaker_1': 'It's just the resolutions. Oops.'",
        "'speaker_7': 'I started backwards. Okay. Resolutions. Council. Will they move for the adoption of Council Bill 867. It's 857 858, 859 868, 64, eight, 66, eight, 55, eight, 61 and 69.'"
    ],
    "Rezoning of South Sloans Lake Property from 5 to 8 Stories in Council District 1.": [
        "'speaker_7': 'It is separated into two different sections. The framework plan is the part of the plan that tells us this is where we should take our direction for zoning changes. The district plan portion of the plan tells us this is where we should look to define some of the characteristics of specific areas in the planning area.'",
        "'speaker_7': 'So the framework plan defines this area as a town center. And tells us to focus intense and strategic growth areas to the town centers to introduce a greater share of market rate housing units to support infill development and mixed use projects, especially in our town, in the areas designated as town centers, and to focus the most intense'",
        "'speaker_7': 'structures and uses in the dense core and ring that dense core with medium intensity structures that taper in height, mass and scale to fringe areas and to the existing neighborhood. So the South links lines like general development plan, as I said, adopted in January of 2014.'",
        "'speaker_7': 'There are several pertinent things on this graphic. The dashed line is the core area that defines where the greatest height and intensity of land usage should occur. The there are definitions of the maximum stories that could occur on each of the blocks and then a definition of the height transitions that should occur and for the subject block'",
        "'speaker_7': '. The height the height is set at between one and 20 storeys. And the transitions are, as you see, similar to the deal five, with a transition to five storeys on both 17th Avenue and Quitman Street. So this map amendment will result in a uniform application of zone districts across the city.'",
        "'speaker_7': 'So we feel like that second criteria is met. It also will implement, well, further the public health, public health, safety and welfare by implementing our area plans and by doing what our plan says. Having that dense core and stepping down to the existing neighborhood and the justifying circumstance for this is changed conditions.'",
        "'speaker_7': 'The land or its surrounding environs has changed or is changing to such a degree that it's in the public interest to recognize the changed character of the area. And I guess nothing can be more changed than redevelopment of a vacant site where the hospital left.'",
        "'speaker_7': 'So we feel that that criteria is met. The CMA eight does promote urban center, promotes the pedestrian scale, diverse areas, multiple residential and commercial buildings, and is intended to apply to areas primarily served by arterial streets. In this case, it's served by a collector, mixed use collector.'",
        "'speaker_7': 'So the. Neighborhood context. We feel that it meets the definition of urban center and conforms with the center, the urban center context not speaking well tonight. The DOE five does require that five stories step down on 17th Avenue and Quitman Street that also conforms to our area, most importantly, to our West Colfax Plan and our general development'",
        "'speaker_7': 'plan, but also to the intent of the design orally. So with that, staff recommends approval of this rezoning application.'",
        "'speaker_1': 'Thank you. We have ten speakers signed up. I'm going to call the first five and ask the first five. Come up. You can make your way to the front pew. Cameron Bertrand, Larry Ambrose, Megan Yankee, Corinna Carlsen and Kim Koo.'",
        "'speaker_1': 'Sarah. So you can make your way up to the front pew and Cameron, you can begin your remarks. And you have 6 minutes to.'",
        "'speaker_5': 'Thank you very much. Thank you all very much for having us here tonight. My name is Cameron Bertrand and I work for EFG Sloan's Lake One LLC, and we are the applicant that is in Microfinance Group Company. And you have seen me here before.'",
        "'speaker_5': 'We feel strongly that the proposed rezoning meets the city criteria and obviously encourage you to vote in favor. There have been significant changes to the neighborhood that warrant consideration of the rezoning. Obviously, I think the largest of these two is both the relocation of the hospital and the redevelopment of that site, as well as the light rail'",
        "'speaker_5': 'coming to the West Colfax corridor. In addition to complete in 2000 and Blueprint, Denver City Council has passed the West Colfax Plan. That is the plan that we focused most strongly on when we sought to redevelop the former hospital complex.'",
        "'speaker_5': 'And we feel strongly that this proposed rezoning is very much in conformance with that. It it incorporates and recommends a number of recommendations, including many of those in the St Anthony's task force, which preceded and created a basis for the West Colfax Plan that included a diversity of housing options and encouraged the creation of a town center'",
        "'speaker_5': 'to provide new neighborhood serving retail opportunities and to anchor the development by a public gathering space or open or open space. In our master plan and in the general development plan, you'll see that Raleigh Street is that town center.'",
        "'speaker_5': 'That's the area where we focus the retail and office concentration. And the Chapel Plaza in that general development plan is that open space center. So it's around that that you see in the development where we're trying to encourage the densest housing options.'",
        "'speaker_5': 'And so for that reason, this block immediately across from the Chapel Plaza, we think is appropriate for denser development. The plan also, as Teresa mentioned, calls for residential development to taper as we go towards the single family neighborhoods on the sides.'",
        "'speaker_5': 'And we believe that the design overlay that city council has already passed helps effect that by holding development to three stories directly across from single family detached housing and to five stories on West what, 17th Avenue itself? It's also worth noting that at CMC's eight, that step back creates a shadow effect in which the eighth story stepped'",
        "'speaker_5': 'back to the south, and the five story on 17th Avenue have almost an identical shadow. So there's really no shadow difference at a CMCs eight zoning because of the design overlay, which we think is something that came up in many of those neighborhood meetings and as a is a positive for this.'",
        "'speaker_5': 'As explained in staff report, the rezoning is being uniformly applied is consistent with the neighborhood context description, the the zoned district purpose and intent statement and is a positive for the general health, safety and general welfare of the neighborhood.'",
        "'speaker_5': 'As a proposal as the applicant, we believe the rezoning will help to ensure the diversity of housing options that's also called for in the plan and will help make it a reality to ensure the vitality of the neighborhood retail.'",
        "'speaker_5': 'In the case of our site, these plans are actually very much a reality. There's over 90,000 square feet of retail and office under construction on the broader San Anthony site today along West Colfax and along Raleigh. So it's coming to life.'",
        "'speaker_5': 'The housing option, the housing developments that are either under construction are planned, are many and diverse. They include market rate, workforce and affordable rental housing. They include townhomes, condominiums and IHG units. And so we believe we have been very successful in trying to implement the vision of of the West Colfax Quarter plan in preparing for tonight's meeting'",
        "'speaker_5': 'we have for community meetings specifically on this topic. In addition to more than 80 meetings we've held over the course of the entire project, attendance at those meetings was strong and the response was generally favorable, with most questions related to parking, traffic and others that you might expect in a development conversation.'",
        "'speaker_5': 'Given the holiday week. And the fact that at our last hearing I think it took three and a half hours to get through our speakers. We encouraged people to write letters of support rather than come out and speak.'",
        "'speaker_5': 'I believe you've received 12 of those to date. There was one letter, to my knowledge, that was expressed a concern. So with that, we again encourage you to support the rezoning. We appreciate the opportunity to have worked with the city especially.'",
        "'speaker_5': 'Staff, Theresa and the others in committee planning development. And we're happy to take any questions when the time is right. Thanks.'",
        "'speaker_1': 'Thank you, Larry Ambrose. And Mr. Ambrose, you have 6 minutes and.'",
        "'speaker_6': 'Good evening. I'm Larry Ambrose, 1750 Meat Street. I'm the vice president of the Sloan's Lake Neighborhood Association. The beginning of this hearing, there was reference to the the right of judicial review, an important part of the democratic process that I am here because there is a, um, as we speak, a consideration of a rule 106 a for'",
        "'speaker_6': 'review of the City Council decision regarding block one of this development. I just want to review the, um, the basis of that challenge, which was that and is that the zoning did not conform to, in our opinion, the West Colfax Plan.'",
        "'speaker_6': 'The West Colfax Plan was a process that I participated in and many others in our neighborhood back in 2006. We also had a concurrent process called the St Anthony's Redevelopment Task Force Planning Process was more than 100 people participated in that process, and it consisted of business people, developers and neighborhood residents, city officials.'",
        "'speaker_6': 'It was a year long process in which there was developed guiding principles, a number of guiding principles. And although block one and block two conform to many of those guiding principles, the paramount guiding principle in that Saint Anthony Task Force report was one that had to do with where the tall buildings were to be located.'",
        "'speaker_6': 'And in that task force report, it was recommended that the tallest buildings be towards West Colfax. What did that mean? Well, first of all, recognize that that process was not just a neighborhood process. It was a process that involved a lot of different players.'",
        "'speaker_6': 'And what the neighborhood wanted at that time was was actually diluted somewhat. But what we did get out of that process was the concept that the tallest building should be towards Colfax, not on 17th Avenue, not on the park.'",
        "'speaker_6': 'In other words, back towards West Colfax, it was very clear that was part of the outcome and those guiding principles were incorporated into the West Colfax plan. The challenge that we the city is is is making to that plan is that that guiding principle is not important.'",
        "'speaker_6': 'You know, when you talk about and I'm sure you hear this from your constituents as well, when you talk about zoning, the most important thing to people is where the tall buildings are. I don't think people are against high rises.'",
        "'speaker_6': 'It's where they're located. It is a it is a crucial part of zoning that an open space, which we didn't get either in that plan and this current plan, but very, very little of it. And how did this happen?'",
        "'speaker_6': 'It happened through what's called the general development plan process. And I want to just run by you and ask you please to consider what's going on with the general development plan process prior to 2010. The general development plan came after the zoning.'",
        "'speaker_6': 'It is a technical document, not a planning document. It was intended to follow the zoning and come up with the infrastructure, the sewers, the streets, the streetscape planning, the infrastructure for buildings that were determined by the zoning, the height of the buildings, the density of the buildings were determined by the zoning, not by the general development plan'",
        "'speaker_6': '. We have reversed that process in 2010 to where the GDP sets the height of the buildings, sets the open space. It actually determines the density. That decision making responsibility was taken away from city council, given to the Planning Office and the Denver Planning Board.'",
        "'speaker_6': 'You no longer have say over that and now you consider it even on those slides. When they put that slide up, it said adopted plan. You adopt plans, not the planning board. You adopt plans. It's not an adopted plan.'",
        "'speaker_6': 'It means nothing. It should be coming after the zoning. Now, a year ago, Mr. Buchanan convened a task force. It consisted of five neighborhood representatives, five people from the city and ten developers. We met for four months. We had five meetings.'",
        "'speaker_6': 'And at those meetings we talked about where does the GDP fit in? Everybody on that task force agreed. It comes after the zoning, except for Mr. Buchanan and one member of the planning board take back that decision making responsibility.'",
        "'speaker_6': 'Now, this GDP has been given more power and determined heights. Yes, the GDP says that you can have up to 20 storeys on this building, but it comes after the zoning and the this will still be the tallest building on the site.'",
        "'speaker_6': 'So the same principles that are involved in this challenge, this review of the zoning that occurred in 2014 on February 2015 and February are at play here today. The court is deciding this now. It is before the court, although the city challenged standing number one.'",
        "'speaker_6': 'We do have standing we have complainants who have standing. And the court will consider the merits of this complaint. The other thing that you should realize in this in this sir in this complaint is that the city is arguing that small area plans are not.'",
        "'speaker_6': 'They don't you don't have to be consistent with smaller plans. They've actually argued that the comprehensive plan and the small area plan are only advisory and do not have to be followed if that is the case. Ladies and gentlemen, why do we have community planning at all?'",
        "'speaker_6': 'Why should we participate.'",
        "'speaker_1': 'In this process? Your 6 minutes is up. Sorry.'",
        "'speaker_6': 'Okay. I just ask you to postpone your decision on this until the court decides. Thank you so.'",
        "'speaker_1': 'Much. Thank you, sir. Megan Yankee.'",
        "'speaker_3': 'Good evening. This is my first city council meeting, so hopefully you'll be kind. I'm a homeowner and resident of District One off a big Xavier Street, a new homeowner. So when you're talking about making affordable housing, it was very difficult for us to get into this neighborhood that we loved.'",
        "'speaker_3': 'And one of the things that really drew us to this neighborhood was the St Anthony's development. It was the community's investment in density, pedestrian and really forward looking uses of this property. So I'm here not just speaking for myself, but also the we can organization, the R.A., no one else on the board could attend this evening.'",
        "'speaker_3': 'So I'm attending in their place to emphasize the letter that we submitted on behalf of the R.A. in support of this project. So with due respect to the comments that have been made previously, we believe that this development plan and rezoning is consistent with our goals for the neighborhood in terms of density, commercial development, etc..'",
        "'speaker_3': 'So keep my comments brief and to that point.'",
        "'speaker_1': 'Thank you. Could you say your name for the record, please?'",
        "'speaker_3': 'My apologies. Megan Yankee. Thanks.'",
        "'speaker_1': 'Thank you. Next, Karina Carrasco.'",
        "'speaker_3': 'Yes. Good evening.'",
        "'speaker_4': 'Carina Carls Guard at 4745.'",
        "'speaker_3': 'West 38th Avenue, unconcerned with uncontrolled and rapid growth and development in the city of Denver. Many of these inhibit pedestrian bicycle traffic as well as discourage the growth of small businesses. Zoning codes, even for Main Street uses, are intended to ensure new development contributes positively to established residential neighborhoods and character and improves the transition between commercial development'",
        "'speaker_3': 'and adjacent residential neighborhoods. The concern here is that many of the new proposed developments do not support this city's intended zoning purposes. As a business owner, I opposed the clean carwash development at 4895 West 38th Avenue for these reasons.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. Next we have Kim Kucera and as Kim comes up, I'll call the next five speakers Teri, Carl Gard, Brenda Lawson, Megan Doyle, Rachel Klein and Dan Schorr. You can make your way to the front. Make sure you can begin.'",
        "'speaker_3': 'Hi, I'm Kim Key. Sarah, 1660, Lincoln number 1800. And I'm actually reading a letter into the record from Mr. FEIBEL Goliad. His comments are as follows. My address is 5100 West 14th Avenue. It was my intention to appear at this hearing, but I can.'",
        "'speaker_3': 'I am unable to do so. I appreciate the privilege of having my comments read into the record. I live in the neighborhood. I am employed in the neighborhood. And I own property four blocks west of the development site.'",
        "'speaker_3': 'When I moved here 25 years ago, I joined the efforts to pull our neighborhood up by its bootstraps. The fruits of our efforts in trying to revitalize the neighborhood into a family friendly area with neighborhood amenities have been long in coming.'",
        "'speaker_3': 'We have found the LFG team to be uncommonly open, receptive to community input and responsive. Progress comes at a price and from my perspective, I see the palpable positive vastly outweighing the theoretical negative. The inclusion of a world class developer who is prepared to add upscale rentals to the mix of retail, buy to own and other economic'",
        "'speaker_3': 'levels of rental increases. The potential positive impact on the neighborhood. And if a world class developer with an excellent reputation needs to request the city to tweak the zoning requirements by a few stories in order to include retail on the ground floor with sufficient residential above to support the retail and the overall project.'",
        "'speaker_3': 'It seems little to ask in order to include his product and eventual impact into the project and the neighborhood. I would respectfully suggest that city council approve the zoning change request. Thank you.'",
        "'speaker_1': 'Thank you. Terry Carlstadt.'",
        "'speaker_6': 'Good evening. And it's Terry Curls Guard 4745 West 38th.'",
        "'speaker_2': 'I'm concerned about the rapid pace of development without.'",
        "'speaker_6': 'Proper vetting by the city.'",
        "'speaker_2': 'And in particular the residents of our neighborhoods, and specifically the threat to public safety and noise in our neighborhood. 30th. These developments have deliberately been kept under the radar and permits fast tracked without the opportunity for resident comment or approval.'",
        "'speaker_2': 'Public safety concerns and compromising the character of our historic neighborhood. A case in point is the Gilliam carwash planned, or I should say the high volume gleam carwash planned for 38th and Wall Street? This facility is planned to service in excess of 2000 cars a day and with only an entrance and exit off of Wall Street, not'",
        "'speaker_2': 'on 38th. And I think that's a really key point to understand. Is it only on Wolf and not on 38th or Harvey Air? And this, again, is a major public safety issue that we're concerned about, and it has definitely put itself outside the character of our neighborhood.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_1': 'Thank you. Brenda Lawson. So we see how.'",
        "'speaker_3': 'Good evening. My name is Brenda Lawson. I live in the Berkeley neighborhood. I just wanted to express my concerns for overdevelopment in the residential neighborhoods and how single family homes will be affected.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_1': 'Thank you, Megan Doyle.'",
        "'speaker_3': 'Good evening. My name is Megan Doyle and I live in the Berkeley, Berkeley neighborhood as a third generation Colorado native, Denver native and a third generation Denver homeowner. I would like to express my concern for overdevelopment in residential areas and the negative.'",
        "'speaker_7': 'Impact that this has.'",
        "'speaker_3': 'On the adjacent neighborhood character, especially those of us that are single family homeowners. That bringing all of this development into our neighborhoods not only increases pedestrian traffic, bicycle traffic and automotive traffic, it just kind of is crowding everybody out.'",
        "'speaker_3': 'And I specifically have concerns with high volume businesses, especially the Glen Carwash proposed on 30th Avenue. Thank you.'",
        "'speaker_1': 'Thank you. Rachel Klein.'",
        "'speaker_3': 'Scare. Hello. Rachel Klein. I'm concerned with the development in Denver and the rapid pace at which it's happening. I'm concerned with city approval of projects without first assessing neighborhood impact, specifically from current residents. I'm also concerned with a high traffic business encouraging traffic in vehicles into a neighborhood that prides itself on walkability, in addition to health and'",
        "'speaker_3': 'safety concerns that come with that development. And because of all of these reasons, I am opposed to the gleaming car wash occupying 4895 West 38th Avenue. Thank you.'",
        "'speaker_1': 'Thank you, Dan Schorr.'",
        "'speaker_2': 'Thank you, members of council for entertaining our comments. I'm here for the West Colfax Business Improvement District and the district is very supportive of this project. And there really I mean, it grows out of the alignment with the project and the West Colfax plan.'",
        "'speaker_2': 'That's the primary reason. But I really want to talk about and people had mentioned the overlay as sort of reflecting the concerns about tapering to the neighborhood. But I think the most important part of it is that this is an important contribution to creating in West Colfax and really a mixed income and pedestrian friendly neighborhood.'",
        "'speaker_2': 'That pedestrian friendliness and sustainability are really facilitated by relatively high densities, intensities of development in areas where it makes sense. And, you know, that's what the plan called out this as one of those intense areas for intense development without, you know, a reasonable number of pedestrians, as we're finding on West Colfax, it's very hard to to get'",
        "'speaker_2': 'the kind of infrastructure to enable crossing of Colfax, for example, that one of the key considerations is how many people are walking so and biking. So it's very important to have this kind of intensity density for that in addition and, you know, perhaps of even greater import to the business improvement district ultimately is that this supports the'",
        "'speaker_2': 'kind of businesses that people in the neighborhood have long clamored for wanted. I wanted. There are some good examples that are right on this site with some the Highland Tap and burger. But for us also, we're really very focused right now on a food co-op that would be very that would serve the full demographic of the neighborhood'",
        "'speaker_2': ', this kind of, you know, the additional rooftops, as it were. And people that will come as a result of this kind of development is a really important part of what makes that kind of retail amenity for all the people of West Colfax very important.'",
        "'speaker_2': 'So those are all the reasons or those are the primary reasons why we support it and encourage council to support it as well tonight.'",
        "'speaker_1': 'Thank you. Thank you. And just in case I missed it, could you just say your name for the.'",
        "'speaker_2': 'Dan Shaw S.H. Age shot?'",
        "'speaker_1': 'Thank you. All right. That concludes our speakers. Any questions from members of council? Oh, come on. There we go. Councilman Espinosa.'",
        "'speaker_5': 'Actually, this is this was on my list of announcements, and I forgot to chime in. But the mention of Clean Carwash actually has prompted me, so just bear with me. Tomorrow evening, my office is hosting a neighborhood meeting regarding the proposed carwash on West 38th Avenue at Wolfe and Xavier.'",
        "'speaker_5': 'The meeting is at 630 at the Denver Puppet Theater, 3156 West 38th Avenue. And I will have more comments, but I won't go into that. But it's a use by right situation, which is why you're probably hearing this at this public testimony, is that there's there's really no avenue for that.'",
        "'speaker_5': 'With respect to specific questions, I did have one. And where did I put that? Mr. Ambrose, you had handed me you inquired about doing a USB mean a USB drive to submit documents, but you didn't mention any of them, but you did give that to two counsel.'",
        "'speaker_6': 'So yes, there are a certified record and pleadings from the case and a new district court decision on standing is also included in the records that I've submitted. Okay.'",
        "'speaker_5': 'So you intended things. And Cameron.'",
        "'speaker_1': 'Bertrand.'",
        "'speaker_5': 'Had a question for Cameron as well. You have both the design review board and design guidelines and standards. Is that that's not codified in the design overlay? How is that? Is that through your metro district or what is what is the mechanism that puts enforces that?'",
        "'speaker_5': 'Got it. So the the original impetus for the design guidelines and standards and the design review committee is the general development plan. So the general development plan requires that one be created. So we created one and it runs in, I'll say, in favor of the Metropolitan District.'",
        "'speaker_5': 'So the Metropolitan District has recorded against the property the obligation for anyone who buys property within the development to go through the design review process. And the, the excuse me, the metropolitan district is who has created the design review committee.'",
        "'speaker_5': 'That committee is made up of three members of the community and two members of the Metropolitan District Board. And if I'm correct you, you extended an invitation for one of those three community member positions to somebody, I mean, to a group that is directly in opposition to block two.'",
        "'speaker_5': 'Is there a current vacancy there? There is not a vacancy on the board. There is, however, the. Well, so let me be clear. When when the design review committee was created, opportunities for positions were sent to all three of what I would call the most neighborhood of the neighborhood organizations West Colfax, Sloan's Lake Citizens Group and Sons'",
        "'speaker_5': 'Lake Neighborhood Association, Sloan's Lake Citizens Group and Sloan's Lake and excuse me, and West Colfax Association of Neighbors each held votes and put forward two members, both of which were accepted and put on the board. The Metropolitan District has the ability to expand the board.'",
        "'speaker_5': 'Six would be awkward, so I'm sure we would look at another way of doing that and it would take an act of the Metropolitan Board to do that. So at the time, the Sun Lake Neighborhood Association turned down the opportunity to play someone on the board.'",
        "'speaker_5': 'But what we have said in, you know, conversations is, you know, we the the intent of the design review committee is to, you know, allow the neighborhood input and oversight into implementing the design guidelines themselves. So that would always extend to all the neighborhoods.'",
        "'speaker_5': 'And we work with them on a way to make that happen, even if it's later than originally anticipated. Great. Thank you. And then one final question for Ms.. Megan Yankey. So she's still here. You said something that sort of threw me off because I thought was caught me we can was out of the business of supporting and'",
        "'speaker_5': 'I didn't actually get a letter of support.'",
        "'speaker_3': 'I misspoke on that. I thought that my colleagues were submitting a letter and I misspoke on that front. So I apologize.'",
        "'speaker_5': 'All right. Sorry. Thank you. Yeah.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman New. In your Mac from. Reverse.'",
        "'speaker_6': 'Yes, sir.'",
        "'speaker_8': 'Cameron, first of all.'",
        "'speaker_6': 'Cameron, first.'",
        "'speaker_8': 'Thank you. I'm sorry, sir, but I just want to understand a little bit about the town center concept and how that's going to be developed in this project. I sort of envision there is green space, open space restaurants and stuff.'",
        "'speaker_8': 'How is that being developed in this project?'",
        "'speaker_5': 'Yes, sir. It the when we put together the masterplan, we talked to a number of retail developers, all of whom encouraged us to have what I call two sided retail. So in Denver, successful active streets have retail on the ground floor and residential above.'",
        "'speaker_5': 'Given that Rawley Street is the street with the traffic light onto Colfax and Raleigh Street is the street one street where we own a block that actually fronts Colfax. We decided to make Raleigh Street that retail Main Street.'",
        "'speaker_5': 'So we have called for the development along that block to be anchored on Colfax, and that is very much happening with Alamo Cinema Drafthouse and another 55,000 square feet of office and retail on that block. It's also near an existing parking garage, so there's plenty of parking.'",
        "'speaker_5': 'And then it continues up the street at the ground floor level along Raleigh between Kansas and 16th, and then again between 16th and 17th. Some tenants have been announced already. Dan Reference Highland Highlands, Tap and Burger and then Mid-Block.'",
        "'speaker_5': 'There is the Chapel Plaza. The Chapel Plaza has retail on two sides. This block proposes retail on a third corner, but then this redevelopment and this rezoning would allow for that to happen. And then finally it would bookend at Sloan's Lake Park on two additional plazas, which would also have the opportunity for retail seating.'",
        "'speaker_5': 'So it's not meant to be a mall, if you will, or have hundreds of thousands of square feet. But to have a street level feeling similar to what you might see in parts of uptown South Gaylord Street, Pearl Street, Tennyson, classic Denver neighborhood, and provide this neighborhood with some services they don't have and complement what we think'",
        "'speaker_5': 'is happening on Colfax.'",
        "'speaker_8': 'And the open space and green spaces. Is that going to be configured into this? Where's that?'",
        "'speaker_5': 'Very much so. So it's configured throughout the site and a number of different plazas. There are three plazas on 17th Avenue across from the park, but then the largest piece is right at Raleigh and 16th Avenue. It's the site of the former shrine, which was part of the City Anthony's Hospital Project.'",
        "'speaker_5': 'It's a small chapel that was built in the thirties. We've preserved it and put about a half acre of open space around it. That open space opens up onto Raleigh Street and the retail there, and then we've made 16th Avenue wider than the typical street so that that street and the Chapel Plaza together create sort of a'",
        "'speaker_5': 'festival street. So the it's designed to be shut down for farmer's markets or community events. And so 16th Avenue, Chapel Plaza and Raleigh really are the heart of this development.'",
        "'speaker_8': 'Now, the question about transition of heights, you know, I'm very familiar with the plans that that really favored transition of heights toward a specific area. And and it seemed like it would just be natural to transition higher heights from Colfax down to the lake and allow everyone the maximum view that beautiful lakes.'",
        "'speaker_8': 'I'm trying to understand why you didn't prefer that kind of transition.'",
        "'speaker_5': 'Well, there are so I don't believe that we're opposed to that kind of transition. And I actually think that the GDP, to the extent that it the area that it covers, allows for and encourages that as well. There are nine blocks covered by that plan, only six of which are covered by the general development plan.'",
        "'speaker_5': 'So the key blocks that you're discussing, that you're thinking of, I believe along Colfax, Colfax, period, equipment, equipment to Raleigh, Raleigh to Stuart are not part of the general development plan. So they don't encourage or discourage development there.'",
        "'speaker_5': 'In terms of the six blocks that are covered by the general development plan, they call for heights as high as 20 on the back blocks. So I think an eight storey building here certainly tapering down to five at the lake, certainly would start what you're discussing.'",
        "'speaker_5': 'And given that there is an 18 storey building directly behind this building, I think five 818 is sort of very much what folks are are thinking of, but it doesn't mean it's going to happen. Obviously, zoning and development are two separate things, but certainly this rezoning, I believe, supports that concept, as does the general.'",
        "'speaker_5': 'Development plan.'",
        "'speaker_8': 'Okay. Thank you very much. I have a question, david broadwell, but it looks like he slipped out of.'",
        "'speaker_1': 'I don't come after him.'",
        "'speaker_8': 'You don't look like David. It's just a question about the the outcome of the 106 complaint that's in process now that's in the district court. Will it make any difference to what we decide tonight if depending on what the outcome of that decision is most likely?'",
        "'speaker_2': 'Adam Hernandez, Assistant City Attorney Most likely, not every rezoning is independent. So any challenge, potential challenge to this rezoning would be, you know, addressed independently in any sort of. When a sex appeal.'",
        "'speaker_8': 'So in your opinion, is not it's not a best practice to go ahead and postpone this tonight and rather than making a decision on this tonight.'",
        "'speaker_2': 'The city feels like they have a strong argument and the current one on sex appeal so. We don't feel that a postponement is necessary right now.'",
        "'speaker_8': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. I have several questions. My first is for Larry Ambrose. If you can stay in that front row, Larry, can you just clarify that all of your testimony was specific to block one or were you speaking about the entire development?'",
        "'speaker_7': 'Can you just clarify that?'",
        "'speaker_6': 'I was speaking to BLOCK two, but alluding to BLOCK one, having the same principles that are involved in the Rule 106 review.'",
        "'speaker_7': 'Okay.'",
        "'speaker_6': 'And that is that the tallest buildings on the site should be towards West Colfax, not on the park and on the lake.'",
        "'speaker_7': 'Okay. I now want to go to Teresa Lucero, if you wouldn't mind, coming forward, Teresa. So in the change that we're making, I just want to clarify that the. Going from the. A mixed use. Five Category two The urban mixed use Category eight allows to go up to eight storeys, but on the 17th Street side and on'",
        "'speaker_7': 'the east edge of the property, it limits it to five storeys, correct? Correct. Okay. Because we're retaining that design overlay. Design overlay. Five. Okay. And then, Cameron, if you can come, I have a question for you. I have two questions for you.'",
        "'speaker_7': 'The first one is about the commitment that you made to Parks and Rec Department for. Investment in looking at some additional planning for the park and the fact that there will be more bodies in the park. And I haven't heard anything about where that is at and just wanted to check in with you on that whole process'",
        "'speaker_7': '. So, number one, have you all already given the city the money to do that planning? And then number two, what do you know about where that's at the planning process and among the administration about it?'",
        "'speaker_5': 'Yeah, so I think it would the question is probably the better part of the question is better answered by Parks and Rec staff. But the commitment that you're talking about was codified in the development agreement, and the development agreement has been signed and recorded.'",
        "'speaker_5': 'The commitment calls for the and I'm going to speak from memory here, but for Parks and Rec to identify that a planning process is ready to get underway, at which point there is dollars for that, and then there are also some dollars that are available at the time at which there's actually investment in the park as a'",
        "'speaker_5': 'result of those plans. So it's twofold. It's help, it's money to help plan, and it's also money to help build. And the commitment is there. But where it it's it's initiated and driven by the Parks Department, not by not by us.'",
        "'speaker_7': 'Okay. So, Councilman Espinosa, I would just suggest that maybe we both check with Parks and Rec on the status of where things are at with that plan. Because the reason why that's important is there's only one trail around that park.'",
        "'speaker_7': 'And so the whole discussion was about looking at the need for an additional improved trail around the park.'",
        "'speaker_5': 'So I certainly don't disagree.'",
        "'speaker_7': 'Let me go to my next question, and this is more about the GDP. So help me understand why it is that there are some blocks within the Sloan's Lake development that are covered under under the GDP and others that are not.'",
        "'speaker_5': 'So the the I'm not 100% sure that the way you're saying that I'm going to rephrase what you just said.'",
        "'speaker_7': 'I was regurgitating what you had to say.'",
        "'speaker_5': 'That I may have said it incorrectly, too. So I'm going to I'm going to say it again a little bit more clearly. The St Anthony's task force and the West Colfax corridor plan cover a nine block area. That nine block area was not owned by the hospital, so it covered an area that was larger than the hospital'",
        "'speaker_5': 'itself. In moving forward with a general development plan, we could only plan for and record a general development plan against property that we owned, which is the original area of the hospital. So like many planning documents do, it looked a little broader for context reasons than what I'll call the heart of the artichoke, which was the hospital'",
        "'speaker_5': 'in this case, the blocks that were not owned by the hospital where the blocks on West Colfax Avenue, if that if that makes sense. It's also true that the six blocks that we do cover in the general development plan are the six blocks that were in need of new infrastructure and both horizontal underground utilities, what have you'",
        "'speaker_5': ', and then streets and parks aboveground. And as Mr. Ambrose said earlier, the principal purpose of a general development plan is to plan out the infrastructure that's coming right, discuss the potential kinds of development that would happen. So we only looked at per direction from the planning department, the area that would need new infrastructure.'",
        "'speaker_7': 'Okay. So can you clarify how many units and or buildings within that make up those units are being proposed for this particular application tonight?'",
        "'speaker_5': 'So I want to be a little bit careful because it's a rezoning application, not a development application. Having said that, having said that, the developer that we are working with, Hines, who has introduced them, announced their plans and introduce their plans to the community, proposes approximately 250 units on this site, which is interestingly very not necessarily more'",
        "'speaker_5': 'units than you would fit under the current zoning. They're just configured differently.'",
        "'speaker_7': 'And do you know of they're proposing rental or for sale?'",
        "'speaker_5': 'They are proposing rental.'",
        "'speaker_7': 'Okay. Thank you. I have no further questions.'",
        "'speaker_1': 'Thank you, Councilman Flynn.'",
        "'speaker_9': 'Thank Mr. Cameron. You you worked for Denver Urban Renewal Authority at the time the West Colfax Plan was developed. And you participate. Did you participate in the development of the plan?'",
        "'speaker_5': 'I did not participate in the development of the plan. However, I did work at the city's Urban Renewal Authority. Okay.'",
        "'speaker_9': 'The only reason I ask is your name is on the document. So.'",
        "'speaker_5': 'Got it. Oh, that's exciting. I'm sorry. I said. I say with great confidence, but maybe. Maybe I should be careful. But I don't have a specific recommended recollection. Okay. Working on that plan, because.'",
        "'speaker_9': 'I was just wondering if you had actually participated in the plan, what was your thinking about the recommendation that the massing of higher density occur closer to Colfax than the park?'",
        "'speaker_5': 'Yeah, I certainly, as I, you know, said earlier, I think that that is a understandable and sensible outcome, primarily because Colfax is the focal point of the West Colfax corridor plan and it's closer to the light rail. And that's the place that that plan is trying to bring vigor and vitality to.'",
        "'speaker_5': 'I do think that the that the plan is much clearer and more intent on making sure you taper to the single family houses that are immediately adjacent to the site. And I also think it's an interesting point to call out is height.'",
        "'speaker_5': 'Height in those plans is never specifically called out. So I think I ask the question relative to what? And so I often think that the design overlay sets one benchmark in terms of relative to what, three stories on the edges, east and west and five stories on 17th Avenue and then upward as you go inward and south'",
        "'speaker_5': '. The other benchmark is the 18 story building immediately behind this one. So again, five, 818 feels very much like the intent of that plan. Mm hmm.'",
        "'speaker_9': 'Okay. I'm looking at page 133 of that plan from 2006. And it seems to show the opposite of what the diagram or what the zoning and the design overlay show on the rezoning. It shows clearly shows much lower buildings on 17th and no higher buildings until you get to 16th.'",
        "'speaker_5': 'Could you state that page again?'",
        "'speaker_9': '133.'",
        "'speaker_5': 'Oh, the stamp. Yeah. So, so I think that.'",
        "'speaker_9': 'And I understand I'm sorry to interrupt, but I understand on the very next page it says that this is just one of many concepts.'",
        "'speaker_5': 'Yes, I.'",
        "'speaker_9': 'Do understand that.'",
        "'speaker_5': 'So I would say to you in looking at that plan, I agree with you that that the concept that is that is shown here is interesting for a variety of reasons. For for one, it's the middle block, not the block closest to Colfax.'",
        "'speaker_9': 'Because that's the existing 18 story.'",
        "'speaker_5': 'No, it's not. It's in front of the eighth. So so in this picture, they've demolished an existing 18 storey building and then they've put a taller building in front of it. This plan also has no scale on it.'",
        "'speaker_5': 'However, the existing houses that are there are the existing houses. Right. So you can see clearly from it that the yellow on the sides is taller than the single family houses that are there. And then orange steps up from there.'",
        "'speaker_5': 'And so if you did a scale rendering of this, which I actually have, you would find that that middle building is over 20 storeys high and the buildings in the front are easily over, over five stories. So again, the question is, you know.'",
        "'speaker_9': 'I'm sorry, you said in the front, do you mean on 17th?'",
        "'speaker_5': 'Yes. Because what you see there is you see that it says higher density, intensity, fully residential structures. Is the bright orange, right. Medium intensity residential uses over active ground floor commercial uses. So they're calling for medium intensity with active ground floor retail on 17th and along Raleigh and then in that same block, stepping up to higher intensity'",
        "'speaker_5': ', fully residential structure. So I would argue that having going forward and saying that the darker orange at five storeys and ground floor residential which is what we call for and stepping up to seven right is medium stepping up to higher.'",
        "'speaker_5': 'So we think we're quite and you know, obviously we're not literally in conformance with this draft. Right. But we think that this plan very much backs up and supports even this one example. What's what's being discussed here?'",
        "'speaker_9': 'Mm hmm. All right. Thank you.'",
        "'speaker_5': 'You know.'",
        "'speaker_9': 'Larry Ambrose. Your name. Your name is not on the document. But you said you participated. Did you participate in the West Colfax plan?'",
        "'speaker_6': 'Yes. My wife was on the committee and I.'",
        "'speaker_9': 'Her name name's not in here either.'",
        "'speaker_6': 'Her name is on there.'",
        "'speaker_9': 'I find it interesting that we have a document that names people who weren't involved and doesn't name.'",
        "'speaker_6': 'Who I participated in. We had a series of Oh Charette, you are familiar with threats where you have tables. And I was part of that process where people actually sat down and drew their visions, and that was where the concept of the tallest buildings towards Colfax came.'",
        "'speaker_6': 'And if I can just say one other thing, the block four and five, which have four story buildings and a little bit of five story on them. If this project were moved back because eight story building were moved back to that site, that would be appropriate.'",
        "'speaker_6': 'But unfortunately, they sold that site before they. And I think at the same time, they also always intended that the tallest buildings be closest to the lake, because that's the market. That's what the market is demanding. But we don't do zoning based on return, on investment or shouldn't.'",
        "'speaker_9': 'All right. Thank you. That's all.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Councilman Espinosa.'",
        "'speaker_5': 'Adam. I mean, Mr. Hernandez. Sorry, the. Was the GDP approved by council?'",
        "'speaker_2': 'No GDPs are approved by the Development Review Committee, which is made up of various city agencies.'",
        "'speaker_5': 'And I'm asking that because I again, this is sort of a teaching moment. And what Mr. Ambrose was saying about the process in the town center redevelopment on page 130 of the neighborhood plan. The very first statement is the following utilized the guiding principles of the St Anthony's Hospital Redevelopment Task Force in preparing and implementing future plans'",
        "'speaker_5': 'for the redevelopment of this 16 acre urban site. I'm saying that because you're going to hear in my comments that this rezoning I mean, other rezonings, this GDP, this entire process figured central into why I'm sitting here today.'",
        "'speaker_5': 'And there's some sort of disconnect in that. There's a statement in a small area plan which us as council are trying to encourage in other neighborhoods across our districts. Yet it got usurped by a GDP process that is not approved by council.'",
        "'speaker_5': 'And then we're reviewing rezonings relative not to this point well within with this in place, but in context to that GDP. And so as many struggles as we have on on the tools that are available to us to sort of negotiate better outcomes, this one sort of circumvents us fairly robustly.'",
        "'speaker_5': 'The and so one my concern is, is that the city does have a very good case in the 106 action on block one. But part of that relies on the fact that these documents, these smaller plans, don't have the weight or gravity or teeth that we ascribe to them as a community.'",
        "'speaker_5': 'And so I want that to be known by my colleagues here. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Flynn, you back up.'",
        "'speaker_9': 'I apologize, Mr. Rose. I did have one more question for Adam on the rule when I was six. And I know that I know that you said we're confident in it, etc., but it seems to me that the same principles apply to block two as are being litigated in BLOCK one.'",
        "'speaker_9': 'So I'm curious, do you know what the anticipated schedule is or when we might expect a ruling on on this? And what would be the damage to the city if we postponed this until after the ruling so that that could inform our decision here?'",
        "'speaker_9': 'If you know.'",
        "'speaker_2': 'It's difficult to say on one of six decisions, it can depend on the individual judge. I believe right now the city is due to file their answer brief tomorrow, which would then have the plaintiffs file. I want to say in 3 to 4 weeks, I don't have a rule one or six memorized.'",
        "'speaker_2': 'And after that, it can take anywhere from one month to. Six to 8 to 10. It just really depends on on the individual job.'",
        "'speaker_9': 'What is the damage that's done to the city by postponing? Is there damage, too? I don't want to be pursuing.'",
        "'speaker_2': 'I don't know if there's any damage to be done other than, you know, each rezoning is its own independent decision. That would be, you know, analyzed independently by by whatever judge would look at that challenge. You know, in this specific rezoning staff feels that this application does meet the designation, the I'm sorry designation, the rezoning criteria.'",
        "'speaker_2': 'And so the city, you know, feels that a postponement is just unnecessary at this point.'",
        "'speaker_9': 'Mm hmm. Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Councilwoman Black.'",
        "'speaker_3': 'Thank you, Mr. President. Cameron, question for you. Can you please speak to what Councilman Flynn just was asking about a postponement?'",
        "'speaker_5': 'Um, well, I should be careful. Probably not to speak to the status of the 106 itself, but I would tell you that from the perspective of the applicant, we would feel we would be harmed by it. We are.'",
        "'speaker_5': 'This is a process that started in the spring that brings us to this point. We've had a variety of meetings with the neighborhood. We are trying to bring forward and continue the positive retail environment that we've had and move forward.'",
        "'speaker_5': 'So a delay, especially one of an unknown duration, is would be a significant consequence to us as the applicant and would certainly make a statement to the vertical developer as well. So I would certainly strongly encourage the council given that they are independent blocks, independent requests to let them move forward independently.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman. All right. You know the question. 676. 69 public hearing is now closed. Time for comments, Councilman Espinosa.'",
        "'speaker_5': 'Okay. So during my short time on council, we have approved several of zoning similar to this bill. Both CMC's five and eight districts have development potential. That is dramatically different than what lay the lay person understood in the 2010 rezoning zoning update.'",
        "'speaker_5': 'There's a reason this city has been litigated against multiple times around mixed zone districts. Many of those concerns could have and should have been mitigated in the zoning text. Failing that rezoning should afford the public the right to address deficiencies, or should afford the opportunity for the public to address deficiencies until the city has tools to negotiate'",
        "'speaker_5': 'and memorialize better outcomes. I will continue to scrutinize blanket rezonings in areas sensitive to destabilizing development. Fortunately, in this instance, there is a design overlay along with design standards and guidelines in place. I read my own statement.'",
        "'speaker_2': 'Right.'",
        "'speaker_5': 'So I want to say that again because I want with emphasis. Fortunately, in this instance, there is a design overlay along with design guidelines and standards in place. Additionally worth noting, the master developer has extended the invitation for the design review board board position to two.'",
        "'speaker_5': 'The alternate mean the OP as the opposing voice in this development. I believe we as council need more support for customized zoning to allow for collaboration between developers and the community they are impacting. I will be voting well and so before I say how I'm going to vote.'",
        "'speaker_5': 'Like I said, this was central to my election and part of that was that the GDPR does call for a 20 storey, allows for up to 20 storeys on block two. This one that we're talking about and and the applicant at that time talked about the potential for offloading affordable housing to a different part, not part of'",
        "'speaker_5': 'these seven blocks that are the 16 acre site. And I'm happy to say that the proposal to go with a seven storey proposal on an eight storey zone district is a net 12 storey reduction and the potential supported by GDP.'",
        "'speaker_5': 'In addition, during that time between election and swearing in, they agreed to 32 to put 30 affordable housing units on this on the property that was previously being sought as is being put off site. And now there's talk about an additional up to 30 more.'",
        "'speaker_5': 'And that to me is what I'm talking about when we when we know there are more than one way to skin the cat. Back then on the block, one rezoning, there was a lot of talk about density in the proposal.'",
        "'speaker_5': 'On block one is 222 units. If I'm not mistaken, this is 250 and it's five story shorter. So when I'm talking about density, there's different ways to achieve what we're trying to do, and we can do it in ways that are responsive, especially if we can do that negotiated here.'",
        "'speaker_5': 'Again, design guidelines and standards are in place, the design review board. And so there's a lot of things that are important to the civic environment that are already codified through prior agreements. So with that, I will be voting in favor of this rezoning.'",
        "'speaker_5': 'However, it should be noted that there is pending litigation on the adjacent block to the West. And should a ruling of the adjacent block be in favor of the plaintiff, the future of this zoning could be impacted.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Councilman Flynn.'",
        "'speaker_9': 'Thank you, Mr. President. I, I generally like the proposal as it's put forward, but I am uncomfortable approving a rezoning under the same principles and procedure that are being contested in court on an adjacent block. And to just to pick up on what Councilwoman Espinosa just said, that we could be challenged on this one as well down'",
        "'speaker_9': 'the road. I and I don't understand what. And given that there's no harm to the city in postponing this, I would like to suggest that we that we postpone this until after while we can. We have to pick a date certain.'",
        "'speaker_9': 'So I'd like to make a motion that we postpone it until January 19th. Can I make that motion?'",
        "'speaker_1': 'Yes, you can.'",
        "'speaker_9': 'I'd like to make a motion that we postpone final consideration of this until January 19th, which is about a little less than two months from now, would give the court time to give us guidance on whether our plans are small area plans and should be should have more consideration in our in our rezonings.'",
        "'speaker_1': 'All right. It has been moved. It does require a second.'",
        "'speaker_8': 'So I can.'",
        "'speaker_1': 'Katherine, then you want to click on for the screen move and second it. Any comments on the motion to postpone? You have anything else to add, Councilman Flynn?'",
        "'speaker_9': 'No, no, Mr. President.'",
        "'speaker_1': 'Oh, okay. So, Lopez, I think you were commenting on the bill. Do you have a comment on the postponement?'",
        "'speaker_2': 'I had a comment on the on the original motion, which is the bill. But then I. I know that Councilman Espinoza was right after me. And I think my question was on this on this particular motion to see how the councilman in the district felt about.'",
        "'speaker_1': 'Okay. Councilman Espinoza, did you have.'",
        "'speaker_5': 'Yeah. I'm sort of trying to figure out what the net benefit of that is. For a postponement, simply because if it impacts if it impacts, it impacts my you know, I don't know that. And so help me out.'",
        "'speaker_5': 'Can either the city attorney or Councilman Flynn, because it's not necessarily retroactive? I think you would still have to the either the applicant would have to sort of recognize based on the decision that they need to alter their application, which is a reapplication process anyway.'",
        "'speaker_5': 'Or they would basically feel like they could proceed in a month or two with the application in hand and then go through the 106 action again. I mean, what is what's the benefit of delaying?'",
        "'speaker_9': 'If I could respond responding well.'",
        "'speaker_1': 'I will let other people comment before we go back and forth. So I do want to know that you said you didn't see value. I wanted to allow you to if you want to comment further. But we got a lot of people in the queue and I want to afford them the opportunity to speak on the motion'",
        "'speaker_1': 'to postpone. If you had anything else to add, Councilman Espinosa.'",
        "'speaker_5': 'No, I don't know.'",
        "'speaker_1': 'You went back in Lopez for the postponement or did you want to?'",
        "'speaker_2': 'I wanted to comment on the honor on the bill.'",
        "'speaker_1': 'Okay. Well, we'll come back. Well, if it postpones, you have to wait till the 19th, but we'll come back to you. Okay. Councilman Brooks.'",
        "'speaker_5': 'Thank you, Mr. President. Adam, this is a question for you, but.'",
        "'speaker_2': 'You know, you know, it's.'",
        "'speaker_5': 'It's really for Braswell because, you know.'",
        "'speaker_2': 'We are you know, the applicant is due.'",
        "'speaker_5': 'You know, their response in this public hearing to be independent of all other pending cases. And what I'm wondering, Adam, is are we then liable for not giving the applicant their due in this public hearing because we're inquiring about other pending cases?'",
        "'speaker_5': 'In other words, would the applicant then could they file lawsuit against us? Because we are making you know, we're outside of our kind of criteria of making this.'",
        "'speaker_2': 'I don't know about the liability, but there has been. Some deliberation. The public hearing has started. So. It seems that a postponement. May have been more applicable before all of that had occurred. Okay. Got it. That's what that's what I want to hear.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Councilman Brooks, I'll jump in. You know, I Adam, you didn't come up with the harm to the city. I can come up with one delaying of the movement forward of this zoning, particularly if we have their independent. So one does not have any impact on the other.'",
        "'speaker_1': 'And so to delay for what good reason. And so I think that is harmful to the city. I also think it's harmful what type of message this sees that litigation can stall city business. So I will say, just as I was thinking, I think those are two reasons that I don't understand the reasons for this postponement.'",
        "'speaker_1': 'So I would certainly hope that we we think hard about doing that because I don't see value in that. Councilwoman, I take it you're up.'",
        "'speaker_7': 'First, I want to say that during the course of the process, I attended many of the meetings that were held in the neighborhood. This was when the old St Anthony's Hospital was still on site, and many of the meetings were held in the actual building.'",
        "'speaker_7': 'And I think Cameron spoke to 80 build 80 meetings that were held with the community garnering lots of different input and. That the overall plan for what was going to be brought forward was shaped based on that community input.'",
        "'speaker_7': 'And, you know, as with many of the large scale developments that we're seeing, they're coming in as different development applications for the different parcels. That's very different from when I served on council before, where they were brought in as one sort of master plan, if you will, and the zoning was was done differently.'",
        "'speaker_7': 'But that was all before the change to the 2010 zoning. So, you know, given where we're at and the process that has gone forward, I don't think it makes sense to postpone this tonight and because they are separate applications.'",
        "'speaker_7': 'And if we. Did this with this particular development. You know, we could be kind of in this box with other developments all across the city where there are different buildings that will be going on to a development site.'",
        "'speaker_7': 'And we've got a number of large parcel developments that are yet to come forward. And I just think this is. This is not an appropriate reason to justify postponing. I think it makes sense to move forward with the action by city council regardless of how the votes will come down and, you know, let it move forward as'",
        "'speaker_7': 'a standalone zoning, as, you know, the previous ones have. So I will not be voting for the postponement. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega. Councilman Canete.'",
        "'speaker_10': 'Thank you, Mr. President. I, too, will speak against a postponement. I'm going to use a little stronger or, you know, maybe plainer wording than the city attorney has. And he should correct me if he feels I'm overstating anything.'",
        "'speaker_10': 'But it's not just that each rezoning is independent. The review on a 1 to 6 case is based on the record established in that particular zoning. So if there's a deficiency in the record of that event, it has to do with the evidence, it has to do with the deliberations that occurred, not just the site.'",
        "'speaker_10': 'And so for that reason, I would say there's virtually no impact that that decision could have. We have a record before us tonight that includes the testimony we heard tonight, includes the documents in this record. Nothing that occurs in that case is going to tell me about this efficiency or insufficiency of this record.'",
        "'speaker_10': 'And that, you know, the city attorney. Let me pause since since I only play an attorney and Channel eight these days. Did I misstate that in any way?'",
        "'speaker_2': 'No, no, that's a correct statement.'",
        "'speaker_10': 'So so with that statement, I think that we have before us a complete record. And that complete record includes not just the the testimony before us, but it also includes the documentation regarding, you know, the long planning process that occurred.'",
        "'speaker_10': 'I, too, am one of the individuals who was part of the St Anthony's task force discussions. And one of the things that I think, you know, Dan Shaw, one of the speakers in the hearing tonight referred to, is the key reason for the residential density along 17th is that there was no way to get to the retail'",
        "'speaker_10': 'and business desires that this community had. And I say this community, not this developer, this community. I sat on a subcommittee, the economics subcommittee, chaired by the chair of of Schaefer, Roy Alexander, trying to look at how we get more neighborhoods serving businesses.'",
        "'speaker_10': 'And that was impossible without residential density. And so we have a record before us that really has that as the key fact. We have all of the other pieces before us. It is a complete record and I would urge my colleagues to oppose a postponement.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_1': 'Thank you. Correction. Excuse me. Thank you. Councilman Kenny's Councilman Clark. Thank you, Mr. President.'",
        "'speaker_2': 'You know, any citizen, any property owner in the city and county of Denver has the right to put forth a rezoning request and have their day in court. As we sit in our quasi judicial role on city council.'",
        "'speaker_6': 'They do not need staff approval. They do not need approval.'",
        "'speaker_2': 'From the neighborhood to have their day to sit and have us review based.'",
        "'speaker_6': 'On five criteria.'",
        "'speaker_2': 'The merits of that case and make a ruling. Those five criteria are consistency with adopted plans, uniformity of district regulations for public health, safety and welfare, justifying circumstances.'",
        "'speaker_6': 'And.'",
        "'speaker_2': 'Consistency with neighborhood contact zoned district purpose and intent. There is absolutely no criteria.'",
        "'speaker_6': 'Upon which.'",
        "'speaker_2': 'This public hearing the right of this applicant can be delayed. In my seeing under the there's there's not a sixth criteria. That is pending litigation on a different piece of property. I think that the discussion we should be having right now is about what we're going to do based on the testimony and the public hearing.'",
        "'speaker_2': 'I would strongly oppose postponement. I think there's absolutely no standing for a postponement, and I strongly encourage my colleagues to vote no on postponement.'",
        "'speaker_1': 'Thank you, Councilman. Clerk. Councilman Espinosa, are you back up?'",
        "'speaker_5': 'Yeah. Also, you're going to say on the word where the harm is is actually in the development proposal, because as an architect and developer myself, I know that there's economies that can be gained in a seven storey eight storey development that can't be obtained in a five storey development.'",
        "'speaker_5': 'But I can also tell you that it's very, very, very easy to do a five storey development, you know, as evidenced by blocks the use by right developments on blocks five and six on St Anthony's. And so I you know, if you put a rezoning in limbo, you actually make a useful right development more viable at some'",
        "'speaker_5': 'point. And so, you know, I think that the the sort of creative approach, even though we're not.'",
        "'speaker_1': 'Approving a project.'",
        "'speaker_5': 'The creativity, the latitude that you get through that economy of scale is. Going to will result in a greater public benefit or community benefit. Could. It could and should. So there is potential harm in that regard. Thanks.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Flynn.'",
        "'speaker_9': 'Thanks for President. The single reason than the only reason that I moved for the postponement was because the same principles, questions about process apply to this rezoning. And I don't want to see us back here with another having to do this all over again.'",
        "'speaker_9': 'If the Court in the unlikely event, I'm told, that the Court would find against us. And so that was the only reason I'm not advocating that. That this doesn't meet any of the criteria and postponement is not a no vote.'",
        "'speaker_9': 'That was the sole reason I actually favor the proposal. I'm just concerned about having to revisit it. If should we lose the the first case because the same principles are there. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Flynn, Councilman and clerk, you back up.'",
        "'speaker_2': 'I just want to quickly respond. There's nothing to stop this applicant. Even if the lawsuit were to go against the city from coming back and getting to this point, this is the applicant's right to sit here with us regardless of that lawsuit or whatever they say.'",
        "'speaker_2': 'Just wanted to add that. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Clark, in the other comments and we're talking about the postponement, and I'm still sending Councilman Lopez, you're waiting inside. You'll be the first one I call on. Should this both of them to be defeated? All right.'",
        "'speaker_1': 'Thank you. All right. Seeing no other comments, we are voting on the postponement to January 2016. Madam Secretary, roll call.'",
        "'speaker_2': 'Flynn I.'",
        "'speaker_3': 'Gilmore No.'",
        "'speaker_4': 'Cashman No can eat. Lopez No new Ortega?'",
        "'speaker_3': 'SUSSMAN Absolutely not.'",
        "'speaker_4': 'BLACK No.'",
        "'speaker_2': 'BROOKS No.'",
        "'speaker_1': 'CLARK No.'",
        "'speaker_5': 'ESPINOSA No.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'No. Councilman Lopez. Oh, no. Thank you, Madam Secretary. Please, first of all, denounce the results.'",
        "'speaker_4': 'Councilman, who did you vote? He did.'",
        "'speaker_1': 'He voted yes.'",
        "'speaker_4': 'Yes. Okay. Two eyes, 11.'",
        "'speaker_1': 'Two eyes. 11 nays. Motion to postpone a January has been defeated OC. Written comments. Yes. Comments on 676. Councilman Lopez.'",
        "'speaker_2': 'Thank you, Mr. President. I you know, I, uh, here's Council District three just on the other side of Perry. And before we when, when we first started talking about this site in the St Anthony's redevelopment site has been a for a long time.'",
        "'speaker_2': 'I think when I when I was first elected, it was still kind of a myth. Right. We didn't know what the heck was going to happen over there. And I never thought that Council District three would butt up against it.'",
        "'speaker_2': 'So I was kind of like, Oh, that's Garcia's problem. I'll let him deal with. That was, you know, council people's problem then it is now my problem. And so thank you, Councilman Espinosa, for inviting me to share your problems.'",
        "'speaker_2': 'Oh, no, sir. Here's the thing. I know that this I've been watching it from afar. And, you know, in the last few years, actually, I've been sitting in on some of the meetings here, this particular project. And, you know, each block has its own little development.'",
        "'speaker_2': 'Each block it comes with its own set of scrutiny. This project and this development has been watched with intense scrutiny under a big microscope. And every foot that you build in the air or or in width comes under intense scrutiny, as it should.'",
        "'speaker_2': 'Every rezoning should we should look at things with with with a skeptical eye. But with something like this, with the design guidelines that are in place, with the amount of input that people have had, and just with the with them, this kind of array of of different variables that have been on our table, but also the different'",
        "'speaker_2': 'options and what could have been but actually what is it's a breath of fresh air for a lot of folks in the area who are a little well, I would even say a little, but very concerned about about overdevelopment in areas.'",
        "'speaker_2': 'And, you know, here's a one thing that we have to really keep and really keep in mind. We see this. This particular zoning is a particular development in and of itself, in a universe of in and of itself.'",
        "'speaker_2': 'We forget where it fits sometimes. And when we look at it, we analyze it, we forget where it fits in the context of the city. Keep in mind that folks on the West Side to catch a movie, we go to Belmar.'",
        "'speaker_2': 'Or we go to the pavilions. But for the most part, a lot of folks head to Lakewood right when they're looking at looking when they're looking at places to live. That's where they're looking at looking west. And this is a great opportunity not only to provide those those those units.'",
        "'speaker_2': 'And and I'm glad to see that, you know, they're becoming a little bit more affordable. At least some of the units are becoming more affordable, but also to have those kind of services in the community that that we don't currently have.'",
        "'speaker_2': 'And I think this particular zoning, when you look at the design guidelines, when you look at the process that has been at the table. And, yes, you know, you're still going to have a lot of folks that are really discontent with the development as a whole.'",
        "'speaker_2': 'But when you look at this particular zoning and that's what we hear charged with, it seems to dot all the I's and cross all the T's in my book. And, you know, being the councilperson who represents the districts just to the east, you know, just barely to the east, I'd say that this is actually makes sense.'",
        "'speaker_2': 'Now, the other blocks, we'll have to look at that, another case by case basis in the car wash. I have no idea what the heck people are talking about the car wash, but I guess I'm going to find out so soon enough.'",
        "'speaker_2': 'So thank you, Mr. President. I do support this moving forward.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Any other comments? 676. Scene? None. Madam Secretary, roll call.'",
        "'speaker_4': 'Espinosa.'",
        "'speaker_5': 'Hi.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Gillmor, I.'",
        "'speaker_4': 'Cashman I can eat. Lopez I knew no. Ortega I. Susman I black eye. Brooks. Clark.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'I Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_4': '12 eyes, one nay.'",
        "'speaker_1': '12 eyes one nay. 676 has been placed on final consideration and does pass. Next we have Council Bill 722. Councilwoman Ortega, will you please put 722 on the floor?'",
        "'speaker_7': 'I would be happy to move that council bill 722 series of 2015 be placed on final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. Public hearing on Council Bill 722 is now open. May we have the staff report?'",
        "'speaker_5': 'Thank you, Mr. President. Good evening, members of Council. I'm Kyle Dalton with the Department of Community Planning and Development with the staff report for Denver Zoning Code Text Amendment Number five. I'll note that we start over counting text amendments when Council re codifies the code as you did in June.'",
        "'speaker_5': 'So this is the fifth since the re codification. It's actually the 25th to the Denver zoning code. And we're here tonight to introduce a new series of zone districts to the Denver zoning code. I'll talk about who's sponsoring it.'",
        "'speaker_5': 'The process we went through the purpose of this amendment, and I'll review its provisions. I'll go through the three review criteria for a text amendment and then offer our recommendation. So first, the ordinance is sponsored by the Department of Community Planning and Development.'",
        "'speaker_5': 'But we worked in close concert with the property owners who are likely to be the first folks to ask for a map amendment to this new series of zoned districts in the Pena Boulevard station area. They also had their design professionals test and develop the provisions of this new text amendment.'",
        "'speaker_5': 'The TEX amendment process begins with what we have done with every text amendment since the Denver Zoning Code was adopted, which is taking it to the Committee of the Zoning and Planning Committee of Inter Neighborhood Cooperation, a registered neighborhood organization.'",
        "'speaker_5': 'And we did that in June of this year presenting a summary of the proposed tax amendment. We then released a public review draft 30 days, more than 30 days before the planning board public hearing, which is again, our practice not required by code, did that in July of this year and then provided formal notice to registered neighborhood'"
    ],
    "Denver Zoning Code Text Amendment #5 to create new zone districts.": [
        "'speaker_5': 'organizations and city council throughout the city. At July 28th, Planning Board held an informational item and then held a public hearing. That was probably a notice to all registered neighborhood organizations in the city and all city council members.'",
        "'speaker_5': 'That hearing was on September the 16th, at which time they heard testimony from one person and then unanimously recommended approval. It proceeded to the Committee of City Council, the Neighbors and Planning Committee on October 14th, and City Council's public hearing tonight was also again notified notice with 21 days advance notice to all register neighborhood organizations and all'",
        "'speaker_5': 'city council members before tonight's public hearing. We received a total of two written comments which are both included in your packets that we submitted last week. One is a general comment, not specific to this text amendment from Virginia Vail Community Association.'",
        "'speaker_5': 'And then there was a comment specifically in support of the text of this text amendment from a developer of transit oriented development in the Pinion Boulevard Station area Four Bells. And he is here tonight. So here's the purpose of the text amendment.'",
        "'speaker_5': 'The goal is to create a brand new series of suburban context zone districts. So we're adding to the menu of current zone districts in the Denver zoning code with five new ones that are designed to fit within the suburban neighborhood context but have a more urban, pedestrian oriented character than the current menu provides in the suburban context'",
        "'speaker_5': '. It does this by adjusting some of the building form standards in the suburban mixed use zone districts, and it does so in a way to try to increase the predictability and implement adopted plan goals and objectives from the citywide adopted plans.'",
        "'speaker_5': 'Here's a summary of the main provisions of the text amendments. They're further detailed in your staff report and in a lengthy red line ordinance, as well as a black line ordinance. At the committee meeting, we received valuable feedback from the committee members that perhaps these would be better shown through graphics.'",
        "'speaker_5': 'So I asked my colleagues with developing some graphics to illustrate the concepts, and so I'll walk through them here quickly. The first is there's an adjustment to the build to range. So on the left hand side of this slide and all the subsequent slides, it shows the current smc's suburban mixed use zone districts.'",
        "'speaker_5': 'They remain on the books and they continue to be mapped in various locations in the city today. The current rule in suburban mixed use is that there's a bill to range from 0 to 80 feet in most instances, although sometimes that goes as much as 150 feet.'",
        "'speaker_5': 'In this new series of zone districts, the smic's a zone districts the 2a42 stories 3a43 stories, 58a and 12 a that we would narrow the bill to range. So it would be from a minimum of zero feet to a maximum of 20 feet.'",
        "'speaker_5': 'There's also an increase in the percentage, which is the width along the zone lot that the building needs to be met. So in doing so, it brings buildings closer to the street and again, kind of seeks to achieve a more urban, pedestrian oriented character.'",
        "'speaker_5': 'The second thing that smacks a zone district is do as compared to the current suburban mixed use zone districts is to prohibit surface parking between the building and the street. So on the left hand side, you can see today surface parking is allowed between a building and a primary street and suburban mixed use in the new series'",
        "'speaker_5': 'is on districts that would not be allowed between the building and the primary street. So it need to be located to the side, to the rear in the building itself. The third thing that's different about the SMACKS makes a series of zone districts is the pedestrian access requirement.'",
        "'speaker_5': 'So in the suburban mixed use zone districts again today, already what the rules are on the left is they only require a pedestrian connection, which is a clear, visible path from the street to the building. On the right, you can see the new requirement in this Amex zone, districts which require a street facing entrance so a door'",
        "'speaker_5': 'in the building must face the primary street. Finally, there's the addition of a street level active use requirement. So today, although there there are built to and transparency requirements and all the other street level activation requirements I've talked about so far in the suburban mixed use zone districts.'",
        "'speaker_5': 'There's not actually a requirement that there be an active use in the building. What we're introducing with this cements a zone district series is a 40% street level active use requirement, which is consistent with what we require in our other urban, pedestrian oriented, mixed use districts in the city today.'",
        "'speaker_5': 'So essentially what that means is that within 40% of the width of the building that's meeting the build to requirement requires a use other than parking and a few others that are not very street lively and active. So you can see on the left today that could just be a parking garage behind the windows, whereas one example'",
        "'speaker_5': 'of what might develop within the new series of zone districts is a cafe or or any other use that isn't prohibited in the code as an inactive use. Another thing that the text amendment does is it only allows the general building form.'",
        "'speaker_5': 'What this does as compared to the suburban mixed use some districts is it essentially prohibits drive thru lanes and drive thru services between the building and the street, although drive thrus as you drive thru uses would still be allowed if locate if not located between the building in the street.'",
        "'speaker_5': 'So there are three review criteria for a text amendment. The first is that it be consistent with the city's adopted plans and policies. We provide a further detail in your staff report, but in summary, we find that it would be consistent with comp plan 2000 and ensures that the zoning code is flexible and accommodates changes over time'",
        "'speaker_5': '. It will encourage mixed use and transit oriented development in those locations where it's mapped and identifies in response to community design and development issues that have been raised, targeting those concerns with appropriate new controls and incentives. The second criterion is that it needs to further the public health safety in general welfare, which the text amendment does by'",
        "'speaker_5': 'providing clarity through the New Zone District in terms of the building form and predicted predictability in terms of what the rules will be, and also facilitates plan development within the new zone districts and it continues to implement our adopted plans.'",
        "'speaker_5': 'And then finally, it must result in regulations that are uniform throughout each of these new zone districts. The regulations will apply uniformly to all buildings and land uses that develop within each of them again when they are mapped.'",
        "'speaker_5': 'So having reviewed it against all three review criteria, we recommend that you approve the text amendment.'",
        "'speaker_1': 'Thank you. We have one speaker for bells.'",
        "'speaker_2': 'Good evening. Four Bells two 2335 Glencoe, Denver. Thank you. Council President and Council Members. My letter has been submitted, but I wanted to, first of all, thank the planning staff for their efforts on this. The S-MAX is just not stringent enough for what we wanted to accomplish out there.'",
        "'speaker_2': 'But some of the other zoning designations really don't fit the context. As you know, we were wheatfield until recently, and fortunately we're under construction and putting infrastructure in and developing what we believe will be a leading transit oriented development that we'll all be proud of.'",
        "'speaker_2': 'And it might take ten years. It is 400 acres. So we believe this will allow for our pedestrian oriented streets to be truly pedestrian oriented. We really don't want a bunch of parking between our pedestrian oriented streets and our buildings.'",
        "'speaker_2': 'And so this helps us accomplish that by really defining what we want to accomplish and not having some X, just pure s-max and having like so. So we encourage you to support it and we look forward to moving forward.'",
        "'speaker_2': 'Appreciate it. Thank you.'",
        "'speaker_1': 'That concludes our speakers. Now time for questions. Councilwoman, can each.'",
        "'speaker_10': 'Thank you. One question for the planner, please, Kyle. Yes. Sorry. I just have a really basic question, which is you've described a lot of the requirements of this own district, but were any of these things not allowed in the prior zone district, or is there things that an applicant can do that they wouldn't have been in the'",
        "'speaker_10': 'other one? I'm just trying to understand kind of that tipping point of necessity versus what was possible.'",
        "'speaker_5': 'Sure. So in all cases, this will increase minimum requirements. So development, everything that's available in the new districts, you could also do in the regular districts. It's just that in the regular districts, you could do kinds of development that wouldn't be as compatible with the goals of the new one.'",
        "'speaker_5': 'So it is restrictive, more restrictive in all cases.'",
        "'speaker_10': 'All right. And I guess my main question there is I mean, it makes perfect sense to me, but in a case where an applicant can choose which one to do. I guess I'm still a little stuck on the need for a new zone district because anyone who doesn't want to do these things could just choose the old'",
        "'speaker_10': 'one. Right? We're not eliminating the old one.'",
        "'speaker_5': 'Correct. They won't be removed from the books. But we do think that there are instances where the smic's straight zone districts wouldn't implement plans and wouldn't be consistent with the city's adopted plan. So these will be more consistent in areas where we have stationary plans calling for a more vibrant character or pedestrian oriented character.'",
        "'speaker_10': 'Okay. I'm sorry. I didn't mean to cut you off there. So let me just so if I understand it correctly, it's not that applicants won't still see that more permissive zoning, but you would be, for example, now that this exists, less favored to support it.'",
        "'speaker_10': 'For example, from a staff perspective, if you felt like this one was a better fit with the plan. You know, the planning board might be reviewing against this so so you it will in effect the existence of the to two comparative you know zone districts will will indeed result in some folks being steered this way who might'",
        "'speaker_10': 'not have otherwise.'",
        "'speaker_5': 'I think that's a fair statement.'",
        "'speaker_10': 'Okay. Thank you for helping me understand.'",
        "'speaker_1': 'Thank you. Councilman can. Councilman Ortega.'",
        "'speaker_7': 'I'd like to ask for bills, if you can come forward. So in looking at the documents, I didn't see a map that defined the boundaries. So can you both define the boundaries and tell us how many acres we're talking about that make up this area?'",
        "'speaker_2': 'So the entire area that was part of the stationary plan which was approved is from 56 to 60 fourth. And Pen Boulevard to Tower Road actually includes our land and some other landowners who also participated in the stationary plan and the general development plan, including Disneyland.'",
        "'speaker_2': 'I mean, this is truly our co-developer on this project. So currently that land is on the old zoning code, CMU ten, 20 and 30. And we are actually done preliminary submissions with the planning staff to rezone our land into the new zoning code.'",
        "'speaker_2': 'And this we will designate some of our land as some mix a as we come forward and obviously you'll see that when we come forward.'",
        "'speaker_7': 'So we'll be seeing other zoning applications come forward, is what you're saying?'",
        "'speaker_2': 'Yes. In fact, you will see we own about 150 acres of it. The EIA will not be, as I understand, submitting because they're the EIA and basically they have their own designation, which is fine.'",
        "'speaker_7': 'And how many acres are the A dia?'",
        "'speaker_2': '60.'",
        "'speaker_7': 'Okay.'",
        "'speaker_2': 'There's another landowner that's about another 150 acres. And they have not decided yet whether they're going to rezone.'",
        "'speaker_7': 'So part of this is just to give the development, the developers options between the two different zoning categories that are now available with.'",
        "'speaker_2': 'Yes, yes. We worked hand in hand with the planning staff developing this text amendment really to kind of craft it through what we desired on what I would call our most pedestrian oriented streets. So those pedestrian or streets will be our primary streets.'",
        "'speaker_2': 'So we will have the build to requirements and the transparencies along those streets, which are the key walkable streets.'",
        "'speaker_7': 'And four. Can you help me recall whether the Metro District covered the entire boundaries of all the acres that we're talking about?'",
        "'speaker_2': 'The metro district does include all of that. It's actually 380 acres. It has inclusion areas. They can take it up to over 600 acres. For instance, DIA is not in the specific metro district area now, but they can be included.'",
        "'speaker_2': 'In fact, we had ten metro districts that, as you may recall, we saved one for DIA if they want it. So it's generally the entire area? Yes.'",
        "'speaker_7': 'In an up to how many mills will that allow to be included in?'",
        "'speaker_2': 'I'd. Say that again. I'm sorry.'",
        "'speaker_7': 'So the metro district will allow the mills to be raised?'",
        "'speaker_2': 'Oh, yes.'",
        "'speaker_7': 'So is there what's the cap on?'",
        "'speaker_2': 'It's the standard that the city and county has approved generally, I believe, which is 50 mills for capital. And then you can have an operating a mill on top of that.'",
        "'speaker_7': 'Okay. So given the the role of. Special financing tool. What what is the commitment to affordable housing for any of the housing development that's going to be built on the site?'",
        "'speaker_2': 'We have not made a specific commitment to affordable housing. We are working with the local developer, MGM, to have our first project. They are having meetings with the city on some potential financing mechanisms to have a portion of their their apartments that would be rental be affordable.'",
        "'speaker_7': 'Okay. And is that a development that's moving forward now or.'",
        "'speaker_2': 'Yes, they are under contract.'",
        "'speaker_7': 'Okay. Okay. Those are all the questions I have. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega. Councilwoman Gilmore.'",
        "'speaker_3': 'Thank you, Mr. President. I think, Kyle, you're probably the best one for me to address this question, too. So first, I have to say thank you for including the schematics in the presentation and with the parking, you know, not being facing the street.'",
        "'speaker_3': 'Sometimes people wonder if there's going to be enough parking. But it's my understanding that there's going to be hundreds of parking spaces that are close to the platform. And I think that number was 800, is that correct? Or and that might be a question for Firdous as well or Dan.'",
        "'speaker_3': 'But you know, how much parking is there going to be and then encouraging that walkability through, you know, multimodal bicycles and other mechanisms, if you could talk a little bit about that.'",
        "'speaker_5': 'Sure. So I'll speak to what I know and then you can maybe address questions elsewhere. So this is a text amendment to add zone districts to the book. It's not actually being mapped anywhere tonight. And I'm not familiar with the details of any particular project.'",
        "'speaker_5': 'And I'm I'm genuinely not familiar. So what I can say is with the zone districts, when they are mapped, they will require the suburban neighborhood parking ratios, which are some of the highest in the city in terms of the off street parking requirements for the uses.'",
        "'speaker_5': 'I'll also note that the suburban context is not likely to be mapped at the platform itself. So immediately next to the platform is zoned DIA and will likely remains on the air. The next out from the DIA land is most likely to be an urban center kind of zoned district.'",
        "'speaker_5': 'That's what the plan would point towards being a steer towards. I guess the applicant towards rezoning to the suburban would be, you know, more appropriate, a little bit farther out, but where there's still a pedestrian related influence. But but I can't speak specifically to how many spots are are being proposed at this time.'",
        "'speaker_3': 'Sure. Thank you for it. Or Dan, could one of you speak to that, please?'",
        "'speaker_2': 'I'm sure Dan knows this as well, but it's part of the approval process with the Public Transportation Authority. We were required to do an 800 car parking lot for the rail stop, and that 800 acres is entirely on the air land.'",
        "'speaker_2': 'And it's right here just adjacent to the rail stop. And then so that is actually under construction. The zoning that we required is, as we come in, as kind of said, will be printed on the designation. We have some of our blocks that we've met and proposed to the city to be CMCs, which are the more dense'",
        "'speaker_2': 'and more stringent than even smoke say. But so some of them will be CMCs and will be, as some say, and some will be as. Some X as some x will be out by Tower Road primarily.'",
        "'speaker_3': 'Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilman Flynn.'",
        "'speaker_9': 'Ferd could open up and down an up and down. In your letter of support, you said that this would that this zoning, this text amendment could help address some of the challenges of developing one of the only greenfield tod sites in the city.'",
        "'speaker_9': 'Explain what those challenges are and how this language helps you.'",
        "'speaker_2': 'Sure. We in addition to the two zoning that we will have, we also have the design guidelines and the design guideline speaks to a lot of the same criteria. Sometimes it's challenging to implement the design guidelines if you don't have the proper underlying zoning.'",
        "'speaker_2': 'So we believe this bolsters it and helps it in addition to have Cinemax throughout. Two 200 plus acres and then jump right to Suburban. In terms of transition, really didn't work as well. So I mean, this kind of allows us to transition from Tower Road, which is a more car oriented, if you will, into the site.'",
        "'speaker_2': 'So that's kind of the challenges we're trying to address.'",
        "'speaker_9': 'Excellent. Thank you for the clarification. And Kyle, can I ask you, this is a text amendment and there's no map amendment in front of us tonight. I'm not even from Mr. Bell's. Where do you see if, you know, does the city plan to propose any map amendments to institute this?'",
        "'speaker_9': 'Are we simply going to wait for property owners or or interested parties to propose to us?'",
        "'speaker_5': 'Yeah. At this time the city does not have plans to grow CBD. Does it have any plans to initiate applications.'",
        "'speaker_9': 'Other than Mr. Bell's and the property up there at the station on Pioneer Boulevard? Do we know of any other applicants who are coming forward now that we will have this?'",
        "'speaker_5': 'We don't what we did, we took a look at whether there would be other areas of the city where this might be applied in the future. And that's why we proposed it as a text amendment, because it may make sense near some other suburban transit stations, but we don't have any particular applicants identified.'",
        "'speaker_9': 'Okay. Thank you very much. That's all.'",
        "'speaker_1': 'Thank you. Councilman Flynn, Councilman Espinosa.'",
        "'speaker_5': 'Mr. Bell's. Sorry, you probably said this and I missed it. Is your metro district already formed?'",
        "'speaker_2': 'Yes, it was approved. Two and a half years ago. I believe in fight, but then city council.'",
        "'speaker_5': 'And then the design guidelines, the standards were concurrent or they followed that.'",
        "'speaker_2': 'They were they were they followed it and they are in or they're not formally in place. The design declaration that enables them is in place and so they are encumbered. The declaration is a covenant in our land and is actually a covenant on the dear land as well.'",
        "'speaker_2': 'So even though DIA will not be rezoning, they are going to follow the same design guidelines so that we have consistency, you know, between our acreage and their acreage.'",
        "'speaker_5': 'Okay, good. And the good news there is maybe they're already great to begin with, but man, you hear a lot about the talk about how we don't have any we can't grow out. We can only grow up. Well, this is an area where we can grow out.'",
        "'speaker_5': 'And it would be sort of not a very good sort of environmentally sustainable sort of approach if we didn't try to capture density here where we have this sort of greenfield opportunity with transit and recycled water systems and everything in place to do this right the first time.'",
        "'speaker_5': 'So I strongly encourage you when you're looking at your rezonings, to sort of try and capture more of these higher density ones. And CMCs that you're talking about in this in your master plan development proposals.'",
        "'speaker_2': 'Thank you. And one question for Kyle.'",
        "'speaker_5': 'Are any of these districts, maybe the two or the three? Are any of these considered protected zone districts? No. Okay. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Any other questions? 722 Seen. Let's call it. Okay. CNN public hearing is now a closed time for comment, Councilwoman Sussman.'",
        "'speaker_3': 'Thank you, Mr. President. And thanks for pointing out, Councilman Flynn, that we were we're looking at a text amendment. We're not looking at it a zoning. And while Mr. Bell's was in favor of it and gave us a very good description of how such a tax amendment would affect his project, we weren't we aren't talking about his'",
        "'speaker_3': 'project, but to me, this is a slam dunk. It's good design. It makes the suburban areas much more at a human scale. It's more pedestrian and bicycle friendly. And I was thinking, why shouldn't our suburban citizens also enjoy these design considerations that we enjoy in our more our older neighborhoods and are trying to reproduce where they aren't'",
        "'speaker_3': '? So I would recommend to my fellow council people to support this amendment. I think it's a really good idea of what what we can do in all of the green, the inside, the city and in our green fields.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_1': 'Thank you, Councilwoman Sussman. Councilwoman Black.'",
        "'speaker_3': 'Thank you, Mr. President. And thank you, Councilwoman Sussman and Kyl. Thank you. Because in my district, which is suburban, where we have four light rail stations, this is exactly the kind of zoning we need for new development. So thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Black. Councilwoman Gilmore.'",
        "'speaker_3': 'Thank you, President Herndon. I wanted to really thank Kyle and the KPD staff and really, you know, in District 11, this is a game changer really for District 11 and the TOD Station. Really encouraging residents to be able to take the commuter rail to 61st and Pena and stay the entire day and walk in the area bike'",
        "'speaker_3': ', you know, go to a full service restaurant, shop, everything. And I mean, you know, when you start talking about street level active use and patio areas and places where people will really enjoy the full, you know, urban feel but be close to home is something that is very much needed.'",
        "'speaker_3': 'And I just appreciate the conversations around making sure that this can become a reality, not only to encourage retail and multimodal transportation, but also to encourage the health of our residents in the area that you don't have to get into your car and drive a mile to eat somewhere and then drive another mile to shop.'",
        "'speaker_3': 'You will truly be able to do all of that in one area. So thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilman Lopez.'",
        "'speaker_2': 'Thank you, Mr. President. You know, I think about Councilwoman Gilmore's district and I think about the challenge as a mom, Belo and Green Valley Ranch, I think about some of these areas, especially along our my boundary with Councilman Flynn on Florida.'",
        "'speaker_2': 'And I think of Jewel and I think some of these areas that, you know, they were built to fit a suburban lifestyle, but now you bring them to this context. Now those strip malls own I mean, it's it's Family Dollar.'",
        "'speaker_2': 'It's, you know, they're mostly vacant. You really can't get much out of it because it requires you to jump in a car and get there. Not it's not very many services now that some of these strip malls are abandoned in some of these places, to be quite honest and be quiet unless you do a pod pod.'",
        "'speaker_2': 'There's really no zone district that's going to create that that that little Main Street feel to it, unless it's a big one where you can actually demolish a mall and and, you know, turn what you turn it into Belmar, basically.'",
        "'speaker_2': 'So, you know, I think this is a gray zone district. I like coming up with new zone districts and I like being able to think about that and how we apply it in the city. And I just want to keep saying, Marley shopping center.'",
        "'speaker_2': 'Marley Shopping Center. Marley Shopping Center. It's places like that that, you know, could really use a zone district that really kind of tailored to that suburban zone. But you got to remind ourselves, they were suburban areas in the fifties and sixties.'",
        "'speaker_2': 'They're not suburban areas anymore. You live in the city and county in Denver is it's urban even in a lot of parts. So we don't think it is. All right. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilman Flynn.'",
        "'speaker_9': 'Thank you, Mr. President. I want to thank the the community planning development staff for seeing this need in this gap and filling it in. I'm very familiar with the 61st and Pena development, and if I were so fortunate as to have a rail rapid transit station in my district, I would be looking forward to this even so'",
        "'speaker_9': 'much more as Councilwoman Black is in her district. But as Councilman Lopez said, we we don't have that advantage in southwest Denver. But I do see a possible application for this along some of our rubber tire transit routes on Federal Boulevard, maybe even on Sheridan.'",
        "'speaker_9': 'When you mention Marley Village, I'm thinking of Target Village as well at Sheridan and Evans. This is an opportunity to take a relook at those at those opportunities, at those sites and see how this could be applied. So I'm very supportive of this and happy to vote.'",
        "'speaker_9': 'Yes, thank you.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Councilwoman Ortega.'",
        "'speaker_7': 'The only thing I want to add to what my colleagues have said in support of this. This language, text amendment, language change is that by increasing the flexibility and the opportunity for development to occur in these suburban areas, it's an opportunity to keep our tax dollars in Denver.'",
        "'speaker_7': 'I know for folks who live out below and Green Valley Ranch, most of their shopping is done in Aurora. And so we don't capture those tax dollars unless they're actually shopping at King Soopers. That is at Green Valley Ranch.'",
        "'speaker_7': 'But I think this truly is an opportunity to look at the kind of need that we have. And I know at one point some time ago, our Office of Economic Development did you know a survey of how much leakage we have of dollars that leave the city and don't stay in Denver?'",
        "'speaker_7': 'And we may want to resurrect that as as we're looking at these opportunities citywide in trying to capture those tax dollars. So I will be supporting this today. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. In other comments. 722. I will just add to echo Councilwoman Gilmore's comments as being very familiar with this area. I think about all the exciting opportunities at 61st and Panya, we certainly know about Panasonic that's coming out there.'",
        "'speaker_1': 'And this this tax amendment will allow this to be a truly dynamic station and the possibilities truly are endless. So I want to thank CPD for the team for their for coming up with this. I appreciate and hope that all our colleagues will support this because this will be a great opportunity.'",
        "'speaker_1': 'And since the question was brought up of affordability, I will just bring up you know, there are several places in Denver that are really unaffordable, but I have to commend Pat Hamel, Green Valley Ranch at Oakwood Homes, because they they create a product that is affordable, high quality and very good space out of Green Valley Ranch.'",
        "'speaker_1': 'And so that is one of the few places in there, certainly others. But since we think about VR and affordability, I have to give kudos to Oakwood and the team for what they are doing out there and regards that.'",
        "'speaker_1': 'See no other comments, Madam Secretary? Roll Call 722 SUSMAN Hi.'",
        "'speaker_4': 'BLACK Hi, Brooks. Clark Hi, it's Vanessa Flynn.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'Gilmore I. Cashman I can eat. Lopez All right. New ORTEGA Hi, Mr. President. All right.'",
        "'speaker_1': 'Madam Secretary, please close the voting, announce the results. 3939 7722 has been placed on final consideration and do pass on Monday, November 3rd. There will be a required public hearing in Council Bill 828 designating 5115 West 39th Avenue, the Lamberts View House as a structure for preservation, saying no other business before this body.'",
        "'speaker_1': 'This meeting is adjourned. The.'"
    ]
}