{
    "City Business Incentive Fund Contract with Costco Wholesale Corporation for Alameda Square Shopping Center.": [
        "'speaker_3': 'Councilman Brooks, would you like for us to do with this?'",
        "'speaker_8': 'Thank you, Mr. President. I'm I'm calling this resolution now, for purposes of an amendment to change the contract number, to correct the date, Costco can begin petitioning funds and extends the maturity date so that the contract will terminate the last day.'",
        "'speaker_8': 'Costco can request the funds.'",
        "'speaker_3': 'Great. Thank you. So I will first check with councilmembers Flynn, Lopez, Ortega. I'm assuming you don't have issues with this amendment. Otherwise I'll come to you all for comments after we move forward then. Great. Councilwoman Gilmore, will you please put Resolution 933 on the floor?'",
        "'speaker_9': 'Thank you, Mr. President. I move that council resolution 933 be adopted.'",
        "'speaker_3': 'It has been moved and seconded. Councilman Brooks, your motion to amend.'",
        "'speaker_8': 'Thank you, Mr. President. I move that council resolution 93 be amended in the following particulars on page one. Line 13 Strike City Clerk's Filing Name 201524655. Dash and replace the city clerk's filing number to 01525975 dash.'",
        "'speaker_3': 'It has been moved and seconded any comments on this amendment? I'm pretty sure those are for the overall bill. All right. Scene none. Madam Secretary, voting on the amendment. Motion to amend. Take a roll call.'",
        "'speaker_4': 'Brooks Clarke Espinosa. Flynn r Gilmore. I Cashman.'",
        "'speaker_11': 'I.'",
        "'speaker_4': 'Lopez, all new Ortega Black. I Mr. President.'",
        "'speaker_3': 'Hi. Madam Secretary, please collectively announce the results. 11 eyes. 11 eyes. Council Resolution 933 has been amended. Now, Councilwoman Gilmore, we need a motion to adopt as amended.'",
        "'speaker_9': 'Thank you, Mr. President. I move that resolution 933 be adopted as amended.'",
        "'speaker_3': 'All right. It has been moved. We need a second. Moved and seconded. Now let's go to comments. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. I just had a few questions, actually. Go ahead and maybe Jeff can address them on. And we had a very good exchange today about a lot of the details, but I still wanted to bring out a few things.'",
        "'speaker_6': 'There is an existing tax increment finance agreement in place here, and the amount of that was $7.3 million. And it expires November 5th of this of 2016. Or 2015, 2016, and that was one of the reasons for the amended filing.'",
        "'speaker_6': 'Could you explain that? Sure. Council President Members Council My name is Jeff Romaine and with the Office of Economic Development. First off, I'd like to thank both city council staff, the city attorney's office, as well as City Council for making the amendment.'",
        "'speaker_6': 'It was a minor, but very important changes, as many of you may have already heard. And so to your question, yes, there is an existing tax increment financing agreement on the property that is called Alameda Square. It expires, as you point out, 11 526 2016.'",
        "'speaker_6': 'The way that we have structured the agreement between Costco in the city and county of Denver, Office of Economic Development is the incentive cannot be paid until the tip is expired. The reason is obviously we do not want to double incentivize activity at that site.'",
        "'speaker_6': 'And so upon that point, then we'd be the Costco would be able to receive the increment or not the increment, I'm sorry, the incentive. So they'd be able to first receive the incentive for the fourth quarter activity in 2016 and be able to invoices in 2017.'",
        "'speaker_6': 'So again, that was what the amendment for. And thank you, Councilman Flynn, for bringing that to my attention this morning. Thank you. And the tiff, the financing, will that be paid off? The thing that I know about Alameda Square, I remember I used to take my kids there to the organ grinder pizza place.'",
        "'speaker_6': 'And it's been and it's long been a difficult as Councilman Lopez will probably make note later. I've been a difficult area to keep businesses going. We've had various things in there. And the Lowe's, the TIFF was was adopted for the Lowe's project.'",
        "'speaker_6': 'Correct. Councilman Flynn, members of council, actually the tiff was with Brighton Corporation for the Development. Lowe's was the result in Venice was a tenant, if you will, because they came in as a tenant. Right. Whether whether or not the full amount of the 7.3 that's a that's between Durham, Brighton Corporation.'",
        "'speaker_6': 'What we do know for your information is, is the tiff expires on that date. In any tiff, of course, if the activity doesn't move forward in the increment isn't fully realized, that's the risk between whoever may be purchasing that debt or that or I should say, that bond.'",
        "'speaker_6': 'Okay. So I can't speak on behalf of the city, county, Denver. We would need to have Dora here to be able to talk about whether the $7.3 million in proceeds was fully realized through the tiff. All right. Thank you.'",
        "'speaker_6': 'That was going to be my question then. So thank you, Mr. President. I have anything else.'",
        "'speaker_3': 'Thank you. Councilman Flynn. Councilman Lopez.'",
        "'speaker_1': 'I just have some comments. Go ahead. The. This is such a good agreement. And I am glad I was really thrilled to know that Costco was entering into negotiations with the city and looking at this site. And for folks to understand it's not going to be your typical Costco.'",
        "'speaker_1': 'So there's two things there, three things I want to say. First of all, it was it's been 20, 30, 30 years in the making to redevelop this site, to get the site activated moving forward. At one point, there was a Walmart that wanted to come there.'",
        "'speaker_1': 'Neighbors, businesses a new way push really hard back on the city. The it wouldn't play well with the the A's and business owners that were there. They usually bring in their own tenants. So it sat there for a while and then, lo and behold, Lowe's and a lot of folks came to the table and said, we can'",
        "'speaker_1': 'do this if we get the property owners on board and we can actually keep those local businesses there without having to to move them out or or buy them out. And so that's why you see that redevelopment there.'",
        "'speaker_1': 'So it has been definitely a labor of love in the making. The good thing about this is that though there's these Costco business centers is what it's going to call. They sell things by the pallet. So you know how you buy it by the by the mule load.'",
        "'speaker_1': 'Now you buy it by the pallet, right. So, you know, I don't know what I could do with that much Cheerios, but I tell you what, you're probably going to get a good deal. Here's the thing. Only I think they have one place in Carson, Salt Lake City, Chicago.'",
        "'speaker_1': 'And now Denver is the only places where they have these business centers. So they're going to it's going to bring a lot of jobs to the neighborhood. It's going to really bring that activity. We sat down, Councilman Clark and I used Councilman Clark, who we used to share that boundary.'",
        "'speaker_1': 'And now it's entirely in Councilman Clark's district and councilman in Council District seven. We sat down with him, said, look, we also have a food desert in this area. We don't have a grocery store. We used to King Soopers.'",
        "'speaker_1': 'The organ grinder used to be there. My stomach is hurt now. I want that again. We were able to sit down with them and said, Can you do some kind of Harvard? Can you break up some of those palates?'",
        "'speaker_1': 'That way you can have sales for regular sized household. Fresh fruit, veggies, things like that, breaking up some of these pallets. And they said, look, we'll come back to you on that. They agreed to. So not only is this is this a victory for economic development and just and really getting into that area especially over there involved'",
        "'speaker_1': 'there were where we do need that EC and that those economic drivers. But it's going to help solve part of the food desert now this isn't the only thing but so Councilman Clark and I are both shaking their heads and really happy about this because this helps address that issue.'",
        "'speaker_1': 'And, you know, you won't find that hidden here in this bill. That story won't be told in this bill. And this bill most likely move forward and that'll be it. And folks will see a Costco business center. But.'",
        "'speaker_1': 'That's the story. And I'm very supportive of this resolution and very supportive of this deal. Hopefully it moves forward with flying colors. The only thing I'm disappointed at is you don't get that dollar 50 hotdog in a soda, man.'",
        "'speaker_1': 'It's the best deal in town. And I still have the drive drive at it for that one. I'm glad somebody laugh. Thank you, Jacki.'",
        "'speaker_3': 'Thank you. Thank you. Councilman Lopez, Councilwoman Ortega.'",
        "'speaker_10': 'Well, I just wanted to add my support for this particular ordinance moving forward. This did come to committee. We had a lengthy discussion about it. And I think, you know, some of the things that were shared by my colleagues about the benefits to the immediate community, but also to the greater Denver community.'",
        "'speaker_10': 'One of the things we learned is that this business center will serve many of our neighboring states as well, not just, you know, Denver Metro, but people will come in from Wyoming and maybe New Mexico and Utah to buy some of their things for their businesses.'",
        "'speaker_10': 'So, you know, we get those sales taxes. And I'm very confident that the incentive dollars that we're providing for this will be paid off in very short order. And thereafter, all of those revenues come to the city. So I'm pretty excited about it.'",
        "'speaker_10': 'I do want to mention that there's a strong Asian and Vietnamese presence in that shopping center and. Councilman Flynn and I were were at an event last evening, and I know from some involvement that my office had a couple of years ago.'",
        "'speaker_10': 'There's been some work to do, a statue in that park, and we'll all be getting an invitation to go to that unveiling, which would be sometime after the first of the year. So I just wanted to share that as well.'",
        "'speaker_10': 'So, Councilman Clark, congratulations to your community for lending this and to OED for making this happen.'",
        "'speaker_3': 'Thank you. Councilwoman Ortega.'",
        "'speaker_1': 'Councilman Clark. Thank you, Mr. President. I just wanted to also voice my support of this project. This is something that the neighborhoods in that are now in my district are very excited about. It's going to bring 150 good paying jobs with good benefits.'",
        "'speaker_1': 'And I really want to thank Councilman Lopez for his work and collaboration on helping get that retail component, because there is a real issue with the food desert over in these communities. And I think that that's something that like Councilman Lopez doesn't top out on this bill, but is something that's critical to what's happening in this community'",
        "'speaker_1': '. And I think that, you know, we draw lines in the city where council districts are. But that doesn't mean that we we are bound by them in one way, but in another way we reach across those lines and collaborate.'",
        "'speaker_1': 'And that wouldn't have happened without that piece of this wouldn't have happened without Councilman Lopez's involvement in this. So I just want to say thank you and encourage my colleagues to support this. This is something that's really important to Aqua Park and Verde in my district.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman Clark. Any of the comments on Resolution 1933 as amended. CNN. Madam Secretary, welcome.'",
        "'speaker_8': 'Brooks I.'",
        "'speaker_4': 'Clark Right. Espinosa.'",
        "'speaker_6': 'I.'",
        "'speaker_4': 'Gilmore, I.'",
        "'speaker_6': 'Cashman Hi.'",
        "'speaker_4': 'Lopez I knew. Ortega I. Black I. Mr. President. Hi.'",
        "'speaker_3': 'Magic trick exclusively announced the results.'",
        "'speaker_4': '11 Ice, 11.'",
        "'speaker_3': 'Eyes Resolution 933 has been adopted as amended. Next one, I believe, was 948. Madam Secretary. Councilwoman. It was 925. Then the next thing I see on I right that. All right. 925. Councilman Flynn, what would you like for us to do with that?'",
        "'speaker_6': 'Thanks, Mr. President. Just have a comment.'",
        "'speaker_3': 'Go right ahead.'"
    ],
    "2016 Special Districts Mill Levy Resolution": [
        "'speaker_6': 'Thank you. This is the. Thank you, Mr. President. This is the the resolution that sets the DPS meal levy for this year, for taxes for next year. And I didn't want the occasion to go by without letting people know that when they get their tax bill next year, that they should be prepared for these new mill levies'",
        "'speaker_6': 'and the new reassessments. It will be more than it was last year. You will be paying more in most cases because of the reassessment citywide. And I ran the numbers just on my own property. And and between the the the mill levy that we set for the city and for DPS and the special districts.'",
        "'speaker_6': 'My property tax bill will be going up about 27%. It's going to vary, of course, across the city. I do want to make note, though, that the mill levy is decreasing from last from the current as well as the city's mill levy that we adopted last year.'",
        "'speaker_6': 'We were we did mitigate for some of the increase in the assessed value, and you will see those results next year. I just wanted to make note of that. So it didn't go by on a block vote. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilman Flynn. All right. Now I'm secretary. Next one. Now we're at 948. Great. Councilwoman Gilmore. Would you like for us to do with this?'",
        "'speaker_9': 'Thank you, Mr. President. I'm calling out this resolution for a separate vote. I used to work for this organization, and I will be abstaining.'",
        "'speaker_3': 'Thank you for that. Well, Councilwoman Gelman, will you please put Resolution 948 on the floor?'",
        "'speaker_9': 'Thank you, Mr. President. I move that council resolution 948 be adopted.'",
        "'speaker_3': 'It has been moved and seconded. Any additional comments? Incomes will get more. Where you good? Just want to make sure.'",
        "'speaker_9': 'Yes, Mr. President.'",
        "'speaker_3': 'Thank you. See no other comments. Madam Secretary, welcome.'",
        "'speaker_4': 'Gillmor. Epstein Cashman.'",
        "'speaker_11': 'I.'",
        "'speaker_4': 'Lopez All right. New. Ortega All right. Black Brooks. Clarke. Espinosa. Hi, Flynn. Hi, Mr. President.'",
        "'speaker_3': 'Hi. Madam Secretary, please. Those are very nice results. Tonight's one abstention denies one abstention, 948 has been adopted. Next one, Madam Secretary, I believe 942 councilman was 40 and I'm out of the tonight. 940 Councilwoman Ortega okay, come one Ortega 940.'",
        "'speaker_3': 'What would you like for us to do with this question? Go right ahead.'",
        "'speaker_10': 'Is there anybody here from our H.R. department? Can you come forward, please? So this is our second year utilizing this new company, correct? Correct. Can you tell me if we have done any surveys or assessments of employees who have utilized these services?'",
        "'speaker_10': 'And do we have that data that you can share with me?'",
        "'speaker_5': 'All I'm aware of is that we have reporting data based on the utilization of the plan.'",
        "'speaker_10': 'So we haven't asked the employees how it's working for them.'",
        "'speaker_5': 'I can find out if coms, like, has done that.'",
        "'speaker_10': 'Okay. I'm just curious because I know when this came forward, I had a lot of questions and concerns because one of the programs that we used to have was our cancer buddy program. And I know this, you know, covers a lot of different elements.'",
        "'speaker_10': 'It replaced our Office of Employee Assistance, which covered, you know, a lot of confidential issues that employees might have. But I just and they're not physically here. So I just want to know how it's working. So if we have not done a survey of the employees who have utilized it, I think it would be invaluable to us'",
        "'speaker_10': 'to know how is this working to be, you know, dealing with somebody confidentially that is remote and they don't get to really sit face to face and talk to somebody as they're trying to deal with any of these multitude of issues that people may be calling in about.'",
        "'speaker_10': 'So can you follow up on that and get back to me, please?'",
        "'speaker_12': 'Absolutely.'",
        "'speaker_3': 'And could you introduce yourself for the record, please?'",
        "'speaker_5': 'Yes. I'm Jennifer Cahoon with the Office of Human Resources.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_10': 'Thank you. Thank you, Jennifer. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Captain Ortega. Next on Madam Secretary. 942. Councilman Espinosa, what would you like for us to do with this? I just had a comment. Go right ahead.'"
    ],
    "Public Alley Dedication at West 50th Avenue and Vrain Street.": [
        "'speaker_8': 'I just wanted to I had a hard time when I was reading this, putting it all together. So I just wanted to clarify that this bill request not only dedicates land as public alley, but it also rededicate a portion of Main Street, which was vacated in 1989.'",
        "'speaker_8': 'And that was that was it. Thanks.'",
        "'speaker_3': 'Okay. Thank you, Councilman Espinosa. All right. Those are all the resolutions. Next up, bills for introduction. I think believe the one we had was 955. Councilman Flynn, what would you like for us to do with this thing?'",
        "'speaker_6': 'Mr. President, I would like to this bill allow for a separate vote. It involves the annual RTD eco pass contract for city employees. And I was employed by RTD up until July 10th. And under the city's code of ethics, I am to abstain from any actions until six months had passed.'",
        "'speaker_6': 'I would then ask if if it is ordered published by my colleagues, I would ask that Councilwoman Gilmore make a motion to postpone the final vote until January 11th, because as timing works out, when this would come up for final next week because of the holiday season, there apparently will be only seven members of council present.'",
        "'speaker_6': 'And if I had to abstain, the bill would die with six votes or up to six votes. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilman Flynn. First thing we need to do is get it on the floor. Councilwoman Gilmore, will you please have Council Bill 955 ordered published?'",
        "'speaker_9': 'Thank you, Mr. President. I move that council bill 955 be ordered. Published.'",
        "'speaker_3': 'Thank you. Has been moved and seconded. No other comments. Madam Secretary, welcome.'",
        "'speaker_4': 'I thought, Oh, never mind. I'm sorry. Flynn.'",
        "'speaker_6': 'Epstein.'",
        "'speaker_4': 'Gilmore. I can. I can each. LOPEZ. All right. New Ortega. Black Brooks. Clerk Clark. Espinosa. Hi. Mr. President.'",
        "'speaker_3': 'Hi, Madam Secretary. Please for the vote. Now the results.'",
        "'speaker_4': 'Ten eyes, one abstention.'",
        "'speaker_3': '10 hours, one abstention. 955 has been ordered published. Now, Councilwoman Gilmore, will you please make the motion to postpone final consideration of Monday, January 11th?'",
        "'speaker_9': 'Thank you, Mr. President. I move that final consideration of Council Bill 955 be postponed to Monday, January 11th, 2016.'",
        "'speaker_3': 'Thank you. It has been moved and seconded. Don't believe we have any other comments. So, Madam Secretary. Rocco.'",
        "'speaker_4': 'Black eye. Brooks Clark. Espinosa Flinn.'",
        "'speaker_6': 'Abstain.'",
        "'speaker_4': 'Gilmore. Eye Cashman. Eye Lopez. I knew Ortega. Mr. President.'"
    ],
    "Property Acquisition for the National Western Center Project.": [
        "'speaker_3': 'I. Madam Secretary, please. Girls voting announced the results tonight. One abstention in ideal abstention final consideration of 955 has been postponed to January 11, 2016. All right. We had one bill on final call out 900 Councilman Flynn and I to Councilman Black as well.'",
        "'speaker_3': 'Kathleen Flynn, did you want that on the floor or do you have a comment? I believe kind of question. QUESTION Again, Councilwoman Black, if you want this, call that for vote. Correct. Correct. All right. So we need to have 900 placed on final consideration and do pass.'",
        "'speaker_3': 'Councilwoman Gilmore, will you please put 900 on the floor?'",
        "'speaker_9': 'Thank you, Mr. President. I move that council bill 900 be placed on final consideration and do pass.'",
        "'speaker_3': 'All right, it has been moved. Colleagues, we need a second on the screen. Moved and seconded. Thank you. Comments. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. I wanted to ask either Kelly or John a question about one aspect of the actually that's not in the bill, but relates to the Uniform Relocation Act that we have said that we would follow, pretty much follow during the acquisition process, even though there are no federal funds in there.'",
        "'speaker_6': 'And I just wanted to make a record, Mr. President, so that so that people would know going forward what our intent is, because it's not mentioned in the bill. So maybe, Jenn, you could just briefly explain to us what the Federal Uniform Relocation Act is and why we've chosen to follow it here.'",
        "'speaker_9': 'Sure, I'd be happy to. I'm General Warren with the city attorney's office. What you have in front of you is a is the ordinance that authorizes us to move forward with acquisition of land within the boundaries that are drawn in the ordinance, in addition to the acquisition, which we have to do in accordance, of course, with the'",
        "'speaker_9': 'Constitution where we pay just compensation for property. And in addition to the Constitution, we also have a state statute that requires that that acquisition take place in a certain manner.'",
        "'speaker_5': 'The the state.'",
        "'speaker_9': 'Law does not require that we pay for relocation. There is a federal law called the Uniform Relocation Act that requires payment for relocation for folks who are displaced by federal projects. This is neither being done by a federal agency nor has federal dollars in it.'",
        "'speaker_9': 'So this the Uniform Relocation Act does not apply by its terms. However, the city and Kelly's team at the DCC has decided that the right thing to do is help people relocate. But instead of creating a new scheme in which to figure out who gets what and what we pay for and and all that, that would be'",
        "'speaker_9': 'difficult and expensive to create on our own. We are going to use the Uniform Relocation Act as a guide. And indeed that has, as you might expect, uses federal dollars to relocate people displaced by their projects. And so there's a there's a manual that Scott puts out that's a good guide in how to implement the you are'",
        "'speaker_9': '. So we will be doing that. It's just that by its terms, it doesn't apply. Mm hmm.'",
        "'speaker_6': 'Thank you. And I also Jen, I want to commend Kelly and the team for taking that on, because it's a moral obligation to this to help those who are displaced by our projects. There may be some areas and again, I just wanted to make a quick record.'",
        "'speaker_6': 'There may be some areas where we do not strictly follow the Federal Uniform Relocation Act, however. Is that.'",
        "'speaker_5': 'Correct? There may be.'",
        "'speaker_9': 'And we are in the process of hiring specialists who will help us with relocation, who actually they go and sit in people's homes if their homes are or go to their businesses and figure out exactly how that occurs.'",
        "'speaker_9': 'That's a very detailed work. And so we will have to. We plan on using those specialists to help us work through how we might use the U.S. But I expect in most big, big ways, we will follow it.'",
        "'speaker_6': 'Will you publish any brochure or or pamphlet that will?'",
        "'speaker_9': 'Yeah, there will be a.'",
        "'speaker_6': 'Lot of the property owners, what they were going to do.'",
        "'speaker_9': 'Collaterals, collateral materials provided during this process.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_3': 'That's all. Thank you, Councilman Flynn. Councilwoman Black.'",
        "'speaker_5': 'Thank you, Mr. President. I will be abstaining from this vote tonight. I have family members who own property that may be acquired. It's a building where my father in law's business has been operating for 34 years. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Black. Councilman Espinosa.'",
        "'speaker_8': 'A similar question. And this only comes up because as prior to this role on council, I was a member of the Board of Adjustment and we had a property and you probably know what I'm talking about out there that sort of uniquely falls not in the housing residential category and not in a commercial category.'",
        "'speaker_8': 'And it's certainly a historic building. So how do we capture that with the provisions that we've got where you have a essentially a 5 to 10000 square foot residence, but it is clearly a historic bank structure. Is that classified as a commercial property is vacant property is industrial property or is a residential property?'",
        "'speaker_8': 'And then you locate relocate that individual into a similarly scaled home.'",
        "'speaker_9': 'So again and I'm sorry I can't answer in the particulars, although we'd be happy to provide you with more information as as the process unfolds. And as we get the specialist online to help us, I will say in general, we will help whoever is living there or or doing business in a commercial place.'",
        "'speaker_9': 'Whatever they're doing in that space will help them do that somewhere else. So it doesn't I'm not sure it matters so much what the zoning is and stuff. And we as at a minimum, the relocation will require us to provide I can't remember the three adjectives safe housing, basically.'",
        "'speaker_9': 'And it's not a one for one thing, the just compensation that we're required to pay will take into account, you know, how big the the home is and the condition and all the things that that the Constitution requires us to consider and that the courts have required us to consider.'",
        "'speaker_9': 'But in terms of the details about that particular property, and I'm not familiar with it, so I don't I can't really address it specifically, but we'd be happy to keep you in the loop to.'",
        "'speaker_8': 'Sort of by by circumstance. There's a lot there's not a fortunately, there are not a lot of residential properties there yet, but they're there. You might not necessarily have the most real estate savvy individuals having to navigate this process.'",
        "'speaker_8': 'Do we have a mechanism or system in place for. Those those owners to challenge the value determination or.'",
        "'speaker_9': 'Yes, the state statutes very clear about how to do that. And they are provided with all of that information in materials which we have to provide by law and certainly will provide. And all of those materials can be translated also.'",
        "'speaker_9': 'So we intend to make sure that we're working one on one with all of those property owners. So if they if they do want to challenge it, they certainly don't have to agree with with our appraiser. They are we are required to pay for an appraisal that they can go out and get.'",
        "'speaker_9': 'And if we can't come to a meeting of the minds, then there's a there's certainly a mechanism for them to object.'",
        "'speaker_8': 'Okay. I would just love to see a copy of that final information that you're providing to those people.'",
        "'speaker_5': 'You can. So we can do that now.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilman Espinosa. Councilwoman Ortega.'",
        "'speaker_10': 'I just had a question about the translation. I don't know how many of those property owners may be Spanish speaking, but I just wanted to clarify if the translation was in layman's terms that the average person could understand them, or if it's actually translating from from English to Spanish for any of those property owners who may need'",
        "'speaker_10': 'to have it translated in their own native language. And also in layman's terms.'",
        "'speaker_5': 'Good evening, Councilwoman Ortega. I'm Katy Spritzer. I'm working with Kelly's team on the NDC on the land acquisition. And in fact, we're working with a relocation consultant who has a Spanish speaking person that's part of their staff that knows how to translate this all into layman's terms.'",
        "'speaker_5': 'And in fact, we had one meeting already yesterday or not yesterday, last week that the the translator was at and her job is the relocation process. And she's also a Spanish speaker. So it's perfect. And the folks with with whom we met were very grateful that we provided that service.'",
        "'speaker_10': 'Awesome. Thank you so much.'",
        "'speaker_3': 'Thank you, counsel. Marty.'",
        "'speaker_8': 'Councilman Brooks. Yeah, thank you, Mr. President. I just wanted to piggyback on on that comment. Think it's a great comment. Councilman Ortega and I was at a meeting last week on a different Denver project in District nine where they had a translator and they're actually walking through the relocation act with this translator, which is which was great'",
        "'speaker_8': '. But I also want to make sure that we underline that this is not just for owners. There are some property owners who own property and are not there, but is for renters as well. And there has been some property that's been acquired not for this particular National Western Center, but for that where those renters have have received'",
        "'speaker_8': 'compensation and have now purchase a home. So I think it's important to have the renters in there as well.'",
        "'speaker_5': 'Good point. That the the relocation assistance is available to both property owners and property renters or tenants in property.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman Brooks. Councilman Espinosa. You bet.'",
        "'speaker_8': 'Just now that I know that there might be multiple translations, I just want to state that I would like all those iterations. Thank you.'",
        "'speaker_3': 'Thank you. All right. Any other comments on council below 900? Scene nine. Madam Secretary, roll call.'",
        "'speaker_4': 'Flynn. Hi, Gilmore. Hi. Cashman, I. LOPEZ All right, new ORTEGA High Black.'",
        "'speaker_8': 'BROOKS High.'",
        "'speaker_4': 'Clerk.'",
        "'speaker_1': 'CLARK All right.'",
        "'speaker_4': 'ESPINOSA Hi, Mr. President.'",
        "'speaker_3': 'Hi, Madam Secretary. Please. Those very nice results tonight.'",
        "'speaker_4': 'One abstention in.'",
        "'speaker_3': 'ISE, one abstention 900 has been placed on final consideration and does pass. I believe that was on the bill. So we are ready for the block votes. All other bills for introduction are ordered published. Councilwoman Gilmore, will you please put the resolutions on the floor for adoption in a block?'",
        "'speaker_9': 'Thank you, Mr. President. I move that the following resolutions be adopted in a block. 956 924 925 nine 3953 938 nine 4943 944 945 946 947 949 nine 5951 942 922 and 983.'",
        "'speaker_3': 'Thank you. It has been moved and seconded. Seen no comments, Madam Secretary, roll call.'",
        "'speaker_4': 'Flynn Hi.'",
        "'speaker_9': 'Gilmore I.'",
        "'speaker_4': 'Cashman Hi. Lopez All right, new Ortega I black Brooks. Clark All right. ESPINOSA Hi, Mr. President.'",
        "'speaker_3': 'Hi. Madam Secretary, please Kosovo Denounce the results.'",
        "'speaker_4': '11 ICE.'",
        "'speaker_3': 'Alumni as the resolutions have been adopted in a bloc. Councilwoman Gilmore, would you please put the bills on final consideration on the floor for a final passage in the block?'",
        "'speaker_9': 'Thank you, Mr. President. I move that the following bills be placed upon final consideration and do pass in a block 882, 934 and 918.'"
    ],
    "Naming of the New Central Denver Recreation Center.": [
        "'speaker_11': 'of the former councilwoman, Carla madison. We started this process in May of last this past year with a public notice announcing the process and the requirements for naming the recreation center. In response to that, the committee, a committee was formed and the result was a petition with more than a thousand names.'",
        "'speaker_11': 'More than 130 letters or emails of support, which included letters from Councilman Albus Brooks, Councilman Paul Lopez. Former Councilwoman Elvira Wedgeworth. Former Councilmember Jeannie Robb. State Representative Beth McCann. State Representative Angela Williams. Former Councilwoman Marsha Johnson. Former Councilwoman Peggy Lehman.'",
        "'speaker_11': 'Former Councilman Rick Garcia. Brad Buchanan, the Executive Director of Community Planning and Development. Joel Noble, President of Curtis Park Neighbors. And the list goes on. So the committee submitted the petitions and the letters in support. We determined that the recommendation from this committee met all of the requirements of our naming policy.'",
        "'speaker_11': 'And so we brought that ordinance to the request for the ordinance to City Council Committee earlier this month. It did go to the Parks and Rec Advisory Board in November, as is required by our process. The Parks and Rec Advisory Board unanimously voted to move forward the recommendation of the naming of the Central Denver Recreation Center to'",
        "'speaker_11': 'be named in honor of Kahlo Madison. And so I'm here with the. A voluminous record in case you should want to investigate any of those. But I'm here on behalf of. To urge your consideration, your favorable consideration of this item this evening.'",
        "'speaker_3': 'Thank you. Thank you, Miss Haines. And I want to welcome our. Our honorable former council president as well. We have eight speakers signed up today and I'm going to call the first five and ask you make your way to the front pew that test the bad techs David Roybal, David Wahlstrom, Joel Noble and Marney Ward.'",
        "'speaker_3': 'You five, please make your way up to the front pew. And, Mr. Texa8, you may begin your remarks.'",
        "'speaker_6': 'Thank you. Thad, Texas 4535, Julian Street, Denver, Colorado. Retreats and vigils are statements of good intentions. But I wonder what Carla madison would say about you giving a $10 million bribe to Adams County, another $20,000 to pay a claim against the police and building a recreation center for middle class people.'",
        "'speaker_6': 'While, as we heard tonight, 120 people are freezing along our rivers and under our bridges. Of course, only $20,000 in claims against the police makes this a relatively good night for Denver taxpayers.'",
        "'speaker_3': 'Thank you, Mr. Text. David Roybal.'",
        "'speaker_8': 'Hello. My name is David Roy. I want to wish you all a happy holiday. And I'm in support of this bill. You know, we can label a building historic, but, you know, it's a labor. We're after a councilmember that's done a lot of work and we just thankful for all the work that she did for our community'",
        "'speaker_8': 'to name that and evaluate, you know, the the work that that person did and the community coming together on behalf of that, that's something that we could be proud of as Democrats. Thank you.'",
        "'speaker_3': 'Thank you, David Wahlstrom.'",
        "'speaker_11': 'Thank you. A little longer, but I think I can do this 3 minutes. My name's Dave Wahlstrom, 1265 Cherry Street, a couple of blocks away from the in-progress Under-Construction Central Denver Recreation Center. Thank you for this opportunity to speak on behalf in favor for the call of Madison Recreation Center Naming Ordinance.'",
        "'speaker_11': 'And Meyers is executive director of the Kovacs Business Improvement District, Colfax on the Hill. It was my privilege and honor and joy really to work with Carla on the revitalization of East Colfax, including the community outreach and the support of the new rec center both before and during Carlos City Council years.'",
        "'speaker_11': 'Why so many of Carla's friends and colleagues wanted to be a part of this citizens naming initiative as very easy to explain, to know Carla was to love Carla. For the person she was and for all that she did for our community and city.'",
        "'speaker_11': 'It was this experience of Karla that energized the citizens. Name a petition with its 1067 signatures, 128 letters of support from both the public and the private partnership sectors, including 12 registered neighborhoods and business organizations in the immediate area of the new rec center location at Colfax and Josephine.'",
        "'speaker_11': 'In our petition, we believe we have met Denver Parks and Recreation's official criteria for naming the recreation center. I ought to have Madam Secretary Speed read this criteria, but I'm going to do this as best I can. Here is what we had to meet.'",
        "'speaker_11': 'Quote well, the name be have historical and cultural and social significance for generations to come. Well, the name and gender are a strong and positive image. Well, if memorialize or commemorate people's places or event that are of the enduring importance to the community, well, then gender significant ties of friendship and mutual recognition and support within the community'",
        "'speaker_11': '. Will a name be identified with some major achievement or advancement of the public good within the community? Well, the name be particularly suitable for the recreational facility based on its location and the surrounding neighborhood. Lastly, will the name have symbolic value that transcends ordinary meaning or use and enhance the character and identity of the recreational facility?'",
        "'speaker_11': 'About this last criterion in her endorsement letter, former city councilwoman Jenny Raab said it best. I think, as I quote from her letter, not unlike the other successful city projects, many people are deserving of credit for the rec center's reality, including this council.'",
        "'speaker_11': 'But the naming should be about the spirit of the place. Karla's openness, inclusiveness, funkiness, yes, and creativity all speak to the sort of place we want the center to be. In closing, and to underscore in your statement, I believe Carla Madison's life purpose in life centers purpose are one and the same.'",
        "'speaker_11': 'That being the mutual dedication to the visitors, it's all to nobody here. 3 minutes that both in the individual and in the collective.'",
        "'speaker_3': 'Thank you, sir. Thank you. Thank you. That's. Joel. Joel Noble.'",
        "'speaker_8': 'Council President Herndon, Members of City Council. My name is Joel Noble. I live at 2705 Stout Street, and I'm here as president of Curtis Park Neighbors, an active neighborhood organization in what was Council District eight, Carla Madison's district.'",
        "'speaker_8': 'Carl Madison was a strong advocate for the health and well-being of neighborhoods. And I'm just going to give you a couple anecdotes of what you did for our neighborhood. Similar stories can be told throughout what was District eight in Rennick running for office.'",
        "'speaker_8': 'She visited with us many times and asked, What are our challenges and what are our goals? And we gave her our 1988, her 1989 neighborhood plan and said, there's a lot in here that we put together that is not making progress.'",
        "'speaker_8': 'Can you help with us? And those became her priorities for the neighborhood. More was achieved in her leadership than we'd ever dared to hope. She brought zoning in line with the actual character of our neighborhood, serving on the Zoning Code Task Force.'",
        "'speaker_8': 'She instigated a plan for the 30th in Blake Station area, which is now starting to develop. She supported adding bike lanes to our major arterials through the neighborhood and doing projects such as road diets and one way to two way conversions that have calmed the traffic in our neighborhood.'",
        "'speaker_8': 'Supporting safety for all. She supported the creation of the Five Points Business District, which, with already support in the state, support has catalyzed the transformation of Welton Street now in progress. In promoting a new vision for Arapaho Square.'",
        "'speaker_8': 'She brought the whole community together to picture what could happen with that area of parking lots, including a vision for a new park. She supported the completion of our landmark districts with four new landmark districts and Curtis Park completing the protection of our historic area.'",
        "'speaker_8': 'And then having achieved so much that was called for our night in our 1989 plan. The last gift she gave to our neighborhood was the creation of the Northeast Downtown Neighborhoods Plan, our new neighborhood plan that charts the course for the next 20 years.'",
        "'speaker_8': 'Carla has left an indelible impression on our neighborhood and on all District eight neighborhoods, commemorating her leadership as a strong, positive leader. By naming the rec center in her honor as the rec center that she helped make possible is very appropriate.'",
        "'speaker_8': 'By unanimous vote of the Curtis Park Board of Directors, please. Name of Carla.'",
        "'speaker_3': 'Thank you, Marnie Ward. And right before Ms.. Ward begins her remarks, I want to call the last three speakers up Darrell Watson, Jackie Shumway and Paul Weiss. So you can make your way up this way. You may begin your remarks.'",
        "'speaker_5': 'Thank you. I am Ernie Ward. I live at 2341 Lafayette Street in Denver. I am a singer and a performing artist and a proud 15 year resident of the Whittier neighborhood. Kahlo, Madison and I shared a mutual love of all things funky.'",
        "'speaker_5': 'That is F.U and K-Y. Maybe one of our favorite was shoes. At some point we realized that we were the same size shoes. And about five years ago, Carly gave me the shoes that I wear tonight. I love them.'",
        "'speaker_5': 'They're orange. What's a better color than orange? They have straps that wrap up my ankles. You can look at them later. It's okay. I know you want to. They can all see them. I don't presume to know what it's like to walk a mile in her shoes, but I know she's not only walked the walk, talked the'",
        "'speaker_5': 'talk, but took action and made things happen in our community for all people. Carla was and still is my friend, but she was also one of my biggest fans. Every show she was front and center, and it wasn't just for my show, but the countless theaters and art galleries, big and small, on the sidewalks with the buskers'",
        "'speaker_5': 'and the chalk artists and in our alleys admiring graffiti art. Carla loved it all because Carla was art. This quality is one of the things that I admired most about her as an artist. We sometimes feel like we are pushed aside and that our opinions don't matter or that we are not heard.'",
        "'speaker_5': 'We took Carla were some of the first people that she sought out when needing to make a new decision or having a new proposal in front of her. She loved Denver and actively worked to make it a better place for its residents and visitors.'",
        "'speaker_5': 'From the Uptown Sampler to City Park Festival of the Arts, the City Park Ice Cream Social. And this was before she represented us so beautifully on the City Council. People were drawn to Carla because of her spirit, her curiosity of the world, and her determination to make it a better place, not because of the recognition, but for'",
        "'speaker_5': 'the greater good of all people. What a better way to honor the spirit of the West that Carla exemplified daily than by naming a building in her honor. And not just a building, but a gathering place, a gathering place where people will actively be making their minds, bodies and spirits stronger, engaging in community activities, seeking knowledge and'",
        "'speaker_5': 'skills to improve themselves and our communities, and of course, to share the love that Carla had for our four legged fur babies, that they have a gathering place as well. There are many people in our community who are worthy of having their name on this building, but I feel that it's very appropriate it be Carla madison, who'",
        "'speaker_5': 'lived in the spirit and service of others. Thank you.'",
        "'speaker_3': 'Thank you, Darryl.'",
        "'speaker_1': 'Darryl Watson. Good evening, President Herndon, members of Council. My name is Darryl Watson and I'm president of the Whittier Neighborhood Association. And I'd like to start off by saying the Whittier Neighborhood Association Board voted unanimously in support of naming the rec center after Carla madison.'",
        "'speaker_1': 'I'm so happy that Joel and Dave went ahead of me. So you guys had all the facts. I'm going to tell a story. I met Carla Madison a long, long time ago in a galaxy far away in the late nineties.'",
        "'speaker_1': 'Some of you remember the nineties at the turn of the century when she was president of City Park West Neighborhood Association. I started my first tour of duty as president of a Whittier Neighborhood Association, and it just pulled me back to become president again.'",
        "'speaker_1': 'But we serve closely with each other, working on zoning issues for City Park West and for the Whittier neighborhood. I read something recently that Councilman Charlie Brown said about column Madison. He said even folks that disagreed with her couldn't stay mad at her for long.'",
        "'speaker_1': 'She was so damn likable. And I hope Dan isn't cursing, but I apologize. But she was so likable. I agree with that story. I agree with that sentiment. She was truly life in love with in our district. I told this story at the Parks and Rec Advisory Board meeting.'",
        "'speaker_1': 'I'll say it again. When Colin, I ran for City Council in 2007, my mother's first response to my mom actually lived with me at that time. My mother's first response wasn't, Oh, son, I'm so happy you're running. I can't wait to support you.'",
        "'speaker_1': 'Her first response was, Why are you running against the orange haired lady that could say something about my relation to my mom? But it doesn't. It says a lot about kind of Madison and the love that people have for her.'",
        "'speaker_1': 'My mom didn't know her. She just knew that she was that wonderful lady with orange hair that took care of the neighborhood, including the Whittier neighborhood. It is fitting that. They call it Madison Recreation Center is on Colfax.'",
        "'speaker_1': 'Colfax. It's tough and so is she. It shines brightly and so does her memory. And thank God no amount of redevelopment can subdue its quirkiness. Need I say more? Carla was as quirky and as wonderful a city council member and a friend that you can ever have.'",
        "'speaker_1': 'Who else could we name this recreation center after? I thank you. Each member of the City Council for voting unanimously tonight, and I'm assuming that you will vote unanimously tonight to rename the recreation center after our councilwoman, Carla madison.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_3': 'Thank you. Jackie. Jackie Shumway.'",
        "'speaker_9': 'Okay. I'm going to oftentimes I'll start off what I'm doing, singing you a little bit. And I was coming up tonight thinking about what do I do for Carla? Because Carla was the one who actually got me and convinced me that running for school board was possible and I could still be odd and crazy and everything else'",
        "'speaker_9': 'because that's what she did. And at the same time, she was very bright and she knew what she was very serious about, making the city better. And so I can remember the two of us in a laughing about when she endorsed me for the first time.'",
        "'speaker_9': 'And she says to me, you know, I said, What song should we sing together? And she, you know, of course, Carla wasn't a big singer, but she would tell me, she says, Oh, Jackie started laughing. The one that came to mind was, All I wanna do is have some fun.'",
        "'speaker_9': 'I got a feeling I'm not the only one, which is kind of how I felt about her. And but I think it was experiential about Carla was that she this center could not be named for anybody but her because it really is an indication of what our our city is becoming.'",
        "'speaker_9': 'She was a huge part of changing the city into a place of vibrancy when we were kind of stuck in a place. Remember, we had the shoot, we had the convention coming here and we were all so excited.'",
        "'speaker_9': 'And at the same time, many of us knew that she had gone through cancer and we knew that there was a possibility we'd lose her. And I remember riding through the park one day, City Park, which I jokingly call Carla's run into where she was on her bike.'",
        "'speaker_9': 'I was on my we didn't actually run into each other. We did miss each other. But having this conversation occurred at seven in the morning about what we could do to get better input from people from her district.'",
        "'speaker_9': 'I wasn't even in her district. We were friends and I had helped her campaign because I thought she was so important. And as somebody said, you know, you're all adjacent to each other's districts. And it was important because she always looked at as the bigger city.'",
        "'speaker_9': 'When Jeannie Robb came to me one evening at a meeting that we hadn't seen each other in ages, and she came up to analysis there. I'm sorry, Councilman. Councilman Brooks is there, too. And they said to me something about naming the center after Carla madison.'",
        "'speaker_9': 'And I was like, Wow, how cool is that? I said, I think it's a great idea. And then I come back and I talked to Paul the next day and he says to me, If are they behind? I said, Yeah.'",
        "'speaker_9': 'I said, I didn't say anything. They came up to me, but that's how people felt about her. I was kind of just like everybody went, Oh yeah, like who would not do this? So I will tell you that some of the curmudgeons that we engage on, some of the neighborhood stuff were saying something today and I took'",
        "'speaker_9': 'them on today. And what I started, I just posted the thing about the Marx Brothers and Groucho Marx, 1932, horse feathers about, you know, no matter who commenced it, I'm against it. And so I sent it to them.'",
        "'speaker_9': 'And it was funny because I actually even got them to come around and talk about what they loved about her, what they thought was great, because it's hard not to notice that if we could all live our lives more like Carl Madison, I think our world will be a little better.'",
        "'speaker_9': 'And I will say that this outfit seriously bought this, and I turned to Paul tonight and said, Paul, I literally bought it. Not subconsciously, not even realizing it would be just like something she'd wear. So I had to wear it tonight and honor this.'",
        "'speaker_9': 'And this is what we would do is ride along with bicycles and do fun stuff. Wonderful lady. Please, please, please vote to name it after. Thanks.'",
        "'speaker_3': 'Jackie. Just needs you to introduce yourself for the record.'",
        "'speaker_9': 'Oh, I'm sorry. I'm Jackie Shumway. As you do. It's just terrible. I never want people to know who I am. Jackie Shumway.'",
        "'speaker_3': 'Thank you. Glass. Glass Speaker Paul Weiss.'",
        "'speaker_6': 'Council. President. Members of council. It's very hard for me to continue saying anything after what you've heard tonight. If you had a chance to look. Through our letters of support. Through our petitions and our signatures. Even after that, we were two days late and we still got this many more signatures in this many more letters of support'",
        "'speaker_6': '. The most difficult thing for me was learning where to start and where to end, because Carla had support from every corner of our district. When she barely got into the runoff, when she first ran with 28%, she organized and engineered an amazing comeback.'",
        "'speaker_6': 'When she passed, when she ran for reelection, she ran unopposed. And when she passed away, 37 people ran for her seat. That can only demonstrate the severe love and respect she had within her district among her peers. The article I read the article today was in the Denver Post.'",
        "'speaker_6': 'It was called The Vibrant Carla Madison. Every single one of her peers spoke of her in that article. And I'll tell you, it brought me to tears all afternoon. I wish I hadn't have read it, but everything everybody said tonight up to and including the orange juice.'",
        "'speaker_6': 'So I just don't know how to go on. I don't know what else to tell you. If you haven't understood that this is an appropriate name and they will leave a positive and lasting legacy by now. Then I don't know what else to say other than we are not here just for your vote.'",
        "'speaker_6': 'We are here for your an enthusiastic and unanimous vote. Thank you very much for considering naming the recreation center after Carla madison. Right.'",
        "'speaker_3': 'This. This concludes our speakers. Any questions? Do we have any questions from members of council? Questions. Nothing is coming up, so public hearing is now closed. Time for comments, Councilman Brooks.'",
        "'speaker_8': 'Thank you, Mr. President. This is this is beautiful. I think this is a beautiful display of. Of my community. For an incredible, incredible woman. So. Yeah. I'm going to share just a little bit. I have an interesting relationship with Carla because I was in the community, a community leader, and would work with Carla on a myriad of'",
        "'speaker_8': 'issues. And I was I put up this email today. I actually was emailing her about the most expensive dog park, which the this rec center is going to be built on. And just I could not believe we are spending an ungodly amount of bond money for this dog park.'",
        "'speaker_8': 'And and I was surprised how strong I was in the email, but she was so gentle and, and responding back to me and, and in such a gentle and loving way. And I think someone said it. I think it was Daryl.'",
        "'speaker_8': 'You know, you you may not have agreed she may have frustrated you on an issue because you're in leadership. You're going to frustrate Pete's people. But you never stayed upset at that woman because she embodied vibrance, she embodied life, and she was so inspiring.'",
        "'speaker_8': 'And so, you know, there's so much that she has done in this district. But I got the opportunity to sit in her office after she had passed away, after I was elected, and actually looked through notes that were not complete, look through projects that were not finished.'",
        "'speaker_8': 'And we as an office took it upon ourselves to finish some of those projects. And and it was it was an incredible opportunity. And by the way, Paul was there every step of the way saying, you know, she kind of would have liked it like this.'",
        "'speaker_8': 'And, you know, this is this is what she was thinking when she was putting this together, but some some great things that she was a part of. I think you heard a lot of great things, but I thought this was some other projects.'",
        "'speaker_8': 'Seek Livia down 23 and to park you council on her. How in the heck did we lose? That was one of the coolest events. And I remember Charlie Brown saying, Are you crazy? You want to shut down a street with cars and just have bikes?'",
        "'speaker_8': 'One of the best events that we've had in District eight, incredible. The ice cream social. Not a weirder event in the city and county of Denver. And the first time I went there, they made me a councilman. They made me dress up in this 1920, you know.'",
        "'speaker_8': 'Bow tie and everything. What a top hat. I was like, I cannot believe I'm doing this, but something happens. There's a little bit of magic that happens when you say, Hey, we're going to have people out here, you know, on big wheel bikes and actin silly and crazy and you connect with the community in a way.'",
        "'speaker_8': 'It's I wouldn't have thought of that first, but it worked. Obviously, her incredible strong leadership and blueprint Denver in 2010 basically led that process with with Jeanie Robb. Here's the one that's the hardest to do and replicate. She never missed the neighborhood meeting ever.'",
        "'speaker_8': 'And all the neighbors are mad at me because I don't go to every neighborhood meeting. And so we're still trying to get that one car. I don't know how you did it. She was incredible. But I actually do know how she did it.'",
        "'speaker_8': 'She had a wonderful help me in poor and poor, basically, because she was leading in the in the city. Paul was taking care of everything behind the scenes. And, you know, I'm excited to, you know, support this and and name this rec center, the Carla or the Madison.'",
        "'speaker_8': 'I don't know what you know, what it's going to come up with. We got to talk about it. But Paul, I feel like you're as much a part of this as she is. So there's a lot more we can say.'",
        "'speaker_8': 'This is going to be exciting that, you know, sometimes we rename buildings and the buildings are already built. And so you got to kind of put up a makeshift, you know, name and plate and it doesn't really look good, but we are this is this building is under construction as we speak.'",
        "'speaker_8': 'And so I hope that we can talk about happy hands, what the design looks like of the car because it can't just be a regular Carl Madison Rex. It has to be something funky on Colfax, the car or something like that.'",
        "'speaker_8': 'These are some orange shoes that I will never be able to feel, but I can only aspire to. And so I'm so excited to support the renaming of this rec center to the Carl of Madison Rec Center. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Brooks. Councilman Lopez.'",
        "'speaker_6': 'Well.'",
        "'speaker_1': 'Thank you, Mr. President. And thank you, Councilman Brooks, for your leadership and in helping organize and moving this forward. Carter Madison was my that's my colleague. I was elected in 2007. With Carla. And we both looked at each other very nervously.'",
        "'speaker_1': 'I was hurt myself, Councilman Neville, at the time. The three of us joined the council and there are council members who had been on council for for a while and had a whole bunch of experience. And here we were, a bunch of newbies, right?'",
        "'speaker_1': 'A young guy. And as freaky arts teacher. And that's what the are. I remember they did a profile on her and they said she reminds me, they, she reminds us less of a city council, more of our free yards.'",
        "'speaker_1': 'Teacher. Right. And and she was. She was absolutely unique. I've never met another human being like Carla. Working with her was a treasure. I'd have some kind of groundbreaking of some art piece by Gary Sweeney in Villa Park, and it was the first one.'",
        "'speaker_1': 'And in the West Side, you hear a lot of different engines and motors, and you kind of figure out, you know, which ones which. But you rarely hear that annoying little buzz of a scooter. And I did. And I remember turning around and I see this lady with this electric orange hair rolling up on her scooter and'",
        "'speaker_1': 'coming to a groundbreaking in my district just to be there, to be supportive. We had lunch together. We coalesced together. I remember the day that. We had the Infrastructure Priorities Task Force Committee. And those of you who have been part of this process for a long time know that there was no plan for rec center.'",
        "'speaker_1': 'In Central Denver at all. It wasn't on. It wasn't part of the task force. It had failed to make it through. So we were at this committee meeting. We weren't elected yet. We were already elected, but we hadn't taken the oath yet.'",
        "'speaker_1': 'This is in June and we get up, we make our case and talk about a rec center in Westwood and which hopefully we can see. One day Carla gets up and she says, We need a rec center in central Denver.'",
        "'speaker_1': 'And she did it with such eloquence. And lo and behold, there it was on the bond. I was so happy for her. She and I spent a lot of time together. We were in New Orleans at the National League of Cities, and that's where I really understood who Carter Madison was.'",
        "'speaker_1': 'Now, Carla would say, Oh, I woke up on that balcony one time. And that's my favorite gumbo shop. Oh. And then we walking up and down Bourbon Street, and she had a paper cup with bourbon in it, and it was very nice.'",
        "'speaker_1': 'It's okay. It's okay. It's okay. You can drink it. Walk down the street here. And she was talking about the design in New Orleans, and she took me to her favorite gumbo shop, and she had my palm read and all kinds of crazy, weird stuff that I had never think I'd ever do.'",
        "'speaker_1': 'But I did it with Carla Metz, and those are the memories I had. And the way she led her district was amazing. And she was the first one in a long time, the first white woman. To be elected in Council District eight in a while.'",
        "'speaker_1': 'That's right. And although there was a lot of buzz and a lot of criticism, I never heard that one bit from her district. They loved her. Everybody loved her. It was Carla madison. And she was orange, right. She was an amazing city councilwoman to work with.'",
        "'speaker_1': 'And one day I remember. Finding out that I had been diagnosed with a stage two cancer. And I was scared out of my mind. I have a daughter. I'm from as young as, I think 31 years old. And I was so scared.'",
        "'speaker_1': 'She came up to me. And I didn't realize that she had had cancer in the past. And she says, I want to. I want you to. Does this remember something she told me in the parking lot? And she pulled me aside and she says, Paul.'",
        "'speaker_1': 'You can't fear the lesson. Out of fear of the teacher. You can't pass that lesson out of fear. The teacher. And cancer has been a great teacher in my life. And there she was, a hotter balloonist. She got up and taught us how to do massage therapy right here on the council floor.'",
        "'speaker_1': 'She'd ride around in her crazy scooter, and she was just so full of life this woman had. She was the. She had done everything in her lifetime. And she says it's through that that I learned to live. And those are the best words I've ever heard in my life.'",
        "'speaker_1': 'Right. And I think of her sitting at this desk. And I see her and I feel her in these chambers. And there's no I agree with you. There's no other way to name this rec center than for my colleague.'",
        "'speaker_1': 'Harlem, Madison. So this is a joyous day. And I just I just I'm thrilled. I'm happy because I know she's alive and. The design of the rec center. Somebody please make it orange. So thank you. Thank you for the opportunity to serve.'",
        "'speaker_3': 'Councilman Espinosa.'",
        "'speaker_8': 'Yeah, it's going to be less personal and more more matter of fact. But I do want to throw out distillery and palm reader reading as possible options for that retail space on. Okay. So I would like to thank everyone who worked on this project.'",
        "'speaker_8': 'The naming process can be very complex and time consuming, but in the end, very, very rewarding. Carla Madison's legacy will live on allowing people from all walks of life to learn how she helped make Denver an amazing place.'",
        "'speaker_8': 'The Carla Madison Rec Center will welcome will be a welcome demand for the Colfax corridor. I had an opportunity to work across the street from the site, directly across the street for several years. And I know firsthand how impactful this recreation center will be for the surrounding community and Denver as a whole.'",
        "'speaker_8': 'Both are important, as you have demonstrated to Carla. I would also like to thank Councilwoman Jeannie Robb for her contribution in moving this project forward. I feel honored to be part of the naming process offered and I'm by offering my full support this evening.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman Espinosa. Councilman Nu.'",
        "'speaker_7': 'I first met Karl at the ANC and you can always tell a special person because when Carl came into the room, I can remember the zoning meetings we'd have over Mike Henry's condo building and. And her presence was just something special.'",
        "'speaker_7': 'It's like you knew when she walked in the room that there was something unique about Carla. And as we talked about it and found out she was going to run for city council, everybody was so pleased. Here's somebody that's going to really represent our citizens in our neighborhoods.'",
        "'speaker_7': 'We really love that about her. And so it was so wonderful. And we all said, not only is she going to represent our neighborhoods, but we need some of that orange hair on city council. There's no question about it.'",
        "'speaker_7': 'She was wonderful and a wonderful personally, but very sincere, always sincere. So, Paul, you had a, you know, a lucky woman to be with and she also had a lucky man to have supporting her as well. So I just look forward to voting for this designation.'",
        "'speaker_7': 'And it would be a wonderful tribute to Carla.'",
        "'speaker_3': 'Councilman. Councilman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. I also want to express my support for the naming of this rec center after Carlo Madsen. I did not serve with her, but I did have an opportunity to work with her when I worked over at the Denver Department of Human Services as the first director of our homeless commission.'",
        "'speaker_10': 'And one of my job responsibilities was to move around our temporary shelter, which, you know, we're still doing in this city, as we've seen more and more homeless people on the streets. But I had an occasion to meet with her at her office.'",
        "'speaker_10': 'She was always very welcoming, had it decorated with just incredible art throughout her office. It was almost like walking into a gallery and I remember going on a bike ride with her and Councilwoman Judy Monteiro, and I think she was the original cruiser that started out, the cruisers that are now, what, 300 plus on Wednesday nights during'",
        "'speaker_10': 'warm weather. I think, Carlos, when they got everybody going on that I think this is very, very appropriate to be naming this building after her because of her incredible advocacy and love not only for the neighborhoods that she served, but this entire city.'",
        "'speaker_10': 'She exaggerated that in in the way that she interacted with people. And I'm just pleased to be able to vote yes for this naming tonight, because I think it will give people in the community pride to walk in that building and know that it was a local community leader that helped make that happen for this community that'",
        "'speaker_10': 'has needed a recreation center in this area of town for for a long, long time. So I'll be a yes vote tonight. Thank you. Thank you.'",
        "'speaker_3': 'You, Councilwoman. I take it, Councilwoman Gilmore.'",
        "'speaker_9': 'Thank you, Mr. President. You know. I didn't know her personally, but I have to say that her legacy lives on very bright. And I think the positioning of the rec center in the close proximity to East High School, you know, a lot of people throughout life want to conform and be normal.'",
        "'speaker_9': 'And for someone who sees that normal is boring to her and that she really embraced, I think, what life is really supposed to be about. And I was honored, you know, to to definitely have Paul's support during my campaign, but then also her family being here tonight.'",
        "'speaker_9': 'And I really want to recognize you for being here as well and being able to listen to all of this. And, you know, just knowing that that close proximity for East High School students and for students along, you know, in the area to know really who Karla madison was and that art and not conforming is okay in'",
        "'speaker_9': 'life and especially for young women to know that it's okay to be who you want to be and that in a lot of ways you don't need to be normal. You just need to be who you truly are in life.'",
        "'speaker_9': 'And so I couldn't be more happy to support this tonight.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilwoman Gilmore. Any other comments from members of council? I will I will share one. I was I only had a handful of interactions with with Carla, which is certainly unfortunate. But I remember the ones that I have been so powerful and I I'll start off by thinking it's probably safe to assume that Carla and I'",
        "'speaker_3': 'are a contrast. You know, they said that Carla Carla was funky, and that's probably something I only heard after a two week field exercise out in the military. You know, they say that she was a free spirit and at times people can define me as rigid.'",
        "'speaker_3': 'She had orange hair. I have none. But it's interesting. I remember when I first set up a meeting with her was when I was actually campaigning. And with all these differences we had. Carla had the unique ability of just making you feel comfortable no matter who you were.'",
        "'speaker_3': 'And I remember as a half an hour meeting and we talked for almost 2 hours, and some things I remember that I won't share was just my conversation with her about being an underdog and why I wanted to run.'",
        "'speaker_3': 'And one thing that I absolutely believe we had in common is the heart of service. And I think that's something that resonated between the two of us about why we were running, the things we felt we wanted to do.'",
        "'speaker_3': 'And I, I just always remember that conversation that we had, and she was such a inspiration for me after that conversation to continue to run with the circumstances I was going against. But I also remember, too, in that conversation where she said to me, Do you have pets?'",
        "'speaker_3': 'And I do. And I talked about my my stray lucky who my stray dog. Lucky who I got from the Fort Sill Pound. And then we just talked about dog for the next 30 minutes and just our love for animals and just all the things that we in our this disdain for particular legislation that regards the dogs'",
        "'speaker_3': '. And we said if we get together, we're going to we're going to fight to work that. And it was just a great conversation. And it's just somebody that when I walked out, I just felt just felt so good about.'",
        "'speaker_3': 'And when I learned of how she was ill and how she has her circumstances, it was just really unfortunate. But, you know, no one can doubt that Carla lived. And that is something that always resonate to me and never do take any day for granted.'",
        "'speaker_3': 'So I am truly touched by her and the interactions that we had, even though they are so few. And I'm really honored to vote yes on 84 as well. So so you know the comments, Madam Secretary, roll call.'",
        "'speaker_4': 'Brooks.'",
        "'speaker_8': 'I for Carla.'",
        "'speaker_4': 'Clark.'",
        "'speaker_1': 'Hi.'",
        "'speaker_4': 'Espinosa. Hi, Flynn. I Gilmore I Cashman.'",
        "'speaker_6': 'Absolutely.'",
        "'speaker_4': 'I can eat.'",
        "'speaker_1': 'Lopez named Carla.'",
        "'speaker_7': 'I knew Carla.'",
        "'speaker_4': 'Ortega.'",
        "'speaker_10': 'Hi. Absolutely.'",
        "'speaker_4': 'Black. Hi, Mr. President.'",
        "'speaker_3': 'I Madam Secretary, please close. It only announced the results.'",
        "'speaker_4': '11 eyes.'",
        "'speaker_3': '11 I accountable. 84 passes unanimously. One free adjournment announcement on Tuesday, January 19. There is a required public hearing on Council Bill 937, changing the zoning classification for 725 West 39th Avenue. Any protest against Council Bill 937 must be filed with the Council offices no later than Monday, January 11th.'",
        "'speaker_3': 'City Council wishes you and you are very happy holidays. See no other business before this body? This meeting is adjourned.'",
        "'speaker_5': 'Denver eight TV's Your City, Your Source.'",
        "'speaker_0': 'Denver eight. On TV and online. To stay connected to your community, your city, your source.'"
    ]
}