{
    "Annual City Property Tax Mill Levy for 2019.": [
        "'speaker_0': 'Or take. That's an introduction. Yes. All right. All right. Anything else? All right. Madam Secretary, if you please put the first item on our screen, you and Councilman Flynn, you want to go ahead with your questions on 13, 25, 26 and 27?'",
        "'speaker_3': 'Yes, Mr. President, thank you. I know that we do this every year, and and often there might be a committee hearing on it. This went through on consent. So I wanted to take the opportunity here while we have our one vote on setting the mill levy that's applicable this year for taxes collected next year, that the people'",
        "'speaker_3': 'watching, the people in the chamber here and the people watching on Channel eight understand just what's happening with the mill levy because there was a reassessment and so new values go into effect. And so, Stephanie, you are here to take a couple of questions.'",
        "'speaker_3': 'What I did notice is that the city's mill levy, combined mill levy, when you count all of the categories, is declining by nearly four mills. Can you explain first what happens to those mills? They don't just go away.'",
        "'speaker_3': 'They are parked in a you know, I guess we say bicycle right now and they can be reactivated if they fall within the other parameters of of two way from 2012. But have we determined have you talked maybe with the assessor to determine what would be the impact on an average property, an average residential property whose value'",
        "'speaker_3': 'might have gone up anywhere from 20 to 60% in the reassessment?'",
        "'speaker_2': 'So I'll answer your last question first. Okay. Thank you. Of course. And so I am looking at the totality of the of all the mills. So for those of you who are not aware, the city's portion is about 37% of the mills.'",
        "'speaker_2': 'Which Councilman, I'll talk a little bit about the accredited mills that we actually invoke. So the. Total mills for 2020 2019 with cuts in 2020 72.116. What that means for a household, let's say a residential husband of $400,000, is the number that we used.'",
        "'speaker_2': 'It actually increases 23.2%. So that would mean that last year's property tax on a $400,000 home would be $2,228, and this year it would be $2,541. That's 14%. And you'll notice there's a difference between the increase in those dollars and the percentage overall valuation.'",
        "'speaker_2': 'That is because that's primarily driven by the fact that the city is required to stay under what we call our to a cap 6% plus local growth. So as a result of that, what happens is we back into those.'",
        "'speaker_2': 'We reduce the mills to make sure that our growth only stays under that 6% plus local growth, which local growth for this particular assessment period was 2.1%. And so we credit those mills and we accumulate those credits. We do have the ability to activate those on non assessment years.'",
        "'speaker_2': 'Again, we have to stay under that 6% plus local growth cap. The amount that will be credited specifically for two way was about 1.9 mills. I'm going to preemptively answer a question you didn't ask, which is in totality, what's our total accredited mills?'",
        "'speaker_3': 'That was my next question.'",
        "'speaker_2': 'And totally, we have an 8.692 mills credited in our bank, so to speak. We cannot activate all of those. Remember, it's ten about 6% cap that the value of those mills in 2020 valuation is $180 million, right.'",
        "'speaker_3': 'I don't think in 2012 when we passed to a that we ever anticipated we'd have that many inactive mills that much in the inactive mill category.'",
        "'speaker_2': 'That's correct. We've actually exceeded, I think that the amount those mills over what we had originally brought it down right as part of the two way we've actually exceeded that total.'",
        "'speaker_3': 'And is this a function of the the rather significant rise in property values that's driving the mills down?'",
        "'speaker_9': 'Yes, that's exactly right.'",
        "'speaker_3': 'Because even though the mill levy is going down for the city taxes, your property tax will still go up about 14. Did you say 14.'",
        "'speaker_2': '14% for all? Yes. And that's because.'",
        "'speaker_3': '400,000. Right.'",
        "'speaker_2': 'Every mill is worth more.'",
        "'speaker_3': 'Right. Okay. And the DPS, the Denver Public Schools Mill Levy, which is the next I think it's 1326, is not something that we have the ability to when we we can't go in and change that. Is that correct?'",
        "'speaker_7': 'That's correct.'",
        "'speaker_3': 'Can we accept what DPS gives us is their calculation and we pass it or not?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_3': 'Okay. And then for the special districts mill mills, that's the same sort of function. Correct. Okay. So the only one of these three resolution setting mill levies that we can impact is is the city and county of Denver.'",
        "'speaker_2': 'That is true. We you have passed a proposed budget content, assuming that come in.'",
        "'speaker_3': 'Correct. All right. That's all I have is for I just want to make sure that the public had a chance to. So when they open their bills, their tax bill, next February, I think they'll they'll understand a little better.'",
        "'speaker_3': 'Thank you. Thank you.'"
    ],
    "Resolution to Settle Liability Claim in Case No. 2019CV30863.": [
        "'speaker_0': 'Thank you, Councilman Flynn. All right, Madam Secretary, please put the next items on our screen. Councilman Flynn, you've called out. 1384, 1385 and 1386. What would you like us to do with these items?'",
        "'speaker_3': 'All right. Wouldn't you like to know what I'd like to do with them? Actually, what I need to do is vote on them to abstain because I was out of the country last week and I missed the briefings on these settlements of claims against the city.'",
        "'speaker_3': 'So I feel I need to to abstain, having not had the benefit of the briefing myself. That's all.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Torres, will you please put these resolutions on the floor?'",
        "'speaker_2': 'I move the council resolutions 19, dash 1380 419, dash 1385 and 19 1386 be adopted in a block.'",
        "'speaker_0': 'Thank you. It has been moved and seconded comments by members of council. Councilman Flynn, did you have anything to add to that or.'",
        "'speaker_3': 'You don't know?'",
        "'speaker_0': 'Mr. President, seeing no other speakers in the queue. Madam Secretary, roll call.'",
        "'speaker_3': 'FLYNN Hashtag.'",
        "'speaker_2': 'Black eye. CdeBaca Abstain. Gilmore I.'",
        "'speaker_6': 'Herndon High.'",
        "'speaker_4': 'Hines High.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_9': 'Kenny Ortega Abstain for the same reasons.'",
        "'speaker_7': 'Sawyer Abstain for the same reason.'",
        "'speaker_2': 'Torres, I. Mr. President.'",
        "'speaker_0': 'I am secretary. Please. Because the voting and announced results.'",
        "'speaker_2': 'Four abstentions. Eight eyes.'",
        "'speaker_0': 'Four abstentions. Eight ays resolutions 1384, 1385 and 1386 have been adopted. Councilman Flynn. Are you sure that you calling those out to abstain was not just also in honor of our Councilman Espinosa in attendance this evening? All right, Madam Secretary, if you would, please put the next item on our screens.'",
        "'speaker_0': 'And I. Did you want to do at what point did you want to take 1341? Because that was that Councilwoman Ortega called out.'",
        "'speaker_2': 'Do you want to have that last past?'",
        "'speaker_0': 'Okay. So next up, you want to go ahead with 1291. And Councilman Hines, I believe you called 1291 out for questions.'"
    ],
    "Agreement with Denver Civic Ventures for Urban Forest Initiative Grant Program.": [
        "'speaker_4': 'Eight. Yes. Thank you, Mr. President. And I actually apologize. I wasn't here during public comment, actually got the answers to some of my questions. I do want to make a quick comment, though. Constituents of Denver's have said trees are the top issue facing in the survey responses for the central area plan.'",
        "'speaker_4': 'And we were excited. We still are. We we were then and we still are excited about the planting of additional trees because downtown central business district has 4%, urban canopy uptown has 14% urban carry canopy, which a lot of uptown is part of this plan.'",
        "'speaker_4': 'And and so we have heard from public works that they're going to make even more clear in their documents that any 5G provider, as they as they install fiber in the city, that they have to put it at least three feet deep.'",
        "'speaker_4': 'And as we understand it, and forestry and parts are here if if necessary. But as we understand it, three foot depth is a minimum depth to make sure that we can have urban canopy with a proper root system.'",
        "'speaker_4': 'So I want to thank public works for for making sure that that is clear in our documents as we as we continue to evolve our standards for for 5G installation. So. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Hines. Councilman CdeBaca.'",
        "'speaker_10': 'Thank you, Mr. President.'",
        "'speaker_7': 'I wanted.'",
        "'speaker_2': 'To I'm glad you called this out, because I wanted to call it out.'",
        "'speaker_10': 'Because I think it deserves a separate vote and a separate, separate conversation. It's very important that we're addressing our tree canopy in this city, specifically in the areas that we know have been identified as the most deficient areas.'",
        "'speaker_10': 'I'm concerned about how this came about without a public process or without open access for other neighborhoods to be able to access this $3 million. And so with the Downtown Denver Partnership being able to drive a process without it being open to others, especially when we know there's great inequity in this city, I think it's an inappropriate'",
        "'speaker_10': 'way for us to allocate those taxpayer dollars and not having a community process, not having an open up. Open process is going to lead me to not support this tonight.'",
        "'speaker_0': 'Thank you. Councilman Hines had just called this up for questions, but you would like to call it up for a separate vote. All right. So, Madam Secretary, we'll need a motion to put it on the floor. Yes. All right.'",
        "'speaker_0': 'Councilman Rogers, will you put 1291 on the floor to be adopted.'",
        "'speaker_2': 'And move the council resolution 1291 be placed on the floor for a vote?'",
        "'speaker_0': 'All right. For adoption has been moved and seconded. Any other comments on this item before we vote? See none. I will just add that I said this in committee so I won't go too much into it. But when we put to a in front of the voters to increase funding for our parks, one of the key tenants'",
        "'speaker_0': 'of that was that that funding would be spent on our urban canopy and on trees through our forestry department. And one of the other things that we talked about in our conversation with voters when it came to $2 was that they were approving a tax increase and it was about $40 million.'",
        "'speaker_0': 'I think it ended up being more like 35 this year because of how sales tax goes up and down by $35 million a year. But that we were going to work hard to leverage those dollars to get matching dollars to make that go even further so that we could make an even bigger investment in our greenspaces and'",
        "'speaker_0': 'all the value that trees and parks and open space bring to our city. And so I was very excited to see this move forward because it is an area where for every dollar we spend, it's being matched with $2.'",
        "'speaker_0': 'And so we're taking that investment and we're growing it and leveraging it as we're building this urban canopy and trees in our urban core. So I was excited to see this coming forward and I will be happy to support it today.'",
        "'speaker_0': 'Councilwoman CdeBaca, did you have something else that I.'",
        "'speaker_7': 'Just want to also.'",
        "'speaker_10': 'Point out that this is in a bid where I think that the expectation is that these entities will figure out how to leverage dollars among themselves and use the taxes that they're levying upon themselves to do this kind of work.'",
        "'speaker_10': 'So just wanted to also point that out.'",
        "'speaker_0': 'Thank you. Thank you, Councilwoman. All right, Madam Secretary, roll call.'",
        "'speaker_2': 'CdeBaca no black eye.'",
        "'speaker_0': 'When I.'",
        "'speaker_2': 'Gillmor, I.'",
        "'speaker_6': 'Herndon, I. Hines, I.'",
        "'speaker_2': 'Cashman Kenny Ortega, I swear I. Torres, I. Mr. President.'",
        "'speaker_0': 'I. I'm secretary. Please. Because Voting Notes Results.'",
        "'speaker_2': 'One ni 11 ais.'"
    ],
    "Adoption of 2019 Denver Building and Fire Code and Denver Green Code.": [
        "'speaker_0': 'One nay 11 AIS Resolution 1291 has been adopted. All right, Madam Secretary, if you please put the next item on our screens. And Councilman Hines, you had to comment on this one on 1330.'",
        "'speaker_4': 'Yes, Mr. President, go ahead. Thank you, Mr. President. And this is a comment in the in the. But the purpose is full transparency. So just for what it's worth, next week, unless I hear good reason. Otherwise, I will propose an amendment to 19 Dash 1330.'",
        "'speaker_4': 'Specifically, I intend to propose a narrow amendment requiring a one hour response time for elevator companies when someone has become trapped in an elevator due to a power or mechanical failure. This is a result of multiple complaints by constituents in districts nine and ten.'",
        "'speaker_4': 'And I did touch base with Councilman CdeBaca in advance to verify that this is the case. And these two districts of the two districts with the most elevators in the city. As we continue to grow, as the city will continue to need additional elevators that function correctly.'",
        "'speaker_4': 'And in case you already know, in case excuse me in case you don't already know, Denver fire reports needing to rescue eight people each day in Denver from trapped elevators. Denver Fire also reports that a common report is that the phones in those elevators that are stuck also do not work.'",
        "'speaker_4': 'Denver excuse me? Denver Airport reports that their minutes contract has a ten minute response time. And and certainly they pay for that response time. But the point is that elevator companies can respond. And, of course, you know, there's a there's a financial component there.'",
        "'speaker_4': 'But but there's a financial component in any maintenance contract, particularly, or as an example, the maintenance contract that that my HRA has with our elevator company is there's a financial component. So Denver Fire reports that this response time is in line with other industries.'",
        "'speaker_4': 'So this is not out of out of purpose. And and just part of the reason why I'm making this public today is because we reached out multiple times to the elevator companies. And after this went through Ludy, we reached out and the response was, quote, Due to vacation and travel schedule, I will not be available until January'",
        "'speaker_4': 'ten. Quote, It is impossible for us to have a dialog with an industry that that cannot be available until after this is passed. So so I'm putting it out here that I'm soliciting input from anyone who thinks that this this amendment is not prudent.'",
        "'speaker_4': 'The last thing I'd say is that I just I won't go back over this because I already mentioned it in Ludie and committee, but I shared several concerns about. Elevators. Elevator maintenance and the relationship between proper elevator maintenance and having to rescue people from broken elevators.'",
        "'speaker_4': 'So if you have any concerns or comments or input about elevators or elevator maintenance or any reason why we should not have a one hour response time in line with every other industry, please reach out to the District ten office.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Since you called this out, I'm just going to quickly say outside of elevators, there is a lot to be excited about in this code, especially when it comes to the environment and how our buildings are built and what kind of energy they use and what kind of emissions they release.'",
        "'speaker_0': 'And in addition to that, for the first time ever in Denver, we will have the Denver Green Code, which gets us even closer to where we need to be to be addressing climate change and meeting the science based standards that have been set forward that we need to be meeting as a city lot to be excited about'"
    ],
    "Purchase of Property for Community Corrections Facility.": [
        "'speaker_0': 'in here, even if we have a few kinks to work out before we get it fully approved. But looking forward to that. All right. Next up, Madam Secretary, I believe we're now on to 1341. And Councilman Ortega, I am correct in remembering that you are the one called out for a vote.'",
        "'speaker_0': 'That is correct. All right, Councilwoman Torres, will you please put 1341 on the floor to be ordered published.'",
        "'speaker_2': 'And move that Resolution 1341 be adopted?'",
        "'speaker_0': 'I think it's a bill, not a resolution. Madam Secretary, in that ordered, published, not adopted. Correct. Thank you. All right. So okay. 1341, Bill, 1341 to be ordered published. All right. We have the motion and the second comments from members of the council, Councilman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. I just want to explain my no vote on this. This is for acquisition of a property that has historically been used as a community correction facility in the city of Denver. As you know, we had a vote that changed the contracts, and I was in agreement with the policy issue of divesting from the'",
        "'speaker_9': 'two companies that run ICE facilities around the country. However, this is putting more money back into the same pockets of those companies, one of those companies that we are divesting from. I know we are working aggressively to try to solve long term solutions for through zoning and through the work of a work group trying to figure out'",
        "'speaker_9': 'what are those solutions. And I know this is part of one of those steps, but I'm not in agreement that we should be. There was no RFP process on this, and just because this one property became available, then we just automatically moved to acquire it.'",
        "'speaker_9': 'And so I'm not in agreement with the procedural steps that we've gone through. So I'm going to be voting no on this tonight.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Ortega. Seeing no other comments. Madam Secretary, call.'",
        "'speaker_2': 'Sorry. I'm waiting for my system here.'",
        "'speaker_0': 'Technology. But Channel eight has some pretty groovy music on right now though. Sorry for everybody was here.'",
        "'speaker_2': 'I'm so sorry. It froze. Okay. Sorry. Ortega. No black eye seat. Abarca. Hi, Flynn. Hi, Gilmore. I. Herndon. I Hinds. Cashman. I can eat.'",
        "'speaker_7': 'Sawyer, i.'",
        "'speaker_2': 'Torres, i. Mr. President, I.'",
        "'speaker_0': 'I'm secretary. Please. Because voting announce the results.'",
        "'speaker_2': 'One May, 11 eyes.'",
        "'speaker_0': 'One day, 11 days. 1341 has been ordered published. All right. That concludes the item is called out this evening. All bills for introduction are ordered published except for 1176 and 1289, as council will hold a hearing and vote on each bill separately after recess.'"
    ],
    "Zoning Change for 1369 Quince Street to Allow Accessory Dwelling Unit.": [
        "'speaker_0': 'But. All right. Welcome back. Council is reconvened. We have four public hearings this evening. Speaker should begin their remarks by telling the counsel of their names and cities of residence and if they feel comfortable doing so, their home addresses.'",
        "'speaker_0': 'If you are here to answer questions only when your name is called, please come to the podium. State your name and note that you are available for questions of counsel. Speakers will have 3 minutes. There is no yielding of time on the presentation mind or on the wall.'",
        "'speaker_0': 'You will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech structure your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'All right, Councilwoman Torres, will you please put Council Bill 1158 on the floor.'",
        "'speaker_2': 'And move that council Bill 19 dash 1158 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The public hearing for Council Bill 1158 is open. May we have the staff report?'",
        "'speaker_12': 'Good evening. Teresa Lucero with community planning and Development. This is a rezoning application for 1369. Queen Street is in Council District five in the East Colfax neighborhood. The request is to rezone from urban edge single unit D1 to Urban Edge single unit d1x that would allow that would in effect allow the construction of an accessory dwelling unit'",
        "'speaker_12': '. So the property is about 6500 square feet. It is currently a single family residence. As I said, it's zoning is urban edge, single unit. And the request is to go to urban edge, single unit, one that allows accessory dwelling units.'",
        "'speaker_12': 'So the existing zoning is ESU directs and surrounding zoning on all sides is yes, udc's existing land use is a single family residence, as is the surrounding land use. This is a block off of East Colfax Avenue where there is a mixture of uses commercial, industrial and mixed use.'",
        "'speaker_12': 'And a block east of Quebec Avenue. Quebec Street. Sorry. So existing building form and scale. Mostly all single family homes. 1 to 2 stories, as you can see in the photos here. Information notice on this of a complete application went out in September of 2019.'",
        "'speaker_12': 'Planning board hearing was October of this year and there was a unanimous vote to recommend approval. And then we were at Liberty on November 5th of this year. And this council hearing has been properly noticed for the public hearing tonight.'",
        "'speaker_12': 'So public comment, there is one R.A. letter of support for this application, one email and opposition and one another private individual wrote in a letter of support. So review criteria. The relevant plans are a plan 2040 Blueprint 2019, the East Montclair East Colfax Neighborhood Plan of 1994 and Housing and Inclusive Denver of 2018.'",
        "'speaker_12': 'All of these strategies from current Plan 2000 apply as detailed in your staff report, but basically discuss increasing housing, increasing affordable housing, encouraging private development where infrastructure's already in place and that's in character with the existing neighborhood, as I said detailed in your staff report, The Blueprint Denver This is in the urban edge context, which is predominantly'",
        "'speaker_12': 'residential and tends to act as the transition between urban and suburban areas and is generally single and two unit residential with some low scale multi-unit throughout Blueprint Denver The place type is low residential, which is predominantly single unit and two unit with some accessory dwelling units.'",
        "'speaker_12': 'The street type for Quinn Street is an designated local street and 14th Avenue is a residential collector street. Quebec a block over is a residential arterial growth area. Strategy is all other areas of the city. So this area is projected to absorb 10% of jobs by 2040 and 20% of housing by that time.'",
        "'speaker_12': 'Easement Montclair Plan of 1994 talks about protecting the residential character of the neighborhood sound management and a mix of income levels in rental and single family homes and apartments, encouraging homeowners to add on additions and modernize their single family homes, housing and inclusive.'",
        "'speaker_12': 'Denver speaks to in increasing our regulations and expanding the development of accessory dwelling units and promoting the development of these units as a wealth building tool for low and moderate income homeowners. With that staff believes that the adopted plans are met with this proposal.'",
        "'speaker_12': 'By using a standard zoned district, we're furthering the uniform application of zone districts and by implementing our plans and facilitating an increase in housing density and a mix of uses near transit. We're furthering public health, safety and welfare.'",
        "'speaker_12': 'Justifying circumstances is changed. Conditions. New development in the area has resulted in additional services and retail nearby. These changes have created an additional need for housing in the area and we've got two new adopted plans in Blueprint Denver and Housing and Inclusive Denver.'",
        "'speaker_12': 'All of these are changed conditions that justify this rezoning. As far as consistency with the urban edge neighborhood context, this zone district is for single unit, which the context is single unit and two unit mainly. And the E-1 de zone district is single family with on the appropriate size lot with set back standards and everything consistent with'",
        "'speaker_12': 'the ESU directs and staff believes this is consistent with the intent statement for ESU. D1 X with that staff recommends approval.'",
        "'speaker_0': 'Thank you very much. We have six individuals signed up to speak this evening, so if you signed up to speak on this item, I would ask that you come up to this front bench that's now empty so that you can be ready to step up to the microphone when I call your name.'",
        "'speaker_0': 'First up, chairman and COO.'",
        "'speaker_5': 'Okay. Thank you. My name is Chairman Sekou. Represent the Black Star Action Movement for Self-defense. President of. Denver for. 37 years. We? Support this. For all the above stated reasons and. We've had this conversation before. Where. When new folks look at this and you talk in code like.'",
        "'speaker_5': 'E as you dare to do do do do do do do do understand non. You talking about nothing. Not a thing. And we had this conversation before you used to even on the. Agendas. Explain in writing what that means so people aren't lost with this esoteric language and code that you use that doesn't allow them to make'",
        "'speaker_5': 'a conscious decision or even understand anything you're talking about. No. No. All your intelligent people. And you've got degrees up the gang. Well, there was a man named Malcolm X who said, tell the truth, make it plain. It looked like you had things down here.'",
        "'speaker_5': 'That the people are paying for. They don't get an opportunity. To understand what you are really doing, what you're really saying. So. Not to be redundant. There was a city council person here. Her name was Lehman schoolteacher. And she changed all of this while she was here.'",
        "'speaker_5': 'And as soon as she leave here, y'all come back with this mess. Why? What? What? See. So. Because I've been down here for a decade plus. Kind of slow to understand what you're talking about. But other folks looking at TV, we want to enroll people in the democratic process to participate.'",
        "'speaker_5': 'The least you can do is make the language plain. So people can understand what you are doing. In their name with their tax money. Even if I can't get a pillow. You can do this.'",
        "'speaker_0': 'Thank you. Next up, Leslie Talkhouse.'",
        "'speaker_10': 'Hi. Thank you. My name is.'",
        "'speaker_2': 'Leslie to where gal schema resident at 1754 Olive Street in Denver.'",
        "'speaker_10': 'I'm a neighbor.'",
        "'speaker_2': 'Of Jerry Saltsman, and I'm here to speak on behalf of his.'",
        "'speaker_10': 'Rezoning. Our greatest hope is that we can get accessory dwelling.'",
        "'speaker_2': 'Units as a use by right in the East Area plan. And I will keep my comments.'",
        "'speaker_7': 'Just that brief.'",
        "'speaker_2': 'Thank you. And I hope you vote.'",
        "'speaker_7': 'To support Jerry's rezoning.'",
        "'speaker_0': 'Thank you. Next up, Caroline Clarke.'",
        "'speaker_2': 'Hi. My name is Caroline Clarke, and I fully support Gerri's plan to build an Adu. Since Denver is struggling to provide affordable housing, building an ADA, you would add one additional dwelling and unit to Denver's rapidly declining housing stock.'",
        "'speaker_2': 'Here's an anecdotal example from another city having similar housing struggles. Los Angeles a quote from the mayor. Go ahead and build one in your backyard. About 2500 new Adu homes were created in two years within the city limits, according to Mayor Eric Garcetti.'",
        "'speaker_2': 'Accessory dwelling units are a relatively low cost way for homeowners to play a big part in expanding our city's housing stock and make extra money while they're at it. We want to make it as easy as possible for people to build in their backyards, which is why we're cutting red tape adus create opportunities for flexible, long term'",
        "'speaker_2': 'multi-generational housing arrangements. And Adu is a great place to offer up to a family member, friend, live in housekeeper or pair, open to a few if any to use fulfill the same function forever as their owners needs change most.'",
        "'speaker_2': 'Change their uses accordingly at various times. One's Adu could be an art studio office or spare living space for family or friends. Adu use can simultaneously reduce local development pressure and preserve neighborhood character. Thank you for the opportunity to speak tonight.'",
        "'speaker_0': 'Thank you. Next up, Jerry Saltzman.'",
        "'speaker_6': 'Hi. My name is Jerry Saltzman. I have owned and lived at 1369 Quint Street for 21 years, since all the city's growth plans now permit some homeowners to build a small second unit in their backyard, I would like to do so.'",
        "'speaker_6': 'My main house will remain exactly the same. The only change will be a small, detached second unit in my large backyard. For my mom, who will be turning 83 on Friday, I will also reduce the size of my backyard to make room for three additional off street parking spots.'",
        "'speaker_6': 'I'm glad to report that my R.A., the East Colfax Neighborhood Association, voted unanimously in favor of my rezoning. Both the planning board, as well as the Land Use Transportation and Infrastructure Committee, also voted unanimously in my rezoning. I have also contacted all 29 of my immediate neighbors and they are either very positive or neutral about my rezoning'",
        "'speaker_6': '. I spoke to City Council in July to support my neighbors plan to build an ADU at 1245, Quincy Street City Council also voted unanimously to support that project. 80 views are great for our neighborhood because they allow homeowners to care for older family members like my mom while creating independent housing so they can age in place.'",
        "'speaker_6': 'Adus also provide affordable housing, flexible housing options for families and improve neighborhood security by having more eyes on the street. Our neighborhood already has several adus in it. Both the carriage house, as well as a duplex across the street from my house have been there for over 100 years without any negative effects.'",
        "'speaker_6': 'Since City Council has already passed several policies that specifically identify 80 youths as being the solution to our affordable housing crisis. Let's move forward and enact those policies. Our neighborhood, as well as our city, is struggling to provide affordable housing.'",
        "'speaker_6': 'What more can we as a community do to help solve the affordable housing crisis? Then build an ADU? I thank you very much for letting me speak here tonight.'",
        "'speaker_0': 'Thank you. Next up, Danielle Anderson.'",
        "'speaker_7': 'Hi, I'm Danielle Anderson and I am a Colorado native and a proponent of the 80 youth. I believe in affordable housing. And as a Colorado native, I can see the changes that have come over not only our city but our state in the last few years.'",
        "'speaker_7': 'And so to keep affordable housing an ADU is a great way to do that. So that is my stand. I'd like to read just a little excerpt from a neighbor of Jerry's that wrote a letter. Good afternoon. I would like to comment on Mr. Altman's application.'",
        "'speaker_7': 'I submit my comments as a citizen of Denver and a property owner in the to 1200 block of Quincy Street, the block immediately south of Mr. Sultan's property. My comments do not reflect the thoughts or opinions of my employer, and I'm just speaking in my official capacity.'",
        "'speaker_7': 'I hold. I would like to offer my strong support for this application. I believe the application meets the review criteria and specifically meets the blueprint. Denver 2019 Goals of breaking down barriers to increase accessibility to 80 youth in a city wide basis.'",
        "'speaker_7': 'But in making the rezoning process more accessible to the average citizen in Denver, I've been active in my neighborhood as well as pursued a similar rezoning for my own property, which was approved by City Council in early July.'",
        "'speaker_7': 'The East Colfax neighborhood faces tremendous pressure from gentrification and displacement to grow and change, and that has been well documented in the city studies and my own observations. I witnessed the strong support and the concept for its use in the East Colfax neighborhood.'",
        "'speaker_7': 'In the East Colfax R.A. Support. This application validates.'",
        "'speaker_2': 'My own observations.'",
        "'speaker_7': 'Of support for its use in the neighborhood. It is my sincere hope that the city follows the recommendations of Blueprint, Denver and housing and inclusive Denver as soon as possible to make it easier to build and available to all neighborhoods.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_13': 'Good evening. Members of council, members of the audience, those watching at home. My name is Jesse. Listen, Paris, I ran for city council by large, had almost 15,000 votes. And I'll be running again to be your next mayor, 2023.'",
        "'speaker_13': 'And I'm representing Denver Homicide Low Black Star Action Movie for Self-defense. Positive action come in for social change as well as the universal African People's Organization Unity Party of Colorado and Mile High knows we are in favor of this rezoning.'",
        "'speaker_13': 'As has already been previously stated, we have a housing crisis in the city and I would love to see 80 youths all over this city, just like I would love to see tiny home villages all over this city.'",
        "'speaker_13': 'My question is which one of the council members is going to actually have one in their own backyard so that we can do better and we keep hearing that we can do better, but I don't see any action.'",
        "'speaker_13': 'So this is one step in the right direction, allowing these ideas to be put in various places throughout the city because, you know, we can't have any concentrated areas of poverty. So and when you stop trying to change the terminology from affordable to actual attainable because the affordable standard is not affordable, you have to make $65,000 a'",
        "'speaker_13': 'year to afford a one or two bedroom in Denver, Colorado, based off the current market. Am I? So I would like to see in the near future the city pass more rezonings like this is going to pass. It meets all the criteria so there's nothing that is going to keep this from passing.'",
        "'speaker_13': 'My only question was what was the letter, opposition or email and what was it about? I would like to know that. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers on this item. Are there any questions from members of Council? Councilman Heights.'",
        "'speaker_4': 'Thank you, Mr. President. One question for staff. The question is as you make your way up. The only change for this rezoning is that it allows in to you. There's no other change.'",
        "'speaker_12': 'That's correct.'",
        "'speaker_4': 'All right. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. All right. Seeing no other questions. The public hearing for Council 1158 is closed. Comments by members of Council. Councilman Sawyer.'",
        "'speaker_7': 'Thank you, Mr. President. Well, this is in my district, so I'm just want to speak briefly to thank Mr. Saltzman for doing a fantastic job of community outreach. We spoke briefly before he ever filed his application and talked about kind of what went into this whole process and what it looked like.'",
        "'speaker_7': 'And, you know, I really appreciate you putting all of the time and energy and hard work into doing this the right way, into doing the right outreach to your neighborhood organization and to your neighbors. I think that the fact that everyone here spoke in favor of it, that there is only one letter of opposition and that, you'",
        "'speaker_7': 'know, everyone is really positive about what this looks like is a reflection of the work that you have done in the community to do good outreach. So thank you very much for doing that. I'm very appreciative and I personally am very excited to be supporting this tonight.'",
        "'speaker_7': 'I think it's a fantastic plan. You know, I talk a lot about and we live a low in the east area plan right now and talk a lot about the value of our neighborhoods and the big lots that we have and how incredible they are.'",
        "'speaker_7': 'And they're they're very special and very unique to the city of Denver. There's something that not very many other cities on this planet and certainly not in the U.S. have. And they if we let them go, then we'll never get them back again.'",
        "'speaker_7': 'But they also have a dark side. That means that they are not as attainable as they should be. They're not affordable to everyone. And 80 EUs are the reasonable compromise here. They are the way that we can keep the character of the community, but also allow for a way to bring affordability attainability to these communities and to'",
        "'speaker_7': 'bring options for other people to be able to come into these communities and live there and enjoy all of these amazing amenities. So I'm very grateful that you are leading the charge in this. I think this is only the second one in the entire year is in the second one in District five.'",
        "'speaker_7': 'So this is absolutely fantastic. And my only sort of other comment that I really want to make as we discuss this is that, you know, the cost of 80 years, it's they're expensive to build. And so this is a real investment.'",
        "'speaker_7': 'And I know that you want this for your mom. And I think that that is amazing. And we do know that their use changes over time and that's okay. Right. But my concern is that this will not 80 years will not be the answer to our affordability and attainability crisis if they are only used as short term'",
        "'speaker_7': 'rentals and. So that is something that our city needs to consider as we continue to look at 80 years moving forward. Because if people are building them and only using them solely as short term rentals and not as something that can be a place for a home, a long term home for people, they are actually going to'",
        "'speaker_7': 'create a larger, attainable affordability crisis than we have right now. And so that is just you know, I think it's it's absolutely fantastic that people are able to use their properties in ways to help them earn extra money in in an economy that we have in a city where we have clearly shown that our wages have not'",
        "'speaker_7': 'kept up with the cost of living, where it is incredibly expensive to live here. And so that is another important part of the conversation that we have to have as well. So this is this is not an easy discussion by any means, but it is something that we need to discuss because ideas are a real solution to'",
        "'speaker_7': 'adding gentle density and keeping the character of our community and helping to solve our affordability and attainability crisis. But they it could also go very, very wrong if people are only using them as short term rentals. So thank you.'",
        "'speaker_7': 'I am really looking forward to approving this tonight. Thank you for all of your hard work. And thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I want to thank you also for all your hard work. I'm not in District five, but but I'm very supportive of ideas. As Mr. Gorski said, I. I look forward to the day when an applicant doesn't have to do a lot of hard work to put in an idea.'",
        "'speaker_4': 'And frankly, I think they should be legalized citywide. I've said that before and I'm saying it again. I think that it is a way for us to solve the missing middle. You know, the conversation between single family homes and large scale apartment high rises we should, in our affordable housing crisis, consider.'",
        "'speaker_4': 'Part of the missing middle in an area is one of those one of those tools in a toolbox if they are used responsibly. So thank you for all your all your work. Hopefully you are blazing a trail. So that will make it easier for people behind you to put in auxiliary dwelling units.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. All right. Seeing no other comments, I'll just add thank you to staff for putting together our awesome staff report and walking us through it. I think this clearly meets the criteria and I'll be supporting it this evening.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_2': 'Sawyer. I'm black. I see tobacco. I. Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Gillmor, i. Herndon. Hines.'",
        "'speaker_5': 'Hi.'",
        "'speaker_2': 'Cashman. Hi. Kenny Ortega. Torres. Hi, Mr. President.'"
    ],
    "Designation of Tilden School for Teaching Health Historic District.": [
        "'speaker_0': 'All right, Madam Secretary, please close voting and announce results. 12 provides counsel about 1158 has passed. Councilwoman Torres, will you please put Council Bill 1259 on the floor?'",
        "'speaker_7': 'I move that.'",
        "'speaker_2': 'Council bill 1259 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The public hearing for Council Bill 1259 is open. May we have the staff report?'",
        "'speaker_10': 'Good evening. I'm Karen with Landmark Preservation in Community Planning and Development. And we are here for the Tilden School for Teaching Health Historic District, which is located in District one. It is just north northwest of the school, and it is comprised of three different buildings that were used as a holistic treatment facility.'",
        "'speaker_10': 'The designation application was submitted by a former former council member, Rafael Espinosa, when he was still in office. It was the application was researched and written by members of the community and residents. It has gone through a variety of public outreach before it came to the Landmark Preservation Commission.'",
        "'speaker_10': 'And we are here at the public hearing. The Landmark Preservation Commission reviewed this. They reviewed it under the previous set of criteria because it was submitted prior to October 31st. This is the second to the last application that will be coming forward to you guys.'",
        "'speaker_10': 'That is under the old criteria. It is required to meet two out of three categories of history, architecture and geography to maintain its historic and physical integrity. And the LPC was to consider how it relates to a historic context or theme in Denver's history.'",
        "'speaker_10': 'This particular application meets two criteria under history, three under architecture, and two under geography. The does the designation application talks about the history of this property. It is associated with the development of the city, state or nation. So the development of Denver and is associated with the development of sanatoriums in Denver.'",
        "'speaker_10': 'At the turn of the century, physicians around the country believed that Denver's climate was beneficial for health purposes, oftentimes for people treating two per kilo cis. And so Denver became an area for treatment facilities for a variety of different types of ailments.'",
        "'speaker_10': 'This particular school was started as a teaching school for teaching people to have better health. It was developed by Dr. Tilden and established in 1915. In 1916. It started in the administration building, which is the Basler house, if any of you are familiar with that.'",
        "'speaker_10': 'And then it was built. A couple of other buildings were built along with it. The patients building in 1816 and then the main building, which is the Fairview Lofts, which is currently a condominium, was built in 1919, in 1921.'",
        "'speaker_10': 'Dr. Tilden taught nontraditional teaching health methods. He felt that patients need to know how to cure themselves. He protested that doctors cannot cure disease. The disease is caused by wrong life, and the doctor's prerogative is to teach the patients how to get well.'",
        "'speaker_10': 'So patients would come here and they would stay for a long term period of time in order to learn how to heal themselves through better living. It is also significant for its association with Dr. Tilden himself. He developed and extensively wrote about his treatment theories.'",
        "'speaker_10': 'These nontraditional theories or holistic treatments became well known for those who are seeking alternative methods to to surgeries or medications. And so he has he became well-known within the nontraditional treatment facilities, are nontraditional treatment theories. And so it is the building or the district is significant for his affiliation.'",
        "'speaker_10': 'And he was affiliated with the facility from 1915 to 1924. The school went from 1915 to about 1931. And so it's significant for its association with its founding medical professional. The property is are the district is also significant under architecture for a couple of different architectural styles.'",
        "'speaker_10': 'One, the Italianate style, which is seen in the Basler house, which is the building on the top. It's its asymmetrical design. The third story tower, which has been reconstructed according to preservation standards. The narrow windows, the segmental arches, and then the front and side porches are all character defining features of the Italianate style.'",
        "'speaker_10': 'It's also significant for its colonial revival style, which is the building on the bottom. It is. You can see its symmetrical features. It's a dominant two story central portico entry on the hipped tile roof and then the coining on the sides of each of the building in the front as well as the door surrounds in the taillight'",
        "'speaker_10': '. Windows are the character defining features of the colonial or classical revival styles. And so the district contains two architectural styles that it's significant for. The district is also significant for the work of a recognized architect or master builder.'",
        "'speaker_10': 'It is a significant work of Harry W.J. Ed Ashbrook. He worked for his uncle, who was a well-known architect, Frank Frank at Brook, and he began his career in Denver working for him. When his uncle retired, Harry at Brook started his own practice and he designed the buildings other than the Basler house was already constructed, but he'",
        "'speaker_10': 'designed the other buildings in the historic district. It was early on in the life of his firm and it shows a strong collection of his work. Historian Wilber Fiske Stone felt that the patients building was one of Harriet Brooks most notable designs.'",
        "'speaker_10': 'So this property is a significant work of the recognized architect of Frank at Brook. Harry at Brooklyn. Apologize. It is also significant under architecture for portraying the environment of a group of people. The district is significant for portraying the environment of the patients at the school.'",
        "'speaker_10': 'This was a large scale institutional building that was intentionally designed to be in a residential area. It was designed to fit in with the with the community because the patients were going to be staying there for a significant period of time.'",
        "'speaker_10': 'So the district portrays the environment of the patients who had to stay there long term. It is an intact campus of early 20th century sanatoriums, and the buildings were designed to sort of feel like home for the patients.'",
        "'speaker_10': 'It also represents early 20th century thought for how patients and medical treatments for people, especially for people who came to these, whether it was the sanatoriums for tuberculosis or other other ailments. It has raised porches, bright sun rooms and a large number of windows, which were the leading theories of medical practice at the time.'",
        "'speaker_10': 'It reflected the importance of having ventilation and late into into into patients rooms and spaces and to provide fresh air and sunshine as a way of helping patients heal themselves. The property is also significant under geography for a couple of different criteria.'",
        "'speaker_10': 'The first is having a prominent location that is an established, familiar and orienting visual feature of the Committee of the Contemporary City. This is a series of large buildings in a in a residential area. They're large scale buildings.'",
        "'speaker_10': 'They stand out to the community, stand out in the community. And so they sort of they visually dominate the blocks around it, especially with the park that is really low scale. So it is a familiar and orienting visual feature of the neighborhood.'",
        "'speaker_10': 'And then finally, it is significant under geography for promoting the understanding and appreciation of the urban environment by means of distinctive physical characteristics or rarity. This this area was intentionally designed. If you note on the maps, the top is an 1887 survey and the bottom is the 1905 based real estate map.'",
        "'speaker_10': 'And if you note that the streets around it are designed in the north, south and east west grid, this was intentionally designed to take advantage of the contours of the land and to be more residential and pastoral in its design.'",
        "'speaker_10': 'It was intentionally developed and followed by a layout of the Riverside neighborhood in Chicago. And so this is distinctive for it's characteristic of the layout of the blocks in the lots. It is also rare, as one of the remaining examples of sanatorium sanatorium health campuses in Denver.'",
        "'speaker_10': 'That is a combination of buildings and larger scale. We don't have that many sanatoriums that are remaining and retain integrity. In order for a building to be designated, it also has to retain its historic and physical integrity. The building that is the most changed is the primary building, which is the main building or the Fairview Lofts.'",
        "'speaker_10': 'When it was converted into condominiums in the 1990s, there were alterations. The roof tiles were changed. There were some dormers that were added in. The windows were replaced. However, however, the overall massing has been retained. The proportions the bulk of the original building is still readily available, readily obvious.'",
        "'speaker_10': 'And so the building overall retains its integrity. And then as a district, the other two buildings have been minorly changed and they retained very good integrity. So overall, the district conveys the significance of an early 20th century medical facility.'",
        "'speaker_10': 'The LPC considered the context of this particular building that the operation of medical sanatoriums had become a major component of Denver's economy, that doctors from around the country were sending patients here. And so this reflected the growth of Denver at that particular time and is an important part of Denver's economy at the turn of the century.'",
        "'speaker_10': 'Because this is a historic district, it also goes to a planning board for their review, planning, planning boards. Review is really narrow. They look at a historic district's relationship to Denver's comprehensive plan and any plans that we might have, and then the effect of the designation upon the surrounding neighborhood.'",
        "'speaker_10': 'This property is related to comprehensive plan 2040. It relates to several different goals or strategies. The strongest one that it relates to is the strong and authentic neighborhoods. The proposed district reinforces the vision of comprehensive plan 2040 by preserving a historic cultural asset in the West Highland neighborhood.'",
        "'speaker_10': 'It is also supports environmental resiliency and that the buildings will remain standing and they will not be demolished in adding waste to our landfills. So it relates to two different vision elements within the comprehensive plan. It also relates to Denver's blueprint.'",
        "'speaker_10': 'It is currently the neighborhood context is urban, which is primarily characterized by single unit and two unit residential uses with some multi family residential. And it is has some mixed use throughout. So with its relationship to blueprint Denver this would meet the future places low residential.'",
        "'speaker_10': 'The designation would help ensure that the future growth is of residential character. It would also meet the strategy of to a under land use and built forms that recommends historic designation to ensure that the neighborhoods retain their historic character.'",
        "'speaker_10': 'That designation is consistent with Blueprint Denver's vision to improve the quality of design, and that preserves and creates authentic places. Planning Board also looked at its effect upon the surrounding neighborhood. The Tilden School for Teaching Health Historic District would help preserve the character of this particular block, but it would have little impact on the surrounding neighborhood.'",
        "'speaker_10': 'The intent of designations is only to preserve what was in the actual boundary of designations and not for anything that is outside of the historic district. And so it would have little impact on any of the surrounding neighborhood.'",
        "'speaker_10': 'We have received public comment from 26 individuals, 23 with 23 were written comments in support. Four were from neighborhood groups were organizations. 19 were for individuals. At the Landmark Preservation Commission Public Hearing, there are three members who spoke in support.'",
        "'speaker_10': 'There were no public comments at Planning Board. The Landmark Preservation Commission unanimously recommended approval and forwarded it for your review and the Denver Planning Board also unanimously recommended approval and forwarded it for your review. And I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. We have four individuals signed up to speak this evening on this item. So first up, Chairman Sekou.'",
        "'speaker_5': 'Yes. My name is German Sake who likes to action movement for self-defense. In order representing poor, working, poor and homeless people are most vulnerable folks in the neighborhood. As a resident of this town. This is what we told.'",
        "'speaker_5': 'We support this 100%. This represents who we are and who we should stay. Like, not this mess we got being thrown up now out of clapboard and cheap construction material that won't even last that long, maybe 30 years.'",
        "'speaker_5': 'But we had to redo all of that. And what this represents also is the quality of how we felt about ourselves. You can't buy that today. You can't buy it. You can't buy it. And most remarkable thing about it is you had wholesome medical practices going on.'",
        "'speaker_5': 'Well, here's a doctor that said, if you want to be disease free, stay away from me and fix yourself before you reconcile. That is the everyday common stuff. All right. And he was well received by that and the medical community.'",
        "'speaker_5': 'So he's my kind of guy that will go against the grain. Take the risk of not being popular and then do the right thing. It wouldn't be great public officials acting like that and not get scared because somebody might not like the principles and values that you hold dear that you're willing to compromise.'",
        "'speaker_0': 'Chairman, if you could stay on the topic of this hearing, please.'",
        "'speaker_5': 'I was waiting for you to say so. Help me appreciate it. So not to belabor the point, and I'm sure that we're going to continue this on. Thank you very much for allowing me this time.'",
        "'speaker_0': 'Thank you. Next up, Arianna Stettner.'",
        "'speaker_7': 'Good evening, council members. And there's not going to be a test on all the history of the children teaching school for health. But now you know a lot about it. I am one of the owners in the condominium complex that Fairview Lofts building is celebrating its centennial this year.'",
        "'speaker_7': 'And we, as owners and neighbors have been working together to celebrate its history and work with our neighbors to create this historic district designation. We're very pleased that we have gotten unanimous support from the neighborhood and from our colleagues and from the owners in the property.'",
        "'speaker_7': 'And so I thank you very much for your consideration of this particular designation and the time it's taking you to review all of this. And I also want to express my appreciation to Paul Cloyd, who did considerable, incredible work on the application with me.'",
        "'speaker_7': 'So thank you for your time and thank you for your consideration.'",
        "'speaker_0': 'Would you mind stating your name for the record?'",
        "'speaker_7': 'Yes, it's a Greek name. Ari on the Stettner.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_7': 'You're welcome.'",
        "'speaker_0': 'Next up, Paul Cloyd.'",
        "'speaker_5': 'Thank you, counsel. My name is Paul Cloyd. My wife and I have owned our home in the West Highlands for the last 35 years. I'm a registered architect and a licensed professional engineer, and I serve as chair.'",
        "'speaker_6': 'Of the West Highland Neighborhood Association Design and Preservation.'",
        "'speaker_5': 'Committee. I just quickly would state that I believe the application clearly shows the Tilden School for Teaching Health exhibits the significance and integrity to warrant designation as a Denver landmark. And as you may know from the application, these buildings are already on the National Register.'",
        "'speaker_5': 'I'm grateful to have had a small part in uncovering the story of the Tilden School and further sharing that story with the people of Denver. A historic district designation is the very best tool to ensure.'",
        "'speaker_6': 'That the buildings that perform the historic, historic character of our West Highland neighborhood are not lost.'",
        "'speaker_5': 'Please protect this historic part of Denver by voting yes on this designation. Thank you very much for your time.'",
        "'speaker_0': 'Thank you. Next up, Jesse Preuss.'",
        "'speaker_13': 'Good evening. Members of council, members of the audience, those watching at home. My name is Jesse Paris of the City Council, where large, almost 15,000 votes with no money. And I'll be running again in 2023 to be your next mayor.'",
        "'speaker_13': 'And I'll represent for Denver Homicide, a low black star action movie for self defense positive actually committed for social change. Unity Party of Colorado and Universal African People's Organization Denver Branch in Mile High knows we are in favor of this.'",
        "'speaker_13': 'As has previously been stated, this is something that Denver needs to preserve this this history needs to be preserved. And seeing that the community was all in support of this and you reached out to the community, I have no qualms against this.'",
        "'speaker_13': 'So good job, Espinosa. And now Amanda Sandoval, this pass. No problem. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening. Are there any questions from members of council on this item? Councilman Flint.'",
        "'speaker_3': 'Thank you, Mr. President. Took a while to click in there, as I had a couple of questions. Carol, maybe you could answer or maybe help. Excuse me. The way the lines for the district are drawn. It excludes a little portion of some property parcels.'",
        "'speaker_3': 'And I'm wondering, is that an unusual or is that something we've done on other occasions? And what's on the parcels that are not included within a district but are on the parcel, like with the main, with the patients building right behind it, there's a a rectangle that's excluded.'",
        "'speaker_10': 'Yes. It's it's the garage of the patients. Building garages have been basically considered non contributing buildings because we want people to have the ability to change them or alter them. This particular property owner asked that their garage be excluded and so it's somewhat unusual to do that.'",
        "'speaker_10': 'But because the block was a little not uniform anyways, that that boundary was going to be a little bit changed. And because the garage would be considered non contributing, whether it was in or out was something that we, we felt in order for the building to get designated.'",
        "'speaker_3': 'And then the other excuse me, the other question I have is the building is on Highland, is it a highland place on the north side, three buildings that are part of the parcel that has the the the apartments, condos.'",
        "'speaker_3': 'Now what are they. Tell me a little bit more about those. Are those because they're not on the original maps.'",
        "'speaker_7': 'Right.'",
        "'speaker_10': 'Right. So so so they're they're recent infill garages. So they're they're part of the boundary. But changes could be made to that through design review. But they're modern garages and they're non contributors.'",
        "'speaker_3': 'So they were recently built.'",
        "'speaker_10': 'Yes. They're like within now. I'd have to. Yeah. 26.'",
        "'speaker_3': '26. So we're including them in the historic district but they're non contributing.'",
        "'speaker_7': 'Right there at the.'",
        "'speaker_2': 'Rear of the property.'",
        "'speaker_3': 'Okay, that's enough clarification. That's all I have, Mr. President. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. All right. I've seen no other questions. The public hearing from Council 1259 is closed. Comments by members of council and the councilwoman for this district is not here this evening. Councilman Clinic.'",
        "'speaker_7': 'Thank you. I just want to share my appreciation as one of the At-Large council members for all of the work that everyone put into it. And I think that, you know, I used to go by these buildings all the time when I lived in the neighborhood.'",
        "'speaker_7': 'And so knowing the story, I think enriches the experience. So thank you for the awareness that this brings and just thank you to the staff for the thorough work in presenting it and exciting to see our historic dedications continue to grow in the city.'",
        "'speaker_7': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. All right, so no other comments. I will just add my thanks to staff and everyone who put in all the hard work and to the Honorable Councilman Espinosa for your continued passion and work on behalf of our city.'",
        "'speaker_0': 'Thank you. I will be happy to support this this evening. Madam Secretary, Roll Call.'",
        "'speaker_2': 'Black Eye CdeBaca I.'",
        "'speaker_5': 'Flynt I.'",
        "'speaker_2': 'Gillmor High.'",
        "'speaker_4': 'Herndon High.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_6': 'High.'",
        "'speaker_2': 'Commission. Ortega, I. Sawyer, I. Torres. Hi, Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please go to the voting notes.'",
        "'speaker_2': 'Results 1212.'"
    ],
    "Extension of Nondiscrimination Ordinance for City Contracts.": [
        "'speaker_0': 'Hours counts. Bill 1259 has passed. Councilwoman Torres, will you please put council bill 1289 on the floor?'",
        "'speaker_2': 'I move that council bill 19, does 1289 be ordered published?'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilman CdeBaca, do you want to put forward your motion to amend?'",
        "'speaker_10': 'Yes, I move that council bill 19, dash 1259, be amended.'",
        "'speaker_0': 'I'm sorry. We have a typo in there. 89 is 89. Great massacre. Where? 89. This one.'",
        "'speaker_10': '1289. This be amended in the following particulars on page one, line 21, strike July 1st and replace with April 1st on line 24, strike July 1st and replace.'",
        "'speaker_7': 'With April 1st.'",
        "'speaker_10': 'And online 27 straight July 1st and.'",
        "'speaker_7': 'Replace with April 1st.'",
        "'speaker_0': 'Thank you. It has been moved. Can I get a stand seconded on the amendment comments. Councilwoman Watkins, do you want to make comments on your amendment?'",
        "'speaker_8': 'Yes.'",
        "'speaker_10': 'Thank you, Mr. President. This amendment changes the extension date of the ordinances concerning the three Division of Small Business Opportunity programs from six.'",
        "'speaker_2': 'Months to.'",
        "'speaker_10': 'Three months. So factor in the many conversations I've had with ditto other council colleagues, disadvantaged.'",
        "'speaker_2': 'Businesses.'",
        "'speaker_10': 'And current contractors with the city. I'm proposing that we meet in the middle somewhere. I have an amendment in front of you all that would extend the current ordinance until April 1st and have a Second Amendment prepared for a sunset of May 1st ready to vote on if the three month of amendment is not satisfactory with the'",
        "'speaker_10': 'three month amendment on the.'",
        "'speaker_7': 'Floor first and the.'",
        "'speaker_10': 'Scheduled. In testimony, I'd like to let my colleagues comment and debate the three months first. The three month extension is not only meeting literally in the middle of the six months, but is also based on the projected timeline shared with us from Dito.'",
        "'speaker_10': 'This timeline clearly states that a final draft will be ready in January or February and that the final ordinance will be absolutely ready by April 1st. The DITO timeline goes beyond April 1st to include the rulemaking and promulgation process, which does not typically happen prior to passing an ordinance.'",
        "'speaker_10': 'This open, public, participatory rulemaking window is not only expected and standard, it typically does not happen prior to passing the ordinance because that would then presume that council was passing the ordinance before we actually vote on it. So my thoughts are that the bill could be filed in March and voted on in April.'",
        "'speaker_10': 'If the timeline they provided is accurate, if a compelling reason tonight is provided to explain why the final draft slated to be done in February could not be filed in March, I'm willing to put the May 1st extension on the floor.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you, councilwoman. And you, we are going to keep this amendment open so that members of the public can also speak to this during the hearing. All right. So I think with that, we're going to open up the hearing with the amendment open.'",
        "'speaker_0': 'So if you're here to speak on this item, we'd love to hear your thoughts on the extension. And the amendments are the courtesy public hearing for Council 1289 is now open and we're going to jump right in to our individuals.'",
        "'speaker_0': 'We have nine, I believe, signed up to speak this evening. So I'm going to call the first five, if you wouldn't mind, coming up to this front bench so that we can get through everybody. When I call your name, you can step right up to the microphone.'",
        "'speaker_0': 'But the first five, if you want to come up to the front bench are Veronica Barela, Heather Noise chairman, say coo Helga Grund or sorry if I got that wrong and Adrian Sanford, if you want to come up to the front and Veronica barela, you are up first.'",
        "'speaker_7': 'Good evening. My name is Veronica Barela and I reside at 151 South Stuart Street. I'm here representing the Committee for City and Airport Fairness concerning the Division of Small Business Opportunity Ordinance. We are supporting Councilwoman C.D. Baucus amendment to extend the Dispo Ordinance programs to three months instead of the proposed six months.'",
        "'speaker_7': 'The council woman's rationale is the ordinance is 95% complete, but the rules and regs is the part that is taking a little bit longer. I want to point out that some of the responsibilities of the division of small business opportunities, and I quote, is to provide technical assistance and outreach that focuses on educating small businesses and capacity'",
        "'speaker_7': 'building to establish and monitor small business participation mechanisms to remove barriers to contracting opportunities with the sister city, fosters successful partnerships and whole comprehensive compliance programs. And I want to thank Audrina Gibson, who's done an excellent job, done a really good job at Dana, and it given a new life to dispel.'",
        "'speaker_7': 'In my opinion, there are important aspects of the new ordinance that need implementing sooner rather than later, such as lowering procurement procurement thresholds as to increase mwb participation, improved prompt payments plan to increase and formalize monitoring, compliance, reporting and oversight of the procurement process.'",
        "'speaker_7': 'Increasing outreach and communication efforts to increase program parties participation better define define good faith efforts plus many new significant features of the ordinance. The current status quo does not fully benefit minority businesses, and I encourage you all to support Councilwoman C.D. Baucus amendment to shorten the time frame to three months.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Heather Noyes.'",
        "'speaker_7': 'Good evening. My name is Heather Noyes and I am majority owner of studios TPG. We're a WB certified business located in Northwest Denver on Tennyson Street, and we provide landscape architecture services to the city and county of Denver, both as a prime and as a sub to several different city agencies.'",
        "'speaker_7': 'I'm immensely proud of my firm's contribution to the evolution of this city. It's really important to me personally and professionally. My firm has consistently struggled for since I've been in business, which is 15 years, with the impacts of delayed payment under city contracts.'",
        "'speaker_7': 'And I will say two current examples, and I am going to call these flagship projects because I believe that they are positively contributing to the daily health and welfare of every resident of the city and visitors. A flagship project number one.'",
        "'speaker_7': 'We are sub consultant to a national firm. Our last payment on this project was July 22nd for work performed between April 1st, 2018 and April 30th, 2019. That's one year's worth of work without pay. Our contract is still active.'",
        "'speaker_7': 'We continue to provide services for this project and we remain unpaid for six months of work. And there has been no information forthcoming from the Prime regarding when I can expect payment. Flagship Project Number two I'm a sub consultant to a huge international engineering firm.'",
        "'speaker_7': 'As of December 11th, 100% of fees for project initiated in April and completed in October were unpaid. The amount owed to me equates to two of my firm's payrolls. DeLay in payment means this to me. In order for me to meet payroll and pay my bills, I have to dip into my line of credit.'",
        "'speaker_7': 'And when payment is delayed past 120 days, four months on current concurrent excuse me, concurrent projects. My line of credit often gets maxed out in this cost me money, I'm paying interest. And when my line of credit gets maxed out, I've got to turn over.'",
        "'speaker_7': 'I've got to turn to my credit cards. And that also costs me a ton of money. And the bottom line, I believe, with respect to delayed payment, is this when my invoices go unpaid by my primes and these are huge firms, these are huge, huge firms that I'm referring to.'",
        "'speaker_7': 'I'm bankrolling them and I'm bankrolling you. And I'm bankrolling the city's projects. And my profits, which are not big to begin with, are eaten up by interest payments.'",
        "'speaker_0': 'Your time is up.'",
        "'speaker_7': 'Okay. Thank you very much. Thank you very much.'",
        "'speaker_0': 'Next up, Chairman Scoop.'",
        "'speaker_5': 'Yes. Chairman Sekou. Oh. Lecturer Action Movement for Self-defense. And you're next United States senator in 2020. I would be remiss if. This party did not acknowledge one of the most trusted and humble servants in this room. Sister Stephanie O'Malley.'",
        "'speaker_5': 'And you'll know who she is. So we need to at least acknowledge her like we've done other books. Great service. Thank you. What the previous speaker was expressing is one of the caveats to what we experience. As small business folks.'",
        "'speaker_5': 'And it's really a shame. Because what has to be done is more than just extend this. Particular bill would also put some teeth in it. That requires women, small businesses, especially, quote unquote, minority businesses. And I don't like that term because that assumes there's a majority of business partners up with these bigger companies who seek to not'",
        "'speaker_5': 'help them grow, but to seek to eliminate them. So. A City Council's responsibility is not to set up small businesses for failure by not putting things in the ordinance that allows them to grow and thrive so that one day maybe they may not be so small, maybe they might join the majority.'",
        "'speaker_5': 'And if we're talking about equity, which is one of the fundamental principles behind coming up with these bills, then we should make it a responsibility that the folks who ain't got it have to subsidize everybody that do got say.'",
        "'speaker_5': 'And so I salute you for your integrity and your willingness to go through this, because I know he's right. But you got to keep on pushing, all right? And you got to keep on pushing them and tell them the truth, because I'm looking at the faces now and they listen.'",
        "'speaker_5': 'They heard you. They heard you. All right. So that's the importance of everyday folks participating in this kind of thing. Democracy requires us to speak on behalf of the things that impact us so that we don't die silently as they eliminate what it is they say they do.'",
        "'speaker_0': 'Sorry. Time's up. Thank you. Next up, Helga Grund, the rude.'",
        "'speaker_2': 'Good evening. I'm Helga Grunwald.'",
        "'speaker_7': 'I am the retired executive director of the Hispanic Contractors of Colorado, where I served for 17 years. I probably have more hours of but in the chair time working on.'",
        "'speaker_6': 'The Mwb ordinance than most.'",
        "'speaker_7': 'Of the people in this room. First appointed by then Mayor Hickenlooper to work on the first ordinance in 2004, which was implemented in 2007. So for years, the city has struggled with trying.'",
        "'speaker_6': 'To make this program work.'",
        "'speaker_7': 'And I can tell you, after working with many.'",
        "'speaker_6': 'Small businesses, you.'",
        "'speaker_7': 'Have not succeeded, but you finally, finally have a young woman in the chair to guide this program. And she comes from RTD, which most small businesses will point to as the model for the city to utilize for your programs and the ordinance.'",
        "'speaker_7': 'And what it needs to do.'",
        "'speaker_6': 'Is very, very complicated.'",
        "'speaker_7': 'And I would urge you to give Adrina.'",
        "'speaker_6': 'The six months that.'",
        "'speaker_7': 'She would like to have, to make sure that all.'",
        "'speaker_6': 'Of the.'",
        "'speaker_7': 'Dots are aligned, that everything points together, and that finally, after 12 years, you can maybe have a program that.'",
        "'speaker_6': 'Really, really.'",
        "'speaker_7': 'Develops your small businesses. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Adrian Sanford and I called the next five up if you want to make your way to the front bench. James W Jensen, Jr, Jesse Paris, Andrea Mosby, Mina McCollum and Lacy Getz. Go ahead.'",
        "'speaker_6': 'Good evening, council members, and thank you for allowing me to speak to you this evening concerning this most important issue. My name is Adrian Sanford and I am a small business disadvantage owner, principal of the Sanford Group LLC.'",
        "'speaker_6': 'I want to first thank Eric Maraga and his extraordinary team for the awesome job they are doing and most importantly, for their commitment to the small and minority business community. I have worked in the design and construction industry for 25 years and have been part of the Construction Empowerment Initiative Committee for a long time.'",
        "'speaker_6': 'And this fairly new leadership team, Adrina and Stephanie Smiley, has been very engaging and committed to the small business community. And this is the first time I have seen this team really engage the Small Business Committee. We are requesting that the city council supports a four month extension following the submission of the ordinance to include a 30'",
        "'speaker_6': 'day prom pay. I feel like if we can get the ordinance submitted in February with a four month extension in order to write the processes, this option will be an appropriate period of time for coordination and development of policies and procedures and IT system revisions to support the ordinance.'",
        "'speaker_6': 'Revisions to be completed by July 2020. As Helga has said, I have been part of the ordinance subcommittee for an awful long time and I don't believe people really understand how difficult it is to write an ordinance to be involved in it and to quickly just go through it.'",
        "'speaker_6': 'Not only will it provide the ability for Desmond not to be successful, but if they're not successful, they will not make the small business community successful. In addition, in order for Desmond to do their job well, we are requesting that the City Council support and commit to meeting the challenges by ensuring that dismal has all is required'",
        "'speaker_6': 'to be successful with this effort. Again, if dismal is successful, then the small business community is successful. I want to keep reiterating that this is the first team that I have seen in a long time that is helping small businesses.'",
        "'speaker_6': 'But if we don't give them the resources to continue writing these processes and procedures correctly, then it won't help us as small businesses to ensure the success of the program. It must be agreed that the MWB program be considered to be one of the highest priority by the relevant stakeholders inclusive of the Mayor's Office, City Council Belt'",
        "'speaker_6': 'Team, Denver Economic Development Opportunity and a set equal commitments by all of the stakeholders will ensure the required collaboration necessary for the success of the MWB program. Again, our current Mwb departure excuse me again our current Mwb ordinance revisions ensure that all of the small minority business have an equal opportunity for the economic growth and benefit of'",
        "'speaker_6': 'our tax dollars. So I ask the City Council to please take into consideration the difficulties a lot of us small business leaders have dealt with over a long period of time to get this. Orton is right. Time is up and to remove the barriers.'",
        "'speaker_0': 'Thank you. Thank you. Next up, James W Jenson Jr. Good evening. My name is James W Jensen. My firm is James W Jensen Photography.'",
        "'speaker_6': 'I'm a Colorado native. I would like to thank City Council for allowing me to speak.'",
        "'speaker_0': 'I am in.'",
        "'speaker_3': 'Total agreement with the previous.'",
        "'speaker_6': 'Speakers regarding the good work that Adrina has.'",
        "'speaker_3': 'Done and also Stephanie O'Malley. I would like to request that City Council considers the.'",
        "'speaker_0': 'Four month extension as far.'",
        "'speaker_3': 'As getting everything with.'",
        "'speaker_6': 'The ordinance written up.'",
        "'speaker_0': 'And including.'",
        "'speaker_3': 'The prompt.'",
        "'speaker_6': 'Payment clause, that is very important as a small business, I wrote down a few things.'",
        "'speaker_0': 'Regarding payment.'",
        "'speaker_6': 'That would help me as a one man operation. It would allow me to have more consistent cash flow if a prompt payment is done within 30 days.'",
        "'speaker_5': 'It would also make the primes.'",
        "'speaker_0': 'More.'",
        "'speaker_6': 'Accountable to the city and.'",
        "'speaker_3': 'Also committed to the small businesses.'",
        "'speaker_5': 'And it would also.'",
        "'speaker_0': 'Give the small.'",
        "'speaker_3': 'Businesses the opportunity to.'",
        "'speaker_6': 'Grow and prosper. Thank you very much for letting me speak.'",
        "'speaker_0': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_13': 'Good evening. Members of council members, our audience, those watching at home. My name is Jessie Paris or Bradford City Council where a large got almost 15,000 votes with no money this past May election. And I'll be running again in 2023 to be your next mayor and I reside in county seat of Baucus District District nine and I'm'",
        "'speaker_13': 'representing for Denver homeless low black star. I am all for self defense positive action in for social change as well as the Unity Party of Colorado and the Universal African People's Organization. In Mile High News. We are in favor of this sunset extension.'",
        "'speaker_13': 'I just had a few questions in regards to this because I keep hearing all this stuff about minority business contracts. We need to stop using this minority term because you're lumpiness in other groups, meaning black people are being lumped in with other groups that have just arrived here or have not been systematically disenfranchized and locked out of'",
        "'speaker_13': 'such businesses and contracts. So I want to know exactly how many black owned small businesses will benefit from this sunset extension, and also exactly how many black owned small businesses we have in the city because they are dwindling.'",
        "'speaker_13': 'I see fewer and fewer each and every year. I am a Denver native. I was born and raised here when I was coming up. There was a lot of black small businesses. Now there's very little to any mom and pop shops.'",
        "'speaker_13': 'They are being literally bought up such as like Downy Superstore is now going to be a King Soopers and their Scotts Market is closed down and we're literally in a food desert and the city's priority is not on black minority owned businesses.'",
        "'speaker_13': 'So I would like to know exactly what businesses this is going to benefit. And thank you, Stephanie, for putting this forward. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Andrea Mosby.'",
        "'speaker_7': 'Hi. My name is Andrea Mosby. My company is Urine Fresh, and it's a janitorial supply company. And just this past week, I was in New York visiting my son, and he came up with something. He said, there's no compression algorithm for experience.'",
        "'speaker_7': 'So I said, okay, then I'll give you my experience. And as a small business is interesting because I recently got a contract with the city to do their air fresheners. But when I got.'",
        "'speaker_10': 'The contract, I had to come up.'",
        "'speaker_7': 'Initially with some money quite a bit for me, for a small business. And once I came up with the money, I found myself calling them on a regular basis, like, look like the job, cut the check, you know what's going on.'",
        "'speaker_7': 'And I realized that with the ordinance and everything that we're talking about, sometimes understanding that our electric bills and everything like that come every 30 days, that not only do we need to get paid, but also I think was important.'",
        "'speaker_7': 'That's also a part of the ordinance is for cars because I was at a CII meeting and one of the gentleman there made the comment that he didn't think that a company, a small company, could handle $100,000. And and what would they do with all that money?'",
        "'speaker_7': 'And I thought it was interesting because he was the liaison for Prime. And I said, isn't that interesting? Because he's probably going to go and give his time sheet to somebody else and he's probably going to go and get two weeks vacation.'",
        "'speaker_7': 'Not to mention, he's probably going to have health care. But when I went home, I got to do my own H.R.. I have to figure out how I'm going to pay my own medical bills. See, I don't have a liaison to come because I have to come to meetings like this.'",
        "'speaker_7': 'All right. So what I'm saying is, not only do we need you guys to support this ordinance with the vote, we need you to support it with the money. The disparity study made it very clear that we are not in alignment with small businesses, specifically black businesses, but we're not in alignment.'",
        "'speaker_7': 'And I have set through four disparity studies. So what I'm asking you to do is not only to vote for this the way we need it, not the way you want to give it, but the way the small businesses is asking you to do it.'",
        "'speaker_7': 'But I'm asking you to vote for it. I'm asking you to also put the money in that needs to be in place to make sure that this bill can make sure the small businesses have an opportunity to be able to grow into larger businesses so that we don't have the tale of two cities in this particular city'",
        "'speaker_7': '. But we all get the opportunity to participate in the growth and the opportunity that everything that comes with being a part of Denver. After all, over 50% of jobs are are given by small businesses. So take it serious.'",
        "'speaker_7': 'I've been here a long time and we desperately need you guys to move forward. But you're taking what we need. And I appreciate it. And I know my time is up a really quick, a very, very important.'",
        "'speaker_0': 'First person I do have to move on can either do what's next to me and then McCollum.'",
        "'speaker_7': 'Or you can do.'",
        "'speaker_6': 'It so you.'",
        "'speaker_2': 'Good evening. Hello, council members.'",
        "'speaker_7': 'My name is Mina McCollam and I am the President and CEO of San Energy, Mechanical and Electrical Engineering Firm. I am requesting the Council to allow the extension of the ordinance by four months to incorporate a 30 day, 30 day prompt payment clause.'",
        "'speaker_7': 'I know this is sound like a broken record, but payment is absolutely imperative to ensure that we are able to grow our companies via paying our employees and continuing to contribute to the city and county of Denver's economy.'",
        "'speaker_7': 'Unfortunately, the current ordinance does not have the language dictating this necessity. As a result, many companies, including my own, have been subjected to financing city projects at a sunken costs. In this scenario, the best case is taking an unnecessary loss.'",
        "'speaker_7': 'So a cut to our profit margin in the worst case is mortgaging our homes and or laying off staff. These small business pitfalls will be and can be prevented and mitigated with the prompt payment 30 day clause. Therefore, again, I am requesting for a four month extension.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Lacy gets.'",
        "'speaker_7': 'Thank you and thank you for saying my name correctly. First of all, I want to thank each and every one of you here for listening to the situation, for listening to the small businesses, and for considering this important.'",
        "'speaker_7': 'There's nothing, in my opinion, that can build a city like supporting the small businesses, because when you do that, the money stays local. We hire local people. That money then gets spent here. When you hire larger firms, the money goes to their headquarters and their profits.'",
        "'speaker_7': 'And to pay for those salaries and vacations that we heard about. I own and run an mwb structural engineering firm, and I am here to ask that you support the division of Small Business Opportunity in particular. Stephanie O'Malley and Adrina Gibson in whatever it is they need to get this done and get it done correctly the first'",
        "'speaker_7': 'time because we've already done it wrong a number of times. I think that this is absolutely critical. And again, I'm going to stress the prompt pay portion of it. I want to give you a little bit of my story.'",
        "'speaker_7': 'I want a huge project with the city absolutely excited to be a flagship project. We started work in January. We submitted our invoices every 30 days, just like we were supposed to. Eight months went by. We still have not been paid.'",
        "'speaker_7': 'I found out that our prime had not submitted a single invoice to the city, and because I had a pay win paid clause, as is normal, they had no obligation whatsoever to pay us. I had no recourse. I took out a mortgage on my home.'",
        "'speaker_7': 'Now my house is in danger. If there's something wrong with any of the invoices which there turned out, there was. This is my first big city project. Then it got delayed in the city's process. So now I'm another 60 to 90 days.'",
        "'speaker_7': 'I have a project that I haven't been paid for since January, and I recognize that it's not necessarily your fault you're not it. But the policies and the processes, the rules, regulations, the I.T. support that are behind that to make this payment happen.'",
        "'speaker_7': 'And more importantly, the huge shift that we're working toward in the culture of each and every department is a monumental task. Right. Getting people to recognize that small businesses are important. Paying them promptly is important. And that's something that I know that Adrina has really picked up on and has really tried to pull the city and all'",
        "'speaker_7': 'of its various departments together to work as a unit. And I would I would really ask that you support that. Quick check of my notes to see if there's anything else I wanted to say. And I think that's it.'",
        "'speaker_7': 'So thank you for listening and thank you for supporting Denver and small businesses.'",
        "'speaker_0': 'Thank you very much. All right. That concludes our speakers this evening. We're going to get into questions from members of council and I will ask members of council to attempt to keep your questions focused on the item that we have in front of us, which was which is the extension of the sunset.'",
        "'speaker_0': 'We could spend a lot of time digging into the future ordinance, and we will have that time in committee and on the floor when it comes forward. I understand that certain things will overlap, but as much as possible.'",
        "'speaker_0': 'If you could try to stay on topic of what we're considering because we do have another hearing and people waiting for that one as well. All right. First up, Councilman Black.'",
        "'speaker_8': 'Thank you, Mr. President. Thank you, all of you who attended the public hearing. I have a couple of questions for either Adrina or for Stephanie or both. So just to reiterate what President Clark just said, right now, we're just contemplating to vote on your six month extension, and Councilwoman CdeBaca is proposing that we shorten that.'",
        "'speaker_8': 'Can you explain to us why you need the full six months? Some of these speakers describe some issues that they're having. Will you have with the extended time? Will you be able to address some of the issues that they're concerned with and make sure that we quote Lacy gets that we get it right this time.'",
        "'speaker_14': 'Yes. Good evening, council members, president. And I first want to thank all of the small businesses. They came out this evening and taking time away from your business to be here on such an important matter. And I wish I could invite Lacey back up to do that presentation again, because you spoke right on everything.'",
        "'speaker_14': 'But thank you for asking that question. Council in Black with regards to.'",
        "'speaker_0': 'So could you quickly introduce yourself, everybody watching on TV every time?'",
        "'speaker_14': 'Adrina Gibson I'm the director of the Division of Small Business Opportunity. So thank you again for the question. Councilwoman Black, with regards to the extension that we're proposing for six months, I just want to reiterate that that six months is truly intentional, necessary and well thought out.'",
        "'speaker_14': 'And we spent only being at the city of. For a small amount of time. We've spent a concerted amount of time just writing the ordinance. That was just one phase of it. The second phase is with regards to the rules and regs.'",
        "'speaker_14': 'If we don't have and I understand with regards to the rules and regs coming typically afterwards, if we don't have time to push the rules and regs forward and to provide considerable time to looking at our technology systems, being able to coordinate with the many city agencies that we're going to need to coordinate and bringing many of'",
        "'speaker_14': 'these changes in the ordinance through. There's going to be inconsistencies and even larger than that, it will make it extremely difficult for dispo and our partner agencies to actually implement the changes and the concerns that have been brought forward by our small businesses.'",
        "'speaker_14': 'Things as simple as well, not as simple things as difficult as prompt payment, which I'm very, very excited about. If we can't implement that, we're going to find ourselves in the exact same situation that we're in right now.'",
        "'speaker_14': 'Yes, it will be law. But being able to implement it without a technology system, without process and procedures that we've been agreed upon among city agencies and being able to write that into all of our contract boilerplate will put us at a deficit and will be helter skelter.'",
        "'speaker_14': 'So those six months are detrimental to being able to ensure that everything is thoroughly aligned, not just the ordinance which is law, but our policies and procedures, our coordination efforts, our involvement of small businesses and training.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. Adrina and Stephanie. Whoever needs to answer these for full disclosure, Adrina and I were colleagues at RTD and very happy to see you here running this office. Now, explain for us the difference it would make to your agency and other city agencies if the six months were shortened to four.'",
        "'speaker_3': 'And then also if the six months were shortened to three. Yes. How how would that impact you?'",
        "'speaker_14': 'So essentially, if and I'll speak to the three months first and I don't know the exact dates of how that would be broken down, but if if we originally, which was intended for the six months, would be bringing the rules and regs, the ordinance process procedures and systems all aligned and everything essentially ready to flip the switch'",
        "'speaker_14': 'on July 1st. Keeping in mind that we've already started putting many of these key themes into procurements, it would just allow for everything to be lined up perfectly so that we could implement these changes and begin enforcing them as an agency if we saw them two, three months.'",
        "'speaker_14': 'Essentially what we're doing is we're tying up the ordinance at right at this point right now where we are still under legal review with the ordinance and submitting that without having any process and procedures in place and having the ability to coordinate with the many city agencies like DPW Goods and services I'm General Services, I'm sorry, ten'",
        "'speaker_14': 'arts and venues, etc.. So we're pushing an ordinance through where we haven't had the time to do final review to bring that back out to the community, to let them read through it and let city council read through it as well with four months.'",
        "'speaker_14': 'So three months assurance our time to really do anything except for just submit the ordinance with the four months we are still submitting the ordinance without any policies and procedures and without the understanding of what's going to happen with our tax systems.'",
        "'speaker_14': 'However, with it being relatively close to our six month timeline of submitting April 1st, again, we are cutting off any time to write the policies and procedures and to train our staff. And it's not just disposed staff, but we're also training all of our project managers to undo culture.'",
        "'speaker_14': 'We're training all of our prime contractors to understand what these clauses in their contract means now and additionally cutting off that time to train our Mwb ees on what their rights are at this point in time. And I would say again, I just want to reiterate the most important and impactful component of this six months.'",
        "'speaker_14': 'It's not only the roles in reds, but attack systems. And I just have to keep reiterating that because every individual brought a prompt payment and that prompt payment mechanism will need to be accomplished in our tech systems. And as we all know, that takes time.'",
        "'speaker_3': 'Adrina, I, I suspect that I what I hear you saying as well is that if you if if the current ordinance were extended only for three months and you were compelled to institute the new ordinance on April 1st, or we would go through all this again and do another extension, which I would hope to avoid.'",
        "'speaker_3': 'It could be disastrous rollout. You wouldn't have the training in place. You wouldn't have the technical technological system in place.'",
        "'speaker_6': 'Yes.'",
        "'speaker_3': 'That would be less true at four months than at three months.'",
        "'speaker_14': 'It's curvy. It's just shy of a little bit of time. But typically, I mean, relatively speaking, three, three months or four months is about the same. Now, here's regards to the lack of.'",
        "'speaker_3': 'Thank you. Now, here's a crucial issue to many folks up here, and that is during this six month extension, there's a lot of business that's going to go through the city. Are you doing anything to include in contracts and slips, solicitations that are going out?'",
        "'speaker_3': 'Are we able to include some of the updated procedures in some of these contracts, even without the new ordinance in place and under the authority of the old ordinance?'",
        "'speaker_14': 'Yes. And I'm happy that you asked me that question even prior to springing or thinking that we were going to need this extension for the ordinance disposal in partnership with the city agencies and Stephanie O'Malley. We've already begun putting this language with regards to Mwb compliance plans, good faith efforts, termination for a good cause, and so on'",
        "'speaker_14': 'and so forth in many of our megaprojects as it stands today. That language is actually in our and RFP is for great hall amendments for the convention center for the National Residents and I'm sorry for the Elevate Bond Central Library.'",
        "'speaker_14': 'And as of most recently on Friday when the RFP went out for the NWC Triangle P three. All of that language is is in that RFP as well. And then we have additional procurements that will be coming out soon.'",
        "'speaker_14': 'With respect to livestock, the din janitorial that I'm sorry, the din janitorial services contract and many others. So they're not getting through our shop without this language being in there because again, this is just as important to me as it is to these small businesses.'",
        "'speaker_14': 'We have to be able to ensure that we're doing right by our small businesses. So we've been very, very diligent in our efforts in coming through the procurements that are coming out to make sure that that language is there.'",
        "'speaker_5': 'Last question, Mr. President.'",
        "'speaker_3': 'If you were to receive a six month extension of the curtain ordinance, but things went well enough that we could pass the new ordinance in March, April, and you could implement it sooner. That could come to this body and the old system could be thrown out sooner than July 1st, assuming you're ready.'",
        "'speaker_3': 'You're asking for the six months so that you're sure you have adequate time.'",
        "'speaker_14': 'Absolutely. Thank you. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Councilman Cashman.'",
        "'speaker_5': 'Thank you, Mr. President. Let's see. So, Gina, the one thing that you didn't mention there when you were listing all the things that were going into projects that come before this now was Trump pay. Mm hmm. How is how how is that approached?'",
        "'speaker_14': 'So that is the one clause that we have not included. And that, again, comes back to the tax systems. And so that you guys have a little bit of background on the payment clause that we're pushing forward it we're moving away this bill with regards to Mwb certified businesses working on city contract activities.'",
        "'speaker_14': 'We're moving away from paid when paid to regardless of pay. So that mwb is ones that once their work is accepted and completed and their invoices are submitted, prime contractors have a certain number of days to then make payment to their subs in order for dispo to actually enforce that requirement.'",
        "'speaker_14': 'We have to be able to add that into our tech modules. We don't use paper as we did at RTD and actually missed the paper, but we don't use paper because we have thousands of contracts. So whatever invoices are being submitted, we have to be able to track that in one of our tech systems, whether it be'",
        "'speaker_14': 'work de, texture, BTG, those are just three of the three of the different tech systems that we have, just three. And so of those we have to figure out how we can track that, how we can flag it and how we can enforce it.'",
        "'speaker_14': 'I don't want to make any empty promises to the small business community again because I'm fighting for them. So if I'm putting something in an ordinance, I want to be able to ensure that my team is standing by that.'",
        "'speaker_5': 'Sure. I guess what I'm wondering, though, is would it make sense to put the wording in now and show that when the tracking system is up and running, then you're legally authorized and however you need to be. And I may be missing something, so please explain.'",
        "'speaker_14': 'Now, so we are keeping the payment mechanism and provisions in the ordinance. And as the procurements, again, as the procurements are coming up now, we are leaving space to allow for payment requirements. But the procedure is not there for us to quite literally specify that out in the contract.'",
        "'speaker_5': 'I see. Thank you. The other thing I just wanted to clarify, there were, I think, three people, Mr. Jansen as and one I remember your name. Woman sitting to your right and.'",
        "'speaker_14': 'Adrian.'",
        "'speaker_5': 'Thank you. And the woman to your right. All She seemed to be asking for whatever time Desmond needs to get it right, but asked for four months rather than six months. I just want to be clear whether you meant to give them the six months they're asking for or whether you do want the shorter four months.'",
        "'speaker_5': 'Six months.'",
        "'speaker_0': 'I was. Yeah. I'm sorry. You have to come up to the microphone so that everybody watching on TV can also hear your answer.'",
        "'speaker_5': 'If all three of you wouldn't mind. Just so I'm clear, ma'am. Thank you so much.'",
        "'speaker_6': 'If we're able to submit the ordinance in February so that the 30 day prop pay is in is in, then allow dismal additional four months to write the procedures, the processes and the rules and wrecks. This will allow the 30 day prompt pay to be law, but it would give dismal four months to get it right so'",
        "'speaker_6': 'that they can implement the process and the procedures along with all the other aspects of it and etc.. That's what I was speaking to.'",
        "'speaker_5': 'She was saying four months after February. Correct. Thank you. And you, sir. I'm saying the same thing. Okay, so six months is what you're saying, sir? That's correct. That would allow dispo to get all the systems and everything in place and working.'",
        "'speaker_5': 'Thank you. And you, ma'am. I'm sorry.'",
        "'speaker_7': 'Thank you, Councilman, for asking because we weren't clear. So, yes, I am requesting for the time that's needed in order for Katrina and Mrs. O'Malley to incorporate the prompt payment clause. That would be six months.'",
        "'speaker_5': 'Okay. Thank you so much. I must get you if you have something.'",
        "'speaker_7': 'Again, my name is Lacy and I would like to say that I'm not happy about the delay at all. And we've brought up a number of things about how to protect small businesses with these huge projects coming out.'",
        "'speaker_7': 'And I really feel like a drain in particular has accepted those challenges and stepped up to the plate. So I'm truly comfortable with the six months that she needs.'",
        "'speaker_5': 'Sure. Yeah. I mean I mean, I share the frustration that that has been expressed by some people that wanting this done sooner. And I was pleased to work with Councilwoman Ortega and Councilman New on and I think a lot of the beginning of where you are now, what I'm hearing.'",
        "'speaker_5': 'Well, I'll say that. Thank you. I appreciate the clarification and to the witnesses who spoke.'",
        "'speaker_0': 'Thank you. Thank you, gentlemen. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. Of some of the questions already had had have been answered. I do want I as I understand it, we should pass laws, then make the.'",
        "'speaker_6': 'Rules.'",
        "'speaker_4': 'And I guess I'm I'm a little unclear as to are we waiting to pass the law until June or are we passing a law sooner than making the rules? Or is there a reason why we should wait till June to do all of it?'",
        "'speaker_4': 'I mean, I think that in the past we or at best practice in general is to pass a law and then do rulemaking. So can you help me work through that? Thank you.'",
        "'speaker_14': 'Yes, for clarification. Our proposal is to wait to pass the law until the rules and regs can be aligned with the ordinance. So April 1st, we would submit the ordinance, file it, and then at that same point in time, we'd have the rules and regs draft ready to go as well.'",
        "'speaker_14': 'So thereafter that time period would be for training. We would be working on our tech systems as well as working back with the community for public input and comment.'",
        "'speaker_4': 'So you say submit the law in April. Does that mean that April, the first council meeting in April, it would be in for introduction and then the second council meeting in April would be there for final consideration and do pass.'",
        "'speaker_14': 'So I don't have the dates broken down as such. I just know with regards to wanting to ensure that the ordinance is done, we blocked out the timeline for that to be April 1st.'",
        "'speaker_4': 'Okay. And then the next quick question I have is you mentioned that you're already incorporating language into contracts like the Great Hall and Convention Center and Central Library and National Western. Thank you for doing that. I think that's important that the people who live here can continue to live here.'",
        "'speaker_4': 'And not everyone looks like me, a middle aged white male. And I'm glad that I and I'm glad that we're protecting the diversity here in our city. So that but what language are you including in the contracts? Are you including and I don't mean let's read all of the contract, but I mean, just, I guess to to'",
        "'speaker_4': 'give better nature to the to my question, are you saying you're including in the Great Hall contract that the the legislation and rulemaking that you're considering now will will be in the see the Great Hall contract in your and in the contract it says once this passes into law that you have to know now.'",
        "'speaker_14': 'So but thank you for asking that question so that I can clarify that as well. So now we're putting quite literally in those blanket provisions. So rather than saying once the ordinance goes through X, Y and Z and giving the Chapter 28 articles to the today, we're trying to make it a lot clearer for contractors and small'",
        "'speaker_14': 'businesses to understand expectations. So many of the themes that you'll see in the new ordinance are called out in the RFP is the RFQ and the contract, for example, like a compliance plan. This is something that's new that now contractors are required to design, create work with liaisons and coordinators, small businesses to explain to us how they're'",
        "'speaker_14': 'going to meet their commitments to small businesses. So that's something that we're actually calling out in the contract language as well. It's being laid out in the ordinance.'",
        "'speaker_4': 'And prompt pay. Is that also something that certainly that appears to be a topic of of concern and and based on testimony, I would agree is is prompt pay also something that you're incorporated into the RFP for Great Hall, Convention Center, Central Library, etc.?'",
        "'speaker_14': 'Right. So because the prompt payment tax system hasn't been finalized, we did not include that in the RFP in our Qs. However, we are going to include it in the contracts so that it's still obligated thereafter because we would have a better sense then as to how we are going to enforce it.'",
        "'speaker_4': 'Does that create a gap between the responses from the RFP and then the contract itself like, well, we'll see a vendor who gets selected based on an RFP. Will they say, well, we weren't told that we had to pay promptly.'",
        "'speaker_4': 'We're not going to do that.'",
        "'speaker_14': 'Now because at that point in time, once it's in the contract and it's in the ordinance, it's law abiding by then.'",
        "'speaker_4': 'Okay. And the last thing that I, I think we've covered this, I just want to ask it anyway. So the the prompt pay, I totally understand. I mean, people mortgaging their homes, maxing out their credit cards. Why wouldn't we pass the bill ASAP so that let's say we were to pass it today, which obviously is not possible'",
        "'speaker_4': ', but we just pass it today and then these vendors are on the hook. These large multinational corporations are on the hook. And, you know, if we wait until June of of 2020 to pass it, then they're not on the hook until June 2020.'",
        "'speaker_4': 'And then they can hem and haw for the bill that comes through May 31st of 2020.'",
        "'speaker_14': 'So well, because technically it would be in the contract, so they would still be obligated to to abide by those requirements. The difference being that putting it in the ordinance versus keeping it out of the ah, can I keep you out in other words.'",
        "'speaker_14': 'But rather than putting in the audience and then setting it and not being able to implement it versus having the process and procedures for us to therefore enforce it. Those are two different things and that's what we're trying to get to, is being able to enforce it now because we have the systems and the procedures whereby to'",
        "'speaker_14': 'do such a thing. If we put it in the ordinance without any systems governing it or any procedures and different agencies understanding how to assess dispo and making sure that they're meeting those payments. That's where that inconsistency and inefficiency comes.'",
        "'speaker_14': 'And then we could get phone calls from small businesses saying, you're not enforcing the payment, but we don't have the system in place to do so yet.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_14': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. Adrina, first, I want to thank you and other folks from the city for meeting with me to walk through some of these provisions under general services, because the ordinance currently does not speak to them.'",
        "'speaker_9': 'Do we have any idea how many big contracts they have that are expected to come through during this window of time between now and the time that the ordinance actually gets adopted?'",
        "'speaker_14': 'Yes. So I don't have that actual number on hand now, but I did send an email to all of the council members, which we can send again with the listing of all of the procurements that we have slated for the first quarter of 2020.'",
        "'speaker_14': 'And General Service is also included in that. We've got quite a lengthy list here, and this is just a touching on some of the procurements that are going to be coming out. So I don't have that that solid number, but we can resend it and we can resend the list.'",
        "'speaker_14': 'So.'",
        "'speaker_9': 'If the if they come out in the first quarter and the ordinance does not speak to goods and services because we're extending the current ordinance, we're not adopting the new ordinance yet. Correct. Those are contracts that will not get covered.'",
        "'speaker_9': 'Correct.'",
        "'speaker_14': 'So we've actually been in conversation with regards to goods and services with our city attorney's office. And obviously we have a city attorney's office here now. And so what you're asking is, under the current ordinance, where some contracting opportunities wouldn't be quote unquote, covered goods are covered services, would we have the ability to still recognize them for'",
        "'speaker_14': 'a goal or an SB defined pool? We've been combing through that legally to see if that's something that we can do. That's like probably the only caveat with the exception being quite honest, that we're looking to see if we can do okay.'",
        "'speaker_9': 'One of the contracts I'm aware of is a big parking contract. And when we have small businesses that want to partner, you know, with with larger premiums on some of those, these are some that go by the wayside that otherwise would could have a minority partner.'",
        "'speaker_9': 'But because the current ordinance doesn't cover goods and services, that's part of the concern about the urgency in time. Right. And we talked about that when we met. So help me understand how we're able to put language in current contracts.'",
        "'speaker_9': 'Under the current ordnance contracts that will come through. You talked about a number of the big ones. It's not in. It's not covered in this ordinance. But you're trying to cover it in the contracts. How can we realistically do that if it's not spelled out in the ordinance?'",
        "'speaker_14': 'So there's a couple of different questions that you ask there. The first one I believe, that you're speaking about is the parking management procurement. And because that has already gone out for solicitation and is already currently pending contract award.'",
        "'speaker_14': 'What we're doing doesn't retract any of that. So unfortunately, that was not a covered good or service contract and whereby we couldn't include that language because it was already out for solicitation at that time. And I believe that was back in August and it's pending award now.'",
        "'speaker_9': 'And that's something like a $50 million contract. It's a pretty big one.'",
        "'speaker_14': 'I don't know the dollar value on that, but I know which one you're speaking about because it was after the fact many, many, many months ago that we were going to put language in that.'",
        "'speaker_9': 'All right. So process and procedures are anticipated to be in place by the time those contracts come forward.'",
        "'speaker_14': 'So the contract language is already in the upcoming. So as stated, we started putting that contract language in many of the megaprojects. Unfortunately, the parking management was much earlier on, so we did not have the opportunity to work with the team to get that language in.'",
        "'speaker_14': 'But now all of those procurements are being flagged for us to review internally. We actually have a subcommittee with many of the city agency, project managers and executive directors that we're going through in coming up procurements for opportunities for mwb safeguards.'",
        "'speaker_9': 'And does that include some of the general services upcoming contracts?'",
        "'speaker_14': 'Yes. So as stated, the DIN janitorial services that's coming out, that was previously with ISIS, this one is coming out again. And we're working with PBMs to ensure that that language is in the actual solicitation for the RFP.'",
        "'speaker_9': 'Okay. And then just lastly, the new ordinance will have the 30 day prompt pay language.'",
        "'speaker_2': 'Yes. Okay.'",
        "'speaker_9': 'All right. I have no further questions.'",
        "'speaker_0': 'Thank you. Thank you, Councilwoman. Do we need a clarification here?'",
        "'speaker_7': 'When?'",
        "'speaker_14': 'Already out for.'",
        "'speaker_2': 'Solicitation prior to us.'",
        "'speaker_9': 'Oh, we need some additional clarification.'",
        "'speaker_14': 'We were just clarifying if the parking was a covered good or service and I was explaining that we didn't apply a goal because it wasn't covered at that time and we didn't get the language in there.'",
        "'speaker_9': 'Yeah, I mean, that's a little concerning because we've, we've extended this contract already, a couple I mean, this ordinance a couple of times as we, you know, went back and added goods and services to the disparity study. And by the time we get this adopted, we'll we'll already start get close to starting the disparity study for the'",
        "'speaker_9': 'next five year round, right?'",
        "'speaker_14': 'Yeah. In two years. Yeah.'",
        "'speaker_7': 'So that's an evolving process.'",
        "'speaker_9': 'A little frustrating, but thank you.'",
        "'speaker_14': 'I share your frustrations. And again, I want to see this happen as soon as possible. I just want to make sure that we do it right.'",
        "'speaker_0': 'Thank you to Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I have a question for our city attorneys, our city council attorney. This is so I want to in in general, it's best practice for us to pass a law, then make the rules. I guess that's question one.'",
        "'speaker_4': 'And the question to is, is, as I understand it, what we are doing right now is we are passing the law before, but making the rule first or making before we pass the laws. I guess. I guess is that your understanding of this as well?'",
        "'speaker_7': 'Kirsten Crawford Legislative Counsel I have been asked this question a number of times in the past few days. It is not uncommon for us to proposed draft rules prior to the adoption of an ordinance. I think we did it in in the situation with green roofs, if I'm not mistaken.'",
        "'speaker_7': 'And also we've done it at times with marijuana. And I think some of the reason behind that is to let stakeholder groups understand how the ordinance and the rules might function together. Specifically as to the timeline for dispo in this particular situation, I might bump that question to Jason more.'",
        "'speaker_7': 'If you have more specifics, it it is, I think, more conventional to draft an ordinance adopted and then have the rules come behind. But we've done this a number of times in the city and in other jurisdictions. I know it's done.'",
        "'speaker_7': 'That was that way as well.'",
        "'speaker_4': 'Okay. And then I just want to give Ms.. Stewart, do you have any anything that you want to add? You don't have to. I just want to give you the opportunity to. Should you want to.'",
        "'speaker_2': 'STEWART.'",
        "'speaker_6': 'Sky. Sky.'",
        "'speaker_14': 'I'm sorry.'",
        "'speaker_7': 'North Sky. Stewart Mayor's office. No, I think Adrina and Stephanie O'Malley have covered this.'",
        "'speaker_10': 'And Kirsten said what I would have said about we have on occasion sort of gone down a parallel track with rules and regs and ordinance to make sure we're offering clarity to.'",
        "'speaker_7': 'Particularly newer, complicated things to.'",
        "'speaker_2': 'Stakeholders so they'll know exactly how it will work.'",
        "'speaker_10': 'And so that we have staff trained up on how enforcement and implementation will work together.'",
        "'speaker_4': 'Okay. Thank you, all of you, for your input. And thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Set of questions.'",
        "'speaker_10': 'Just a quick point of clarification.'",
        "'speaker_7': 'The examples you brought up were actually citizen.'",
        "'speaker_2': 'Led ballot initiatives.'",
        "'speaker_7': 'Up. Green roofs, some marijuana. So green roofs, yes.'",
        "'speaker_10': 'Was a citizen's initiative when we put together a stakeholder group to make changes to that.'",
        "'speaker_7': 'It was a city led.'",
        "'speaker_10': 'Process and that included development of some of the rules and regs in a parallel.'",
        "'speaker_2': 'Track. Short term rentals is another place.'",
        "'speaker_10': 'We talked about some additional rules and regs. At the same time, we are moving forward with an ordinance.'",
        "'speaker_7': 'They weren't adopted at the same.'",
        "'speaker_10': 'Time, but the development of them was somewhat.'",
        "'speaker_7': 'Concurrent to give people a.'",
        "'speaker_10': 'Better sense of what happened.'",
        "'speaker_7': 'So the you are correct, green roofs.'",
        "'speaker_10': 'Was a citizen's initiative. But not every example we have of talking about concurrent rules.'",
        "'speaker_7': 'And regs.'",
        "'speaker_2': 'Is a citizen's initiative. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. All right. Seeing no other questions, I just want to follow up because I'm not sure if I just missed it or if Councilman Ortega asked a bunch of questions all at once. And I was waiting for the answer to one of the later ones, and I'm not sure if I missed it, but can you'",
        "'speaker_0': 'talk a little bit to so we don't have the ordnance, but you are building a lot of what will become the ordinance into existing contracts. And so you don't have the ordnance to do that with, but you're doing it.'",
        "'speaker_0': 'So one, I think the councilman's question was, how are you doing that? That I was waiting for an answer and might have just missed it. And then second, why not pass those things if we're doing it anyway? You know, often I think we get this ordinance done.'",
        "'speaker_0': 'It's set in stone, but it's not. We can come back and amend it along the way, so why not put into ordinance those things that we are already doing with other contracts, even if not everything is ready instead of wait all the way until everything's ready.'",
        "'speaker_0': 'Can you speak a little bit to that?'",
        "'speaker_14': 'Thank you for that. So as it is right now, it's pretty much a la carte. So the projects that we see coming down that have mwb opportunities where on one hand rushing, getting all of the necessary mwb safeguards in those specific procurements, as well as trying to restructure and revise all of our boilerplate language.'",
        "'speaker_14': 'So we're working we're frantically working on two things at two different times. This additional time that we would have with the six month extension allows us to put this language in all of our contracts so that it's consistent rather than working on them as we find out a procurement is coming down the pipeline.'",
        "'speaker_14': 'The language is more consistent. We ensure that it's boilerplate for all procurements and solicitations coming out, and it's not a grab bucket of what to put in this procurement versus where to put in this one. So that six months allows us the time to work with the various city agencies to revise all of their libraries of boilerplate'",
        "'speaker_14': 'language. And you asked how we're doing that at this point in time in terms of process, like sitting down with the PMS and.'",
        "'speaker_0': 'Which is without the ordinance as that guide, who's making those decisions about what gets in which one?'",
        "'speaker_14': 'So we've already we've already been working on and finalizing a lot of these themes in the ordinance. But as the procurements come down the pipeline, it really comes down to what kind of opportunities are available. How can we safeguard mwb ees with whatever goal or sub defined pool we're laying out?'",
        "'speaker_14': 'It's really a caveat of what fits best for this procurement as a PO, and that's because we're again trying to get things in. In the meantime of this ordinance being out versus having the time to create a boilerplate language for all mwb is regardless of procurement.'",
        "'speaker_0': 'Okay.'",
        "'speaker_14': 'So answer your question, Councilman Ortega.'",
        "'speaker_9': 'Yeah. So just to piggyback on this a little bit. So any of the contracts that are moving through. Will they have the 30 day prompt pay language in them? Just to be clear.'",
        "'speaker_14': 'So as it is right now, we don't have the systems in place for the prompt payment. So the payment is the one item that we have not been putting into the RFP is our Qs. But we're hoping to amend the contracts to ensure the prompt payment is there once we have the systems in place.'",
        "'speaker_9': 'Okay. And that's being communicated with anybody that's getting awarded these contracts. Correct. So they know that's.'",
        "'speaker_14': 'Yes. So as an example, with regards to the compliance plans that we're asking for, for many of these megaprojects, there are having to explain to us how they are going to promptly pay their mwb is what mechanisms they are going to use to ensure payment and speak to their commitment towards ensuring that small businesses are there, that'",
        "'speaker_14': 'they are contributing to the success and growth of small businesses. So we're doing a play on words by getting their commitment rather than putting that provision in there, because we don't have the systems yet.'",
        "'speaker_9': 'And then just one very last question, if I may, on the general services. Is there a threshold level that's been identified in terms of how we determine which ones? I mean, obviously, the disparity study is is used to determine, you know, how many people are in those various categories.'",
        "'speaker_9': 'But are we setting a threshold level or is it just for every contract.'",
        "'speaker_14': 'At threshold level four with regards to if it's going to have a goal or be in speed? If I'm. Paul Yes. And I'm very excited to bring that back to all of the council members to lay that out.'",
        "'speaker_14': 'But yes, we've actually increased the thresholds so that we have the ability to apply a goal versus and speed. If I am Paul and on in the current ordinance, those programs live separate from one another and the future ordinance they're in concert with one another.'",
        "'speaker_14': 'So on the parking management, we would go back and look at the number of available firms that can do that type of project and say, Hey, we have a large pool of firms, let's make this an sbe defined pool or there's not a lot of prime opportunities for IMW BS on this.'",
        "'speaker_14': 'So let's make this let's put a goal on this so that there's subcontract able opportunities for small businesses. So yes, we've changed the threshold and we've also removed the covered term and we'll be bringing that all back to you once we begin the reauthorization process.'",
        "'speaker_9': 'So as we have contracts moving through the process, has there been a concerted effort to look at shorter time frames so that we're ensuring that we're capturing the opportunity for in the DWP participation as opposed to like the parking contract doing a five year contract with the five year extension, but yet no opportunity for minority or, you'",
        "'speaker_9': 'know, women participation in in those.'",
        "'speaker_14': 'And yes, and that's the main reason why we need time for rules and regs, because we have to be abled. So we've actually been working with our city agencies on citywide language and saying why it is one agency do it this way and why does another do it this way?'",
        "'speaker_14': 'Why are the timeframes different? We've been having those conversations, but that right there is a perfect example as to why we need that additional time so that we can shore up the processes and in many instances streamline them.'",
        "'speaker_9': 'Okay. Because, you know, with with the contracts, we either vote them up or we vote them down. We don't get to amend them. So, you know, I'm going to be looking at a lot of these contracts with a a much more careful eye as they're coming through, especially if they're high dollar contracts.'",
        "'speaker_14': 'I would encourage you to. Please.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Captain Kels. Behind you of something?'",
        "'speaker_4': 'Yes. Apologies. One more question. Why can't we pass the today and delay the effective date to July 1st?'",
        "'speaker_14': 'I don't.'",
        "'speaker_2': 'That's a city attorney's office.'",
        "'speaker_14': 'Can you ask the question one more time, please?'",
        "'speaker_4': 'Why can't we pass this today and delay the start until July 1st, 2020?'",
        "'speaker_5': 'Good evening, guys. Jason Moore, City Attorney's Office. The ordinance is largely administrative. This is for you know does about authorizes disabled to operate. So at least as far as the agency, we kind of got it up to a certain point until we confer with the rest of the administration.'",
        "'speaker_5': 'And then that's when we got our recommendation to delay it to get the payment issues put into the ordinance. So as of right now, the ordinance is not ready to roll out. We're going to get it get it ready to roll out as quickly as possible, the reauthorization rather than the extension.'",
        "'speaker_5': 'So we got to a stopping point before before we could proceed with it.'",
        "'speaker_4': 'Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. All right.'",
        "'speaker_6': 'Seeing no one can hear you.'",
        "'speaker_9': 'Ortega have we procured the system that we're going to be using to do the prompt pay and to be tracking?'",
        "'speaker_14': 'We we have not procured them yet. We are looking to utilize an existing system rather than bring in a whole new one. We want to obviously advance what we currently have in place and we've already begun our convening with tech systems, the data, the data analysts from each of their agencies, as well as our PMS and our'",
        "'speaker_14': 'financial app folks to look at how we can add these modules to our existing systems.'",
        "'speaker_9': 'Which system is that?'",
        "'speaker_14': 'So we are deliberating between right now Workday and B to G and texture. But we're most we're we're hopeful that we can proceed with work day being the system that allows us to do this compliance.'",
        "'speaker_9': 'And do we have a consultant working with us to help us try to figure all that out?'",
        "'speaker_14': 'So there are two. So we've we've brought in tech services as well as the data analyst that each of the agencies have done, in particular has two consultants that will also be a part of that process.'",
        "'speaker_9': 'Great. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. All right. Now seeing no other questions. The public hearing for Constable 1289 is now closed. Comments by members of council and I will because we have the amendment on the floor, comments about the ordinance and about the amendment and the timeframe.'",
        "'speaker_0': 'I think we can do all the comments together and then we can get through the voting without doing a comment section for each time. So, Councilman Flint.'",
        "'speaker_3': 'Thank you. But I would defer to Councilman CdeBaca to go first.'",
        "'speaker_0': 'Thank you, Kelly.'",
        "'speaker_3': 'I was just faster on the trigger.'",
        "'speaker_0': 'You're a fast trigger figure there.'",
        "'speaker_7': 'I assumed. Thank you, Mr. President.'",
        "'speaker_10': 'First, thank you so much, Adrina, for the work that's gone into this process. We've been in the process of reviewing and updating this ordinance for quite a while, and you've been here for less than a year and have really done an excellent job making sure that we get the new ordinance we need.'",
        "'speaker_10': 'After over a decade of stumbling through the status quo, we've heard a lot of testimony about how small businesses suffer because of our delays and processes. The current ordinance, which is sunsetting at the end of this month as a result of an extension that Dito asked for in February of this year that my colleagues approved, is is'",
        "'speaker_10': 'a it asked for a lot of time to begin with. The original extension was to allow more time to discuss community recommendations and to identify needed changes to the ordinance, rules and regulations and internal policies and procedures. A lot of what look what looks like we're doing again later on in this six month proposal, I'm well aware'",
        "'speaker_10': 'of the need for time to carefully implement such an important ordinance. We have indeed foregone significant opportunities during the height of our growth to build to build up our disadvantaged businesses. Through this ordinance, we've watched our disadvantaged businesses shrink and disappear while systematically being excluded from competing for our largest contracts paid with taxpayer dollars, simply because of'",
        "'speaker_10': 'the way our current ordinance was written. Goods and services are.'",
        "'speaker_7': 'One area.'",
        "'speaker_10': 'That we are most deficient in and is still one of the areas that will continue to suffer, especially during this delay. In the last decade, we've watched our policy businesses decline along with our policy populations. Every single day and month matters to our disadvantaged communities.'",
        "'speaker_10': 'We have a 2018 disparity study that very clearly indicated we have significant disparities that we need to address immediately. The disparity was very the disparity study. Study was very thorough in its recommendations and with a generous eight month extension from the previous council.'",
        "'speaker_10': 'I do not understand why, in good conscience we continue to further disadvantage our disadvantaged businesses, knowing that another extension is costing them dollars, contracts and interventions we should have began implementing eight months ago without the immediate unbundling. Wherever possible, minorities in this city are still relegated to second class contractors or what we call subcontractors rather than primes'",
        "'speaker_10': '. In many cases, they cannot even compete, and we end up with teams that have no disadvantaged representation until they're forced to. I'm looking forward to seeing the new ordinance codified and the implementation of the recommendations in the DISPARITY study from 2018.'",
        "'speaker_10': 'And I speak for many in the city when I request that my colleagues make the disadvantaged businesses their priority tonight rather than our own convenience, and cut this extension down to the minimal amount necessary. Based on the testimony, I ask my colleagues to vote no on the three month amendment and allow me to put the four month'",
        "'speaker_10': 'proposal on the floor where I'm requesting that you vote yes again. Adrina stated that April 1st is when this ordinance will be completed. There is a separation of powers and branches of government for a reason. Our branch of government, the legislative branch, should be passing the ordinance or law prior to the executive branch, allowing the agencies to'",
        "'speaker_10': 'promulgate rules and regulations. I encourage you all to vote yes on a four month extension, no on the three month extension and no on a six month extension. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn.'",
        "'speaker_3': 'I think, Mr. President, I would speak in favor of of allowing a six month extension and acknowledge that, as Councilwoman CdeBaca had just said, this is needed as soon as possible. But to implement a new ordinance before all the processes and especially the tech process, the the the systems by which we're going to enforce it, are able'",
        "'speaker_3': 'to handle the mandates of the new ordinance. That's a recipe for disaster. We've seen enough things in this city. That have been implemented before they were ready to be administered and enforced. And that is not good for our small businesses.'",
        "'speaker_3': 'However. The six months, what we were told in our committee, the six month extension is the maximum amount of time that the agency believes it needs. It could be ready before that. And if it is, we can supplant the existing ordinance as early as May or June and not wait until July.'",
        "'speaker_3': 'But in the interest of not having to come back here and have this debate again on well, not on April 1st now, but on May 1st, if they're not still not ready, I believe that we should trust the Dispo Office and Ms..'",
        "'speaker_3': 'Gibson and her in her professional judgment and give her the time she believes and many of the small businesses believe is is needed to do that. If this were an agency, if dispo is that dispo, it's just sounds weird.'",
        "'speaker_3': 'If if the dispo office were an agency that were fighting this. If we were dealing with an agency that was fighting this reform tooth and nail and was reluctant, if it was if it was the sheriff's department, it was the public works department pushing back on on some reform we wanted to do.'",
        "'speaker_3': 'I could see holding their feet to the fire. But here we have an agency that's the principal advocate for these changes. That's not the situation where we need to hold their feet to the fire. They're already holding their feet to the fire.'",
        "'speaker_3': 'The biggest question mark that I see here and what I've heard in the testimony is the technological and the administrative processes that need to be in place. And I think we should vote in favor of granting the dismissal office the time it believes it needs to get those.'",
        "'speaker_3': 'The worst thing that we could do would be to force the passage of the new ordinance before that office can get administered. So I ask that we pass the pass the bill on first reading or order it published as as it is presented and not amended.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Gilmore.'",
        "'speaker_7': 'Thank you, President Clark. I appreciate the dialog and the questions from my colleagues and Adrina and Stephanie, thank you for your work on this. I, you know, came from a place of compromise and wanting to allow additional time for disabled to do their work, but then also honoring the work of our minority and women owned businesses and'",
        "'speaker_7': 'small businesses in Denver. I've heard from many of them that do business out at the airport, that do business throughout the city. And I understand the six month extension is for you all to get through this process. We could do the ordinance ordinance earlier, followed by the rules and regs.'",
        "'speaker_7': 'And small businesses have been floating loans to the city of Denver for years. And I want to honor and in good faith hear from them and look at a four month extension so that we can get the ordinance in place and that there's.'",
        "'speaker_7': 'A line because to order new technology, to order, you know, applications, to make sure that we're able to track and the prompt payment piece is huge. I cringe to think about how many possible maybe we be. Businesses have gone out of business trying to do work with the city and county of Denver because they were never, ever'",
        "'speaker_7': 'paid by their prime and we didn't have the systems in place to track that. And so I would ask my colleagues to not only support dispo and the important work that has happened, but to also support the small businesses.'",
        "'speaker_7': 'And we had a few of them here tonight. There's no way that we're going to hear from a majority of them because they are there at home trying to do their payroll, do their end your books right now, you know, legal, everything else.'",
        "'speaker_7': 'And so I want to honor them and hear what they're telling me and that I am in support of the four month extension to May 1st so that we have a definitive time because we can't float this anymore.'",
        "'speaker_7': 'And I want to honor the small businesses that are keeping, frankly, the city afloat and keeping us diverse and inclusive. Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_5': 'Yeah, thank you, Mr. President. And I passed the president a note a moment ago saying how proud I was that I caught myself during questioning as I was slipping into comments. That doesn't happen all the time. So I'll make my comments now.'",
        "'speaker_5': 'What I started to say was I was pleased to work with Councilwoman Ortega and Councilman New. I think we started a couple of years ago on on the, you know, issues like prompt payment and strengthening the the goals from minority and women owned businesses and and heard many small business owners come in and talk about, as we'",
        "'speaker_5': 'heard tonight, the obscene amount of time it takes to get paid for for work that's been completed. And so I, I understand the frustration, but what it feels to me is, is that the frustration is about what's happened in the past.'",
        "'speaker_5': 'And what we've got now is is the the team in place to correct that finally. And for me, the additional two months, the way I'm interpreting the testimony that I'm hearing tonight, is there there's minimal risk to small businesses in granting the six month extension so that we get it done right and and completely.'",
        "'speaker_5': 'So I'm I'm in favor of the six month extension. I ache for the businesses that have been injured along the line. And but I think we've got things in hand at this point. So. That's my words tonight.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. First, I want to thank Katrina for the incredible work that you've done in the short amount of time that you've been with the city. You really get this stuff. And I'm excited about your your role in helping move this along as far as we've gotten.'",
        "'speaker_9': 'So I want to say thank you for that. Stephanie, I know you've been playing a huge role in, you know, the disparity study process and in helping to draft the current ordinance as well as Jason. This is not new to the city.'",
        "'speaker_9': 'We have had an mwb ordinance since the pioneer days. In the last two administrations, we have had seen part of our Gillespie office fall down in terms of strong enforcement, strong outreach and training. And I'm excited about the fact that we've really staffed up and are working to address all of those kinds of issues, because that is'",
        "'speaker_9': 'critical to making sure that we are not seeing small businesses put out of business. You and I have worked on one of those out at the airport, and I think when we have agency folks that take a hands off, like, well, that's between the prime and the sub, and we're not holding that prime accountable for not doing'",
        "'speaker_9': 'their job and making damn sure that the people they brought to their team, which is part of why they got the contract in the first place, are I mean. This is where it's broken. It's why we need the ordinance.'",
        "'speaker_9': 'It's why we need to. To make these changes. But our agency people have a responsibility in this as well. They can't just keep taking the hands off and and still allow these contracts to move forward without accountability to those people who got selected to follow our ordinances and to make sure that their premiums are getting paid.'",
        "'speaker_9': 'Given the fact that the ordinance is about 95% done, I am in support of the four month delay because the changes that were made that Councilman Cashman just talked about, the councilman knew brought forward, were supposed to help address part of these issues.'",
        "'speaker_9': 'Right. By making sure that the information was being submitted at the time of payment to the DSB office so that there was transparency in the payments. And to realize that we have businesses still waiting eight months. You know, I dealt with one that was $5 million outstanding at the airport for almost a whole year.'",
        "'speaker_9': 'And you know, what ends up happening in a lot of cases is they have to settle for pennies on the dollar, which is absurd, because that is not why this this ordinance exists. It's to make sure that we create these opportunities where people get to participate in city jobs and make a little bit of money and support'",
        "'speaker_9': 'their businesses and grow their businesses. But just the opposite is what we see happen with some folks, like the one at the airport that, you know, basically not only had been there for 27 years, but lost everything. And that's not what we want to see happen.'",
        "'speaker_9': 'And so I'm I'm excited about the changes, but I am anxious for us to move these things along. We we have a tracking system today. I mean, we we have to track how all of this gets reported. And and, you know, but what I hear is we're shoring that up to handle the new volume.'",
        "'speaker_9': 'And I know when Eric Maraga took over as our OMB director before the name was changed, I said, this is one of the things you need to step in and deal with because we have over $6 billion worth of work that's going to be coming through this city.'",
        "'speaker_9': 'And and, you know, it really was when you came on that we started beefing up the staffing and all of that. So I know I'm sort of getting into part of the ordinance and we have another public hearing.'",
        "'speaker_9': 'So I will stop. But I'm in support of the four months because we need to get this done as soon as possible. And I appreciate the all the work that's that's been done not only by you guys, but all of the BWB partners who have sat through many, many meetings with reviewing the disparity data and the drafting'",
        "'speaker_9': 'of the the ordinance that is yet to come forward. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. In committee, I mentioned measure twice, cut once. Turns out our predecessors already gave you that second measuring opportunity when we we as in the previous we not me, but gave you the an an extra eight month extension.'",
        "'speaker_4': 'And so here I, I want to, uh, we in the legislative branch, we make the laws and, you know, so I am totally supportive of allowing a delayed start so that you can make rules. I'm also in support of the four month extension so that you can take the laws from 95% to 100%.'",
        "'speaker_4': 'So I am in support of the four month extension. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Hines. All right. Seeing no other comments. And then again, we're going to race through some voting. So if you have something to say on.'",
        "'speaker_9': 'The point of order, just a quick point of order. You can, as the introducer of the original, can you just withdraw that and resubmit the second one?'",
        "'speaker_0': 'Sorry to do that, but first, I have a few comments to make before we get to that. But yes, excellent. Okay. So I will just add my thanks to everyone. You know, Stephanie, Adrina, Susan, whole team, this is exciting and I think that you're really onto something when city council sits around fighting over how fast can we'",
        "'speaker_0': 'have it, right? We want it. We want it now and we don't want to wait. Anymore. That's a success. That means that you are headed in the absolute right direction. And so I don't want that to get lost in the middle of this.'",
        "'speaker_0': 'Three months, four months, six months. Right. We were excited. And this is important work and we want this now. And I think that that's a good thing. On the city council, you know, sitting up here, we don't have a lot of levers that we control.'",
        "'speaker_0': 'Right. And I know that also gets frustrating when we're not in the weeds like you are. And then all of a sudden we are up here saying, but wait a second, we we think you can do it faster or we think you can do it better.'",
        "'speaker_0': 'And I know that's not easy on that side. It's not easy on the side, not having a lot of levers when there's something that we believe in and we want to move forward. And one of the levers that we do have is how long do we make this extension?'",
        "'speaker_0': 'And, you know, I, for one, absolutely do not want anyone to take any reduction in this time as we want less than perfect and everything. Right. I still want all of that. But one of the levers that we can pull is to put that fire on a little bit more.'",
        "'speaker_0': 'And, you know, I do think that sometimes when you get a goldfish that grows to the size of its container, and if we gave this a year, then we probably wouldn't get it eight months early in committee or four months early or two months early or a day early.'",
        "'speaker_0': 'Right. And I think if we set it as six, then that's probably where we'll get it. I appreciate Councilman Flynn's, you know, hope that we will get it earlier, but I think we definitely don't get it earlier if we set the date out there just because that's how we all work.'",
        "'speaker_0': 'And we work towards those deadlines. And I think setting a deadline that's more aggressive maybe helps us actually get it there earlier. And if it doesn't, then we continue to have a conversation. And this is another touch point for council to have in this work.'",
        "'speaker_0': 'And so for those reasons I am excited. I want this now. I can't have it right now. And so I am in support of shortening that time frame and continuing to push and light that fire and and hoping that we can get it sooner and continue that conversation and continue the touch points that Council has as we'",
        "'speaker_0': 'go on to make sure that we can get this fully enacted as soon as possible. So I am supportive of the shortening of the delay as well. So all right. With that and thank you, Councilwoman Ortega. We are going to we don't need to vote down the amendment.'",
        "'speaker_0': 'But Councilman said, like, if you want to propose a withdrawal of your original amendment.'",
        "'speaker_10': 'I would like to propose a withdrawal.'",
        "'speaker_7': 'Of my original amendment.'",
        "'speaker_0': 'Can we get a second on that?'",
        "'speaker_9': 'As the second, I agree to withdraw.'",
        "'speaker_0': 'All right. And so we have that moved and seconded. So, Madam Secretary, that one's cleared out now. Good. Okay. Now, Councilman said, what do you want to make your motion to amend?'",
        "'speaker_10': 'Yes, I move that council bill 19 Dash 1289 be amended in the following particulars on page one, lines 21, 24 and 27. Please strike July one and replace with May one.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'All right. Are we all set? Madam Secretary. Yep. All right. Excellent. So that has now been moved and seconded. And unless someone really has a burning comment, we're just going to go through to the vote. Looks like it.'",
        "'speaker_0': 'All right. Madam Secretary, roll call on the amendment.'",
        "'speaker_2': 'CdeBaca.'",
        "'speaker_8': 'I black.'",
        "'speaker_6': 'Flynn. No.'",
        "'speaker_2': 'Gilmore. I.'",
        "'speaker_6': 'Herndon. No.'",
        "'speaker_2': 'Hines.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Cashman. Hey. Kenny Ortega.'",
        "'speaker_6': 'I.'",
        "'speaker_2': 'Sawyer. I. Tories. I. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_2': 'Five nays, seven ice.'",
        "'speaker_0': 'Five nays, seven ays Council Bill 1289 has been amended. And now, Madam Secretary, if you would, roll call on 1289 as amended. And again, unless there's a burning. Oh, nevermind, we're already going into roll call. Go ahead.'",
        "'speaker_2': 'Black. I see tobacco. I. Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Gilmer. I. Herndon High. Haines High Cashman. I can eat i. Ortega, i. Sandoval. Sorry. Sawyer. Guy toys i. Mr. President. All right.'"
    ],
    "Fee on Disposable Bags Ordinance.": [
        "'speaker_0': 'Madam Secretary, please close the voting, announce the results. 1212 Eyes Accountable. 1289 has been published. All right. That brings us set last to our final courtesy hearing of the evening. Councilwoman Torres, will you please vote count about 1176 on the floor.'",
        "'speaker_2': 'I move that council bill 19 dash 1176 be ordered published.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The courtesy public hearing for council bill 1176 is open. We have one, two, three, four, five, six people signed up to speak on this item. So if you have come to speak on this, this is the bill on the fee on disposable bags.'",
        "'speaker_0': 'If you have signed up to speak for this, I will ask you to come up to this empty front bench right by the microphone. And then when I call your name, step up to the podium. First up is Nolan Gaul.'",
        "'speaker_2': 'We? Hi. My name is known call. I a third grader, a student at Ashley Elementary. I want to be. I want plastic bags not to be a part of America. My sisters also sea turtles. And now they're dying from plastic bags.'",
        "'speaker_2': 'Sea turtles eat plastic bags thinking they are jellyfish. Plastic bag from Colorado travel to the oceans with big storms and winds. Please ban plastic bags in Denver to show the world we care about our sea life and oceans.'",
        "'speaker_2': 'We want sea turtles to exist for a long, long time. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Randy Moorman.'",
        "'speaker_6': 'Good evening, Mr. President, and members of Denver City Council. My name is Randy Moorman and I am the community campaigns director at Echo Cycle and the vice president of Recycle Colorado. I'm here to speak in favor of Bill 19, Dash 1176 on establishing fees for disposable plastic and paper bags.'",
        "'speaker_6': 'We have a plastics pollution problem and virtually all the plastic ever created. About 8.3 billion tons still exists on planet Earth today. 315 million tons are produced annually, and that amount is projected to quadruple within 30 years. Only 9% of plastic ever produced is recycled.'",
        "'speaker_6': 'The rest persists somewhere in landfills or as litter in our environment. The problem is that plastic never completely goes away. Plastics always break down when exposed to the elements, but they never completely go away. They simply get smaller and smaller.'",
        "'speaker_6': 'And the toxic chemical additives used to give them their desirable characteristics are released into the environment. Getting into our water, soil and ultimately in the food we eat. Both paper and plastic bags have negative environmental impacts. Plastic bags are made from nonrenewable.'",
        "'speaker_6': 'Natural gas, are more easily littered, will not biodegrade and pose a threat to wildlife and ecosystems. Americans currently throw away 100 billion plastic bags every year or 300 bags per person. We use these bags for just an average of 12 minutes, but they continue to persist in our environment.'",
        "'speaker_6': 'Paper bags, however, also have negative impacts. They require more water to produce, consume more energy during transport and contribute to deforestation. Reusable bags help us reduce these environmental impacts throughout the life of the bag. Denver residents pay for the litter and pollution caused by disposal bags to their tax dollars, paying for litter, cleanup on our streets, at'",
        "'speaker_6': 'our parks and open space and along our rivers. Disposable bags, clog sorting equipment and contaminate materials at recycling centers and local composting facilities, adding to processing costs and reducing the value of outputs. Placing a fee on the use of any disposable bag, paper or plastic sends a clear message that one type of bag is not better than'",
        "'speaker_6': 'the other, and that the larger problem is the use of single use disposable packaging. Bag fees are a proven strategy to significantly reduce the use of all disposable bags in other cities. 300 cities across the country have some sort of ordinance regulating disposable bags.'",
        "'speaker_6': 'A dozen of those cities are now here in Colorado. Disposable bag use in the city of Boulder decreased by 68% within the first year of its disposable bag fee. Similarly, Washington, D.C., salary reduction of over 60%. The bag fee is an important and impactful first step toward reducing plastic pollution and climate change.'",
        "'speaker_6': 'And therefore, I encourage you to support this bill. Thank you for your time.'",
        "'speaker_0': 'Thank you very much. Next up, Duane Gal.'",
        "'speaker_5': 'My name is Dwayne Gall. I've been a resident of Denver for 50 years, and plastic bags have always been one of my concerns. You've heard previously testimony from my grandson. His generation is going to be impacted by plastic and the use of plastic more than my generation.'",
        "'speaker_5': 'I would like to share an experience I recently had. I just returned from India a few weeks ago and in India they have been planning plastic bags in some of their states for over 20 years. There is a huge push now within India and legislation is being passed to ban single use plastic in the entire country.'",
        "'speaker_5': 'We saw many posters and other promotions advocating this. We had many purchases we bought in India from various sources of the smallest vendor to the bigger stores. We never received a plastic bag. We received some very creative cloth bags, other kinds of materials.'",
        "'speaker_5': 'So it's very inspiring to me to say that of a country like India, with all the struggles they have in their economy and their society can ban plastic bags, that certainly Denver ought to be able to come up with a plan.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Mohammad Khan.'",
        "'speaker_7': 'Good evening, counsel. My name is Muhammad Khan, I I'm president of Council nine and I work downtown as a Denver resident and a workforce member of Denver. I think we have a plastic problem. You. The problem with plastic is it never goes away.'",
        "'speaker_7': 'It will break down to smaller and smaller elements and exist as microplastics which exist in our water and our food and even in our body. Plastic impacts wildlife and ecosystems. Plastic bags are made from nonrenewable natural gas, and they cause a litter problem which a city residents pay for.'",
        "'speaker_7': 'On my way here from Capitol Hill, I saw four plastic bags flying in the air. Paper bags are not a good solution either. They are also meant for single use. And as Brandy said already, we average you each person use on average one bag every day.'",
        "'speaker_7': 'Having a fee is important and impactful for a step towards reducing plastic pollution and climate change. And Boulder is an example for us. Some people might believe that having this fee would not be a good suggestion. I can assure you at my company we started a program where we where we went to zero waste in two years'",
        "'speaker_7': 'just by providing activities where people were rewarded for good behaviors like reusing their bags. Please support Councilwoman Black's back fee ordinance as a key first step towards climate change that we have talked about a lot. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_5': 'James the Ku Klux Klan movement. Self-defense. Come on. Yo. Are you kidding me? I expect more creativity than charging people for plastic bags so they can get them. I'm gonna give you a living example. In the last election.'",
        "'speaker_5': 'What we did as candidates who were poor is that we went to our constituency and told them, give me, give us all your plastic bags sitting in your house. They said, What are you going to do if we put our campaign material in the bags tied to their door and used it?'",
        "'speaker_5': 'It had no value. We got the bags for free. The poor people had to be creative in what we do. Yeah. That requires creativity. Not sitting up here trying to figure out another way how to pass on taxes to poor people.'",
        "'speaker_5': 'Now, we had to charge for the bags. We can't afford to buy no bed. Well, we take the bad guys, bus it, and then we put it inside another bag. So that other bag is used to carry the groceries home.'",
        "'speaker_5': 'Especially now those who can't be walking around with these heavy bags on the books trying to get home. So this is definitely an act for the privilege and not the poor. And that's what we need to be up there.'",
        "'speaker_1': 'To think about other folks other than your own class interests.'",
        "'speaker_5': 'So I suggest you think about this. So you think about it and be creative. Learn how to take a lemon and turn it into lemonade. Because even if you pass this.'",
        "'speaker_1': 'What you gonna do with the bags? It's already here that you get out of town.'",
        "'speaker_5': 'And the corporations who give you the money to run to do this mess. No, no, no. The platter is us, is the people. And what we do with the resources that we're getting and the technology that we got because it is about the bags.'",
        "'speaker_5': 'And we need to put a fee on the bags that we need to put up big on city council so that we can eliminate government so we don't have them and then will pay you not to get up there.'",
        "'speaker_5': 'Because this is straight up bullshit.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_13': 'Jesse Pierce represented for Denver Homicide Low Black Star Action, more for self defense, positive action to Movement for Social Change as well as the Universal African People's Organization and Unity Party. Colorado. And I'll be your next mayor in 2023.'",
        "'speaker_13': 'We are in favor of this, despite the fact that it is going to affect so-called minorities and poor people of color and marginalized and poor communities. We have a crisis, as we already know about the housing, but we're being told we have a crisis with this climate change.'",
        "'speaker_13': 'Now, my question is, the planet goes under, we're still on the bottom. So how is this benefiting poor people, how this is benefiting black people, houses benefiting so-called people of color, minorities in the city? We are going to we already have enough taxes.'",
        "'speaker_13': 'We're paying we're paying for sales tax. We're paying for other taxes. We are not seeing any kind of benefit from these sales tax. We are and I can't even afford to live in the city. So you want to taxes some more, maha some plastic bags.'",
        "'speaker_13': 'My question is, is this going to pertain to oh, shoot, this is going to pertain to all grocery stores, all food chains, all places where you get plastic bags. This is Wal Mart. This is Target such as Walgreens, such as all Safeway, King Soopers, all these places.'",
        "'speaker_13': 'Is this going to be applied to every single development department store where you get these plastic bags and then are you going to replace these plastic bags with the green sustainable bags which are for reuse? You can use them multiple times.'",
        "'speaker_13': 'Those are the questions I had. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers on this item. Are there any questions from members of council? Councilman Flint.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'I have I have some questions for our city attorney and. I already set her up for them. So this will be a sort of a back and forth colloquy. I know that the Colorado Supreme Court has ruled that the bag fee in the Aspen case was a fee and not a tax in the city of Chicago.'",
        "'speaker_3': 'They just went out and went ahead and called it a tax. Knowing going into this that it is already been decided that it's a fee. I'm not going to argue that it's a tax, but I am still troubled by my own thought process.'",
        "'speaker_3': 'He's saying that this really is a tax because it's unlike any other fee tabor exempt that we have. And so I just had some questions for Christian Crawford, our counsel, to maybe walk me through the reasoning behind the Aspen decision, because when we charge every person in the checkout line, whether they're poor or rich, they charge they'",
        "'speaker_3': 'pay the same $0.10 we're paying that. The customer is not paying that to us. So it's not our fee. They're paying it to the store and then the store remits 60% of it to us. That's exactly how they do sales tax.'",
        "'speaker_3': 'That's exactly how the gas tax works. I. So why why what was the court's reasoning for saying this is not a tax? I guess what I was working up to and I didn't I didn't get to the committee and and and so but my thinking was that if we put this on the ballot, if we made a'",
        "'speaker_3': 'referral and said, can we charge a ten cent tax per bag in the city or county of Denver that would be overwhelmingly approved. And and almost all of my thoughts that this is a tax would be would be addressed.'",
        "'speaker_3': 'Kirsten, could you walk us through the court's reasoning in Aspen?'",
        "'speaker_7': 'Sure. Kirsten Crawford, Legislative counsel, I think backing up one step for everyone's benefit. As you know, in 1992, when Tabor passed, it became really important to understand the distinction between a fee and a tax, because taxes under TABOR require voter approval and fees do not.'",
        "'speaker_7': 'There is not only the case that Councilman Flynn is referring to that comes from the Supreme Court out of the city of Aspen. But there's also just a plethora of cases that talk about the difference between a regulatory charge and a tax.'",
        "'speaker_7': 'And taxes are imposed to defray the ordinary expenses of businesses, of business, of the government versus a regulatory fee has to be relate reasonably related to the to the program, not specifically limited to services that the government provides, but a regulatory program.'",
        "'speaker_7': 'So the cost of administering the program and here the predominant purpose and that's the language out of the city of Aspen case. The predominant purpose of this fee is to alter the behavior in the nature of sustainability and protecting the environment.'",
        "'speaker_7': 'And so in the case that you're referring to, the city of Aspen adopted a 20% waste reduction fee that was imposed by grocers charge to the customer. And the purpose there, when the Supreme Court analyzed it, was to change the behavior of how race reduction occurred in the city of Aspen.'",
        "'speaker_7': 'If you compare the case to our proposed ordinance, there are some similarities and we have limited and enumerated the purposes for what our portion of the fee can be used for, which is as a general proposition to reduce the use of single use plastics.'",
        "'speaker_3': 'Mm hmm. Do we require the retailers to account for because the ordinance sets up rules and a structure for the retailers. They may only use their 40% of the fee for certain things, and they must be related to the reusable bag program and customer education and setting up their systems for collecting in order.'",
        "'speaker_3': 'Do we have systems in place to ensure that Walgreen's and King Soopers and Safeway and Target and all the other entities that were mentioned are using this fee for that purpose and not for their bottom line profit.'",
        "'speaker_7': 'And since that's a little bit more policy oriented, I didn't.'",
        "'speaker_3': 'Warn you about that one, but.'",
        "'speaker_7': 'That's okay. That's okay. I'm happy to take a stab at it, but I wonder if that would be maybe better suited for the sponsors or even solid ways to answer how.'",
        "'speaker_8': 'Councilwoman Black We have met with the Department of Finance and so solid waste will be managing the program and they'll work with the Department of Finance to establish the rules and determine how we enforce that. Randy Moorman, who is here from Ego Cycle, talked about the BOULDERS program, which has been very, very effective and we'll learn a'",
        "'speaker_8': 'lot from how they've been managing it for six years now. Mm hmm.'",
        "'speaker_3': 'Okay. Charlotte. Do you have anything to add? I'm just curious how the retailers who retain 40% of this revenue will be held accountable for how they use it?'",
        "'speaker_7': 'Yeah. Charlotte Pit Solid Waste Management. My understanding is once the bill passed, will have the ability to do some rulemaking and put in some processes to look at how we audit that. I don't have an answer for you today, though, but.'",
        "'speaker_6': 'Will we'll learn.'",
        "'speaker_7': 'From some of the other communities and put something in place. Okay.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I want to thank Councilwoman Black for bringing this forward. This is really important. I think it's critical for our habitability and.'",
        "'speaker_0': 'We're still in questions. We will have time for comments. And maybe that was a fancy dressed question, but just to make sure.'",
        "'speaker_4': 'I apologize. I am getting ahead of myself.'",
        "'speaker_0': 'Okay. All right. We'll get back to you. Thank you, Gotham. And. All right. Seeing no other questions. The public hearing for Council Bill 1176 is closed. Comments by members of Council Councilwoman Black.'",
        "'speaker_8': 'Thank you, Mr. President. I I'm not sure if I supposed to give my, like, real comments tonight because we're actually voting on it next week. Tonight, we're just moving it forward. We're publishing it. So I'll have some abbreviated comments.'",
        "'speaker_8': 'But I had a couple of things I wanted to share with you. This is from a report from the United Nations. It says it's estimated that between 1 to 5 trillion plastic bags are consumed worldwide each year. 5 trillion is almost 10 million plastic bags per minute.'",
        "'speaker_8': 'If tied together, all these plastic bags could be wrapped around the world seven times every hour. So while I love it that people repurpose their bags and reuse their bags, we are not repurposing 1 trillion or 5 trillion bags.'",
        "'speaker_8': 'And so the goal is to reduce the use of the bags. Another fun fact I wanted to share with you is that in 2018, the term single use was Collier's dictionary word of the year. Because worldwide we're starting to recognize the dangers of all the single use packaging and plastics in our planet.'",
        "'speaker_8': 'And Randy had some great statistics there. They don't go away. Everything that was ever produced is still here on our planet, and much of it is getting smaller and smaller, and it actually becomes more and more dangerous the smaller it gets.'",
        "'speaker_8': 'To answer some of the questions asked by some of our speakers. It does apply to all retailers. In fact, they are supporting the bill. So it applies to your 7-Eleven, your convenience store target, J.C. Penney's. It does not apply to restaurants.'",
        "'speaker_8': 'They are all in support of it. It's been a very collaborative effort. Randy, thank you again. He helped me a lot and I drove him crazy. Debbie Ortega had a bill similar in 2013 and she's really kept the flame alive.'",
        "'speaker_8': 'And a lot of us here are supporting this tonight. I call it a bring your own bag ordinance. Some cities like Chicago or now Washington, D.C., called Skip the Bag Ordinance. Either one is okay, but the goal is to reduce the use.'",
        "'speaker_8': 'In Denver alone, about 200 million bags are used each year, and that's just in Denver. But based on what we've learned from other cities, we expect that that will decline by 70%, which is just a really big victory.'",
        "'speaker_8': 'And we will have fewer bags contaminating our compost, contaminating our recycling facilities where they jam machinery and cause costly delays and break the machinery. And we'll have less litter in our world and we will have less of those microparticles that are now being found everywhere.'",
        "'speaker_8': 'There was just a story on the news that they are have been found in icebergs in the Arctic and they're not sure how they got there. If they came in the air, they're not sure how they got there.'",
        "'speaker_8': 'But it's a it's a dangerous problem for our world. And the only way we're going to solve it is to reduce the use of single use plastics. And so this is just a first step. Thank you for everyone who supported it.'",
        "'speaker_8': 'I really, really appreciate it. And I'm excited to see how it turns out in Charlotte. I'm really excited to be working with you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Hines, did you have some comment?'",
        "'speaker_4': 'I have a couple of questions. Is now the right time? Yes. Thank you, Mr. President. I do want to again thank Councilwoman Black this time in the in the appropriate period. There's a lot of work that you've done on this on this bill.'",
        "'speaker_4': 'I think there's you know, it's one thing to accomplish something that is difficult. There is something even harder. The next step beyond that is to make it look easy. And I want to quote the Westword, who's actually quoting us.'",
        "'speaker_4': 'And and in the Westword, they said that in committee, the biggest argument that was there was a disagreement, a kerfuffle, so to speak, between president, clerk and I about whether dog poop bags are compostable. If we get to committee and the biggest issue is whether dog all dog poop bags are compostable, then Councilwoman Black, you've done a'",
        "'speaker_4': 'lot of work to make it easy. Easy for us to vote. So the vote is quite easy for me. So thank you for all your hard work.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. I just want to thank Councilwoman Black for her work in helping to bring this forward. Lots of meetings with people across the city have taken place. But the one thing I want to mention that has not been said, and I think it's important to mention, is that the money that will be collected by'",
        "'speaker_9': 'the city of Denver will be used not only for education, but to buy reusable bags and to get them distributed across the city so that people who don't already have them and most people already have multiple reusable bags because we pick them up everywhere at various events and in functions that are held where they're given away for'",
        "'speaker_9': 'free. But these will be free reusable bags that will be distributed more, make sure they're distributed through the schools and to our senior centers and to places where people may not have already picked them up. And so there should be no reason.'",
        "'speaker_9': 'And since 2013, one of the things we have done in my office is use part of my budget to purchase reusable bags. We distribute them at the mayor's cabinet, in the city meetings and other community meetings that I attend on a regular basis.'",
        "'speaker_9': 'So we have been doing that, making sure that there's no reason for people not to have more than one, you know, of their own reusable bag that they can take to the grocery store.'",
        "'speaker_12': 'Or other places.'",
        "'speaker_9': 'So thank you, Councilwoman Black, for all of your efforts in moving the needle on this. I know Councilwoman Gilmore and Councilman Clark have been part of the the meetings that we have had with different industry stakeholders and community leaders.'",
        "'speaker_9': 'And so I'm excited that we really have unanimous support across the board to move this forward.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Gilmore.'",
        "'speaker_5': 'Dog poop.'",
        "'speaker_7': 'Thank you. Councilman Clark, I want to thank Councilwoman BLOCK and Councilwoman Ortega and Councilman Clark for your partnership. Councilwoman Black and I started this journey early this year on going on tours to A-1 Organics, to the Denver and Arapahoe Facility as well.'",
        "'speaker_7': 'And really, this is just the beginning for us as a city. There's a big push for us to reduce our use of single use plastics throughout the entire city and county of Denver. And so this is one step.'",
        "'speaker_7': 'And the other thing that I think is important to know is that this goes into effect July 1st, 2020. So there is going to be an outreach and engagement and a media campaign along with it so that we make sure that all of our constituents know that this is coming and can prepare and maybe start to make'",
        "'speaker_7': 'some of those behavior changes right now. So thank you. Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. See no other comments I will just end with and because I know we have this on final reading next week, so I have some more to say then. But I just want to also say thank you to Councilman Black for your awesome leadership on this.'",
        "'speaker_0': 'Councilman Ortega for spearheading this and keep your eyes on the prize comes from Gilmore for letting me come on as a co-sponsor with all of you for those very excited about it. And I want to thank all our speakers for coming, but Nolan is still back there.'",
        "'speaker_0': 'I just want to say you're awesome. You're rock star. We need more third graders showing up and telling us what to do. And your voice is changing the world tonight. And I know you're going to continue to change the world with that voice.'",
        "'speaker_0': 'Some things are worth staying up past your bedtime for, and this is one of them. So thank you very much. And I just want to thank I heard multiple people say, including Councilwoman Gilmore just said it again, this is just the beginning and I'm excited for everything that's to come.'",
        "'speaker_0': 'So with that, we are. Madam Secretary, I think we're ready to vote. Roll Call.'",
        "'speaker_2': 'Black Eye CdeBaca I think I go more I Herndon.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Hands.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Cashmere. All right. Kenny Ortega. Hi. Sawyer Torres. Hi, Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close voting. Announce results. 1212 hours comes Bill 1176 has been published. Seen no other business before this body. This meeting is adjourned.'"
    ]
}