{
    "Extension of DSBO Program and Approval of Annual Aspirational Goals.": [
        "'speaker_0': 'No items have been called out today. Miss anything? All right. Now, Secretary, please put the first item on our screens and counsel menu. Go ahead with your question and comment. All right.'",
        "'speaker_1': 'Thank you very much. Adrina, you want to come up? This is a very important bill is coming through tonight. I just wanted to give some highlights of what's happening with the dispo in this bill, please. Thank you.'",
        "'speaker_4': 'Good evening, President. Council members. My name is Adrina Gibson and I'd like to first introduce myself. I am the new director of the Division of Small Business Opportunity. I am esteemed to have this privilege to work with the team at with the city, as well as with Dito and with you all as council members, I come to'",
        "'speaker_4': 'you all from our team working 12 years there with compliance, certification and implementing quite a bit of robust small business programs to maximize opportunities here in the city of Denver. I look forward to and have already begun in these long four weeks marrying a lot of the initiatives that I brought over from RTD, as well as bringing'",
        "'speaker_4': 'the men to the city and county of Denver under the Division of Small Business Opportunity. We appreciate your support of this bill on the second reading, just to give you a recap on what's going on within Dispo whom and I've been a part of over the last four weeks, we have regularly evaluated our success and measured our'",
        "'speaker_4': 'marketplace disparity typically at the five year mark. And so with this being the 2019, this is our year 2012. The 2016 disparity study was delivered in late 2018. As most of you know, there were some successes to note, but overall, there is still a disparity in the marketplace on public contracts for women and minority owned firms.'",
        "'speaker_4': 'And that reiterates the purpose of small business programs is specifically the one within the city and county of Denver. Under their division, DISPO has had some rigorous process of evaluations, both internally and externally, with our McKinsey reviews peak performance.'",
        "'speaker_4': 'And we've also adjusted quite a few processes, including but not limited to our certification period, our renewal period, going from every year to every three years, as well as eliminating our goal setting committee within the community. We have had an unprecedented level of public input on our ordinance and potential revisions from the Council as well as the'",
        "'speaker_4': 'Construction Empowerment Initiative Committee. This subcommittee worked very hard to prepare a roster of recommendations of which Dispo has reviewed thoroughly and has begun implementing to date. More recently, our business equity leadership team has also developed for dispo and all of the city agencies to engage on an enterprise wide with all of the programs that touch small businesses'",
        "'speaker_4': 'to maximize small business utilization and discuss important matters that relate to small businesses. Lastly, we determined our annual Mwb aspirational goals with substantial data analysis, methodology and performance history to bring together our 2018 aspirational goals. Again, thank you.'",
        "'speaker_4': 'Fourth quarter for the ordinance is set. Set the stage within the next five years and our ordinance revisions will be coming soon. Right.'",
        "'speaker_1': 'Thank you so much, Adrina. I can't speak more highly of the leadership of EDI or Caraga and having Adrina come on board and leadership that she's providing for dispo and and Jason Moore to the attorney that's really helping with the bill and helping guide that through.'",
        "'speaker_1': 'So it's a real pleasure. We you know, this is so important, this bill is because that prompt and accurate payment for all the minority women owned and small business subcontractor sorry the city construction contract so we're we were so pleased to have you you know, when we were going through this council with Cashman and we're telling you'",
        "'speaker_1': 'that we said, well, we always have a question. We always call Adrina over at RTD. What's the best practice on making this happen? And so we're so glad to have your leadership here. And and Susan's involvement as well is with the leadership of dispo.'",
        "'speaker_1': 'So thank you so much for all you're doing. And and please thank your staff to thank you.'",
        "'speaker_4': 'It's my honor. We're working hard for you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. County Menu. That concludes the items to be called out this evening. All bills for introduction are ordered published. We're now ready for the block vote on resolutions and bills on final consideration counsels council members remember that this is a consent or block vote and you will need to vote.'",
        "'speaker_0': 'Otherwise, this is your last chance to call an item for a separate vote. Councilman Brooks, would you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_2': 'All right. Mr. President, I certainly would love to do that for you tonight. I move that the resolutions be adopted and the bills on final consideration be placed and placed upon final consideration do pass in a block on the following orders.'",
        "'speaker_2': 'All series of 2019 172 173 174 175 176 177 178 179 one 8182 one 8196 one 9766 126 one 9188 189 159.'",
        "'speaker_0': 'Thank you very much, Councilman Brooks.'",
        "'speaker_2': 'Anytime, anytime.'",
        "'speaker_0': 'As far as the stand moved and seconded. Madam Secretary, roll call black.'",
        "'speaker_3': 'Hi.'",
        "'speaker_4': 'Brooks.'",
        "'speaker_1': 'Hi.'",
        "'speaker_4': 'Flynn. I Gilmore. I Herndon.'",
        "'speaker_1': 'I Cashman.'",
        "'speaker_4': 'Hi Commit. Hi, Lopez.'",
        "'speaker_1': 'Hi.'",
        "'speaker_4': 'New Ortega assessment. Mr. President.'",
        "'speaker_0': 'I am secretary. Please, because the voting announced results.'",
        "'speaker_4': 'From.'",
        "'speaker_0': '12 eyes. The resolutions have been adopted and bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 19.0055 changing the zoning classification for 4519 Pearl Street in Globeville and a required public hearing on Council Bill 19 0079 Changing the zoning classification for 901 Irving Street in Ville'"
    ],
    "Zoning Change for 4519 Pearl Street in Globeville.": [
        "'speaker_0': 'Everybody could get settled. We're going to get started. We have two public hearings this evening. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses.'",
        "'speaker_0': 'If you are here to answer questions only when your name is called, come to the podium. State your name and note that you are available for questions of council. Speakers will have 3 minutes. There is no yielding of time on the presentation monitor.'",
        "'speaker_0': 'On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Stretch your comments to council as a whole, and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilwoman Gilmore, will you please put Council Bill 55 on the floor?'",
        "'speaker_4': 'Yes, President Clark, I move.'",
        "'speaker_5': 'That council bill 19.'",
        "'speaker_4': '0055 be.'",
        "'speaker_5': 'Placed upon final consideration.'",
        "'speaker_1': 'And do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The public hearing for Council Bill 55 is open. May we have the staff report?'",
        "'speaker_7': 'Okay. Thank you very much. My name is Chandler Van Scott with Community Planning and Development. So this is for an official map amendment application number 2017 i00155 for rezoning 4519 Pearl Street from ESU B to UCB one. So the site is located in Council District nine in the Globeville neighborhood.'",
        "'speaker_7': 'It's just north of 45th Avenue. The lot size is approximately 600 or 6250 square feet or 0.14 acres. It currently contains a single unit residential use. Again, the proposal is to rezone from SB to USC to be one to allow for the addition of an 82 or accessory dwelling unit.'",
        "'speaker_7': 'So just a bit about the requested zoned district use stands for urban neighborhood context, such as single unit and B-1 refers to the minimum lot size. So the minimum zone lot area is 4500 square feet. Blocks typically have a pattern of 37 and a half foot wide lots and setbacks and lot coverage standards common eight front and'",
        "'speaker_7': 'side yard similar to UCB, but allowing a detached accessory dwelling unit building form in the rear yard. So that's what the one is. I'd go over the existing contest context quickly. So the existing zoning on the site is SUV, that's urban edge context.'",
        "'speaker_7': 'Single Unit B, the surrounding properties to the north and west are also sub to the south. You have IMX too, which is a mixed use zone district. And to the east you mix three with overlays and some industrial zoning further to the east.'",
        "'speaker_7': 'As I mentioned before, the existing land use on the site is single unit residential to the north and west. The neighborhood is primarily single unit residential as well on a variety of lot sizes, generally ranging from 3 to 6000 square feet to the south and east.'",
        "'speaker_7': 'You have a mix of commercial uses. Vehicle related uses on 45th and pearl and then some duplexes and multi-unit. Just taking a look at the existing building form and scale. The yellow dotted line is highlighting the subject property.'",
        "'speaker_7': 'That is the middle picture on the right there, the existing single unit home. And as you can see, just to the north of the site, there are more small scale one, two, one and a half storey single unit homes across the street to the east is a storage facility, which I believe is now actually completed.'",
        "'speaker_7': 'That's a slightly older picture. And then to the south, you have a liquor store and some other commercial uses. So in terms of process, the Pre-Application review for this application began in October of 2017. The applicant then conducted informal public outreach to Ana's and the council member.'",
        "'speaker_7': 'The application was submitted on February 8th, 2018. A planning board heard this item on January 9th, 2018 and voted unanimously to recommend approval. I'm sorry that I should say January 9th, 2019, as you mentioned, and literally apologies. They voted unanimously to recommend approval.'",
        "'speaker_7': 'The Land Use Transportation and Infrastructure Committee heard this item on January 28, 2019 and also voted to pass the item along to council. First reading was in February and we are now at the public hearing. So far there have not been any public comments received during the review.'",
        "'speaker_7': 'So to jump into the review criteria found in the Denver zoning code, there are five criteria. The first criterion is consistency with adopted plans. In this case, the Comprehensive Plan 2000 Blueprint, Denver, Globeville Neighborhood Plan, and the 38 template stationary height amendments all apply to this property.'",
        "'speaker_7': 'In terms of comprehensive plan strategies, staffs found there are several with which the proposal is consistent, including environmental sustainability strategy two F land use Strategy three B and Denver Legacy Strategy three A. All of these refer generally to increasing density and encouraging infill in sites where there is already existing infrastructure.'",
        "'speaker_7': 'In terms of the blueprint Denver 2000 to consistency. So the land use designation in Blueprint Denver is single unit residential that generally anticipates densities fewer than ten units per acre and an employment base significantly smaller than the housing base.'",
        "'speaker_7': 'And it anticipates single family homes being the predominant residential type. It is located within an area of stability which the goal of which is to maintain character while accommodating some new development and the future street classifications. Pearl is a local street and 45th is a collector street.'",
        "'speaker_7': 'So the Globeville neighborhood plan goes into a little bit more detail about this area. This highlights the area where the zone is located as residential neighborhood core. The vision for this is to maintain the single family residential character of the neighborhood while improving internal circulation and enhancing 45th Avenue as a neighborhood serving Main Street.'",
        "'speaker_7': 'The land use designation found in the global neighborhood plan is single family with accessory dwelling units. So this land use designation essentially anticipates the addition of 80 youths to the single family neighborhood to enable aging in place, multi-generational housing and additional income through rentals.'",
        "'speaker_7': 'Some additional strategies included in the Global Neighborhood Plan that are unique to the residential core strategy. B One mentions allowing accessory dwelling units for those benefits that I just mentioned. Strategy E1 talks about specifically updating the neighborhood context from the existing urban edge context to urban context, which this rezoning is also accomplishing.'",
        "'speaker_7': 'And then it refers or mentions tailoring minimum zone lot sizes, and specifically calls out maintaining the 4500 square foot zone lot minimum, which the request of zone district also does. In terms of the anticipated height in the global plan, you have two and a half storeys which this requested zone is well within and then the 38th and'",
        "'speaker_7': 'Blake stationary height amendments also anticipate two stories here. The zoning does allow two and a half storeys, but there is not really a two storey zone district. So we found it to be consistent. So in general, CPD finds a rezoning consistent with the Comprehensive Plan 2000 Blueprint, Denver, the Globeville Neighborhood Plan and 30 and Blake stationary Hyde'",
        "'speaker_7': 'Amendment in terms of uniformity of district regulations. The proposed rezoning to U.S. would be one would result in the uniform application of zoned district building form, use and design regulations, as there are no waivers or conditions requested and staff finds that the requested rezoning would further the public health, safety and welfare, primarily through the implementation of the'",
        "'speaker_7': 'city's adopted plans, as well as by adding to the diversity of the housing stock and your transit. So the fourth criterion is justifying circumstances. In this case, there is a city adopted plan that was adopted since the zoning was put in place.'",
        "'speaker_7': 'That's the Global Neighborhood Plan 2014. And this plan sets out a specific vision for the area that includes changing the neighborhood context from edge to urban and also allowing accessory dwelling units. And there's also significant development in Globeville and nearby Reno.'",
        "'speaker_7': 'And then finally, the fifth criterion is consistency with neighborhood context, zone, district purpose and intent. So the urban neighborhood context is primarily characterized by single and two unit residential uses. Small scale multi-unit, residential and some commercial areas are typically embedded in residential areas and single in two unit residential units are primarily located along local and residential arterial'",
        "'speaker_7': 'streets. The requested zone district for the site is consistent with that context as well as the U.S. use on district purpose, which is to allow a single unit district allowing urban houses and detached accessory dwelling units maintains a minimum zone lot area of 4500 square feet, 37 and a half foot wide.'",
        "'speaker_7': 'Lots and setbacks and coverage standards very similar to U.S. Hub. So in closing, CPD recommends approval of application number 2017 II 00155 based on finding that all the review criteria have been met. Thank you.'",
        "'speaker_0': 'Thank you very much. We have two individuals signed up to speak this evening. So when I call your name, come on up to the podium and your time will start to elapse. Our first speaker just signed up as a he.'",
        "'speaker_0': 'Am I right in guessing that that is an Elizabeth?'",
        "'speaker_1': 'Yes. Okay.'",
        "'speaker_0': 'And Elizabeth, you're up.'",
        "'speaker_6': 'Here I am without focus. Let's see what happens. I appreciate any opportunity to address the Council as a whole regarding what's going on in Globeville, because many things will be coming before the council. This is an important property and I fully support the granting of this zoning change because it is owned by a gentleman, Phil Falco, who'",
        "'speaker_6': 'really cares about the neighborhood, lives there and likes the ideas of accessory dwelling units creating more, more housing. And I would like to just kind of sensitize the council to this corner and why this is so important to be specific.'",
        "'speaker_6': 'There are single family dwelling homes all along the west side of Pearl from East 46th to East 44th. Even though there are businesses, perhaps the rest of the city will benefit from the restrictions of the self-storage around Tod.'",
        "'speaker_6': 'There's one right there, smack dab in front, one block to the south, and across the street is the angst banks driven conversation about the tiny home village that is being discussed in Globeville. It's that intersection of great stress and this exemplifies the hope to me.'",
        "'speaker_6': 'I was involved in the neighborhood planning process back yo many years ago when the conversations had to do with diversifying the income on single family properties, which increases the likelihood people can stay in place along with cottage industries and things like this.'",
        "'speaker_6': 'This is a gesture of hope. I wish there was a way to accelerate the the the and use more across the city and prioritizing. I hope that we will see more of this. I do want to encourage different language and I talked to the property owner to about in the in the when we say that it's the'",
        "'speaker_6': 'right no neighborhood is encroaching in the second to last page right now is not a neighborhood it is a very vital art district. The neighborhood historic boundaries remain beneath the art district. I would ask the city council to look at the beautiful neighborhood map that's up at Denver gov talk and memorize those boundaries.'",
        "'speaker_6': 'I support the right to art district, but we really need to embrace the organism of the neighborhoods block by block by block. I would love that self-storage to be removed at some date so that the views from this new beautiful adu etc. could be home to the reconstructed multi-use Washington Street that is the corner of the historic'",
        "'speaker_6': 'Main Street. East 45th Avenue is the historic Main Street. So I really want to thank Mr. Falco for hanging in there with these visions. He said that property for a long time and I really think this is a really excellent step.'",
        "'speaker_6': 'And I bet it's going to be beautiful, too.'",
        "'speaker_1': 'Thanks.'",
        "'speaker_0': 'Would you would you mind introducing yourself for the record?'",
        "'speaker_6': 'I'm sorry. I'm an Elizabeth and right near East 50th Avenue in Washington, in Globeville.'",
        "'speaker_0': 'Thank you very much. Sorry about that. All right. Next up, Jesse Pearce.'",
        "'speaker_8': 'Good evening. My name is Jesse Pierce. I'm represented for Denver. Homeless out loud, black star action, movement for Self-defense and Positive Action Commitment for Social Change. And I'm also an at large candidate for May 2019 Denver election. And I'm on the top of the ballot.'",
        "'speaker_8': 'We are actually in favor of this rezoning for once as a reasoning that I'm in favor of. Wow. Yes. So this neighborhood is under rampant gentrification. So to hear that there's a rezoning that's going to be actual affordable, that is great news.'",
        "'speaker_8': 'I wish more people were like Mr. Falcon and seen the need for affordable housing in the city because we are in a housing crisis. So. Mr. Falcon, my hat goes off to you as well. Thank you for this.'",
        "'speaker_8': 'And I hope that members of the council approve this. And just keep in mind that there could also potentially be a tiny home village right across the street. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of Council on this item? All right. Seeing, no question, the public hearing for Huntsville, 19 0055 is closed. Are there comments by members of council? All right.'",
        "'speaker_0': 'Seeing no comments, I'll just say thank you to a staffer for putting this word and for the robust staff report. I think it clearly meets the criteria and I'll be voting to support because of that tonight. Madam Secretary, roll call.'",
        "'speaker_4': 'Black eye.'",
        "'speaker_2': 'Brooks I.'",
        "'speaker_4': 'Espinosa. Sorry. Flynn I. Gilmer, I.'",
        "'speaker_1': 'Herndon, I agree. Cashman I.'",
        "'speaker_4': 'Can i.'",
        "'speaker_1': 'Lopez I.'",
        "'speaker_4': 'Knew. Ortega I. Assessment I. Mr. President.'"
    ],
    "Zoning Change for 901 Irving Street to Allow Accessory Dwelling Unit.": [
        "'speaker_0': 'Hi, Madam Secretary. Please close voting. Announce the results. 1212 I Council will 19 US 0055 has passed. Desmond Brooks, will you please put Council Bill 79 on the floor?'",
        "'speaker_2': 'Yes. Thank you, Mr. President. I move that council bill 79 be placed upon the upon final consideration to pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for council will 19 0079 is open. May we have the staff report?'",
        "'speaker_9': 'Thank you. Good evening. I'm Courtney Livingston with Community Planning and Development. This application is a request to rezone property at 901 Irving Street in Council District three in the Villa Park statistical neighborhood at the northwest corner of Irving and Ninth Avenue.'",
        "'speaker_9': 'The proposal to rezone two Eastside one is to allow for an accessory dwelling unit. The current district, the IS ESD and the ESU d one district allows for ADAS use sites with a 6000 square foot minimum existing zoning.'",
        "'speaker_9': 'The current subject property is zoned Eastside and the surrounding properties are also zoned Eastside. We do have a bit of Eastside one to the west starting at the alley in between King Street and Linden Court and the existing land use.'",
        "'speaker_9': 'Currently the subject property is use single use residential and there is a good abundance of single unit residential surrounding. There is some two unit and multi-unit residential interspersed to the west and north. There's also Eagleton Elementary School, just to the southwest.'",
        "'speaker_9': 'So here are some photos of the site North taken from Irving Street in the south is the view from West Ninth Avenue. These are additional photos of the surrounding contract context. The yellow arrows indicate the subject property. In terms of process, the sub, the application was noticed according to code requirements.'",
        "'speaker_9': 'The Villa Park R.A. voted to approve the rezoning and provided the form in that is attached to your staff report. Review Criteria. There are five review criteria that we review applications against for consistency. The first one is consistency with adopted plans.'",
        "'speaker_9': 'There are four adopted plans that we have that apply to this property. The Comprehensive Plan 2000 Blueprint. Denver. The Villa Park Plan and Housing Inclusive Denver. First, the Comprehensive Plan 2000 there are. That's a citywide vision and there are a number of strategies from the comprehensive plan that we found the application is consistent with.'",
        "'speaker_9': 'Secondly, we're looking at Blueprint Denver that was adopted in 2002 and sets a city wide integrated land use and transportation vision. The area is shown as having a concept. Land use of single family residential single family homes are the predominant residential types and densities are fewer than ten to use per acre.'",
        "'speaker_9': 'ADAS are recommended in Blueprint 22 in residential areas. The subject property is also in an area stability. The goal of area stability is to maintain the character while accommodating some new development in the three classifications. Both Irving and West Ninth are both on designated locals.'",
        "'speaker_9': 'Those are tailored to provide local access rather than through movements. We reviewed the rezoning application and found that was consistent with with Blueprint Denver recommendations as the addition of an 80 U provides for small scale compatible infill improvements in density and maintains the overall character of the neighborhood.'",
        "'speaker_9': 'Next, we'll move to the Villa Park plan that was adopted by council in 1991. There are various strategies to discourage development that is incompatible with the scale and quality of the neighborhood and has a housing vision of sound management and a mix of income levels in.'",
        "'speaker_9': 'Excuse me. Sorry. In rental single family homes and apartments, the proposed district helps protect residential character in the compatible low skill residential district and allows for reasonable small scale increase in density while creating additional quality housing stock, supporting affordability and contributing to a of income levels, which is consistent with the Ville Park Plan recommendations and in housing'",
        "'speaker_9': 'the inclusive Denver that was adopted in 2018. The plan recommends expanding the development of Adus as they incentivize affordable and mixed income housing and also promotes the development to use as a wealth building tool for low and moderate income homeowners.'",
        "'speaker_9': 'The proposed MAP amendment is consistent with these recommendations, as will expand the availability and allow for the development of an accessory dwelling unit. The next two criteria Uniformity of district regulations. We've reviewed the criteria, and the proposed rezoning will result in uniform application of the ESU, D1 zoned district, and it will further public health, safety and welfare'",
        "'speaker_9': ', primarily through the adoption of implementing plans. And it also recommends preserving the character of Denver's existing neighborhoods while allowing for some small scale reinvestment for justifying circumstances. There has been change in the area and the city adopted the Housing Inclusive Denver plan.'",
        "'speaker_9': 'And that plan notes the the cost of living has outpaced incomes creating affordable housing shortage. It specifically calls out the Villa Park neighborhood and notes that there's been a 30% increase in assessed property values over the last two assessment cycles, some of the highest in Denver.'",
        "'speaker_9': 'While housing affordability is a citywide challenge impacting Villa Park and other neighborhoods, there's documented increases in this neighborhood specifically, and this changing condition helps justify the rezoning to allow an ADU, which is an affordability strategy. But on top of that, there has been a lot of physical changes which also justify the rezoning for the criteria.'",
        "'speaker_9': 'Two new light rail stations on the alliance. We have the NOx indicator stations which are less than a half a mile from the subject property of the Federal Boulevard Improvement Projects. So those are the safe, the pedestrian safety improvements.'",
        "'speaker_9': 'And then in 2018 we saw the opening of Denver Parks and Recreation's Reimagined playground at Paco Sanchez Park. That's a regional scale playground, and that's less than a half a mile from the subject property. So there's been a lot of physical changes that justify this rezoning in terms of the last review criteria, consistency with neighborhood context.'",
        "'speaker_9': 'So in district perfect purpose and in statements, the subject property is in the urban edge neighborhood context. That is a mix of the urban and suburban neighborhoods. The urban edge neighborhood context consists of single and two unit residential units.'",
        "'speaker_9': 'Buildings are generally low in scale and the intent of the Eastside one district is a single unit district allowing only urban houses and detached accessory dwelling units with a minimum zone lot area of 6000 square feet. This meets that requirement.'",
        "'speaker_9': 'In conclusion, CPD recommends approval of this rezoning, finding that all review criteria have been met. Thank you.'",
        "'speaker_0': 'Thank you very much. We have three people signed up to speak this evening. First up is Ryan Parish.'",
        "'speaker_1': 'Hello. My name is Ryan British. Myself and my wife are the owners of the property and the applicants for the zoning change. Thank you very much for considering it. Didn't really have too much to say. It was more so if you guys have any specific questions.'",
        "'speaker_1': 'One thing that I will add is the ADU that if our zoning change is approved, we would be building it as a passive ADU, so it would be as environmentally friendly as possible, hopefully producing more energy than than we'd be using.'",
        "'speaker_0': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_8': 'Jesse Pierce represented for Denver Home a sellout Black Star action moment for self defense and Positive Action Commitment for Social Change now reside at Albert Brooks District of District nine, and I am at top of the ballot for at large for the May 2019 election.'",
        "'speaker_8': 'I was against this. But after further deliberation, I'm actually in favor of this rezoning for a sensible dwelling unit. We have a housing crisis, so the more homeowners can offer their spaces up for accessible dwelling units, that might actually put a dent in this crisis, since the current council does not care one bit about it.'",
        "'speaker_8': 'So we're in favor of this. Thank you.'",
        "'speaker_0': 'Thank you. And next up, Nicole Bush.'",
        "'speaker_4': 'I'm Nicole Barrish. I'm also the owner of the home with Ryan and Joanie back there. And I also don't have much to say. Just wanted to ask if you have any questions we're here to answer. Thank you.'",
        "'speaker_0': 'Thank you very much. That concludes our speakers. Are there any questions from members of Council on this one?'",
        "'speaker_1': 'Guzman-Lopez Yeah, really quick, Nicole, if you can, you can come to the microphone real quick. Are you where is the front door facing on the 80? Towards the alley or towards the, the, the street side basically.'",
        "'speaker_4': 'For the our current house. Yeah. Street side.'",
        "'speaker_1': 'Okay. So in the 80 you if you were to build the idea is that a garage conversion or are you building straight up from the ground up?'",
        "'speaker_4': 'Straight from the ground up?'",
        "'speaker_1': 'Are you is it facing the alley?'",
        "'speaker_4': 'No. So the front door would face 10/69 Street.'",
        "'speaker_1': 'Okay. And that's all I wanted to say.'",
        "'speaker_0': 'Thank you. All right. Thank you. Councilman Lopez, seeing no other questions. The public hearing for Council Bill 79 is closed. Other comments by members of Council Councilor Lopez.'",
        "'speaker_1': 'Thank you, Mr. President. You know, this is a this is an area where, to be quite honest, a lot of abuse exists without proper zoning or designation. And there some of them are some of are there because they are converted garages.'",
        "'speaker_1': 'This area in 2010 when we did the citywide rezoning was an area that I think in some places was are two, in some places are one. And in when we had the conversations in a community. Sorry. What do you know about Notorious B.I.G.'",
        "'speaker_1': 'Just kidding. I don't like it. I've seen it in the. In this area. It's an area that I think a lot of folks have really been looking at. Designating free to use, as a matter of fact. The old ah.'",
        "'speaker_1': 'The old ah. One area is adu accessible. There's a lot of places where it kind of cuts in. And now in the more and more we have conversations with folks in the neighborhood, these are lots that are pretty big.'",
        "'speaker_1': 'These are homes that are relatively small for the main the main home. And then and they do make sense. So it's unfortunate that you had to come to council to actually reason for the to you and hopefully with with a new update.'",
        "'speaker_1': 'And this is something that we've been considering in the new update and folks have been chiming in and I hope you all do the same thing, is that throughout these areas that are just within a stone throws distance to each light rail station on Federal Boulevard in Knox cor even on a Perry in some of these areas'",
        "'speaker_1': 'and be a park they should all be if there's enough space on the property they should all be of use or at least eligible for a to use. So and that's another way to create affordable housing, right? So with that, I mean, I, I don't see why we would oppose this.'",
        "'speaker_1': 'It, it meets all the criteria. It's so close to the, to the area. And also it's my neighborhood, too. So it I drive it every single day. I'm very familiar.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Councilman Brooks.'",
        "'speaker_2': 'Yeah. I think this meets all the criteria and I'll be supporting it. I just want to make a couple statements real quick. Number one, it's amazing to have your young child in here. So even though they're crying, I just think it's awesome to have young constituents to a to use are incredibly important cities are doing innovative initiatives'",
        "'speaker_2': 'like waiving tap fees CPD you know to make it easier for residents to build a to use for an incentive to offer a matter of affordable price. And so I think we need to do much more as a city.'",
        "'speaker_2': 'It's really interesting reading other what other cities are doing all over the country to make it incentive based to do this. But I think we also need to be careful because we don't want all of our aid used to be short term rentals, right?'",
        "'speaker_2': 'We do want them to be used at an affordable level. And so really glad that you guys are doing this. And I guess this is more of a signal to CBD that, you know, I want to work with you all on.'",
        "'speaker_2': 'I want to see some innovative steps for us to allow this to be done. There are many people in my district and throughout the city who pay a lot of money to get an ADU, and most people don't do it because there's so many hoops to jump through.'",
        "'speaker_2': 'So I'll be supporting this. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_5': 'Mr. President, I think we have a new community activist in the room, and I didn't hear her crying. I heard her wanting to make sure her voice was being heard. Right. So that's what I heard her chiming in saying, yes, we need this for my neighbor.'",
        "'speaker_5': 'Anyway, I just want to say that we are hearing this conversation all across the city, not just in one community, about the the desire to have the opportunity where a lot has the space and can accommodate an additional attached dwelling unit to be able to do that.'",
        "'speaker_5': 'We have lots of families in our city where, you know, people are doubling and tripling up in terms of family size. You got three generations living in one household, number one, because of the cost. And number two, just a lot of it's very cultural and it's a way for people to be able to afford to live close'",
        "'speaker_5': 'together. You know, it's a great way to make sure you've got your support system close by, especially when you have small children. I know my mom lived close to me when I was raising my daughter as a single mom, and I couldn't have done it without her.'",
        "'speaker_5': 'So I think that the more we can look at this word, they're not having to be brought forward as a one off in every, you know, location. It gets very costly. But where we can look at doing this across the board and and look at where that need exists, I think we should be doing that.'",
        "'speaker_5': 'And. Working with our planning department to make that happen. So I'll be supporting this tonight. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Ortega. Councilman Cashman.'",
        "'speaker_1': 'Thank you, Mr. President, on this. I had to smile this morning when I was going over these hearings for tonight's theme to accessory dwelling units. On the same night in two different neighborhoods and just had to take the opportunity to bring up the name of your constituent, your late constituent, my friend Bob Sperling, who was a community'",
        "'speaker_1': 'activist who for years was screaming into the darkness about the importance of aid use in Denver and couldn't get an ear. And I firmly believe he was played an important role in the fact that your family will have the opportunity to to build that atyou you as with Mr. Falco who before.'",
        "'speaker_1': 'So I just wanted to say how happy I am I think to use one sided properly are as such a critical part of us answering the housing crisis in Denver. So I'll be looking forward to voting I on this one.'",
        "'speaker_0': 'Thank you, Councilman Cashman. And you're right, a great night to remember Bob Sperling, who is well ahead of the curve on this and many things. So with that, Madam Secretary, roll call on Council Bill 19 0079.'",
        "'speaker_1': 'Lopez Hi.'",
        "'speaker_4': 'Black Eye.'",
        "'speaker_1': 'Brooks Hi. Flynn Hi.'",
        "'speaker_4': 'Gilmore I heard it.'",
        "'speaker_1': 'Hi.'",
        "'speaker_4': 'Cashman. Hi. Can each. I knew Ortega by assessment. All right. Mr. President.'",
        "'speaker_0': 'I am secretary. Please close the voting. Announce the results.'",
        "'speaker_4': '12 hours, 12 hours.'",
        "'speaker_0': 'Council Bill 19 0079 has passed. On Monday, April 15th, 2019, Council will hold a required public hearing on Council Bill 19 0183 Changing the zoning classification for 2280 South Bannock Street in Overland and a required public hearing on Council Bill 19 0187 Changing the zoning classification for 3220 Shoshone Street in Highland.'"
    ]
}