{
    "Proclamation for National Preparedness Month and Day of Action and David E. Cook.": [
        "'speaker_6': 'Proclamation 14 795 recognizing National Preparedness Month and National Day of National Day of Action on September 30th, 2014, and recognizing David Cook for being an honorable mention community preparedness hero as part of FEMA's 2014 Community Preparedness Awards. Whereas, National Preparedness Month is a nationwide community based campaign to increase emergency preparedness across the United States to help ensure'",
        "'speaker_6': 'that our homes, workplaces, schools, houses of worship and community based organizations are prepared for disaster events, helping to reduce fatalities and economic devastation following a major crisis. And. WHEREAS, National Days of action are set to encourage participation in drills, exercises, discussions to build community resiliency.'",
        "'speaker_6': 'And the second National Day of Action for 2014 will be held on September 30th. And. WHEREAS, Denver's Office of Emergency Management and Homeland Security encourages Denver employees, residents, neighborhood associations, businesses and community organizations to participate in preparedness activity during this month, during the month of September, and to sign up for Denver's Emergency Response Training, otherwise known as'",
        "'speaker_6': 'CERT offered monthly at. W w w denver gov dawg backslash oem. And where. And these are free, by the way. Whereas OEM Homeland Security also encourages people with disabilities and their caregivers and people with. Spanish as their primary language to sign up for special offerings in September and October of the Denver Community Emergency Response Training Class to'",
        "'speaker_6': 'meet their specific needs. At again the Denver website. Denver gov dawg backslash OEM. And. WHEREAS, on September 8th, 2014, FEMA, the Federal Emergency Management Agency, announced that Denver Cert volunteer David E Cook has received an honorable mention Community Preparedness Hero Award as part of FEMA's 2014 Community Preparedness Awards.'",
        "'speaker_6': 'By serving the Denver community as a trainer, facilitator and exercise coordinator. Training more than 4000 people over the last several years and volunteering in numerous emergency events and exercises, including the 2013 Colorado floods. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Council hereby recognizes National Preparedness Month'",
        "'speaker_6': ', Denver's Day of Action in David Cook and encourages Denver residents to join millions of Americans in learning and preparing the steps necessary to stay safe before, during and after a disaster. Section two that the clerk of the city and county of Denver shall attest.'",
        "'speaker_6': 'And a fix the seal of the city and county of Denver to this proclamation and transmit it to the Denver Office of Emergency Management and Homeland Security.'",
        "'speaker_2': 'Thank you, Councilwoman. In taking your motion to adopt.'",
        "'speaker_6': 'Mr. President, I move for the adoption of Proclamation 795 Series 2014.'",
        "'speaker_2': 'It has been moved and seconded comments from members of Council. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you. I don't know how many of you have actually done one of these trainings. If you have not, I would strongly encourage you to do this. I did mine, I think about two or three years ago, and the information that you learn from this is so vital to your family and your workplace, being able to just'",
        "'speaker_6': 'take care of yourself and not wait for the emergency responders because they're at the epicenter of where the disaster has occurred. And so it's going to be a while before they come to take care of you. So as prepared as we can have our entire Denver community, we will be so much better off.'",
        "'speaker_6': 'And I just want to commend our Office of Emergency Management and all of the volunteers. I know that Mr. Cook is one of many different volunteers and trainers that do this day in and day out to ensure that we have a safe community in Denver.'",
        "'speaker_6': 'And I want to congratulate you on your award and just strongly encourage that my colleagues adopt this proclamation and continue to get the word out to all sectors of our community about how vital this training is. You know, one of the issues that we've been raising is the the issue of railroad safety.'",
        "'speaker_6': 'And when you look at some of the incidents that we've seen occur, not only in this country, but in Canada, where a rail incident wiped out an entire community on a on a weekend night, it becomes real when it gets closer to home.'",
        "'speaker_6': 'And so for the work that you guys do at OEM and the volunteers that provide this service to our community, I want to say thank you and appreciate that. It's something that continues to happen and just reiterate that this training is free to our community.'",
        "'speaker_6': 'So please, for those of you listening, take advantage of it. Your family may depend on it at some point in time. So thank you, Mr. President.'",
        "'speaker_2': 'Thank you. Councilwoman Ortega, do we have any other comments from members of council? Seen on Madam Secretary, roll call.'",
        "'speaker_5': 'ORTEGA Hi, Rob Shepherd. SUSMAN Hi, Brooks Brown. I fights. I. And carnage. Lehman I. LOPEZ All right. Monteiro Nevett. Hi, Rob. Mr. President.'",
        "'speaker_2': 'So I.'",
        "'speaker_5': 'Oh, I'm sorry.'",
        "'speaker_2': 'Robin Brown, the perhaps not. All right, Madam Secretary, please close the venue, announce the results. 3939 is proclamation 795 has been adopted. Councilman Ortega, anyone you want to call up to the podium? That's already there.'",
        "'speaker_7': 'Sir.'",
        "'speaker_6': 'We are joined tonight by Pat from our Office of Emergency Management. And I'm sorry, Pat, I'm forgetting your last name. Pat Williams and Mr. David Cook. So, Pat, would you like to start off? I guess we just wanted to stand up front here at all, but thank you.'",
        "'speaker_6': 'Thank you very much for prompting us to do this again. It is very, very important that we all take some kind of action this month. We just ask you to do one simple thing, whether that's just going and making sure you have phone numbers of the people that you love in your in your cell phone.'",
        "'speaker_6': 'It can be just as simple as that. And I would like to express my thanks to Dave. Dave puts in a lot of volunteer hours for our organization, and we can't do it without the volunteers, and we can't do it without people like him.'",
        "'speaker_6': 'So thank you. Appreciate it. Dave, would you like to make any comments?'",
        "'speaker_7': 'Sure.'",
        "'speaker_6': 'If you can lift the mic up so we can. There you go.'",
        "'speaker_3': 'There you go. Certainly am humble. Having this proclamation as well as the award that was given, certainly could not have done it by myself. We have tremendous support with with the city county in Denver, with the Office in Emergency Management, but also the volunteers that we have, you know, supporting us as well.'",
        "'speaker_3': 'You know, one of the things that still sticks in my mind is the volunteers that we had to help out with the Red Cross there and their communication needs during the flood of last year. One third of the volunteers that was there helping the communications in the in the Red Cross were in the access and functional needs'",
        "'speaker_3': 'category. Those folks with wheelchairs, crutches and other disabilities, they wheeled right up and went elbow to elbow with all the rest of us healthy individuals and supplied a need to the Red Cross drivers that they were trying to navigate the roads that were washed out or blocked off.'",
        "'speaker_3': 'And so I am certainly am humbled and energized the fact that we have tremendous support in our training and in this organization. And thank you all so very much.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_2': 'All. Thank you both. And thank you, Councilwoman Ortega, for bringing this forward. We are on to the resolutions. Madam Secretary, would you please read the resolutions.'",
        "'speaker_5': 'From business development? 690 resolution approving the mayor's report and Lowry Redevelopment Authority Board of Directors from Safety and Well-Being 703 Resolution for the Mayor's Appointment to the Denver Gay Lesbian, Bisexual, Transgender Commission and 794 Resolution authorizing approving spend European friendly appropriation account designated liability claims sum of $42,253.61 for the city and county of Denver on behalf of'"
    ],
    "Ordinance to Align Marijuana Growing Limitations with Zoning Regulations.": [
        "'speaker_2': 'It has been moved. And second, the public hearing for Council Bill 610 is open. May we have the staff report?'",
        "'speaker_6': 'Good evening, Councilor Tina, Axel Rev, Community Planning and Development. This Council bill is pretty straightforward. We are going to try to put on the same playing field properties in the city of Denver that have zoning under our old code with properties that are zoned under the new code.'",
        "'speaker_6': 'We just want to apply the same rules consistently throughout the city on what in how you can grow marijuana at home for personal use. Jeannie Ras Councilwoman Jamie Robb is the ordinance sponsor. We've worked closely together with the councilwoman at KPD and with the city attorney's office to bring this bill before you.'",
        "'speaker_6': 'We have provided early notification to R.A. through posting on our website and through notice notifications throughout this public adoption process. The Denver Planning Board considered this ordinance request on July 16th and voted 10 to 0 to recommend approval to the City Council at this bill.'",
        "'speaker_6': 'Currently, we have in place in the City of Denver some standards for growing marijuana at home under the Colorado Constitution. These were adopted in 2013 and they are summarized on this slide. Generally, you're allowed to grow no more than six plants per adult and no more than 12 plants per total per household.'",
        "'speaker_6': 'Any marijuana grown at home must be grown in a completely enclosed structure. You cannot use common areas if you live in an apartment building or condo building. That marijuana that you do grow at home is only for personal use and cannot be resold or distributed otherwise offsite.'",
        "'speaker_6': 'And the key thing here is that these limited limitations apply only to residential properties with Denver zoning code zoning. Examples of those codes are shown above. The challenge is that inadvertently we did not think because we've got two codes and we often forget that we have two codes in the city of Denver.'",
        "'speaker_6': 'At the time we adopted these in 2013, we didn't extend the same limitations to residential properties with all codes zoning. Those are the are one or twos or twenties with waivers or pads with residential units in them. So what we have is a very unlevel playing field as far as the rules go.'",
        "'speaker_6': 'If you're in one of these homes under an old code zoning, you would still be limited by state law to no more than six plants per adult, but you'd have no similar limit on the total number of plants per household.'",
        "'speaker_6': 'In other words, it could be more than 12 plants, and there's no similar prohibition on growing marijuana outdoors. Some of the words you might be able to have it outdoors if you could grow it inside a lock fence enclosure.'",
        "'speaker_6': 'But that's all that the state law and constitution require doesn't require to be moved inside. Just at a glance. Here's a map showing you where we have all codes zoning today in the city of Denver. Everything you see colored is an old code zoning district mapped.'",
        "'speaker_6': 'Now, this includes all land uses, but it's approximately it's over 16,000 acres of land in the city that have all code zoning. In terms of the number of homes or residences in play, it's about 20%. Our best estimate of all the residential units in the city of Denver are still under old code zoning.'",
        "'speaker_6': 'So this does affect quite a few homes in the city of Denver. So the proposed change is simply to amend the city's municipal code. This is an amendment to the Denver revised municipal code, not to the new code, because that's not going to help us reach or code zone land.'",
        "'speaker_6': 'And we'll simply state the gardens are allowed as accessory to a home use and that if you have a garden with your home and you want to grow marijuana, that's allowed. But it's going to be subject to the same limitations in the new Denver zoning code.'",
        "'speaker_6': 'And it just point you to that direction to say, do that. This is the proposed language. I won't linger here, but that's what you'll see in your touch red line and what's in the ordinance before you. And then our review criteria generally is spelled out in more detail in the staff report.'",
        "'speaker_6': 'Staff has has conducted its analysis and has found that the amendment is consistent with the city's adopted plans, that the amendment will further public health, safety and general welfare and will result in regulations that are uniform in each zone district throughout the city.'",
        "'speaker_6': 'Whether your old code or new code zoned so upon two are finding that we that the that this ordinance meets the criteria we're recommending to you tonight that you approve the text amendment. Thank you.'",
        "'speaker_2': 'Thank you. Thank you. Tina. We have one individual signed up to speak today. And Mr. Texter, you may come on up and speak when you're ready.'",
        "'speaker_3': 'Thad, Texas 4535. Julian Street, Denver, Colorado. I was pleased to learn last Monday that because of your actions, Billy the Elephant and all the other animals at the zoo will have plenty to eat this winter and a warm place to sleep.'",
        "'speaker_3': 'No elephants will be dying in our alleys or by our rivers. It's too bad the same cannot be said of our homeless citizens. I guess this means that Denver must be thought of as a city that thinks more of its pachyderms than its people.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you, Mr. Jackson. All right. We are on to questions. Any questions from members of council? Councilwoman Fox.'",
        "'speaker_9': 'Thank you, Mr. President. A question, please. When I saw the word garden as it relates to marijuana and I heard that the discussion of garden I'd like for you for people at home to mention whether we are talking about outdoor flourishing gardens.'",
        "'speaker_6': 'A garden as accessory to a home. Your home, for example, could be outdoors, and many of them are and maybe most of them are that we see around our neighborhoods. But it could also be enclosed inside a greenhouse that would be considered a necessary garden as well.'",
        "'speaker_6': 'And in fact, if you want to grow marijuana, you've got to it's got to be completely enclosed. So either you're going to have it inside your your greenhouse or inside your house like a container garden in your basement under lights.'",
        "'speaker_9': 'That was the clarification I was looking for because I don't want people hearing this and then immediately planting right along beside their lettuce. Right. Marijuana doesn't work that way, folks.'",
        "'speaker_6': 'Completely enclosed for four walls on a roof.'",
        "'speaker_2': 'Thank you, Councilwoman Fox. Councilwoman Robb.'",
        "'speaker_5': 'Thank you, Mr. President. And this is sort of a clarifying question, Tina, on a technicality, I guess, but we are amending our municipal code so that this applies to the old code. So really see if I've got this right.'",
        "'speaker_5': 'We are amending sort of the enactment ordinance when we put the new code in place that told how we were going to transition between old and new and what things still applied and what changed.'",
        "'speaker_6': 'That's correct.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Robb. Councilman Lopez.'",
        "'speaker_7': 'I'm sorry. I actually had a comment, so I'll hold on to the comments.'",
        "'speaker_2': 'Okay, great. Any other questions from members of the council? And seen none. The public hearing is closed for counsel ten. Now we're on to comments from members of Council Councilwoman Robb.'",
        "'speaker_5': 'Thank you, Mr. President. I became aware of the need to make this change partially through conversations with the police. Although this is not a criminal act to grow more than 12 plants at your home, but rather is enforced through zoning in the administrative but in from both the police.'",
        "'speaker_5': 'In our in is inspectors a neighbor might call and complain about another neighbor growing an excessive amount of marijuana. And it's easy to say, oh, no, we don't allow that in our code. And then lo and behold, look and see that no in that house next to yours, because it may be a different PD than the one'",
        "'speaker_5': 'your house is in or just across the street, a different zone district that's under the old code. Yes, indeed. That neighbor has that right. So I think this is an important housekeeping measure to take so that the enforcement is clear to the enforcers as well as the people who are being enforced upon.'",
        "'speaker_5': 'Is that the right verbiage? I think it's really significant to look at the map that Tina brought tonight because 20% of the city's a significant part of the city. And if you look at that map, you do see how irregular the placement is.'",
        "'speaker_5': 'So it takes more than just a good guess about where our past measures apply and where the current. Yeah. And where it now it'll cover the whole area. So I urge my colleagues to support this. Thank you.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. I just I wondered why that Basil grown in the side of my house tasted funky and then my mouth really numb. No, I'm just kidding. Now I just miss. And I. I do think this is a smart catch and I am very supportive.'",
        "'speaker_7': 'I know that there was a lot of confusion in our district around that around this amendment. And I think this clears it up. I, too, got communication from the police department about this. So it's going to be good.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman Lopez, any other comments from members of council? Scene. Madam Secretary, roll call.'",
        "'speaker_5': 'Rob Shepherd I Susman I Brooks high brown i fats I can eat lemon high Lopez Monteiro I Nevitt. Hi, Ortega. Hi, Mr. President.'",
        "'speaker_2': 'Hi, Madam Secretary. Please close the vote. And now the results. 3930 916 has been placed upon final consideration and and does pass. All right. We are ready for the second public hearing, which is on Council Bill 665. Councilwoman Sussman, will you please put six, six, five on the floor?'"
    ],
    "Designation of 227 South Lincoln Street as a Preservation Structure.": [
        "'speaker_8': 'Thank you, Mr. President. I move that council bill six, six, five be placed upon final consideration and do pass.'",
        "'speaker_2': 'Has been moved and seconded. Public hearing four, six, six, five is now open. May we have the staff report?'",
        "'speaker_6': 'Savannah Jamison Community Planning and Development for the designation of 2 to 7 South Lincoln Street, the Glover Lynch House. The applicants are Terry and Gulliver. Gulliver and Nita Lynch, who are also the owners. This was brought forward by the owners and they diligently completed the application and did the research necessary for this designation.'",
        "'speaker_6': 'This may be a home that a lot of you are familiar with, as it does on the main thoroughfare to downtown Denver on South Lincoln. It is in the council district, number seven in the spear neighborhood, although it does border very closely the Baker neighborhood, as well as Walsh Park West.'",
        "'speaker_6': 'So it's in the little corner right there. And it is just for their property and their lot. Staff has reviewed this, as has the Landmark Preservation Commission at their public hearing and found that the application is complete and it meets criteria and two out of three categories.'",
        "'speaker_6': 'It is a distinctive queen and home designed by the prominent Denver architect William Leong. The home is recognizable from its prominent location on Lincoln Street and the West Washington Park neighborhood. Reconnaissance survey and history report listed the home as having architectural significance.'",
        "'speaker_6': '2 to 7 South Lincoln Street meets the criteria for local designation in the following categories architecture to a embodying a distinguishing characteristic of an architectural style or type. This is almost classic textbook Queen Anne, and it's a regular form.'",
        "'speaker_6': 'Has the asymmetrical facade that you can see here, very distinguishing front and prominent front turret turret and a stiff steeply pitched roof also meets criteria. To be is a significant work of a recognized architect. This is the work of William Lang, it says so in the building permits, as are eight other homes along this street, which is'",
        "'speaker_6': 'very rare. We have very few places where we have that many homes all together. By one architect. He was a prominent Denver architect from 1887 to 1895, and he was a partner in the firm Lang and Pew. He mostly did commercial as well as domestic and is mostly that eclectic styles.'",
        "'speaker_6': 'This is why it's unique that we have one where it's such a prominent just one style rather than a bunch of eclectic styles. Together by William Lang also meets Criteria three A having a prominent location or being established, familiar and orienting visual feature of the contemporary city.'",
        "'speaker_6': 'Many of us see it as an orienting feature. As you drive through the thoroughfare of Lincoln Street to downtown Denver, sense of public outreach went to the Landmark Preservation Commission before a public hearing, and the Landmark Preservation Commission voted unanimously to for the City Council with the recommendation of approval, also reached out to the registered neighborhood organizations'",
        "'speaker_6': 'within 200 feet and received a letter of support from the West Washington Park Neighborhood Association. Community Planning and Development and the Landmark Preservation Commission are recommending approval as application is complete and the House meets criteria for designation, meeting criteria and architecture and geography.'",
        "'speaker_2': 'Thank you, Ms. James. And we have three speakers signed up today and I'm say all three names and you all can come to the front pew Anita Lynch, Gertrude Grant and John Paulson. So you can make your way up to the beginning.'",
        "'speaker_2': 'Pew and Anita Lynch can go ahead and start whenever you are ready.'",
        "'speaker_8': 'Council Members My name is Anita Lynch and I own and live at 227 South Lincoln along with Terry Gulliver. And we thank you for this opportunity to submit this application and to preserve this gem of a house. It was totally refurbished about three years ago, and the integrity is there definitely on the outside and much of it'",
        "'speaker_8': 'is retained on the inside. And it has some interesting history. I did a lot of research on the people who lived there, and one of the families was the Nicolet family. Who? They lived there the longest. If you get a chance to ever read some of the history, it's kind of fun.'",
        "'speaker_8': 'And I think it's interesting as we talk about marijuana today, they were there during prohibition and we learned that they were involved in a little bit of bootlegging. So there's some real fun history from this. So we thank you and we hope you will be in support of it.'",
        "'speaker_2': 'Thank you, Miss Lynch. Gertrude Grant.'",
        "'speaker_9': 'Good evening, members of Council. My name is Gertrude Grant. I live at 224 South Lincoln, and I'm here in support of this designation. I moved into my house in 1977, and ever since then I've looked across the street at the row of Lange houses.'",
        "'speaker_9': 'I didn't know they were lying. I just thought they had cool little turrets and I thought it would be neat if they could be saved. But I wasn't willing to undertake it because I had undertaken a bigger house with a lot more problems than any of those houses have.'",
        "'speaker_9': 'But it's just really exciting. Over the 20, 30, 40 years that I've lived there, to see the houses across the street be cared for and have people who really care about preserving the historical character. And some of Denver's history.'",
        "'speaker_9': 'And I hope you will vote for this or this council bill.'",
        "'speaker_2': 'Thank you. Ms.. Grant Olsen.'",
        "'speaker_3': 'Thank you very much. My name is John. Also, I'm the director of preservation programs at Historic Denver. We're at 1420 Ogden Street. I'm very much in support of this designation. I first became in contact with with Nita and Terry when they were asking, along with other their neighbors about this block on 200 South Lincoln Street.'",
        "'speaker_3': 'They're not ready for a designation at this time. But I was very proud of Terry Anita going forward with a designation for their house, partly, of course, because it is a wonderful block. It has all of these wonderful William Lang buildings on them.'",
        "'speaker_3': 'Historic Denver has a great affinity for the architect, William Lang, as we are an owner of one of his more prominent and well-known one being the Molly Brown House at 1340, Pennsylvania. But as was mentioned in the staff report, this was when we were starting to do the research of this block of South Lincoln.'",
        "'speaker_3': 'We were very surprised ourselves to find out that there was this much concentration of William Lang buildings all together. He was very prolific architect, but he generally did buildings spaced apart all over the city and again in a very eclectic style.'",
        "'speaker_3': 'So this is a very rare case. We are also very proud of Anita and Terry for doing this, because designation, especially as a homeowner, is one of the most direct and long lasting things that we can do for our built environment here in Denver.'",
        "'speaker_3': 'And I think it really adds to the vibrancy and the richness that we have as an architectural climate here in Denver with that mixture of the old and new. So we're going to have this building for many, many years to come and hopefully they will be owners of that property for many years to come, but also for'",
        "'speaker_3': 'subsequent owners of that building and that block. So we think it's a great thing for you to vote for the designation of this property and add to the richness of Denver. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Olson. That concludes our speakers. So it's now time for questions from members of Council. Councilwoman Sheppard.'",
        "'speaker_5': 'Thank you, Mr. President. So I may have asked this question before. And John, I think you just alluded to this, but it would have been a nice block, too, to seek historic designation for the whole block. But why was that not there?'",
        "'speaker_3': 'Were there still some questions from the neighbors and homeowners about what designation means for their area? And so, you know, that's something that still has to play out. And we're still talking to the neighbors about if they want, that.'",
        "'speaker_3': 'They certainly are eligible for that for that block, because it is a great concentration, not only on the west side of the William Lang Properties, but also on the east side for some wonderful high end Queen Anne buildings.'",
        "'speaker_3': 'But it just wasn't the right time for them to go forward with a full designation. And because these these properties on this block are very significant in their own right, it was a definite option that Anita and Terry could go forward with the designation on their own.'",
        "'speaker_3': 'And they decided to do so not only because they wanted to save their own property, but also because they wanted to show their neighbors that, you know, it can be a wonderful thing for them.'",
        "'speaker_5': 'Since we have the ability to take a little bit of advantage of, you know, being on television. What might be some of the benefits to homeowners seeking a historic designation, say such in the way of tax credits or other things like that that might you know.'",
        "'speaker_3': 'Certainly, yeah. There's a there's a 20% tax credit for individual homeowners for any properties that are eligible or on a local or national or state register. And so the 20% tax credit is something that a lot of people actually aren't taking advantage of.'",
        "'speaker_3': 'But we're hopeful that more people will become aware of that the 20%. Tax credit allows for you to do investment into your properties for all kinds of different things. That's much more than just taking care of what people traditionally think of as, you know, historic elements of the property.'",
        "'speaker_3': 'It's also things like fax systems, plumbing, electrical things that make historic buildings livable are all eligible for tax credits. And that's a direct credit, not a deduction that you can take on your individual state taxes for that year and you can actually push it up for ten years.'",
        "'speaker_3': 'So whatever investment you put on your property, 20% of that comes off of your liability for your state taxes. There's also a much research that was done to show that property values actually go up at a greater rate, either from individual designations or from historic districts than do properties that are not historically designated.'",
        "'speaker_3': 'It's a something that allows for the stability of the real estate prices. And so historic designation has always shown to sell very, very well.'",
        "'speaker_5': 'And if I might ask one more clarifying question, the 20% tax credit that you referred to, is that also two contributing structures in the historic district, or does that need to be something that each individual homeowner applies for that historic designation individually?'",
        "'speaker_3': 'No, it's it does refer also to contributing buildings in historic districts. So if you are a contributing building in a historic district, you are eligible for that 20% tax credit. And that's something that can be handled through the Landmark Preservation Commission.'",
        "'speaker_3': 'And so you can put an application forward for tax credits and you can certainly talk with their staff about that as well as there's staff available at the State Historic Preservation Office, otherwise known as History Colorado, which you can find out all about what benefits the tax credits are for your property.'",
        "'speaker_5': 'Thank you so much. And in full disclosure, I own a property in a district, a district that is in desperate need of some help. So thank you.'",
        "'speaker_3': 'No problem.'",
        "'speaker_2': 'Thank you. Councilwoman Sheppard, any other questions from members of council? And seen nonpublic 39665 is closed time for comments from members of council. Councilman Nevett.'",
        "'speaker_3': 'Thank you, Mr. President. I'm happy to see this this historic designation come forward. I'm happy to see you guys stuck to your guns after the attempt at the historic district. You're doing your own house. So Team Gulliver Lynch is to be to be commended for for for bringing this forward.'",
        "'speaker_3': 'And it it make I bet it comes as a surprise to some people that there are these beautiful old queen ends on Lincoln. We don't think of, you know, sort of, you know, the Denver's finest buildings being right on a busy thoroughfare.'",
        "'speaker_3': 'And it's sort of one of the tempers of our car focus built environment that, you know, you want the the the nice houses to be away from the thoroughfare. But back in the day, they built those nice houses there because they were on the thoroughfare.'",
        "'speaker_3': 'They were there to be seen as people moved at a more stately pace than we do today. And so it's nice to have these buildings, which many people whiz by on their way to downtown from I 25, and now they're being called out.'",
        "'speaker_0': 'So thank you for.'",
        "'speaker_2': 'Thank you, Councilman. Councilwoman Sheppard.'",
        "'speaker_5': 'Yeah, I'd like to say a few words. So, you know, there's a tremendous amount of development happening all across this city. And there's a deep concern among many residents how we may be losing the character of our neighborhoods.'",
        "'speaker_5': 'And sort of the expression I hear over and over is killing the goose that laid the golden egg. And I just want to put it out there that folks it's for folks to understand that this is another tool in the toolbox for not only preservation of individual homes, but of neighborhoods.'",
        "'speaker_5': 'You know, if you do the proper research and have the proper input from neighbors and in the supporting evidence. And the other thing that is so interesting about that process is actually learning the history of your home and of your neighborhood.'",
        "'speaker_5': 'And I, I live in a small, historic district called Witter Coalfield in northwest Denver. It's three blocks by three blocks. But fortunately, my neighbors in the summertime, in the 1980s, went through the process for historic designation, and then they created a book about it that every one of us that who has a controlling structure in that district'",
        "'speaker_5': 'owns. And I cannot tell you the amount of joy, you know, that we get reading through that and, you know, learning about the old, you know, interesting characters that, you know, used to listen live in our neighborhood and who, you know, who visited and what, you know, terrible loss of fortunes befell some and, you know, some of'",
        "'speaker_5': 'the rags to riches stories. And it's just fascinating. And I think it really it really adds to the quality of our life today to have this kind of understanding of, you know, where we come from. So I just want to make it clear to folks that are listening that this is another tool in the toolbox, you know'",
        "'speaker_5': ', for that very important historic preservation, especially in the face of such a, you know, such a rapid pace of redevelopment in our city today. So thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Sheppard. Councilwoman Ortega.'",
        "'speaker_6': 'I just want to add my thoughts as well. I want to commend folks in the neighborhood for working on this effort to sorry to hear that the actual district did not move forward. And I don't know if those efforts are still underway or not.'",
        "'speaker_6': 'But as we have seen development activity across the city, in my own neighborhood, the Highlands neighborhood, part of that community was created as a historic district a number of years ago under Councilman Sal Carpio. And. The development is not impacting the historic part of the neighborhood.'",
        "'speaker_6': 'It's impacting the area below that. So it's the lower highlands neighborhood. So it helps preserve the character of our neighborhoods because when it's all just open for, you know, the free market, if you will, you start to see drastic changes to the character of a community.'",
        "'speaker_6': 'And it changes the demographics, you know, the socioeconomic makeup of the community. And so by being able to create a of that kind of stability, it just, I think, preserves a lot of the quality that we have in our city of Denver.'",
        "'speaker_6': 'And so I just want to express my support for this application tonight moving forward. Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Ortega, any other comments from members of council? Scene on Madam Secretary.'",
        "'speaker_5': 'Raquel Nevett I. Ortega from Shepherd Susman Brooks Brown. I. Fights I can eat lemon Lopez I. Monteiro, I. Mr. President.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Memories. Madam Secretary, please close the venue and the results. 3939 664 has been placed upon final consideration and does pass. Congratulations. Seeing no other business before this body. This meeting is adjourned.'",
        "'speaker_1': 'Denver eight TV. Your city. Your source.'",
        "'speaker_0': 'Denver. Eight on TV and online. Stay connected to your community, your city, your source.'",
        "'speaker_1': 'You are watching Denver. Eight TV's Your City, your source.'"
    ]
}