{
    "Rezone 2765 South Colorado Boulevard to S-CC-3x in Council District 4.": [
        "'speaker_6': 'The property is just over 21,000 square feet and the owner is requesting zoning that would allow for possible repurposing of commercial property fronting Colorado Boulevard. The current zoning is B3 or shopping center district with waivers and conditions. The Shopping Center District allows for a 1 to 1 floor to area ratio.'",
        "'speaker_6': 'The waiver specific to the current zoning include restrictions on more intensive commercial uses and those have been attached in to the staff report. And then conditions include a requirement for fencing between the commercial property and the budding residential to the rear street trees and then a restriction on retail uses before 6 a.m. and after 9 p.m..'",
        "'speaker_6': 'The surrounding zoning include B three with waivers to the north and south as well as FCC three X or a commercial corridor, three story maximum height zoning to north and south with some limitations and s or suburban issue single unit D which allows for 6000 square foot minimum lot size.'",
        "'speaker_6': 'The requested zone district is s suburban context commercial corridor the CC and three storey maximum height with use limitations in these zone districts is intended to balance pedestrian and automobile access and provides for commercial mixed use development along auto dominated corridors, but allows for less intensive mixed use as commercial uses to serve as a transition between the'",
        "'speaker_6': 'more intensive commercial corridor or more auto intensive arterial streets and nearby residential. Look at the existing land use contact shows commercial fronting Colorado. Current use today is office and there's the lighter red color commercial retail along the corridor as well.'",
        "'speaker_6': 'And then immediately to the west you see the abutting single family residential land use. The center image is the subject property and you see it. A two storey office building on the site to the north. You also seek office and commercial uses fronting Colorado Boulevard as well as to the south, to the east.'",
        "'speaker_6': 'On the opposing side of Colorado, you see a larger retail complex and to the west fronting Harrison Street, a single family residential. The rezoning process to present has included neighborhood outreach by CPD and the applicant to the registered neighborhood organizations listed here.'",
        "'speaker_6': 'All of the written and posted notice requirements have been met leading up to the council hearing this evening. And despite this outreach effort and some communication with Wilshire Homeowners Association presidency, there has not been any submitted public comments specific to this rezoning.'",
        "'speaker_6': 'Let's look at the review criteria, beginning with plan consistency. The applicable plans are plan 2000, which encourages infill development that is consistent with neighborhood character, also encourages mixed use development and a range of housing types and services. Blueprint Denver shows a land use concept of single family residential, and we should take a careful look at the definition'",
        "'speaker_6': 'of single family residential as it is somewhat varied. It allows, while it encourages predominant single family homes or single family homes as the predominant development type or use type, there can be a variety of housing types and there can even be complementary land uses such as stores, parks and schools.'",
        "'speaker_6': 'And this is a citywide plan. And sometimes when we look at specific sites, we we need to carefully consider the definition of a land use as well as the land use context and other factors that we'll look at.'",
        "'speaker_6': 'This is also in Blueprint Denver, an area of stability defined as mean, intending to maintain the character of an area, but allowing and accommodating some new development and redevelopment. And also in single family land use areas, there can be a small employment base or a significantly smaller employment base.'",
        "'speaker_6': 'So between complementary stores and other uses and an employment base, we know that there can be more than single family, residential and in fact some commercial uses in single family. Mentioned. We look at other factors when determining how to best interpret a land use such as concept land use such as Blueprint Single-Family Residential in Blueprint Denver.'",
        "'speaker_6': 'As we looked at the street classification in this case Colorado Boulevard, that the property fronts is a mixed use arterial. This is a high capacity street carrying many vehicles, but also intended to carry bicycle and pedestrian trips that very much automobile dominated and the purpose of connecting neighborhoods to major employment and commercial centers throughout the city in'",
        "'speaker_6': 'the region. And here's an image of Colorado Boulevard, all six lanes plus that a diesel acceleration lane and center turning lanes. Very much a high capacity vehicle corridor. But we also see accommodations for bike and impaired. The next review criteria is would be met by SCC three X as it would result in a uniform application of the'",
        "'speaker_6': 'district building form, use and design regulations. Third criteria would be met as the would this district would further public health and safety and welfare by implementing recommendations from these adopted plans. The justifying circumstance would be a changed or changing condition to the property and its surroundings.'",
        "'speaker_6': 'Specifically, there was after this property was developed along Colorado Boulevard later in the 19 late nineties, we see the saw the development of commercial retail on the east side of Colorado. And then in 2010 there was comprehensive citywide rezoning where SCC three X zoned districts were applied to the north and south of this.'",
        "'speaker_6': 'Could it be three with waivers and conditions? And then in general, there is an aging condition. Each year, decade that passes these properties. Many were built in the early 1960s are aging and in need of some reinvestment. The fifth and final review criteria would be the consistency with the neighborhood context and the zone district purpose and intent'",
        "'speaker_6': '. And in particular the Berman context can be defined as single unit residential uses located away from arterial streets, but also single and some multi-unit residential, as well as commercial strips and centers and office parks, especially located on these these arterial streets.'",
        "'speaker_6': 'And SCC three X is consistent with this with the suburban context as it would allow for development opportunities along auto dominated corridor such as Colorado Boulevard and allow for that transition between intensity to lower intensity to the adjacent residential while allowing for flexible design standards for building circulation and parking.'",
        "'speaker_6': 'CPD has found that all review criteria have been met and we recommend approval of this application and Planning Board recommended approval as well with a21 vote. The applicant is here this evening and prepared to respond to questions and I'd be happy to as well.'",
        "'speaker_6': 'And thank you for your time.'",
        "'speaker_1': 'Think, tim, we have one speaker for this public hearing, Dan Burkey.'",
        "'speaker_6': 'Evening Council members. My name is Dan Burkey and I'm here on behalf of the applicant. I'm happy to address any questions that may be directed to the applicant.'",
        "'speaker_1': 'Thank you. All right, councilmembers. That concludes our speakers now. Time for questions. Councilwoman Black. Hi.'",
        "'speaker_5': 'Hi. Thank you, Mr. Burkey. This project is in my very own neighborhood. And could you just explain to the rest of the council what's been done to this property and why they are seeking the rezoning?'",
        "'speaker_6': 'Sure. My client recently acquired the property within the last year and a half timeframe and immediately went into a remodel. More of a facelift, really. We put in, you know, all new windows. And so it is existing office space, kind of boutique office space.'",
        "'speaker_6': 'And so with this recent remodel that we've just completed, it's for lease now. And so our immediate intentions for the the near future is, of course, to to continue to use that as a boutique office space. Now, the reason we're requesting the rezoning is because we do know that future development is a possibility.'",
        "'speaker_6': 'Again, we don't have any immediate plans or designs or anything at this point, but we would like to have the the rezoning, the I'm sorry, SCC three X that's what we're looking for to allow for more flexibility in the future, either if we were to sell the property and market it, or if we ourselves would like to'",
        "'speaker_6': 'redevelop it in the future. But the existing 1990s ordinance that we have right now is pretty restrictive on some of the various specific uses. I mean, I don't think.'",
        "'speaker_2': 'We're looking to do adult.'",
        "'speaker_6': 'Bookstores or tobacco shops, but we know that the new zoning classification does allow for a lot more flexibility and in what we might want to do in the future.'",
        "'speaker_5': 'I don't have any other.'",
        "'speaker_1': 'Thank you. Councilman Black. Councilman Espinosa. And sort of.'",
        "'speaker_6': 'Oh, I know it is. It's actually probably for Tim, but I don't know. Both of you might know it. The one vote planning board against. What was the nature of that? Yes. So, Don Elliot, after voting no at the end and explaining his position, felt that complimentary commercial uses should be more neighborhood serving and perhaps less oriented'",
        "'speaker_6': 'to a regional arterial street. But the rest of the the board members felt that complimentary could mean neighborhood serving and serving an arterial street passing near a neighborhood. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Councilman Carter.'",
        "'speaker_2': 'Thank you, Mr. President. Councilman Espinosa asked my question so I don't have to thank you.'",
        "'speaker_1': 'Thank you, Councilman Flynn.'",
        "'speaker_2': 'Thank you, Mr. President. Tim, could you explain what differences there are, if there are any, between the waivers that are being now waived and the new zoning classification? Will there be? It looks to me like it'll be allow for similar commercial uses, but I just want to be sure.'",
        "'speaker_6': 'There are some similarities and I might just begin with the some of the uses that are restricted under FCC three x. So those would include body art, outdoor service and repair firearm sales and your heavier automobile services, vehicle rentals, contractors, lab research, general manufacturing, storage, wholesale trade and vehicles.'",
        "'speaker_6': 'So it's these larger, more intensive uses that might have larger trucks with, you know, as they back up, they beep. And so that's generally that the types of use is restricted today. And what you'll find in the list of restricted uses or waived uses from the earlier ordinance is very, very detailed uses which reflect the former Chapter'",
        "'speaker_6': '59 use list, which prior to the early 2000s was extremely detailed down to the type of store, grocery store, tobacco store, etc. and yet in the early 2000s, those uses were consolidated to. Reduced number of categories. More of a light, medium or large, medium, small.'",
        "'speaker_6': 'I forget the exact classification. So it's just really gone through a series of of evolutions and changes to where there is not a 1 to 1 comparison between today's use restrictions.'",
        "'speaker_2': 'And I know that in the past, under the old Chapter 59, my predecessors, predecessor, Councilmen Hackworth, often was highly specific when wavers were involved in a rezoning. That's why I was wondering what the neighborhood might have bargained for when the initial B three with waivers.'",
        "'speaker_2': 'What were the restrict? What were the waivers in the original B three?'",
        "'speaker_6': 'Well, there are quite a few, and I'll just give you samples perhaps and get an idea. But automatic indoor archery. Lane's Automobile Gasoline Filling Station Billiard Parlor.'",
        "'speaker_2': 'Pool Table.'",
        "'speaker_6': 'Food Locker Plant. Fruit store. Grocery Store. Ice skating and a roller skating rink. Just doesn't seem to be a real consistent list of what.'",
        "'speaker_2': 'You're right. Pool table. I thought of Harold Hill and the music man does it doesn't allow in your first list you talk about the new zoning does not allow things like body art. Are you talking about tattoos? Tattoo parlor?'",
        "'speaker_2': 'Is that what that refers to?'",
        "'speaker_6': 'Correct. So the closer you look at the exact definition, but that's my understanding is that type of.'",
        "'speaker_2': 'Is a permit marijuana sales.'",
        "'speaker_6': 'So that's under the control of excise and licensing.'",
        "'speaker_2': 'Okay. But it would be allowed under this new general retail.'",
        "'speaker_6': 'Okay. So long as the spacing requirements. Correct. Excise and licensing. Okay.'",
        "'speaker_2': 'Thank you. That's all, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Any other questions? 174 scene public hearing is now closed. Time for comments, Councilman Black.'",
        "'speaker_5': 'Thank you, Mr. President. Councilman Flynn, to respond to your question about a marijuana store, there actually is one next to the property. So, no, there can't be one there. As I said, I live in this neighborhood and this rezoning is consistent with the other properties on that block.'",
        "'speaker_5': 'I don't see anything controversial about it. The owner has spent a great deal of money reinvesting in the property and is currently leasing it. There's no change in the structure, no change in the parking and no change in the use.'",
        "'speaker_5': 'So I won't be supporting it this evening.'",
        "'speaker_1': 'Thank you. Councilwoman Black.'",
        "'speaker_6': 'Councilman knew I used to buy an auto insurance from this from this building where Adrian was there, and it surely needed some improvement. So I welcome your your project to remodel and redevelop this project. I'll vote for it tonight.'",
        "'speaker_1': 'Thank you, Councilman. New Councilman Espinosa.'",
        "'speaker_6': 'And councilman knew you must have been getting a good deal on that auto insurance. Also, I was going to say is yeah, this is even if the other not in the other now.'",
        "'speaker_2': 'Nonconforming marihuana facility location.'",
        "'speaker_6': 'Was there there's a there's a residential zone district that is across the alley or abuts this. Correct. So this location would per our new ordinance wouldn't wouldn't be eligible anyway. So that's all I wanted to point out. Thanks.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. And a comment. 174 Seen none, ma'am. Secretary Roll Call.'",
        "'speaker_4': 'Black. Hi, Brooks Clark. Hi, Espinosa Flynn. Hi, Gilmore. Hi, Cashin. Can each. Lopez. Hi, new Ortega Susman. Mr. President. Hi.'"
    ],
    "Rezoning of Property at North Kittredge Street from Gateway to S-CC-5x.": [
        "'speaker_1': 'Madam Secretary. Please close a very nice results. 30 Nice nice 174 has been placed on final consideration and does pass. All right, the next bill we have come up is 191. Councilman Flynn, will you please put Council Bill 191 on the floor for final passage?'",
        "'speaker_2': 'Certainly, Mr. President, I move that council bill 191 be placed on par and final consideration and do pass.'",
        "'speaker_1': 'Has been moved. Colleagues, we need a second on the screen. Moved and seconded. Thank you. Public hearing for Council Bill 191 is now open. And may we have the staff report.'",
        "'speaker_8': 'Good evening, council president, members of City Council and Tim is much taller than I am. My name is Ryan Winterberg with Community Planning and Development here to present a rezoning application at 4140 50 North Kittredge Street from Gateway Waivers and conditions to the Five Zone District.'",
        "'speaker_8': 'So as in district, it will seem very familiar to you. Based upon our last rezoning system and the location of it, we can see that our site is in far northeast Denver. It is in Council District 11, it is in the Gateway Green Valley Ranch statistical neighborhood near the intersection of Eastbound I-70 and Pioneer Boulevard.'",
        "'speaker_8': 'So the location specifically, we're at the intersection of East 40th Avenue and North Kittredge Street. You can see our site outlined in yellow. You can see Adams County directly to the south, sort of shaded in gray. And our subject site is located about 1100 feet from the Gateway Park Station on the east corridor.'",
        "'speaker_8': 'And that is by walking distance. So the request, our site features two ownership parcels totaling about three acres. And this site was permitted under one site development plan from 2009, and it permitted the construction of a four story hotel and a standalone restaurant.'",
        "'speaker_8': 'And you can see that the four story hotel has been constructed. That's what we see in the aerial image there. And then the southern part of the site is vacant. That's intended as a later phase for the restaurant.'",
        "'speaker_8': 'And the rezoning request before you is sort of unique in that the owners are requesting the rezoning from Gateway with waivers and conditions to the SCC five X in order to bring the existing hotel and the permitted restaurant into conformance with zoning standards.'",
        "'speaker_8': 'As you've seen in your staff report and as we'll talk about tonight, the existing waivers and condition zoning, it is highly complex, it is highly inflexible, which is unfortunately resulted in errors in permitting. So the existing hotel and permitted restaurant, they do not conform with the zoning standards in place today.'",
        "'speaker_8': 'And so while the hotel that you see before you today was actually constructed in 2011, the zoning issues were not discovered until recently when the property owner did request a zoning verification letter. So as you'll see, we have a really great solution within the Denver zoning code today that both meets the rezoning criteria and captures the existing'",
        "'speaker_8': 'entitlement. So you'll see that the structure, both the existing and permitted structure, are both fully compliant with the requested zone district standards. Okay. So the request before you is the five zone district suburban neighborhood context alone commercial corridor uses five storeys in height with ex indicating limited uses as compared to the SCC five zoned district.'",
        "'speaker_8': 'So this zone district both acknowledges that existing entitlement as you'll see, and captures the existing site. So now I'll walk you through existing contexts. So in terms of zoning, we can see that our site is called out with the Gateway, with waivers and conditions.'",
        "'speaker_8': 'This is Denver's first attempt at mixed use zoning in the late nineties, and the subject site was rezone to that waivers and conditions in 1999 as part of a much larger area and 96 acre sites in the city of the area that you see surrounding our site, all largely vacant at the time of the rezoning.'",
        "'speaker_8': 'And the subject site is located within the new two, which stands for mixed use two area of the Gateway Zoning and it included a maximum standard. So controlling bulk and density through R allowing density bonuses and a maximum height of 75 feet.'",
        "'speaker_8': 'So not measured in storeys, just measured in maximum feet. So there are a couple of issues with the current zoning that are detailed in your staff report. So just kind of hit them broadly today. So the 1999 rezoning to the gateway with waivers and conditions included a use area map and a building heights map that's in your'",
        "'speaker_8': 'staff report. So they're highly customized waivers and conditions. But it's important to note that the rezoning, the 99 rezoning to get with reversing conditions was for a 96 acre site entirely vacant, and it was tied to a very specific anticipated project.'",
        "'speaker_8': 'And that planned commercial development didn't really materialize as these waivers and conditions had anticipated. So the zoning became outdated, unfortunately, very quickly and was very inflexible and unable to adapt to change over time. So the three major issues that we see at our site today, the first is that the hotel structure was constructed in an area where'",
        "'speaker_8': 'hotels and restaurants are unfortunately not permitted. So that's the hatched area that you can see on this use map. And the reason why this area has occurred is that the original dashed line that you see on the map is where an anticipated street connection was intended to be built.'",
        "'speaker_8': 'So that use area, those restrictions were intended to occur north of that street. But as we can see where the solid blue line is, that's where the street was actually constructed. So essentially the north, 76 feet of our subject property are not permitted for hotels and restaurants, also for number two.'",
        "'speaker_8': 'And number three on this bulleted list, the hotel and the restaurant do not comply with set back standards and some other site development standards. So looking to existing zoning in the area. See, we can see the 96 acre site that was the subject of the 1999 rezoning.'",
        "'speaker_8': 'We can also see some gateway zoning to the West where we see a large multifamily complex and Adams County to the south. And it's also important to note that only about 5% of the original area zoned gateway as part of the Gateway rezoning after the plan was adopted exists today.'",
        "'speaker_8': 'So we also have a general development plan that applies to the subject site. And IDPs were required in the Gateway Zone District for sites over ten acres. And this is, again, aligning with the 1999 rezoning so that 96 acre site.'",
        "'speaker_8': 'But we do see that the infrastructure surrounding our sites or the roadway connections, the sidewalk, the bicycle and pad infrastructure as well as stormwater has already been been constructed in accordance with this general development plan. So we don't really see a planning and development purpose any longer for our subject site within the framework of this GDP.'",
        "'speaker_8': 'So if the rezoning to SCC five X is approved this evening, the site will be removed from applicability of this GDP. But however, it still will apply to the remainder of the subject site where there is certainly still a purpose.'",
        "'speaker_8': 'So looking to land use, you can see that our site is called out as retail commercial and vacant and we see other large commercial sites to the north and to the east and to the south and Adams County.'",
        "'speaker_8': 'We would see a very similar pattern and a large inward facing multifamily site to the west across Kittredge Street. Looking to the foreman scale, we can see this is pretty typical of the development that we see in Denver's gateway or auto oriented, large setbacks, suburban in nature, but again, mixed use with mid mid to low intensities.'",
        "'speaker_8': 'Now, in terms of process, we did notify the following five renos throughout the rezoning process and we've received one letter of support from Montebello 2020 included in their staff report. We did notify those Arnaud's and City Council of receipt of complete application on December 9th.'",
        "'speaker_8': 'On March 2nd, Planning Board unanimously approved recommended approval of the rezoning, application and signage and notice for today's City Council public hearing was properly posted on April 11th. So in terms of the five rezoning criteria, the first of which is consistency with adopted plans, and we see three adopted plans that apply to our site.'",
        "'speaker_8': 'And the first is comprehensive plan 2000. And we do find that the rezoning is consistent with comprehensive plan 2000. And the comprehensive plan also calls out very specifically the gateway as an an area intended for higher intensity, mixed use development.'",
        "'speaker_8': 'Next, moving on to Blueprint Denver, we can see that our site is called out in that purple color indicating mixed use. So areas that have a sizable employment base as well as housing, and it's also located within an area of change.'",
        "'speaker_8': 'So areas that blueprint, Denver recommends concentrating growth and redevelopment. And the gateway is also specifically identified as an area of change. In Blueprint Denver Looking to future street classifications, we see that North Kittredge is called out as a residential collector and East 40th Avenue was actually called out as an end designated local, which we believe likely to'",
        "'speaker_8': 'be an omission, given that is the boundary with Adams County and it's built condition. It is a four lane divided, very commercially oriented arterial. So we do find that it is consistent to apply the SCC five zone district here based upon this higher intensity street classification.'",
        "'speaker_8': 'But then again, the X indicates there's limited uses to providing sensitivity to the residential collector and adjacent multifamily residential uses. The Gateway Concept Plan was adopted in 1990 and we find that the rezoning is consistent with multiple strategies from this plan.'",
        "'speaker_8': 'The plan recommended highly flexible planning areas to adapt to changing market conditions, identifying that the plan horizon in the gateway would be 40 to 50 years so far beyond what we would typically see and plans that we oftentimes see today.'",
        "'speaker_8': 'The plan also recommended activity centers with large scale hotels and office clustered at major interchanges like the interchange of I-70 and Paint Boulevard and the 1999 rezoning to M2 to included a land use and building heights map that essentially provided an update to the 1990 plan, which is shown here.'",
        "'speaker_8': 'So we can see that a maximum building height of 75 feet is recommended with a move to include a mix of uses. And that we do find that the requested SCC five X respects both these building heights and latest recommendations.'",
        "'speaker_8': 'So we do find that the rezoning is consistent with adaptive plans. Moving on to uniformity of district regulations, we find that the rezoning will result in the uniform application of zoned district standards and bring a site into the Denver zoning code where it can find compliance within our zoning standards.'",
        "'speaker_8': 'We also find that the rezoning feathers furthers public health, safety and welfare through the implementation of adopted plans. Moving on to justifying circumstances, looking to change or changing conditions, we find that adopted plans recommend a redevelopment in this area and a mixed use context.'",
        "'speaker_8': 'Recognizing the evolving character over 40 to 50 years in terms of Plan Horizon in this area, we have seen the realization of that mixed use note occur at the interchange of I-70 and Pioneer Boulevard. And of course, the adoption of the Denver Zoning Code in 2010 introduced new tools to implement plans were formerly highly negotiated waivers and'",
        "'speaker_8': 'conditions. Rezoning would have been necessary to implement plan recommendations in this area. We now have options within the Denver zoning code. So in terms of consistency with neighborhood context, we find that it's appropriate to apply zoning here within the suburban context and in terms of zone, district purpose and intent.'",
        "'speaker_8': 'We find that the rezoning request meets the purpose statement of the SCC zoned district and specifically the intent statement for SEC five X applying primarily to auto oriented arterial streets, much like 40th Avenue or a building scale of 1 to 5 storeys is desired with less intense uses respecting adjacent residential development.'",
        "'speaker_8': 'So based upon our analysis of the five reasoning criteria, we find that the rezoning meet our five and recommend approval. And the rezoning applicant here is tonight available for your questions. So happy to answer any questions for you as well.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'In Iran, we have one speaker, Jack Royal.'",
        "'speaker_2': 'Good evening, Mr. President. Members of council. My name is Jack Russell, 1801 California Street 2600 and Denver. I'm here as the applicant's representative this evening, so I've been practicing law for 25 years. And this was one of the more interesting cases back in the day.'",
        "'speaker_2': 'My client, who I didn't represent at the time, obtained a building permit, built this hotel and often rated it as if all things were good and we would not have found this issue. But for the fact that we went through a refinancing project last year and when we when we just, you know, easily went to the city'",
        "'speaker_2': 'to ask for a zoning opinion, we had this. So I want to thank staff. They took a potentially. Difficult situation relation proposed a plan to make it work so that what was built via a permit back in 2000 that would happen now will fit very nicely within the new zoning code.'",
        "'speaker_2': 'So we agree with the staff recommendation. We hope you support it. And I'm here just to answer any specific questions. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Now time for questions from members of council. Councilwoman Ortega.'",
        "'speaker_7': 'I have a question about. And Jack, you're probably the best person to answer this. So we're segregating out this 3.5 acre site that has a hotel on it from the other 96 acres. The require. The. Plan for the 96 acres includes some drainage at various locations, which we can see in the maps.'",
        "'speaker_7': 'Typically, when we have projects that are standalone that come in, they require their own onsite drainage if it is more than an acre and a half. And so I'm wondering if other parts of the 96 acres that have vacant land start to develop.'",
        "'speaker_7': 'Can any of that begin to take away any of that detention that's been set up as part of the drainage for the 96 acres?'",
        "'speaker_2': 'It's a great question, Councilwoman. I'm not sure I can answer it, but let me give you my thought and then Ryan can answer it. But I think when this site was first designed and built, the there was storm drainage facilities, the design for the 96 acres that this was a part of it.'",
        "'speaker_2': 'So its development was was part of the overall drainage plan. But Ryan, did you have.'",
        "'speaker_8': 'Yes, that is correct. There's a number of different aspects of overall site infrastructure that are captured at the GDP level and site wide stormwater infrastructure is one of them. So a very large retention pond that you see at the northern edge of the GDP does accommodate the site as well as others.'",
        "'speaker_8': 'So when they do come in for development over time, they will be captured by the regional infrastructure there.'",
        "'speaker_7': 'So the detention ponds that are there will stay. They could start to encroach into that and take away any of the detention as part of the actual correct.'",
        "'speaker_8': 'The retention ponds will need to stay.'",
        "'speaker_7': 'Great.'",
        "'speaker_8': 'Thank you. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega. Councilman Flynn.'",
        "'speaker_2': 'Thank you, Mr. President. Ryan, maybe you could help me understand. Sure. How would. How would errors like this occur? This was just 2011 and the new code was adopted in 2010. But the new code had. No. This is old.'",
        "'speaker_8': 'Right?'",
        "'speaker_2': 'I'm sure you did. But you know, when I read that the hotel was constructed in an area where hotels are not permitted. It makes me wonder how this escaped the eagle eyes of the development group.'",
        "'speaker_8': 'Correct? Correct. So the site development plan that approved the construction of the hotel and the restaurant was approved in 2009. So it does predate the code, but I believe for two years the development stayed in the development review and investing process.'",
        "'speaker_8': 'But what happened is.'",
        "'speaker_5': 'A.'",
        "'speaker_8': 'Interesting story. So the staff who would have reviewed this particular project are no longer with us at the city, so we can sort of pick their brains. But from the research that we've done, trying to puzzle this situation is that the waivers and conditions that are of course, included in the rezoning ordinance from 1999.'",
        "'speaker_8': 'So it's a separate document. It appears that they were missed entirely. So the development, it appears, was reviewed against the gateway with waivers and conditions and new to the mixed use two straight standards and missed the waivers and conditions, which is where you would see the area that is prohibited for hotels and restaurants that all lived within'",
        "'speaker_8': 'that waivers and conditions document. So we do suspect that it was just missed entirely, unfortunately.'",
        "'speaker_2': 'Okay. The question that that leads me to then is, are there other parcels in development or just recently constructed in this area that might have this same issue? And are we going back and looking at them?'",
        "'speaker_8': 'Yeah, that's a great question. So the site next door, 16161 East 40th Avenue also has a very similar problem. And we have received a map amendment application that is now posted to our city website requesting its own district that similarly will bring that site into conformance as well.'",
        "'speaker_8': 'Those are the only two sites that we have found within the GDP. We did undertake a pretty comprehensive review of permitted and existing development to ensure that there were no other mismatches.'",
        "'speaker_2': 'Okay. Thank you very much. That's all, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Flynn. And the questions 191 seen none. Public hearing is not closed. Time for comments, Councilwoman Gilmore.'",
        "'speaker_7': 'Thank you, Mr. President. You know this. I have to compliment the the owner and the owner's rep. You know, this was a simple financing that they went to, you know, get better financing on their projects and clean that up.'",
        "'speaker_7': 'And they, I think, opened up a can of worms that they were not prepared for. But they have been, you know, at the table talking with folks, always very forthcoming. And so I appreciate that and that going forward, it would be wonderful, especially if it's a clean up.'",
        "'speaker_7': 'I understand that CPD has a process and it has to go through the planning board and everything. But this was quite a lengthy process and I hope that that staff and others can maybe look at how to expedite some of these, especially if it is truly a clean up and good to know that in addition to everybody'",
        "'speaker_7': 'else, the city staff is human and mistakes are made. But this is in my district and I will be supporting it tonight. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Any other comments? 191. Being UN Madam Secretary. Welcome.'",
        "'speaker_4': 'Gilmore.'",
        "'speaker_7': 'Hi.'",
        "'speaker_4': 'Katherine. Hi. Can each. Lopez.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'New Ortega. Sussman Black Brooks. Clark. Espinosa. Hi, Flynn. Hi, Mr. President. Hi.'",
        "'speaker_1': 'Madam Secretary. Please. Vali Nasr. Results 3939 is when 91 has been placed on final consideration and does pass on Monday, May 9th Council will hold a required public hearing on Council Bill 256, dissolving the Ninth Avenue Business Improvement District on Tuesday, May 31st, Council will hold a required public hearing.'",
        "'speaker_1': 'Council Bill 218 changed the zoning classification for East 56th Avenue and Central Park Boulevard. Quiet Public Hearing on Council Bill 253 Changing the zoning classification for 34 or one North Pecos Street. Any protest against Council Bill to 18 hour Council Bill 253 must be filed with the Council offices no later than noon Monday, May 23rd.'",
        "'speaker_1': 'See no other business before this body. This meeting is adjourned.'"
    ]
}