{
    "Proclamation for the 2019 University of Colorado Denver Latinx Cohort and Education Doctoral Graduates.": [
        "'speaker_1': 'Thank you, Councilman Brooks. That concludes our announcements. There are no presentations and there are no communications this evening, but we do have three proclamations one will be going through on consent, but we have two to be read this evening.'",
        "'speaker_1': 'So, Councilman Brooks, will you read Proclamation 436?'",
        "'speaker_5': 'All right. I was just talking about this. I will be excited to read this proclamation. 436 A Proclamation Honoring and Recognizing 2019 University of Colorado, Denver, Latinx cohort and all educational doctoral graduates of color. This is really exciting.'",
        "'speaker_5': 'Whereas it is a fact that this is the largest graduating class of educational doctoral degrees conferred in a single ceremony from an institution of higher ed by Latinos, African-Americans, Asians, women, white allies. And. WHEREAS, The Denver City Council recognizes the exceptional work that all the doctoral students undertook to change the educational landscape of Colorado for the greater'",
        "'speaker_5': 'good. And. WHEREAS, the 25 doctoral graduates all have been strong advocates of all students of color engaging in research in the end of school to prison pipeline, restorative practices, linked linguistic learners, cultural responsive learning, leadership bias, student centered supports, and many, many more issues.'",
        "'speaker_5': 'And. WHEREAS, the Class of 2019 has endured many challenges in their lives from homelessness, societal and economic barriers, and many doors closed due to the color of their skin. And yet these 25 has still prevailed. And. Whereas, collectively, these graduates have over 500 years of experience working in education in the state of Colorado.'",
        "'speaker_5': 'And. Whereas, lifelong commitment of graduates to earn their doctorate degrees and continue to serve the youth of Colorado and make them outstanding citizens. And we're, as graduates, are committed to promote and enhance and increase the asset, strength and skill sets of our young people by helping provide the necessary services and resources, including opportunities and options for mentoring'",
        "'speaker_5': '. Social. Emotional. Intelligence. Education. Financial. Literacy. Education. Financial. She education and post-secondary secondary education, skilled trade, trade training, entrepreneur education and health options and access to increase their odds of success. Now, therefore, being proclaimed by the Council of the City County of Denver, Section one to the Council of the City, County in Denver and the entire community express'",
        "'speaker_5': 'their heartfelt congratulations to the 2019 University of Denver doctoral students of color and the Council of the City and County of Denver. Hereby officially proclaims that May 18, 2019 be known as Doctors of Education Day. Section two. The Clerk of the City County of Denver shall test and fix a seal upon the city in county of Denver'",
        "'speaker_5': '. This be pro proclamation be transmitted to the graduates of and if I mess up any of your names charged to my head and my heart. Okay, Cynthia. Bottom duty. Judy. B, Elizabeth, Elizabeth B, Eleanor Burns, Melissa Conley and Catherine Gaddis and Kasey Green and Tanya Holguin.'",
        "'speaker_5': 'And Clara Hernandez. And Dominique Jones. And Gabriela maldonado. And Jenna martin. Bonnie Martinez native the Miller. Angelique Montoya. Angelica Ramirez. Michael Ramirez. Teresa Rosado. Jose Silva. Marin Stewart. Artan Thomas. Diana Thompson. Cynthia Sheehan. Thomas Velasquez and Hank. Chunk.'",
        "'speaker_5': 'You know what I'm saying? Okay. We congratulate all of you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Your motion to.'",
        "'speaker_5': 'Adopt? Yeah. I moved that proclamation for 36 to be adopted.'",
        "'speaker_1': 'It has been moved and seconded comments by members of Council Councilman Brooks ment.'",
        "'speaker_5': 'This is so exciting. You know, when we talk about barriers to opportunities in our country, in our city, you know, I was I was raised on this because my my mother and I always talk about this, but she was the first African-American born in a hospital.'",
        "'speaker_5': 'She's the first African man born in a hospital in Arkansas, southeast Arkansas. And they put her in a box so she wouldn't contaminate the rest of the white babies. She was born in a very horrible time. Yet she fought through those barriers and became a Ph.D. at UCLA, and she was pregnant with me doing her dissertation on'",
        "'speaker_5': 'a typewriter. I don't know how she did that, but that showed me the type of barriers that it takes for some of us who are folks of color in this society, and to see the number of folks of color who have become PhDs.'",
        "'speaker_5': 'And I got a chance to go to one of the doctoral defenses by Jose Silva. It was one of the most incredible things. And I just want to share this with you. Jose was defending his his. You know, his thesis.'",
        "'speaker_5': 'And it was amazing to be able to see Jose, the community person, and now Jose the scholar. And one of the doctors said passion is great. Passion with scholarship is unstoppable. And I like I got choked up. I was like, man, this is a serious deal.'",
        "'speaker_5': 'But we are now getting our folks of color who are from these passionate, desperate backgrounds with incredible barriers to have scholarship in their work. And that is tremendous. And so from all of us on city council, we salute you and we thank you.'",
        "'speaker_5': 'You are the real leaders of this city. You are the real leaders of this region and state. And we tell you, continue to move out, keep going and go forward, because all of these young people, you're setting an example.'",
        "'speaker_5': 'You are exploding ceilings for them. So this is an amazing day. And we we congratulate you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. Councilman Brooks, thank you for bringing this forward. And I just want to say, I know a couple of folks on this list, but I want to say congratulations to all of you and go forth and shape the minds of our our young people.'",
        "'speaker_9': 'Whether you're going to be teaching in our schools or our universities, you all will be influencing the minds and the the thoughts of of many people that will then continue to influence others in our community. So thank you for the the.'",
        "'speaker_9': 'Entire journey that you have been through and in just for your dedication and commitment to giving back. Because this is another example of public servant. See, if you will, and I. Hats off to all of you. Thank you so much.'",
        "'speaker_9': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Ortega. Councilman Herndon. Thank you, Mr. President.'",
        "'speaker_0': 'I just wanted to my comment to commend you all for this. I am a student, a graduate, not the doctoral program.'",
        "'speaker_5': 'But I will also say my wife is one year into getting her Ph.D. And so I know. I know because I hear about it, the.'",
        "'speaker_0': 'Rigor.'",
        "'speaker_5': 'That you all went through. So congratulations on that and job well done.'",
        "'speaker_8': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Herndon. I will just add my congratulations and thank you to Councilman Brooks for bringing such a great proclamation forward. Madam Secretary.'",
        "'speaker_4': 'Raquel Brooks.'",
        "'speaker_5': 'Hi.'",
        "'speaker_3': 'Black Eye.'",
        "'speaker_4': 'Espinosa. Hi.'",
        "'speaker_1': 'Flynn Hi.'",
        "'speaker_4': 'Gilmore I earned it.'",
        "'speaker_10': 'I.'",
        "'speaker_6': 'Cashman All right.'",
        "'speaker_4': 'Can I. Lopez Hi. Ortega Hi, Cessna. Mr. President.'",
        "'speaker_1': 'I am secretary. Please close voting. Announce results.'",
        "'speaker_4': '12 hours.'",
        "'speaker_1': '12 eyes proclamation. 436 has been adopted. We have 5 minutes for a proclamation acceptance. Councilman Brooks, is there anybody you'd like to bring up?'",
        "'speaker_5': 'Yep. I just want to do two things. One, can all the FD stand up, please? Give them a hand. You know, for all the work you guys have done, we could be clapping all day. Be honest with you.'",
        "'speaker_5': 'I'm going to bring up Dr. Jose Silva to receive this.'",
        "'speaker_7': 'Regardless of the situation.'",
        "'speaker_5': 'You can right there. Yeah.'",
        "'speaker_11': 'Good morning, counsel counsel President Clark, thank you so very much for allowing us to be here and inviting us to be here on behalf of myself and our cohort, the latte next cohort. We are just so honored and thankful that the City Council and you all would be willing to honor all of us in the work that'",
        "'speaker_11': 'we've done. Some of you know me, some of you don't. But I come from the projects here in West Denver, the North Lincoln Projects, and the Sun Valley Projects. And I'm a proud graduate of Denver West High School, class of 1998.'",
        "'speaker_11': 'And when I went to West High School many times, I was told my friends we all would end up dead or in jail. And for many of my community, that has been the result. But for many of us, we have decided to stand in the gap, show up and be better representations and better representatives of our community'",
        "'speaker_11': '. And for us to join this Latin next cohort, when 25 of us were accepted, 25 of us will graduate. And we will be the largest number of Latino graduates with doctorate degrees in the history of the United States in a single ceremony from the city and county of Denver.'",
        "'speaker_11': 'That is remarkable, not just for us, but for the young people that are going to come behind us. And so I challenge all of you as our leaders today, to continue to stand in the gap for young people, to continue to find ways to open doors for other young people.'",
        "'speaker_11': 'And currently, right now, the university is raising more money to provide more scholarships to young people to be able to get in the E.D. program. Many of us received a half scholarship. I was fortunate enough to not only receive a half scholarship, but a full ride.'",
        "'speaker_11': 'So I would ask you to think about how you has council members might be able to stand in the gap for the next generation of doctors by maybe contributing, opening up some of your opportunities and standing in the gap for the next generation of leaders.'",
        "'speaker_11': 'I will now yield my time to Dr. Trinidad, to Dr. Cynthia that she had.'",
        "'speaker_3': 'Good evening and thank you very much for having us.'",
        "'speaker_4': 'I know this is an evening that we're all going to cherish very much for many of us. We became a chosen family and we talk about that a lot, about being a chosen family.'",
        "'speaker_9': 'This group of.'",
        "'speaker_3': 'Strong individuals have come together as such a.'",
        "'speaker_4': 'Strong group. Chosen is the key word for the fact that many things in our families and our family's journeys, as well.'",
        "'speaker_3': 'As our own journey was not chosen. We did not choose discrimination.'",
        "'speaker_4': 'We did not choose for the doors to be closed on us. We did not choose for people to try to get us to fail to weed us out at the beginning of our program and even through our.'",
        "'speaker_9': 'Journey to get to higher ed.'",
        "'speaker_4': 'But we chose to stay. We chose to rise to the occasion. We chose to take the opportunities that were given to us and to also open those.'",
        "'speaker_3': 'Doors for more opportunities for up and coming students of color. Because of the courage that each of us have shown every day and together.'",
        "'speaker_4': 'Whether it was through texting, phone calls.'",
        "'speaker_3': 'Keeping each other on track.'",
        "'speaker_9': 'We made it. And this family, this chosen family will forever.'",
        "'speaker_7': 'Be together.'",
        "'speaker_4': 'And.'",
        "'speaker_3': 'Forever bound by the moment.'",
        "'speaker_4': 'Tonight and the moment that we will share on May 18th, a chosen family of individuals who did not waste time, did not.'",
        "'speaker_9': 'Waste opportunity, and we surely did.'",
        "'speaker_4': 'Not waste the journey of our.'",
        "'speaker_3': 'Ancestors. So congratulations to our cohort, and thank you again for having us.'",
        "'speaker_1': 'Thank you, Councilman Brooks, for bringing that forward.'",
        "'speaker_5': 'We have another one, Mr. President. I just want to tell the cohort we have another proclamation than we have. We're going to give you a bunch of proclamations. So if you guys could hold on for just 5 minutes, that'd be great.'"
    ],
    "Purchase of Real Property for Future Park Land at 4301-4307 Iliff Avenue.": [
        "'speaker_1': 'Thank you very much. I'll do a quick recap. And a resolution to Councilwoman Black has called out Resolution 388 for comment. Under bills for introduction, no items have been called out. Under bills for final consideration. No items have been called out and under pending.'",
        "'speaker_1': 'No items have been called out. Madam Secretary, will you please put the first item on our screens and Councilman BLOCK, go ahead with your comment.'",
        "'speaker_7': 'Thank you, Mr. President. This is a great night for a neighborhood in southeast Denver. It's a neighborhood that for 60 years has wanted a park there bordered by I-25 and Colorado Boulevard, which is a state highway and two other busy streets, Evans and Yale.'",
        "'speaker_7': 'And there are some neighbors who have lived there since the fifties and tell stories about how they have asked for a park for all these years. And I'm so happy to announce that because of Councilman Clark getting to a on the ballot that is providing some funding and because of our city's commitment to it, that every neighborhood'",
        "'speaker_7': 'should be within a ten minute walk to the park. We are fortunate to be buying a piece of property in this neighborhood. We'll finally have the park that they have needed for a very long time, and the need for it has actually grown greater and greater because of their proximity to two light rail stations.'",
        "'speaker_7': 'Their population will probably be tripling in the next decade and so this park is needed more than ever. So I in addition to thanking Councilman Clark, I want to thank the community. They helped put this notebook together that we have been handed to the mayor and a happy Haines.'",
        "'speaker_7': 'And I also want to thank Gordon Robertson with Parks and Rec and Jeff Steinberg with the Department of Real Estate, because I called him about 500 times over the past three and a half years, telling him every piece of property that was for sale, including just little lots where there were houses.'",
        "'speaker_7': 'And I was like, Can we just have a pocket park? Can we have something? But we are getting an almost two acre park and it's very, very exciting. So thank you, everyone, for your support.'",
        "'speaker_1': 'Thank you, Councilwoman Black. And congratulations. That's very exciting. And thank you to Denver voters for passing to pay for our parks. That concludes the items to be called out. All bills for introduction are ordered published. We are now ready for the block vote on resolutions and bills on final consideration.'"
    ],
    "Zoning Change for 3429 W 3rd Avenue in Barnum with a Waiver.": [
        "'speaker_1': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and refrain from individual or personal attacks. Councilwoman, can you please vote council 247 on the floor?'",
        "'speaker_7': 'Yes, I move that council bill 19 dash 247 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Has been moved and seconded. The required public hearing for Council Bill 247 is open. May we have the staff report?'",
        "'speaker_12': 'Q So Jeffrey, it was CPD, so I have a rezoning request for a property located at Third and Knox in the Barnum neighborhood. So the property is located in Council District three. Again in the barn and neighborhood. So the request area is at the northeast corner of Third and Knox Court and the request area is about 0.6'",
        "'speaker_12': 'acres. The rezoning is to go from ESU, D1 Ex to EMU 2.5 with a waiver. And I'll of course explain what that means. The purpose of the request is to accommodate multi-unit residential development on the site. So the subject said again, easy d1x.'",
        "'speaker_12': 'So that's urban edge context, single unit. And the D1 one x denotes that an accessory dwelling unit is allowed and the surrounding properties are also ESU, D1 x. So again, ESU, D1 exits a single unit, residential zone district, which does allow for accessory dwelling units.'",
        "'speaker_12': 'And importantly, the maximum building height is calibrated by the front and rear of the lot. So the front, 65% of the lot can be up to 2.5 storeys and actually up to 35 feet depending on the lot with the slots big enough to qualify for the 35 feet and the rear, 35% is one story and 17 feet'",
        "'speaker_12': 'in height. And so the requested zone district is IMU 2.5 A Sense for Urban Edge Multi-unit 2.5 stories. And I'll get to the waiver request here in a second. But I mean, 2.5 is a zone district that allows single and two unit and multi-unit residential with multi-unit residential typically being embedded with other residential areas.'",
        "'speaker_12': 'And it does allow for a variety of residential building forms up to 2.5 storeys. The building height is actually similar to the existing zoned district. And the anomaly here that we'll get to in the waiver is the apartment building form and actually only allows up to two stories in height in the front 65%.'",
        "'speaker_12': 'And so looking at the minimum loss size, it's a bit smaller than the current zone district, but importantly also to note the half storey definition. So 2.5 storey is the maximum height in the front, 65%. And so a half storey is defined as essentially a third story.'",
        "'speaker_12': 'That's 75% of the floor area of the story below it. So there's a massing reduction. Additionally, within the zone district, there's standards depending on the building form for upper storeys setbacks and setbacks to further reduce that massing. And so I know this is a lot going on in this table, but it is important to kind of note'",
        "'speaker_12': 'this is the the basis for the waiver. So this table shows the allowed building forms and IMI 2.5 on the left hand side. And then looking at the heights, the building heights across these building forms and the front, 65%.'",
        "'speaker_12': 'So really uniform across most building forms with a 30 to 35 feet in the front, 65% and the 2.5 stories. And so this is the issue right here or the reason for the waiver request as the apartment building form has the same height allowance, 30 to 35 feet, but it only allows two stories and the rear 35%'",
        "'speaker_12': 'is similar to the other building forms. So this is just visually showing what the waiver request is on the screen. So it is a request for IMI 2.5 with the waiver. And the specific waiver is to the apartment building form to allow 2.5 storeys instead of being capped at two stories in the front, 65%.'",
        "'speaker_12': 'And so looking at existing land uses. So the subject site is currently it's actually vacant, it's shown a surface parking and the existing land use and has been vacant for some time. You see up and down the Knox Court corridor, while it does have that single unit, residential zoning, there's actually a mix of land uses.'",
        "'speaker_12': 'The read on this map is office and then the blue as a church. And we'll talk a little bit more about the Knox Court corridor here in the next slide. So the Knox quiet corridor is, I would say, a significant North-South connector in terms of connecting Barnham to the rest of Denver look in between federal and Sheridan'",
        "'speaker_12': '. So it is a corridor that has some recent investment in terms of a new bicycle lane. And and then I also noted that there are several existing nonresidential uses along this corridor. Despite the residential zoning, most structures on this corridor are 1.5 storeys.'",
        "'speaker_12': 'There are some exceptions to that, even though the zoning allows buildings to go taller than that, going up to potentially 35 feet and two and a half stories in the front, 65%. And there's also a couple nonresidential commercial nodes within two blocks of the subject site on the Knox Court corridor at first and fifth.'",
        "'speaker_12': 'So you see it's a it's a mixed and mixed corridor in terms of land use and character, despite its its zoning. And so looking at the current site and on to some images here. So as I said, it is currently surface parking and actually has been vacant for several years and it's fenced off and has seen a'",
        "'speaker_12': 'fair amount of disrepair in recent years. Historically, it's always been a nonresidential use as far as we can tell in our records. Previously, before being a surface parking lot, it was a telephone service company garage with a small structure there.'",
        "'speaker_12': 'And so looking at images of the subject sites, those looking northeast at the site, you see it's fenced off and it was surface parking. You see the bicycle lane. I will note there's also a bus stop right in front of the site that connects this site along with the bicycle lanes pretty well to the overall mobility network'",
        "'speaker_12': '. But you have to the north, the west light rail line, Knox Court Station, which is less than a mile away. Straight, north, north, straight. Shot from the site. And so this is looking kind of south, south, west say it is on the left hand side of the screen and this is looking from Third Avenue West.'",
        "'speaker_12': 'So you can see where the alley meets the subject's site. And so this is looking straight west of the subject's side. And you can see the the mix of land uses there and beliefs as an office mixed them with some of the single unit residential.'",
        "'speaker_12': 'And then this is looking south more broadly of the Knox Court corridor. Looking north. So you see again, the mix of land uses in this case, on the other side of Knox Court, we have the church, which is two and a half ish stories.'",
        "'speaker_12': 'And then these are strong properties that are directly east of the subject sites or across the alley, both fronting on Julien Street. You see the the one, one and a half storey character of that area as it jumps across the alley.'",
        "'speaker_12': 'So the process to date has been a normal rezoning process leading to the hearing tonight in terms of public outreach and public comment. There was extensive dialog between the applicant and the neighborhood organization, and I'll certainly let them talk about that if they'd like.'",
        "'speaker_12': 'But we did not ever receive a position letter from the Concerned Citizens for Burnham on the rezoning, but we did receive a total of three letters on the rezoning, two in support, and then one letter expressing concerns about the potential scale, inappropriate scale of buildings with the rezoning and some reference to the Barnum neighborhood plan, which we'll'",
        "'speaker_12': 'talk about, and policies there supporting continuance of the low density residential character and a stated preference in that letter for RH 2.5 instead of the requested zone district. So these are the criteria staff used to evaluate rezonings. I'll go through each one of these.'",
        "'speaker_12': 'And so we have the newly adopted citywide plans, comp plan and Blueprint. Denver And then we have the Barnham neighborhood plan. And we'll go through here briefly. So in terms of the conference plan, 2040 staff cites a number of policies in the staff report in support of the rezoning, mostly related to promoting infill development on a site'",
        "'speaker_12': 'where services and infrastructure already exist. And then also a number of policies in the comp plan supporting encouraging a diversity in a variety of housing types and each neighborhood. And this rezoning would do that. So staff finds the request consistent with those policies in terms of blueprint.'",
        "'speaker_12': 'Denver The newly adopted blueprint. Denver There's three topics that we look at, and I'll go through those briefly here. So in terms of future neighborhood context blueprint, Denver calls the site as urban edge. And so they are going to the urban edge zoning neighborhood context.'",
        "'speaker_12': 'It also does have language and blueprint in Denver within this context related to allowing some low scale multi-unit embedded with neighborhoods. In terms of the future places. The subject site is in the low, medium residential category, which is different than what it was under the previous blueprint.'",
        "'speaker_12': 'This particular category does have language that supports additional density at appropriate locations and multi-unit residential embedded in some neighborhood, some residential neighborhoods. And it does also look at vacant corner sites as potential opportunities for increased density. And I should note also that the Knox Court quarter is a residential collector.'",
        "'speaker_12': 'Third Avenue is a designated local. So in terms of the growth strategy, kind of the third tier blueprint, it is in the all other areas of the city. There is language in the, um, uh, within that category of supporting some rezonings and some investment at appropriate locations.'",
        "'speaker_12': 'So the barn and Barn West Neighborhood Plan is an adopted plan. The site is subject to for the rezoning. Her staff recognizes the plan is 30 plus years old and community conditions have changed a lot since then. However, it is important to look at that document and there are a number of policies that do support continuance and'",
        "'speaker_12': 'preservation of the existing low density residential character. There's also other policies in there that support reinvestment at strategic locations as well. And so looking at sort of the balance of adopted plans across the citywide and local plan, staff does find the request consistent with adopted plans because it would promote infill development in a place where services and'",
        "'speaker_12': 'infrastructure already exist, create a greater diversity of housing choices in this neighborhood, and be consistent with the context, the urban edge context called from Blueprint in Denver, and then also support a context sensitive scale of investment through the height and the transitions within the zone district.'",
        "'speaker_12': 'So criteria to the number is off your stuff to find the rezoning will result in uniform application of standards within this unique zone district related to the public health, safety and welfare staff does find the requests are consistent with that criteria, primarily through implementing adopted plan policies, as I said, related to encouraging a diversity of housing types'",
        "'speaker_12': 'and encouraging an investment that is context sensitive. And then looking at justifying circumstances. The fact that Blueprint Denver was adopted is in itself a justifying circumstance. And the the policies, the new policies that were assigned to this property.'",
        "'speaker_12': 'But we also staff also cited other factors, including some recent investment in bicycle infrastructure, better connecting the site to the nearby light rail station. And in terms of the consistency with the urban edge neighborhood context description, staff does find the request consistent with that criteria related to the description about block sizes and the overall grid pattern and'",
        "'speaker_12': 'access off of alleys, things like that. And the fact that the request is going to promote multi-unit residential embedded within a primarily residential area. So at that staff does recommend approval of the rezoning and I'm happy to answer any questions.'",
        "'speaker_1': 'Thank you very much. We have eight individuals signed up to speak on this item this evening. So first up, Jesse Paris.'",
        "'speaker_6': 'Jesse Paris represent for Denver, home of Salau, Black Starks and Movement for Self-defense and Positive Action Commitment for Social Change. And I'm on.'",
        "'speaker_12': 'Top of the ballot for at large. Make sure you vote by tomorrow. I was originally against this rezoning request because I thought it was just going to be more gentrification as usual. This neighborhood, this part of town, as all other parts of town, has been rapidly gentrified to no avail.'",
        "'speaker_12': 'Seeing that there's.'",
        "'speaker_6': 'Going to be allowed to use.'",
        "'speaker_12': 'I'm a supporter to use. So I'm in support of this rezoning. I had a few questions, though. I wanted to know exactly what the RMR level was.'",
        "'speaker_6': 'Going to be for this. This was going to be a rental. Or if this is going to be market.'",
        "'speaker_12': 'Is it going to be ownership? If you could please answer my questions, I would greatly appreciate it.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Next up, Chairman Sekou. Yes. Good evening, ladies and gentlemen.'",
        "'speaker_7': 'Oh.'",
        "'speaker_1': 'My name is Chairman Sekou. I will be the.'",
        "'speaker_0': 'Next mayor of the city. And. This particular item. I support. Finally. You'll get this right. You got it right.'",
        "'speaker_1': 'And I expect a unanimous.'",
        "'speaker_0': 'Vote.'",
        "'speaker_1': 'On this thing. Well, because it satisfies all the criteria that exist. That's number one. And two, what's different about this one is that it finally begins to do the.'",
        "'speaker_0': 'Innovative process of creative thinking of how we can begin to.'",
        "'speaker_11': 'Address this housing issue.'",
        "'speaker_0': 'Now, I know we ain't supposed to be talking.'",
        "'speaker_11': 'Good about folks up here, and this is just generic.'",
        "'speaker_0': 'It doesn't apply to any one particular use class. But you know what? Congratulations. And you know what I'm talking about. And we go a long way back.'",
        "'speaker_1': 'Almost 15 years. This thing.'",
        "'speaker_0': 'For me. And those would probably be the last time that I show like this on this side of the podium. So. Happy birthday for. Congratulations on a successful.'",
        "'speaker_1': 'Year living my. I didn't know this is his birthday. Yeah.'",
        "'speaker_0': 'He's going to.'",
        "'speaker_1': 'Basketball. And I just want to say that and good luck.'",
        "'speaker_0': 'In the future. You're my hero. You did good. Thank you, ma'am. And keep on doing good. That's all I got.'",
        "'speaker_1': 'Thank you. Next up, Phil Workman.'",
        "'speaker_0': 'Thank you very much. Phil Workman. 130 Rampart Way. Denver, Colorado 80230. Found out when I was signing in on the iPad that I didn't have my readers. Which reminds me, I had a birthday not that long ago and and reminds me that I'm getting older as well.'",
        "'speaker_0': 'It also brings up that we started working on this project three years ago. Our first meeting with neighbors was in April of 2016 at the site, and I let the applicant describe what they do or what their vision for this.'",
        "'speaker_0': 'But I want to thank the neighbors that have worked with us over the last three years, as well as the city of Denver, to help get what our vision is, what what what the mission is of what the applicant would like to do, as well as what fits in within the plan and things that we heard from'",
        "'speaker_0': 'the neighbors as we went through this process. Basically, when we first met with the neighbors, the applicant came to us and and said, what, you know, what can we do? Let's meet with some neighbors here. And this has been vacant land for a long time.'",
        "'speaker_0': 'It's been commercial land. It was a parking lot used by a church. What's the vision? What, what what are the neighbors want? And we went through a process. We've met with the neighbors and small groups. We've met with neighbors one on one.'",
        "'speaker_0': 'We've met with the neighborhood organization. We've done a SurveyMonkey that was sponsored by the neighborhood, both in English and in Spanish with over 100 responses, which was gave us a lot of feedback of what we were looking to do and this or what what the neighbors were looking for at the site.'",
        "'speaker_0': 'And every one of our when we would announce our neighborhood meetings, we would go door to door with fliers, English on one side, Spanish on the other side. We didn't initially do that, and there was some came from the neighborhood and say, what about letting folks from the neighborhood also know what's going on in Spanish as well'",
        "'speaker_0': '? So that's when we put out the survey in both English and Spanish and also door to door. Initially, we we heard a lot and and just presentation, which I won't go through again, like the rationale or where we are with the particulars of the zoning.'",
        "'speaker_0': 'But we heard a lot from, you know, a lot has changed along this corridor. A lot of exciting things have happened in Branham birthday or a lot of exciting things have gone. A part of this is a corridor is the bike bicycle corridor, Parks Rec Center.'",
        "'speaker_0': 'I mean, this this neighborhood is is fantastic. And going to have some neighbors here speak to that in a second. So we wanted to take advantage of of that. And we wanted to provide a product that the neighbors can be proud of that would fit within the framework of what the neighborhood would be most interested in.'",
        "'speaker_0': 'Interestingly, there was a I'm.'",
        "'speaker_1': 'Sorry, but your time is up.'",
        "'speaker_0': 'Okay. All right. Next time around for any questions.'",
        "'speaker_1': 'Thank you. Next up, Greg Osborn.'",
        "'speaker_0': 'Good evening. My name is Greg Osborn. I am a partner in unlocking equity, the owner of the property. My address is 4021 Nassau Circle, West Inglewood, Colorado, 80113. Some of the initial questions that were thrown out were, what's the what's the mix here?'",
        "'speaker_0': 'What does this thing ultimately look like? And while we've done lots of iterations on what might work here, it all depends on what the ultimate density can be. I do want to commit to you all that we are attainable housing people and our vision for this site is and always will be attainable.'",
        "'speaker_0': 'Housing as informed by the neighborhood conversations we've had and the need in the market. I want to share one quick anecdote from an elderly gentleman who attended one of our earlier neighborhood meetings, and he said, Please build something here that my daughter who's entering the workforce in Denver can afford to live in while she starts her career'",
        "'speaker_0': 'in Denver. So that's something we won't forget in our quest. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Charles Moore.'",
        "'speaker_4': 'Hi there. My name is Shayla moore.'",
        "'speaker_7': 'I live at four, six, eight Stewart Street in Burnham.'",
        "'speaker_3': 'West and I've lived there for ten years now.'",
        "'speaker_7': 'I've been a residential realtor for over seven years and I've been on the Barnum Arnaud's board KBE for over four years. I spoke on behalf of Matt and his team at the.'",
        "'speaker_4': 'Zoning meeting.'",
        "'speaker_7': 'In March.'",
        "'speaker_3': 'And over the last few years, Matt and his team have reached out to Barnum's community many times, surveying what Barnum neighbors would like to see built, as well as attending and engaging with residents at multiple neighborhood meetings. One thing I hear from the.'",
        "'speaker_7': 'Neighborhood in our meetings.'",
        "'speaker_4': 'Over and over again is that we need attainable.'",
        "'speaker_7': 'Housing that is.'",
        "'speaker_3': 'Compatible with Barnum.'",
        "'speaker_7': 'Not with our northern neighbors.'",
        "'speaker_3': 'I believe that Barnum needs density.'",
        "'speaker_7': 'In order to create this attainable housing. As you know, right now, the site is an overgrown parking lot. I'd like to see this development set a precedent for future developments in Burnham, one of attainable housing.'",
        "'speaker_4': 'Architectural facades in line with the neighborhood, and one that encourages more community and.'",
        "'speaker_7': 'Activity.'",
        "'speaker_3': 'Within Barnum. And I believe Matt and his team.'",
        "'speaker_7': 'Can do this for us. That's it.'",
        "'speaker_1': 'Thank you. Next up, Matthew Guarino.'",
        "'speaker_0': 'Good evening. My name is Matt Guarino. I live at seven 221 South Pontiac Way, Centennial, Colorado. And I'm a partner with Greg Osbornes who spoke just a minute ago and we received a call four plus years ago based on our mission from someone that owned, owned the church and this parking lot.'",
        "'speaker_0': 'This property was not on the market, but they heard our mission was and this is on the back of one of our cards. It's twofold. One is to provide housing for those that need it. And the second part is to create opportunity for those that want it.'",
        "'speaker_0': 'You know, we understand that nothing happens without a roof over your head. So that's why we put that as a focus for our work. But also, we're trying to create empowerment and that trying to encourage people that they can own their own home.'",
        "'speaker_0': 'So the sisters, not nuns, but the sisters that own the church. Where this was a part. They also owned this parking lot, called us because of our mission. And they said, we'd like you to buy this because we think that you can do something important not only for Barnum, but hopefully for the city.'",
        "'speaker_0': 'And one of the things during this three plus years. Talk about birthdays. Birthdays, three plus years that we've been on this journey is that I've been blown away by the folks at Barnum. Blown away. You know, there's so much divisiveness, divisiveness in the world today and people making the other side wrong to make their side right.'",
        "'speaker_0': 'We've had 30 town hall meetings, 30 to create this outcome. Opportunities for housing for those who need it and opportunities for those that want it. And we're really proud to be coming towards the end of this. And in this period that we've been working on this process.'",
        "'speaker_0': 'My oldest child, I have a 24, 22, 20 and 18 year old graduated college, worked for the U.S. government, doing a Fulbright scholarship in South America, came back and she can't afford to live in Denver. It gets really real when that starts happening.'",
        "'speaker_0': 'So we are more empowered and emboldened than ever to make this happen. And we appreciate very much the folks at Parnham and hopefully we have your support tonight. Thank you so much.'",
        "'speaker_1': 'Thank you. Next up, Sarah Brown.'",
        "'speaker_7': 'Hi. My name is Sarah Brown and I am a resident at.'",
        "'speaker_3': '114 Knox Court.'",
        "'speaker_7': 'Which is less than two blocks from the potential site here. And the reason that I am here tonight is my husband and I finally were able to afford this house in this beautiful, wonderful neighborhood. And we've taken a lot of pride in this home.'",
        "'speaker_7': 'It was built in 1915, and Helen Bartle originally did own this home at one time. We put a lot of effort into preserving this house and I've had to do a.'",
        "'speaker_3': 'Lot of research to learn about what's happening here.'",
        "'speaker_7': 'I am an education coach with early childhood.'",
        "'speaker_3': 'Teachers, so I knew nothing about this.'",
        "'speaker_7': 'So I have been reading and following along for over a year now. And the biggest thing that I, I like about this is that.'",
        "'speaker_3': 'This process is unique and that the neighbors and the.'",
        "'speaker_7': 'Neighborhood organization have the opportunity to work through the site development plan process, ensuring architectural dignity in Barnham. And I think that's really important for those of us that live there, especially being that close. Thank you.'",
        "'speaker_1': 'Thank you. Next up, John Coleman.'",
        "'speaker_5': 'Hello. My name is John Coleman. I'm a resident of Barnham. I live at 345 Irving Street, so actually just right around the corner from this proposed site here. I'm actually the president of the the Barnham R.A. Organization.'",
        "'speaker_12': 'I'm not actually speaking on behalf of our organization.'",
        "'speaker_5': 'Anything I say is just coming from me personally. But I've taken that role since January of this year. In addition to that, I'm also in residential real estate, and I've been in real estate for about four. This is my fourth year here, so I kind of know the.'",
        "'speaker_12': 'Some of the markets as well around.'",
        "'speaker_5': 'Our house as well. I guess one of the things I kind of want to bring up in the I guess my biggest.'",
        "'speaker_12': 'Point is that through through the last several years that we've been talking about.'",
        "'speaker_5': 'This with Phil and the Parker Company, is that I mean, a this is a developer that is actually looking at what the community wants and working with us and saying, hey, you know, what does the community want to see?'",
        "'speaker_5': 'Do you want it? What esthetically do you want to see? We can't work on that yet because we have to get through this process first. So I really appreciate that they're actually working with the community and not just saying, Hey, we're going to build this and we're going to, you know, not take anything and take into consideration'",
        "'speaker_5': '. On top of that, I feel like there was three main areas that we could actually have this lot developed into because we know it's going to be developed.'",
        "'speaker_12': 'It's just how long it's going to take to to be developed.'",
        "'speaker_5': 'And so those three options were residential single family homes, which is zoned now for with the ADA use on there.'",
        "'speaker_12': 'One of them was a mixed use which would have retail on.'",
        "'speaker_5': 'The bottom and residential on top, which I believe was denied and taken out of the context here. And then the other option, which is what we're looking at here, is the affordable housing and the attainable housing that would be smaller units.'",
        "'speaker_5': 'I am all for that. As I know for a fact that single family homes with resident or ADA use in the back would be well over half a million dollars. I know that I'm closing on a property that is a 82 home with the single family home blocks from this, and it's over half a million dollars and'",
        "'speaker_5': 'it's built in 1950. So I know for a fact that this is not going to be affordable if you put single family homes with 80 use, if we can build something that's actually obtainable because that's the other thing, there's affordability and there's a attainability and they're kind of two separate issues.'",
        "'speaker_5': 'But I know for a fact that that's a lot of when my my first time homebuyers are dealing with. So if we can build something that would actually be affordable and obtainable for people.'",
        "'speaker_10': 'I think that's the best use of this out of this lot. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Are there any questions from members of council on this? Councilman Espinosa.'",
        "'speaker_10': 'Yes, I think I.'",
        "'speaker_5': 'Actually Jeff and the owners as well. So. Is there is there any limitation prohibition on what can be built here, meaning that? I mean, there's a lot of talk about this affordability component, but, you know, in the study X, a townhouse is not an allowed form, but in the IMU it is.'",
        "'speaker_5': 'But in order to let it, which is a very different outcome than what is being seemingly discussed about the apartment form.'",
        "'speaker_12': 'So so you're you're wanting to know if I understand it.'",
        "'speaker_5': 'The resumption of developer agreement that compels this affordable project to go forward.'",
        "'speaker_12': 'Not as part of the rezoning.'",
        "'speaker_5': 'Is. So to the owners, is there some sort of agreement in place that compels an affordable project to go forward?'",
        "'speaker_0': 'There's not an agreement that I'm aware of. You know, we've like you've heard we've been in this thing for three and a half years and we have no idea what the numbers are for, depending on what the what the density outcome is.'",
        "'speaker_0': 'We've got several different concept plans, all in the attainable housing space, but nothing definitively ironed out yet. We've got job costing to do. We've got architectural to do. We've got all kinds of work to undertake. Once this, you know, hopefully we get we get your support, but there's no definitive agreement in place.'",
        "'speaker_0': 'I assume that that would be part of the development plan and permitting process once we submit.'",
        "'speaker_5': 'Actually, I'm asking a question that is recognizably extra extra outside of the two true criteria, but it is been a lot of the dialog, both from you, your representation and the community. And so therefore it's part of the public hearing and I'd like to elaborate.'",
        "'speaker_5': 'So attainable housing. What is your definition of attainable housing?'",
        "'speaker_0': 'So attainable housing to me is very simply something that an entry level worker could afford, whether it's market rate, whether it's rental in the apartment form, or whether it's if these things are rowhouses or townhouses, if that's the highest and best something that first time homebuyer could afford.'",
        "'speaker_0': 'That's what we do. That's our space. That's our definition. Okay, great. And I just wanted to elaborate. You asked a question about, am I right that that's typically something that's associated with low income tax credits, right? Public subsidies or public funding?'",
        "'speaker_0': 'We are completely private. Right. So we don't have those kinds of requirements. But, you know, we self-imposed those on our you know, on our work. What we're trying to do is create attainable housing. That's everything, you know. But for us, the speed and the the sometimes limitations that come with that are what we're trying to avoid.'",
        "'speaker_0': 'So our goal is to create, like said first time homebuyer.'",
        "'speaker_5': 'So I didn't actually say, am I? But I'm familiar with it. And so I appreciate you bringing it up. So in your attainable housing goals, what is your target? Am I for a representative household size of how big?'",
        "'speaker_0': 'We wouldn't. That's again, that's the criteria for it. But what we would say is that just like Greg indicated, for people that are, you know, first time homebuyers, that's what we're looking for. Right. So to say that that artificial income level is not how we look at it.'",
        "'speaker_5': 'Okay. So, Jeff, the real question I had to begin with is. You know, in first off, I want to appreciate the fact that CPD came forward with a 2.5 with waivers with the 60%, 6535 split, which is different than how we've been presented a similar waiver in the past.'",
        "'speaker_5': 'That said, this will allow an apartment for the apartment form still allows side by side dwelling units. Fortunately, there's a 50% maximum on the gross gross for the GFA of the structure. So we can't get a true slot home product.'",
        "'speaker_5': 'But you sort of could the. Is there anything. You know. Well, actually, it goes back to him now. And sorry, I'm realizing that this goes back to my original question about is there any commitment to use the apartment form for stacked units?'",
        "'speaker_5': 'But it's just one of the schemes, is that correct?'",
        "'speaker_12': 'It's it's they have that option and there's more flexibility with the apartment form than like the row house form, for example. But there's no mandate to do it stacked. It just allows more flexibility with the configuration of units.'",
        "'speaker_5': 'Okay. Then last question to you guys. Do you guys do condos? Because, I mean, is this would you this be a for sale product in a staff configuration or only a rental product in the stack?'",
        "'speaker_0': 'Once we get our density number, we can go back to the drawing board and run iterations on all of the product types allowed in the form that we're discussing, condos would absolutely be one of those performers that we would run, as well as for rent and row house.'",
        "'speaker_5': 'Okay. Thank you, guys. Thanks.'",
        "'speaker_1': 'Thank you. Councilman Espinosa, Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. I was looking at the map. Mm hmm. How long is that parking lot? I mean, just. And I live not too far away. I live over on Sixth and Knox. All I remember, I mean, the little neighborhood of one of the neighborhoods I grew up in.'",
        "'speaker_8': 'All I remember is that just being a parking lot, I don't remember anything else on that. I'm trying to think and that's a good maybe 35 years of of of memory that I can tap into what was on the site before and when was on that and when was that?'",
        "'speaker_12': 'Yeah, we had trouble pinning down a specific date, but we were looking at historic aerials and at least since the mid-nineties we found it was it's been a surface parking lot. And before that and I don't know exactly when it got demolished, but before that, the only structure we found evidence of was a a small telephone company'",
        "'speaker_12': 'service garage structure. And so I don't know the exact square footage, but you could see from the footprint it's pretty small, relatively overall.'",
        "'speaker_8': 'So I wonder if we went into the records if or any library archives if that at one point was connected to the Westwood Telephone Company. That's where Westwood gets its name, by the way, a lot of people think, well, Westwood, you know, as we California, this is not Westwood L.A., but it's completely different.'",
        "'speaker_8': 'But it it derives his name from the Westwood Telephone Company. A lot of the folks that were workers of the 20th century and turn of the century, but, uh, for those thirties were employees. I wonder if there anything.'",
        "'speaker_8': 'I mean, I can't do anything about it now because it's demolished. And I wonder if there's anything. That's why I'm curious as to what was there before and if that was the connection. Can you talk to me a little bit about if we're driving?'",
        "'speaker_8': 'If you're walking excuse me for riding bikes because there is a bike lane there. If you're commuting down Knox, you have a lot of single family homes. Some of them are in. You have some multi-unit. You have to go to a few to unit multi-unit uses.'",
        "'speaker_8': 'There you have commercial. You have front yards. How far is the setback from the property line.'",
        "'speaker_12': 'To the door? So it will be under the new zoning and the current zoning is subject to a context sensitive senator from Knox. So the baseline is 20 feet, which is, I think, pretty consistent with what's out there now.'",
        "'speaker_12': 'There would be an analysis done to make sure it essentially lines up with what's there, anything that gets built and good.'",
        "'speaker_8': 'Now, looking at the the corner. So that would be the. Looking at the intersection, the northeast corner, which is as you go up in that property, what does that corner look like? Is there a community space? Is there bike rack?'",
        "'speaker_8': 'Is somebody's front yard? I mean, I want to get a kind of a just a visual in terms of what that what that footprint would look like and if there's any kind of entryway into the units at that point or are they all just facing the court?'",
        "'speaker_8': 'Is there any kind of diagonal corner there?'",
        "'speaker_12': 'Yeah, that unfortunately can't answer. That's more of a design question. I don't know if the applicant's a be more of a question of the applicants in terms of the I mean, there's certainly bike parking that's required and things like that, but it doesn't get into architectural standards in terms of the zoning.'",
        "'speaker_8': 'And I understand that as part of zoning, I'm just trying to kind of visualize when you guys see context and context sensitive, you know? Barnum Our neighborhoods context is very the context is that it really has no one unique context that's a little different.'",
        "'speaker_8': 'You kind of have a hodgepodge, everything. You have a bungalow, next thing you know, you have a prefab, next thing you know, you have a stucco. Who knows what? Right. And then then sometimes you have adobe look in all the units as well, too.'",
        "'speaker_8': 'So I'm just trying to figure that out. All right. And I saw that there was some opposition with that opposition. I mean, there was some letters that came in the readdress those issues.'",
        "'speaker_12': 'Yeah. The there's one letter that didn't explicitly state opposition to the rezoning or just express concerns.'",
        "'speaker_8': 'And that's what I wanted to be clear.'",
        "'speaker_12': 'The concerns yeah, the concerns were and I could pull it up and it's certainly in your packet but one the scale of buildings potentially here relative to the surrounding area. And so going through each one I guess for example.'",
        "'speaker_12': 'So in that case, the scale in terms of how tall a building could be is, you know, something that is actually similar to what's allowed today. So the height is actually consistent today with what is going to be allowed under this new zoning, which is a different you could do multi-unit instead of single unit.'",
        "'speaker_12': 'The second concern is related to, I think, addressing the Burnham Neighborhood Plan. And so I think there were citation of some policies in there about preserving the low density residential character. And so that is certainly an adopted plan and we have to look at it.'",
        "'speaker_12': 'But I think on balance, in terms of the age and the change of conditions and the other citywide policies, staff's opinion was, you know, looking on balance of all the policies that the request are still consistent with adopted plan policies.'",
        "'speaker_12': 'The third issue raised in the letter was a preference for another zoned district and that being Area 2.5. And so that was a zone district that was part of the suite of options we looked at with the applicant team and ultimately it wasn't going to work for them.'",
        "'speaker_8': 'Okay. One more question, Mr. President, if I may. And I just I had it in they give me another year on my life here. So I'm starting to really feel that now. I'm 41, just July 18th, for the record.'",
        "'speaker_8': 'I am wondering about the neighborhood plan. How old were you in 1986?'",
        "'speaker_12': 'I'll take the fifth on that one. I was.'",
        "'speaker_8': 'Archive of my life, so I was.'",
        "'speaker_12': 'Probably watching Top Gun the day that it was adopted. Yeah.'",
        "'speaker_8': 'No, man Top Gun came out a little earlier than that. So is this being addressed? So is there any kind of update? My my worry is, is some of these older plans. Villa Park is 1991. Before we before we touched Westwood, that was 1978 and 79.'",
        "'speaker_8': 'Barnum is from 1986. It's a very different neighborhood is I think there's something coming up. Where is this being scheduled for review? And I'm I'm asking this in the context of this rezoning, because this is not the first time that we're probably going to see a rezoning in this neighborhood in the future, especially with this old, old'",
        "'speaker_8': 'neighborhood plan.'",
        "'speaker_12': 'Gosh, I apologize. I'm not sure when it's scheduled. And I know that given the date of the plan, I don't want to misspeak. But I believe it's it's up in the priority list.'",
        "'speaker_8': 'Okay. That's why I wanted to thank you so much.'",
        "'speaker_1': 'Thank you. Guzman-Lopez Councilman Flynn. Thank you, Mr. President. Councilman Lopez and Jeff actually got to the core of what my question was. It was about the single letter expressing concern, and I have read that email from Mr. Krueger about it.'",
        "'speaker_1': 'And I do note I guess the only thing I'd be interested in clarifying is does CPD have a threshold for the age of plans when when it because the direction in the Barnum Barnum West neighborhood plan would argue against this rezoning.'",
        "'speaker_1': 'But that was 1986. And Councilman when I was alive and I was probably sitting at that table covering the council, passing that plan for the newspaper. But I don't have a specific memory of it. But how when do we cut them off and no longer rely on them, particularly when it has direction that argues against the rezoning'",
        "'speaker_12': '? Yeah. I wish I had a specific metric for you. I don't. I think it's it's a case by case determination made. But I think in this case, you know, when you consider the breadth of plans and the average age of a plan, it's really in the in the very lower tier in terms of age.'",
        "'speaker_12': 'And so more.'",
        "'speaker_1': 'Important, I guess I'm sorry to cut you off, but more important than would be, how much change has there been in that neighborhood since the plan in Barnum? There's been a significant change since 1986, maybe.'",
        "'speaker_12': 'Yeah, that's certainly true. We've seen a lot of of new investments. The park, for example, nearby the West light rail line coming through there. I think that, you know, 30 plus years has been a lot of change. So it's a big factor in looking at the age of the plan relative current.'",
        "'speaker_1': 'Thank you. And well, certainly if if if a 3032 year old plan supported a rezoning 32 years later, we'd certainly be relying more on it. And we wouldn't be dismissing it, would we? Probably not.'",
        "'speaker_12': 'I think we'd still look at the plan with skepticism, regardless of the change conditions.'",
        "'speaker_1': 'Thank you, Mr. President. Thank you, Councilman Flynn. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Jeff. Can you tell me what kind of parking requirements would be included as part of this development? And and have you have you all jointly calculated just roughly how many total units can be on this site?'",
        "'speaker_12': 'Yeah, the first into the first question is one space per unit would be the parking requirement and there's bicycle parking requirement to figure out exactly what that is. But the second question, we haven't because we just don't know at this point.'",
        "'speaker_12': 'Unfortunately, it could in terms of the number of units. And so it really depends on the type of units and the configuration of units. And so, for example, we could be looking at really small micro units or we could be looking at 1500 square feet, you know, two and three bedroom units.'",
        "'speaker_12': 'So not knowing what the unit configuration is makes it really difficult to get at a unit count. But there certainly would be vehicle parking one per unit, regardless of the size of the unit.'",
        "'speaker_9': 'Okay. So let me ask either Matthew or Greg, if you wouldn't mind addressing the same question, just trying to get an idea of how many units you're proposing to have on the site. And I know it's not something you have to tell us, but I would assume you haven't spent all this time going through the process with'",
        "'speaker_9': 'the neighborhood without some idea of, you know, generally what you could build on the site.'",
        "'speaker_0': 'So so that's true. We've we've been running scenarios for three and a half years, you know, pondering what might happen here. A reminder that currently four units could exist used by right on the site, which clearly is not the highest and best use.'",
        "'speaker_0': 'Regarding parking, I would I would say that the remember the back 35% is restricted to single storey. So that's an ideal use for the parking required on the site. But, you know, we've run scenarios from, you know, from the from the four units when we first bought this thing up to, you know, 30 or 40 units in'",
        "'speaker_0': 'the micro sense, 15. I mean, so much of this is is hard to even address because it's not only the unit count, it's the cost to build it. And as Matt said, we're private people. We're not asking for public money to help get this thing done.'",
        "'speaker_0': 'It's all our money. So we want to we had all these costs and risk analyzes to do to run the numbers and make them work. So that's only just really begun with with the with the density in question.'",
        "'speaker_0': 'But I think in keeping with our mission of attainable housing, more units is our is our extreme bias. I mean, more people need housing in the city and more is better in our sense. So that's what we'll try to do as long as the affordability numbers are there from a market perspective.'",
        "'speaker_9': 'So if you do micro units, does the parking requirements change significantly? And Jeff, you may be better to answer this question. So if.'",
        "'speaker_12': 'Yeah. And I apologize. I don't.'",
        "'speaker_1': 'And Jeff, before you answer that question, we're having a little bit of trouble, the interpreter hearing you. So if you could speak a little bit louder in the microphone, that'd be appreciated. Thanks. Yeah.'",
        "'speaker_12': 'Gosh, I don't I should know this. I believe there is some flexibility. I could look into it for micro units and some parking reductions. I know there's flexibility for proximity to transit. This is not going to be subject to that.'",
        "'speaker_12': 'But I'd have to look into that if the lower square footage brings you lower parking requirements. And I could do that.'",
        "'speaker_9': 'Okay. That that would be helpful to know. And so while you're doing that, the the last question that I had was related to whether there has been any exploration on where a curb cut would go, assuming there has to be parking on site, would that be off a court or would that be on the avenue?'",
        "'speaker_12': 'Yeah. So we asked that question of the folks that we review the site plan and what they told us was no access would would be allowed off of Knox Court. It would come off the alley more than likely.'",
        "'speaker_9': 'Okay. I'm sorry. I do have one last question. And it is about the the difference between the IMU 2.5 and the assumed DCS. One is the half story. The the main difference between the two in terms of of I know the the height is the same, but yet the IMU is being requested because it allows the 2.5'",
        "'speaker_9': 'for the apartment concept.'",
        "'speaker_12': 'Yeah, the height is the same actually in terms of of how it's measured in feet and number of stories actually between the current zone district and the proposed district. It's just the ability to use the apartment form that allows a little more flexibility with the unit configuration within that sort of building envelope.'",
        "'speaker_9': 'Okay. All right. If you I don't know if anybody else has questions, but if you could just check on the.'",
        "'speaker_12': 'Yes.'",
        "'speaker_9': 'Amount of parking for the micro units, that would be really helpful to know, I think.'",
        "'speaker_12': 'Yes.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Ortega. That concludes the questions. The public hearing for Connersville two for seven is closed. Are there comments by members of Council Councilman Lopez?'",
        "'speaker_8': 'Thank you, Mr. President. I wanted to thank folks for for doing such a good job of making sure that there is a lengthy community process, a robust community process. Y'all have been working this for quite a while and making sure that you're taking into account the current context in the neighborhood is good.'",
        "'speaker_8': 'I think there's been different iterations with different zone districts. I really appreciate you me coming to that meeting mean to that middle. There is no letter of opposition there. Council chambers are not packed with a bunch of folks who are who are opposed to it.'",
        "'speaker_8': 'And that's a good sign. And sometimes you will get a lot of folks in here upset about something like this and on its on its on its merits. And based off of the criteria that we have, it does meet it.'",
        "'speaker_8': 'And the important thing is it's a parking lot. It is a parking lot. And it's always been a parking lot since I can remember I was eight years old in 1986 and running around that neighborhood. And the fact that that parking lot will not be home to weeds, but be home to potentially families and folks that actually'",
        "'speaker_8': 'can afford to live there. And that's that's what matters. And, you know, taking that context and, you know, context and design is nothing. It's not something that we can consider legally based on that criteria. But you're going that extra mile and kind of helping.'",
        "'speaker_8': 'Describe to us what that looks like based off of the input that you've had in the communities is a good thing, given that I think, you know, you have an opportunity to actually create something that could be a landmark in this area.'",
        "'speaker_8': 'Burnhams For a little landmarks. Some of them are very disappointing forever. I thought, you know, Barnum had the zoo and all the zoo animals and all that stuff. And I come to find out that even the Barnum home, P.T. Barnum ever even laid foot in it.'",
        "'speaker_8': 'But it's good to have something that's not disappointing in terms of history like that. I think this is an opportunity for for you all to demonstrate to everybody else in the city that something like this can be done, giving a good community process, making sure you're taking those those strategies and those that that input into account.'",
        "'speaker_8': 'I think that matters, right? As residents, we drive by it every day. We live by it every day. We want to be part of the solution. But at the end of the day, it's still our neighborhood and it's a good, happy meeting.'",
        "'speaker_8': 'So and thank you for coming. And that traffic must have been crazy coming. Yeah. There are no more shortcuts to the neighborhood. And anyway, that's another conversation. Thank you.'",
        "'speaker_1': 'Thank you. Guzman-Lopez Councilman Espinosa.'",
        "'speaker_5': 'Phil, Phil Workman, Speedy Jeff Hurt, Kyle Dalton. You guys did it. You painted me into a very, very difficult corner. And that one is you've painted this rezoning in just the right ways, big in. What I mean by that is this is a significant increase in entitlement and over any sort of adopted plan and it's loosely affiliated'",
        "'speaker_5': 'to the blueprint Denver but in it hits those recommendations but it is you know one of the things I've already articulated since we've adopted that and even before we adopted the new plan was the need to customize zoning so that we don't just take the recommendations verbatim and start mapping them into existing zone districts and hope for'",
        "'speaker_5': 'the best that you build in to those zone districts. The, the other things that those plans articulated. Now, I'd love to see the equity components that have been discussed here hardcoded somehow, but at least the form the transitional pieces are there with that 6535 split, the one story limitation on the rear.'",
        "'speaker_5': 'This is dramatically different than the holly situation that we had, which allowed that two and a half stories all the way to the rear setback line in a similar context. And so you've done it formally, but the thing that gives me pause but it's not enough pause is that we're now allowing both the apartment form and the'",
        "'speaker_5': 'townhouse form to enter into this into this parcel, into this loan line. And that's an easy exit in this market, right? Is if these guys realize that they can't make the numbers work on these affordable units, but they can capture equity that helps them complete their mission elsewhere.'",
        "'speaker_5': 'It's an easy turn and flip to another developer who can build townhouse product. Now, historically, that would have been a slot home. And that what bothers me about that is then we are jumping, we're going from Jefferson Park in the Sloan's Lake into West Colfax and then jumping Lakewood Gulch and Sixth Avenue into this neighborhood with a'",
        "'speaker_5': 'slot home. The good news is we did the slide home text amendment. So the combination of the form restrictions that are brought by the waivers and the slot home text amendment would sort of at least compel a different outcome from the public realm side.'",
        "'speaker_5': 'But it doesn't. There's nothing in here that precludes this from being market rate product scaled at a size that hits the maximum top dollar. And but unfortunately, that's not justification for denying an application. But I've seen all of this mostly for staff.'",
        "'speaker_5': 'Which is that you've painted a very narrow box that satisfies essentially all the all the things that I would push back on. But it doesn't hit a lot of those vision elements just by hitting the base entitlement and the upper storey step back requirements.'",
        "'speaker_5': 'There are other things in that plan that should be driving. There's no access to high frequency transit. This is just a couple blocks, three blocks from the fire station. You know, it's a dangerous place for kids necessarily to be at if there's high speed vehicles going up and down knocks.'",
        "'speaker_5': 'And so but it is access to park. So there's a lot of other things in those vision elements that I think we still need to be grappling with as we go, as we do land use map amendments and text amendments going forward.'",
        "'speaker_5': 'But this one will check all the boxes. And so you'll see me sort of begrudgingly supporting it, because until this project comes to fruition with those with that affordability lens, I worry that it may not. And that is that has ramifications for this community going forward.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Seeing no other comments, Madam Secretary, roll call.'",
        "'speaker_9': 'Excuse me. So I just wanted to see if we can get the final question, the final answer to the question about the parking on the micro units. Thank you.'",
        "'speaker_12': 'It's a quick answer. No, they're not. They wouldn't be allowed to have the parking reduction for a micro unit on this zoning.'",
        "'speaker_9': 'Thank you. I appreciate that. Thank you.'",
        "'speaker_1': 'Thank you, Madam Secretary.'",
        "'speaker_4': 'Black eye.'",
        "'speaker_10': 'Brooks. I.'",
        "'speaker_4': 'Espinosa. Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Gilmore. I learned in.'",
        "'speaker_10': 'High.'",
        "'speaker_4': 'Cashmere. I can eat. Lopez. All right. Ortega. SUSSMAN Mr. President.'"
    ],
    "Zoning Change for 2535 E. 40th Avenue in Elyria Swansea.": [
        "'speaker_1': 'Madam Secretary, please close the voting, announce the results. 12 hours 12 hours counts Bill 247 has passed council minutes. Will you please put council bill 127 on the floor?'",
        "'speaker_7': 'Yes, Mr. President. I move that council bill 19 Dash 127 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. The continued public hearing for Council Bill 1 to 7 is reopened. Since this is a continued hearing, there will not be additional public testimony, nor will there be an opportunity for written information to be provided to supplement the record other than what the Council has requested.'",
        "'speaker_1': 'We will proceed with questions from members of council at this time. Councilman Brooks.'",
        "'speaker_5': 'Yep. Thank you, Mr. President. I want to call a representative from the Jazz Coalition and also a representative from the 40th and the cite. Bruce, I want to come up here, probably the representative to kind of talk about where where we are and what has transpired.'",
        "'speaker_5': 'So Bruce and Nola. Ladies first.'",
        "'speaker_3': 'What has transpired?'",
        "'speaker_5': 'Yes. Just. You have a letter. You've you've submitted that to the council. So just on the record.'",
        "'speaker_3': 'So everyone should have got the letter on our position today. The community, the Coalition three are knows and adjacent community members that participated in our collective process did decide to oppose this reason in favor of maintaining the I a zoning.'",
        "'speaker_3': 'If we did a less than 30 day process with the developer or the owners representatives to come to a type of agreement, I think we got somewhere in that agreement. The problem is that it wasn't addressing displacement issues in particular, which is our main concern with this project.'",
        "'speaker_3': 'I would I'm the only person here that's not a Swansea resident, so I'd really like it. If you want to hear more of why neighbors made that choice, that we bring some people up that are responsive neighbors. To answer that question.'",
        "'speaker_5': 'Another, what was the vote on that?'",
        "'speaker_3': 'So we had a three hour meeting to talk about this. We talked to a lot of people at their doors. We knocked on doors three different times within this period and talked to neighbors. The people that actually came to the meeting, we had 12 people vote to not support seven to or to sign sorry to sign the'",
        "'speaker_3': 'agreement, seven to sign the agreement. And we had several people that needed to leave early or abstain from the vote entirely. This during the conversation and leading up to the process, there was always an agreement of everyone that was participating that we would make this decision at this meeting and all of us that maybe did vote yes'",
        "'speaker_3': 'were in agreement with moving forward with the no.'",
        "'speaker_5': 'Okay. But that's people who both voted no and yes here. So we can get a perspective from from them, even though they're supporting a group. There are folks who voted yes and no, both here from the Swansea neighborhood.'",
        "'speaker_5': 'So we can get their perspective as well represented in the room.'",
        "'speaker_3': 'Well, sure, but we're not. The collective process is what our outcome is. So all of us here are here to defend the outcome that we came up with, for sure.'",
        "'speaker_5': 'It's just helpful for us since we weren't a part of that iterative process to hear all of that. Bruce, do you want to get a chance to share from your perspective? Would be good to hear where you came into with this agreement.'",
        "'speaker_5': 'What suggestions that the coalition made that you agreed to and kind of, you know, where there was disagreement.'",
        "'speaker_12': 'Sure. Thank you, Councilman. Happy to, Bruce O'Donnell. And I'm joined by Bill Moore, who is a partner in the project and can help answer some questions as well. So I've not seen this the document that NOLA is referencing that went out today.'",
        "'speaker_12': 'So I'm flying a little bit blind on whatever it says. But we agreed about a month ago tonight to enter into mediation and it was run by Steve Charbonneau and we had three meetings and made progress we think in each meeting and in particular in the last meeting and there were many, many aspects of the community that'",
        "'speaker_12': 'we were in agreement with and committed to in writing on in a signed community benefits agreement that we would fulfill a whole laundry list of community benefits and is information I have sent council in the last week or so underscores.'",
        "'speaker_12': 'We remain committed to these and will implement them once the property is resolved. The in our view, the one thing that resulted in not reaching agreement had to do with displacement, as you've just heard. And the ask was for a per market rate dwelling unit impact fee be committed to that.'",
        "'speaker_12': 'I think the idea was that it would be paid out building permit and that this impact fee would go to a coalition related entity of some type. It was never determined in the that impact fee would be used for mitigating displacement, as you heard.'",
        "'speaker_12': '25 people, I think, voted. There were four abstentions. Pardon me, three, I think abstentions, which were the RINO's in we've been had been trying to engage with the renos since July of last year and they still refused to show up a few days ago by abstaining on Thursday.'",
        "'speaker_12': 'And where I'm going with this is, is that if an impact fee to mitigate displacement is good policy, it should be thoroughly vetted. It should be adopted citywide by ordinance and in not experimented with on an ad hoc case by case basis by governmental entities.'",
        "'speaker_12': 'And so we we couldn't agree to it for that reason. And it's our belief and understanding that that's why the neighborhood groups chose to not support the community benefits agreement.'",
        "'speaker_5': 'All right, Mr. President, can I just read for the record what has been agreed upon and then just ask some questions? Actually, I'll let some of my colleagues have some questions. But I just for the record there, this is in the agreement.'",
        "'speaker_5': 'This is what I think, you know, the gas coalition and the developer tried to come to as a benefit results of neighborhood negotiations, a new commitment to provide 22,000 square foot community coops storefront that would be available for neighborhood businesses.'",
        "'speaker_5': 'Rent free commitment for donation of land to urban gardeners for a community garden. Commitment to provide total eight live work units for artists agreement to establish program to hire qualified local construction professionals and development commitment to work in good faith.'",
        "'speaker_5': 'Exclusive with brothers redevelopment and Colorado Land Trust for 90 days after the rezoning approval to execute on an affordable housing agreement seeking opportunities for deeper. Affordability commitment to establish establishing Community Advisory Council, to receive information to provide input from the Metropolitan District that is intended to be formed so the community can be involved.'",
        "'speaker_5': 'Aware of the designs and public amenities. Traffic Mitigations during construction. Commitment for sharing the completed traffic studies with all neighborhood organizations in a commitment to donate 20 $500 to establish Community Legal Defense Fund. No is just my question.'",
        "'speaker_5': 'What was the. When the community voted no. You know, there wasn't a a counter kind of proposal of this. This is what's missing from the overall. What do you feel like or can you say what you feel like is missing in this?'",
        "'speaker_3': 'I think the feeling was to two sides. One is in the agreement that the the the promises that were made that address displacement, like the 90 day negotiation with brothers and Cecile to you know myself as self interest in building a committee land trust.'",
        "'speaker_3': 'I'm very excited about that. The community really felt like that was a it wasn't a commitment. So we don't know what happens if we don't know what they're putting on the table. What happens if that negotiation doesn't work out?'",
        "'speaker_3': 'And then the 90 days passes and nothing happens. So we there weren't any milestones for what happens. And we had actually talked about in several of the negotiation meetings, putting in milestones and criteria for if if the if this is a process oriented statement, then there should be milestones and criteria.'",
        "'speaker_3': 'And that never happened. We really didn't get a chance to actually write the the agreement itself or to kind of give a significant feedback, mostly because of the timeline being happening so quickly. But I think the combination of not having concrete outcomes around displacement and then also just lack of trust and disappointment in the city to back'",
        "'speaker_3': 'up any of these efforts as well.'",
        "'speaker_5': 'What do you mean, the city to back up?'",
        "'speaker_3': 'Part of our ask at the last hearing was that an anti displacement action plan happen for protecting surrounding neighbors. That never happened. We asked for an extended traffic and construction impact study that would complement what the developer was giving to their traffic study that just kind of looks at their area.'",
        "'speaker_3': 'But looking at overall the construction impacts, we never even got an A response on that. So we just felt let down overall by. The ability to for any of our concerns to be addressed during this process from the city.'",
        "'speaker_5': 'Okay. Thank you, Mr. President. I yield my questions to the. Do you.'",
        "'speaker_1': 'Think. Councilman Brooks, Councilwoman Black.'",
        "'speaker_7': 'Okay. Thank you. Thank you, everyone, for being here tonight. And also, thank you for all your work. I have just some clarification questions for you. So the organization you represent is Globeville, Elyria, Swansea, which is a huge geographic area.'",
        "'speaker_7': 'Correct.'",
        "'speaker_3': 'Globally or in Swansea. Yeah. It's the zip code 802 and six. Yeah.'",
        "'speaker_7': 'So it's a huge geographic area and I really appreciate all the great work you've done. And I'm just curious about the people who are involved at the meeting, the people who are here tonight and the people who were here last time, because it's some of the people we've seen here for a lot of other things we've been'",
        "'speaker_7': 'voting on. And this particular area is just a small section of the overall neighborhood. And when I look at it on the map, it's really a long, skinny neighborhood that has a railroad on one side and then 40th Avenue and Colorado Boulevard.'",
        "'speaker_7': 'So I'm just really curious how many of the people who attended that meeting and how many people here tonight actually live in that in that neighborhood that is in that section.'",
        "'speaker_3': 'Between Clayton.'",
        "'speaker_7': 'Next and 40th.'",
        "'speaker_3': 'Sorry, say that again, between the.'",
        "'speaker_4': 'Railroad tracks to the north, 40th on the south.'",
        "'speaker_7': 'And then the property is on the west and on Colorado.'",
        "'speaker_4': 'Boulevard.'",
        "'speaker_3': 'So they do Rosetta's Raimunda.'",
        "'speaker_7': 'To you raise your hand if you if you live in that section the.'",
        "'speaker_3': 'And Maria.'",
        "'speaker_7': 'Yeah. And then at that meeting of those 20 something people.'",
        "'speaker_3': 'It was about half neighbors. And it was actually the neighbors most adjacent to the property that were the most adamant about voting not to sign it.'",
        "'speaker_7': 'Okay. So of those 25, half of them live in this section. So once again, thanks.'",
        "'speaker_1': 'Thank you, Councilman Black, Councilman Espinosa.'",
        "'speaker_5': 'I know since you're up there when you had those meetings with the developers team. Who who who on your team would you consider to be experts in sort of developer agreements and contracts?'",
        "'speaker_3': 'Where this is a learning process for us.'",
        "'speaker_8': 'So yeah.'",
        "'speaker_5': 'That that's that's not surprising. Right. In, in, in, in a community that, you know, with a lot of very low income households, you don't necessarily see a lot of attorneys and professionals. So but you're basically acknowledging that you are a little bit shorthanded when it came to that negotiate done the negotiating of the actual terms.'",
        "'speaker_5': 'Would you is that a fair assessment?'",
        "'speaker_3': 'Yes. Mm hmm.'",
        "'speaker_5': 'Thank you. Yeah. I've got a couple of questions for Bruce. So you just acknowledged that you didn't get the the the neighborhoods letter, which admittedly did come in late, but you did release a packet to counsel. Was the full packet of agreements in the cover letter sent I mean, provided to the leadership of those three organizations.'",
        "'speaker_12': 'No. I'd send it to the city.'",
        "'speaker_5': 'Is there a reason why you didn't include the people that you were negotiating with?'",
        "'speaker_12': 'It was over. Yeah.'",
        "'speaker_5': 'So I, I read the packet and so I will acknowledge that the packet that came from Bruce O'Donnell over the weekend is one that I did read in its entirety. It's a generally it's a very good agreement. And I understand there's some concern when a statement like non-binding is included, but it only pertains to certain elements, not'",
        "'speaker_5': 'the actual elements of the agreement, which are very, very much hardcoded and binding in the way they're written. With one caveat, and this is a question for the city attorney had city attorney or counsel counsel, have you had a chance to review the community benefits agreement that was provided by Mr. O'Donnell?'",
        "'speaker_7': 'Kirsten Crawford Legislative Council. I'm going to let Nate Lucero answer your questions first. And if I can fill in after that, I'm happy to do so.'",
        "'speaker_5': 'Good afternoon, counsel. Neighbors are assistant city attorney. I briefly skimmed the community benefits agreement, but the city is not a party to those. And typically I understand the people by the city.'",
        "'speaker_1': 'Oh, sorry. Can you. Can you speak a little bit louder so our interpreter can hear?'",
        "'speaker_5': 'Yeah, sure. So I have briefly reviewed the agreement, but not in too much detail, because the city is not a party to that agreement and we don't have any enforceable enforceability for such an agreement. So there's two aspects to this.'",
        "'speaker_5': 'One is the language that was at question in the in the famous trial story rezoning at St Anthony's came down to Will versus Shell or Must versus Shell. And this so is there in legal terms a difference between the words will and shell in there?'",
        "'speaker_5': 'Meaning typically when we review contract language or regulatory language, Shell is usually a little more prescriptive. So there is there is a difference. Know Will gives you a little bit more wiggle room. Okay. I won't ask you to review this, but the use will exclusively not shell, which would obviously give me pause if I were negotiating this'",
        "'speaker_5': '. I don't know that a community that didn't have experts in reviewing these sort of documents would have would have even been able to pass that. The other aspect, the reason why I'm even asking you these questions is if you heard my line of questioning last week, I took very considerable exception to whether this met the existing adopted'",
        "'speaker_5': 'plans, including the new plan and blueprint. Denver And this was postponed precisely to have this sort of communication around a document such as this, which would be important to address my health, safety and welfare concerns going forward. The fact that it's not executed is a bit of a problem for me with with respect with respect to addressing'",
        "'speaker_5': 'those concerns. Is that not a valid reason for me to ask questions on these and something like this? Are you asking whether or not the newly adopted comprehensive plan blueprint Denver are applicable, this rezoning or what? What is your question, if I may?'",
        "'speaker_5': 'If I have concerns about health, safety and welfare, which is one of the five criteria for rezoning? And I think that a negotiated outcome between a community that is impacted by a rezoning is important and pertinent to my decision.'",
        "'speaker_5': 'Is that an acceptable thing for me to do and consider? Well, I think for the purposes of the rezoning criteria, health, safety and welfare focuses on whether or not this particular rezoning at this location would would meet the health, safety and welfare criteria for purposes of what what could be placed there.'",
        "'speaker_5': 'If you were to approve the rezoning.'",
        "'speaker_12': 'So it's it's solely.'",
        "'speaker_5': 'Based on the proposed rezoning and how that fits or doesn't fit into the rezoning criteria. So that's. If we hadn't had a plan that had five vision elements that talked about equity and displacement, I would probably agree that health, safety and welfare criteria is sort of always met.'",
        "'speaker_5': 'But we did put forward and adopt a very bold statement that includes a lot of more amorphous criteria, that is more about the lives of people in the community that are impacted both there and going forward. So I don't quite I'm still trying to figure out how we how we weigh these these these things from this dais'",
        "'speaker_5': '. So your comments are appreciated. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Cashman. Thank you. Thank you, Mr. President. You gave a figure the last time up that I forget. How many homes are there in the Swansea neighborhood now?'",
        "'speaker_3': 'About 1800.'",
        "'speaker_1': 'Thank you. That's all, Mr. President. Thank you, Councilman Cashman. Councilwoman Sussman.'",
        "'speaker_7': 'Thank you, Mr. President. Nola got a question for you, too. So last time we talked and I asked you, would your group like it to remain as an industrial area? Because our choices to make it to have it remain industrial or to allow the zoning to mix, to use.'",
        "'speaker_7': 'We don't have a in between choice. And do you think your group would prefer it be in a completely industrial. And I also want to say I remember that the owners said that they've turned down offers and are ready to build an industrial site.'",
        "'speaker_3': 'That that was the decision that on Thursday night we went through and did decide that at this time the IAEA uses would be the best for the neighborhood, for stability of the neighborhood.'",
        "'speaker_7': 'And why did you think so?'",
        "'speaker_3': 'Can I get somebody else? I'll. You must get sick of this stuff. Just. Why? Why? They would prefer industrial use completely. They put profit in industry, and they.'",
        "'speaker_7': 'So we decided the industrial was better at this moment because usually when you have an industry next to a school and a houses that are residential, it's very unlikely that it will raise the value of the homes next to as much as a residential mixed use would do.'",
        "'speaker_7': 'That was one of the criteria as an industrial. We've been industrial before. This area has been industrial before with we've never had or in a long time of having had that much investment coming into.'",
        "'speaker_4': 'A community has been.'",
        "'speaker_7': 'Targeted. This much so. In making the decision, what's more equitable? Do we want an industry that could potentially provide jobs for the community or for other people rather than 700 units? That it's a really big percentage of the current households in that area.'",
        "'speaker_7': 'It was a really tough decision and we would have loved to have resident residences there that could provide homes to people who are on the verge of homelessness. But right now, in that moment, we do not feel like the developer gave us the dignity that we wanted to be at the table and be able to actually have'",
        "'speaker_7': 'a voice in what would happen to the building. This is the only opportunity we have where we can actually make an impact, whether it's the space industrial or it goes into mixed use. And so you did not want the value of any homes to go up.'",
        "'speaker_7': 'Is that what I heard you say? Right. The the market shadowing and even the tack, the heart, the the price, the cost of taxes, even when you're already paying your home down, could impair that community much more, including the incoming neighbors.'",
        "'speaker_7': 'So whoever moves into that property will likely shape the neighborhood, and it will set a precedent for the other developers that are already buying that area around Bruce Randall High School and also NCAA Development I. Thank you.'",
        "'speaker_1': 'Could you introduce yourself for the record?'",
        "'speaker_7': 'So my name is Alma and I work I live in Swansea, but I don't live immediately to the property, but I work a Bruce Randolph after school program. So I walk by 40th and Clayton every if you know what percent.'",
        "'speaker_4': 'Of it's just right across the street.'",
        "'speaker_1': 'And I'm sorry, first and last name.'",
        "'speaker_7': 'Alma Randall. Thank you very much. So you don't live in the neighborhood? I live in Swansea, NYC, but I live across the highway. So I walk to 40th and Clinton Cross Highway and I live closer to anything else.'",
        "'speaker_1': 'Kevin Sussman.'",
        "'speaker_10': 'Thank you very much.'",
        "'speaker_1': 'All right, Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. My first question is for NOLA, if you wouldn't mind. Coming up, NOLA.'",
        "'speaker_7': 'When I started this meeting, I said, I don't mind you still with me? I like to say, you know, love combining.'",
        "'speaker_6': 'All of the people that live there. Good afternoon or good evening. It's not convenient for us.'",
        "'speaker_7': 'But there's also the numbers on the Russell vehicle.'",
        "'speaker_6': 'I have a fixed income.'",
        "'speaker_7': 'Yeah. You on the you'll be what your bill your said what place will comptroller hold up. What cannot get between them for long. We the professional. Well that's some personal data.'",
        "'speaker_6': 'What from what I see the people that live there, they don't have a lot of income there.'",
        "'speaker_7': 'They're workers and that's when we're losing.'",
        "'speaker_4': 'But those are those will.'",
        "'speaker_7': 'Then they look a separate la casa del principal Mercado Costco. Mr. MUSSELMAN Mutual thoughts.'",
        "'speaker_6': 'So when the market price goes up on the homes there, the cost that we pay for taxes, it's going to cost all of us a lot of money.'",
        "'speaker_7': 'You know, the people that are Mr. Division doesn't own the Rams.'",
        "'speaker_6': 'And we won't be able to pay for our homes. So where we we'll be able to go live.'",
        "'speaker_7': 'Is going to be inside city. Marketplace is not needed. I used up on Glenn's Army Radio. Okay.'",
        "'speaker_6': 'Because when they put all those things there in those homes, in the parks and all that, and all these people are going to come in, where are they going to have us live in some some, you know, in a tent or something like that.'",
        "'speaker_7': 'Meanwhile, we are arresting people. That is a lot of pressure. Yeah. I mean, give me get.'",
        "'speaker_6': 'The evaluations of the homes that they're giving us right now are very high. I had an evaluation come in yesterday and it was very hot.'",
        "'speaker_7': 'Family home from Rialto, your young man without a companion on the mortgage. But the immigrant vessel is is a goalkeeper enlisted and helpful to know what promises must.'",
        "'speaker_6': 'And I got a letter from the mortgage company, and they said it was very high. So they called them and I asked them what was going on and they said that would be the payment in 3 to 4 months.'",
        "'speaker_7': 'Yes. We were like, what promises? But I mean, it's impossible. Everything, I mean, at all of us, you know, they you know, I think that the.'",
        "'speaker_6': 'Less and it's going to be impossible for me to pay that in 3 to 4 months and all the neighbors that are there will be affected by it.'",
        "'speaker_7': 'I'm Joe, but I think going to lose your rhythm.'",
        "'speaker_6': 'There's already a lot of traffic now and a lot of noise.'",
        "'speaker_7': 'Working nights will be an incident like your.'",
        "'speaker_6': 'There's no way to get on I-70 on New York.'",
        "'speaker_7': 'But I thought it was best illustrated is that the losers are losers that are no place in that illustrated Bamiyan.'",
        "'speaker_6': 'Now you have all.'",
        "'speaker_7': 'These bizarre.'",
        "'speaker_6': 'All these detours that are going through the neighborhood. You have all these all these huge trucks and trailers that are coming in with heavy loads.'",
        "'speaker_7': 'It those up into your lap. Now what was your name on this spell? It also said, we want you to give up.'",
        "'speaker_6': 'So when they put the construction there or when they do the construction there in that area, there's going to be a whole lot of time and that's going to be.'",
        "'speaker_7': 'Going on a long time now with the traffic.'",
        "'speaker_6': 'It's already very contaminated. There's already a lot of traffic there.'",
        "'speaker_1': 'Could you introduce yourself for the record, please?'",
        "'speaker_6': 'It wasn't tested before, but I.'",
        "'speaker_7': 'Know somebody today.'",
        "'speaker_6': 'Wrote it to.'",
        "'speaker_1': 'Me. Thank you very much. Councilman Ortega, do you have some questions?'",
        "'speaker_9': 'Yes, I do. Go ahead. No, I'm going to call you up first. Can you tell me during the mediation process, what was the role of the Office of Nest? Were they at the meetings? What was being done? Because that office was created to address displacement and gentrification issues.'",
        "'speaker_9': 'And so were they there? What what role did they play in the process? And I'm sorry that I don't see anybody from that office here tonight.'",
        "'speaker_3': 'The so Dr. Aguilar, the director of the Nest team, was at the first larger negotiating meeting that we had. And then one of her staff, Elvis, was at the second meeting. They came to observe, didn't say much.'",
        "'speaker_9': 'So they didn't bring any tools to the table that addressed the issue. Okay. Let me move on. Just asking first, Bill, if you don't mind coming to the microphone. It's my understanding this is your project, right?'",
        "'speaker_10': 'It is.'",
        "'speaker_9': 'Are you currently the owner of the property or do you have an option contract contingent on the rezoning passing?'",
        "'speaker_12': 'I'm the architect. I have an interest in it.'",
        "'speaker_10': 'Tom and Brooke Gardner are the primary owners, but I'm their partner. Okay.'",
        "'speaker_9': 'So. So they own the land?'",
        "'speaker_12': 'Yes, they do.'",
        "'speaker_9': 'Okay. So I wanted to ask about the agreement. Has that been filed as a covenant with the land into the portions of it that would be applicable?'",
        "'speaker_10': 'From what I from what.'",
        "'speaker_12': 'I understand, there are two agreements with the city of Denver that that have been I don't know if they've been recorded, but they've been executed by both parties. The the agreement with the neighborhood, the neighbor benefits agreement, has not been signed or executed.'",
        "'speaker_12': 'It's been signed by us, but not by any representatives of the neighborhood. So it hasn't been recorded, in other words.'",
        "'speaker_9': 'Okay. And the one that's been recorded is on the affordability with the housing office, correct?'",
        "'speaker_5': 'Yes.'",
        "'speaker_12': 'And the open space agreement, I believe, has been executed by both parties. And I don't know if that's been recorded yet or not. And that is a commitment to provide two acres at minimum of publicly accessible open space.'",
        "'speaker_9': 'On the.'",
        "'speaker_10': 'Property. On the property.'",
        "'speaker_9': 'So that's the open space commitment within the 14 acres. Yes. And was it discussed whether or not part of that 14 a part of that two acres could also serve as storm drainage or it has to be independent of storm drainage?'",
        "'speaker_12': 'You know, I don't know if storm drainage was specific to that document. We we could not include any type of easements within that. So I know that was something that we used to sort of nail that agreement down.'",
        "'speaker_12': 'The storm drainage, I really can't remember if that was called out specifically.'",
        "'speaker_9': 'Okay. I want to ask Kyle Dalton to come forward for a minute. Thank you. So, Kyle, this site, even though it's over ten acres and that was one of the criteria, there were several criteria that would normally require a general development plan.'",
        "'speaker_9': 'One was not done on this site, but the city will be looking at traffic placement within its proximity to the railroad tracks to address some of the buffering issues, some of that to address part of the health, safety and welfare of the community.'",
        "'speaker_9': 'So given that there was no general development plan, where in the process does the community get to weigh in on any of those issues? Or is this it this meaning the agreement, this meaning input to council tonight? So can you just help address that?'",
        "'speaker_5': 'Sure. Yeah. Unless there are any other processes that require a public hearing as they go through the site development process, there will be further requirement for or opportunity for neighborhood input.'",
        "'speaker_9': 'Okay. So then let me ask either Bruce or Bill if you would come back and just. Help me understand what you see as the process, assuming this passes. What do you see as the process in terms of addressing traffic issues?'",
        "'speaker_9': 'And then we'll ask you about the railroad. And given that there is a school across the street with a lot of kids that move back and forth, how how do you see that part of the process moving forward?'",
        "'speaker_12': 'Well, the traffic, we actually have a traffic study, but it's being updated because the plans of have changed. That's available. We'll just make available that available to the public. CPD has a copy of the current one.'",
        "'speaker_9': 'Was was that reviewed with the neighborhood as part of the community process?'",
        "'speaker_12': 'Is it we obligate ourselves to provide that, but we haven't reviewed it with them. It actually said there was no impact to our with our current plan.'",
        "'speaker_9': 'So talk to me about railroad proximity and any kind of. So first of all, was that brought to your attention when you all initially filed this application that you should be checking the box that you're within a close proximity to railroad?'",
        "'speaker_12': 'I believe so. I mean, it was on the surveys. I mean, it's it's kind of hard to ignore when you're there. And at that time, we still had the the horns. So it was it was very hard to ignore.'",
        "'speaker_12': 'Then it as you know, the light rail curves around the site. So it's very prevalent on really on two sides. And so it's a very obvious and impactful component.'",
        "'speaker_5': 'Our site really turns inward and.'",
        "'speaker_12': 'Then to the other street. So Clayton in 40th. So along the light rail line, there's no there's no access. There's no pedestrian access in beyond that there's a heavy rail. So there's really not not as are currently nor is there going to be really any kind of implied connection across those lines.'",
        "'speaker_12': 'I mean, we'll have a secure boundary along that that light rail all the way to the street or to the sidewalk.'",
        "'speaker_9': 'So the. Cargo rail is immediately north of the RTD rail.'",
        "'speaker_12': 'It is at at the.'",
        "'speaker_5': 'Along the Clayton Edge. So it runs straight whereas the light rail.'",
        "'speaker_12': 'Curves around and kind of wraps the site.'",
        "'speaker_11': 'Okay.'",
        "'speaker_9': 'And in the the real issue is the fact that our rail corridors carry hazardous materials and just wanting to make sure that this is something that you all have thought about and have looked at how you address any protection that would need to be provided by the sheer fact that through this process, we're going to be encouraging'",
        "'speaker_9': 'people to live on that site. And if something were to happen, we'd want to make sure that we are doing our part as a city to address those health safety potential impacts.'",
        "'speaker_12': 'Right. It is. I mean, in in even if we were to do a commercial development, we would be aware of that creating barriers and also the safety during construction. If soil's disturbed, we will have to be monitoring that even though we're not really faced with any negative environmental impacts.'",
        "'speaker_12': 'But it's something to monitor the whole time during construction when the site's a little more open and then afterwards.'",
        "'speaker_9': 'Okay, I have no further questions. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilwoman Kennedy.'",
        "'speaker_7': 'Thank you, Mr. President. I wanted to start by asking. I see that Melissa Todd is here and I don't know, were you the one involved in negotiating the housing agreement? Are you speaking to that tonight? If so, I have a question for you.'",
        "'speaker_3': 'Well, this study has and policy officer with Denver Economic Development Opportunity, Laura brzezinski, and I kind of filled in whenever we could.'",
        "'speaker_7': 'Got it. So one of the sticking points that's been identified is the depth of the affordability for this project. And I'm wondering if you can speak to whether or not you all discussed the overall low income nature of this neighborhood and the potential of that justifying a lower median income in the housing agreement.'",
        "'speaker_7': 'And how you looked at that or how you talked about that in this negotiation.'",
        "'speaker_3': 'So we're always striving to fulfill the goals outlined in our five year housing plan, which does call for deeper affordability. A lot of times we see negotiations starting at 80% of the area median income. So getting the city 60% of the area median income is really important.'",
        "'speaker_3': 'Again, we like to see even deeper than that when possible, but that does require a city subsidy, often tax credits as well. And so in our negotiations and conversations, that was not necessarily the path that would have been pursued in terms of what those actual salaries are.'",
        "'speaker_3': 'Because we talk about am I very generally for a single household, that would be 37,800. And I should say these are the 2018 numbers because the 2019 numbers just came out. So single household, 37,800. Household of four 53,940.'",
        "'speaker_7': 'Okay. Thank you. Next question is for I guess I'll offer if Bruce wants to say anything about the question of getting to lower median incomes and whether why, why there wasn't more willingness to commit to that. And, you know, we've we've negotiated some agreements that say, you know, pending tax credits or pending these things.'",
        "'speaker_7': 'So there's carve outs that can create protection for the inability to predict what can be gotten. But can you speak to anything about where you were at on the deeper affordability?'",
        "'speaker_12': 'Sure. Thank you. So back also to some of the discussions that have that I've been listening through for the last few minutes. The agreement, the contractual obligation we have with the city to provide the 70 affordable units is in part our displacement mitigation effort.'",
        "'speaker_12': 'That's part of why we do this. And in in we've stepped up big because it's five times the number of units we estimate that than would be required under the linkage fee ordinance, which would be about 12 or 15 units.'",
        "'speaker_12': 'We started out at 80% and in working with Dito are at 60 contractually and there's a number of reasons why that's kind of the limitation in one is is that the project has to pencil financially to be executed and with only three story zoning, it's a very low density model.'",
        "'speaker_12': 'For example, River Mile is has about the same affordability commitment in terms of number of units, but they can go, I think 40 or 50 or 60 storeys to two and we're limited to three. So Bill, I don't know if you have more to add to that, but that's hard to do.'",
        "'speaker_12': 'Yeah. Oh, and then on the deeper where we've had discussions with Jeff Martinez brother's redevelopment and is the packet you received says states we are going to give that a high priority and work for 90 days to see if there might be a way to get deeper affordability.'",
        "'speaker_12': 'But the economics of the project, absent involvement of somebody like that, 60% is where we can get. Okay.'",
        "'speaker_7': 'Thank you. There was mention I had asked at our last portion of this public hearing about any city subsidy, and I was told flatly there were no plans for any subsidy can be a debatable term. I hear now there has been some discussion about a metropolitan district, which I would call a special, special permission.'",
        "'speaker_7': 'Not everybody gets to tax folks at a higher rate. So is is do you want to supplement your answer from last time about intentions related to a metropolitan district which was not disclosed during the last hearing?'",
        "'speaker_12': 'So a metropolitan district is being contemplated. We have not applied to the city yet. The first step in that is letter of intent, and that's not occurred. One of the reasons why is that in my experience, you have to have zoning in place for which you want to have metro district support to finance, own, construct and maintain'",
        "'speaker_12': 'improvements. There are a number of reasons why a metro district may be appropriate here. One is, is that we don't believe that any of the proposed public infrastructure that will be considered the horizontal infrastructure will meet the Public Works Department's criteria to accept.'",
        "'speaker_12': 'And so that some entity needs to exist in perpetuity to maintain those horizontal improvements in, for example, the two acres of parks that are committed to and the open space contract with the city in streets and stormwater detention and all of those types of things.'",
        "'speaker_12': 'And so there's a desire to explore being able to maintain those through Metro District.'",
        "'speaker_7': 'And potentially you could use a metropolitan district to cover the some of the costs of, for example, the open space, for example, would be eligible infrastructure under a typical metropolitan district.'",
        "'speaker_12': 'Would be eligible to maintain. Yes. Is that. I'm not sure.'",
        "'speaker_7': 'I just thinking about when you describe the economics of the project, if there are certain pieces you've committed to that might be covered by a metropolitan district, then they don't have to be covered by the cost of the development.'",
        "'speaker_7': 'So I'm just thinking about the overall economics. I guess you don't have to add more if you don't.'",
        "'speaker_12': 'Okay. Okay. Okay. The only thing I would add to it would be you said is that with this site, we're really trying to balance a re-use of the existing buildings. So part of it would be two stories. Part of it would be three stories.'",
        "'speaker_12': 'It's it's really not very dense. And so that's going to have a negative pressure on the negative on the economics.'",
        "'speaker_7': 'Okay. Thank you. I have a couple of questions for the community. And what I'd like to do is ask the questions and then you can decide who answers them if that works. So the well, I have three questions, so that might be too many.'",
        "'speaker_7': 'But the first question is I want to see if you all had a conversation, because the truth is we don't often do very lower EMI housing at two stories. And so did you all have a conversation about how realistic your goals were compared to what they are proposing building and the trade off that if you wanted to'",
        "'speaker_7': 'get to those very low aims, you might need to have five storeys, which would mean even more development. So I want to understand if you all had that discussion about what is possible at this level versus what would happen if you really wanted that, then you might need to be advocating for higher height.'",
        "'speaker_7': 'And I don't know if there's plan support for that. So it's important that I understand if you've had that discussion. I'm trying to talk slow for the interpreter forward when? I mean, I'm Rosemary Abimbola.'",
        "'speaker_6': 'My name is Maria de Luna E.'",
        "'speaker_7': 'Gentlemen, the conversation is esoteric, lively and accessible. Maria, this is. But I want families. But I can always be sexy.'",
        "'speaker_6': 'Listen, I truly, when it comes to attainable housing, we had some we ask some questions about affordable housing.'",
        "'speaker_7': 'For Casey Ave level, the level and that's a civil Pedro bilateral service.'",
        "'speaker_6': 'So we've we've talked about accessible housing, but for artists.'",
        "'speaker_7': 'Not para la comunidad.'",
        "'speaker_6': 'Not for the community.'",
        "'speaker_7': 'And don't say this is the reality. It's a phony las cosas gay Canales isn't know what that and what are can know.'",
        "'speaker_6': 'So that's one of the.'",
        "'speaker_7': 'Things that can be a sonification.'",
        "'speaker_6': 'Made us vote no to the rezoning.'",
        "'speaker_7': 'But Carol meant they in and look I used to stand over the sandal. No, I grew up at Apoyar la Comunidad Canal because that was maybe.'",
        "'speaker_6': 'Because with what they're proposing, there isn't really anything to support the community when what we're going through.'",
        "'speaker_7': 'Now, Tampoco Como said, I say, What are you radical as we be? And as I said, Silvana said, Para la comunidad and they have allowed en masse they wanted one.'",
        "'speaker_6': 'Because they've talked more about Wonder Bond and they've talked about the accessible housing for the community.'",
        "'speaker_7': 'This is a look at your opinion. Those I see myself.'",
        "'speaker_6': 'That's my opinion. No, if anyone else wants to say something.'",
        "'speaker_7': 'So, Maria, I'll ask a follow up question. They are offering, I believe it was five or ten live work units for artists, but the remainder are not restricted to artists. Did you understand that they weren't all for artists themselves?'",
        "'speaker_6': 'But if this does.'",
        "'speaker_7': 'Not add.'",
        "'speaker_6': 'On. They never clarified that.'",
        "'speaker_7': 'Okay, so there might have been some misunderstanding. So I'm going to ask Bruce to come up and clarify this piece for me. Okay. And then I'll move on to my next question.'",
        "'speaker_6': 'You look obviously approximate, but Mr. President.'",
        "'speaker_5': 'This is in addition to this question, if I can add onto it, Bruce, can you also for those 70 units, are you are you guys committing to work with the community to do special focus advertisements to teachers, to individuals who've been displaced in the community?'",
        "'speaker_12': 'So let me start out responding to Councilwoman Kennish. The the 70 units that 60% are under Army with which we have the contract with the city to provide are a requirement with no no design or limitations on who they serve or or who their audience that are just going to be capital affordable housing at 60% AMI or'",
        "'speaker_12': 'less.'",
        "'speaker_7': 'They are not restricted to artists.'",
        "'speaker_12': 'That's correct. They're they're kind of normal everyday. What what you think of in affordable housing. In addition to that the there's a desire and that's become a commitment to also provide up to eight live work units that would be for artists.'",
        "'speaker_12': 'Okay. Outside of that hole, all of that.'",
        "'speaker_7': 'Did you want to answer, Councilman Brooks, this question about the advertising?'",
        "'speaker_12': 'Yes. So the is I mentioned when when I first came up this evening. And in this all kind of came in in jelled through the city appointed mediator that ran all this. We're still committed to offer units and be proactive about marketing units in the community.'",
        "'speaker_12': 'In the community is is one of the ongoing commitments, even though there is not a community benefits agreement.'",
        "'speaker_7': 'Okay. My next question for the community and is about the fact that the area plan. So we have to make our decision based on the criteria. So it's not a vote about whether the community likes or does not like the project.'",
        "'speaker_7': 'It is a vote about what the criteria is. And there is an area plan that has support from community that says we want to change zoning away from industrial. And tonight, one of the things that has been shared is that you rather keep it as industrial.'",
        "'speaker_7': 'And I want to ask whether or not you understand the fact that we already have a plan adopted that the city is supposed to comply with that says we want to change it from industrial. When the nose goes.'",
        "'speaker_7': 'Tangles and saroyan's.'",
        "'speaker_6': 'All right. We like development.'",
        "'speaker_7': 'Campbell's.'",
        "'speaker_6': 'We like change.'",
        "'speaker_7': 'His song. Bienvenidos a la Comunidad.'",
        "'speaker_6': 'They're welcome in the community.'",
        "'speaker_7': 'Burial meant they're in their store. No, Soto. No, they must not. Apparel accompany that.'",
        "'speaker_6': 'But here we don't see anything truly for the community, Fulkerson said.'",
        "'speaker_7': 'Then, Tony, that is.'",
        "'speaker_6': 'There are 70 units.'",
        "'speaker_7': 'Also sent percent.'",
        "'speaker_6': 'At 60%.'",
        "'speaker_7': 'It's a center proportion todavia. As I told Barela community.'",
        "'speaker_6': 'That 60% is still high for the community.'",
        "'speaker_7': 'And that's not on this as it's amazing point that 90%.'",
        "'speaker_6': 'We need 50 30%.'",
        "'speaker_7': 'But Gabriel meant there is alto locus as the by landlord in frame Takumi the pasando knows this topic Pando and my Seattle.'",
        "'speaker_6': 'Rent is very expensive. Food is everything expensive. Everything that is going on is affecting us a lot in process.'",
        "'speaker_7': 'No, no, no mirror, almost no candles. Whether you like our to get in Mozilla industrial for me other than nosotros is alongside the Las Casas Gomes Val McCallum We.'",
        "'speaker_6': 'Don't see anything that's helping us right now. We want industrial because what we fear right now is that the prices of the houses will go up.'",
        "'speaker_7': 'Barrios A lot. Residents are very severe. Takako.'",
        "'speaker_6': 'Mustafa A lot of the resident residents that received a letter like Rosa was saying.'",
        "'speaker_7': 'Ella Casani yeah. Costar S.O.S. star Valerie Salazar.'",
        "'speaker_6': 'S.O.S. to her house was valued at 180.'",
        "'speaker_7': 'How little Valerie sat on andale siento so changed that.'",
        "'speaker_6': 'Now it's valued at 280.'",
        "'speaker_7': 'Entonces vamos esperar cuanto a.z. that says para la proximo. Okay.'",
        "'speaker_6': 'Now we're waiting to see what the taxes will be next time.'",
        "'speaker_7': 'Grace. Yes, Pedro, I. I need to ask if someone has to wants to comment on the plan. I have to make my decision based on the plan and the plan. So I want to ask about the plan.'",
        "'speaker_12': 'My name is Robin Reichert. I'm a Swanson neighbor, part of the Gas Coalition. To your point, we to the last two questions. We talked extensively about this. We understand the developers and the really hard position. At no point did we want to blame the developer, but at the end of the day, both for your question about deeper'",
        "'speaker_12': 'affordability, there wasn't language in there that really secured that. And as far as the looking at the industrial use, it wasn't our intention to support the industrial use as the Coalition. We're not taking that specific position. However, the vote of the neighbors, overwhelmingly, the folks that were living closest to the the site didn't see that there was'",
        "'speaker_12': 'anything tangible in the agreement to to mitigate that affordability. And I think the real hook here is the city, as it's been acknowledged through the gentrification study, the housing, the inclusive housing for all all of these studies have shown that the the the direct development, the direct link between this development and displacement of low income neighbors.'",
        "'speaker_12': 'So we're saying if we know it and we've known it for years, what are we doing about it? And it's just so disheartening to go through this month and that there's just nothing on the table that actually protects the people that the city says they're going to protect.'",
        "'speaker_12': 'And so it's really hard for us to get behind a decision that had no teeth or an agreement that had no no hook. So just to your point, it was extremely debated. There was 70 people from the neighborhood that took part of this process.'",
        "'speaker_12': 'We knocked on doors extensively, had extensive community reporting, and invited all neighbors within 500 feet to to give input on that process.'",
        "'speaker_7': 'Okay. Thank you. I'll concede for others to answer their questions then. Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Councilwoman Councilman Espinosa, you're back. Oh, Councilman Brooks.'",
        "'speaker_12': 'Yeah, I was there.'",
        "'speaker_1': 'Oh, I'm.'",
        "'speaker_5': 'Sorry. Yeah, thanks. Hey, just a couple quick questions in. I'll just put this out here. You know, listening to to the community and listening to both sides, one of the things that I thought was a real coup and win was getting brothers redevelopment to get this property in and redeveloped the affordable.'",
        "'speaker_5': 'So, Bruce, let me just ask let me ask you this. How real is this conversation? I mean, because it seems to be, you know, especially with those 70 units, it seems to be some mistrust of what is actually going to be done on deeper affordability and even kind of the conversations with brothers redevelopment.'",
        "'speaker_5': 'So. Have you all been in contact with brothers redevelopment worries? I mean, they're not here, so obviously they can't speak. But where are we on that conversation?'",
        "'speaker_12': 'So, yes, we've been in touch with them. We were introduced to them through NOLA and the coalition. And while there's no, you know, formal inked deal, we're committed to work with them to execute on the 70 unit site to see if deeper affordability can be achieved.'",
        "'speaker_5': 'Do you have a developer you're also working with on an affordable housing deal for the 70 units? Are they exclusively they're excluded?'",
        "'speaker_12': 'So where are what's in the the community benefits agreement? And we're still committed to, even though what's unsigned is that we will be exclusive with them for 90 days.'",
        "'speaker_5': 'Okay. That that's just what I wanted to highlight to make sure that that was exclusively their their deal. There is someone is moreso. Can. Can I ask you a question? You were here for the last. You were here last month, correct?'",
        "'speaker_5': 'Yes. Okay. And where? Where do you live, sir?'",
        "'speaker_6': 'I live on 4110 Fillmore Street.'",
        "'speaker_5': 'Okay. So a block away?'",
        "'speaker_6': 'Yes.'",
        "'speaker_5': 'And, you know, we've been hearing from different residents. What's your perspective take on this?'",
        "'speaker_12': 'Well.'",
        "'speaker_5': 'And were you a part of the 70 people we just heard? The 70 people are part of this process.'",
        "'speaker_6': 'Well, I'm I can say I'm part of that, this group. At the beginning, I was part when I found I find out that there was a collision. So I had to enter a meeting. But then when they see my position that I now embrace their position.'",
        "'speaker_6': 'Like I received fliers anymore in my home they know came to me to talk. And that's fine. But what I think about the project, we need the change. Because right now it's a lot of crime. It's now police intervention on our neighborhood.'",
        "'speaker_6': 'Last week was five break ins on two blocks, plus soul destroying. So we need the city of Denver. Get more involved on what is happening. And we need developers like this. So want to invest millions of dollars to have our neighborhood a better place to live.'",
        "'speaker_5': 'Are you committed to being a part of the process here?'",
        "'speaker_6': 'Yes.'",
        "'speaker_10': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilman Espinosa. The Council on Brooks Ghost.'",
        "'speaker_5': 'Which is.'",
        "'speaker_1': 'China's own government, just got in for.'",
        "'speaker_5': 'The first time.'",
        "'speaker_1': 'All right. Thank you, Councilman Espinosa. We will get to you eventually, Councilwoman Gilmore.'",
        "'speaker_3': 'Thank you, President Clark. I wanted to Nate, I had a question for you from the city attorney's office. Some of the, you know, answers that folks have been giving are very compelling, knowing that some sort of new development coming to the neighborhood that this rezoning may bring.'",
        "'speaker_3': 'I just want to make sure that folks are clear on what the criteria are that we legally have to make our decisions based upon. And, you know, we have those those criteria. I have it up really quick. But, you know, there's five criteria.'",
        "'speaker_3': 'One of those criteria are not inclusive of us making a decision based upon potential changing property.'",
        "'speaker_5': 'Values to.'",
        "'speaker_3': 'The surrounding businesses or single family residences.'",
        "'speaker_5': 'Correct? That's correct. The criteria does not.'",
        "'speaker_3': 'Include that.'",
        "'speaker_5': 'Type of consideration.'",
        "'speaker_3': 'Okay. All right. I just wanted that to be on the record because it's very, very compelling. But legally, we can't utilize that information in our decision tonight.'",
        "'speaker_10': 'That's correct. All right. Thank you.'",
        "'speaker_3': 'Thank you, President Clark.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore, Councilman Lopez.'",
        "'speaker_8': 'Thank you. If you can come up to the front developer. You yourself as well. The community benefits, you know, in talking about some of the things that you've agreed to because that agreement is not signed. That's something you said you're still willing to honor.'",
        "'speaker_8': 'Is it also have you signed who's signed? Who are this? Who has signed on to it, at least from your guys's end? So it's developer or the developer property owner as well.'",
        "'speaker_12': 'The property owner and developer are one and the same. It's Tom Gordon and he's signed it and pardon me and his wife have both signed it and in so it it remains. There is no counterparty to to the agreement.'",
        "'speaker_12': 'And so our take on this is that we feel as if we've. Well, first of all, there there are the five criteria on which a rezoning should be. Jump in in we meet all those five, we have a staff report and planning board approval and on and on.'",
        "'speaker_12': 'In addition to that, we've gone above and beyond by entering into the affordable housing agreement with the city and the open space agreement. And we've taken the high road the whole way on this thing. And so we invite you to in the city and neighbors to join us there.'",
        "'speaker_12': 'And we're morally committed to do these things.'",
        "'speaker_8': 'So. What I'm trying to get at is is there any kind of development agreement where this is recorded as well, too? I mean, it's one thing to sign the document, but is it recorded in any kind of horizontal or any kind of any kind of development agreement that's associated with it?'",
        "'speaker_8': 'Well, no.'",
        "'speaker_12': 'No, there is not. So the the intent of the last month through the city sponsored and requested mediation was to try to get to that point. And as you've heard from both sides tonight, and I'll reiterate, I think we got very, very close.'",
        "'speaker_8': 'But if you don't if you can do that voluntarily, can't you, by making a condition of the development agreement, even if there are no signatures on it?'",
        "'speaker_12': 'That's exactly what we are doing. We're voluntarily sticking to sticking to those commitments.'",
        "'speaker_8': 'On the development agreement.'",
        "'speaker_12': 'And any content on the community benefits agreement that got drafted.'",
        "'speaker_8': 'I understand the community benefits agreement, but in the in any kind of development agreement associated with the property, any kind of building, any any kind of deed, any kind of recorded document, is it is it is it live within those kind of those.'",
        "'speaker_8': 'No, sorry does not.'",
        "'speaker_12': 'The only the affordable housing agreement and the open space agreement with the city.'",
        "'speaker_8': 'Okay.'",
        "'speaker_1': 'Okay. Thank you. Thank you. Councilman Lopez. Councilman Cashman. Thank you. Thank you, Mr. President. Nate. You know, my. So, Nate, obviously, one of the criteria is plan support, right? Correct. So we have a variety of plans now that decry gentrification and hold equity up as a value.'",
        "'speaker_5': 'So the plans applicable to this rezoning are comprehensive plan 2000, Blueprint, Denver 2002 and the small area plan, which I can't remember the name of it at the moment.'",
        "'speaker_1': 'How about housing and inclusive Denver?'",
        "'speaker_5': 'Is that is a city adopted plan. And so it could be considered by council.'",
        "'speaker_1': 'Okay. Thank you. That's all I have. Thank you, Councilman. Councilman Espinosa.'",
        "'speaker_5': 'Well. All right, William, so a couple questions for you. So, again, I think the three the three agreements that have been put forward by you and your team and executed on two of the three are really compelling package.'",
        "'speaker_5': 'And so I believe it is your intent to live up to these commitments. Would you be willing to change the wills to shell on the neighborhood agreement if it.'",
        "'speaker_12': 'You know, I'd have to consult with the partnership on that. I'm not qualified to know the distinction. Even though I was here earlier and I heard that. So but it's it's our intent, the entire partnership to meet the agreement that's been signed.'",
        "'speaker_12': 'So I don't.'",
        "'speaker_5': 'Know if you are willing to make those changes. Would you also then be willing to give the community another ten days, regardless of the outcome tonight? I mean, if if the rezoning should be approved tonight, the community another ten days to execute that agreement so that we have a third party on that agreement.'",
        "'speaker_10': 'Second. That's kind of unsportsmanlike. That's just me personally thinking.'",
        "'speaker_12': 'I mean, that's kind of that wasn't the spirit of what we did. But, you know, we're doing it. We're committing to doing it. So if they sign it tonight or tomorrow.'",
        "'speaker_10': 'Or next week or the week after that, it's it's really not I mean, we're committing to it.'",
        "'speaker_5': 'And the reason being is that your commitment on a on a one party agreement is not worth the paper that it's written on. Right. I mean, and I do think that there's real merit to the agreements that you've laid down and and put your name to.'",
        "'speaker_5': 'And I do think that maybe the community was tiny at a tiny bit of a disadvantage in understanding the real impact that is being proposed here, because you're talking about a community that is really reeling and you see them essentially the argument, the argument that, you know, bringing new homes with higher values will change the the value'",
        "'speaker_5': 'of land in that area. And that is a legitimate argument. It is what I supported the Zia project in my neighborhood going forward, but I have warned my my neighbors that that will set a new market. It will establish a new market once that goes in and it will make certain properties viable that weren't viable before for'",
        "'speaker_5': 'redevelopment. That is a real impact. And as that starts to happen, that is the Jefferson Park story. So these I don't I think if you short of these protections, I think we open ourselves up to even more the potential for more dramatic impacts.'",
        "'speaker_5': 'So, ah, you know, I get what you mean by it's what was the term you used. I use the term.'",
        "'speaker_12': 'Unsportsmanlike but I was kind of in jest. Yeah, sort of a little bit.'",
        "'speaker_5': 'So I think you guys are committed. I think that's why you put the extra time in. You were okay with the extra time trying to reach that agreement. I think you put forward three, three substantial agreements. And if if, if, if all they need to do to secure that agreement is just one signature from one of those'",
        "'speaker_5': 'parties, not even all three. That would give me more peace of mind for that community that you're going to follow through on what you said. Are you sure you won't give them another ten days if this rezoning goes through?'",
        "'speaker_5': 'But. Okay, Oscar, thank you.'",
        "'speaker_10': 'I'm sure we did have a media just center on that topic.'",
        "'speaker_12': 'I have concerns that leaving it as a commercial in it's not only industrial zone zoned is just not doesn't allow residential. I am concerned it's still going to have the negative impact that they're concerned about. So we share those.'",
        "'speaker_5': 'Concerns as well. But now it's a different calculus world to the city rate, which is nonresidential land, has a taxable property tax rate at five times a residential property tax. And when we lose nonresidential land for high value residential, we dilute the residential market and we put greater pressures on the remaining nonresidential landholders for sure things.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Councilwoman Ortega, did your questions get answered or different question?'",
        "'speaker_9': 'And this is for Kiawah, if you don't mind coming forward one more time. So this is on the GDP. So who at CPD makes the judgment call whether a large site is required to have a general development plan or not?'",
        "'speaker_9': 'Because looking at the criteria and hearing Mr. O'Donnell talk about the two acres of parks, the streets, the stormwater, the criteria is pretty.'",
        "'speaker_3': 'Clear that.'",
        "'speaker_9': 'You look at necessary infrastructure that includes roads, parks, open space, utilities, support, development. So those are being looked at for potentially a metro district. But we the city did not necessarily factor those in for the GDP to be created as part of this project.'",
        "'speaker_9': 'And I'm struggling with that because the criteria seems to meet that for this particular project. Yet somebody made a judgment call that this particular 14 acre site did not require a GDP. So is there a point person that makes that decision?'",
        "'speaker_9': 'Is it the. What's the word? I'm looking for the neighborhood planner of the district that makes that decision. Is that something that there's flexibility on or is it just a judgment call of whoever is looking at the application?'",
        "'speaker_5': 'Yeah. So for the benefit of everyone else, my name is Kyle Dalton. I'm with the Department of Communicating Involvement. So the decision is, as particularly the Denver zoning code is that of the manager of CBD, which can be delegated to any member of her staff.'",
        "'speaker_5': 'So we make those decisions collectively as a team in consultation with her, and we reviewed it against all of the factors, all of the criteria. And as my colleague Sarah Salter explained four weeks ago, we found that that it did not meet the required criteria to require a general development plan.'",
        "'speaker_9': 'Even though the actual criteria spells out some of the very things that this project is going to need.'",
        "'speaker_5': 'So the only factor that we found that this one would necessarily require and that couldn't be solved through other regulatory mechanisms, which is what the code language says, was that it's greater than ten acres. But as we went through the rest and as she went through the rest of them last time, it's it's now within 100 feet'",
        "'speaker_5': 'of the river or the Cherry Creek corridors. There won't be collector arterial streets. There won't be regional stormwater than demands of the site will be local, local streets, local stormwater, local open space wasn't required or called for. Recommended is the word.'",
        "'speaker_5': 'I think that's in the plan.'",
        "'speaker_9': 'But the creek fire does say that the criteria doesn't necessarily say it's got to be that it's restricted to regional versus local.'",
        "'speaker_5': 'It does. Yeah. I can read the language if you'd like.'",
        "'speaker_9': 'Okay. I'm looking at it right now. And that particular part that about regional. There's not. Jump out at me.'",
        "'speaker_13': 'So.'",
        "'speaker_5': 'Sure. So I'm reading from section 1.4.12.2.8.3, which are which is one of the criteria to consider in determining for the department to determine whether a GDP will be required. And that's the part that's about infrastructure. That's your question.'",
        "'speaker_5': 'Right. So it's a establishing, extending, expanding or otherwise changing the arterial or collector street grid. So again, there's already two arterials next to the site. We didn't think it was going to anymore, but.'",
        "'speaker_9': 'There will be internal streets needed. Correct.'",
        "'speaker_5': 'That it could either public or private. Yeah. Okay. Or and then. Or establishing extending, expanding or otherwise changing an existing regional stormwater system or establishing, extending, expanding or otherwise changing publicly accessible park and open space.'",
        "'speaker_9': 'Okay. All right. So just one last question. This is for either Bruce or Bill. So the park that the two acres that are being proposed for this site. That's that's been in agreement with the city. Correct. It's not necessarily part of the agreement with the neighborhood.'",
        "'speaker_9': 'It may be part of the agreement with the neighborhood.'",
        "'speaker_12': 'It's listed, but it's it's it's city agreement.'",
        "'speaker_9': 'Okay. Is there an expectation that at some point after the typically it's the one year time frame after it's been constructed that it would be turned over to the city as as city land? Or will it continue to remain open space as part of the development?'",
        "'speaker_10': 'You know.'",
        "'speaker_12': 'I can't answer that. I don't know if if they'll want it or if it'll be part of the metro district or some other component. It's a pretty stringent agreement where it's required to be maintained as publicly accessible open space.'",
        "'speaker_12': 'So it has this.'",
        "'speaker_10': 'A person is answer to this one. So.'",
        "'speaker_9': 'Okay, Mona Bruce.'",
        "'speaker_12': 'The the agreement requires that the the two acres of open space be in a easement provided to the city so that the city of Denver would be the grantee in an easement to assure that this remains open space in perpetuity.'",
        "'speaker_9': 'So then it becomes a city park at that point. Is that correct?'",
        "'speaker_12': 'That is not determined. It could be under private ownership, but it that it would be in an open space easement. That's the that been the beneficiary of the grantees, the city of Denver.'",
        "'speaker_9': 'Okay. But the assumption is that if there's a metro district, the part of the mills get collected to address maintenance of that park is part of the overall infrastructure.'",
        "'speaker_12': 'If if there was a district. Yes. That yes, that's a possibility.'",
        "'speaker_9': 'It's a possibility, but it's a possibility. It gets turned over to the city and the city assumes the maintenance responsibility. Is that accurate?'",
        "'speaker_12': 'No. The city just has an easement to make sure that it remains open space.'",
        "'speaker_9': 'Okay. Because I know a number of our other metro districts, the parkway ends up being turned over to the city, even though it's built, and part of the cost of the maintenance is built into the original mills. But yet the city ends up taking the responsibility of ongoing maintenance of those parklands.'",
        "'speaker_9': 'So that's why you're familiar.'",
        "'speaker_12': 'With that in other areas. But that would not be the case here.'",
        "'speaker_9': 'Okay. Thanks for that clarification.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega, Councilwoman Gordon.'",
        "'speaker_3': 'Thank you, President Clark. Bruce, I have another question for you on the attachment that you had sent to us. I'm looking at page 16.'",
        "'speaker_10': 'Where is the grab it?'",
        "'speaker_3': 'Okay. Please. It's the section that says Agreement to provide open space. And I have a quick question because my math isn't adding up correctly. I don't think so. On page 16, under the recitals, SI, it says the owner intends to provide approximately 20% of the buildable area of the property for use as open space.'",
        "'speaker_3': 'But then the next section where it says agreement. It says Open Space Owner agrees to provide a minimum of two acres of the property as publicly accessible open space. If this is a 14 acre site, 20% would be 2.8 acres.'",
        "'speaker_3': 'And so how do you, under the agreement, under open space, have a minimum of two acres instead of the 20%? That would be 2.8 acres.'",
        "'speaker_12': 'So today, the gross acreage of the site is about 14 acres. And so that includes buildings are part of that, for example, today and as development begins to occur there, it'll start to transition to what's called net acreage.'",
        "'speaker_12': 'So net of street rights of way, for example. And so the the two acres or 20% is calculated on the the estimate of what the future net open space will be is as opposed to today's gross acreage of 14 acres.'",
        "'speaker_3': 'Okay. Thank you, Kyle. I have a question for you on the same topic. What Bruce just described around those calculations is that the standard.'",
        "'speaker_11': 'Way that open space.'",
        "'speaker_3': 'Requirements are calculated for developments of this size.'",
        "'speaker_5': 'Sure. So when development is required to provide open space, either under a GDP or under the proposed rules for a large development review that the Planning Board has forwarded for the City Council's consideration here in the next few weeks.'",
        "'speaker_5': 'It does because there's a little bit of history here. So the open space requirement comes from former Chapter 59, which applied to the zone lots. So the way it's been applied since then, including in the new Denver zoning code, is net of streets, public or private, but net of streets because it was originally just applied to the'",
        "'speaker_5': 'private property. So we would subtract ordinarily the the land for streets, whether they're publicly dedicated or private, but all publicly accessible streets. But at this point, there isn't a like the specifics of a plan, which I think is why they've included it as a recital.'",
        "'speaker_5': 'It is approximately 20% because there isn't a calculation to perform yet. But that was the intention behind the recital.'",
        "'speaker_3': 'Okay. And who are you all working with as far as the parks planner for this area.'",
        "'speaker_5': 'Said Mark. Mark Taylor was.'",
        "'speaker_10': 'The person who participated.'",
        "'speaker_3': 'All right. Thank you. Thank you, President Clark.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore.'",
        "'speaker_5': 'Councilman Brooks. Yep. Just one last thing. And, you know, Nola or Bruce can do this, but we didn't hear the mediator's comments. And so I know he wrote a letter, and I'm not even sure that the entire council got those.'",
        "'speaker_5': 'And I just wanted to make sure we read it into record. So we have all of the everybody's comments in before. Anybody have it?'",
        "'speaker_12': 'So, Councilman, I have the mediator's letter here. Is is that what you're. What what would you like done with it?'",
        "'speaker_5': 'Yeah. So none of the city of city council have the letter?'",
        "'speaker_9': 'Nope. No.'",
        "'speaker_5': 'So that's an issue.'",
        "'speaker_12': 'I have 14 copies.'",
        "'speaker_5': 'Okay. Can you please get it to the secretary? So can the lease have the letter?'",
        "'speaker_3': 'It's actually in here.'",
        "'speaker_5': 'There is. Go ahead. Go ahead. Speak to it.'",
        "'speaker_3': 'The it says that it was the Arnaud's that abstained. And that's not true. The at the actual meeting, the Elyria Swansea Neighborhood Association was there. And actually Sandra from the Unite North Metro Denver, R.A. is here tonight. So I just want to make sure that that is isn't.'",
        "'speaker_3': 'That point was an accurate.'",
        "'speaker_5': 'Thank you. Thanks for doing that. Can you.'",
        "'speaker_12': 'Pass along? My apologies. I had 14 copies of a different document that I have. One of the mediators report to city council that I'm happy to give you.'",
        "'speaker_1': 'Okay. I a. I just want to confirm with our attorney that having that copy gets it on the record or do we need to read it into the record?'",
        "'speaker_7': 'Yeah, you can just distribute it and if you'd like to read it into the record that we get it, I don't know.'",
        "'speaker_4': 'How long it is, but.'",
        "'speaker_1': 'Do you want to you do want us to read it.'",
        "'speaker_7': 'Yet? How long is the document? I haven't seen.'",
        "'speaker_5': 'It. I don't.'",
        "'speaker_1': 'Know. It just walked out of the room.'",
        "'speaker_12': 'It's one page.'",
        "'speaker_7': 'Yeah. It would make sense to read it into the record.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'I think, Mr. President, just for the edification, everybody in there with notwithstanding what I know, they just talked about taking out that piece about the neighborhoods that it it's good for everybody to hear what he wrote.'",
        "'speaker_1': 'So did the one copy we have of it, though, just walk out of the room with getting copied.'",
        "'speaker_5': 'If you can play some music in the interim.'",
        "'speaker_1': 'Can we grab the first copy off the printer so we can read it? Thank you, Madam Secretary.'",
        "'speaker_5': 'I may have.'",
        "'speaker_1': 'And does it matter who reads it in? Can I just read it in to the record or.'",
        "'speaker_7': 'Yes, that would begin. Okay.'",
        "'speaker_1': 'Thank you. All right, here is the letter. Uh, Councilman Brooks and Courtney Levinson. Thank you for referring the rezoning request for 2535 East 40th Avenue to mediation. As you can imagine, I believe mediation and helping people find a way to talk with each other has the potential to resolve a lot of issues and concerns in a collaborative'",
        "'speaker_1': 'manner. I met with the applicant, Tom Gordon's representative Bill Moore, and Bruce O'Donnell, along with about 20 neighbors on two occasions, April 16th and April 23rd at each meeting. We had a full involvement and discussion by everyone around issues and concerns of the neighbors and the ideas and commitments Mr. Thomas was prepared to make if the rezoning'",
        "'speaker_1': 'was approved. As expected, there were some gaps between what the neighbors yes. Were asking for and what Mr. Thomas felt he could do specifically about an increased number of affordable units, neighborhood based affirmative marketing plan, representation and inclusion in an advisory capacity.'",
        "'speaker_1': 'Financial support for displacement pressures in the form of legal defense fund and property tax relief. Preference and affordable accommodations for commercial space for local businesses. Preference for local businesses in the development and construction community. Open Space Traffic Issues and health concerns.'",
        "'speaker_1': 'I asked for a small working group to enable us to discuss and make decisions in a timely manner. We were scheduled to meet again on Thursday, April 25th. This was a meeting with Mr. Gordon's representatives and five gees neighbor representatives.'",
        "'speaker_1': 'At the very last minute, Mr. Gordon canceled the meeting. I was able to talk with Mr. Gordon later that day and work towards rescheduling the meeting. Our working group met on Monday, April 29th. That was a very productive meeting with open, honest and collaborative discussion.'",
        "'speaker_1': 'I believe we were able to resolve all of the points that GM slash R.A. slash neighbors were asking. With that, with what Mr. Thomas was willing or able to agree upon, with the exception of a displacement impact fee, the challenge came in getting it on paper.'",
        "'speaker_1': 'Many emails and drafts. Later, Mr. Thomas's team finalized and submitted an agreement that addressed the issues and concerns that were identified in our April 29th meeting. With the exception of one point the displacement impact fee, I'm attaching a copy of that agreement for your reference.'",
        "'speaker_1': 'Thursday evening, May 2nd, the neighborhood spent significant time discussing the agreement, concerns about increasing displacement impacts and ultimately voted 12 to 7 to oppose the rezoning and not sign the agreement. The three are no representatives abstained. I was not present but was informed.'",
        "'speaker_1': 'The real concern from the neighborhood was about the impact of potential displacement upon vulnerable persons. Unfortunately, we do not have a signed agreement. However, there was a significant hard work and commitment by the neighborhood and Mr. Thomas's team.'",
        "'speaker_1': 'We were very close to and accomplished a lot. I would propose to you that we have an agreement that both sides agreed upon, with the exception of the one point displacement impact remediation. Thank you, Steve Charbonneau. All right.'",
        "'speaker_1': 'No other questions. The continued public hearing for council, the 1 to 7 is closed. Removed two comments by members of council. Councilman Brooks.'",
        "'speaker_5': 'Yeah, thank you, Mr. President. And I want to thank everybody for being here and all their hard work on this pretty frustrating process. And and I think all parties from, you know, as my lawyer is listening to me over here, it's really frustrating being a council person, being the judge and not being able to actually go in'",
        "'speaker_5': 'and see where the deficiencies are. I saw where the deficiencies in the argument were on the community side. I saw where the deficiencies in the arguments were on the developer side. And it was frustrating because it felt like the two kept missing each other.'",
        "'speaker_5': 'At one point the developer left the table. A lot of mistrust, obviously, for the community. And the community made a vote and didn't send in with the vote what we want except for the we want it to stay the same zoning but what specific issue.'",
        "'speaker_5': 'And so that was that was just it was just problematic and tough all the way around. I think when you look at the Swansea, a neighborhood and by the way, I live three blocks away from this. So I understand residential and industrial zoning.'",
        "'speaker_5': 'I live across the street from the Coca-Cola plant. I understand those zoning and I understand those issues and the impact they have on a community. And so I get it. And I also get the fear of displacement that's going on all around our community and the fear displacement that's going on in my kids classrooms that's happening all'",
        "'speaker_5': 'around the community. And so everything that Swansea and Elyria and the Gas Coalition is saying is all justified. It's all right. The question is, what is the right tool to begin to deal with these issues? Is the tool putting in new policies in this one single development?'",
        "'speaker_5': 'Is that the right tool or is a tool saying, you know what? Maybe in displacement, in gentrified neighborhoods, there should be a higher bar for impact fees and things like that. That's a larger policy conversation that we have been working.'",
        "'speaker_5': 'And it takes a long time. Right. And so I get the frustration from the community. Here's here's where I land. We do have this criteria that we have to look at. And I'm telling you right now, what has not been shared or talked about with anyone.'",
        "'speaker_5': 'Is this location is an enterprise is in an opportunity zone. An opportunity zone. Takes a ton of individuals who can invest in property. And so what you see today is an AT&T site that's going away. If if you don't get a rezoning until I am x three and things like that, you get an incredible redevelopment plan, much'",
        "'speaker_5': 'more density and much more expensive development and commercial development. And let's be very clear, it does not have to be industrial. It can be commercial development. That would put a lot of pressure on the community. AT&T did nothing.'",
        "'speaker_5': 'Opened up no doors for Swansea. Nothing. And I think we need to realize that and acknowledge that. So. In reviewing the criteria. I am x three is exactly what the plan says. I am x three and reviewing the criteria is much better for a community than what you have now and what you could get if this developer'",
        "'speaker_5': 'goes to the market and sells it to the highest bidder on the market. I know there's not a lot of knowledge in in issues on opportunity zones, but people are starting to invest globally to find opportunity zones all throughout America.'",
        "'speaker_5': 'Because of this new legislation that just passed. It is a it is a serious issue. We have a developer who has agreed to provide and I haven't seen this before. 2000 square feet of. Of retail or community space.'",
        "'speaker_5': 'We need to take advantage of it and use it for our entrepreneurial space. The 70 units we need to take advantage of it and recruit, recruit housing for teachers at Bruce Randolph. We need to take advantage of it and use the GST Coalition to do the redevelopment and things like that.'",
        "'speaker_5': 'And so I'll be supporting this redevelopment and I'll be supporting this rezoning and I hope the community stays engaged with this or else we will see another development that closes the community out. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilman Espinosa.'",
        "'speaker_5': 'And so my colleague, my colleague was right in that the plan has a lot of nebulous language that talks about industrial areas being residential and all that stuff. But the recommendation number one that I pointed to last time and I'll point to again is item B5 recommendation number one of this plan improve transition between industrial residential uses'",
        "'speaker_5': 'to improve compatibility between residential and more intensive industrial areas. Development in these areas should be consistent with the industrial mixed use land designation and it's a C, E, three, E, eight and E 22, which are the character area strategies of the plan?'",
        "'speaker_5': 'And it doesn't emphasize those three recommendations. Do not emphasize that you convert industrial mixed use into some sort of massive residential development. It does. There are again, I will acknowledge that there are other parts of the plan, but they are not specifically in the recommendations.'",
        "'speaker_5': 'So I think there's adequate language in here that you could say that this zoning does not conform to the adopted plan, you know, and so that gets me into where I was going and was hoping out of this outcome, which is how then do we resolve how do we make sure that those nebulous parts of the plan'",
        "'speaker_5': 'and in the conflicting language of the recommendations are married in the way you do that is through compromise and through negotiation. And I'm sort of frustrated, as you can tell, sort of on both sides, because I think we have actually pretty impressive set of agreements.'",
        "'speaker_5': 'And and but then what you heard me talk in my own questioning, where I'm frustrated is the fact that we as a city, we as city council representatives didn't engage you guys in the process so that we weren't in this situation where you actually have a lot of good things, really impressive things, things that go above and'",
        "'speaker_5': 'beyond. I will acknowledge that the things you put out there are above and beyond where you were. We take a lot of these these entitlement cases and and sit here and not me, not be in full agreement. But I understand why and and almost said it best.'",
        "'speaker_5': 'Where are you? Still here. Yeah, that was that was perfect articulation of the real problem here, which is we don't have this kernel of gentrification going on in this area, even though we have created a stormwater plan that will make this area bone dry and perfect for redevelopment going forward.'",
        "'speaker_5': 'We have set the table for massive redevelopment of this area, but we haven't done as established a market yet. And if we're party to that market creation, you know, God help the rest of the neighborhood when investment reinvestment comes in, because this administration has already said, well, you know, we can't control the market.'",
        "'speaker_5': 'Well, this is where we do it. You know, because I'm going back and looking at census reporter right now, dawg. Looking at the statistics, I mean, the demographics of your neighborhood and I have said it before from this dais that when I moved in Jefferson Park 22 years ago, 1997 was 83% Latino and 53% Spanish speaking.'",
        "'speaker_5': 'I mean, over 50% Spanish speaking. If I look at the demographics right now. Of that census tract, 81% Hispanic. I have no idea what it is special speaking, but I can tell you that the per capita income is $17,508.'",
        "'speaker_5': 'If I look at my own census tract, which is all of Jefferson Park, it is now 45% Hispanic. It is 50% white. And the per capita income in that neighborhood is 49, nine, eight, eight. So there is a difference in median income.'",
        "'speaker_5': 'Our area median income analysis is the citywide median income. That is a very high income in this area. And so now I blame the city. Right, because this is a huge, huge haul on the affordable housing front, no doubt.'",
        "'speaker_5': 'But it is not addressing displacement in this community. There is no opportunity for all but a few people in this neighborhood to actually move into these 60% Army units. And so when they're named, when their properties start to become pressured and their neighborhoods become the next Jefferson Park, is there an option for them to stay in the'",
        "'speaker_5': 'community that they've lived in for decades? Are we providing then should we be providing that? I would say yes. I think this council has been consistent in saying, yeah, we need to address gentrification. And there is a way using market forces and using all of this agreement.'",
        "'speaker_5': 'And what we had was a very, very compliant developer. And what we didn't do is have that conversation robustly with the community so that we came in here going, You know what? It isn't. I mean, what we had here was a great opportunity, right?'",
        "'speaker_5': 'Because nobody all acknowledged nobody's getting displaced by this project specifically. It's only indirectly. There isn't a single residential unit on that property, I don't think. So this is an opportunity. So do we need 70 units at 60%? Am I over here when other developments are generating tons and tons at 60 and 80 and 120?'",
        "'speaker_5': 'Or do we actually need something lower to create that opportunity and less of it because there aren't a ton of houses? Let's be honest, the dense the dwelling unit density in this area isn't super compact. And so there was that opportunity.'",
        "'speaker_5': 'But nobody's doing the calculus. No one's really playing that game and going, Okay, how do we move these pieces so that we actually create opportunity? At the same time, you know that the market forces are going to do it themselves.'",
        "'speaker_5': 'And so that is why it was so important to me, because now we're I feel emboldened. I feel empowered by comp plan and the new plan blueprint. Denver Because it speaks to these things, the importance of these things and to us to be considering them going forward.'",
        "'speaker_5': 'And so to do rezonings just the way we always have. I'm sorry. It's a it should be a new day. I think I've heard it from the citizens of Denver and the administration. And my colleagues. Most definitely. But are we?'",
        "'speaker_5': 'So I'm. I. I. This is an imperfect process. We have a good a a good package. I don't know how I'm going to vote because I am struggling with the plan recommendations and the fact that we have not closed this gap.'",
        "'speaker_5': 'We came very, very close. But I do agree that it is a good agreement. If this rezoning goes through, I would highly encourage this community. Take this developer at his word. Put one of those names of those community organizations on it.'",
        "'speaker_5': 'That way you can say, yes, we're party to your agreement. You said you would do these things. We're not just going to trust you. We have a document that you sign and I signed. And at least do those things, you know, because it is better than what Jefferson Park got.'",
        "'speaker_5': 'Right, which was 100% use by right. Trying to think other than the rezonings that I did in Jefferson Park. There wasn't a single rezoning in Jefferson Park. All of that happened without anybody's say other than the plan reviewers.'",
        "'speaker_5': 'That is the situation you're putting yourself in. If you don't execute these agreements. Okay. So again, we heard it here, the willingness it is a bit of the term I can't remember again. I get it. But I think there's opportunity.'",
        "'speaker_5': 'And if we if we put you in too tight of a box, come to Gedo, come to the city and say, look, we we made the obligation to to to tight for you guys, but it's too important to this community.'",
        "'speaker_5': 'And and and we want to get there because I think I think this administration, any incoming administration, this council will find reason to help. If it starts to address these issues. So, again, I don't know where I'm going to vote, but I did want to get those comments out.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa, Councilman Cashman. Thank you, Mr. President. So we go from an earlier rezoning where we had 30 meetings over three years to this process that was considerably less robust. Now, that's not something that is a criteria that we can vote on.'",
        "'speaker_1': 'But I think it's relevant because I think if we had a more robust, extended community process, I think we'd have an agreement. In this case, I think we've got a situation where, if I'm remembering from last last times testimony out of about 700 residential units, about 70 will be affordable.'",
        "'speaker_1': 'And I wonder if the impact of those 630 market rate units doesn't have more of a negative impact on the community than the 70 affordable units? Help it out again. And I point to our housing plan, as well as the newer plans that unfortunately don't come into play on this, where gentrification is held out as something that'",
        "'speaker_1': 'we clearly need to take action on. I'm concerned because we have a development agreement that's barely a development agreement. As as development of this site unfolds, there's will be no public meetings as site plans come into play. So I wonder if this is truly a plan that's protective of health and safety.'",
        "'speaker_1': 'And while there are certainly elements in the proposed community benefits agreement that are very worthy of the neighborhood's consideration, the fact that there are those few elements missing from the recipe that makes it unpalatable, unpalatable for the neighbors also gives me concern.'",
        "'speaker_1': 'So, yeah, I just wanted to put that out there. Mr. President. Thank you. Thank you. Councilman Cashman. Councilwoman Cannick.'",
        "'speaker_7': 'Thank you, Mr. President. I think it's important to recap what I think I've heard through this process, because each discussion we have from this dais isn't just a decision about what's in front of us. It's also about what is the work plan going forward.'",
        "'speaker_7': 'Right. And so I want this community to know how much I appreciate their time and that I'm thinking about both of those things. And I also want to thank the applicant for agreeing, perhaps under duress, but agreeing nonetheless to the one month delay to get us here.'",
        "'speaker_7': 'So we have some process and infrastructure failures that some of which are most of which I think we can address. So first was that we didn't get notice to renters and to neighbors through the process. That is something I have alerted CPD that I and I will not vote for the large development review ordinance that's coming forward'",
        "'speaker_7': 'unless we fix that. I've already fixed it in the tiny home ordinance that I'm going to be bringing forward over the summer. Should I have the pleasure of continuing to sit on his dais anyway? And so that is something we can fix to provide notice to properties or structures within 400 feet to.'",
        "'speaker_7': 'We have a housing negotiation process that sets our Office of Housing at the table with developers with no mechanism to get input from the community on the affordability levels they're negotiating. That is something we can also fix. I'm looking at kind of the ways to do that.'",
        "'speaker_7': 'One of the ways I think that may help is that I have worked with the folks in CPD to make sure there's a neighborhood informational meeting in the large development review process. So that creates at least an opportunity.'",
        "'speaker_7': 'And I'm hopeful that we can time that such that no housing agreement can be entered into before that meeting. So we'll see how all that works. But that is something that can be fixed and I think should be fixed.'",
        "'speaker_7': 'Three We don't really have an anchor organization with expertize and community benefits. The organization I worked for before I got elected doesn't do that work anymore. And you all have been short on the kind of expertize you might have needed to understand maybe where some of the things could have been written differently, or how you could have'",
        "'speaker_7': 'gotten some some explanations on what you were getting. And so that also, I think, is something we can fix. I've been urging that we as a city invest in capacity. Building and whether it's us or whether it's the foundation community, I'm committed to bringing some of my old friends from the National Network to Town to do some'",
        "'speaker_7': 'trainings. I think both with us as government as well as with the community, maybe even with the development sector, to talk about how we do this better because there hasn't really been this infrastructure in the last few years.'",
        "'speaker_7': 'So those are the then we have some substance issues. The community is trying to overcome deficits and citywide policy in one particular site and the applicant identified that. Right. I think we all have different roles in a democracy and your role in bringing that forward is appropriate, right?'",
        "'speaker_7': 'Even if it's sometimes an awkward fit, it makes us understand where the big rules need to change so we can't control rising rents. I testified for a bill that might have given us the ability to debate that law.'",
        "'speaker_7': 'It didn't pass. So you're trying to find workarounds, right? From a shortage of state law. We can't assess property differently based on where you live and say, oh, this neighborhood, we want to give them a lower property tax rate than another neighborhood.'",
        "'speaker_7': 'The state doesn't let us do that. So you're trying to find these ways. I and then the third thing you talked about was this resident preference policy. And that one, we are working on it. We're just behind you.'",
        "'speaker_7': 'Right? We are working to get the data and the criteria so we can say to developers, here's how you can make sure that the community nearby gets a chance to get these units. It seems like there are some private market opportunities you can do without our city policy, and I hope you look at those.'",
        "'speaker_7': 'So I believe that these are things that we can continue to work on. So regardless how this vote goes tonight, the community's been heard and many of these things, we can make fixes at least to move us forward.'",
        "'speaker_7': 'There is a difference in my mind between Nada e insufficient thing. I don't think we have nada here tonight. We don't have nothing. The local business space is something most communities are asking for to have local business space.'",
        "'speaker_7': 'You've gotten a seed funding for a legal defense fund. 70 units to negotiate over is not nothing sufficient to always know. Maybe it's not enough, but that's different than nothing. And it's important for the community to recognize that there are some pieces in here to build on.'",
        "'speaker_7': 'So as I look forward, we have this situation where the other structural process thing that we're not going to fix is that the committee, the council can't be engaged in negotiations around zoning. One thing you will notice is most community benefits agreements are related to city subsidies, taxing authority or public land.'",
        "'speaker_7': 'They're not linked to zoning. So we have to follow these legal criteria and we can't step into your negotiation when zoning are involved. So you'll see very few community benefits agreements nationally with zoning. But I heard today that there's going to be a request for a metropolitan district.'",
        "'speaker_7': 'What I believe is I have to make a decision based on the criteria. And the criteria tell me that we have a plan that calls for changing from industrial. I don't believe that the health and safety of the community is better protected by more intense industrial use than a re-use of these existing buildings at pretty low density'",
        "'speaker_7': ', two and a half storeys. So I don't have the criteria I need, but I believe that if the community were to sign this agreement and continue to negotiate over the potential of deeper affordability and the advertising of the units, I can absolutely be more engaged as a council member if there's a metropolitan district before me.'",
        "'speaker_7': 'If you want special taxing authority, you're going to need to demonstrate a little bit of make up time on the, you know, some of the time you lost in the beginning. Right. So you'll have more time to do these discussions as you put together a metropolitan district.'",
        "'speaker_7': 'So I have more authority as a council member to consider more factors in that discussion, in my opinion. So with that said, I believe that today is one step and it's a vote on the criteria for the zoning.'",
        "'speaker_7': 'This doesn't mean that it's dollar total isn't isn't one, but that's different than I heard a term at the legislature every step. If you feel like this zoning decision is a loss, if it goes against, if it goes if we pass it tonight, it's a loss forward, not a loss backward because we've identified things we can fix'",
        "'speaker_7': '. So with that, I will be voting for the rezoning tonight, but I will be watching closely now that I can engage more in a different way. And I hope to see that there is good faith on the depth of affordability and on the advertising of the units in future non zoning conversations.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Kennedy. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. First of all, I just want to say I appreciate all the work on both sides. That has taken place in trying to find some middle ground here. I appreciate the the work that was done to spell out a community benefit agreement of items that I think do take a step in the right direction'",
        "'speaker_9': '. I'm very concerned that it is not signed by anybody from the neighborhood, but that more so that it has if this developer chooses to sell this land and it would be much more valuable now once it gets resolved, that agreement between this developer and the neighborhood would go away.'",
        "'speaker_9': 'And I would hope that the development team before us is sincere in their commitment to develop the site, not to turn around and flip it, because we've seen that happen way too many times before with sites that have come before this body where the land has been flipped after it's been resolved.'",
        "'speaker_9': 'I am concerned that the neighborhood's role in this process didn't you know, it's not like many of other neighborhoods across the city where they're represented by legal counsel. They have, you know, folks that oftentimes have been hired by consulting firms to come in and represent them.'",
        "'speaker_9': 'So it's it's like you've got two sides on a level playing field. And and I think this was kind of a lopsided and it's not to say that you weren't sincere in the things that were put on the table to try to address some of the concerns raised by the community.'",
        "'speaker_9': 'But this is a deficiency in our process when we are talking about how we address gentrification and displacement in this city, in neighborhoods that are being impacted over and over again. And this is an area of the city that is dealing with massive redevelopment activity, whether it's public projects or private projects, and in some cases, public private'",
        "'speaker_9': 'projects. And just the fact that, you know, people in these neighborhoods are struggling just to move around, to get in and out of their community because of the activity that is happening in the neighborhood, which is exacerbating the the the taxes that they're now seeing occur.'",
        "'speaker_9': 'These are some neighborhoods, I believe Montebello is is comparable to these neighborhoods where they have seen greater increases in their valuations than what other neighborhoods across the city have seen. I just wish that we had a way. And these are some things that I'm committed to working on as well, where, you know, some of us have talked'",
        "'speaker_9': 'about the fact that our zoning code sections of it need to be changed. And this isn't going to deal with tonight's situation. But the fact that our zoning process doesn't allow us to look at the full picture makes it challenging in terms of how we're making a complete decision based on just components of a project that we'",
        "'speaker_9': 'get to see and then pieces get worked out later on down the road by our staff at the Planning Department. And sometimes I think you all are at the same mercy of the process you have to go through with our with our planning department.'",
        "'speaker_9': 'It's subject to, you know, interpretation and sometimes the timing as well. And I think if we had greater predictability, where we all have a chance to know exactly what's being brought before us and what is brought before us is what's going to be built.'",
        "'speaker_9': 'It gives that same predictability to neighborhoods and to to our development community. I'm struggling with where I'm going to land on this tonight. I mean, I think there's been good faith in terms of both sides coming together, trying to identify some workable items in this project.'",
        "'speaker_9': 'But. This is a massive change in what is there today to go from an industrial area to 700 units, not unlike when we redeveloped the Central Valley and changed the zoning and totally changed the whole character of that area.'",
        "'speaker_9': 'But it was master plan to be that way. And the unfortunate thing here is there was no general development plan for, you know, anybody to really have input into all of that. So I'm just struggling with where I'm going to land.'",
        "'speaker_9': 'But those are my thoughts and concerns about changes we need to make in our process that ensure that when we're impacting our low income neighborhoods, that we have the right tools put in place to really address these issues on the front end.'",
        "'speaker_9': 'I mean, we have an office of next nest, but we brought no tools to the table to deal with these issues. And that needs to happen not necessarily always by the developer, but as part of the process in looking at how are we solving these issues so that we're not exacerbating them for the the impacted communities.'",
        "'speaker_9': 'So you're hearing some of my frustration as well in in just kind of what's what's happening in general to some of these neighborhoods where, you know, because the criteria is there. When we meet the criteria, we have to say, yes, we're going to see the same thing when the metro district gets filed.'",
        "'speaker_9': 'The metro district doesn't give us the tools to make changes. As long as the criteria is met in the metro district and there's a host of criteria that they can choose and pick from, as long as that's met we're in the same boat, we would have to vote for it if it meets the criteria.'",
        "'speaker_9': 'So anyway, I'm going to stop at that, but I'm just sharing some of my concerns about where we're at in dealing with this area of town, knowing we've been dealing with these same issues over and over and over again.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Flynn. Thank you, Mr. President. Like most of my colleagues, I have some of the same struggles with with this particular application. And I appreciate the input and the questions from all of our colleagues as I've sat here and I've read all the material and it is very difficult and we do make a'",
        "'speaker_1': 'decision based on the criteria before us. And while it's easy to see how the application meets at least four of the five criteria, it's that third one that I always struggle with when the community comes out in force, and that's furthering the public health, safety and welfare.'",
        "'speaker_1': 'I have seen the impacts of increasing property values on my in my district in Mali, in Harvey Park, Brentwood. And I've seen how it's affected Councilman Lopez district. And then on up through that famous inverted EL that we keep talking about and but this is such a small piece and an adaptive reuse and the addition of of'",
        "'speaker_1': 'affordable units that that pulls me in the other direction as well. So I've struggled with how the impact will affect the longtime residents as well. And I'm. Well, we'll see how this goes on the roll call, because I am like Councilwoman Ortega, like Councilman Espinosa.'",
        "'speaker_1': 'I'm very torn on this. But I really do appreciate the questions and the comments from colleagues. It's been very helpful. Thank you. Thank you. Councilman Flynn, Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. I I guess the theme tonight is is torn because I somebody made the comment earlier we come from or. Yeah. Sometimes you have folks in here who are opposed who can pack the place of their own resources and lawyers and consultants.'",
        "'speaker_8': 'And it keeps us out until past midnight thinking about these same issues. And sometimes it's actually folks who are opposed, right, to to affordable housing and things like that. I worry and I and, you know, I think community process as we see this a couple of times come in these chambers.'",
        "'speaker_8': 'You know, I really appreciate, uh, the extra month that the sides were able to agree to, to sit down and to try to iron out some mutual benefits. That, that, that speaks volumes to me, however. And I do, I, I get it.'",
        "'speaker_8': '700 units, 70%. And some of the affordable units, some say it's 10%. You know, those are things that we can consider in rezoning, but they do have an effect and they do have an effect on some of the criteria of the rezoning.'",
        "'speaker_8': 'Um, it speaks to changing conditions. It speaks to health, safety. And I'm sorry. And. Conformance with adopted plans in the vision. My worry is where I struggle with this is precedent. And are we setting the bar too low as what's acceptable?'",
        "'speaker_8': 'Are we setting the bar too low and are we setting expectations too low when we think about this from a perspective that's not just confined to on on paper in the letter of the law, but what the intent is.'",
        "'speaker_8': 'And. Councilman Flynn, I really appreciate the inverted l conversation and in point because this is part of that convert it all in that inverted L in the city we are losing people. This is where that struggle exists. So I too am conflicted with it because, well, really not much I can say there, except that I know that'",
        "'speaker_8': 'we can do better. And it requires a little bit more conversation and a little bit more political will, especially. From the city. Especially from the states and these chambers. And knowing that and knowing what it can be and seeing what it can be.'",
        "'speaker_8': 'Conflicts. Conflicts. Me with this particular reason. I know I can't base everything off of something that can happen in the future, but. I'm just I know that there's another standard. We seem to be able to push for so with a lot of conflict.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez. See no other comments, Madam Secretary. Rocco.'",
        "'speaker_4': 'BROOKS I'm blessed. All right.'",
        "'speaker_5': 'ESPINOSA Yes.'",
        "'speaker_0': 'Flynn All right.'",
        "'speaker_4': 'Gilmore, I. Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Cashman They can each I. Lopez?'",
        "'speaker_8': 'No.'",
        "'speaker_4': 'Ortega, no. Sussman Espinosa.'",
        "'speaker_5': 'No.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'All right. Madam Secretary, please close the voting, announce the results.'",
        "'speaker_4': 'Seven days, three days.'",
        "'speaker_1': 'Missing, and so on.'",
        "'speaker_9': 'Their mine did not show up.'",
        "'speaker_4': 'There's was a knee. Seven days. Four days.'",
        "'speaker_1': 'It still gets us 11. Don't we have 12 up here and.'",
        "'speaker_0': '12 up there.'",
        "'speaker_1': 'Though? We're still missing somebody else. A couple of.'",
        "'speaker_8': 'Folks learned something about.'",
        "'speaker_1': 'This, didn't push the button.'",
        "'speaker_4': 'Okay. Officially 8 hours. Four days.'",
        "'speaker_1': 'Eight days, four days. Townsville 127 has passed. On June 3rd, 2019, Council will hold a required public hearing on Council Bill 352 changing the zoning classification for 4891 Lincoln Street in Globeville in a required public hearing on Council Bill 380, changing the zoning classification for multiple properties located in the University Park neighborhood between I-25 and Harvard Gulch'"
    ]
}