{
    "Proclamation for Buy Local Week and Campaign.": [
        "'speaker_2': 'We do have one proclamation this evening. Proclamation? 1035 Councilwoman Canete, will you please read Proclamation 1035?'",
        "'speaker_0': 'Yes, Mr. President. Thank you. Proclamation 135 celebrating the eighth annual Buy Local Week from November 28th through December 5th as part of the ongoing buy local campaign to encourage the support of local businesses. Whereas local businesses are owned by our neighbors and the unique products and services they provide enhance the character of our city and the strength'",
        "'speaker_0': 'of our neighborhoods. And. Whereas, these local companies provide vital employment opportunities and generate tax revenues that support city services, our schools and our state. And. Whereas, retail spending accounts for more than $11 billion during the holidays and dollars spent at local retailers have a greater impact on our local economy by keeping profits in our community and using'",
        "'speaker_0': 'local suppliers and services. And. Whereas, the city and county of Denver recognizes the vital role of local businesses in building a diverse and resilient economy and is committed to growing our base of local retailers and restaurants. And. Whereas, supporting locally owned businesses during the holiday season and beyond has a positive economic impact and contributes to the quality'",
        "'speaker_0': 'of life and sense of community in Denver. And. Whereas, The Mile-High Business Alliance and its members mobilized Coloradans to shop local businesses first and to raise awareness of the opportunities and impacts of mining locally. And. WHEREAS, more than 10,000 small businesses in Denver employ nearly 200,000 persons, 44% of the employment in the city, contributing more than $10'",
        "'speaker_0': 'billion in wages to our local economy. And. Whereas, the residents of Denver are encouraged to support our local retailers and restaurant establishments this holiday season and throughout the year. Now, therefore, be it proclaimed by the City and Council of the Council of the City and County of Denver, Section one, that, in recognition of the annual buy local'",
        "'speaker_0': 'campaign, Denver City Council proclaims the week of November 28th through December 5th as buy local week in Denver to show its support and to highlight the importance of buying in Denver at its many retail and restaurant businesses. Section two that the clerk of the city and county of Denver shall test and affix the seal of the city'",
        "'speaker_0': 'and county of Denver to this proclamation and that a copy be transmitted to Mikki Langston Mile-High Business Alliance.'",
        "'speaker_2': 'Thank you. Councilwoman can eat your motion to adopt.'",
        "'speaker_0': 'Thank you, Mr. President. I move that proclamation 1035 be adopted.'",
        "'speaker_2': 'It has been moved in. Second it comments from members of the council council and can each.'",
        "'speaker_0': 'Thank you, Mr. President. It's my annual buy local proclamation because we are getting ready for the beginning of that shopping season. People call it Black Friday, but remember that Saturday is small business Saturday. And as usual, just thinking about with intentionality the things that we can buy.'",
        "'speaker_0': 'You know, we have so many local business districts in Denver, South Pearl, we've got Gaylord Street, we've got Cherry Creek, we've got Tennyson Street. We've got all of the great independent businesses around Larimer Square and downtown in the LoDo vicinity.'",
        "'speaker_0': 'And so we are blessed with these opportunities and these businesses. This is a make or break season for them and it takes that little bit of thought to really go ahead and get a gift certificate from them or pick up a piece of jewelry or some item that can really bring joy to the people you buy gifts'",
        "'speaker_0': 'for, but also bring more dollars back to your economy because those businesses are more likely to be using local suppliers, they're more likely to be using local banks, and they probably are investing their profits back into their own homes, in their own communities, with their own shopping and their own economic purchasing power.'",
        "'speaker_0': 'So it really is a circle of money that these businesses create in our community. And so for that reason, I hope that folks do go ahead and buy local beginning Friday and all year long. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman Canning. Councilwoman Robb.'",
        "'speaker_0': 'Thank you, Mr. President.'",
        "'speaker_6': 'Very well put, and thank you for bringing the proclamation. Councilwoman Kennish.'",
        "'speaker_0': 'I know all my colleagues know.'",
        "'speaker_7': 'About Cherry Creek.'",
        "'speaker_6': 'But maybe someone's flipping channels. And I want.'",
        "'speaker_7': 'You to know at home that there are.'",
        "'speaker_6': '292.'",
        "'speaker_0': 'Locally owned and operated.'",
        "'speaker_6': 'Businesses in.'",
        "'speaker_7': 'Cherry Creek. This is the largest.'",
        "'speaker_0': 'Accumulation of local businesses.'",
        "'speaker_6': 'In the region, maybe in quite a large region.'",
        "'speaker_0': 'And the other really cool thing that you should know.'",
        "'speaker_7': 'Is this year for the.'",
        "'speaker_0': 'Holidays, starting on Saturday Shop Local Saturday.'",
        "'speaker_6': 'The Business Improvement District will.'",
        "'speaker_7': 'Be providing.'",
        "'speaker_0': 'Free valet parking. You can get the valet, you can have your car laid on the west side.'",
        "'speaker_6': 'Of Fillmore Plaza between first and second, or on.'",
        "'speaker_0': 'Josephine Street, between second and third on the east side.'",
        "'speaker_6': 'Of the street. You do have to bring proof of a purchase back when you pick up your car. That's all you have to do. But you can park free. No hassle. So we'll look forward to seeing people.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_6': 'I just wanted to thank Councilwoman Canete for bringing this forward and just add that there's one other place that people don't always think about as one of our shopping venues, if you will, and that's how it does. We have a number of locally owned businesses that, you know, have restaurants as well as other types of goods, and'",
        "'speaker_6': 'just encourage that if you're picking someone up or if you're flying through Denver, that's another place to shop locally. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Any other comments on 1035 C None, Madam Secretary.'",
        "'speaker_7': 'Roll call can each layman by Lopez. Hi, Monteiro. I Nevitt. Hi, Ortega. Hi, Rob Shepherd. Sussman Hi. Brooks. Hi, Brown. I thought.'",
        "'speaker_6': 'I.'",
        "'speaker_7': 'Lopez.'",
        "'speaker_2': 'Hi.'",
        "'speaker_7': 'Mr. President.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Student.'",
        "'speaker_2': 'Councilmembers Brooks and Brown. Your votes are hanging.'",
        "'speaker_3': 'Fire BS.'",
        "'speaker_2': 'One more. Thank you, councilman. Round. Madam Secretary, please close the voting. And as a result 3939 1035 has been adopted. Councilman McNeish, is there someone you'd like to invite to the podium to receive the proclamation?'",
        "'speaker_6': 'You need to call someone up.'",
        "'speaker_0': 'Yes, Mr. President. I'm sorry. May I please have Mikki Langston join us to accept the proclamation? Thank you, Mr. President, and members of Council. It's always such a privilege to hear your support of local businesses during by work week.'",
        "'speaker_0': 'When I first started at Mile High Business Lyons in 2007, some people said to me, Why are you talking about the economy? There's nothing wrong with the economy. And that was 27. Obviously, it became very clear very quickly that creating an economy that works for everyone is not an accident.'",
        "'speaker_0': 'And that's especially true for I'm sorry, I get nervous. It's especially true for the millions of Americans who are still struggling to recover from the recession that started in 2008. And in Colorado, we're really lucky. We live in a state that has one of the highest rates of economic growth and one of the lowest rates of unemployment'",
        "'speaker_0': 'in the entire nation. But that really is the point of buy local week, that what Buy Local Week is about is reminding us that we have the power individually and collectively to build the kind of community that we want to live in that has independent, local businesses that not only add to the economic vitality of our community'",
        "'speaker_0': ', but also the neighborhoods that we really love to live in. So I'm honored to receive this proclamation and have great gratitude for Councilwoman Canete and for all of you for supporting local businesses now and into the future. And for those folks that do want to connect with local businesses, we always invite them to our website at Mile'",
        "'speaker_0': 'High Best at work. Thank you and have a great evening.'",
        "'speaker_2': 'Thank you. Thank you, Miss Langston. Thank you, Councilman Kenny, for bringing this forward. We are now moving on to the resolution. Madam Secretary, please read the resolution.'",
        "'speaker_7': 'From safety and well-being 1036 resolution authorizing approving expenditure and payment from the appropriation account. Designated labor liability claim sum at $25,000 payable to Regina and Petraeus in amount of $14,600 into Kilmer Lane of Newman LLP in the amount of $10,400 for payment suspension, all claims to the election number of 13 dashboards 303220w id KMT in United States'"
    ],
    "Adoption of the Globeville Neighborhood Plan.": [
        "'speaker_6': 'Thank you, Mr. President. I call this out because this is a proposed ordinance approving the Globeville neighborhood plan. And what I would like to do is ask for a courtesy public.'",
        "'speaker_0': 'Hearing for.'",
        "'speaker_6': 'For the night of December 1st.'",
        "'speaker_2': 'December 1st. Got it. So if there are no objections from members of council, we will have a cursory public hearing on 971 The Globeville Neighborhood Plan. Monday, December 1st. Thank you, Councilman Monti. Madam Secretary, can you tee up the next one, which I believe should be 924, called out by Councilman Fox?'",
        "'speaker_2': 'Councilman Fox, would you like for us to do with this?'",
        "'speaker_6': 'Please put on the floor for a vote?'",
        "'speaker_2': 'Certainly. Councilmember S, could you make the motion for us this evening?'",
        "'speaker_3': 'Yes, Mr. President.'",
        "'speaker_2': 'Could you please put 924 on the floor for final consideration and do pass?'",
        "'speaker_3': 'Certainly I move the constable 924 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved and seconded. Comments from members of Council Councilwoman Fox.'"
    ],
    "Purchase and Sale Agreement for 12025 East 45th Avenue.": [
        "'speaker_6': 'Thank you, Mr. President. This is an ordinance to purchase a building for 911 purposes will house the call receivers and dispatch information. I do not oppose the actual purchase of this building, but it is a package deal. It also will be coming with a bill that for payment requires certificates of participation to be floated and in fact'",
        "'speaker_6': 'they will be floated over what the cost of the building actually is to incorporate some of the money that will be required for the for remodeling this building. We will, according to the Department of Finance, end up when it's when they it's structured the way they expect.'",
        "'speaker_6': 'Probably pay about $4 million in interest. And we have such a rich budget this year, I don't see any reason why a safety measure should have to be floated in debt. And certificates of participation are a very, very sensitive matter for me because I believe they are a way to get around the TABOR constitutional amendment to avoid'",
        "'speaker_6': 'a public vote on debt. And so I will be opposing this ordinance.'",
        "'speaker_2': 'Thank you, Councilwoman Fox. Are there any other questions? Councilwoman Ortega.'",
        "'speaker_6': 'I do have a question and I'm not sure who is here from finance, but my question is about the fact that we normally pledge different city buildings until the debt is paid off. And I'd like to know what properties are being set aside for that purpose.'",
        "'speaker_6': 'So can someone from that.'",
        "'speaker_0': 'I'm happy to take that sky. Stuart Mayor's office as councilman fox reference. The actual bill to set up the copy will not be coming to council till January and at that time we will identify the buildings included in it.'",
        "'speaker_0': 'I don't have a list now and I think they're still working through that, but that will be provided when the actual bill for the CLP comes forward.'",
        "'speaker_6': 'Okay. So this is just asking us to approve this, not just the purchase and.'",
        "'speaker_0': 'Sale and.'",
        "'speaker_6': 'Purchase of the new building.'",
        "'speaker_0': 'Correct. Just acquisition.'",
        "'speaker_2': 'Thank you. Good, councilwoman. Yeah. Okay. Any other comments and questions are on 924. Scene on Madam Secretary. Roll call.'",
        "'speaker_7': 'Facts. No. Can each layman write Lopez Montero. Nevitt. Hi. Ortega. I Rob Shepherd. Assessment by Brookes.'",
        "'speaker_3': 'Hi.'",
        "'speaker_7': 'Mr. President, I.'",
        "'speaker_2': 'Councilwoman Ortega.'",
        "'speaker_6': 'I'm sorry.'",
        "'speaker_2': 'Thank you, Madam Secretary. Please close the volume. And now the.'",
        "'speaker_7': 'Result. 11 eyes, one ni, 11 eyes.'",
        "'speaker_2': 'One day, 9/24, when placed upon final consideration and does pass to the next one. Thank you, Madam Secretary. 961 Councilwoman Fox, what would you like for us to do with this?'",
        "'speaker_6': 'Please put on the floor for a vote.'"
    ],
    "Supplemental Appropriations for General Fund and Golf Enterprise Fund.": [
        "'speaker_2': 'Certainly in council members. Could you please put 961 on the floor for final consideration and do pass?'",
        "'speaker_3': 'Certainly, Mr. President, I put Bill Constable 961 ask to be placed on the floor for final consideration and do pass.'",
        "'speaker_2': 'Has been moved and seconded. Comments. Councilwoman Fox.'",
        "'speaker_6': 'Thank you, Mr. President. This is the supplemental appropriation bill. I will be voting against it because of one measure within it and it is a whopper. It's $1.3 million of business incentive money we are transferring to that fund.'",
        "'speaker_6': 'I do not like that fund to begin with, but in this case they won't even name the business we're supposed to be subsidizing. And so this is a nonstarter for me. I'm voting no.'",
        "'speaker_2': 'Thank you, Councilman Watts. And there any other comments from members of council? Seen none. Madam Secretary, Roco.'",
        "'speaker_7': 'Fights no each layman. Lopez Monteiro Nevett i. Ortega, I. Rob Shepherd, I. Sussman Brookes.'",
        "'speaker_3': 'Hi.'",
        "'speaker_7': 'Mr. President.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Councilman Brooks. Councilwoman Ortega. Thank you very much, Madam Secretary. Please close the voting and announce the results.'",
        "'speaker_7': '11 eyes one.'",
        "'speaker_2': 'Day. 11 eyes one day. 961 has been placed on final consideration and does pass. I believe that with all the bills that are called out so we are ready for the block votes. All other bills for introduction are ordered published.'"
    ],
    "Rezoning of Property at 2298 Clay Street in Council District 1.": [
        "'speaker_2': 'Audience Members Please understand that council members to use electronic devices of various kinds to access the materials relevant to the public hearings before us would be assured that by mutual agreement and common practice of the City Council, these devices are not being used for texting, emailing or other communications during the public hearing.'",
        "'speaker_2': 'Councilman Brooks, will you please put Council Bill 813 on the floor?'",
        "'speaker_3': 'Thank you, Mr. President. I move that council bill 813 be placed upon the floor for final consideration and do pass.'",
        "'speaker_2': 'The public hearing for council bill 813 is now open. May we have the staff report?'",
        "'speaker_8': 'Thank you, Mr. President. Good evening, members of Council. I'm Steven Chester with Community Planning and Development. Here to present the staff report for rezoning application for 2298 Cle Street from GMU 3u032umx2x. The subject property is within Council District One Councilwoman Sheppard's district directly across the street from Jefferson Park at the intersection of 23rd Avenue, Clay Street and'",
        "'speaker_8': 'River Drive. Currently zoned GMU three you oh three it is about a 3000 square foot parcel that is a single storey commercial building and a two storey residential structure kind of conjoined through the years. It's about a hundred year old structure.'",
        "'speaker_8': 'The property owners are requesting a rezoning to allow for an eating and drinking establishment for the entire building. So the rezoning application is for a duplex to zoned district. You notice that the you oh three has gone away.'",
        "'speaker_8': 'The use overlay three allows for a small list of commercial uses in residential zoned districts and since will be rezoning to a mixed use zoned district. It's redundant to no longer necessary as a nonresidential building currently in a residential zoned district primary, nine nonresidential and accessory use is allowed in the next two ex are permitted so there'",
        "'speaker_8': 'as it currently exists. All the uses under MBS two x are currently allowed for the commercial portions of the building. So this rezoning will allow for commercial uses for the entire structure under the use list allowed in you annex two x.'",
        "'speaker_8': 'So we will be rezoning to the urban neighborhood. Context mixed use two storey annex zone district with the ex at the end signifying a a list of uses that is less intense. And just. Um. To. The existing context for zoning.'",
        "'speaker_8': 'There's primarily multi-unit and two unit residential zoning to the north and east of the site with some higher density residential to the south. And Jefferson Park zoned OSA to the west. Land use is an area of primarily single-family multifamily residential to the north and east with some higher density multifamily to the south and some commercial uses along'",
        "'speaker_8': 'the ground story of these higher density buildings. A lot of the vacant parcels you see in this map are now rapidly going through redevelopment. The surrounding building forms are a mixture of one and two storey residential structures, and you see there at the bottom a six storey residential building.'",
        "'speaker_8': 'There's some higher density residential residential buildings surrounding the park. So we went to planning board and on September 17th I received a 9 to 0 approval, a recommendation for approval of the zoning application. Five speakers spoke in support of the rezoning with conditions primarily associated with parking, traffic, noise and odors.'",
        "'speaker_8': 'A lot of these have been addressed or all of these have been addressed in a good neighbor. Good neighbor agreement that the applicant is here that can answer any questions. The details of that agreement. Our Neighborhoods and Planning Committee moved the rezoning application out of committee on October 15th in preparation for a public hearing tonight at City'",
        "'speaker_8': 'Council. The Jefferson Park United neighbors submitted a letter in support with conditions similar to those that were mentioned at the public hearing at Planning Borden. They support the rezoning application with some conditions that have been met in the Good Neighbor Agreement.'",
        "'speaker_8': 'The applicant has also provided a list of over 100 neighbors in support of the rezoning and notification of both public hearings has been posted per the Denver Zoning Code. I'll now walk through the criteria in the Denver zoning code for rezoning application, starting with consistency with adopted plans, comprehensive plan 2000 Blueprint, Denver and Jefferson Park Neighborhood Plan'",
        "'speaker_8': 'or the applicable adopted city plans for the subject site. Starting with Comprehensive Plan 2000. There's a number of strategies that support this rezoning application, typically having to do with promoting infill development, creating neighborhoods where residents can live, work and play within close proximity to each other, along with some sustainability strategies focused around re-use of existing buildings and'",
        "'speaker_8': 'promoting infill development. Blueprint Denver designates the subject site as single family duplex. These are four moderately dense areas of the city that are primarily residential, however, with some complementary small scale commercial uses. The plan also designated the site as an area of change.'",
        "'speaker_8': 'Areas of change is where we like to channel growth in order to improve access to jobs, housing and services with fewer and shorter auto trips. 23rd Avenue and Clay Street are both designated as residential collectors and River Drive as a undesignated local street.'",
        "'speaker_8': 'The Jefferson Park Neighborhood Plan provides a number of strategies which support this rezoning application, primarily in the Land Use Urban Forum and zoning section of the plan. Some of the strategies include maintaining enhancing the character and identity of the neighborhood, bringing zoning into closer conformance with the existing land use and land use vision and enhancing residents ability'",
        "'speaker_8': 'to workshop and recruit within the neighborhood. The plan also has a number of sub areas. This subject site falls within the park face sub area and a number of strategies within this section of the plan. Further support this rezoning application, such as preserving the views of downtown Denver from the west side of Jefferson Park.'",
        "'speaker_8': 'It's important to note that this rezoning is actually lowering the maximum height for the person from three stories to two stories, thus implementing this plan vision of preserving those views. The Park Face Area also discusses increasing the safety and activity in the Jefferson Park.'",
        "'speaker_8': 'We feel as though providing a mix of uses surrounding the park will provide more eyes on the park throughout the day, along with increasing the overall activity of the park and increasing its overall safety. So we find that the adopted city plans are consistent with this rezoning application.'",
        "'speaker_8': 'Further, the rezoning application through the adoption are through the implementation of our adopted city plans, provides a uniformity of district regulations and furthers the public health, safety and welfare. The just as justified circumstances for this rezoning application is that the land or its surrounding environs have changed or is changing to a degree that is in the public'",
        "'speaker_8': 'interest to encourage a redevelopment of the area, to recognize the change character of the area. We find that this criterion is met due to the Blueprint Denver designation of an area of change, along with the impressive amount of redevelopment occurring within the Jefferson Park neighborhood.'",
        "'speaker_8': 'In terms of consistency with the neighborhood context zone district purpose and intent really the you AMCs to zone district. I was just actually talking with the applicant before the presentation that it's really the perfect zone district for this type of development.'",
        "'speaker_8': 'It recognizes our embedded small commercial sites within existing residential neighborhoods, typically one or two parcels and limited to low scale building farms and low intensity uses. We find this criterion is met based on the plan, recommendations for this area and existing and desired character for the neighborhood.'",
        "'speaker_8': 'With that, CPD recommends approval based on finding of review criteria have been met. Thank you. We also have the applicant is here with some brief slides detailing their proposal.'",
        "'speaker_2': 'All right. Thank you. We have the applicant on speak now or is that going to be during the three minute? I'm sure that between three and 3 minutes. Okay. You kind of threw me a curveball at the very end.'",
        "'speaker_8': 'Oh, sorry.'",
        "'speaker_2': 'Thank you for that. All right. We have we have six speakers, and I'm going to go ahead and say all six names and I apologize for have any mispronunciations. David Bertrand, Andre Colby on that text, Christopher Schooler, Kent Dawson and Celina Jandreau.'",
        "'speaker_2': 'So, Mr. Bird Burton, if you want to come up, you can go ahead and begin.'",
        "'speaker_3': 'I just press spacebar.'",
        "'speaker_5': 'Hello. My name is David Burton. I'm the applicant. My address is 2899, North Spear Boulevard, Denver, you know, two, one, one. And I just want to present our project that we're proposing tonight, which is rezoning the existing 100 year old commercial building to, um, x2x zoning.'",
        "'speaker_5': 'This building is, was, was originally built the turn of the century. It's been used for commercial uses over the past hundred years. It's been a restaurant, it's been a bar. It's gone to the Board of Adjustment three or four times over its lifespan.'",
        "'speaker_5': 'I was asked by by CPD to rezone this instead of taking it to the board. Again, 80% of the building has been commercial and 20% was residential. It's not a great picture, but you can see it's a commercial storefront corner.'",
        "'speaker_5': 'There is a six story building right next door. We're proposing to renovate the existing building and make it completely commercial. You can see there's a small little gable roof that was embedded in this building. Our proposal is to renovate the existing building and to bring it up to today's standards.'",
        "'speaker_5': 'It'll be a complete renovation. Over the past year, we've met with Jefferson Park. We've met with many different neighborhood groups in the area and garnered their support to do this project. So here's an existing model of the existing building and here is the proposed look.'",
        "'speaker_5': 'We so we're really keeping about the same square footage, but we are proposing a roof deck that will meet the criteria of the, um, x2x Zone District, again, the existing building around the corner of River Drive. And then here is the renovated building.'",
        "'speaker_5': 'So that being said, again, it's been a commercial building for over 100 years. We really are trying to correct an inconsistent zoning to make the zoning consistent with the building type. The um, x to x is the proper zoning for it as it's an embedded commercial building on a corner of a residential district.'",
        "'speaker_5': 'The parcel really is only 3000 square feet. The building is about 3400 square feet existing, and we're not planning on expanding it beyond what we're showing here as well. So if there's any questions, I'd be glad to answer them.'",
        "'speaker_2': 'Thank you, Mr. Burton. Andre Cuvier.'",
        "'speaker_1': 'Hi. My name is.'",
        "'speaker_8': 'Andre Cory, and I'm also here on, uh, on behalf of the development team. I don't have a lot to add to what my boss said. The one thing that I would add is just to reiterate the fact that we're not looking for up zoning.'",
        "'speaker_8': 'We're actually lowering the maximum number of stories and we're not looking for any new uses. The GMU three, which it is currently zoned, is the same use as the um x2x, which is what we're asking for. Really, all we're looking to do is, as he said, CPD wants us to take the one bedroom apartment that is part'",
        "'speaker_8': 'of this and combine it into the rest of the into the rest of the commercial parcel.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. That's a.'",
        "'speaker_1': 'That. That's a 4535 Julian Street, Denver. In presenting this project, this staff member spoke of the changing character of this neighborhood. Of course, since the camping ban you passed, part of that changing character is more people sleeping in Jefferson Park and the other parks around the city as you enjoy your Thanksgiving.'",
        "'speaker_1': 'I hope you'll think of the people who are going to spend their days in our parks, along our rivers, and under our bridges. And I hope that you join me in hoping that the weather improves enough that they all survive.'",
        "'speaker_2': 'Thank you, Mr. Texa. Christopher Schooler.'",
        "'speaker_3': 'Good evening. Christopher Schooler I am a resident of Jefferson Park and neighbor at 25, 22, 23rd Avenue. I live just about eight. Shops down from the proposed site. And I'm merely here to say that I think this is a great project.'",
        "'speaker_3': 'The neighborhood has gone, undergone tremendous change over the years. I've lived there for nearly 12 years, and it's fantastic to see this site potentially becoming available to the public and providing an amenity to our community and even giving some identity to our community.'",
        "'speaker_3': 'So thank you for your time. I do support this project.'",
        "'speaker_2': 'Thank you, Mr. Schooler. Kent Dawson.'",
        "'speaker_3': 'Good evening. My name is Katon Dawson and I'm the proposed tenant for for this property. And we're very excited about the opportunity to to have this establishment in Jefferson Park given given the growth. I've been working with Mr. Burton for several months now.'",
        "'speaker_3': 'We've had some some very productive frequent meetings with the neighborhood association during the General Assembly and with their land use committee. We were able to sign a good neighbor agreement that we all felt very good about that makes this truly a neighborhood friendly, walk up kid friendly establishment, too, to really help, you know, give the neighborhood a'",
        "'speaker_3': 'place where they can be comfortable and ride their bike, walk up to. So I appreciate you're here with us tonight and thank you for your time.'",
        "'speaker_2': 'Thank you, Mr. Dawson. Selena Jandreau.'",
        "'speaker_0': 'Hello. I'm Selena Gaudreau and I live at 2620 West 23rd Avenue and I am actually three houses down from the proposed redevelopment. So I'm excited about it because I think that the building needs a facelift and it will be a great structure and area for us to walk to and not have to get into our car.'",
        "'speaker_0': 'We don't have many of those places in Jefferson Park, so I'm excited and I'm for the the proposal.'",
        "'speaker_2': 'Thank you, Mr. Woodrow. That concludes our speakers is now time for questions. Do we have any questions from members of Council Councilwoman Ortega?'",
        "'speaker_6': 'Well, I would like to ask probably the applicant, if you could talk about or might be the the tenant what the Good Neighbor agreement entails. Just so we know how issues of parking and traffic, I mean, it sounds like it's the kind of amenity that the neighborhood is looking for.'",
        "'speaker_6': 'And oftentimes when they're really good establishments, it draws in traffic from outside. And I know we've got some of these circumstances in other areas where we have existing buildings that might have a use change that draws more traffic to the neighborhood.'",
        "'speaker_6': 'So can you just speak to how those issues, number one, what they are and then what the solution is?'",
        "'speaker_5': 'Sure. Can. David Burton So two of the issues that came up during the Good Neighborhood Agreement was parking and was smells of the proposed use. We're proposing to do a brewpub in this establishment. So those were really the two issues that neighbors were adamant that we addressed.'",
        "'speaker_5': 'So we went through a few different requirements in that agreement and a few different rounds regarding smells and health department requirements of what may be a toxic or noxious odor. And we kind of came to a resolution that if there's multiple complaints that we would address them and we set up a process and a good neighborhood agreement'",
        "'speaker_5': 'to address them. Parking was also an issue. Fortunately, we are on a corner where right across the street is Jefferson Park and there's on street parking on too long. It's too long streets. In reality, we also agreed with the neighbors that we would provide some offsite parking for tenants for employees of the restaurant.'",
        "'speaker_6': 'Where are you doing that?'",
        "'speaker_5': 'So we have we've have a parking available at a property across 23rd Avenue, across the highway on 23rd Avenue. And I can't remember the exact name of.'",
        "'speaker_6': 'The street from the old Tsingtao Brewery.'",
        "'speaker_5': 'Yes, exactly. Okay. So actually next to the old brewery, not across the street. So in the parking lot that's owned by that building. So we have ten spots that we are planning on leasing for them.'",
        "'speaker_6': 'Did the issue of noise and outdoor music come up is a concern and how is that being dealt with?'",
        "'speaker_5': 'It did in the um x two zone district there are specific requirements for outdoor eating to be closed at a certain time. And it's and it's a fairly early time and that's actually part of the code. And it was really we talked about changing that.'",
        "'speaker_5': 'But they, the neighbors pretty much agreed that the timing that the code said was adequate for establishment. Okay.'",
        "'speaker_6': 'I have one more question, if I may, and this one's for the city attorney. So. If the property changes hands. The conditions that are in place, as I understand, are with the current owner and operator of the property.'",
        "'speaker_6': 'So what would happen to those conditions if the property does change hands? You have any? Not about this.'",
        "'speaker_1': 'You're talking about the conditions attached to the zoning. I'm sorry, david broadwell, assistant city attorney, that the good neighbor agreement.'",
        "'speaker_6': 'Of a good neighbor agreement. It's not as I understand, it's not a condition of the zoning. But if the property changes hands and you've got a different operator that comes in because a lot of times if there's a liquor license, it transfers with the property.'",
        "'speaker_6': 'And, you know, I just want to make sure the conditions.'",
        "'speaker_1': 'Since the since the city is not party to the good neighbor agreement, we haven't had occasion in our office to inspector to be able to answer that question. The answer to that question depends on exactly what got negotiated and whether it's a covenant runs with the land, who knows?'",
        "'speaker_1': 'But I would invite the applicant to answer that question as best I can.'",
        "'speaker_5': 'Sure. So the good neighborhood agreement really is specific for this use on this building. So at a later date, if this tenant goes away and it becomes a a sewing shop or dress shop, which it was before, that good neighborhood agreement is essentially would be renegotiated.'",
        "'speaker_5': 'So the parking per.'",
        "'speaker_6': 'Use stays the same.'",
        "'speaker_5': 'Stays the same.'",
        "'speaker_6': 'The ownership changes.'",
        "'speaker_5': 'Right? The tent, both the tenant and the ownership have signed the agreement with the neighborhood and there is a provision in there to Andrew may be able to answer this a little bit better than I to negotiate or just been negotiated points in that agreement for that parameter.'",
        "'speaker_5': 'So if you do, I'm going to let Andre have.'",
        "'speaker_8': 'Yeah, I think the I think that the issue that you're you're addressing here is covered in the Good Neighbor Agreement, which we did submit. But but the basics are that the as long as the use stays the same, the good neighbor agreement goes with the the use, it'll stay with it regardless of who the owner is.'",
        "'speaker_8': 'And as, as Dave said, it was signed by the tenant as well. So.'",
        "'speaker_6': 'Great. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega and Councilwoman Shepherd.'",
        "'speaker_0': 'Actually, my questions were addressed.'",
        "'speaker_6': 'By Debbie's.'",
        "'speaker_0': 'Questions.'",
        "'speaker_2': 'All right. Thank you, councilwoman. Councilwoman Lemon.'",
        "'speaker_0': 'Mine were.'",
        "'speaker_2': 'Two. Well, there we go. Congratulations. Good job, Councilwoman. I tell you. All right. Do we have any other questions from members of council and seen none. The public hearing on 813 is not closed. Time for comments, Councilwoman Sheppard.'",
        "'speaker_0': 'Thank you, Mr. President. And thank you, everyone, for coming out this evening. The week of Thanksgiving. I know a lot of folks. His thoughts are elsewhere this week. I am definitely in support of this this evening. And I know that there was a bit of consternation and concern when the idea was first introduced, you know, especially with'",
        "'speaker_0': 'some members of the neighborhood in the River Clay Building, particularly, which is immediately adjacent and is one of the nearest residences that will be dealing with the impacts. But, you know, I really want to hand it to the development team for sitting down with the neighbors and hashing out the good neighbor agreement and, you know, working very'",
        "'speaker_0': 'well together to address some of those concerns because the use is a good use, the proposed use is a good use and makes sense.'",
        "'speaker_7': 'Is a good fit.'",
        "'speaker_0': 'For that corner. You know, legitimizes a building that has functioned as a commercial building for over 100 years now and perhaps brings and I think brings a broader a more a use that is able to be enjoyed by more people because certainly not everyone is shopping for a wedding dress.'",
        "'speaker_0': 'So, you know, but there's, you know, definitely a few people out there that would like to enjoy a beer. So I think it adds to the walkability of the neighborhood and, you know, gives us a chance to have a nice local business.'",
        "'speaker_0': 'I live very, very close to this site, so I pass it constantly. I'm familiar with, you know, the issues. And I know I said this to the tenant when we were talking, but, you know, I really would, you know, encourage you to figure out ways to incentivize people to come to the restaurant in a way other than'",
        "'speaker_0': 'a car. You know, and I remember at that time I suggested to you perhaps, you know, a 10% discount if someone is walked or biked, you know, or is a local or something like that. 23rd Avenue is absolutely the busiest, probably the busiest East-West bike corridor in northwest Denver.'",
        "'speaker_0': 'I bike it a lot myself. When I'm at the intersection, you know, at the red light, I say to the bikers next to me, So, hey, where are you from? And I regularly meet people that have bike that are biking from Aurora to gold and back.'",
        "'speaker_0': 'So, you know, there's a lot of opportunities to attract a lot of business there that don't involve people driving to that location. And parking is a big crunch there. This neighborhood is undergoing absolutely the biggest surge of urban infill and redevelopment more than any other neighborhood in northwest Denver.'",
        "'speaker_0': 'So, you know, I would very much appreciate any and all efforts to attract customers to the store in ways that. Don't involve them driving their own car in parking. So just with that little editorial comment, once again, I will say I am in full support and would urge my colleagues to vote yes as well.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Sheppard. Are there any other comments from members of council seen on Madam Secretary? Roll Call.'",
        "'speaker_7': 'Sheppard. I. Susman. I. But I. Can each layman. I. Monteiro. Nevitt. Hi, Ortega. Hi, Rob. Right. Mr. President.'",
        "'speaker_2': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_7': '11 eyes.'",
        "'speaker_2': '11 eyes. 813 has been placed upon final consideration and does pass. There are no prior German announcements other than to wish everyone a very happy Thanksgiving this week and seeing no other business before this body. This meeting is adjourned.'",
        "'speaker_0': 'Denver eight TV. Your city. Your source.'",
        "'speaker_1': 'Denver. Eight on TV and online. Stay connected to your community, your city, your source.'",
        "'speaker_0': 'You are watching Denver. Eight TV's Your City, your source.'"
    ]
}