{
    "Second Amendatory Agreement with Northeast Denver Housing Center for TRUA Program.": [
        "'speaker_0': 'Thank you very much. I'll do a quick recap. Under resolutions, Councilman Ortega has called out Resolution eight, Dash 1528 for a vote under bills for introduction. Councilwoman Kennedy has called out Council Bill 1421 for a comment under Bill's for final consideration.'",
        "'speaker_0': 'No items have been called out and under pending. No items have been called out. Looks like we didn't miss anything. So, Madam Secretary, please put the first item on our screens. And Councilwoman Black. Will you please put Council Resolution 1528 on the floor?'",
        "'speaker_2': 'I move that council resolution. 18 dash 1528 be adopted.'",
        "'speaker_3': 'It has been.'",
        "'speaker_0': 'Move. And seconded questions or comments by members of Council Council one Ortega.'",
        "'speaker_2': 'Thank you, Mr. President. I am on the board of a nonprofit that partners with Northeast Denver housing in administering the trauma program, which is our rental assistance program. So I will be abstaining from tonight's vote. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. See no other comments or questions, Madam Secretary, roll call. Oh, Councilwoman candidate, did you want to get in there before we.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_6': 'Mr. President, I had debated calling this out just for a comment, but since it's called out for a vote, I just think this is a really important program to highlight. So we in the city have had several rental assistance programs in the past, all with federal funding and all for the lowest income families.'",
        "'speaker_6': 'And the rules to qualify were so restrictive that it was very difficult for folks to use. And so when we created the Permanent Housing Fund in 2016, the council talked a lot with the department about the importance of creating a more nimble rental assistance program that could really help people when they were experiencing, for example, a rent'",
        "'speaker_6': 'increase where they would have to move, but they needed a little time or maybe they had one time emergencies. And so I just want to say that this program has now helped just over a thousand people. I believe in the time it's been in effect, and it has been extraordinarily impactful.'",
        "'speaker_6': 'We thought for some families we need it for five and six months. It turned out many only needed one or two months to get through a crisis and be able to stabilize. Whether that was stabilizing where they were or stabilizing until they could get a new place.'",
        "'speaker_6': 'And so, you know, these are kind of routine contracts, but one of the things we always hear in our community is people do not know about the programs that we have in place. So I just wanted to take a minute to talk about if you need help with rental assistance in Denver, you can call three one, one'",
        "'speaker_6': 'and three one. One will get you to the right person to to apply for a temporary rental assistance. And this is not just for the poorest families in our city. It includes moderate income folks, you know, up to, you know, folks that may be preschool teachers or working in retail or working in kitchens.'",
        "'speaker_6': 'So it is for regular folks who are struggling with their rent. We we know about how difficult the housing crisis is. We just heard testimony during our public comments about it. So I'm excited to support this bill and just make sure that we keep talking about it with our residents so they know that it's out there.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each. Councilman Brooks?'",
        "'speaker_7': 'Yep. I'm just putting another point, a fine point on my colleague, Councilman Canete and Councilman Kenny's. Thank you for explaining the details of it. But I want to be very explicit and say that we are hearing all over Denver that folks want help now.'",
        "'speaker_7': 'They want help when they're in their housing crisis. And this exact bill does that. This helps people in and in some of the mosques. And I appreciate you, Councilman Kenneth, for saying a thousand folks. You know, it's affecting people.'",
        "'speaker_7': 'When people begin calling your office and tell you how it has allowed them to stay in their homes and stay competitive in their jobs as well. And so I just want to I want to thank the council for approving this.'",
        "'speaker_7': 'I want to thank the administration for allowing us to be nimble and help for these folks that are struggling from month to month to stay in their homes and be competitive in our city because people want to be in our city.'",
        "'speaker_7': 'And so thank you so much, members of council, for making this a priority.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilman Lopez.'",
        "'speaker_5': 'I just wanted to call out a. A bill when you get the chance. Okay. My computer is rebooting.'",
        "'speaker_0': 'While we get through this one and then I'll circle back. Okay. All right. So see no other comments or questions on this one. Madam Secretary. Roll call.'",
        "'speaker_2': 'Ortega abstain. Black Eye.'",
        "'speaker_3': 'Brooks, I.'",
        "'speaker_4': 'Espinosa, I.'",
        "'speaker_3': 'Flynn, I.'",
        "'speaker_4': 'Gilmore.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Herndon, i.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_4': 'I can each.'",
        "'speaker_2': 'Lopez.'",
        "'speaker_4': 'I knew Susman. I Mr. President.'",
        "'speaker_0': 'I am secretary. Please close the voting and note the results.'",
        "'speaker_4': '12 Eyes, one abstention.'"
    ],
    "Agreement with Community College of Denver for WORKNOW Program.": [
        "'speaker_0': '12 eyes, one abstention. Council Resolution 1528 has been adopted. Guzman-Lopez okay, if we go to Councilwoman Kennedy for a comment and then I'll come to you for the bill you want.'",
        "'speaker_5': 'Yes, the bill. Okay.'",
        "'speaker_0': 'So, Madam Secretary, please put the next item on our screens. Councilwoman, can you go ahead with your comment?'",
        "'speaker_6': 'Thank you so much, Mr. President. One more good news, bill today, which is a contribution from the city and county of Denver to the Work Now program. And this is a program that really came from a very robust set of community conversations, probably going back at least three years now as big construction projects were coming to Northeast'",
        "'speaker_6': 'Denver in particular. A number of residents came forward and said that it was really important for them to have local hiring in some of these big construction projects being done by the state or the city. And the real desire was not just to require that local residents could work on these projects, but that we have a much'",
        "'speaker_6': 'better way of connecting folks to those jobs. It's one thing to require to hire locally. It's another thing to have a place that screens folks, refers them to the employers and gets them ready to go. And we have a hard working team here within the city, but I think the realization from the community was that it was'",
        "'speaker_6': 'important that we really have this live outside the city so that it could serve all different projects, maybe state projects, maybe private industry projects. And so what came from that project was this work now collaborative that really brought together construction companies and associations and community members, and they have had huge success.'",
        "'speaker_6': 'My colleague, Councilwoman Ortega, spent a lot of time in the early phases of thinking about this partnership as well. And I think she's going to I asked if she could do the numbers because she's got the numbers in front of her.'",
        "'speaker_6': 'And I don't. But I just this is a big investment from our city. It's a half million dollars. And it's something that I think really has been a dream from the community for a long time. We had a recession the last time we got close to doing this kind of construction hiring.'",
        "'speaker_6': 'And all of a sudden there were a lot of out of work construction workers. So we stopped training. And that brought us to today where we have an aging construction workforce and a shortage. So in some ways, I feel like this contract, as small as it seems, that a half million dollars is kind of like a ten'",
        "'speaker_6': 'year in the making vision of how to really train workers on the big projects that we build. So I just want to thank the Community College of Denver for allowing their team to be so active in the community.'",
        "'speaker_6': 'And with government working on something like this, it's really out of the box. It's not a classroom project and I love that our community college was so willing to do this. And to Katrina word in particular, who really brought this vision to a reality.'",
        "'speaker_6': 'So and I'll I'll just, you know, with enthusiasm, it's on consent. We're not going to pull it out. But I'm really excited to see this bill moving forward.'",
        "'speaker_0': 'Thank you. Thank you. Councilwoman Quinn. Each Councilman Ortega.'",
        "'speaker_2': 'Thank you, Mr. President. So to all of what Councilwoman Canete just said, I want to say ditto, but I want to acknowledge Marcus, who is in the audience tonight, who has been working diligently on this project since he got here to his work with the city, as well as Tony, his his cohort at OED, who has helped'",
        "'speaker_2': 'sit down with us through many meetings to make sure that we actually had language in our office, language in the contracts that is now setting goals for hiring for apprentices, making sure that we are training people in these livable wage jobs that has a career path and exciting to learn.'",
        "'speaker_2': 'A presentation was given to us last week at our Business Committee talking about how many people are in this pipeline right now, and the numbers keep growing as we all keep talking about it and advertising this program. But we have over 700 people right now in this work now program, various stages.'",
        "'speaker_2': 'So we've got some that are working with some of our pre-employment organizations to get people job ready. We have a number of people that are in the apprenticeship programs before they're ready to go work on the job site.'",
        "'speaker_2': 'And we have a number of them that are also working on the job sites. And, you know, the beauty of this is that it's creating our trained workforce that will be here in place for the many bond projects that we have that will be built out over a period of time.'",
        "'speaker_2': 'We have seen a number of applications that have come forward before this body from the River Rail Ilitch site to the Denver Bronco parking lot. I could go on and on. Testing them, but those create potential opportunities as well that will ensure that these very workers who are getting trained will have a pipeline of job opportunities for'",
        "'speaker_2': 'them to plug into. So again, I want to echo praises for Katrina work and the folks at Community College of Denver who really stood up this Work Now program that is not only being used on the I-70 project, but it's being used at National Western.'",
        "'speaker_2': 'We were going to be utilizing it on the Convention Center and all the other big fun projects. So I just want to say thanks to our team within the city for really the dedication and commitment and the the ironic part about all of this is this is a program that the city had done historically.'",
        "'speaker_2': 'But, you know, over time we saw a decline in in construction projects in our city. And as we're ramping up with well in excess of $6 billion worth of construction projects, it's important that we create the opportunity for other people in our community to benefit from the not only the construction projects, but the wealth that's being built'"
    ],
    "Resolution to Establish a Public Alley in Council District 3.": [
        "'speaker_2': 'around our community that needs to trickle down to our communities as well. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Ortega, see no other comments on that one. We're going to move on. Councilman Lopez, what would you like to call it was.'",
        "'speaker_5': 'Resolution 37. So, yes, 2019.'",
        "'speaker_0': 'Just a just for a comment. Madam Secretary, you already have that one. Go ahead.'",
        "'speaker_5': 'So this may just seem like a simple dedication of of land. Right away, we see hundreds of these things fly by, but change is inch by inch. And sometimes it's taken 25 years to do this particular alley wasn't even an alley.'",
        "'speaker_5': 'It was space that should be an alley in between federal and grow from Mississippi to Tennessee. And it was in the worst blighted condition that you can ever find a piece of property. It was muddy. There was all kinds of shady things happening back there.'",
        "'speaker_5': 'There was no lighting right behind the Little Saigon business district out here on South Federal Boulevard about I think it was November 1st week in November. We had a council meeting in 2013 and I was very critical that we were extending urban renewal monies and.'",
        "'speaker_5': 'And not doing it in an equitable way and really questioning what we really considered blight. And I brought that up, had a protest vote on it. And here is the result we were able to get. And then this, not just this, this, but this is like it's been an eyesore for such a long time and has really'",
        "'speaker_5': 'been a drain on that neighborhood for such a long time, especially those those business owners and Little Saigon business district. We were able to not only acquire through urban renewal funds that folks had paid for for almost a decade and a half into, we were able to acquire this land right be right behind these businesses.'",
        "'speaker_5': 'We were able to create an easement. We paved the alley with concrete. We undergrounding the utilities. We were able to create a safe lighted passage through that. Now you just drive through. You just think it's not that bad of an alley.'",
        "'speaker_5': 'It's just an alley. Right. But it's things like this. I wanted to point this out and I wanted to thank Adriano and my staff, the business owners on South Federal Boulevard and also like on business district door folks in the city to really identify this as a as indeed blight and address it.'",
        "'speaker_5': 'And so if you like I said, we drive through there now it's just a regular alley, but we are officially dedicating it an alley, a public ride away tonight. And I, I wanted to highlight that because not all this stuff happens automatically, ladies and gentlemen, it takes pushing.'",
        "'speaker_5': 'It takes a lot of hard work. And and it's moving an entire bureaucracy to get something like an alley done. There's a couple of others on there. But as you see these alleys come through, it's been a lot of work and a lot of just a lot of just city work, getting it done, a lot of advocacy'",
        "'speaker_5': '. So I wanted us to celebrate that.'",
        "'speaker_0': 'Thank you, Councilman Lopez. All right. That concludes our the items to be called out. All bills for introduction are ordered published and we are now ready for the black vote on resolutions and bills on final consideration. Council members remember that this is a consent or block vote and you will need to vote.'"
    ],
    "Zoning Change for Property at Central Park Boulevard, Stapleton.": [
        "'speaker_0': 'Council is reconvened. We have two hearings this evening. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses. If you're here to answer questions only when your name is called, please come to the podium, state your name and note that you are available'",
        "'speaker_0': 'for questions of council. Speakers will have 3 minutes. There is no yielding of time on the presentation monitor. On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members.'",
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Council Work. Will you please put Council Bill 1482 on the floor?'",
        "'speaker_2': 'Yes, I will move that council bill 18 Dash 1480 to be placed upon final consideration and do passed.'",
        "'speaker_0': 'It has been moved and second in the public hearing for council bill 1482 is open. May we have.'",
        "'speaker_3': 'The staff report?'",
        "'speaker_9': 'Good evening, Teresa Lucero with community planning and development. I can get this open. We can get started. So this is an official map amendment. It is a rezoning of 46, 50 and 46, 98 Central Park Boulevard. The request is to go for a master planned industrial mixed use eight storeys to campus hospital.'",
        "'speaker_9': 'The property is located in City Council District eight in the Stapleton neighborhood, and this just gives you an overview of the area. The request is for about four acres, 183,000 square feet. Currently vacant property. Again, the request is to rezone from master plan context industrial mixed use a stories to campus hospital to redevelop the property for a'",
        "'speaker_9': 'rehabilitation center. So subject zoning again industrial mixed use eight storey surrounding properties industrial mixed use eight stories to the east and west north is industrial mixed use five stories and then 12 stories to the south. Industrial mixed use.'",
        "'speaker_9': 'Again, subject property is vacant to the east and north is also vacant. South is an office building and west is a hotel or commercial use. This gives you an idea of these surrounding properties a lot of vacant properties, a hotel and an office.'",
        "'speaker_9': 'The campus is own district. One thing I forgot to say earlier is that the proposal is because the hospital use is not allowed in other zoned districts except the campus hospitals own district. That's part of why this is a requested rezoning.'",
        "'speaker_9': 'But the campus context is for those institutional uses medical, educational, entertainment, large, usually large sites. But again, that medical use is only allowed in c mph. There is a it would be a general primary building form and this is just intended to promote maintenance and concentration of health care facilities.'",
        "'speaker_9': 'So the process, initial information I notice went out in August of last year. Planning Board was duly posted in at their hearing on December 5th, unanimously voted to recommend approval of this application. Ludie heard this item on December 18th of last year and of course you're here tonight and this hearing has been noticed as well.'",
        "'speaker_9': 'So there are several are in OWS. We have had no comment from an R.A. or general public on this application. So, you know, the criteria, the plans that apply are current plan 2000, Blueprint 2002 and the Stapleton Development Plan of 1995.'",
        "'speaker_9': 'Current plan as detailed in your staff report. Staff believes that this application conforms with environmental sustainability strategies, land use strategies, legacy strategies and some of the neighborhood strategies talking about the location of facilities, particularly medical facilities in our neighborhoods.'",
        "'speaker_9': 'So Blueprint Denver This isn't within an area of change and this is where, of course we want to channel growth. And it is a blueprint land use concept of employment where we want these types of uses and very few residential uses and some of our institutional uses and commercial uses to go into these areas.'",
        "'speaker_9': 'The Stapleton Development Plan of 1995 calls for this area. It's in districts six and seven in the Stapleton Land Use Plan and calls for this area to be residential and employment and oriented to 49th 47th Avenues near I-70 and should be where there's business, retail and services for the northern portion of the Stapleton area and close, of'",
        "'speaker_9': 'course, to the transportation calls for improvements of the major highways in the area and of course, to the Stapleton way of developing integrating parks and drainage and natural areas into the community. And then there should be, of course, special sites for institutional and corporate uses according to the plan.'",
        "'speaker_9': 'So staff believes that the criteria is met, that this is consistent with the adopted plans, with the standard zone district, the campus zone district that we are implementing, the Stapleton Development Plan, as well as as we're developing this complete community in Stapleton.'",
        "'speaker_9': 'And the justifying circumstances are changed conditions as our former airport redeveloped. And then of course, the consistency with the intent of providing a place for these institutional uses in our campuses and promoting the maintenance and concentration of our health care facilities.'",
        "'speaker_9': 'There is also a Stapleton GDP. This site is within an area called office. However, there is text that you may find by text within the GDP. Speaking specifically to Central Park Boulevard, saying a variety of land uses are appropriate for the Central Park Boulevard Corridor.'",
        "'speaker_9': 'Institutional employment and commercial uses are especially encouraged along this corridor south of 49th Avenue, as they will easily be accessible to transit services and Central Park Boulevard. With that, staff recommends approval of this application.'",
        "'speaker_0': 'Thank you very much. We have five individuals signed up to speak this evening. I would ask that if you're signed up to speak this evening, that you come up to the front bench. When I call your name, your time will start.'",
        "'speaker_0': 'I want to make sure that you get all of your time at the microphone. First up is Jeffrey Jones.'",
        "'speaker_8': 'My name is Jeffrey Jones. I live at nine Bretton Woods, Dallas, Texas. I'm here to answer any of your questions regarding this project or the rezoning.'",
        "'speaker_0': 'Thank you very much. Next up, Mariana Thompson.'",
        "'speaker_2': 'Console people. I did not see anything there that said subsidized housing or attainable housing. So, you know, until that comes on the table. No. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jerry Burton.'",
        "'speaker_8': 'Well, I'm always happy for progress. But the number one thing. Yes, you're building more apartments. But I must ask you this question. Who are you building them for? The point is, we need to be building more apartment for the bottom, bottom third of our society.'",
        "'speaker_8': '0 to 30% is what we need. And I would really love to see either one of these places to be designed for that. You know, we all got to get along here. We all we got number one country.'",
        "'speaker_8': 'It's not like I get up and move and go stay on the moon, which I probably could do if I if I really wanted to get away from the heartless people. But we've got to look out for each other.'",
        "'speaker_8': 'We got one. We got one world. We got to share it. We got to be together in all of this, you know? And right now, we you know, we are all in crisis. I'm for it. We are all in crisis for there.'",
        "'speaker_8': 'But we need to be thinking about the bottom one third of society, the one that is on fixed income right now, the one that working a minimum wage job or someone like me that is homeless, that I will be sleeping outside again tonight in protest, as always.'",
        "'speaker_8': 'But we got we got to be all inclusive. We can be about the top two third of society. It take all of us to be one society, and that includes one third. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_10': 'Jesse Pearce. Represent for Denver homicidal Black Star Action Movement for self-defense and positive, active commitment for social change. And I'm also an at large candidate for 2019. I am against this based off the grounds that we have a crisis in this town.'",
        "'speaker_10': 'And to say that you are prioritizing health camp is opposed to an encampment, tiny home village sites, actual affordable, attainable housing site. It's just very misfortunate to see and hear that this takes precedence over all of that. So, yeah, we're definitely against this.'",
        "'speaker_10': 'The city really needs to get its priorities straight on who it actually wants to help and service and actually live in this town. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_8': 'Yes, Chairman Seiko. Founder Black's lyrics and movement self-defense and the next mayor of the city county of Denver. It. Appears. On the surface that. This is something that is needed for this community in order to consolidate and find a place central where the residents can get the health care that they need in an area where they don't'",
        "'speaker_8': 'have to go helter skelter and all over the place to get services. And that's a good thing. That's a good thing. And yet. What concerns me. This as we continually eat up the land resources in this town. At what point are we going to run out of land so that you can't do the things you need to'",
        "'speaker_8': 'do for the increasing population that's coming? It's a. And what this really represents. Growing up in this town, you have two different communities having to write their own food back in their stable to know it. That Stapleton area was primarily developed for white settlers coming into the neighborhood during gentrification.'",
        "'speaker_8': 'And when you look at how the services were provided west. Of Central Park. You see dilapidated buildings. Eminent domain. One, two, three, ABC. And yet it becomes more dire about when you see the plan that as you remove one population ethnic group and bring in another.'",
        "'speaker_8': 'All of a sudden, this is a booming area. But when you had those existing folks who had been here for years, it wasn't considered worthy of the attention of the city for development, to have them have anything. And a good example of the just shopping center stable.'",
        "'speaker_8': 'You don't have one not one business in that whole thing that's black owned or leased. Imagine that. Yet. Right across the street is Woodlawn Black Community. This is done by a black man. Yeah. Now. So listen. I know you guys are going to go for this.'",
        "'speaker_8': 'Because the criteria is consistent. The orientation of city council is to remain in the lap of the mayor. So the no one's consequence and then I know you guys are going to do that. They call you vote for my job of yours.'",
        "'speaker_8': 'Would I agree with it or not?'",
        "'speaker_0': 'I'm sorry, but your time is up. Thank you. That concludes our speakers. Are there any questions from members of Council on this item? Councilman Espinosa.'",
        "'speaker_3': 'Now, one quick question. I think it's for CPD. Is the is this is development on this side of Central Park subject to Stapleton Design Review? Yes.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'All right. Any other questions on this item?'",
        "'speaker_3': 'Councilman hundred. Yes. Mr. Perez, just one question and quick question for the applicant. If you could briefly describe where we're focusing on the criteria before us. But since there are no other speakers, just want to ask one question for my colleagues questions of my better understanding from my colleagues what the use will be for this site should'",
        "'speaker_3': 'the rezoning go through.'",
        "'speaker_8': 'This is an acute care rehabilitation hospital, so it's after you go to an acute care hospital. Any of them in in the entire city, when they're when they're ready to leave the hospital, but they're not ready to go home.'",
        "'speaker_8': 'And the average stay in our hospital is around 13 or 14 days. Some people are there for 30 days. This is not a drug rehab. It's a physical rehab speech and occupational rehabilitation hospital.'",
        "'speaker_3': 'Perfect. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Herndon, Councilman Espinosa.'",
        "'speaker_3': 'I'm just curious for the applicant. Based on what you just said, described as the use. We have done a really you know, from the get go, Stapleton has been designed with affordable housing as a crucial component. I've developed some of the affordable housing in the neighborhood and it reaches some fairly low income levels as well as veterans'",
        "'speaker_3': '. How do you guys have any programs to administer to households with low income, low incomes or no insurance approximate?'",
        "'speaker_8': 'Well, I would say about 90% of our patients are 65 or 70 and older, up to 100 years old. So Medicare is taking care of about 70 or 80% of of the cost of this service. So in commercial insurance takes care of the balance.'",
        "'speaker_3': 'Are any of your programs subject to Medicaid insurances?'",
        "'speaker_8': 'No. No. This is not a classification. This is not a skilled nursing or nursing home. We we usually have one or two patients during a month where we're bringing them in. They may not qualify for one of those, but we bring them in as an accommodation.'",
        "'speaker_8': 'But it's under strict Medicare guidelines.'",
        "'speaker_3': 'I think we I think we may have done this near 29th, but that was so long ago. Do you know in your analysis of the market, is there maybe not a need today, but will there be a need for that level of care?'",
        "'speaker_3': 'I mean, care at that level to retain a complete community out there.'",
        "'speaker_8': 'We think there's a need today. The the closest rehabilitation hospital in that part of Denver is one in Aurora that's approximately 40 years old. One of the neighborhood association members actually told me that she had to go to a rehabilitation hospital in the last year or two.'",
        "'speaker_8': 'And the only hospital she could get into was near Porter Hospital, and she lives in Montebello, which is probably for her family. She said it was quite a burden even driving down there. But there's there's really not a hospital rehabilitation hospital near there other than maybe downtown.'",
        "'speaker_8': 'In Aurora.'",
        "'speaker_3': 'And just for again, for our information going forward. Is there benefit for you? Got any are you better off having sort of your zone lot being sort of an island or are you better off if there are some companion medical uses in the vicinity?'",
        "'speaker_8': 'Well, we have we are zoning the entire block for medical campus so we can accommodate one or two other uses on that block in addition to our hospital.'",
        "'speaker_3': 'Right. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa, seeing no other question. The public hearing for Council Bill 1482 is closed. Are there comments by members of council? Councilman Herndon.'",
        "'speaker_3': 'Thank you, Mr. President. I. I appreciate the questions about this. This is very clear. We're focused on the criteria. I think the criteria has been met. So this is something I will be supporting. But I will just take a moment to say I'm excited that this will be a youth that's in need.'",
        "'speaker_3': 'There's a huge senior population and far northeast. And as it was just stated, the ability that you have to travel so far for acute care, that this is a this is a gap that we will fill. So I'm excited about that.'",
        "'speaker_3': 'And you've got seniors beyond Stapleton in Montebello, in Northeast Park Hill. So I'm excited to see this coming. And I did just want to make a correction. Intersections Restaurant and Northfield Boulevard is a black owned business. Anyone want to come out and have breakfast with me?'",
        "'speaker_3': 'I'm happy to eat with you there. And I featured them in my newsletter and I encourage my colleagues to support this. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Seeing no other comments, I just thank staff for the hard work on this and the great staff report. I think it's clear that the criteria have been met and happy to support it. Madam Secretary, roll call on Council Bill 1482.'",
        "'speaker_3': 'Herndon, i.'",
        "'speaker_2': 'Black i. Brooks.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Espinosa, i. Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Gilmore.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_4': 'Can each. Lopez. I knew Ortega.'",
        "'speaker_2': 'I Sussman. Hi.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please. Because the voting and the results.'",
        "'speaker_4': '12 eyes.'"
    ],
    "Zoning Change for 2625 Walnut Street in Five Points.": [
        "'speaker_0': '12 eyes. Comfortable. 1482 has passed. Councilwoman, back where you please. What? Council bill 1483 on the floor.'",
        "'speaker_2': 'Yes, I move that council bill 18 1483 that would be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 1483 is open. May we have the staff report?'",
        "'speaker_6': 'Yes. Thank you. Good evening. I'm Courtney Livingston with Community Planning and Development. This is a request to rezone a single property at 2625 Walnut Street from residential and mixed use. 20. That's a former Chapter 59 zoning district. That's with Weavers to IMAX three.'",
        "'speaker_6': 'Design Overlay seven. This property is in Council District nine in the Five Points neighborhood. The site is approximately 9394 square feet in size and has a two story brick warehouse style building which is currently vacant. The owner of the subject property also owns the abutting building to the northeast and would like to rezone the subject property to'",
        "'speaker_6': 'match the properties around it and to allow for an office use. So as previously mentioned, the site is zoned Army 20 with waivers. This is a mixed use district and it has a former Chapter 59 waiver requiring 10,000 square feet of office only.'",
        "'speaker_6': 'The subject property has about 22,000 square feet total, and the subject property is primarily surrounded by IMAX three. You have to dial seven. There are some CMU 20 with waivers also surrounding it. Cmcsa 50207 surrounding it and you have a p you d also in there.'",
        "'speaker_6': 'The site is contributing a structure in the ballpark neighborhood historic district. Any alterations to the existing building would need to go before LPC and a certificate of appropriateness would need to be issued. So the subject property is currently vacant.'",
        "'speaker_6': 'It was formerly occupied by an industrial use. It is generally surrounded by a mix of commercial, industrial and residential. These are a few photos of the subject's site. The top point is showing the subject property as well as the property to the northeast.'",
        "'speaker_6': 'In the bottom one is showing the subject property. These are also photos of the surrounding properties in the area. In terms of process. The Map amendment application went before the planning board and there was a unanimous vote recommending approval with registered neighborhood organizations.'",
        "'speaker_6': 'These are the RINO's that were notified. There was no public comment received from the general public. The R.A., the Rhino Arts District, commented that they had no issues with this request at all. As you know, to do to adapt to rezoning.'",
        "'speaker_6': 'There are criteria that must be met. We'll step through each one. Consistency with adopted plans. There are three adopted plans that are applicable to this rezoning the Comprehensive Plan Blueprint, Denver 2002 and the Northeast Downtown Neighborhood Plan of 2011.'",
        "'speaker_6': 'With the comprehensive plan. The the MAP amendment is consistent with several strategies and it furthers those strategies for compact mixed use. With Blueprint Denver, the site has a concept plan use of mixed use, and these areas Blueprint characterizes them by a mix of employment and housing with residential and nonresidential uses within walking distance of one another.'",
        "'speaker_6': 'The proposed rezoning, consistent with blueprints concept plan uses, allows for a mix of industrial, commercial and residential uses to develop in a pedestrian oriented pattern with buildings up to the street and an active street level. Blueprint Denver also identifies this as an area of change.'",
        "'speaker_6': 'The guidance for these areas is to channel growth and to these areas where it can be beneficial and improve access to jobs. The proposed rezoning is consistent with the area of change intent of the law for reinvestment and reuse and industrial mixed use zoning, creating access to jobs in an appropriate location with also those enhanced design standards'",
        "'speaker_6': '. It's located Walnut is a residential collector street. Collectors are providing a greater balance and would support the mixed use development along a collector street and with the northeast downtown neighborhood plan. The future land use is shown here as mixed use industrial, noting that warehouse forms are compatible with residential housing types.'",
        "'speaker_6': 'The proposed I am x three design overlay seven district is consistent with the plan's vision for the area, allowing a walkable mix of compatible uses. It. Also, the northeast downtown neighborhood plan talks about hype and recommends a maximum of five stories in the area for the stay at three stories.'",
        "'speaker_6': 'This is well under the maximum allowed and therefore is consistent with the plans recommendations. And then we have the applicability of the rhino design overlay deal of seven. It's consistent with the goals and objectives of the Northeast. Downtown Neighborhoods Plan to promote high quality design in the Reno Business Improvement District, where there is a base zone district'",
        "'speaker_6': 'of mixed use. The building form standards of this design overlay ensure that the development implements this northeast downtown neighborhoods plan. The goals and objectives for walkability and design. So staff finds that the requesting zoning meets next correct to criteria the uniformity of district regulations as it results in a uniform application of the requested zone district and overlay'",
        "'speaker_6': '. And it will further public health, safety and welfare, enabling more walkable mixed use district and the in-depth implementation of adopted plans. In terms of justifying circumstances. The former Chapter 59 Zone District of Army 20 with waivers was put in place in 2004.'",
        "'speaker_6': 'Since then, the Denver zoning code has been adopted. That in itself is justification for the change, as we're going from former Chapter 59 into the new code. And then finally, consistency with neighborhood context, zone, district purpose and intent.'",
        "'speaker_6': 'It's consistent with the industrial context to strip description that exist in the surrounding area. As the context transitions from industrial mixed use with an I'm X three, D or seven, it's also consistent with that purpose intent there as it promotes vibrant pedestrian street frontages with active uses and existing mix of industrial residential commercial uses that characterize the'",
        "'speaker_6': 'site and the surrounding area. With that said, CPD recommends approval based on finding that all applicable review criteria have been met. Thank you.'",
        "'speaker_0': 'Thank you very much. We have four individuals signed up to speak this evening. If you have signed up for this item, I would ask that you come to the front bench to be ready when your name is called to step up to the podium.'",
        "'speaker_0': 'First up, we have Jerry Burton.'",
        "'speaker_3': 'I'll get both of you to react.'",
        "'speaker_0': 'Because I know. I'm sorry. You're going to have to. All right. Next up, we have Mariana Thompson.'",
        "'speaker_2': 'Ladies and gentlemen, you have heard from the previous bill, all of us activists, we see people dying on the streets. When are we going to turn around and take responsibility and quit adding to this problem when gentrification. And affordability.'",
        "'speaker_2': 'Someone's life. It's been. Taken. There are currently right now 23,000 children.'",
        "'speaker_0': 'I'm sorry, but I have to ask you for this hearing to speak specifically to this bill. Thank you.'",
        "'speaker_2': 'Okay. The answer is no.'",
        "'speaker_0': 'Thank you. Next up, Chairman say.'",
        "'speaker_8': 'German. So cool, right?'",
        "'speaker_1': 'Hmm. Hmm. Hmm hmm.'",
        "'speaker_8': 'I dare you to pass this bill. You are now setting up the ground square where poor people have absolutely nothing to lose in this city by engaging in activity to stop all of this. Pass it? I do. Because you're going to be adding to the pain.'",
        "'speaker_8': 'You're going to be adding more to the problem. And you keep blowing into this balloon till it busts. And then what you gonna do? But you can't do so because Dr. King told us that you appeal to the conscience of people to see if they would change.'",
        "'speaker_8': 'But Stokely Carmichael said, you can't appeal to the conscience of people who ain't got no conscience.'",
        "'speaker_0': 'Again, if you could speak directly to the.'",
        "'speaker_8': 'Bill, please. So when we look at this unconscionable move to rezone rezoning, rezoning reason and then eliminate the population because there's no more land left. I would tell you right now, we ain't going nowhere. Homeless or not, we are not going.'",
        "'speaker_8': 'And we refuse to not stand up for our right to be included in this town. And so if this not good for us. It is not good for nobody. And we're sick and tired of being sick and tired.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_10': 'Jesse Pierce, representing four Black Star Acts. A Moment for Self-defense. Denver Holmes So loud and positive a commitment for social change. And I am also an at large candidate for Denver City Council, where a large election is May 7th in regards to this bill.'",
        "'speaker_10': 'We are definitely against this. It seems that the city has continues to miss priority. It's the priorities for this. The community wants for the city. We have a crisis. You want to build an office building that's going to employ who the are already neighbors that's being displaced and told to move along or to gentrify and transplants that'",
        "'speaker_10': 'you are seeming to similarly paved the way for. If this growing growth in developments, the people are being left behind. The people that built this city are being left behind, just like the people that built this country are being left behind.'",
        "'speaker_10': 'And it seems that you guys have no stop in progress with it. So we are definitely against this. So we need to sweep the council like they sweep the homeless every night. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of Council Councilman Brooks?'",
        "'speaker_7': 'Thank you, Mr. President. Just a quick question for you. Tell me your name. Mia. I'm sorry.'",
        "'speaker_6': 'Oh, Kourtney.'",
        "'speaker_7': 'Kourtney. All right, so I noticed that this is going back to the IMAX, which is the context around it. Can you tell me just zooming out a little bit, what is the max height for IMAX citywide?'",
        "'speaker_6': 'IMAX three is. That's three stories.'",
        "'speaker_7': 'Yeah, three. That's for this location. But we were engaged in a dialog in Blueprint to try and get it to IMAX eight, IMAX five and other zone districts. And I just wanted to find out where that was in the community planning and development conversation.'",
        "'speaker_6': 'So I guess maybe I'm not I'm not sure I'm fully understanding the question because, you know, you have I'm x33 stories. I'm x five at five stories. I am. So you have progressive. Yeah.'",
        "'speaker_7': 'So is that acceptable in the the reason I'm asking this question in this area, we've been and I'm pleased to see that this is AMC's it's coming back to the IMAX in the context. But in this area there are different height limits that are allowing for higher.'",
        "'speaker_7': 'And I'm just asking is it still acceptable for IMAX eight in another context, do we have that in another zone district?'",
        "'speaker_6': 'Um, so the I think we do have it. However, we have to look at the the neighborhood plan for guidance. Yeah.'",
        "'speaker_7': 'There's is a conversation that many neighbors in this area are wanting because there's been some restrictions from CPD because there are certain capital markets bankers who are not lending into IMAX zone districts. It's been an issue. And so this has been an issue we've been talking about for five years.'",
        "'speaker_7': 'And I'm just sort of wanted to see where CPD was on it. Is the developer here so we can find out what will actually help? Come on. So what? What are you actually planning for this?'",
        "'speaker_3': 'My name is Lisa Thomas, Lakewood, Colorado, representing the developer who's a developer. I forget the entity, but the proposed uses to convert the existing building to office space. So nothing structurally would change. It's just interior renovation.'",
        "'speaker_7': 'You forget the entity that you're representing? Yes. Okay. What kind of office?'",
        "'speaker_3': 'That it cannot speak to general office space.'",
        "'speaker_7': 'Okay. So so you, you know, as the applicant in front of us, you just want it to. Why are you getting this zone? Change that.'",
        "'speaker_3': 'Because the current zoning does not allow for more than 10,000 square feet of office. The existing building is more than 10,000 square feet. Current zoning also requires ten onsite parking stalls to be provided.'",
        "'speaker_7': 'The current.'",
        "'speaker_3': 'Use. The current use is the arm. Now the U.S. use its vacant building.'",
        "'speaker_7': 'It's a vacant building. And you guys are coming in to develop it here. When will that be?'",
        "'speaker_3': 'But we need to get the zoning approved the first step, and then we'd move forward with the entitlement process and permitting. Okay. All right.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_2': 'Thank you, Mr. President. One of my questions was asked by Councilman Brooks about what the building is being used for right now. So we're understanding that it's vacant. I wanted to ask Courtney if this building was at all looked at as a contributing building.'",
        "'speaker_2': 'By any chance, did Landmark take a look at it? And what was the the status of that?'",
        "'speaker_6': 'Yes, this property is in the ballpark, historic district. It is a contributing structure in that historic district. It's been before a landmark multiple times. They still need to be issued a certificate of appropriateness to move forward. It's my understanding, and correct me if I'm wrong, that it's not necessarily a demolition of the building, but an adaptive reuse'",
        "'speaker_6': '. So if they want to change the the window, the fenestration at all, the the opening the door, anything they need to go through landmark to make sure that the changes are compatible because it is a contributing resource to that historic district.'",
        "'speaker_2': 'Okay. So the DOE seven overlay really does not apply unless the applicant or the owner if that changes were to attempt to demolish and build something else. Right. So really, we're just talking about the base zoning.'",
        "'speaker_6': 'That's correct.'",
        "'speaker_2': 'Okay. So that's all I have. So it's just going to be office use and we don't know what type yet. Right. Okay. I guess that's those are all the questions I have. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega. Councilman Espinosa.'",
        "'speaker_3': 'Hey, you answered it, but maybe I want it sort of more plain speak. I just want to confirm that the the fact that the structure is contributing basically trumps any requirement from the DOE seven. Is that understood?'",
        "'speaker_6': 'Right. It's an existing building. And so, you know, essentially these DOE seven requirements are for a new construction.'",
        "'speaker_3': 'Okay, great. That's it. Thank.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. Seeing no other questions. The public hearing for Constable 1483 is closed. Are there comments by members of Council Councilman Brooks?'",
        "'speaker_7': 'Yeah. I mean, this is, you know, given our criteria, this is in line with it. Every other building zone district around this is an IMAX three. I want to tell the applicant, you need to know who you're representing.'",
        "'speaker_7': 'You want to you know, this is it's a big deal to come before city council, so you want to make sure you're prepared. And I would ask that before you come, the permits that you come in, make sure you tell us as the council representative what kind of office you're doing.'",
        "'speaker_7': 'That would be very helpful. I want to say to CPD that I'm pleased to see the industrial mixed use. I think I want to see more of it. You know, I know that we respond to what the applicants tell us, but to keep manufacturing opportunities in our city, I think is very important.'",
        "'speaker_7': 'And I also think that it's important that we add kind of that mixed use component. We've yet to see before this council, before the city, you know, mixed use, light industrial, having the ability for workforce housing in there.'",
        "'speaker_7': 'I mean, there are a lot of other cities that is that is kind of leading in that we've yet to see that. And so that's something that we really want to see. What I've heard from people who try and do that is that there's many difficulties with the city, there's many difficulties with getting loans to perform that'",
        "'speaker_7': '. And so I love to look into that further. So this is something that that I'll be interested in seeing, especially in my district where there's a lot of industrial being resolved into C-Max commercial space and we're losing much of our industrial zone districts.'",
        "'speaker_7': 'So I'll be supporting this because of the criteria is met and. That's it.'",
        "'speaker_0': 'Thank you. Councilman Brooks, seeing no other comments. I just think thank you. Big thank you to staff for all of the hard work on this and for all the information put forward in the staff report. And tonight, I think it's you've made it clear that this meets the criteria.'",
        "'speaker_0': 'And I will also echo Councilman Brooks sentiment about it's good it's really good to see some IMAX zoning coming through. So with that, I will be supporting this. And Madam Secretary, roll call on Council Bill 1483.'",
        "'speaker_2': 'Brooks Black, Espinosa Flynn, I.'",
        "'speaker_3': 'Gilmore, I, Herndon, I.'",
        "'speaker_4': 'Cashman Can eat. Lopez. All right.'",
        "'speaker_2': 'Ortega, I assessment.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'I am secretary, please. Because voting in the results.'",
        "'speaker_4': '12 Eyes.'",
        "'speaker_0': '12 Eyes Counts. Bill 1483 has passed. On Monday, February 11th, 2019, Council will hold a quiet public hearing on Council Bill eight 1539, designating 5001 packing house road to the armor and company administration building as a structure for preservation and a required public hearing on Council Bill eight 1542 designating 637 Galloping Street the Samsonite House as a'"
    ]
}