{
    "Lease Extension and Rent Increase for the Colorado Symphony Association.": [
        "'speaker_3': 'We're going to wait for technology to catch up. It has been moved. Good luck with that move. And secretary also council members are taking the item out of order. Does not require comment. It is just a straight yes or no vote.'",
        "'speaker_3': 'So, Madam Secretary, roll call.'",
        "'speaker_5': 'Flynn I Gillmor I Cashman I can each i lopez I knew Ortega I. Susman, I. Brooks Hi, black eye. Clerk Hi. Espinosa. Hi, Mr. President. Hi.'",
        "'speaker_3': 'Madam Secretary, Councilwoman Ortega's back.'",
        "'speaker_5': 'Thank you, Ortega.'",
        "'speaker_3': 'And count up. We got him. Madam Secretary, please close the voting. Announce the results. 3939 522 may be taken out of order. So now, Councilman Flynn, you may offer your motion. New Order published. Thank you.'",
        "'speaker_8': 'Thank you, Mr. President. I move that council bill 522 be ordered published.'",
        "'speaker_3': 'It has been moved and seconded. Now time for comments. Councilman Flynn, you're up.'",
        "'speaker_8': 'Thank you, Mr. President. Last week I moved to hold this in committee until next week for first for publication, because I had some concerns about going from a rental rate of a dollar a year to what I thought was $5,000 a month.'",
        "'speaker_8': 'But I now see, because it includes the share of utilities, is actually asking the Colorado Symphony to pay monthly about $8,750 a month. I call it back to the floor now because I just want to keep moving it forward.'",
        "'speaker_8': 'I said that I would vote yes on this if in fact those lease payments could be sent. Two ways to the arts and Venues Special Revenue Fund, which I thought up until about 90 minutes ago, would be the case.'",
        "'speaker_8': 'I find out now that no, because this is 1245 Tampa and this is not an arts and venues building that the lease would go disappear basically into our general fund. I have a high level of discomfort for the next 15 months before the symphony finally moves out of this building of extracting $75,000 from them for the general'",
        "'speaker_8': 'fund. I don't think we need that needed that much that we need to ask the struggling cultural organization to do that. And so because it cannot go into a special revenue fund, I put it back on the floor and I will vote.'",
        "'speaker_8': 'No, thank you.'",
        "'speaker_3': 'Thank you. Councilman Flynn, in the comments. 522 Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. We had a lengthy discussion about this issue when it came to committee, and I think some of the frustration, if you will, that's part of what some of us experienced is from knowing that this building has historically been used by arts and venues.'",
        "'speaker_9': 'Yes, it may not be part of arts and venues, portfolio of properties that they manage, but since it was used as a jail, I can't remember. And I checked in with a couple of my colleagues that served on this dais for many, many years.'",
        "'speaker_9': 'And their recollection is it was always used by arts and venues. So, you know, the issue is about whether or not we extend the lease for the Colorado Symphony on what has been the third or fourth floor, but now it's only for the fourth floor.'",
        "'speaker_9': 'And the amount of what they're being asked to pay disturbs me as well, knowing the financial challenges that they have had and the desire that I believe we all have to try to keep them in our arts complex.'",
        "'speaker_9': 'And I'm concerned about what this does to their ability to, you know, find other space, because they're going to have to be paying everything out at this location. Some of the other tenants that utilize other venues on the site are not there on a consistent basis.'",
        "'speaker_9': 'They have periodic events and shows at the at the complex. So I'm struggling with this one as to whether or not to support it, because to not support it means that the symphony would be essentially asked to leave even sooner than what this contract extension and increase in payment requires.'",
        "'speaker_9': 'And it just, you know, begs the question, what is our commitment to the arts in this community? We know that the creative industries in this city generate $1.8 billion, according to the CBC's 2013 study that they did. And I'm just I'm not sure that I actually want to vote for this tonight, but to not vote for it'",
        "'speaker_9': 'means then that per the communications that we've received from the administration is that they would be essentially out of this facility even sooner. And that doesn't feel good either. So I just and just expressing my frustrations with how we have dealt with what has been a longstanding tenant in our performing arts complex.'",
        "'speaker_9': 'And as we're doing the, you know, the master plan visioning for our performing arts complex and trying to figure out what it is that we want it to be in the future. In my mind, the symphony is part of that big picture conversation and.'",
        "'speaker_9': 'This sort of, sort of kind of turns ah turns our ear on that. And so anyway, I'll just stop it that I'm just expressing my frustrations with this whole project and process and how it's going and knowing that this particular building is part of the discussions of the CPA complex.'",
        "'speaker_9': 'But yet, you know, when it came forward for a lease for the Denver Partnership, which is doing great work there, by the way, the the work they're doing and the investment they made in the building is phenomenal. But as they take over the third floor, if they continue to make greater investment and we decide we need and'",
        "'speaker_9': 'want that building for the rest of the performing arts complex as it's been used in the past, will then have to buy out the Denver partnership for any additional investment they make into that building. So it just seems like, you know, internally the right arm doesn't know what the left arm is doing.'",
        "'speaker_9': 'And and that's part of what feels so frustrating here because, you know, we should have had that bigger picture conversation before we did a long term lease on this particular building. And and it's unfortunate that that's not the way it's moving.'",
        "'speaker_9': 'So. Thank you, Mr. President.'",
        "'speaker_3': 'Councilwoman Ortega, Councilman Brooks up.'",
        "'speaker_0': 'Thank you, Mr. President. And just for knowledge of the public before we approve any and a tenant agreement, the the lessee agrees to this. And so the symphony has agreed to this arrangement. And I think that's just important to underscore.'",
        "'speaker_0': 'But I want to call up Kent Rice to the to the microphone. And just to answer a couple of questions, you know, this is I wasn't here last week, but we had a lengthy, lengthy discussion around this and tried to answer some questions.'",
        "'speaker_0': 'But but can't I guess what I would love for you to answer is some of the conversations you've had with the symphony and their arrangement. I think Councilwoman Ortega underscored that if we vote this down that the symphony will no longer have a place and we'd have to go back to the drawing board.'",
        "'speaker_0': 'And can you kind of talk about maybe if you if you know a little bit about this symphony's future and and some of the things that we've done as a city to try and sustain them in the city.'",
        "'speaker_10': 'Good evening. Council Members Kent Rice, Executive Director for Arts and Venues. I'm not sure if I'm the left hand or the right hand, but I'm definitely one of the hands on the old hand, I think. So the symphony has always paid rent to be at that.'",
        "'speaker_10': 'Your concert hall until two years ago, just as the opera and the ballet have always paid ground to perform at the COC. And so that is the tradition in the history. The not paying rent, the zero rental rate they've had at 1245 for office space is a very recent phenomenon, and it's something that arts and venues helped'",
        "'speaker_10': 'put together for them for two reasons. One is that they were in financial trouble. And by the way, many symphonies across the country struggle financially from time to time. That's not unusual. But the real issue has to do with that concert hall and the fact that we had planned to close it for renovation.'",
        "'speaker_10': 'So they were going to have to move their offices out of the hall. When we decided not to do that, I felt a fair thing to do was to provide some accommodation for them. So I lobbied to get them a two year dollar a year rent deal at 1245 Tampa.'",
        "'speaker_10': 'This was done in the context of knowing that the downtown Denver Partnership was going to be starting its new development program for the building and putting a lot of capital in there. But I persuaded the partnership, the mayor and others that this two year temporary free rent deal was worth doing for the symphony, and also to give'",
        "'speaker_10': 'the partnership a chance to get the commons, as it's called, up and running. There was a large concern about what would happen at the end of two years and into the lease agreement was written a stipulation that the symphony would have to pay more than $12,000 a month if it failed to move out as of October 1st'",
        "'speaker_10': '. So working with the real estate division, we put together a plan to let them stay in 1245 Tampa for 15 or 16 months at the same rate they used to pay for offices in Bettcher. So for years they have paid an amount growing up towards 60,000.'",
        "'speaker_10': 'I think you've been given some information about that in the past, but they paid kind of 40, 45,000 over a long period of time growing up towards 60,000. So essentially they're currently paying what they have paid all along, except for the past two years.'",
        "'speaker_10': 'So that's the history. I'll also tell you that years ago, in the past century, the symphony received about a quarter of $1,000,000 in bad debt write off when they were in severe financial trouble. And that was reducing or having the city arts and venues agree to take care of other expenses.'",
        "'speaker_10': 'I'll also tell you that for the opera in the ballet, when they struggle financially, we make payment arrangements. So we we provide a fair amount of support to our resident companies in the arts complex and on an ongoing basis.'",
        "'speaker_0': 'Thank you. You probably want to stay close because there are some more people in the queue.'",
        "'speaker_10': 'I'm going nowhere. Councilman okay.'",
        "'speaker_3': 'Thank you. Councilman Brooks. Councilwoman Canete.'",
        "'speaker_7': 'Thank you, Mr. President. Councilman Brooks was with great foresight. I actually only have one question, which is it's not uncommon for us to have mixed feelings about pieces of leases or contracts we don't get to negotiate directly. That's part of the challenge of the the branches of government.'",
        "'speaker_7': 'And we don't get to sit in the room doing the details of these agreements. But in many cases where there's something that helps us to feel a little better, we tend to find common ground. And when Councilman Flynn proposed the idea that these funds be dedicated back towards better, it seemed like a pretty easy thing to agree'",
        "'speaker_7': 'to. And I was surprised to hear. I understand that by design, these funds don't flow back to arts and venues because it's not your building. But what I don't understand is why you're not willing to dedicate them to flow towards a voucher and be dedicated in that way to help find some common ground.'",
        "'speaker_7': 'I was surprised that that was not something that that, you know, and I don't know who, but the administration generally was not willing to.'",
        "'speaker_10': 'You and Councilman King each. The answer to that is that it never even came up as a topic. We have $17 million set aside for the renovation of Bettcher, which will be used eventually for the next stage of redeveloping the whole complex.'",
        "'speaker_10': 'The building, as pointed out by Councilman Ortega, is not our sun venue's building, so it's not in our portfolio. We proposed the rental agreement with the real estate division, but the $5,000 a month for 15 or 16 months didn't it didn't seem like it was worth our arguing for.'",
        "'speaker_10': 'Honestly, this might.'",
        "'speaker_7': 'Be a left hand, right hand situation. Another piece I am has to.'",
        "'speaker_9': 'Answer that question.'",
        "'speaker_7': 'Because it did come up and I believe my colleague actually had a conversation about it. So I guess it did.'",
        "'speaker_9': 'Sky Stuart Mayor's Office and we had an internal.'",
        "'speaker_5': 'Conversation about this that as Kent points.'",
        "'speaker_9': 'Out, there are rental agreements that better and those funds do go into the arts and venues. Special Revenue Fund. There are also multiple sources for capital maintenance dollars on arts and venues facilities. The 1245 Tampa building is maintained by general services.'",
        "'speaker_9': 'And so to have the lease revenues.'",
        "'speaker_5': 'Go into the general fund where they can match up with the facility, that's the.'",
        "'speaker_9': 'Agency that's responsible for maintaining that facility.'",
        "'speaker_7': 'Makes more sense to us that.'",
        "'speaker_9': 'We have a source, multiple sources.'",
        "'speaker_7': 'For capital maintenance at the arts complex for those facilities.'",
        "'speaker_10': 'Councilman Kennedy, it didn't come up before the lease was signed. I know the idea came up. It was raised by several council members, but not before the symphony had already agreed to the terms. Yeah.'",
        "'speaker_7': 'I'm going to go out and vote for this because I do think it's important to allow the symphony to continue their occupancy. But I will point out that no one bettcher is not fully paid for the lowest estimate to renovate that year or to make it whatever it is.'",
        "'speaker_7': '17 million doesn't cover it yet. And so the idea of dedicating these resources in my mind would have been an appropriate way to kind of bridge the gap. And I'm disappointed we didn't do that. I get the theory about general services, but the truth is none of the sources that you've identified completely pay for bettcher there's still'",
        "'speaker_7': 'a gap. So any dollars we could put towards that seems prudent. But it makes sense to me to keep the symphony there that this was, you know, something that they agreed to. And so not loving this lease, I'm going to vote for it tonight to keep things moving forward with the understanding that we will have a conversation'",
        "'speaker_7': 'about the future of that building at a later date. So thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilman Espinosa.'",
        "'speaker_0': 'Thank you for the information about the stipulated rate helps immensely because unfortunately, we get this after, you know, we're new council, many of us are we get this and it's presented in one way with and we're missing an important context on how the how this agreement how you got the symphony to agree to sort of what seemed'",
        "'speaker_0': 'like drastic shift in position when downtown Denver partnership has such a a you know, a sweet deal in some regards. And so having more background, at least for me, really helps in understanding how it is that a party that's not present at that discussion could arrive at some sort of decision where now this seems like a compromise'",
        "'speaker_0': 'rather than sort of the heavy handed move to sort of either move in, pay more or ease your stay and pay more, you know, so that helps. Thank you.'",
        "'speaker_10': 'Councilman Espinosa, I'll just respond to that by saying the symphony president was thrilled with this. When I talked to him after the real estate chief and I met, they had no place to move their offices. And he said, this is a great solution for us.'",
        "'speaker_10': 'So I'm not saying there couldn't have been a different one or a better one, but he called me twice to thank me. So I feel like at least at the front end of the discussion, the symphony was quite happy with what the proposal was.'",
        "'speaker_0': 'And unfortunately that part wasn't conveyed to the new council members and those of us who weren't privy to that, that level of discussion really benefited from it.'",
        "'speaker_10': 'Apologize for that. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Espinosa. Councilman Flynn.'",
        "'speaker_8': 'Just real quickly. Thank you, Mr. President. Just a few follow ups compared to the alternatives, of course, it was a much better deal because the alternative was to go out on the market and pay probably a lot more.'",
        "'speaker_8': 'I'm just curious about why there was perceived to be a need to extract rent from them for the final 15 months when they'd already just had a dollar a year deal. It's not I you know, I've covered a lot of city council activities in this room for a quarter century.'",
        "'speaker_8': 'And if if October 1st came up and if the administration were agreeable, I'm sure the sheriff wouldn't be there to put them out on the street if another if another path forward were to be found. The rent in the 2010 lease agreement, the symphony paid rent on a 4% annual escalator.'",
        "'speaker_8': 'But they did not pay for maintenance. They didn't pay. A share of the utility costs. We're asking them not only to pay $5,000, but also to pay 3750 on average a month toward the utilities, which they have not been asked to pay, even when they were at better haul for their office space.'",
        "'speaker_8': 'And of course, they pay they pay rent when they perform in there, as do any other, as does any other institution. So I'm not sure that the deal. I don't know that Luca Brasi was in the room as well when you were negotiating this, but I'm sure that there were not many favorable choices for the symphony to'",
        "'speaker_8': 'go forward. The the last point I had and that was the last point. So thank you. I'm ready. I'm ready to go forward and spread unless someone else has something.'",
        "'speaker_3': 'Got you. We got one more councilman. Councilman Brooks.'",
        "'speaker_0': 'Yeah. You know, just because it's in my district, I just want to say a couple more things, because there's some been some things that were thrown out. And I just want to bring some context to the public. A couple of things that were thrown out were about the comments and the downturn of our partnership.'",
        "'speaker_0': 'This is actually a three way partnership with obviously Economic Development, Colorado Technology Institute and the downtown Denver Partnership, and they put over $1,000,000 into the tie to tenant improvements. And so that's why that was adjusted for the rent.'",
        "'speaker_0': 'And this is the only low, bare tech startup opportunity that we have in the city where anyone can come off the street and learn about the technology institute and tech startups in a way where they don't have to be a part of a company.'",
        "'speaker_0': 'And so it's a great opportunity for us. And the second thing I want to say is I met a lot with Jerry Kern. I met with the symphony. And I just want to encourage I've heard a couple of times on the dais that we you know, we want to save the symphony.'",
        "'speaker_0': 'We want to do. Councilman Lopez is on the board. I'm sure he'd encourage this as well for us individually as council members to go and meet with Jerry Kern, go look at the financials and go talk about some of the ideas that we have to keep the symphony alive in Denver, because I'm sure he'd welcome the help'",
        "'speaker_0': '. Thank you.'",
        "'speaker_10': 'Council Councilman. Council president, please, if I could just respond. And I think for the new council members, it's quite important. Why did we not recommend a free rent deal to continue? I was very adamant about that and I remain adamant.'",
        "'speaker_10': 'The reason is we have many other people who pay rent. The CPA pays rent, the opera pays rent, the ballet pays rent. The period in which the symphony got free rent was because the city would have inconvenienced them had they had to move out once their future was clear and they knew they had a couple of years'",
        "'speaker_10': 'to perform and better for the city to give them free rent would have immediately caused other cultural groups to come in and ask for free rent. So I think that's important historical context about why it's not a free rent deal any longer.'",
        "'speaker_3': 'All right. Any other comments or questions? 522.'",
        "'speaker_8': 'Mr. President, just a quick question. Do the ballet and the opera have office space at Deepak?'",
        "'speaker_10': 'They do not.'",
        "'speaker_8': 'Like. That's why they're not paying your rent. They don't have an office space there.'",
        "'speaker_10': 'The free rent. I should have just I shouldn't have gone down this path. The rent had to do with the rent paid overall for two years for the concert hall and the office space. The symphony used to pay rent for the concert hall and the office space.'",
        "'speaker_10': 'When we agreed to not charge them rent at all, it was for the office space and the performance hall. So that's a very good question. Obviously the the rental for the hall is much, much greater than the office space.'",
        "'speaker_10': 'And the other thing we did for your information is couch this and imagine 2020 cultural accessibility. So we gave away the equivalent of tickets with the symphony in exchange for what the rent was that they would have paid us.'",
        "'speaker_10': 'But I conflated two things. There's office rent and hall rent and they got both free for the two years. Thank you.'",
        "'speaker_3': 'Kathryn Lopez, Europe.'",
        "'speaker_6': 'Thank you, Mr. President. I just had a comment and this just, I think, was one of the questions that I that I wanted to ask was answered and is clarified in terms of how does that compare with some of the other folks who were there, too, including the ballet and the opera?'",
        "'speaker_6': 'On a symphony level, yes, it's struggling. And I think, you know, this definitely needs to move forward. We're kind of in a tight conundrum here, but I think at the end of the day, this is something that I hope we are included on and make sure that we back home, we don't forget this and the thousand bills'",
        "'speaker_6': 'that we pass every year. We should have this conversation, strategically speaking, in committee. I understand this is going to move forward, but I agree. And being a board member of the symphony, it is not intended like it used to be.'",
        "'speaker_6': 'We struggle to be able to get folks there, especially millennials. You know, when you have acts like Los Lobos, also Motley or Boyz II Men, you get us there. And so it's a matter it's a matter of strategy.'",
        "'speaker_6': 'But here's here's here's the thing. An organization that is barely covering the costs. The last thing you want and saying, oh, by the way, here's another hundred, $200,000. You got to come up with. Mm hmm. We as a city have to do a values check and to see what is it that we want in our city?'",
        "'speaker_6': 'What are the things that are sacred? And what are we willing to do for those things that are sacred? I think a symphony is one of those things that are sacred. A big city, a great city should have a symphony in our midst.'",
        "'speaker_6': 'We should be able to foster that. We should be able to fix this out if we can figure out how to pay for half a billion dollars to build a stadium. And we should figure out how we can actually do this to keep the symphony, to keep the fine arts in Denver.'",
        "'speaker_6': 'And I think there's a different way. There's a lot of different ways we can go about it. But I hope I get my comments as I hope can. I hope our colleagues that we can bring this discussion back into council so we can talk about the future of what we intend to have at the EPA, not just'",
        "'speaker_6': 'an was built there or what's being offered, but the organizations that actually give it the the the reason to go. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Kathryn Lopez. All right. Any other comments? 522 C None, Madam Secretary. Rubio?'",
        "'speaker_5': 'Flynn.'",
        "'speaker_8': 'No.'",
        "'speaker_5': 'Gilmore, I Cashman know. Can each Lopez.'",
        "'speaker_6': 'Pass.'",
        "'speaker_5': 'New Ortega?'",
        "'speaker_9': 'A reluctant AI.'",
        "'speaker_5': 'Sussman. AI Black AI Brooks. AI Clerk AI Espinosa. AI Lopez.'",
        "'speaker_6': 'AI.'",
        "'speaker_5': 'Mr. President.'",
        "'speaker_3': 'I got him. Madam Secretary, please, cause very nice results.'",
        "'speaker_5': '11 eyes, two face.'",
        "'speaker_3': 'Nice to face. 522 has been ordered published. All right, we are on to the next one. Should be the first bill for introduction, Madam Secretary. Should be 553, if I'm not mistaken. You got it. All right. Flynn Sussman anew, I imagine.'",
        "'speaker_3': 'What do you want to call this off? Your vote is that I look left. Is this for a vote? Comment or question? Yes. Vote. That's what I thought. All right, Councilman Flynn, we will order 553 ordered published.'",
        "'speaker_8': 'Thank you, Mr. President. I move that constable 553 be ordered. Published.'",
        "'speaker_3': 'It has been moved and seconded. Just about everybody wants to speak. All right, Councilman Flynn.'",
        "'speaker_8': 'Thank you, Mr. President. As we've said in the various committee meetings we've had on this, I believe that this program, that the way it's been structured, it's really well structured. I like how it works. The only thing that I do not like about it is I believe it's pulling up to the wrong fuel pump.'",
        "'speaker_8': 'I don't believe that municipal sales tax is the proper vehicle for fighting for funding this system. I believe that other avenues could have been looked at or should have been looked at or ought to be preferred over over municipal sales tax, which is the most regressive form of tax.'",
        "'speaker_8': 'And and it also is, I believe, beyond the role of of the municipal government, if I could put .08 percent sales tax on the ballot right now, I have sidewalks and streets in my district and I have other needs in my district.'"
    ],
    "Denver College Affordability Initiative Ballot Proposal": [
        "'speaker_8': 'We need we have long police response times in my district that need to be brought down. There are a lot of other municipal needs in our core mission that I would put ahead of this, and I would encourage that perhaps DPS to look again at the funding this through through a mill levy, through DPS rather than through'",
        "'speaker_8': 'sales tax. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Flynn. Councilwoman Sussman, you're up.'",
        "'speaker_7': 'Thank you, Mr. President. I have the highest regard for the group that asked me to be a member to look at this, and particularly thought it was admirable that you invited me to come when you knew that I probably would have some disagreements with you.'",
        "'speaker_7': 'And I understand the serious need for our citizens to have real access to college. That's a very worthy goal. But City Council government is quite removed from education. Government in our state. City Council has no jurisdiction over any educational institution.'",
        "'speaker_7': 'It's a state's jurisdiction. Improvements in education are the responsibility of the state. They are the ones that should make reform. Like Councilman Flynn, I understand, too, the city has enormous obligations for roads, drainage, safety, housing, and I am uncomfortable asking taxpayers to support something that has never been in our purview and when we have so many other'",
        "'speaker_7': 'operational and infrastructure needs. But my most serious concern here is that in this initiative, the colleges have no responsibility nor accountability for the moneys they will receive from taxpayers. Even their responsibility for student support is going to be removed for those students and given to nonprofits.'",
        "'speaker_7': 'Colleges have no responsibility to account for why tuition is so high or to control them during the life of this initiative. The only other economic sector whose costs have risen way beyond inflation for unclear reasons is health care.'",
        "'speaker_7': 'And college tuition has risen faster and higher than health care. Additionally, our public colleges have poor retention and completion rates. I don't think any of our public Colorado colleges have better than a 50% retention rate. Many are lower.'",
        "'speaker_7': 'They are not required to improve these either in this initiative. And indeed, this initiative removes that responsibility from the college and again, gives it to the outside nonprofits. So are we just fueling the problem? When I have asked the proponents why there are no requirements or expectations for the colleges receiving these funds.'",
        "'speaker_7': 'The answer has been we have no jurisdiction over the colleges. Exactly. Retention and completion rates are affected by many things cost to the student, certainly lack of student support, a system that is difficult to access for the long term if you have a job, family or other responsibilities.'",
        "'speaker_7': 'Most people in higher ed today are 22 years and older. College colleges are organized best for the 18 to 21 year old, who has leisure time to attend classes on campus and who has a patron, their parent or the government.'",
        "'speaker_7': 'That's what colleges. Are organized to do the best. But this initiative cuts off students who are 25 years or older. We're just continuing the problem when most of the students in higher ed are over 20 or 22 and over.'",
        "'speaker_7': 'If. We pay tuition rates without any kind of bill. If we initiate the initiative, cut off students who are 25 years or older, if we pay tuition rates without any accountability on the part of the college for their performance and pay only for the younger student.'",
        "'speaker_7': 'We're tackling the wrong end of the problem with the wrong resources. So I will be voting no on referring this to the ballot. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilwoman Sussman. Councilman Nu.'",
        "'speaker_6': 'Thank you, Mr. President. I have a question for Mr. Broadwell. Just wanted the action we're taking tonight, as is we're voting to move this issue to the ballot. Right. We're not we're not approving this. To become a bill that's being implemented is really an action to go to the ballot for the voters to decide on this.'",
        "'speaker_6': 'Is that correct?'",
        "'speaker_10': 'David Broadwell, assistant city attorney. Well, the specific vote tonight is to order it published.'",
        "'speaker_6': 'And then an.'",
        "'speaker_10': 'Action would be taken next week to do as you just described, to send it on to the ballot by adopting the ordinance.'",
        "'speaker_6': 'Okay, great. Thank you. I thought someone assessed was very, very articulate what she was saying. And I've talked to many of our constituents about this issue, and I hear the pros and cons are the cons that this is really a state responsibility and almost forcing us to do this to support funds for our students and when the'",
        "'speaker_6': 'state does not take their responsibility is something is very troubling to a lot of my constituents and residents. And we're 47th of 50 in the nation that supports higher education, which I think is is just ridiculous and a travesty.'",
        "'speaker_6': 'We should be a greater to support our workforce here in our state and not just rely on our own workforce, educated workforce. It comes from out of state. In terms of priority, I think, Councilman Flynn. Mitch Well, we've got a lot of needs in our city.'",
        "'speaker_6': 'And I'm not saying this isn't a need for our students. We need to make sure we have an educated workforce. And so we've got to balance this with other needs that we have when it comes to infrastructure in our city.'",
        "'speaker_6': 'And I'm not sure if we vote yes for this, whether this will pressure the state whole if if a yes vote does occur, I hope it will pressure the state to say to the state, you need to take responsibility for higher education.'",
        "'speaker_6': 'We need to do something about that. The pros that I hear from, I hear a lot about education is the key to success. There's no question about higher education being able to promote success as well as we need an a state workforce development program.'",
        "'speaker_6': 'So I really appreciate that so much and especially difficult for me because I have a children's hospital management background and I've promoted the welfare and and health care of children all my life. And so I see this as a program that will help our students as well as to develop a workforce that will be successful for our'",
        "'speaker_6': 'city. So I think in light of what the question I asked David Broadwell, probably I'm going to vote yes for this just because I think our citizens need to decide on this. We need our citizens need to vote whether this is a priority, whether this is an important issue for our students.'",
        "'speaker_6': 'And I'll be voting yes tonight.'",
        "'speaker_3': 'Thank you, Councilman. New Councilwoman Blake.'",
        "'speaker_7': 'Thank you, Mr. President. I think this is an innovative solution to a real problem. I'm supporting it. I share the same concerns that other people have voiced. But I'm an enthusiastic supporter of education because a college degree is the way out of poverty for many families.'",
        "'speaker_7': 'I just want to give our voters, like Councilman.'",
        "'speaker_9': 'Nugent.'",
        "'speaker_7': 'Said, the opportunity to have their voices heard. So I am voting yes.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilman Espinosa.'",
        "'speaker_0': 'And I can honestly say I still don't know how I'm going to vote on this. I wait to see how my colleagues do simply because I am tore whether to advances for a ballot measure and let everybody decide on something and the potential to tax everybody and only support a few.'",
        "'speaker_0': 'I mean, that's sort of what we do a lot in city government from time to time. But the portability is the issue. When we're investing tax dollars, I want it to go into infrastructure. I want that to go into things that can benefit a large cross-section of this city for a very long and permanent time.'",
        "'speaker_0': 'You know, we talk about I mean, I just shared this, too, yesterday. When we talk about Denver moves this this this tax would actually if we applied it to Denver moves and I don't know that we could if we structured a bill that way could pay for all that bike infrastructure that handles a cross section of the'",
        "'speaker_0': 'population here. This measure only touches about 6/10 of the population of Denver on a per annum, per annum, per annum basis. And and it's and it's not just, you know, it is needs based, but it actually then extends beyond where the federal programs already go.'",
        "'speaker_0': 'And so it sort of it doesn't comport with me very well that we tax everybody to then support a few that may or may not hit the federal government thresholds for need. So I don't know if I want to see this next week or not, but I'll I'll.'",
        "'speaker_0': 'I'll vote soon enough. Thanks.'",
        "'speaker_3': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_10': 'Thank you, Mr. President. Like a lot of my colleagues, I've received some notes recently of concern about this proposal, that it's not the opinions being expressed, that it perhaps it's not the purview of city government, that education is a state responsibility.'",
        "'speaker_10': 'I agree that state must take the lead in funding education. But sadly, the efforts that have been coming from the Capitol leave us, as has been said, ranked 47th in higher ed. And I think we're somewhere the same way with K through 12.'",
        "'speaker_10': 'So the question is, do we stick to those guns that this is a state responsibility or do we act in some sort of measured way to try to make some difference? Denver has been a groundbreaker with the funding of the Denver Preschool Program.'",
        "'speaker_10': 'Should we act in a similar way here? There are no questions that we have many civic needs that cry out for funding our charge and our challenge is to prioritize those needs. We have roads and bridges and sewer lines and all manner of infrastructure in disrepair.'",
        "'speaker_10': 'We have a number of big dollar projects that are going to be coming before us, and we have a future generation that is being pushed farther and farther away from college education by continued skyrocketing costs. So I sit here tonight, like so many, trying to weigh those priorities and trying to weigh the questions on many minds.'",
        "'speaker_10': 'But one thing to me that is not in question is the fact that someone needs to educate our children where, as has been said, we're not voting tonight to pass a tax increase. We are voting to give Denver residents a chance to debate this critical issue, to engage our broad community in what I think is an invaluable'",
        "'speaker_10': 'dialog on our civic priorities. I think what we have here is a real moment in time opportunity that I hope we don't waste. I'm not near ready to say, bring on the tax, but I'm more than ready to say bring on the debate.'",
        "'speaker_10': 'So I will vote tonight to move this forward to the next step.'",
        "'speaker_3': 'Thank you, Councilman. Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. I do believe that action needs to be taken on that state level. I think universities and colleges public I if there was a way to do private a be all about it to lower steps need to be taken to lower tuition.'",
        "'speaker_6': 'Tuition is and the cost of tuition is the primary blockade for students being able to have a diploma on their wall to hang on their parents wall and for us to be able to move forward as a city.'",
        "'speaker_6': 'It's great if you're a valedictorian or if you had a 4.0 or throughout high school, got your scholarship full ride. That's awesome. I wasn't one of those students. I think I barely clung on to a31 dipped in maybe a2827.'",
        "'speaker_6': 'I barely made it in in college. It walked into a room bigger than this. 500 people don't look nothing like me. Don't understand where I come from. I felt completely alienated. I couldn't afford to go. I was an academic.'",
        "'speaker_6': 'Not academic. I'm sorry. It's clear the record on that one. Financial aid, probation almost every semester. I struggled. I had bills sent to my house all the time. I worked three jobs just so I can have that degree that hangs on this wall right across the way.'",
        "'speaker_6': 'Bachelor's degree from C.U. Denver. I struggled to make that happen. It took me five and a half years on my own to put that diploma on my wall. I'd like to think. That that diploma has helped not just me, but help my neighborhood.'",
        "'speaker_6': 'Taught me some lessons and how to give back. I think that's an added plus to the neighborhood. And whether you're a council person or a or a teacher or a psychologist or a philosopher or or a biochemist. Folks stay here.'",
        "'speaker_6': 'People just don't. People don't just leave Denver. Folks stay here when they're done. We have to make sure we're using every tool in the box to give these kids a shot. Let him earn it. And that's from what I understand.'",
        "'speaker_6': 'This isn't some handout. They have to earn this. Let them prove themselves worthy. And not just the 4.0 for 4.5 and 5.2 students, but those to name those three all and those 1.0 that if they if they had something if they had a beacon of light that they can look at and say, I can achieve that.'",
        "'speaker_6': 'I can do this. Just let me prove myself. Let me get. I just want a key to open this door. The right key. And we help them get that key. I think Denver is going to be a much better place.'",
        "'speaker_6': 'And if there's one thing I have known in the last eight years and was elected official, if there's something that we should be investing in, it's education. Because I'm tired of people calling my office thinking not not understanding what we do.'",
        "'speaker_6': 'Not understanding the role they play. And it's basic civics. I'm tired of watching stuff on the news and watching talking heads debate about basic civics. I don't even teach anymore. I'm tired of that. It gives us a bad name as public servants.'",
        "'speaker_6': 'It gives our constituencies in our communities such a bad name. I would be absolutely down. Councilman Flynn, you are talking. You were singing my song. Said we should raise a little tax here for sidewalks. I'd be all for that.'",
        "'speaker_6': 'Pitch out, brother. I would be the first vote on that. There's a lot of things that I would tack on to this, but let's. Let's do it one at a time. Education is the key. I know it's overused, but it is the key for a lot of folks.'",
        "'speaker_6': 'I look at a neighborhood like Valverde and less than less than 25% of the population at one point in that neighborhood had less than a high school diploma. That is not acceptable. And there are a lot of people out there that if they just had the opportunity, the cash, the money, the ability to get to cash in'",
        "'speaker_6': 'on that acceptance letter, they would. And not just the first year, but the third, fourth and maybe fifth. And beyond, and that's the little lever that we need to push it. We're not approving this tonight. We're asking that it gets published so that the voters can decide for themselves.'",
        "'speaker_6': 'And some of those voters are the very constituencies that we talk about, but they don't show up on the voting polls because they're only 17 and 16 years old. Right. So let's let's put this on the ballot and let's let Denver decide.'",
        "'speaker_6': 'I do support this all the way through, but let's at least give it a shot and ask our state to giddy up and start enacting some kind of reform on tuition here in this in this state. So I'm sorry, I'm getting more passionate about this.'",
        "'speaker_3': 'Thank you. Thank you. Councilman Lopez. Councilwoman Ortega. You're up.'",
        "'speaker_9': 'Mr. President, when this came to committee, I requested a public hearing, and I don't see anything in our agenda that reflects that. We were either supposed to have it tonight or that we're having it on public on final.'",
        "'speaker_9': 'So. So, can you clarify if true, is anything to still happen.'",
        "'speaker_3': 'If a councilmember requests a courtesy public hearing? I don't imagine there's going to be any against it and we'll have it for second reading.'",
        "'speaker_9': 'Okay. Well, I requested it when it came to committee, so I was surprised that we're having this conversation without having had input from from folks on the issue. So I want to make that request again. I think it is important for us to hear from the public on this issue.'",
        "'speaker_9': 'I do believe this is an important issue for us to be talking about because we want to ensure that we have an educated workforce in this city, particularly as we attract more and more businesses. And the cost of living in the city is getting more and more expensive for especially our young people to be able to afford'",
        "'speaker_9': 'to live here. And if they're not educated, they're certainly not going to be able to stay here. So I appreciate the work that's been done by the folks who are part of the committee. I remember when this was talked about last year, my suggestion was you need to go back to the drawing board.'",
        "'speaker_9': 'You need to have a broader community conversation about this issue and ensure that other organizations are brought under the tent to be part of this overall effort. And that, in fact, happened. So I appreciate those efforts. I also think it's very important that Denver Public Schools hears the message that we want them to ensure that young people'",
        "'speaker_9': 'who want to go to college are ready. We have a lot of young people that go to college and have to take remedial classes. They should not have to be spending money on remedial classes when they're supposed to be getting that education in our public education system.'",
        "'speaker_9': 'And I've heard parents who've talked to me and other property owners say we shouldn't be educating them twice to take some of the same classes they should be taking, getting educated for in high school. So I think that's an important part of the conversation.'",
        "'speaker_9': 'I agree. This is giving the voters the opportunity to decide if this is something they want to agree to support financially through a tax increase. And so I always believe that it is important to give the voters that chance to make the decision.'",
        "'speaker_9': 'So I will be voting for this tonight and look forward to hearing from folks who have worked on this issue. I know we had a couple of very articulate young people that came to committee when we had the conversation in committee about this.'",
        "'speaker_9': 'And, you know, we got to hear how challenging it is and how important the scholarship funds that are out there were to them being able to go on to college and to stay in college. You know, some people may get a scholarship to assist them to, you know, go that first year, but it's that ongoing support that'",
        "'speaker_9': 'becomes really critical to ensuring that they're successful in reaching that goal of graduating and getting that degree. So I'll be supporting this tonight. Councilman Herman, Council President Herman, thank you for bringing this forward.'",
        "'speaker_3': 'Thank you. Councilwoman Ortega and four members of council. If there are no objections, we will have a courtesy. When our public hearing on 553 and assuming this is ordered published Monday, August 24th. Councilwoman Gilmore, you're up.'",
        "'speaker_9': 'Thank you, President Herndon. I have spent almost 20 years in my professional capacity as the Executive Director prior to this honor of serving on city council with a local based nonprofit, making sure that our young people who are in elementary and middle school.'",
        "'speaker_7': 'Think about.'",
        "'speaker_9': 'College as a next step in life. And those students that I've worked with over the last almost 20 years, primarily African-American and Latino students and families, many of them the first generation, as I am a first generation Latina college graduate.'",
        "'speaker_9': 'And so I understand their fear and their issues and their despair sometimes around looking at college as a viable next option. Really, higher education is not accessible to every student for many different reasons. But to level the playing field where a student, when they go off to college and you're so excited that they one got into college'",
        "'speaker_9': ', will one you're excited they graduated from.'",
        "'speaker_7': 'High school.'",
        "'speaker_9': 'Too, that they got into college, and three, that they're going to be expanding on this next grand and adventure in their life. And then come the holiday break in December and they come home and they tell you, I have to drop out, I've got to quit.'",
        "'speaker_9': 'And you're like, I've worked with you since you were in fifth grade. What are you talking about? This was your dream. I want to be there to support you. Well, I just got the bill, and I don't have scholarships.'",
        "'speaker_9': 'I have used up all of my other funding. I'm going to have to quit. And then you scramble and you work to find work, study for them. You try to find different avenues, any avenue possible for them to stay in school.'",
        "'speaker_9': 'And it's not a reality for so many of our students. And so really, the investment in the future of our great city is our people. And that investment, I think, is very important. And to allow the voters to have their true voice heard, having this, you know, on the ballot, that there can be that grand debate and'",
        "'speaker_9': 'that we really do hear the voice of our constituents and voters and what they're feeling on this and that education really becomes a freedom, freedom in life for so many people that cannot be taken away. And I will be supporting this measure and I look forward to a robust conversation about it.'",
        "'speaker_9': 'Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilwoman Gilmore, Councilwoman Canete, Europe.'",
        "'speaker_7': 'Thank you, Mr. President. Before I get into my comments, I did just have a question. I don't. Mr. Bravo, do you have a copy of the ordinance in front of you? Can we get you one? The question I have is, you know.'",
        "'speaker_7': 'There's a question about whether this is enough to make a difference. Right. So it's a significant revenue stream. It's taking a resource that could be used for other priorities. And that's a global question. But then to do that, is it enough per student to actually make a difference?'",
        "'speaker_7': 'And so I have read and reread this bill, and I see repeatedly on pages nine, ten and 11 a reference to $4,000 per student. Nowhere in the language of the bill do I see per student per year. But the proponents continually tell me that it is a $4,000 a year commitment.'",
        "'speaker_7': 'And so I just want to clarify whether this bill is drafted accurately. And if so, what am I missing that allows it to be per year? Because I, I question the value of $1,000 a year to a student given what higher education costs.'",
        "'speaker_10': 'I would beg your indulgence on this one, because I haven't been that close to the drafting of the negotiation of the ordinance. Dan Slattery is the attorney in our office who has. So if we could defer that until next week, if assuming it's going to be ordered published, we can get you a definitive answer from him.'",
        "'speaker_10': 'He will be back next week and he can help with that kind of detailed question.'",
        "'speaker_7': 'I probably will need that answer. I will just go to the merits, though, real quickly, because I don't want to dodge them. I share many of the concerns that have been shared by my colleagues about the appropriateness of this as a not a priority, but as the priority right now from this revenue stream for the city.'",
        "'speaker_7': 'And I worry about the downstream impacts. In one hand, I hear my colleagues who say, go ahead and send it to the ballot, because if the voters decide they want to do it, then, hey, that's the will of the people.'",
        "'speaker_7': 'In my opinion, the way to do that would have been to petition to the ballot. They're here before us at council because they want a statement from us that this is the right thing to do. And here's my fear.'",
        "'speaker_7': 'The voters decide to do this. And then we have a yearlong transportation commission and we decide the only way that we can address the infrastructure that our residents are demanding is a sales tax. And they say, oh, but you just came to us last year for that other thing.'",
        "'speaker_7': 'And, you know, the proponents in this case are so well-intentioned and they have a very righteous cause. And I'm not here with any quibble with the value of education, the disparities we're trying to overcome economically. I was a kid who went to school on scholarships and three and five jobs.'",
        "'speaker_7': 'And so I get the value of of these kinds of resources. But no one can tell me that our voters are going to be okay with the next thing that we need to bring them. That may be an immediate and direct priority of the city.'",
        "'speaker_7': 'This is a priority, but it may not be the most immediate and direct. And I, I can't predict. So so I have concerns. I'm not sure that the answer to this question. I weigh those concerns against the merits of the bill, which I think is, you know, the most we can do in this job is try to'",
        "'speaker_7': 'to take our gut reaction and set it aside and then think more about the facts. So that's what I'm trying to do. So on that fact side, I want to understand better is this enough money to make a difference?'",
        "'speaker_7': 'And if it's per year or not, makes a difference? I have heartburn over the age. The fact that we're cutting off, you know, older adults, we know a lot of disconnected youth, take time to find their way to college and this bill leaves them behind.'",
        "'speaker_7': 'So, you know, if we're there on the merits, then I'm struggling with leaving those older, young adults behind. And third, I'm struggling with sending the money out of Denver. You know, the Chicago example that was shown to me was for Chicago universities.'",
        "'speaker_7': 'I really did appreciate the data. Thank you again to the to the to the community, folks who got me the stats that many of our, you know, Denver students go to colleges in other parts of the state and they come back but but not all of them.'",
        "'speaker_7': 'And so every you know, everything that makes this harder makes it a tougher case to say it's worth the investment, it's worth the risk that we are limiting a future revenue stream we may need for another purpose. So I can't unfortunately just weigh this on its merits of whether it's good or not.'",
        "'speaker_7': 'I have to weigh it on how it may affect future things, and I have to weigh in on whether it's a good enough, you know, outcome. And so those are the three areas I'm struggling with, and I'll wait to hear the response on the drafting till next week.'",
        "'speaker_7': 'And I'm sorry, I was texting with folks over the weekend trying to get resolved. And I apologize for not doing that in time for this vote, but I promise I'll make a commitment next week, not trying to dodge it.'",
        "'speaker_7': 'So thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilwoman. I won't go to Councilman Brooks because he has not had the opportunity to speak. Then we'll double back to the council members that are in Spokane. Catherine Brooks are.'",
        "'speaker_0': 'Up. Yeah, this is a this is for order for publication. Typically, I wouldn't make remarks, but unfortunately I'm not going to be here next week. And so I wanted to just share a couple remarks. You know, I was a Denver preschool program chair for reauthorization last year this time.'",
        "'speaker_0': 'And we had virtually no opposition and we had virtually no kind of attacks against the campaign. It was because of one reason it was data. The data that we showed from the previous ten years was enough to say this program is making an impact, because the conversation that we had was typical to this conversation in 2003, and'",
        "'speaker_0': 'for a matter of fact, this this deep failed twice before it made it. And so as I've been listening to the conversation and I've been taking in a ton of folks in my community questions, it's it's harkened me back to to Denver preschool program which is just an interesting correlation.'",
        "'speaker_0': 'I came to Colorado because I received a scholarship to the University of Colorado. I went to it from the University of Colorado. I can promise you, I'm from L.A. There's no reason I would be in Colorado unless I got a scholarship from the University of Colorado.'",
        "'speaker_0': 'Unfortunately, it was not because of academics. It was although my grades were okay. It was because of football. And when we were good and.'",
        "'speaker_6': 'In the nineties brothers.'",
        "'speaker_0': 'You know, I think about what that scholarship did for me. I think about my grade point average coming in school was about a33. My grade point average leaving school was about a38. I think about my career path. I think about my purpose in life.'",
        "'speaker_0': 'I think about the individual that I became. And it's not all because of that scholarship, but it set me on a certain trajectory. So that's just my kind of personal experience in this. I think the policy debate that you have before you it's hard to do with councilwoman can just take your heart out, put your mind over'",
        "'speaker_0': 'here you know, because it's hard to say. Sidewalks and streets. And then we don't mention Kalief. And and John and and Greg, all who live in northeast Denver who would not have a shot at going to school. And so that conversation for me is a little tougher because, yes, we need sidewalks.'",
        "'speaker_0': 'And I've seen people when we put in their sidewalks, especially Long Brighton folks who have lived there for years, they are in tears. They're so excited. But there are individuals in our city today who will not get a chance to experience the opportunities of Denver because they won't be educated.'",
        "'speaker_0': 'And that sticks with me. Iran is a center for urban leadership where we raised over $1,000,000 a year just for a small group of young people. And the question always from our funders was, is this enough? And so, too, the niche argument is, is this going to be a large enough investment?'",
        "'speaker_0': 'I actually think you I think you got to start smaller to prove that it's effective is actually my approach. Here's here's something else. You know, our charge, our authority here at the city in county Denver is to make sure that we are not outside the bounds of our charter rule and ensuring that this these funds will be'",
        "'speaker_0': 'used on local and municipal purposes. Well, here's a local and municipal purpose. Workforce development. Um. I have. I've been meeting with business owners, and I've been meeting with sector leaders. Health care, oil and gas, tech industry construction folks who say they cannot get skilled workers.'",
        "'speaker_0': 'I mean, to the point to where they're really nervous and that land values are high, wages are stagnant, and so folks aren't even coming to here. So we can't recruit them in. We have to start getting them homegrown grown.'",
        "'speaker_0': 'And so I'm nervous about our workforce development. I do not believe that we do a great job connecting the next generation to our high industry, next sector leaders. And so I'm concerned about that. But more than anything, whether I'm for this or against this, I feel like the.'",
        "'speaker_0': 'Making sure that this is in line with our charter responsibilities. Seeing that the city attorney's office and those who know David Braswell does not let anything get past him that will not to ensure that we are protected, that legally we are protected in this and this.'",
        "'speaker_0': 'Ensuring that this is a local or municipal purpose is a broad stroke. But I do believe because we've done it with a Denver preschool program and we've shown that it works, that we have some ground to stand on.'",
        "'speaker_0': 'So I will be supporting this, going to the ballot, and I'll be looking forward to kind of a healthy debate with a neighbors healthy debate with folks within our community and within my colleagues. Thank you, Mr. President.'",
        "'speaker_3': 'And Cameron Brooks. All right. Starting back at the top. Councilman Espinosa, you're up.'",
        "'speaker_0': 'I was really just going to remind people that there's an alternative. There is a petition process. This can be initiated by this ordinance can be initiated through through petition, which is pretty easier. I mean, much easier this time around because of the low turnout in the last mayoral election.'",
        "'speaker_0': 'So that threshold for petitioning on the onto the ballot is far easier to to capture. And so the nice thing about petitioning is that then, you know, you have some sort of popular support, at least among 6 to 8000 residents behind your bill rather than 13 of us up on the board.'",
        "'speaker_0': 'I mean, on the council. And so that's there's another avenue. This is not the end if it gets voted to not proceed. That said, because of the comments, I do want to point out the fact that this is largely a needs based proposal.'",
        "'speaker_0': 'However, if you look at where the needs these the nonprofits that are going to benefit from this program are already running need space proposals, which overwhelmingly those those scholarships go to the northeast, in northwest, in southwest quadrants of the city.'",
        "'speaker_0': 'So to sort of pull at my heartstrings and say these these these areas don't seat received benefit. Actually, those areas are the ones that precisely do receive benefit today. This program expands that network to actually go outside of those really intensely need based areas.'",
        "'speaker_0': 'And that needs to be part of the discussion going forward. The portability, like I said before, like my colleague's story here, speaks right to what my major concern, if this were a preschool issue, everyone knows that there's a huge benefit for early childhood education that pays huge dividends for every dollar spent and that those families will persist'",
        "'speaker_0': 'in Denver for some time with those programs for year after year after year. This is for college. I mean, high school kids to go anywhere in the state, get that degree and then not necessarily return that investment to Denver.'",
        "'speaker_0': 'There is. And so that's the concern. And that's why it's sort of a net outflow of cash. I mean, if there was some sort of requirement that they spend five years like the Army, four years working in Denver, earning a head tax, then we would have that assurance that this money wasn't just going to benefit a few'",
        "'speaker_0': 'people and going out of state indefinitely. So there's a there are mechanisms to move this forward outside of this this this council. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Espinosa. I'm going to drop down to Councilman Clark, who has not had the opportunity to speak yet. Councilman Clark, you're up.'",
        "'speaker_6': 'Thank you, Mr. President. First of all, I think I want to commend all my colleagues for having a great debate over this. And that's part of what I'm looking forward to as I look forward to supporting this, that we have this debate city wide.'",
        "'speaker_6': 'So many things have been said that I agree with. And I'm just going to so I'm going to try and be quick to go through a few and touch on a few other points. As has been said, we fund education in the state at the bottom of the list as state as across the country, not just higher'",
        "'speaker_6': 'education, but K-12 education. In my estimation, we are feeling our kids were failing. The kids that grow up here, we are one of the most highly educated cities in the country. And it's not because we're we're doing a good job with the kids who grow up here.'",
        "'speaker_6': 'It's because we're really good at importing people and highly educated people. And I think it's time to have a conversation about what we all want as a community for the kids that are are being raised here. The other thing that I'll point out is I do think that some other people have talked about other things that we'",
        "'speaker_6': 'could use additional funding for. And I think that there would be broad based support as as others have mentioned, for some of these other things. But we're not debating this or something else today. What we're debating is, is this a good idea?'",
        "'speaker_6': 'And there is no crystal ball that we can look at at what our future tax needs are going to be or what the people of Denver will decide they are willing and wanting to take on as a tax burden.'",
        "'speaker_6': 'A good idea should be a good idea or a bad idea based on its merit, not what we might need down the future that's not on the board. And I feel like so I feel strongly that we should look at this.'",
        "'speaker_6': 'Independent of what we might need in the future or what we think that tax base might be. I do believe that we're not doing enough at the other levels of government at the state to fund higher education. But if if no one will act outside of this body and there is something that we can do, then I'",
        "'speaker_6': 'think that it's time that we take that conversation to the voters, because I think there are a lot of people out there who are frustrated, who don't want to live in this great city that they love so much about and know that they're they're raising their kids where we we failed to fund education.'",
        "'speaker_6': 'And so if those leaders at those levels fail to act and we can't act, then I believe that we should and we should allow the voters really to be the ones who take that action or decide that that's not what we want.'",
        "'speaker_6': 'And I think that's really what this comes down to. For less than a penny on $10, we get to have a conversation about what kind of community do we want, not what kind of community do these 13 people want, but what kind of community do we want as citizens of Denver?'",
        "'speaker_6': 'And I believe that any investment in our kids, as others have said, will pay back multiple times. So I will be voting to move this on and support it. I also just want to take 1/2 to say one other thing.'",
        "'speaker_6': 'I did grow up in this town and I'm a DPS graduate and DPS prepared me in a way that I have never seen an obstacle that I couldn't overcome. And I think that often the Denver public schools, which are not truly a part of this debate but were brought in, are thrown under the bus.'",
        "'speaker_6': 'We fund the Denver public schools. We fund K-12 education, one of the worst, worst in the country. And then we expect them to do everything. And I think that I just want to stand up here and say, I believe in our public schools.'",
        "'speaker_6': 'I believe that we should be funding them better. And I believe that we need to stop saying, hey, you need to prepare kids, because I was completely prepared. My kids are excelling as children in the Denver public schools because they're ready to learn.'",
        "'speaker_6': 'And as a community, we have to choose to lift every kid up so that they're ready for what DPS can do for them and stop expecting DPS to solve every problem and get kids through all of that and get ready for college.'",
        "'speaker_6': 'That has to be a bigger conversation than just the Denver Public Schools, because I think that the Denver Public Schools are doing great things and are preparing kids who are ready. And as a community, we need to help the Denver Public Schools lift all kids up.'",
        "'speaker_6': 'So thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilman Clark. Councilman Lopez, you're up.'",
        "'speaker_6': 'Thank you, Mr. President. I just wanted to bring some numbers forward. You look at the graduation rate and this mine, it is a few years old already, but I think the census numbers are persons age 25 plus with college degrees.'",
        "'speaker_6': 'Associates are better was hovering about 40% in this city. Let's talk about some of those communities where something like this would be a huge impact. And some of those numbers and and this is I did this I put these numbers together a while back.'",
        "'speaker_6': 'So the sum of the old council district lines. But in math, Moorpark, that's 12%. In Barnum, that's 8% in Barnum. Worse, that's 9% in Mali. That's 13% in a Westwood, that's only 6%. In Ruby Hill, it's 9%. In Valverde, that's 5%.'",
        "'speaker_6': 'And in Villa Park, it's only 7%. There is a huge gap. And you look at the poverty numbers and each one of those neighborhoods and it's drastically higher than any than than the city average. Right. It is definitely a huge gap that we have to make up.'",
        "'speaker_6': 'And these are our constituents. And we invest dollars public dollars in Headstart students preschool. Who's to say they're not going to leave Denver when they become of age? We're going to be investing all this, all this, all these resources in Headstart students.'",
        "'speaker_6': 'And then their found they can pick up whenever they want and leave Denver. We're not making them stay. We just believe in their future, no matter where it is. Right. And I think we have to offer the same respect to the ones that are already here and in college, going into college with the aspirations.'",
        "'speaker_6': 'To be educated. Think critically, because that's why we get paid and say ba, ba, ba or higher. Right. That's why they get make $1,000,000 more than someone with just a high school diploma in their career. And that's why that diploma means something, because it doesn't mean that you went to a university and spent all this cash and'",
        "'speaker_6': 'did your finals and all this other stuff. Didn't mean that you joined a frat or anything like that and had fun in college. It that diploma means that you can think critically that you know how to ask questions because that's what this is all about.'",
        "'speaker_6': 'Is that you think critically, you can ask questions, and that's what makes it so valuable. And that's what we want. It's not necessarily just about the workforce is it's it's that educated being those folks in our communities who can who who refuse to be fooled.'",
        "'speaker_6': 'And so those are the numbers that we have, the bridge. And I tell you what, you look at a map of where the sidewalks are missing, same communities. You look at a map of where there's the least amount of park space in the city, same communities.'",
        "'speaker_6': 'You look at a map pretty much of anything that we do as a as a as a municipal government. It's the same story. The kids in these communities are the most challenged. They have the they have the largest barriers against them.'",
        "'speaker_6': 'Whether it be sidewalks street paved. Dog bites in a neighborhood. Crime rates. It's the same story. And for eight years, I've studied these maps on the southwest side of Denver, on the east side of Denver, where these students are, where where they're struggling the most.'",
        "'speaker_6': 'They're struggling not just in education, but all across the board. Here's the one thing. Education makes the difference. Education is that tide that raises all those ships and asks all those questions and to hold all 13 of us accountable for where those sidewalks are going to go.'",
        "'speaker_6': 'That's why I'm joining for this tonight. I'd like to put it on the ballot. It's not perfect, but it is a start. And I appreciate what Councilman Clark said. It's not an either war. It's an end. This is an end, and we should be prepared to start asking.'",
        "'speaker_6': 'Those questions.'",
        "'speaker_3': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_9': 'I just wanted to add some clarification when this issue came to committee. Councilwoman Canete stand, Slattery was there. He did indicate in the first year that the amount that is spelled out in the ordinance is what would be in place for that first year.'",
        "'speaker_9': 'But it is, in fact, subject to change. You know, if the body, the governance structure chooses to change it in subsequent years. So I just wanted to add that clarifying point. I will reserve the rest of my comments until after we have the public hearing.'",
        "'speaker_9': 'Next week, I think we're going to have another opportunity for each of us to make our comments and to weigh in further on this issue. But I think a couple of people have already said that education is the ultimate equalizer.'",
        "'speaker_9': 'And if we don't have educated young people in our community, they're some of the people that get left behind, and particularly when they do come from low income communities. And the money that would come from a tax, if the voters choose to approve it, would further leverage the money that is already raised by the scholarship organizations, meaning'",
        "'speaker_9': 'we'd have the opportunity to serve more young people in our community to be educated. So I think giving the voters that opportunity is important. Thank you.'",
        "'speaker_3': 'Thank you. Councilwoman Ortega. Councilman Flynn. Rebecca.'",
        "'speaker_8': 'Thank you, Mr. President. Actually, Councilman Espinosa took the words out of my mouth earlier. I wanted folks to remember that these students already are receiving scholarships, that this program augments that and allows it to expand to serve additional students.'",
        "'speaker_8': 'It's not like there are no students who are receiving scholarship assistance already. I believe that we are hitching this to the wrong vehicle, however, for its funding. Just to bolster the point I made earlier, we are acting as a pass through for this tax to the nonprofit that would be organized, and I see no reason why.'",
        "'speaker_8': 'Denver Public Schools, again, if it's just a pass through, why why it couldn't be established through Denver public schools rather than the municipal government. And that's my only point on it. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Flynn. Councilman, New Year.'",
        "'speaker_6': 'Thank you. I'm just troubled about this 4000, whether it's per year or what. I can't leave here without knowing a little bit. I wonder if Happy Hayes would come up and let us know what the intention of the committee was.'",
        "'speaker_6': 'Was this supposed to be 4000 per year or a fourth or 1000 per year? I'm just dying to know.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Good evening, Mr. President.'",
        "'speaker_1': 'Members of council. It's very odd to be seen here, and so I'm.'",
        "'speaker_0': 'Relishing it if you bear with me for a moment.'",
        "'speaker_1': 'My name is Happy Haines.'",
        "'speaker_0': 'I co-chaired the task force, along with my colleague, Dr. Steve Jordan, who is here, and Barbara Grogan. So to the 4000. So the that number in the ordinance is a cap. So it is up to 4000 per year.'",
        "'speaker_0': 'Then to the point, Councilwoman Ortega, that you made about it could change. So so it's an up to 4000 for any student per year. But based on the number of students who might be served in any given year, the average number could change and the nonprofit would have the ability.'",
        "'speaker_0': 'So so for example, if the number of students that we serve in year three is dramatically higher than it was in year one, there might they might want to make an adjustment on the average award or scholarship reimbursement that is made.'",
        "'speaker_0': 'So that's the flexibility that the committee has. But the ordinance establishes and a a limit or a cap, which is the $4,000 per year.'",
        "'speaker_6': 'Thank you. So it is 4000 per year, not 1000 per year. And it sounds like the word is necessary that needs to be clarified.'",
        "'speaker_0': 'Yes, that's.'",
        "'speaker_6': 'Correct. Thank you so much.'",
        "'speaker_3': 'Thank you. And thank you, Councilman New. Any other comments on 553? As everyone else has spoken. I have not had the opportunity. Why not? I have an email in front of me that I got today. Forbes Forbes magazine ranks Denver number one place for business and careers.'",
        "'speaker_3': 'And what's interesting about that is that it's a it's a great thing to be proud of. And we differ on several different things on this dais. But I think most of us would agree that we are not producing the workforce for these careers.'",
        "'speaker_3': 'And so people talk about this from an education standpoint. I look at this, as Councilman Brooks mentioned, from an economic development and a workforce development perspective as well, because what we're doing is we are importing the talent to fill these jobs.'",
        "'speaker_3': 'And I don't believe that is, one, sustainable. And two, I think, frankly, it marginalizes those that are born and raised here. And so we have the opportunity to do something that's truly groundbreaking. And I can understand some hesitancy because nobody else is doing this.'",
        "'speaker_3': 'But I think we have put together a thoughtful group of leaders from different industries and sectors that met for months to figure out a ways to to crack this nut. And I think it's worth the discussion at a public hearing.'",
        "'speaker_3': 'I think that's worth a discussion for a vote. And I second so many different comments that people made. But I would just simply close it with you. You can make investments in roads and streets, but the greatest investment, I believe, with the greatest return is an investment in a person.'",
        "'speaker_3': 'And that ability. And when you can change a person's lifetime, these changes can sincerely be generational. If you have the opportunity to send somebody to get a quality education to fill those jobs, that changes the course of their lifetime in those moving forward, that resources should not be the reason that somebody does not go to college.'",
        "'speaker_3': 'It should be their ability. But right now, too many students. I do a leadership program every summer. And I talk to my students Northeast Demolition or what's your fear about higher education and the cost of it? And certainly we can say it is the role of the state.'",
        "'speaker_3': 'But I believe economic development is a municipal issue. We have a responsibility to deal with it. And even if you want to go with the education argument, construction defects is not our purview. Several municipalities right now are trying to correct the construction defects issue because the state is unwilling to to move forward with it.'",
        "'speaker_3': 'So you have local municipalities. So even though I don't agree with that argument, there's an example that proves if the state or higher level of government is unwilling to take a position on it and it negatively impacts our city.'",
        "'speaker_3': 'Absolutely. We should move forward. All right. So you know the comments, Madam Secretary, roll call.'",
        "'speaker_5': 'Black eye. Brooks Clark. Espinosa. Yes. Flynn.'",
        "'speaker_1': 'No.'",
        "'speaker_5': 'Gilmore. I. Cashman. I can.'",
        "'speaker_7': 'See.'",
        "'speaker_5': 'Lopez. I knew Ortega. I. Susman. Espinosa.'",
        "'speaker_0': 'Abstain.'",
        "'speaker_5': 'Mr. President, I.'",
        "'speaker_3': 'Madam Secretary, please positively announce the results.'",
        "'speaker_5': 'Nine eyes, two nays, two abstentions.'",
        "'speaker_3': '99 eyes to nays, two abstentions. Five 4553 is ordered published. All right. That's been two hour and a half later. All right. We're in next 536. Councilman Espinosa, what would you like for us to do with this?'"
    ],
    "Rezoning of 2500 Lawrence Street and 1185 26th Street with Waivers.": [
        "'speaker_0': 'Oh, thank you, Mr. President. I move the council bill 536, be ordered published.'",
        "'speaker_3': 'Oh, so you want this called out for a vote?'",
        "'speaker_0': 'Well, no, I just wanted to. I just want to make comments. Just. Just make comments.'",
        "'speaker_3': 'On my comments. All right? Go ahead. Go ahead. Make a comment.'",
        "'speaker_0': 'It's. I'm sorry. I'm just a soft talker. I'll start yelling. Alls I wanted to say here is this is a this is sort of this is going to be a bill that comes before us. I mean, a rezoning that comes before us.'",
        "'speaker_0': 'And this is what's sort of missing in this discussion is that this bill, this this rezoning comes with waivers. It significantly alters the sort of nature of that block. That said, the waivers were negotiated with the neighborhood. And you have a landowner that has agreed to design standards and has agreed to put covenants on their property if'",
        "'speaker_0': 'they were ever to sell it. And so it's sort of it's sort of the working relationship that you want on on on sort of character changing developments. So I just wanted my colleagues to know that because if you hadn't been part of the process thus far, you might not know that.'",
        "'speaker_3': 'Thank you, Councilman Espinosa. Any other comments on 536? Right seeing the one. That's all the bills for introduction. So we've got one bill for final consideration. Councilman Flynn 541. What would you like for us to do with this?'",
        "'speaker_8': 'Thank you, Mr. President. I would like to call 541 out for a separate vote so that I can abstain.'",
        "'speaker_3': 'All right, so, Councilman Flynn, will you please have 541 be placed upon final consideration and do pass?'"
    ],
    "Agreement with RTD and Western Stock Show Association for North Metro Corridor Project.": [
        "'speaker_8': 'Yes. Thank you, Mr. President. I move that council 541 be placed on final consideration and do pass.'",
        "'speaker_3': 'It has been moved and seconded. Comments. Councilman Flynn, you're up.'",
        "'speaker_8': 'Thank you. As I said last week on on first reading, I was employed at RTD and under the city's ethics code, I am abstaining from any even perfunctory matters, doing having to do with RTD for at least the six month period.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman Flynn. All right. See the comments, Madam Secretary.'",
        "'speaker_5': 'Rocco Flynn.'",
        "'speaker_8': 'Abstain.'",
        "'speaker_5': 'Gilmore I Cashman.'",
        "'speaker_10': 'I.'",
        "'speaker_5': 'Can each Lopez I knew Ortega I Susman. Black eye Brooks. I. Clark, I also i. Mr. President.'",
        "'speaker_3': 'Hi, Madam Secretary. Please close the voting as a result.'",
        "'speaker_5': '12 Vice one abstention.'",
        "'speaker_3': '12 as one abstention. 541 has been placed on final consideration and does pass. All right. I believe those all of them, we are now ready for the block votes, all of the bills for introduction, our order published. Councilman Flynn, would you please put the resolutions on the floor for adoption in a block?'",
        "'speaker_3': 'Thank you.'",
        "'speaker_8': 'Thank you, Mr. President. I move that the following resolutions be adopted in a block five, eight, eight, 547 and 587.'"
    ]
}