{
    "Supplemental Appropriation for the Mayors Office of the National Western Center.": [
        "'speaker_2': 'Lebanese. Two days, 234 has been adopted. All right, we're onto the bills for introduction 148. We had three councilmembers. Councilmembers, Flynn, Ortega, Newsome. Let me ask if there's anyone that wants this called out. Councilman Flynn, did you want to call it out?'",
        "'speaker_3': 'No, just a question, Mr. President.'",
        "'speaker_2': 'Councilwoman Ortega, question. Councilman, new question. Perfect. All right, we'll start. Councilman Flynn, you're up.'",
        "'speaker_3': 'Thank you, Mr. President. I am curious if someone from the National Western Center project. Hi. Can tell me whether the general wonder whether the money we are appropriating from the general fund is that later repaid by project funds?'",
        "'speaker_3': 'Are we reimbursed for that as as is common with other projects.'",
        "'speaker_9': 'Good evening. My name is Gretchen Haller and the city's deputy CFO and also the new deputy of the mayor's office of the National Western Center. This appropriation would be a use of approximately 1.3 million of general fund contingency that would not be repaid.'",
        "'speaker_9': 'This would otherwise have been represented in the city's appropriation ordinance that goes through each year under each budget calendar year. And it would have looked like a traditional I know we call it the long bill appropriation, but for the timing, we were not able to include it in the 2016 year budget when it went through, so this'",
        "'speaker_9': 'would not be repaid through project proceeds. An example of something that will be paid for through project proceeds would be for the project and program management and those would be capitalized will cost. These are costs to stand up general fund and similar staff to support the delivery of the project.'",
        "'speaker_3': 'Can you explain the difference a little better than that?'",
        "'speaker_9': 'Sure. When you I sometimes call it spending money to spend money, unfortunately. So we've got an $856 million project that we need to deliver much as we do deliver the capital program for public works, for which we have generally general fund full time employees similar to on the better Denver program we had, we introduced new Limited staff'",
        "'speaker_9': 'to help us deliver those construction projects across purposes. It's similar here that we need some folks on staff to be able to manage the delivery of the $856 million project. And that would be different than the folks that manage the line items for tracking the budget and the construction.'",
        "'speaker_9': 'So an example would be some of the accessory work that we do to deliver the it's the executive director position. It's an assistant to that person, it's a communications person. So they are impacting the $856 million project, but they're not overseeing the construction elements.'",
        "'speaker_9': 'Oversight of the construction elements would be a capital sizable cost.'",
        "'speaker_3': 'So in your in your opinion, this is a these are general fund expenses, not project costs.'",
        "'speaker_9': 'Yes.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Flynn. Councilwoman Ortega.'",
        "'speaker_11': 'I just wanted to ask Gretchen if you don't mind staying up there. Sorry, I can't see you be on these. Sorry. The plant here. Can you provide us a list? I don't know that you have it tonight. Of all the additional approvals that will need to come through City Council on the National Western Project as it moves'",
        "'speaker_11': 'forward.'",
        "'speaker_9': 'I can give some examples right now and we can absolutely come forward with an anticipated list for 2016. Any of the contracts that we engage would come to City Council as usual. That would be more than half a million dollars for professional services or for some of the early construction work on the horizontal infrastructure remediation.'",
        "'speaker_9': 'Anything we do for early civil engineering. So any professional services or construction contracts, more than half a million dollars will come through city council, much as any construction project for the city.'",
        "'speaker_11': 'And that includes land acquisition, correct?'",
        "'speaker_9': 'Land acquisition already came through city council through a land acquisition ordinance. So what we've committed to do is do regular updates on a number of subjects that otherwise would not come to city council triggered by a contract requirement.'",
        "'speaker_9': 'And the things that we've heard you all ask for and we can add to this list are updates on land. I believe we are scheduled tentatively and Shelley Smith has this on the June agenda. Also governance. As we move through and before we are ready with any actual contract work, we'd come to City Council with updates and'",
        "'speaker_9': 'similarly on workforce and and hiring issues relating to the delivery of the site.'",
        "'speaker_11': 'Okay.'",
        "'speaker_9': 'Thank you for.'",
        "'speaker_2': 'Thank you, councilwoman. Take a councilman new.'",
        "'speaker_12': 'Gretchen this had an had a relationship to the vote on two c, right?'",
        "'speaker_5': 'Correct.'",
        "'speaker_12': 'Because if if that had not passed, then this money would never have been asked for. Correct. So the whether it was asked in the budget now beginning or as now, it has the same effect on the contingency fund.'",
        "'speaker_12': 'Right.'",
        "'speaker_9': 'Correct? Yes. This was something that if and we are so fortunate and think the voters for the passage of to see. But had it happened occurred had it occurred earlier in the calendar year it is something we would have we would have planned for in our regular budget.'",
        "'speaker_9': 'And we are fortunate enough to be able to use contingency to plan for it now.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman new councilman Espinosa.'",
        "'speaker_7': 'I was just noting here, it's more of a comment. I mean, what does this say about our priorities that an office that manages a fraction of CD nine has a budget ten times the size of the Councilman Brooks's office?'",
        "'speaker_7': 'This noting that I just would be, you know, it just seems crazy to me because all of these contracts that you're talking about, they're going to end up right here. And so. I don't know. It just strikes me as I'm sure we are.'",
        "'speaker_9': 'We are hopeful, as was envisioned in the master plan, that this is a site that transcends Council District nine, though it is a great impact to Council District nine. But we are hopeful that this is an opportunity for us to diversify and build on our general economy in Denver, that jobs on the site will be citywide, that'",
        "'speaker_9': 'workforce and training and all the other benefits of the site are citywide.'",
        "'speaker_7': 'While it's not only ten times his budget, but it's like a quarter of the entire city council tax, you know? Right. Pretty impressive. Thanks.'",
        "'speaker_2': 'Thanks. Councilman Espinosa, Councilwoman Gilmore, you're up.'",
        "'speaker_5': 'Thank you, Mr. President. I wanted.'",
        "'speaker_9': 'To respond to.'",
        "'speaker_5': 'My colleague, Councilman Ortega's request. We have been working very closely with Gretchen and her team Kelly Lead and Jeff around the acquisition side and making sure that IT Finance and Services Committee, they are coming forward every quarter to report on new updates.'",
        "'speaker_9': 'Unfortunately, the second.'",
        "'speaker_5': 'Quarter there was internal work being done. And so we look forward to having you at the Finance and Services Committee in June. And then I.'",
        "'speaker_9': 'Believe Kelly Lead is going to start.'",
        "'speaker_5': 'Up his electronic newsletter again. And so there will be additional updates that are coming forward. Thank you, Mr. Chair. Mr. President.'",
        "'speaker_2': 'Excuse me. Thank you, Councilwoman Gilmore. Councilman Brooks.'",
        "'speaker_7': 'Yeah, thank you, Mr. President. I just wanted to make a couple comments. I appreciate my my colleague here, Mr. Espinosa, but this is a local project. This is a project with global reach and local focus. And it's like none other we've ever seen.'",
        "'speaker_7': 'And so it's a it's an incredible investment. I had a lot of folks comment on this particular bill coming through. My view of it is it's real. Now, this is $1.3 million to take care of the administration and legal help as well.'",
        "'speaker_7': 'And we are investing that in the general fund. But the question was, and I think some of my colleagues have help answer it, but just to be very clear, those dollars from to see can they be used for administration.'",
        "'speaker_7': 'Administrative help, administrative administration of the facility.'",
        "'speaker_9': 'No, not. And I'll add, I would want to defer to the attorneys that helped us draft the ballot measure on this one.'",
        "'speaker_7': 'Great.'",
        "'speaker_5': 'It's really a gentleman with the city attorney's office. That's what you're really asking, is a federal tax question as to how those proceeds can be expended. We would have to use.'",
        "'speaker_9': 'Proceeds from the taxable bonds, which, of.'",
        "'speaker_5': 'Course, we're trying to limit how many how much taxable debt we have to issue because it's has a higher interest rate. And then, of course.'",
        "'speaker_9': 'You're paying interest.'",
        "'speaker_5': 'On those because they are not otherwise capital sizable with tax exempt debt.'",
        "'speaker_7': 'Does that help? Yeah. So legally we could.'",
        "'speaker_5': 'Legally you could, but only with the taxable portion.'",
        "'speaker_10': 'Of the proceeds.'",
        "'speaker_7': 'Financially, it wouldn't be prudent. For us.'",
        "'speaker_5': 'It doesn't seem.'",
        "'speaker_1': 'Good.'",
        "'speaker_5': 'And working and working with Gretchen's team, this is the kind of these are the kinds of expenses in a lapsing budget that we're being really transparent about, that we pay that we pay out of general fund.'",
        "'speaker_7': 'Yes. So, you know, I just wanted to get that back to constituents in District nine and throughout the city of Denver. It's important that they understand what these funds are used for and the issue with using taxable funds.'",
        "'speaker_10': 'And this is actually.'",
        "'speaker_5': 'A really transparent way to do it, in my.'",
        "'speaker_7': 'Opinion, and also one in our even know date. Just know that I'm there once a month. We have open and public meetings around all of our agenda items and issues that we're doing for this year for the Executive Committee of the National Western Center.'",
        "'speaker_7': 'And that is on the third Thursday.'",
        "'speaker_9': 'You know, I apologize. I don't have that calendar in front of me, but that is something that we can send out. There are public meetings for the Executive Oversight Committee for the National Western Center. I would add that our partners are there equity partners in the site.'",
        "'speaker_9': 'Colorado State University and the National Western Stock Show and Western Stock Show Association. They are taking similar measures to stand up teams around the delivery of the site in addition to their equity participation for the construction of the project.'",
        "'speaker_9': 'I know that National Western is hiring an owner's rep right now. CSU is adding members to its team and those costs are being paid for by each entity individually. Yeah.'",
        "'speaker_7': 'It's the third Thursday of every every month in the web building and Councilman Cashman would be excited to know that it's public comment as well. So folks can come and, you know, comment on what they've heard. But we want to we want to let everyone know this is a completely transparent process and we think the voters for'",
        "'speaker_7': 'being a part of it. Thanks.'",
        "'speaker_2': 'Thank you, Councilman Brooks. Councilman, new.'",
        "'speaker_12': 'I guess I just think you've did a great job with the budget for this. And and I want to assure my colleagues, I went over all the figures with them with a fine tooth comb and they did a super job.'",
        "'speaker_12': 'And I did not see any kind of supplemental appropriation for Councilman Brooks budget at all. I just want to make sure the public. No, no, no, that's not happening. So congratulations on a great job and I know this will be very successful.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman there, Councilman Cashman. I knew you're going to ring it.'",
        "'speaker_8': 'Thank you, Mr. President. Well, I. I very much appreciated Councilman Espinoza pointing out the poverty situation in Councilman Brook's budget. And I have a $20 bill. I'd be glad to pass his way any time that can be helpful.'",
        "'speaker_8': 'And also to defame Councilman Brooks for his support of the concept of the importance of public comment. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Cashman. All right. I think that was everyone on 148. Thank you, Gretchen. All right. Our next one was 147. Councilman Flynn, what would you like for us to do with this?'",
        "'speaker_3': 'Thank Mr. President. Just a brief question, if I could, Angela, would you be willing to add one of these we addressed in an email earlier? But it seems that, Mr. President, this is a project to add an onramp to southbound I-25 from from southbound Broadway, one that is sorely needed, because everybody knows the left turn there under'",
        "'speaker_3': 'the highway is is pretty miserable and backs up traffic. So it's very well needed. But I was concerned that we don't yet know the scope of the property acquisition. There's a number of buildings along that strip between exposition and Ohio and we don't know how many buildings we're going to have to acquire yet.'",
        "'speaker_3': 'And how will that affect the budget?'",
        "'speaker_9': 'Right. So we are still in the process of engineering this project and that's why they don't have the full extent of what the land acquisition will be.'",
        "'speaker_1': 'Mm hmm.'",
        "'speaker_3': 'Okay. And finally is see that building the project and we are a funding partner. Are we taking the lead on this?'",
        "'speaker_9': 'I'm going to ask Janice Finch to come up here and answer that question.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'Good evening, Janice Finch from Public Works.'"
    ],
    "Intergovernmental Agreement and Funding for I-25 and Broadway Interchange Reconstruction Project.": [
        "'speaker_7': 'This is a project that is funded through federal funding, that goes through seed, through Dr. Kong, the Regional Council of Government, and then to Denver. And we are actually building it.'",
        "'speaker_3': 'We are building it, yes. Even though it's it's affecting the state highway. Thank you. We are okay. That's all I need.'",
        "'speaker_2': 'Thank you, Councilman. Thank you, ladies. All right, that was it. Soon we are moving on to the block votes. All of the bills for introduction are ordered published. Councilwoman Sussman, would you please put the resolutions on the floor for adoption in a block?'",
        "'speaker_5': 'I certainly will. Mr. President, I move that the following resolutions be passed, be adopted, they all or series of 2016. They are resolution 186 187 180 8167190233193.'",
        "'speaker_2': 'Thank you. Moved and seconded. Seeing no comments. Madam Secretary, roll call.'",
        "'speaker_6': 'Flynn I Gilmore. I Cashman. I can each. Lopez. I knew Ortega. Sussman Black Eye. Brooks. Clark. Espinosa.'"
    ],
    "I-25 and Broadway Station Area Plan Adoption.": [
        "'speaker_13': 'Here with me tonight, we have from RTD, Bill Savoy and Kate Iverson from Civitas. Our consultant team, Chris Perris and Jason Newsome. Jeff Walker, who was on the steering committee as an RTD board member, as well as Ryan Winterberg in community planning development.'",
        "'speaker_13': 'I say dedicated because they are here tonight. Oh, and Janice Finch from Public Works, you already heard from because they are all here and really helped deliver the plan that you'll hear about tonight. Christopher Parisotto and his wife are expecting a baby any moment, so he's here.'",
        "'speaker_13': 'Despite that, Janice Finch just returned from vacation as he was literally on vacation this morning. She came back for this. And Ryan is a graduate of University of North Carolina who will be playing basketball in the national championship in a few minutes.'",
        "'speaker_13': 'So she's very anxious right now. So without further ado, let's dove right into the stationary plan with a map of the station area itself. I'm sure you're very familiar with this area. I 25 Broadway station near the interchange of I-25 and Broadway.'",
        "'speaker_13': 'The station itself has been there for over 20 years. It was actually the end of line station for the first RTD light rail opening up in the mid-nineties. A lot has changed since that time. The Gates factory site has been cleared since 2000.'",
        "'speaker_13': 'RTD is out of the Southeast and Southwest extensions. So now the I-25 and Broadway station is in the middle of the RTD rail system with the stationary plan in particular. We started this effort last March. I did a lot of the heavy lifting over the summer and early fall with our public outreach and actual plan production.'",
        "'speaker_13': 'Phase three was in the fall and winter where we actually worked on delivering the plan itself and began the review of a public review draft and planning board drafts leading to planning board approval last month. And now we're here with you tonight for adoption.'",
        "'speaker_13': 'The outreach process that was advised by the taskforce, I think, was very robust and encompassing a lot of legwork done upfront by them with individual interviews with our steering committee and other stakeholders. We had three public workshops, a newsletter email list.'",
        "'speaker_13': 'I think number now is at 471. People signed up to hear email blasts from us. We had media outreach to the three public workshops I believe had new stories by the local TV stations. A Senate committee was really the linchpin of the process.'",
        "'speaker_13': 'We had five RINO's on that steering committee. Various property owners, including Broadway station partners, owner of the gate site and D4 Urban owner of Broadway Marketplace agencies and organizations such as Walk, Denver, Bike, Denver, RTD staff and RTD directors that started in Councilmember Nevitt district.'",
        "'speaker_13': 'And then when that changed over to Councilman Clark, he's been leading it since that time. Here's a quick image of those neighborhoods. It is in the Baker neighborhood, but it is really at the kind of intersection of multiple neighborhoods that really kind of claim the station as their own.'",
        "'speaker_13': 'And we heard loud and clear through the planning process that improved access to the station was a key need for this location. And here's a quick snapshot of the workshops. Workshop one in Top Right Corner. It's actually a walk shop where we actually walked through the rain last June and illustrated the difficulties of moving east, west and'",
        "'speaker_13': 'even north south through this area and to the station. We learned through those public workshops that the two decision typology identified in her two D strategic plan, which really relates back to the comprehensive plan in 2000, where that called the station out as an urban center.'",
        "'speaker_13': 'As far back as at that time, that the urban center designation still makes sense for this location. If you look at the kind of elements of a urban center in that strategic plan, we call out things such as shared and structured parking, an employment focus, smaller program, plazas and open space, high ease of use, bicycle infrastructure, high'",
        "'speaker_13': 'frequency transit and pedestrian infrastructure. I think if you look at the plan from covered to back, you'd see these type of elements reoccur over and over again with our recommendations. Out of that urban center designation. We worked on a vision and principles that identified the station area plan, creating a connected, resilient, vibrant and transformative multimodal hub that'",
        "'speaker_13': 'renounced the stationary station area and the fabric of the city, and identified four key principles that are connected, resilient, vibrant and a multimodal hub. We also had eight transformative projects identified throughout the plan document that really are the big ideas that would move the plan forward.'",
        "'speaker_13': 'I won't run through all the recommendations for you today, but I think I'll try to highlight some of the key ideas, mainly through a series of maps and those transformative projects. So in our connected section, we identify a new street network as, you know, with the Gates site.'",
        "'speaker_13': 'There are lack of infrastructure. So this is identifying a new street network within the station area. And really just as important, maybe more important is the pedestrian bicycle facilities, a framework which really is showing a much more robust multimodal access to the station and through the station area from the west and the east.'",
        "'speaker_13': 'Key transformative projects that kind of highlight the connected section is starting with Mississippi Avenue. So if you're familiar with Mississippi, it has a multi-use path within the station or on the north side. The recommendations speak to improving the underpass condition, probably most importantly, extending the path west into Ashmore Park, which would not only improve connections of the'",
        "'speaker_13': 'neighborhood but also to the parks, which is a Ruby Hill and pavilion. And then also kind of in that same vein, a new connection to the South Park River Trail on the north side. So that would eliminate a crossing of Mississippi and make it easier to get to the trail and again, to those recreational amenities.'",
        "'speaker_13': 'Staying on the west side of the station area, we have a another project called Exhibition Avenue. This is actually a right of way that is just not being utilized right now within that industrial area. And if we could reclaim that and turn that into a multimodal street, that greatly improved our connection to Atma Park.'",
        "'speaker_13': 'Moving to the east side of the tracks, east side of the central rail line. We had the Exposition Gateway Project, which is a new street at South Broadway in exposition on the west side of Broadway. So this would be a new multimodal entrance into the station area.'",
        "'speaker_13': 'Connecting to a feature back street would run north south into the the station. And another one is a signature shared U Street. This is kind of the heart of the redevelopment of the Gates site, where they call for a new North-South street running parallel to Broadway.'",
        "'speaker_13': 'Very much a pedestrian and bicycle emphasis on this street, as you can see with the image on the bottom of the screen of an idea of a very much a shared use public street. And then finally it was connectivity.'",
        "'speaker_13': 'Again, this is an important aspect of the plan. Call it three kind of levels of improved kind of connections here with this project. One, being a pedestrian bridge over the consolidated main line, the tracks. Second, a multi-modal bridge over the South Platte River at approximately the Kentucky alignment.'",
        "'speaker_13': 'So improving access into the former Gates site. And then finally, a signature pedestrian bicycle bridge that would provide that high ease of use bicycle connection that we're looking for going on to our resilient section. This is where we have economic resiliency, environmental sustainability and social sustainability called out.'",
        "'speaker_13': 'I just want to note really quick with the proclamation on the fair housing that we do have for housing recommendations in Section three of this, part of the plan focused on making sure we're meeting the intent of the IATO.'",
        "'speaker_13': 'Other elements of the section include Vanderbilt Park. Right now Vanderbilt Park East is a dedicated park, but it would not be identified of that if you just looked at it. It is essentially a vacant land. So this has recommendations on the design of that that park space and then improvements to Vanderbilt Park West, which is a heavily'",
        "'speaker_13': 'used recreational park, but could have improved kind of passive elements to it. Moving over the vibrant station, which is talking about how the station should be a mixed use district. That's the heart and gathering place of the neighborhoods as well as a regional destination.'",
        "'speaker_13': 'This is where we have our land use map blueprint. Denver does call this station to be a Todd Islands designation. This is a refined land use framework that looks at here in both residential and office components, as well as an industrial mixed use element to the south of Vanderbilt Park to help activate that park space.'",
        "'speaker_13': 'Proposed building heights ranging between five and 16 storeys. Another thing we definitely heard from all the stakeholders was that the West Wash Washington Park view plane should be adhered to in this area. So this map really represents that as well as appropriate zoning district heights that align with that viewpoint.'",
        "'speaker_13': 'And then finally, with a transformative multimodal hub section, we have the connected section. At first it's all about access to and through the station area. This is more focused on the actual transit interface and making sure that we maintain the the high level of access to the to the trains and all modes actually in the station areas'",
        "'speaker_13': 'is an important part of the RTD system. So we have recommendations relating to urban plazas. So this is an image of an improved transit plaza space. I would help improve that that that intermodal part of the station for not only bus commuters or pedestrians and bicyclists, but as well as commuter parking.'",
        "'speaker_13': 'And then we also have a civic plaza space. So as redevelopment occurs in the station area and it does start to become more of an urban center and a midtown destination, here's the heart of the stationary and a civic plaza space.'",
        "'speaker_13': 'And also from a design standpoint, trying to improve kind of the underutilized spaces. Another project is this I-25 overpass, where we look at taking the existing condition of that over the under the overpass area and improve it with amenities, maybe potentially some retail artwork or even a bike station that includes a lot of important commuter facilities like'",
        "'speaker_13': 'repair or shower facilities, etc.. Quickly to recap, our planning board public hearing summary planning board did vote to approve the plan unanimously on March 2nd. Based on a plan, the consistency of criteria with plan, consistency, inclusive public process and a long term view.'",
        "'speaker_13': 'We did take public comments and testimony during that public hearing. We heard positively from Arthur Moore Park, West Wash Park, Baker and Platte Park. Arnaud's in your packet, you should have had letters from Baker and Platte Park and via email today.'",
        "'speaker_13': 'West Wash Park. A majority of comments we heard at that public hearing were about East-West connectivity and parking. So I just want to bring those to your attention with East West connections. As I mentioned before, this really was the number one thing we heard throughout the process and that we needed improved multimodal connections to the station and'",
        "'speaker_13': 'through the station area. We have multiple plans that address that critical need as many of those transformative projects outlined and we do in our our moving forward section are implementation section and call for a next step study that public works is already scoping.'",
        "'speaker_13': 'And I would anticipate anticipate be in the 2017 caps from them. And then parking something we heard both from comments from neighborhoods and commuters that parking is critical here that we need to get it right at the station.'",
        "'speaker_13': 'So there's multiple plan recommendations to address these concerns. We're really trying to have a balancing act here of maximizing transit access with placemaking potential. We can't have too much parking or too little parking or we're going to get it wrong.'",
        "'speaker_13': 'So the planning recommendations really focus on allowing flexibility to manage parking over time. It's going to change significantly. It's changed a lot in last 20 years. Imagine 20 years in the future, a demand not just for commuter parking, but for the parking for the uses on site are going to evolve.'",
        "'speaker_13': 'So there's a priority recommendation related to a comprehensive parking management strategy in the plan. And that really requires immediate and and kind of well coordinated action between all of our stakeholders, including the city, RTD and the property owners.'",
        "'speaker_13': 'And reality, it's not just one strategy. It can be a phase set of strategies. Over time, I'll be working to balance that parking solution. So with that, the staff recommendation is to adopt the 25 station area plan as a supplement to the Denver comprehensive plan here for any questions.'",
        "'speaker_2': 'Thank you very much. All right. We've got seven speakers and I'll just I'll call all seven. You can make your way to the front pew. Jeff Walker, Bill, Sarah Kim Q Sarah Charlotte, Winsome Bird, Sarah McCarthy, Gertrude Grant and David Roybal.'",
        "'speaker_2': 'So you seven can make your way up and Mr. Walker.'",
        "'speaker_8': 'Excuse me. Good evening, everyone. This man. My name's Jeff Walker. I'm on our TDS board. I represent District D, District D actually starts south of Broadway station. It starts at Mississippi in Florida and head south from there down to the Englewood border.'",
        "'speaker_8': 'Pretty much. I'm speaking as my role on the board, not for the board. I did participate on the steering committee and I was very pleased with the amount of public participation that was offered, the amount of public comments that were received, especially in December.'",
        "'speaker_8': 'And so. So my thoughts on this is that I, I am in favor of the plan. I think that the connectivity is is greatly enhanced by the connections over the South plant. The number one issue that I've heard about is the parking situation.'",
        "'speaker_8': 'I totally understand that sometimes I parking neighborhoods in the neighborhood just to the east of Louisiana, Pearl like I did today. I also use that station. Sometimes I have to park at the farthest reaches of the parking lot, about 800 feet.'",
        "'speaker_8': 'I totally understand the concerns that that that I've heard about the distance from the platform to the parking. But what's important to remember is that any proposal for development will have to go through the RTD board. That's another opportunity for for public involvement.'",
        "'speaker_8': 'So this is a broad plan. Anything that comes before the board, the RTD board will be very specific. And that's when that's what the devil rides right in the details. So that's what we hope to have a whole lot of public involvement at at that level.'",
        "'speaker_8': 'So those are my comments. I appreciate the work that you've put in and the work that the staff has put in both our TDs and the cities and especially the that the work of the citizens and the residents of the neighborhood and the surrounding neighborhoods.'",
        "'speaker_8': 'Thank you very much.'",
        "'speaker_2': 'Thank you, Bill Cerar.'",
        "'speaker_7': 'Good evening. My name is Phil Savoy. I am the senior manager for Transitory Communities and I'm available to answer any questions that council may have.'",
        "'speaker_2': 'Thank you. Can you share?'",
        "'speaker_9': 'Hi. My name is Kim Kaiser. My address is 1660 Lincoln St number 1800, and I'm here to read a statement on behalf of Broadway Station Partners. They are the owners of the former Gates rubber factory site. They wanted to share with you that Broadway station partners was integrally involved in the station area planning community process, including sitting'",
        "'speaker_9': 'on the stakeholder committee. Broadway station partners worked closely with the city to provide feedback. Overall, that feedback was generally well-received, and at this time, Broadway station partners offer support for the station area plan, and they encourage you to support that plan this evening.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Thank you. Charlotte Winsberg.'",
        "'speaker_6': 'Good evening. My name is Charlotte Winsberg. I live at 590 South Sherman Street. I'm a board member of the West Washington Park Neighborhood Association. And on the zoning committee today, our board, by email, passed a resolution to support the Broadway station plan with a vote of eight in favor, zero against ten, zero abstentions.'",
        "'speaker_6': 'First of all, we'd like to reiterate what other people have said about David Jaspers and Chris from Civitas. Being so open to working with neighborhoods, everybody had ample opportunity to be heard and they listened and that was one of the most impressive planning experiences I've had.'",
        "'speaker_6': 'Some of the improvements made to the plan based on the input just from West Wash Park are as follows refined a provided more explicit definition on where the station plan supercedes, neighborhood plans, location of income, diverse housing, the boundaries of a core station area.'",
        "'speaker_6': 'They added the 2008 I-25 interchange project in its conclusions, including stoplights, pedestrian access across Ohio. It said to the plan they included verbiage to reflect the aims of the city beautiful initiative. Add an emphasis to access to Ruby Hill as well as West Marsh Park and added language to include nearby residential blocks as required noise protection from'",
        "'speaker_6': '. From the Broadway development. We feel it's a good plan, but it's not a finished plan. As the previous speakers have talked about the concerns about connections to the West End parking plans. They they're just too vague. This there are people standing in the wings waiting to complete the purchase of these properties and start digging holes and have'",
        "'speaker_6': 'both the parking plans and the connections to the east. West aren't put down in concrete. Pretty soon they won't be possible. Somebody's going to build something just for the best bridge could go up. The parking plan. It's so vague.'",
        "'speaker_6': 'We've already lost the 250 spaces when they closed the parking at commuter parking at the Alameda station. Nobody knows. I think I know what the parking plan is. It's the West Washington Park neighborhood east of Broadway. People. Commuters have been parking there for years and I expect it given the opportunity.'",
        "'speaker_6': 'This property will not be developed to park the cars that come in and out of there. And I really encourage council to put pressure on planning to get that done as soon as possible before it's too late. And that's basically about it.'",
        "'speaker_6': 'This has been a very good experience. We've been through so many Todd plants in the last ten years and most of them came along pretty well. But this one was probably one of the best experiences with the people we worked with.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'Name is Windermere. Sara McCarthy.'",
        "'speaker_5': 'Council members. Good evening. I'm Sarah McCarthy. I live at 374 South Clarkson Street. I'm here tonight to applaud the efforts of the consultants Civitas, as well as the city planning staff who were receptive to many of the ideas and suggestions as they develop this proposal, especially on how to incorporate the city beautiful principles of enhanced vistas and'",
        "'speaker_5': 'recreational activities into 21st century developments. I'm aware of the redevelopment pressures blowing down the necks of the city staff, but two very important planning details remain missing from the plan. The genuine increase connectivity from Broadway across the South Platte River Drive near Lappin Street, and as mentioned elsewhere, the detailed parking management plan.'",
        "'speaker_5': 'The city's known for ten years that this was coming, and yet these two critical aspects have been given minimal attention. And the city planning board has had mere weeks to study the 90 plus page document that is going to impact hundreds of thousands of people over the next 50 years.'",
        "'speaker_5': 'This is a complex geographic area of Denver that has a very long history of congestion. Reaching back to the 1870s, congestion along today's Santa Fe Drive prompted farmers in 1874 to request the county build a new road into Denver so they could deliver their produce.'",
        "'speaker_5': 'After several years of discouragement hearing. It's too hard. It's too expensive. Residents dragged a log. Up and down what is now Broadway and others planted trees almost immediately. Congestion exists today, and if you want a free high drive on Mississippi, west of Broadway, around 330.'",
        "'speaker_5': 'But this connectivity issue across Broadway has minimally changed since 1910, when the underpass was built along Alameda under the railroad line. Are we fooling ourselves that this plan is visionary? Despite multiple references about the importance of connectivity. I'm here to observe that the emperor has no clothes.'",
        "'speaker_5': 'No new passages proposed, whether for vehicles or pedestrians, to connect Broadway through the station to the west side of the South Platte River Drive near Lappin. When 60,000 new vehicle trips are expected. I wish the plan were visionary, but unfortunately it tweaks the status quo.'",
        "'speaker_5': 'When I asked why, I was told, it's too hard. It's too expensive. Despite good intentions, the proposed plan lacks vision to increase connectivity.'",
        "'speaker_2': 'Ms.. McCarthy Your 3 minutes is up, ma'am.'",
        "'speaker_5': 'And continues Denver's unfortunate history of segregating the East Side and the West Side. Thank you for your time.'",
        "'speaker_2': 'Thank you. Gertrude Grant.'",
        "'speaker_5': 'Good evening, Council representatives. My name is Gertrude Grant. I live at 242 South Lincoln in Denver, and I've lived there since 1977. And ever since 1977, I've been trying to get on the Platte River bike trail, and it's almost impossible.'",
        "'speaker_5': 'I raised two kids, tried to take them on bike rides from our house on the east side of the river over to the west side. And I think it's a shame that there is nowhere in this plan a top priority of enhancing pedestrian and bicycle connectivity from the west to the east and the east to the west'",
        "'speaker_5': '. Right now you go zig zag, zig zag in the plan, and it's as though it's an afterthought. And I'm just very disappointed that nobody seems to say pedestrians and bicyclists matter more than cars, and it's going to be too late.'",
        "'speaker_5': 'You approve this plan? Day after tomorrow, the zoning will be approved. The day after that, the land will be sold to developers and it'll be too, you know, quite expensive, as Sara said, in order to make these bicycle and pedestrian connections possible.'",
        "'speaker_5': 'I am on the West Washington Park Neighborhood Association board. I reluctantly voted to support the plan because a lot of people worked really hard. But I. And I think it's. A good plan, but it doesn't go far enough.'",
        "'speaker_5': 'And I think you folks are the ones that that have the clout to tell the city planning department to get going instead of talking about pedestrian and bicycle priorities. Do something about it. Thank you.'",
        "'speaker_2': 'They gave us Grant. David Roybal.'",
        "'speaker_7': 'Hello. My name is David Roy Ball. My address is 2107 South Jason and Lucky District seven. I just want to express I wish the activist groups had open platform at the cabinet in the community meeting like they did at Kepner for the podcast.'",
        "'speaker_7': 'The Way Family and I want to speak on this because I've been to the community meetings and all the community meetings have supported this and this is a very, very big plan that is going to mean a lot for the future of Denver.'",
        "'speaker_7': 'One thing I saw is like the bridge that's coming through. You know, I just you know, it took a plan like that for a bridge to bring the isolated community, because I feel the Sun Valley deserves a bridge between eighth and 30th Avenue.'",
        "'speaker_7': 'There's already two organic food stores in that area. And I know when this plan come through, it's going to capitalizes on more businesses than than communities that have a lack of businesses and a, you know, food, access to food.'",
        "'speaker_7': 'And one thing that concerns me is just the more input of residents from the age of low income and the affordable housing within this area. And I just feel that this plan happens in 20 years. It's going to be a a place where it's not very social.'",
        "'speaker_7': 'People don't speak. And everywhere I go, you know, raising consciousness, awareness of the history and culture in these redevelopments, you know, it's really it's really taken away from the culture history of people that built their legacy here. And I just want to just also want to say, you know, I hope that this is the right plan for'",
        "'speaker_7': 'Denver. I hope that this community is something great. And there's a lot going on from the I 25, the expansion, the Cedar and the Mississippi. And there's just so much going on. Same as the National Western. There's already two projects going on within this and I just hope it gets more overlooked in and hopefully these projects get'",
        "'speaker_7': 'finished before the ground breaks. And I thank you for your time, members of council.'",
        "'speaker_2': 'Thank you, Mr. Roybal. That concludes our speakers. Now time for questions from members of council. Councilwoman Ortega.'",
        "'speaker_11': 'I wanted to ask someone. I'm not sure who the appropriate person is. If the bridge that will be built across the river will have pedestrian and bike access to get people across.'",
        "'speaker_13': 'Sure. If I could maybe bring up a map might be helpful to illustrate some of the the connections that we're highlighting in the plan. So the maps in the bottom right corner. But this illustrates some of the the key connections to the station from a pedestrian and bicycle standpoint.'",
        "'speaker_13': 'So where the red circle is, that's identifying a location for a new pedestrian and bike bridge over the tracks connecting both sides of the gate site. The there's also a second pedestrian bike bridge to the south of that there's are two pedestrian bridges going across the tracks.'",
        "'speaker_13': 'We also have a this multi-modal bridge over the Platte River.'",
        "'speaker_11': 'That's what I'm talking about.'",
        "'speaker_13': 'Yeah. So that's a vehicular bicycle and pedestrian bridge. The image there kind of shows that where you have a dedicated pedestrian and bicycle, like a cycle track. Essentially what we have outside here on Bannock on this bridge, that's an idea.'",
        "'speaker_13': 'So that would be a truly separated facility for for bicyclists from vehicular traffic, but it would have all modes on it. And that's going between South Platte River Drive and.'",
        "'speaker_11': 'How many lanes of traffic will that have.'",
        "'speaker_13': 'The plan doesn't design the bridge to that degree. So I couldn't tell you, for example, for certain.'",
        "'speaker_11': 'Factors in a certain swath over the the river or.'",
        "'speaker_13': 'Just a general location, approximately the alignment of Kentucky. Okay. But it doesn't prove that vehicular access to the gate site.'",
        "'speaker_11': 'So can you tell me if it is proposed that the developer doing the project on the gate site is responsible for building that bridge? Or is there an expectation that Denver will apply for the appropriate funding and Denver will take on building that bridge?'",
        "'speaker_13': 'Sure, the plan doesn't identify who would be building the bridge. I think that is going to be coming forward as entitlements come forth with after this plan, you would see zoning and then ultimately a development agreement between the city and Broadway station partners.'",
        "'speaker_13': 'And I think you'd see those details at that time. Right.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilwoman Black.'",
        "'speaker_5': 'Hi. I have a couple of questions for you also. Can you explain the role of this plan that it's not binding? For example, Councilwoman Ortega brought up the size of the bridge. This is just more of a guiding document.'",
        "'speaker_13': 'Sure. Yeah. It's important to note that as a stationary plan, it's a visionary document. It's not as high level as the comprehensive plan or blueprint, Denver, but it is a supplement to the comprehensive plan. That's what we're asking you tonight, is to adopt it as a supplement to the comprehensive plan.'",
        "'speaker_13': 'So it does just provide guidance for future activities such as a rezoning or other infrastructure improvements on site. So it's at a higher level. The key there is we're trying to take the community vision that we gained from the steering committee and the public workshops to identify those high level ideas and hopefully set in motion implementation of'",
        "'speaker_13': 'the plan over the coming years.'",
        "'speaker_5': 'Okay. Thank you. And can you also remind us what the boundaries are? I know Ms.. Grant was talking about getting from your house. I think you said 242 South Sherman. Is is that part of the plan?'",
        "'speaker_13': 'So if we look at the map excuse me, the solid line that that's showing, they're bounded, bounded by center Broadway, Mississippi and Huron, which was the Corps station area. And where recommendations related to land use, building heights and urban design were focused on the dashed area, which extends further out.'",
        "'speaker_13': 'Dakota, Logan, Arizona and Lapan included multimodal recommendations. So those are the bike and pad and vehicular access recommendation because obviously it's a network, it's expanding out beyond there. The the areas. It has a lot of planning. It's already occurred.'",
        "'speaker_13': 'So I mean, we tried to focus specifically on the station area for a lot of the key recommendations and other stationary applying. For example, Alameda has actually shown on this map, Alameda stationary is right here. There's been a stationary plan that has been adopted for that.'",
        "'speaker_13': 'We have a neighborhood plan for whitewash park, etc. So we want to focus a lot of the recommendations on the station itself and making sure that it is either where there's overlap or a conflict between plans that would rectify that.'",
        "'speaker_5': 'Okay. So, Ms.. Grant, I just want to say that the City Council and the Mayor is very dedicated to mobility. And so I don't think that we've abandoned you, but the whole city needs it. So we only have so many resources, but we agree with you.'",
        "'speaker_5': 'So that's all I have for you. I have a question for you, Mr. Walker. Thank you. Hi. You said that our TDI board would have to approve any proposal. So is that for the private property? Does RTG have to approve private development?'",
        "'speaker_8': 'No. I'm sorry. I wasn't clear the property that RTD owns. I imagined that we would be consulted, the referral agency, possibly to any development on private property. But I was referring to the property that RTD owns.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman Black. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. Janice, perhaps you could join with either Bill Savoy or Jeff or Director Walker, but do we know and I asked you this out in the hallway during the recess, how will the bill that we just the agreement we just passed with CDOT on the I-25 southbound on ramp, how is that going to impact'",
        "'speaker_3': ', if we know? And David, maybe you can weigh in also, how will that affect this plan? Because it seems to me that that's a big piece of infrastructure that's kind of cutting right through part of the north part of this area.'",
        "'speaker_3': 'Have we accounted for that in the plan?'",
        "'speaker_13': 'Surely see if I can bring up another map for you. Maybe that's why I believe what you're. This area that would be just north of I-25, on the west side of.'",
        "'speaker_3': 'Yes.'",
        "'speaker_13': 'Of Broadway. Is that correct? Yeah. So, you know, for example, I mean, the exposition, the new street between Broadway and Bannock would be just north of that. So that is starting to take into account the the reconstruction of Broadway and in the wedge ramp, as it's called, that connects there.'",
        "'speaker_13': 'We don't have and if we go to the land use map really quickly. Hmm. We just called that out as to the office. So we don't have a lot of specificity, specificity, details of that. That's the word. Always getting the hang of it if you use that multiple times, never works details for that area.'",
        "'speaker_13': 'But in the plan itself, I believe in multi-modal. So somewhere around page 66 or 68, we do call out a potential for structured parking in the future as redevelopment occurs. And I believe it's somewhere in that general vicinity.'",
        "'speaker_13': 'So that's an example of the plan starting to think forward. But we don't have enough details besides that.'",
        "'speaker_3': 'Right. And you're actually anticipating my next my next volley of questions. But before I leave this, I noticed that none of these diagrams show what we know is a project that we're going to do, which is that wedge ramp.'",
        "'speaker_3': 'And I find that curious. Well, why it's not on there. Oh, well, let me let me let me get to the next question then about parking and you get to my I actually wrote these down RTD, maybe Bill.'",
        "'speaker_3': 'Sure, I can remind me, but it seems to me that RTD had a policy of basically being held harmless when when a project impacted the number of parking spaces at a station that we deemed necessary to operate. That stated that we.'",
        "'speaker_3': 'Forgive me, I don't work at RTD anymore. At RTD deemed necessary to make that station function that they had to replace it in kind. Is that going to be the case here?'",
        "'speaker_7': 'You know, just to add, I mean, to respond a little bit to your question before as well, we have been working with the city and the public works staff on, you know, the design for the wedge ramp. And we knew there's going to be impacts during construction.'",
        "'speaker_7': 'But I think both city and RTD are on the same page that any permanent impacts will be dealt with.'",
        "'speaker_13': 'I mean.'",
        "'speaker_8': 'The city will provide.'",
        "'speaker_13': 'Replacement parking to deal with any permanent.'",
        "'speaker_7': 'Loss to parking as a result of the wage ramp.'",
        "'speaker_3': 'Project. Now, I saw when I read the plan and just just so you know, and I mention this to Janice and some others that in fact, Director Walker, I forwarded an email to you from a constituent very concerned, a constituent who uses that station all the time and was very concerned about the very vague language about how'",
        "'speaker_3': 'we're going to replace. And what I saw in there as far as RTD policy, it was that half of the parking replacement should stay within 600 feet of the station center. 75% or the next 25% should be within 900 feet and the rest can be about 1500 feet.'",
        "'speaker_7': 'Was it. Yes. That's referring to our transit access guidelines.'",
        "'speaker_3': 'Yes, exactly. Which is that what we're going to pursue here? Because if we are, then that implies to me that we're going to take this very close in parking and it's going to be scattered or maybe among several smaller sites, maybe in structures here or there.'",
        "'speaker_7': 'Well, I think with the way we're looking at is that we don't know what the ultimate development plan is going to be here. And we're we're trying to work to define a plan that's flexible, that can respond to development.'",
        "'speaker_7': 'What I would say with regards to those access guidelines is that that's the exact intent of those, is to provide some flexibility so that as we work, we are not refined or confined to a specific standard that says you have to all be within a certain distance so that that's the intent.'",
        "'speaker_7': 'I think we.'",
        "'speaker_13': 'Are. I mean, David talked about working.'",
        "'speaker_7': 'Together on a comprehensive parking strategy, which we.'",
        "'speaker_13': 'Are doing and will be.'",
        "'speaker_7': 'Dealt with over the course of the.'",
        "'speaker_13': 'Next few months, which will define one probably a location where we put structured.'",
        "'speaker_7': 'Parking, but also look at how we would respond to.'",
        "'speaker_13': 'Development as it occurs on the site.'",
        "'speaker_3': 'Mm hmm. And do you know offhand, among all the rail stations in the RTD network, where does this rank in terms of boardings and a lightings?'",
        "'speaker_7': 'It is in the I believe it's in the top three, not three.'",
        "'speaker_3': 'Yeah. Thank you. That's all, Mr. President.'",
        "'speaker_2': 'Thank you. Councilman Flynn, Councilman Espinosa.'",
        "'speaker_7': 'Back on that. Did I did I maybe missed that. Did I hear you say that the parking had to be within 900 feet, up to 1500 feet? What we defined with the transit access guidelines that we want a certain percentage, basically half of it within us, that basically what we're saying is a thousand foot walking distance, which'",
        "'speaker_7': 'is the equivalent of 600 feet direct. A thousand feet walking distance from what? From the platform. Platform. Platform. Thank you. And 1500 feet would clearly take you across Broadway, correct? Well, it could if you went directly to the to the.'",
        "'speaker_13': 'West or to the east.'",
        "'speaker_7': 'Excuse me. But again, we're talking here, confining ourselves, I think, to the.'",
        "'speaker_13': 'Property that we control and or that could be controlled by others that we would we would.'",
        "'speaker_7': 'Potentially involve in the plan. So it really is talking about everything west of Broadway. So is that stipulated or made clear that within this distance. But what? But on the proper property of David, answer one.'",
        "'speaker_13': 'I don't believe we verbalized that in the plan. But there's a map again, I believe, on page 66 or 68 that shows the transit access guideline thread that RTD has. And we actually, with input from Walsh Park, intentionally cut that off at Broadway to make sure we were indicating that we weren't anticipating capturing that RTD parking on'",
        "'speaker_13': 'the east side of Broadway. So the intent is to have it more than the stationary.'",
        "'speaker_7': 'And there's a there's these map concepts that we're doing at the TOD site, the watershed maps. Mm hmm. Do you have a sort of before and after based on these the connectivity concepts?'",
        "'speaker_13': 'Yeah. There is before and after walk. Should maps in the plan actually show what the existing watershed is and then what the auction would be after these key pedestrian bridges would expand the collection?'",
        "'speaker_7': 'Thank you. And then one question for Sara McCarthy was a little bit confused. Are you asking for that connection, connectivity to the plan to be is that a vehicular connection or a bike and pedestrian connection?'",
        "'speaker_5': 'Multi-Modal. Multi-Modal, that it's that it's all through. There is there is no access between Mississippi and Alameda, which is at Santa Fe Drive a distance of a mile and a half. And what the plan, as I understand it, calls for, is to draw more traffic onto northbound Santa Fe Drive.'",
        "'speaker_5': 'There is nothing that is a path, a singular path for all three that goes all the way. So there's a mile and a half that will remain congested, that was congested in the 1870s. It was congested in the 19 tens, and it is congested today.'",
        "'speaker_5': 'Before this, all the development has been built out and it will affect everybody's quality of life. And and, yes, it's difficult. But in Boulder, they figured out a way to go under rail roadways and over roadways. And we need more access all the way across because bicyclists and pedestrians aren't going to zigzag through the site, which then'",
        "'speaker_5': 'will leave people dependent on Mississippi and Alameda to get across. And it's already congested. It isn't easy, I get that. But it to me, this plan will not do for Denver and the region what is hoped because of the confluence of the river I-25, the various light rail lines.'",
        "'speaker_5': 'It won't happen if we can't get people through and across multiple ways. And we just it needs to get done and it'll cost money and it will take time. But it's not definite in this plan. And I've learned in the 35 plus years of.'",
        "'speaker_5': 'Being a neighborhood activist that if you don't get it in at the very beginning, it doesn't get in and it's more and more difficult over time to answer that.'",
        "'speaker_7': 'Thank you. And then one question to the two presenter on the plan. There was a slide before the one that's up where it shows all the pedestrian paths connecting.'",
        "'speaker_13': 'Like that one.'",
        "'speaker_7': 'Mine's lagging. I'm sorry. So it's great that you're showing those connectivity through Vanderbilt Park and all that and through the proposed new bridge. But then everything gets to the site proper and just vanishes in these arrows. What is what is the plan for connectivity through the what's the network of connectivity where all those things just happen?'",
        "'speaker_13': 'So you're looking at this right at the station area essentially where that all yeah.'",
        "'speaker_7': 'Because if we're talking about neighborhood, you know, neighborhood residents either north or south of I-25 filtering through the site. Are they going to at some point be on the new proposed roadways or their actual paths that are designed in the manner that these other things are?'",
        "'speaker_13': 'Sure. So I mean, that that area is the RTD parcel in particular, and I think a lot of extra design thought will need to go into how everything works together. I think the key there is if we. Go for a few slides.'",
        "'speaker_13': 'One of the reasons that I.'",
        "'speaker_7': 'Ask this is, you know, there's a sort of history of RTD, sorry, you're hear of not making that connection, bringing your line to a point and not really thinking it through. So back to one of the challenges that was here and this is more comment, but my expectation is RTD, CPD public works, the developer don't.'",
        "'speaker_7': 'Do don't create these gaps. You know this is too important.'",
        "'speaker_13': 'Oh, absolutely. Absolutely. And I think, you know, one of the reasons I was going to try to highlight is that the plaza space there is kind of where all these paths kind of come together. And we were trying to, you know, again, allow a little bit of flexibility on the alignment of the Street network.'",
        "'speaker_13': 'That's essentially, you know, back a new band could be coming down under through the underpass, connecting to that new exposition and then eventually going underneath the light rail flyover and connecting to the kind of new shared use street that Broadway station partners would be building on the gate site.'",
        "'speaker_13': 'So it's kind of your North-South movement, but how that actually works does need to be worked out. Same thing with East West with pedestrian bike bridge, where that lands on the RTD site and how it interacts with the the transit will be critical.'",
        "'speaker_7': 'You know, and don't get silly territorial as well, where there's seemingly visual connectivity, but then a physical barrier, you know, or curbs stops and things like that. It's just this has been sort of no man's land. And we're trying to do some placemaking here.'",
        "'speaker_7': 'And it would be silly to sort of put barriers that are more for. Insurance reasons are policing rather than actual experience. So thank you.'",
        "'speaker_2': 'Thank you. Councilman Espinosa. Councilwoman, can each.'",
        "'speaker_10': 'Thank you, Mr. President. I think we're all trying to tease out some of the same things. And it's it's really hard be patient, because every time we change speakers, we lose the map. We were really frustrating and I'm sure our new system won't do that any more.'",
        "'speaker_10': 'I guess for the for for Charlotte and Gary, I wanted to get a sense I think what I heard from you two was not so much concern that the East West connections that they have planned because on page 65 that outlines several it's not that they that you disagree with them, it's just concern about the certainty of'",
        "'speaker_10': 'them occurring and the trust issue. Can I just clarify that from the neighbors and then I'll have some follow ups for CPD but go to your Charlotte if it it was there are someone said there are no east west connections.'",
        "'speaker_10': 'There's there's a lot of East West connections in here. But the concern is will they really happen?'",
        "'speaker_6': 'Absolutely. And if they don't get planned concretely very, very soon, I don't think they'll happen.'",
        "'speaker_10': 'But the three that are listed here on page 65 and again, I'm sorry, I have to go back every single time we change speakers, but that those three you guys are supportive of and as as making some connection across the river and across the well.'",
        "'speaker_6': 'Look, there's only one that crosses the river.'",
        "'speaker_10': 'Okay. But but there's two other connections there.'",
        "'speaker_6': 'They cross the tracks.'",
        "'speaker_10': 'Yes. That cross the tracks. That's it. Right. So so those are things you guys are supportive of. You just are searching for more specificity.'",
        "'speaker_5': 'Yes.'",
        "'speaker_6': 'It's if I lived over on Central Avenue in Ashmore Park wanting to get to the light rail, I'd have to go probably. And if I wasn't biking, I'd have to go all the way down to Mississippi and drive up Broadway probably, or send up.'",
        "'speaker_6': 'I think the west side needs a lot of attention, folks. We're we're always said to be a very protective neighborhood. But I think the West Side has been neglected so badly by planners, the city, not just this administration, but several administrations, probably since the flood of the sixties.'",
        "'speaker_6': 'It's a vital neighborhood, but it's being impeded by being landlocked like this. The bus service on Mississippi and Alameda is not good. During the quiet times of the day, the Alameda bus runs sometimes as little as once an hour.'",
        "'speaker_6': 'The Mississippi bus, they say, doesn't get enough ridership that RTD wants to make it possible for people to ride it regularly. Those neighborhoods suffer from the lack of the ability to get along around easily.'",
        "'speaker_10': 'And so there are still some missing connections that you're describing. That's so there's certainty questions about the ones that are in the map, and then there's still a feeling that there are some connections missing.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_6': 'I see one little bridge crossing the river in a dumpster right into Vanderbilt Park or or going straight down to Mississippi. And Ms.. While they may get a bike path there along Mississippi, and I hope they do, it's still kind of a long way around, you know, glide path.'",
        "'speaker_6': 'And Jason is all industrial. The streets only go through in that one area where you've got some unused right away. So what happens? There is a long time in the future to get the residential areas close. And I wish there were people here for math, Mark, who could talk about it more clearly than I do.'",
        "'speaker_6': 'Okay.'",
        "'speaker_10': 'But that's it. All right. And David, I wanted to move to you then, if you can help me understand. First question, I think I have three questions for you. First question is, did you guys explore the potential for a strain on all the way through vehicular access?'",
        "'speaker_10': 'And were there some downsides to doing that or some reasons why that that was not recommended? We often actually, I think about a lot of planning processes where most residents ask us not to do that straight through particular because they don't want a freeway going through the neighborhood.'",
        "'speaker_10': 'So they want to make it twisty and hard because they want to slow people down. So I'm just curious whether you guys had that conversation.'",
        "'speaker_13': 'Sure. Absolutely we did. And in fact, I believe in public workshop, too. You would have saw maps like this that showed I think we were exploring an underpass somewhere near the Tennessee alignment to try to have that vehicular connection occur.'",
        "'speaker_13': 'And we were going to try to study that further. I think we quickly realized that the extent of of having a on a real travel spread study needed a bigger budget and more time. We weren't going to build a tack it onto this plan process.'",
        "'speaker_13': 'So that's where the the priority recommendation for that next step study for East West connections come into play. And so as I mentioned, Public Works is already scoping that. That's a multi-modal connection. It's not just pigeon bikes. Obviously, that will be a big emphasis, but that will look at vehicular movement east west through this area.'",
        "'speaker_13': 'So obviously could be looking at existing connections, Mississippi or for Alameda. But on the if there's an opportunity for regular connections, it will explore that as well. And so that's a much bigger challenging issue to tackle than what this plan could have done.'",
        "'speaker_13': 'And so that next step study is the vehicle, to no pun intended, to really look at those connections in more detail.'",
        "'speaker_10': 'And then can you explain how that would work if if the connection alignments change? I mean, obviously plans or plans or guidance, they are not binding for better or for worse. So it disappeared again. I'm going to go nuts.'",
        "'speaker_10': 'I might keep these maps up here so we can keep them up. Whether or not we are, you know, in trouble if if it suggests a significantly different alignment that we have in this plan.'",
        "'speaker_13': 'Mm hmm. I mean, the maps are one, one portion and what we typically look at. But if you do read the text, I believe in the transformative project that speaks to East-West connectivity. It's a little bit more broader, as well as in the implementation section.'",
        "'speaker_13': 'On that next step study, we discuss exploring all modes. And so I think there's enough language to allow the wiggle room necessary to explore any connections that we can find.'",
        "'speaker_10': 'Okay, great. And then I think my last question on the connectivity issue is just about and I particularly asked about cars separate from bike and PED, because I do think that the types of routes bikers are willing to take.'",
        "'speaker_10': 'Again, most of the bike trails that I'm on are zag and it's part of what makes them interesting. And so I guess I was curious. Same kind of question that I asked about the cars. Are there reasons why maybe we see some zigging and zagging in terms of activation, for example, or, you know, is it were there'",
        "'speaker_10': 'some conscious decisions made? Again, because we hear some some folks saying we want it straight through. Are there pros to not being straight through?'",
        "'speaker_13': 'Sure. Well, I think that the the most direct route to the station is the the green dashed line here that I'm trying to highlight with the mouse, which crosses the tracks, goes through the Animal Park East, aligns with that vehicular multimodal bridge at Kentucky, and then can either has a direct access to the Platte River trail.'",
        "'speaker_13': 'That's what the the white circle is there or can proceed west to the animal park and then split off it here on or continue through the industrial area. I mean, it's not a straight line, but it's it's pretty close, actually.'",
        "'speaker_13': 'And then we also have a very hopefully an improved multimodal path along Mississippi on the north side, which does not continue west right now and does not provide the connections to South Park that we're looking for. And that is probably a maybe a, you know, a lower hanging fruit, I guess from a connectivity standpoint, that's an existing'",
        "'speaker_13': 'route. So it's not completely straight, but it's pretty, pretty close. And those were, you know, consciously placed because of the station itself and access to the West.'",
        "'speaker_10': 'Some of that some of these things are a function of where the amenities are in terms of you couldn't just go straight east without getting into something that you couldn't get through.'",
        "'speaker_7': 'Sure.'",
        "'speaker_13': 'For example, I mean, if we wanted to have I mean, we could easily align this right here. The bridge over the tracks can't really shift much to the north or south just because of the the life light rail flyover, which is now picking up, you know, altitude there elevation.'",
        "'speaker_13': 'And then to the north you have the overpass. So it's pretty limited at that point as it crosses the the river. You have southbound and northbound traffic on South Platte River Drive and Santa Fe. And there's distances between on ramps and intersections.'",
        "'speaker_13': 'We're trying to find the right sweet spot for this. The path through the park could easily adjust and maybe be a little bit more on East West, and the plan isn't going to prohibit that adjustment of the route.'",
        "'speaker_10': 'Okay, great. And this is my last question, and this may be for you or for Kim to Sarah, but what is the timeline by which a general development plan might come forward in the process of what comes next for the significant landowner around the station?'",
        "'speaker_10': 'So we know there's a singular landowner for a big, big portion of this plan. It's a little unusual. It's not like we're talking about, what, 20 or 30 or 100 landowners might do. In this case, we have one significant one.'",
        "'speaker_10': 'It's my experience that typically speaking, these kinds of infrastructure routes and things get somewhat settled in the general development plan. Is that correct? So when might that type of specificity be occurring?'",
        "'speaker_13': 'Sure. I'll let Ryan, who's been working on the infrastructure master plan, give you those answers.'",
        "'speaker_10': 'Maybe tell us what the infrastructure masterplan is.'",
        "'speaker_9': 'Sure. Thank you. Councilwoman Ryan went to vote with community planning and development. So you'll notice in the moving forward chapter we have a recommendation for ensure that implementation tools advance the plan vision. So there are a number of different tools that we have available in the Denver zoning code today to implement the vision of the stationary plan'",
        "'speaker_9': '. One of it's being a general development plan, one of which being an infrastructure master plan. So the plan also speaks to the existing sort of layers of regulatory tools that exist on the site. There is a general development plan and there is also a currently an infrastructure master plan which was required by the current authority with waivers'",
        "'speaker_9': 'and conditions, zoning. And of course, one of the big change conditions that we see today is that we have a station area plan that does guide a lot of the high level connectivity recommendations that we would typically see housed within a general development plan.'",
        "'speaker_9': 'Of course, we have a stationary plan that gives us that vision today, one that is also developed through a community driven process where formerly we didn't really have that existing with the former Cherokee Gates redevelopment plan. So in a very thorough and complex analysis, both in public works, in community planning and development, and the Parks and Recreation'",
        "'speaker_9': 'Department, sort of our internal team, we've identified that creating a new general development plan to replace the existing Cherokee Gates general development plan really doesn't feel a need, since we have both a stationary plan that provides that community driven process for us.'",
        "'speaker_9': 'So we're going to be moving straight into the infrastructure master plan that really provides both kind of a framework of connections, but also establishes the regulatory framework for the technical infrastructure and design studies that will be informing this very specific questions.'",
        "'speaker_9': 'So we've been very involved with our planning board in terms of what this process looks like. So we've done two information items so far, one in December and one in February, if you do want to get a little bit more detail about what those planning documents include.'",
        "'speaker_9': 'But we do expect that the infrastructure master plan will be approved likely later in the summer, and then a repeal of the existing TDP will be coming before the planning board after that to make sure that we've captured all of the important items.'",
        "'speaker_10': 'Thanks. And our last question. Thank you, Mr. President, for your forbearance. Are the groups and the steering committee that have been involved in the stationary planning getting briefed on and part of that infrastructure planning process in some way, shape or form?'",
        "'speaker_9': 'Yes. Thank you. So Broadway Station Partners has assembled a Broadway station technical advisory committee. Is that correct, Ken? I think I got the acronym right. So they convened a number of different meetings with this group of neighborhood representatives to vet all of the concepts that may be housed within a GDP, maybe housed within an imp, to make'",
        "'speaker_9': 'sure that all those boxes are being checked, that everything is being captured. Additionally, there will be a public meeting later this month hosted by Broadway Station Partners. And again, those two information items that we've presented to Planning Board.'",
        "'speaker_10': 'I like one teeny tiny that question. Does that will that create more specificity on these alignments?'",
        "'speaker_9': 'That's correct, yes. Okay. And then they the infrastructure master plan is at the higher level, but it will establish the framework for the technical studies that are really the engineering documents that are giving incredible specificity to those alignments.'",
        "'speaker_10': 'Okay. Thank you very much.'",
        "'speaker_2': 'Thank you. Councilwoman Keech, Councilman Cashman.'",
        "'speaker_8': 'Thank you, Mr. President. I can't tell you how happy I am to hear neighbors get up and say how happy they've been with the inclusive process of a consultant team and the city. And it's a great example to set and it hopefully will lend itself to a great process moving forward.'",
        "'speaker_8': 'I know Councilwoman Clark will be leaning heavily into this effort to see that something wonderful grows up on this ground. And Councilman Clarke, I hope you don't mind if I wander into your district for a second. We if you asked everyone up here on the dais to name the people in their districts who were important to to'",
        "'speaker_8': 'the work that's been done. While West Wash Park is in Lucky District seven and not an extremely fortunate District six, I've had the opportunity to work with Sarah McCarthy and Charlene Winds and Bird and Judy Grant in my previous career for decades.'",
        "'speaker_8': 'And I just need to say that that the wonderful fabric that has. Been woven to create this wonderful place. This wonderful community definitely bears the imprint of these three hard working women. And I believe among things I remember the I believe it was was gurdy taking me to the spot.'",
        "'speaker_8': 'And on the eastern side of Wash Park where the view plane was measured from. And I could name dozens of such projects. So for me it's a little bit like looking at at a minor Mount Rushmore. And I just wanted I wanted to acknowledge the three of you as far as the property itself.'",
        "'speaker_8': 'For me to underscore with several of my colleagues have said, I think the the most important opportunity for this property is to provide that connectivity. I would rather see nothing built on it and connection to the West Side than I would to see whatever fabulous structures rise out of the ground and not get and to miss this'",
        "'speaker_8': 'opportunity. So and I know it's it's been said in some form, I'm still a little bit unclear the bridges to be built both over the tracks and over the river. They're all the responsibility of whoever builds on that land.'",
        "'speaker_8': 'Is that correct? And anyone.'",
        "'speaker_13': 'The plan itself does not outline the responsible parties for the right structure. Right. I think as as Ryan was detailing the the process going forward is going to be more clarity. And as you know from the previous redevelopment, Cherokee Gates redevelopment, there was a tax increment financing package there, and that could be an element of that going'",
        "'speaker_13': 'forward. But I think all those details on who pays for what and when will be coming to you in the future.'",
        "'speaker_8': 'Sure. And so what opportunities between now and when dirt gets turned? Will there be for community input in into all these issues surrounding what grows up on that land?'",
        "'speaker_13': 'Mm hmm. Well, as Ryan was was detailing, Broadway station partners has a public process right now, which is kind of really just coming right on the coattails of the stationary plan, building upon the the plan vision to fleshing out more of those details that then will be captured in that infrastructure master plan that would, you know, be'",
        "'speaker_13': 'completed later this year. So that that is where some of those details will be clarified. And they do have a public process that they're building upon.'",
        "'speaker_8': 'Okay. Thank you very much, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Cashman. Councilman, I suppose I'm a huff over you and get the councilman knew since he hasn't asked questions yet.'",
        "'speaker_12': 'David, before you leave the that bridge is going from Parkland to Parkland. I mean, it looks like green space to green space. Is that correct? Is that right? Okay. I'd like Mr. Parks to come up to the podium, please.'",
        "'speaker_12': 'Mr. Gilmore, please. Thanks.'",
        "'speaker_1': 'It. Hello.'",
        "'speaker_12': 'Scott. You have a great opportunity here. Looks like you know that ice bridge is going from Parkland to Parkland. And I guess if you've been involved with a discussion about this bridge going from one area of the park to the other.'",
        "'speaker_8': 'Yes. Scott Gilmore, deputy executive director of Denver Parks and Recreation. I've been involved with all the planning discussions and actually some of the concept designs for Vanderbilt, East and Vanderbilt. Well, so I've been working with the team very closely on what's going to happen in both these spaces.'",
        "'speaker_12': 'Right? Yes. Good news. Are you planning on asking for the funding in this bridge and the bond issue coming up in 2017? I wasn't planning on it. I encourage you to ask for the funding for this bridge in there just to make sure this is a part.'",
        "'speaker_12': 'Responsibility sounds like.'",
        "'speaker_8': 'It's it's the bridge. Going from park to park basically is a vehicular bridge with some multi-modal connections. So for me, it's more hopefully I'm more worried about.'",
        "'speaker_7': 'The the the South Platte.'",
        "'speaker_8': 'River actually connections that actually will get people down to the river and get them moving along the regional trail. So I think that's pretty critical for me.'",
        "'speaker_12': 'All right. Well, I'm sure my colleague, Councilman Clark, will help with that funding request. I'm sure. Thank you very much.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman, new councilman. That's not.'",
        "'speaker_7': 'Um. Yeah. Could you bring a slide 22. Please. And this is. This is almost you know, this is not really common. It's sort of in-between. I the reason why I wanted him to bring that up is. Because I wanted to show something.'",
        "'speaker_13': 'I I'm sorry. Which side was it?'",
        "'speaker_7': 'It's the slide that shows the 16 story. The height. I mean, the. The massing.'",
        "'speaker_13': 'Oh, the building heights.'",
        "'speaker_7': 'Building heights. Mm hmm. So this is true integrity and Sarah and company the if you it's up there now so you guys know the history of that sort of dead man's land where the carpet place was in those all those failed warehouse businesses were in that Bermuda Triangle between Santa Fe, I-25 and the railroad tracks.'",
        "'speaker_7': 'What you see here between the green space amenity and that 16 story, the largest block of 16 story development density is in that Bermuda Triangle. And so we've already shown a pension at Blake and at 41st and Fox for crossing over to doing these these rail crossings.'",
        "'speaker_7': 'And so there's a ton of incentive because of if you look where that T is and you look where that 16 story is, there's a ton of incentive to make that crossing and make that crossing a good crossing.'",
        "'speaker_7': 'And so it's not a guarantee. But this is all the all that things are aligning just perfectly for these crossings to be good. And it's just a matter of the design. I mean, that that that these will these connections will be made.'",
        "'speaker_7': 'And so because this is important for that development to work well with that mass transit opportunity. And we're committed Dolan's committed to seeing those things being done. So I just wanted to give you that assurance from here. Thank you.'",
        "'speaker_2': 'Thank you for helping us to know the that want to taking in colleagues we could just we'll go we're doing comments afterwards.'",
        "'speaker_7': 'We still do it after you.'",
        "'speaker_2': 'Get the questions. Councilman Ortega.'",
        "'speaker_11': 'I just wanted to ask a question about the I believe it was three acres that was on the original site that is proposed for the Gates development. What where has that land been moved to? Historically, there was a park on that site.'",
        "'speaker_11': 'It was about three acres, as I recall. Kim, you'll remember this. Can you tell me where that open space has been shifted to? Because we can't technically just get rid of it without replacing it because we'd have to go to a vote of the people.'",
        "'speaker_13': 'Yeah, absolutely. No, it's it's still there. And it will actually.'",
        "'speaker_11': 'Be will be on that same side of Santa Fe.'",
        "'speaker_13': 'Correct. So it's actually highlighted here in green. It's kind of that triangle. That is what will be Venable Park East. So that has a dedicated park space and there's a kind of design recommendations on how that is actually designed and will function in the future.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman Ortega. Any other questions from members of council? None. Public hearing is now closed. Time for comments, Councilman Clark.'",
        "'speaker_8': 'Thank you, Mr. President. I. This has been an exciting ride for me. Starting before I was even running for this job. My first meeting with this stationary plan was as a stakeholder representing the Greenway Foundation. And that night I stood up and gave a very passionate speech about the connections to the South Platte River and the East-West'",
        "'speaker_8': 'connections. I first want to thank David Jaspers specifically, but the entire planning team and consultants. They set a really high bar for public outreach and public engagement through this process, through the public meetings, the stakeholder meetings, getting feedback from all of the Arnaud's small meetings in the community on very targeted issues.'",
        "'speaker_8': 'David gave up some evenings, including one where he walked into a very hostile room of about 60 West Watch Park residents were very upset about the alignment of how bikes were going to get from the station area to the park.'",
        "'speaker_8': 'And we closed the door and didn't let him go until we had unanimous, not a single dissenting vote, unanimous support for the language adopted in the plan and all the way down to working one on one with members of the Arnaud's and who are on the zoning side of that.'",
        "'speaker_8': 'It was really tremendous outreach and tremendous engagement. I also want to thank all of the residents who are involved in this. Thank you to Gertie and Charlotte and Sarah who are here, but also to all of the constituents who are involved in this process all the way along.'",
        "'speaker_8': 'You know, I think one of the things that's been frustrating for me and for everyone in this is that this is this is a 30,000 foot level plant. And I think we're already with this site to get down to the specifics, to get down to exactly where and what and how is it going to get paid for'",
        "'speaker_8': '. And so I just want to say that I am ready to jump in as I know all of my constituents are as well. I think that for this level planning document, when it comes to parking, when it comes to connectivity, it sets the right tone, it puts the right pieces in place for us to go do the'",
        "'speaker_8': 'next steps. The next steps are critical, and we have to go at those and we have to go at them quickly. But I think that for what we can accomplish in this level of plan, I think, you know, I think there's even Joel Nobile at Planning Board who said who said I'm paraphrasing what he said, that at'",
        "'speaker_8': 'this level of plan, when it comes to parking this, this is the right language to make sure that we have the flexibility to grow with this site that is currently just a sea of nothing and surface parking to see what it's going to be, but also has those protections in there for residents and for commuters.'",
        "'speaker_8': 'And it's going be easy. It's a lot of work, but there are a lot of tools that we have at our disposal. I think that sets that right tone. I think that, you know. This station is so critically important, this area to Denver.'",
        "'speaker_8': 'It is. You know, I've been told I think tonight it's a top three. I've been told this is the second biggest multi-modal hub in Denver's Union Station. And then the Broadway station, if you combine Broadway station with Alameda Station, which are in the same area, and that is is a massive multi-modal hub in Denver, it's also an'",
        "'speaker_8': 'area that had a development plan and had a developer that fell apart. And I think that part of this anxiety and anticipation to get going was also that there was a plan and there was somebody was going to develop it and then that went away and will soon be in some ways starting over.'",
        "'speaker_8': 'But what's important is that was in place and was going to move forward without a stationary plan. And here we stand tonight with the opportunity to approve a station area plan that will sit and will guide and will have to be adhered to by future development no matter who that developer is, hopefully the one that we have'",
        "'speaker_8': 'in place now. But you never know where things turn with the economy. I think that this site also not only is critical for all of Denver, but it's it's as you've heard tonight at the heart of my community that I represent.'",
        "'speaker_8': 'But it also is at the heart of so many things that divide this community. And so it's unique. I think in a lot of ways about the district that I represent is that instead of drawing the district boundary line along all those divisions, somebody drew it across them.'",
        "'speaker_8': 'And it's a great place to to be to be forced to look at that and to prioritize those connections. We have Broadway, we have the consolidated main line, we have light rail, we have Santa Fe, we have the South Platte River.'",
        "'speaker_8': 'And in parts we have I-25. That's a lot of barriers. There are a lot of parts of town that don't have nearly that many. And getting those connections, whether they're bike or pet or vehicular in a stretch between Mississippi and Alameda, that is somewhere around a mile is always difficult.'",
        "'speaker_8': 'It's something that we grappled with when we did the master plan for the South Platte River. One of the ideas with that is could we bury Santa Fe to make some of this land riverfront? And I think those conversations and dreaming big are really important and it could we tunnel underneath.'",
        "'speaker_8': 'But I think that what this plan sets forth is a lot of things that we can realistically achieve. It doesn't mean that we stop dreaming or we don't look at the next step. Studies that every option. But I think that there are things in here that we can get done and we can get done over a shorter'",
        "'speaker_8': 'period of time that will really bridge these communities, this district back together. I have constituents on the east side, as you heard, that since 19, what was the greatest, would you say in 1977 have tried to get to the South Platte River?'",
        "'speaker_8': 'We spent the last 17 years of my life feels like a former life almost at this point, working on connecting people to the South Platte River. And we have $30 million worth of park and recreation amenities that have just gone in to complement everything that's happened since 1965.'",
        "'speaker_8': 'We have the Levitt Pavilion opening. Those connections are critical, whether you're a pedestrian or a cyclist or a car. And then I have constituents living on the West Side who can sit and watch a light rail train go by from their front porch, from their backyard, and cannot safely get to it if they're a pedestrian or a'",
        "'speaker_8': 'cyclist or they're jam packed in traffic and in a car. And so I think that that connectivity and that this plan calls that out as one of the main pieces is connected station area. The site really has the potential to reconnect and re weave this area together and establish those connections between neighborhoods and also from neighborhoods to'",
        "'speaker_8': 'amenities. I also think that this this area that has been it was a major workforce center with the Gates Rubber factory for Denver forever as a true opportunity to build a live, work and play community in Denver. We already have designated Parkland that can't be touched, as my colleague Councilwoman Ortega mentioned, without a vote of the people'",
        "'speaker_8': '. And it won't be. And that on a person like this that that is unique sometimes to have already set aside play space to complement the the live and work that we can build. It's also as Denver continues to grow, this is putting density where density belongs.'",
        "'speaker_8': 'It was something that, you know, when I was on the campaign trail going door to door, we talked a lot about Denver getting denser. And I don't want this here, but everybody who I knocked on their door almost without a single dissenter said that's the right place.'",
        "'speaker_8': 'We put density there along the rail where there is multimodal connectivity so that people can reduce the number of trips that they're taking, that add to congestion. That's where it stays out of the West Wash park, the watch park view plane.'",
        "'speaker_8': 'That's where it belongs. And so to start setting the pieces where we can start to do that and accommodate growth and keep Denver affordable as we continue to grow and there's a serious supply and demand issue I think is important.'",
        "'speaker_8': 'This can be a true midtown area somewhere between downtown Denver and the tech center, a real place for for for Denver to to thrive and create a great community that serves the communities around it. So I think this plan is just this.'",
        "'speaker_8': 'Ah, there is a lot more work to do. But as everyone has seen tonight, I have the smartest constituents in the entire city and the most passionate constituents in the entire city, and they are not afraid to make their voices heard.'",
        "'speaker_8': 'And so I have no doubt that working together, this is just the start and we can get it done. And so tonight with this in front of us, the opportunity to have a stationary a plan that will guide development, that is the start of something, not the finish.'",
        "'speaker_8': 'I will be supporting this and I encourage my colleagues to support it as well. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Clark. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. I feel compelled to apologize for the level of intelligence of my constituents in view of a councilman clerk just said, but that perhaps it's the altitude sickness from from being in the highest district in the city.'",
        "'speaker_3': 'Mr. President, I'm going to support this tonight. And Councilman Clark also, but I do so with a lot of trepidation about some of the issues that my constituents have, you know, reluctant as they are to speak, have brought forward about the parking.'",
        "'speaker_3': 'As Councilman Clark mentioned, this site is has a lot of boundary issues, has a lot of barriers. It has the wall of I-25, it has a consolidated mainline. It has I-25, it has Broadway, it has the high traffic, has Mississippi, which is unbearable, not only because of the underpass, but because of the the traffic signals at Santa'",
        "'speaker_3': 'Fe. It takes about a day and a half to get through there during rush hour. I want us to remember also, though, that those same facilities make this the hub. As was mentioned earlier, it also makes it the hub.'",
        "'speaker_3': 'It makes it a place, as Bill Savoy from our Judy said, maybe the third, largest, third busiest RTD rail station in the system. And we I don't want us to lose sight of that. It's not acceptable for my nursing.'",
        "'speaker_3': 'Constituent I have a constituent as a nurse out of and shoots who lives in Mali and she uses this station every day and it's not acceptable to expect her to walk 1500 feet. That's you know, that's over a five minute walk in the dead of winter, in the dark of night.'",
        "'speaker_3': 'And when she's coming home or in the morning when she's going to work. That's just not acceptable to me. So I'm hoping that the vagueness that I saw in the parking in the in the talk about we're going to work out parking details in the future.'",
        "'speaker_3': 'We're at a 30,000 foot level. I hope that we keep in mind that as we convert this this once great industrial site of Gates Rubber Company, as we convert this into a place where people actually live, work and play, that we don't forget that it's also one of the busiest transfer stations in the regional rail network.'",
        "'speaker_3': 'And in the time it takes to walk from 1500 feet away, whether that's east of Broadway or no matter where it is, my constituent is going to miss at least one, maybe two trains in the downtown for her transfer, and that's not acceptable.'",
        "'speaker_3': 'So I hope that we keep that in mind when we plan where our parking will be. That will serve the commuting public that needs this station so vitally. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Flynn.'",
        "'speaker_7': 'Councilman Brooks. Thank you, Mr. President. Just a couple of things. Number one, David Gaspar has set the tone in the planning department with the dress. So I like the tie. Please let other planners know that they're going to come with a tie.'",
        "'speaker_7': 'And secondly, it's so encouraging to have residents who are just so passionate about multimodal development and so and connection. And so I just want to thank you all for that. You wouldn't believe it. In some parts of the city, we have to educate folks on what multimodal development and connections are.'",
        "'speaker_7': 'And so I appreciate you guys being so passionate about that. I just want to say, there are people who are watching right now who don't understand planning and don't understand implementation and how we do things in the city and county of Denver.'",
        "'speaker_7': 'The plan is is laying of the tracks and greasing the track for the train to come. We are seeing plans being implement. We're seeing plans being adopted and implementation happening in less than a year. We're in this time of quick technological advances where things are just moving very quickly.'",
        "'speaker_7': 'I am we adopted the global response to a plan, three of them like stationary plan just a year ago. And we are redoing it right now because of all of the growth that's happening in this city. And so I want to applaud you all, and I think you will see those connections much faster than you think because'",
        "'speaker_7': 'you have a city council person who's going to be here for another 11 years, knock on wood. So I just want to continue to encourage all of us with these plans and also want to, you know, have two council persons up here.'",
        "'speaker_7': 'And I thought Councilman Flynn was going to say this. You know, there are areas of the city that don't have plans. There's areas of the city that do not have this direction. And we as a city need to get on that.'",
        "'speaker_7': 'There are areas in cities that are that are overlooked. And so, although this is great for this area and so excited that this neighborhood's been working so hard on that and Councilman never given him a shout out. I've been working on this.'",
        "'speaker_7': 'Let's make sure we get those places that haven't been touched yet. Thanks.'",
        "'speaker_2': 'Thank you. Councilman Burks. Councilwoman Ortega.'",
        "'speaker_11': 'Thank you, Mr. President. I want to lend my support to this station area plan as well. Quite some time ago when I served on the city council. This used to be part of my district. It went all the way to Mississippi.'",
        "'speaker_11': 'That's why I was very well aware of the three acre park parcel that is a part of this proposed development. This site has been around for development for quite a long time. Gates, buildings, most of them have been gone for quite a while.'",
        "'speaker_11': 'I know at one point there was a lot of talk about trying to save, you know, certain aspects of it. And so there was a community conversation about that. But to realize that we're getting closer, especially with the existence of our our rail system being built out, really makes this exciting.'",
        "'speaker_11': 'And I remember the site was proposed for, you know, higher density as as we're continuing to talk about the one thing that I just want to raise and I will do this with every site where we have rail.'",
        "'speaker_11': 'That carries cargo, specifically hazardous material and flammable liquids. And I had this conversation with the developer and miscue server when they came to meet with me. It's looking at the fact that we will have so many people on this site.'",
        "'speaker_11': 'And when you look at both this site as well as the site immediately to the north that we dealt with last week. This is the size of lower downtown or Cherry Creek, actually a little bit bigger when you add all of it together and it's putting in large numbers of people.'",
        "'speaker_11': 'And when we get ready to do the tours for districts, one of the things I want to do is get you all to tour the Central Platte Valley. Just yesterday, as a matter of fact, when I was driving back there from from being down here at the office, there was one of these train cars that actually, again'",
        "'speaker_11': ', stretched from one end of town downtown throughout the Central Valley. And just the issue of safety of the. People the protection of the infrastructure that's going to be built that will support all those people being there is really important for us to continue to look at and address.'",
        "'speaker_11': 'And Councilman Clarke and I are both serving on a committee. We hope to have some information back to you with the chief Tate's leadership by July. But this will continue to be part of what the city is going to look at as we move forward in trying to address true health, safety and welfare of communities that we're'",
        "'speaker_11': 'going to be encouraging to live in these facilities as a result of the development that's going to be there. So I'll be supporting this tonight, and I just want to congratulate all the folks who have been involved, think the neighborhood for their input can't see behind all these trees over here.'",
        "'speaker_11': 'But I think the fact that we have a few neighborhood people here tonight really says a lot about the process that you all went through, because when they're not thorough and engaging, we have these seats filled up. So good job on the work you've done.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Ortega. Councilwoman Cleage.'",
        "'speaker_10': 'Thank you very much, Mr. President. I chimed in only to add a new comment that wasn't made, which is to commend folks on Section three of the plan on social sustainability. I don't know if council members got a chance to see it, but this site has a very long history of engagement from a really broad coalition of'",
        "'speaker_10': 'community organizations looking to say that when you do major land use, the only outcomes shouldn't be physical things that you should see. It should be the economic opportunity that's created for the residents, particularly those who are vulnerable. It should be the types and prices of the housing that's created and the connection to jobs, all of that.'",
        "'speaker_10': 'And I was really pleased to see really strong language on that. And so kudos to the neighbors for both supporting and embracing a diversity of incomes in the housing. That is a sign of the richness of a community, this idea of recognizing and embracing that, but also to the plan staff for for bringing those things.'",
        "'speaker_10': 'I would say this plan goes further than most I've seen in terms of really addressing it even mentions local hiring. Councilwoman Ortega. So I think that is I'm not sure I've seen that before maybe in the responsive plan, but I think that that piece is what to me makes all this worthwhile, right?'",
        "'speaker_10': 'East West connections are great, but they exist for people. And having those people have access to housing and economic opportunity is what makes all that other infrastructure meaningful. So I want to commend you and thank you.'",
        "'speaker_2': 'Thank you. Councilwoman, can each. Any other comments? 173 seen on Madam Secretary, Raquel Clarke.'",
        "'speaker_6': 'Hi, Espinosa. Hi, Flynn. Hi, Gilmore. I. Cashman. I can eat Lopez. All right. New Ortega. Sussman.'",
        "'speaker_5': 'Black Brooks.'",
        "'speaker_6': 'Hi, Mr. President.'",
        "'speaker_2': 'Hi. Councilman Brooks.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Madam Secretary. Please cast your vote in. Now the results.'",
        "'speaker_6': '3939.'",
        "'speaker_2': 'Is 173 has passed. On Monday, May 2nd, Council will hold a required public hearing on Council Bill 174, changing the zoning classification for 2765 South Colorado Boulevard and required public hearing on Council Bill 191 changing the zoning classification for 4140 50 North Kittredge Street.'",
        "'speaker_2': 'Any protest against Council Bill 174 191 must be filed with the Council Office no later than Monday, April 25th. And Councilwoman Black wanted me to acknowledge, to say thank you for all those that have the plants on our diets are due to April is Child Abuse Prevention month.'",
        "'speaker_2': 'So this is a reminder of council for that seen all the business before this body this meeting is adjourned.'"
    ]
}