{
    "Rezoning of 3033 East 1st Avenue in Cherry Creek.": [
        "'speaker_0': 'Speakers will have 3 minutes and there will be no yielding of times. The important distinction there on the presentation monitor of the wall, you will see your time counting down speakers. We'll stay on the topic of hearing and must director comments to council members please refrain from profane or obscene speech.'",
        "'speaker_0': 'Direct your comments to council as a whole and refrain for individual or personal attacks. Kelso. I knew. Would you please put Councilor Bell to 63 on the floor?'",
        "'speaker_2': 'Thank you, Mr. President. I move that council bill 263 be placed upon final consideration and do pass.'",
        "'speaker_0': 'All right. It's been moved the second it the public hearing for council bill 263 is open. May we have the staff report? Teresa Lucero, how are you?'",
        "'speaker_3': 'I'm good. How are you?'",
        "'speaker_0': 'Great.'",
        "'speaker_3': 'Teresa with Sarah with community planning and development. So this is a proposed map Amendment 433, East First Avenue. The proposal is to rezone from PWD 55 to Urban Center Cherry Creek North eighth story. Oops, I didn't hit the right button.'",
        "'speaker_3': 'So the location is in the Council District ten in the Cherry Creek neighborhood between First Avenue and Second Avenue, between Saint Paul and Milwaukee in Cherry Creek, north, directly across from the Cherry Creek Shopping Center. Property is about two acres.'",
        "'speaker_3': 'It is an existing office building with mixed use parking structure. The request is to prepare the property for future redevelopment, so to rezone to that urban center. Cherry Creek North eight story. This is of a former Chapter 59 PD that was approved in 1981.'",
        "'speaker_3': 'It limits the amount of square feet in the on the property and limits the uses to office retail and parking and has a height limit of 126 feet. The Cherry Creek Zone districts were adopted in 2014 as part of the Urban Urban Center context, specifically intended for use in Cherry Creek North and were designed to be specifically'",
        "'speaker_3': 'in character with that area of the city. Again, PD, 55, is a former Chapter 59 zone district. There is a height limit on the property, a view plane, Cranmer Park view plane that limits the height on the property to 164 feet.'",
        "'speaker_3': 'Existing land uses office and retail. Eight story buildings existing on the property. Surrounding zoning. Cherry Creek North eight to the north to the south. B three Chapter 59 Zone District for the shopping center itself to the East Cherry Creek North five and 12, and then to the west.'",
        "'speaker_3': 'Another Chapter 59 PD. So when you look at the land use in the area, it is retail and office and commercial. So surrounding totally surrounding this block. These pictures give you an idea of the scale of the development in the area.'",
        "'speaker_3': 'The building itself is the center on top, and then on each side of the building, you see we have pretty tall buildings, up to eight storeys and. Specifically to the east and west. So the process informational notice on this went out in November of 2016.'",
        "'speaker_3': 'Planning Board held their hearing on in February of 2017 and unanimously recommended approval of this. And then we were at committee on March 7th. And of course, we're here tonight. There are seven different RINO's that were notified of this hearing.'",
        "'speaker_3': 'We did hear from the Cherry Creek Area Business Alliance a letter of support for this application. You know the criteria. Well, consistency with adopted plans, the plans that are applicable here are the current plan blueprint Denver and the Cherry Creek Area Plan, which was adopted in 2012.'",
        "'speaker_3': 'Current plan tells us to conserve land by promoting infill development. Encourage quality infill development. Identify areas where increased density can be accommodated. And specifically to Cherry Creek and the shopping center to. It should be our premier shopping area as it is and should be the destination for the entire Rocky Mountain area.'",
        "'speaker_3': 'Blueprint Denver The land use concept is regional center balancing retail employment. Residential uses attractive to patrons from the region and of course that major shopping center being the core of the area and it is an area of change.'",
        "'speaker_3': 'Street classifications for first Avenue mixed use arterial and an enhanced transit corridor Second Avenue, Main Street Collector and Milwaukee and Saint Paul are both on designated local streets. And there are details in your staff report about the implications of those.'",
        "'speaker_3': 'Cherry Creek Area plan, like I said, adopted in 2012, acknowledging that Cherry Creek needs to change and stay prosperous and must grow to change and stay prosperous that they did. Update the Blueprint Denver map, which I'll show you in just a second.'",
        "'speaker_3': 'And they recommended modifying our zoning regulations, which we did in 2014 with these new Cherry Creek North Zone districts. This is a picture of the area of change map that and how it changed from Blueprint Denver to the adoption of the Cherry Creek Area Plan.'",
        "'speaker_3': 'The block that we're talking about did remain in an area of change. Cherry Creek also has some areas when in the plan. So this is a regional center in the Cherry Creek Area plan, which is basically talks about supporting mixed use and enhanced public realm.'",
        "'speaker_3': 'The scale of the buildings should be between four and 12 stories and we should enact the zoning regulations that we did in 2014 to encourage the continuing redevelopment of Cherry Creek of the Cherry Creek area. So the property we're talking about is in the Cherry Creek Shopping District, same area.'",
        "'speaker_3': 'And it is designated a regional center in the sum in the plan. And the plan does say this this park in particular, should be stories. So with that, staff believes that this proposed MAP amendment does conform with our adopted plans, that we're furthering the public health, safety and welfare by allowing Cherry Creek to redevelop and reinvest in'",
        "'speaker_3': 'itself and by implementing our plans justifying circumstances. It's changed conditions that the land or surrounding environs has changed or is changing to a degree that it's in the public interest to encourage redevelopment. I think it's easy to see where Cherry Creek has continued to reinvest in itself.'",
        "'speaker_3': 'It's a regional center. It's an area of change. We've designated that in the most recent plan. There is ongoing redevelopment all over the Cherry Creek neighborhood, so staff believes this is the appropriate justifying circumstance for a map amendment.'",
        "'speaker_3': 'And so the last thing is consistency with the neighborhood context and zone district, purpose and intent. The urban center and neighborhood context sort of speaks Cherry Creek's it's multi-unit residential mixed use commercial located located on Main Streets and mixed use arterials building heights moderate to high and the CN8 zoned district itself was written for Cherry Creek North'",
        "'speaker_3': 'to promote that mixed use shopping area pedestrian oriented development. So staff believes that this criteria is also met by the rezoning and staff recommends approval.'",
        "'speaker_0': 'All right. Thank you, Teresa. We have two speakers this evening. I'm going to call them both up. Bob Martucci. And Blake Murray. Sorry for mispronouncing your last name.'",
        "'speaker_1': 'My name? My name is Bob Bertucci, and I'm the executive vice president of Realty Management Group. And I manage the this block and the block to the west of US Filmore place. And the reason we're here tonight is to rezone this property.'",
        "'speaker_1': 'But I wanted to say that it's really a reinvestment in our property driven by reducing our energy footprint of our building. So in regards to your proclamation today, we're actually making investments to do exactly that, which is to reduce the amount of energy we use in our buildings and to improve the overall performance and how we're doing'",
        "'speaker_1': 'that. The catalyst for this building was to replace all of the glass in the building. Yes.'",
        "'speaker_4': 'Excuse me.'",
        "'speaker_0': 'Excuse me. Can you have a seat, please? No, we are going to.'",
        "'speaker_4': 'Fine.'",
        "'speaker_0': 'Excuse me. Excuse me. You're interrupting. You're interrupting.'",
        "'speaker_4': 'You are. We are.'",
        "'speaker_0': 'Okay. So we have public comment. Once a month, you can come here and have and have a conversation. Why? Okay.'",
        "'speaker_4': 'So wait a minute. So here you are, a politician with 20,196.'",
        "'speaker_0': 'You can. You can leave them right there.'",
        "'speaker_4': 'Which you took.'",
        "'speaker_5': 'And they immediately said.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'There's that one. A petition with 25,695 signatures on it.'",
        "'speaker_0': 'Got it. Thank you.'",
        "'speaker_4': '602 from Denver. If you don't want to.'",
        "'speaker_0': 'Go with her, we can do that. Thank you.'",
        "'speaker_4': 'Felix.'",
        "'speaker_0': 'Have a great night. Goodbye and shame. So, Ms.. Mr. Martucci, I apologize. I apologize for interrupting.'",
        "'speaker_1': 'You.'",
        "'speaker_0': 'There. Go ahead. Okay. Thank you, sir. Appreciate it. Thank you, sir.'",
        "'speaker_4': 'It is interesting.'",
        "'speaker_0': 'You have it's great. You have 2 minutes.'",
        "'speaker_4': 'Of your time. Support the staff so you can call the president of your state to cover themselves. You have been busy.'",
        "'speaker_0': 'Scuse me. We have. We. We have. We have your petitions. If you could please leave. That'd be great. I now this. Okay.'",
        "'speaker_4': 'Please.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Keep on fighting their way more than you have any of these issues. That's a very conservative trend to address.'",
        "'speaker_1': 'Thank you. Anyway, our catalyst was that these buildings were built in 1982 for a period of time where energy was cheap and there weren't considerations about pollution and contamination of our glass. Probably let's more heat in in the summer than it lets out in the wintertime.'",
        "'speaker_1': 'It's very inefficient. So we're replacing all the glass in the building, all the seals we've replaced, the boilers, we've put all LED lighting in the building in the first phase and we're re cladding the entire building. The second phase is to redo our parking garage to remove our old boilers chillers.'",
        "'speaker_1': 'All of those things put in heat pumps and to improve our energy efficiency along with our are architectural renovations of the building. So we believe that we want to reinvest in our properties. We want to keep them modern, efficient and well received by the community.'",
        "'speaker_1': 'So we appreciate you taking the time to look at our our approval process to rezone our building. And we would hope that you would do that. Thank you very much.'",
        "'speaker_0': 'Thank you, Mr. Martucci. Blake Maurer said better.'",
        "'speaker_1': 'That's not bad. I'm Blake Mauer.'",
        "'speaker_0': 'Mauer.'",
        "'speaker_1': 'I'm the architect here to answer any questions you may have. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Mauer. All right. Questions for members of council. All right, CNN. We're going to the comment section. Councilman, no.'",
        "'speaker_2': 'All right. Well, we're really proud of all that velvet's going on. And you're a great guy. We just got to live through it for the next two years. But this is going to be just spectacular, which is complete.'",
        "'speaker_2': 'And Marvin Tucci is a great business leader. His boss, Nordstrom, great business leader, Cherry Creek, and are doing a great job helping revitalize and and upgrade. Cherry Creek is going to be a gorgeous site when it's finished. So we're looking forward to seeing Bob's Hibachi will be the first building that really all will be complete on that'",
        "'speaker_2': 'east side of Cherry Creek and will be a sort of a good model for all the buildings that are coming. So is I think I said to my councilman, we had about 12 projects completed since 2013 and we've got actually 12 projects underway in Cherry Creek right now.'",
        "'speaker_2': 'So it's quite a change for Cherry Creek and is going to be something in the next two years. When we did the zoning process. Bob was one of our community leaders that helped with the zoning process and the planning process, and we predicted two and a half million square feet of new construction coming to Cherry Creek in'",
        "'speaker_2': 'the next ten years. So it's on the way right now, there's no question about that. So I'm really proud of the work that Bob does and what's this building is going to do. This is an opioid and it converting to the the standard zoning for Cherry Creek which is Cherry Creek each year agreed north A So I'",
        "'speaker_2': 'recommend approval for our colleagues and I think you'll be pleased when you see what's happening at your creek when we finish. Thank you.'",
        "'speaker_0': 'Thank you. Councilman knew I failed to mention that council bill 263 is closed. So sorry about that. Any other comments by members of council seeing? None. Madam Secretary. Rocco.'",
        "'speaker_5': 'New Ortega. Guy Sussman. Black. Clark. Espinosa Gilmore. Herndon. Cashman. Kinney. Lopez.'",
        "'speaker_1': 'Hi.'",
        "'speaker_5': 'Mr. President.'",
        "'speaker_0': 'I please close voting, announce the results.'",
        "'speaker_5': 'Sorry. It's not taking all the votes. Here we go. 12 eyes.'"
    ],
    "Ordinance to Extend Hours of Operation for Marijuana Stores and Centers.": [
        "'speaker_0': 'Yep. 12 eyes can smell. 263 has passed. Congratulations. Thank you. Councilman, who will you please put council bill 324 on the floor?'",
        "'speaker_2': 'I will do. Thank you, Mr. President. I'll move the council. Bill 324 be order published as amended. Oh, just.'",
        "'speaker_5': 'I just ordered published.'",
        "'speaker_0': 'I'm sorry. Order published.'",
        "'speaker_2': 'Move the council bill 324 be order published.'",
        "'speaker_0': 'That's right. Sorry. It has been moved. No problem. It has been moved in second. Councilwoman Black, will you go ahead and offer your amendment, which will notify business owners when the change in hours would take place in the event this bill passes?'",
        "'speaker_6': 'Thank you, Mr. President. I move that council bill 324. Mr. Nutter, I moved the Council Bill 324 be amended in the following particulars on page one, line 28 at the following language. Section three. This ordinance shall be effective Monday, May 1st, 2017.'",
        "'speaker_0': 'It has been moved in. Second, it comments by members of Council. Councilman Black.'",
        "'speaker_6': 'According to the city charter, a newly adopted city ordinance is effective upon final publication unless a definite effective date is provided in the ordinance. Sometimes there is public confusion about when final publication of a bill actually occurs. The purpose of the amendment is to clearly communicate to the public and to the marijuana industry the first date upon'",
        "'speaker_6': 'which any retail marijuana store or medical marijuana center may remain open until 10 p.m. will be Monday, May 1st.'",
        "'speaker_0': 'Okay. Madam Secretary, roll call.'",
        "'speaker_5': 'Black eye. Clark Espinosa I. Gilmore Herndon Cashman can eat. Lopez All right. New Ortega. My assessment. Mr. President.'",
        "'speaker_0': 'I have already announced results.'",
        "'speaker_5': '12 eyes.'",
        "'speaker_0': '12 eyes, Constable. 324 has been amended now. Councilman Ortega. Would you like to speak on your proposal that you want to offer in the next week?'",
        "'speaker_3': 'Yes, I would. And I am introducing it so that people can have the opportunity to speak to it tonight. Although it will formally be brought forward until next Monday. So basically what I am working on is in our city attorney will have some language to me this week that I will get out to all of you.'",
        "'speaker_3': 'So applications would automatically be approved to the new time of 10:00, except those that are awaiting a license, that have made an application to the city and awaiting demonstration, or to show them to demonstrate that they are in compliance.'",
        "'speaker_3': 'And in addition to that, those that are going through the show cause process, unless and until the application is granted in accordance with all applicable laws or the disciplinary action has been resolved. So it would be, again, the pending licenses and those that are going through the show cause process that would not be allowed to automatically extend'",
        "'speaker_3': 'their hours until they can demonstrate that they're in full compliance. So I will be bringing that forward on Monday night. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Ortega and Councilman Hernan understand that you want to have a conversation about one that you're going to bring next week.'",
        "'speaker_1': 'Yes. Thank you, Mr. President. And this should serve as no surprise to those because of the emails and phone calls that I've been getting. But the conversation has been solely about whether or not to increase marijuana hours. And as we started to look at the data about the current operating window that we have now, a majority of'",
        "'speaker_1': 'the dispensaries in the industry aren't even utilizing the full window of an 8 a.m. to a 7 p.m.. So I was considering a proposal to shift the hours so that would be more optimal and efficient where we'll increase the hours on the back end, but we'll also shift the hours on the front end.'",
        "'speaker_1': 'So that is a conversation that I've had with people within the industry as well as council colleagues, and I will consider bringing that forward in an amendment next week. It seemed more reasonable to discuss all the amendments at once versus one amendment today versus another amendment next Monday.'",
        "'speaker_1': 'So we'll have the opportunity to discuss multiple amendments next Monday. Thank you, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilman Hernan and Councilwoman Ortega. The one hour courtesy public hearing for Councilman 324 is now open. May we have the staff report? Councilwoman Black.'",
        "'speaker_6': 'Thank you, Mr. President. This is a bill that will extend store hours to 10 p.m.. Currently, marijuana stores and medical centers close at 7 p.m., which was an arbitrary time and a holdover from old medical rules. State law allows them to be opened till midnight.'",
        "'speaker_6': 'The original bill proposed midnight, but after having three committee meetings since January three, public comment period. We'll have another hearing tonight. We heard from I.N.S. that recommended 10 p.m. the committee a compromise to 10 p.m.. So I was really pleased with all of the work that we did and to come up with that compromise.'",
        "'speaker_6': 'Many of our surrounding jurisdictions have later hours and they have not seen issues related to crime or neighborhood issues. We've heard from Edgewater and Aurora. Again, I'll say that this is a practical matter. We are not adding new locations.'",
        "'speaker_6': 'The stores are already open. This is about convenience. It might mean increased tax revenue for Denver. Later hours do not contribute to the black market or youth usage. Law abiding citizens of legal age patronize these stores. They are not kids.'",
        "'speaker_6': 'They are not drug dealers. In fact, by having our legal stores open, we are actually undercutting the black market, which is a good thing and which is one of the reasons many people voted to legalize marijuana. Additionally, open storefronts are a deterrent to crime.'",
        "'speaker_6': 'Businesses are broken into when businesses are closed, not when they're open. And lastly, a few months ago, the Denver Post editorial board recommended that the city council extend store hours. So I look forward to hearing the public comments.'",
        "'speaker_6': 'And please also feel free to comment on both Councilman Herndon and Councilwoman Ortega's proposed amendments. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Black. We have ten people signed up tonight. To all of our surprise. And so I'm going to call the first five speakers up. I think you can come up to the first bitch and then we'll call the next five up.'",
        "'speaker_0': 'So I will call up John, Eduardo, etc. and use sort of. Hiney, Leslie. Rudolfo Gonzalez. Nick Lovullo. And Tiffany Goldman. Mr. of your first.'",
        "'speaker_1': 'First, I'd like to thank the council for letting me speak to you about this important issue. I'm here representing said we are saying we support the extension of the hours. We understand that every hour that there's a legal dispensary open is taking time away from the black market and dealers that are actually selling to underage people.'",
        "'speaker_1': 'We want them to disappear and we want it to be a perfectly legal, legal, regulated industry. And therefore, we support this. Also, one of the very important things to us, two other points is one of them is businesses should decide when they open and they closed, except obviously the 10:00 closing hours for everybody.'",
        "'speaker_1': 'So we would like to the 2 hours that they're talking about cutting it down the morning, it would allow access for people to work in the afternoons to go early in the morning. So we're opposed to any reduction on the hours from.'",
        "'speaker_1': 'We want it to be from 8 to 10 because that way people that work in the afternoon can go there in the morning and get their marijuana. And same thing to 10:00. People who work during the days can go and get there.'",
        "'speaker_1': 'And we believe it's very important for people to have that access. And we very much do believe that dispensaries eliminate the black market. And that's why we're in support of the hours.'",
        "'speaker_0': 'Thank you, Mr. Kenny. Lesley.'",
        "'speaker_6': 'Good evening, council members. My name is Hanni Lasley and I'm one of the co-founders and the executive director of Smart, Colorado. As you all know, Smart Colorado formed after the passage of Amendment 64 in 2013 when we legalized and commercialized recreational marijuana for individuals over the age of 21, Smart has thousands of supporters across the state, including'",
        "'speaker_6': 'hundreds of citizens in Denver. We are a nonpartisan, nonprofit organization that voted both for and against legalization. We formed when Public Health and Safety around Colorado, kids ranked last among our state policymakers. We've also worked closely with Denver City Council and Denver citizen groups.'",
        "'speaker_6': 'When Denver decided to opt in for commercialization. Our sole purpose is to protect kids from the unintended consequences of marijuana. Smart does not take any state or local tax revenues, and we receive donations from everyday citizens as well as private foundations.'",
        "'speaker_6': 'We'd first like to thank you for your willingness to examine the ordinance, for taking it down from midnight until 10:00. We do appreciate that very much, because our big concern about this ordinance is twofold. Number one, that it's being considered at the same time as the initiated ordinance 300.'",
        "'speaker_6': 'Rules and regulations are being rolled out. That is a very large policy shift for this city. And to add another one on top of it does not really allow us to properly vet the impact to our kids. So we would just like to thank you for your consideration around that.'",
        "'speaker_6': 'And also just the concern that we all know that additional accessibility in alcohol and tobacco do lend to greater youth use. And while we don't have the data yet around marijuana, this is a concern as we're the first to do it.'",
        "'speaker_6': 'And Denver is really the epicenter. So we'd like you to we first like to thank you again for your consideration on 10:00, but we would ask for your consideration to delay the implementation of this ordinance after we've had a chance to vet the impact of the initiated ordinance 300.'",
        "'speaker_6': 'And with that, I thank you.'",
        "'speaker_0': 'Thank you, Miss Leslie. Rodolfo Gonzalez. Okay. Nick Lovullo. You have 3 minutes.'",
        "'speaker_7': 'Hello, Nicholas, from five points. Councilman Brooks Mayor. Representative, I will say that I'm pretty disappointed after all of these meetings since January and all the input from the city and the best to come out with a three hour extension.'",
        "'speaker_7': 'I don't know if you didn't look at the data that was presented. We've got law enforcement officers counting on one hand the number of marijuana crimes that have occurred in the last five years. I don't understand the source of that.'",
        "'speaker_7': 'I don't I'm not even sure how you would arrive at the conclusion that it's a prudent decision to shut off all of the legal avenues for marijuana purchases when the black market is at its most active after 10:00 at night when people are out.'",
        "'speaker_7': 'I think it's frankly reckless for you to not increase the extended, extended dispensary hours till midnight when we are going to have marijuana clubs and increased people, increased number of people and number of businesses that are offering places to consume.'",
        "'speaker_7': 'I don't understand how you think it's prudent. I don't think you can even escape that argument. So I would say over the last three months, it was a pretty lousy rally as far as these council committees were going.'",
        "'speaker_7': 'I would like to submit an amendment. Let me just skip to the end because I'm. I would like to submit an amendment that the dispensaries set their own hours within the timeframe already established by the state. And you guys don't have a say in it, and the state can do whatever it wants.'",
        "'speaker_7': 'And, you know, this is a battle we don't have to fight every single time. And every single time this comes up, there's always posturing. You know, we always you know, we want to shift the dispensary hours. All we want to, you know, eliminate the dispensaries that just complicate things.'",
        "'speaker_7': 'It's absurd, you know? And then, you know, the marijuana at the marijuana special committee, we got to hear from Smart Give Smart Colorado a platform at the first of all, they're not even the topic wasn't even germane. Second of all, the prisoner no offense.'",
        "'speaker_7': 'I mean, I don't know when she's sitting up here and waits in line like him, like me and voices her opinion. But she's not even one of your constituents. She's even live in Denver. I don't even know why that why they were given a platform.'",
        "'speaker_7': 'All these quotes in The Denver Post that you guys, you know. Well, prohibition doesn't work, but 12 midnight is a nonstarter. So prohibiting sales at 10:00 will work somehow. I'm not sure how that works. Dispensaries are bad neighbors.'",
        "'speaker_7': 'My residents say, well, I mean, who's poppin who's popping caps off in northeast Denver? Is it the dispensaries? The drive by shooting and the marijuana deal gone bad and sunny side that that that drive by shooting happened at 1145.'",
        "'speaker_7': 'Maybe if the dispensary was open at midnight, the guy wouldn't have shot up a house. He would have gone shot as a bartender. That'd be something. I mean, we'll never know. It's just at this point, after all of this deliberation, I'm running out of time.'",
        "'speaker_7': 'But midnight to no brainer. It's not a prudent decision to shut off the legal avenues for emergencies.'",
        "'speaker_0': 'I was just going to say you ran out of time. Thank you. Thank you, sir. Mr. Lovato. All right. Tiffany Goldman.'",
        "'speaker_5': 'Hello. My name is Tiffany Goldman. I'm in Denver. Accident. I'm here today on behalf of the health center. All of our facilities are located here in Denver. And I'm proud not only to work and live in this beautiful city.'",
        "'speaker_5': 'And thank you for giving me the opportunity to speak today. I'm here today to support later hours of operation. A business should have the right of decision making for each and every aspect related to business processes. I am in support of hours of operation from 8 a.m. to 10 p.m..'",
        "'speaker_5': 'I understand that Denver decided to reduce these hours originally to see where the cannabis rollout would go. I do believe we can all agree it has been hugely successful. I believe we are the pioneers in this industry. I'm not completely sure why.'",
        "'speaker_5': 'Denver, one of the fastest growing cities in the United States, would not ground a business the rate of operating their business hours in conjunction with state law. As we know, the world is watching. Colorado cannabis should be treated like other businesses.'",
        "'speaker_5': 'Not only do I believe in business rights, but the increase in job opportunities would be astronomical for this city. It's my understanding that there is a proposed amendment to this bill change the hours from ten to term. This is a little concerning to me since many of my single parent family employees would lose their ability to pick'",
        "'speaker_5': 'up their children from school after their first shift. Thank you.'",
        "'speaker_0': 'Thank you, Miss Goldman. All right, the next. Aubrey Lavoisier. Margie Valdez, Kay Gallagher. Please say your full name when you're up here. Kristy Kelly. And Rudolfo Gonzalez again.'",
        "'speaker_5': 'It's a different person.'",
        "'speaker_0': 'Oh, it's a different Rudolfo. Okay, well, maybe Rodolfo Gonzales number two can come up. All right. Aubrey. Yes.'",
        "'speaker_2': 'Thank you, Councilwoman Brooks. My name is Doctor Aubrey Labrador. I am a member of the Order Advisory Group from Denver Health and Environment or Environmental Health, and also the Social Consumption Advisory Committee of Excise and License. I'm here to support the extended marijuana dispensary hours, and I am opposed to amendments when the state of Colorado allowed extension'",
        "'speaker_2': 'of marijuana dispensary hours. Denver did not follow suit. I'm going to propose to you that it was maybe a boogeyman in a closet kind of mentality, a fear based regulation about some boogeyman named crime. But marijuana related crime in Denver has decreased every year since 2012.'",
        "'speaker_2': 'Marijuana. And that's courtesy of Denver. Gov dawg. Marijuana adult use in Colorado is unchanged, but higher than the national average. That's courtesy of Colorado Department of Health. Marijuana adolescent use is unchanged but is lower than in 2013, and in fact, it is 21% in Colorado versus 22% of adolescents nationally.'",
        "'speaker_2': 'It's and it's actually less than adolescent alcohol use, which in Colorado is 30%, according to Colorado Department of Public Health. So I'm going to say marijuana is not the boogeyman in the closet. Unlike alcohol, which is a friend in your liquor cabinet, alternative will.'",
        "'speaker_2': 'Alternatively, Denver's 7 p.m. rule, including any amendment, is a form of command economy existing in socialist countries where businesses operate under strict guidelines of the state, guidelines that impede commerce, free trade and competition, thus creating black market economies.'",
        "'speaker_2': 'But Denver is a free market economy. There is a supply and demand economy functioning under necessarily minimal government regulation. Free market economies, unlike socialized command economies, foster competition resulting in better, cheaper goods and more jobs. And in the case of the marijuana industry, jobs that pay higher wages with benefits.'",
        "'speaker_2': 'Overly restricting marijuana dispensary hours is a socialist government intervention based on boogeymen in a closet, fear of increased crime. But stats show crime is on the decline. For over 40 years, I have been fortunate to have been an entrepreneur and business owner in Denver, a city in which I am privileged to pay my fair share of taxes'",
        "'speaker_2': 'and to provide jobs with benefits to my employees, allowing me to serve my community without the restrictive oversight of when I may open and close my business. I ask that City Council pass the bill as it stands, allowing businesses to operate from 8 p.m. to 10 p.m..'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Dr. Margie Valdez.'",
        "'speaker_6': 'Good evening, counsel. My name is Margie Valdez. I'm the chair of the AMC Entertainment Good Cooperation Zoning and Planning Committee. The Zoning and Planning Committee also has the responsibility for both alcohol, liquor and marijuana. At our February 25th, 2017 meeting, it was primarily focused on marijuana.'",
        "'speaker_6': 'We discussed the social consumption issues, and that took a great deal of time that even that morning after the social consumption discussion, we discussed the extension of hours for marijuana stores. One could almost say that after the social consumption, it would have been the ZAP committee members decision to oppose the anticipated bill for extension of hours.'",
        "'speaker_6': 'However, SAPP members are very, very astute. They understand the language, they understand the issues. We voted on the extension of hours to 10:00 at night. We felt like it was a fair compromise and that we did not discuss the extension of the hours, the 12 hours.'",
        "'speaker_6': 'I'm unable to speak to that tonight. We will be having that meeting on Saturday. I have always gone back to the delegates. I've always advised the delegates of what does that committee is recommended. And I we also post everything on our website.'",
        "'speaker_6': 'So we try to be as diplomatic and fair and transparent as the RNC can be. So with that, I, I can say that I can see that committee is in full support of the extension of hours till 10:00.'",
        "'speaker_6': 'Thank you very.'",
        "'speaker_0': 'Much. Thank you, Miss Valdez. Kate Gallagher, please say your first name, sir. Thank you. I'm Kevin Gallagher. I'm with the craft concentrates. We are headquartered here in Denver. I'm also with the Cannabis Business Alliance, and we are definitely in support of extending hours of operations for dispensaries here in Denver.'",
        "'speaker_0': 'I think it just all comes down to economic freedom. We should be treated just like any other business. And I think this is definitely the step in the right direction. I would really like to talk about Councilman Herndon's proposed amendment.'",
        "'speaker_0': 'We are very concerned with that. We think shifting hours is a terrible idea. We personally haven't heard any benefits from Councilman Hurd in that this would be a benefit. I'm not familiar with any other cities that have hours from 10 a.m. to ten p.'",
        "'speaker_0': 'I think that's very confusing for patients and customers alike. Also, many deliveries occur in the morning before 10 a.m. We like to deliver in the morning where it's safe. It's light outside. In the morning, there's less crime. So let's just make this more convenient for the consumers.'",
        "'speaker_0': 'Let's get the additional tax revenue. We also heard from Denver police and the mayor of Edgewater last meeting and they were no drawbacks with extending hours. So, again, we hope that you offer your support for extending hours from 8 a.m. to 10 p.m..'",
        "'speaker_0': 'Thank you. Thank you, Mr. Gallagher. Christie Kelly.'",
        "'speaker_6': 'Thank you again. Members of Council and Council President Brooks. My name is Christie Kelly and I'm the executive director of Marijuana Industry Group. I'm also a resident of Denver, and our organization is based in Denver. I have spoken with the other industry groups as well as a number of unaffiliated businesses in the city of Denver, as well'",
        "'speaker_6': 'as our membership. And we are unified in support of council bills 17 324 that would allow licensed marijuana businesses to remain open from 10 a.m. or excuse me, from, from 8 a.m. to 10 p.m.. We understand that there are amendments that are being considered that would contemplate further restrictions on the licenses.'",
        "'speaker_6': 'We welcome seeing those proposals and would happily entertain them at the point where they are proposed. However, in industry right now, there is unilateral support of the bill as it stands with Councilwoman Black's amendment as proposed today. I'd like to address the concern that was raised earlier today and in previous meetings about the earlier hours of operation'",
        "'speaker_6': ', creating a portal for youth access. It's been a long time since I've been in high school or junior high school, but it's my understanding that in the city of Denver, junior high schools open sometime between 730 and 8 a.m..'",
        "'speaker_6': 'It's my understanding that in Denver, high schools open sometime between 730 and 7:45 a.m.. So consistent with our earlier chain of conversations, law abiding students, just like law abiding adults, should not be affected by a preservation of the ADA.'",
        "'speaker_6': 'Opening time for dispensaries. Thank you very much.'",
        "'speaker_0': 'All right. Thank you, Miss Kelly. Last but not least, Rodolfo Gonzalez. Number two. Okay. Thank you. All right. This concludes our speakers questions by members of council. All right. Council bill. The public hearing for Council Bill 324 is now closed.'",
        "'speaker_0': 'Comments by members of Council Councilman Blackwood. Would you. This is. This is your bill. Would you like to go first or.'",
        "'speaker_6': 'I've already said everything I need to say. Great. This is first reading, so hopefully we can save much of our discussion for next week. But thank you.'",
        "'speaker_0': 'Thank you, Councilman Ortega.'",
        "'speaker_3': 'So I first want to make a statement about an attack that was made on one of our speakers. And I think that's totally unfair. This is an open process where everybody has an opportunity to come and say their piece, and I particularly am grateful for the input that we have had from Smart, Colorado, because I know that'",
        "'speaker_3': 'it is not always a comfortable position to be the sometimes the only voice in a room speaking on behalf of children and as a grandmother of small children, I think that the concern about the impact to our kids is is a real issue that we need to constantly be cognizant of.'",
        "'speaker_3': 'I'm not sure that we have really taken a careful look at any of the unintended consequences. You know, we know as a city we're spending a lot more money on our homeless shelters as a result of more young people who have moved here that have ended up homeless.'",
        "'speaker_3': 'So that's one unintended consequence. But I think that as a city, having a balanced discussion is an important part of this conversation. And to do it where it should only be the industry speaking and trying to dictate what they want is absolutely wrong.'",
        "'speaker_3': 'This is, you know, a forum where we always want to hear from all sides. And it's why I appreciate Councilwoman Black ensuring that we had a second public input session where we got to hear from folks from the community as well as industry folks.'",
        "'speaker_3': 'I think this is an industry that has, by and large done a good job and have followed the rules. I think as a city, we've been very generous. And just because state law allows something doesn't mean as a city, we have to do what state law says is allowable.'",
        "'speaker_3': 'And this is one industry where we know that because marijuana is not legal at the federal level, that we have the discretion to be stricter than what state law requires. So I'll save some of my additional comments for next week.'",
        "'speaker_3': 'But I do want to point one thing out, and that is that when you look at how many stores our neighboring jurisdictions have compared to Denver. Arvada doesn't have any. Aurora has 23. That's the largest number next to Denver.'",
        "'speaker_3': 'Then when you go down to Commerce City, they have four. Edgewater. They have six Inglewood. Three Federal Heights. Three Glendale. They have seven. Golden has one. Lakewood. They have 12. Lewis feel they have to. Mountain View has to.'",
        "'speaker_3': 'North Glenn has six. Thornton has seven. Wheat Ridge has five. Adams County has four. And Arapahoe County has two. Denver has 218. So when you look at that number, you know, requesting that we have the opportunity to ensure that those that are pending applications, those that are going through the review process, I don't think it's unreasonable to'",
        "'speaker_3': 'ensure that they are in full compliance before we allow them to move forward. So I'm looking forward to further conversation next week. I'm going to abstain from the vote tonight because I want to be able to have the the further conversation on the two amendments that we're going to have next week.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Thank you. Okay. We I, I appreciate that. We're in the council comment period and we got to keep it that way. Council. Councilman Herndon.'",
        "'speaker_1': 'Thank you, Mr. President. This is on publication, so we're making a decision whether or not to publish the bill. I am comfortable with that. So I'll be voting in support and I look forward to the more in-depth conversation we as a body can have about the two amendments coming forward next week.'",
        "'speaker_1': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Herndon, Councilman Lopez.'",
        "'speaker_8': 'Thank you, President Brooks. You know, I. I wanted to make a comment. I wanted to make a comment before we. Move to the next part. On another day, we would actually I think we'll be more commenting on the on the amendments themselves.'",
        "'speaker_8': 'I don't want to comment on that. I don't want to comment on where we're at now. And I do understand I do understand the message and what folks have said in this in these chambers. And I do appreciate that.'",
        "'speaker_8': 'I absolutely do. You know, I've I keep saying this does sound like an old man. I start feeling like Charlie Brown and he was here. But I've been here to see this develop when it was, you know, Amendment 2064, the decriminalization, not necessarily in that order, but to regulate it from from day one.'",
        "'speaker_8': 'And you know, I have to I have to admit, I was very skeptical at first. Absolutely, very skeptical. But you got to understand, I grew up around the bad side of it. And before it was regulated, I grew up seeing the abuse, not just from from weed, I mean, from other substances.'",
        "'speaker_8': 'And it was, you know, like alcohol. Other drugs. I saw it. I lived it. I felt the effects of it as a kid. Right. People in my neighborhood being gunned down over stuff like that. And that's absolutely the lack of regulation.'",
        "'speaker_8': 'But it's also regulation that achieves a balance as well, too. There's a level of responsibility that we can't just go gung ho and say, okay, let's just do all of it all at once. Bam. You know, we're catching up to a very clumsy 80 some odd years of.'",
        "'speaker_8': 'Liquor regulation. That's still I think is is very antiquated because I think it's a it's a much more dangerous substance. My issue, my neighborhood has always been the over proliferation of liquor stores in the west side. And there's some people that may shake their heads.'",
        "'speaker_8': 'Well, it's just business. It's the economy. Don't mess with the business. Don't mess with with the market. We have to because sometimes it's unjust and it plays out in an unjust way. You try to find grocery stores in our neighborhood, you'll find more liquor stores.'",
        "'speaker_8': 'And that's not right. So, yes, our regulations have to have to come into play in our actions on this dais and with and folks in the excise and license have to do it as well, too. But like I said, I started with skepticism.'",
        "'speaker_8': 'But I find myself now when I meet with colleagues from around the country and other city councils and other counties in other states. Being a champion of what we do here in Denver. Hearing their fears, hearing their hysteria kind of is like, oh, we've been there, done that.'",
        "'speaker_8': 'Don't worry, it doesn't create crime. It actually reduces it. And that's the message that we're able to do. But it takes time and it takes time for any for whatever your cause may be. It takes time to convince people of that cause their own personal experience, their own hands in it, their ability to actually see it right'",
        "'speaker_8': 'and see how the system works. And it's working. I mean, there's a lot of kinks, don't get me wrong. There's there's a lot of little there's some minor minutia. And we'll expect this. And we said this a while back that we'll expect something like this.'",
        "'speaker_8': 'We expect to be tinkering with this as we go. But my point is, is that look. The hours are being extended. That's a plus. As a testament to the industry, to the responsibility, to those standards that are being upheld.'",
        "'speaker_8': 'It's a testament to our ability to regulate it. And you're always going to have different amendments and different ideas and different ways to tinker with it in this dais. And it should not be limited. I had a we had a bunch of folks up here that were growers.'",
        "'speaker_8': 'Not very many of them lived in Denver. We're very reflective of the of the makeup of Denver. Not very many people of color out here. Right. And under those stanzas, they get the heck out of here. Go to your own cities.'",
        "'speaker_8': 'No, we heard everybody. Right. And that's that's what I want folks to understand, is this is this isn't just something that happens in a vacuum. This is something that has been we've been working on and working on and trying to achieve this.'",
        "'speaker_8': 'But at the end of the day, use my example. Right? I have my own personal feelings about it. I have my own personal experiences about it. Not always positive, but it's not about what I believe personally. It's about what we can achieve as a city to achieve that balance and move forward.'",
        "'speaker_8': 'Because I think we are absolutely headed in the right direction. Having said that, I can't wait to debate the merits of the other amendments and everything else and hear from people in our next go round and city council.'",
        "'speaker_8': 'Appreciate it. Thanks for bringing the bill forward and I'm glad to be part of it moving forward.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Councilman Espinosa. Yeah. I wanted it first thing, Councilwoman Ortega for her comments. The. You know, we keep talking about marijuana, marijuana, marijuana and marijuana. And I think we approved that overwhelmingly a couple of times.'",
        "'speaker_0': 'I don't have that level of approval in my district the way we voted for legalization on this issue. And it comes from for a reason. We don't have always the best actors in this industry operating their businesses. It is a position of privilege with this finite, limited number of licenses that it is too burdensome to operate with'",
        "'speaker_0': 'extended hours, whatever, in whatever capacity or or later hours if it's not extended hours. There are plenty of people waiting to take those licenses and operate that business for you. That said, we're not just talking about marijuana. We're talking when we legalized marijuana, we legalized THC.'",
        "'speaker_0': 'And we are getting concentrations and dosages that are off the charts. Nothing like what you smoked in the seventies. You know, this is and that's legal and it's being sold. And people are dosing far more than what you would get in a through a through a joint.'",
        "'speaker_0': 'And so there are consequences there unintended consequences. And so I think being sensible, reasonable and expanding our businesses opportunities rationally is perfectly sensible. And, you know, it is not like any other business. You can't take your credit card payment.'",
        "'speaker_0': 'You can't do this. You can't do that. It's not it's not selling jewelry. It's not. I mean, it's close because there's still a lot of the security related, but it's not. So I do I just want to be mindful of that, that as much as somebody from a with a different vantage than me, I never I never'",
        "'speaker_0': 'was six feet tall or white or black or anything else. I mean, I would have a different perspective. And so that's what we do when we're sitting here. We try to take in as many perspectives as possible, at least I do, as a representative of of 50,000 plus people.'",
        "'speaker_0': 'I need to understand where everybody is coming from to make a more measured and calculated and reasonable and rational decision. And I would expect you to want us to do that across the board. I try to. So with that said, I forgot to ask a question.'",
        "'speaker_0': 'So to the gentleman, I won't ask you the question. Now, I'm going to ask you the question, but I'd like you to follow up with me on email, because I didn't understand the comments about deliveries because I just didn't know if, like other businesses, they can take deliveries during their non operating hours.'",
        "'speaker_0': 'I didn't know if that was it was a delivery service or actually picking up stuff or there were limitations. So if you could explain that, I would truly appreciate that. Thanks. With that, I'll look forward to the next meeting.'",
        "'speaker_0': 'Thanks. Thank you. Councilman Espinoza, seeing no other comments, I'll just add to this is it's a fascinating conversation. I am a little bit like Councilman Lopez since the adoption. I've been in an incredible evolution of this. And I've come quite a ways as well with with three young kids and neighbors that partake regularly.'",
        "'speaker_0': 'You guys remember those who have been on who were on the council prior when we had the conversation about smoking on your porch, you remember that conversation that happens in my neighborhood all the time. But my kids are okay.'",
        "'speaker_0': 'They're eight, five and ten years old. They're okay. They're doing great, actually. And we've had great conversations around this. And I understand the fear and the paranoia if you don't engage and if you're not in a community like that.'",
        "'speaker_0': 'But I've come a long way personally. We up here have two conversations that are always there. We're always talking about it's a policy conversation and it's political. The policy conversation is. Should we take the hours and make it parallel with the state?'",
        "'speaker_0': 'And it's kind of a funny conversation because me being honest, Denver is always ahead of the state in many things, much more progressive than the state here where we're a little bit behind. But should we? The policy question, should we match?'",
        "'speaker_0': 'Are ours with the state? And then a political question of what does the what can the community endure? What, what, what's pal palatable to the community? And that's what we always must have the conversation around if the bill before us is extending to 10 p.m..'",
        "'speaker_0': 'And I believe. We have the 10 p.m. time because that's what's palatable to the community. There's there's not a whole lot of policy for me, a whole lot of strong policy conversations around why not ten? Because why not 12?'",
        "'speaker_0': 'The state is set at 12. Why not? Give this business. Their legal rights as we give other businesses, too, to be said at 12:00. So it's just a question for for me to to give to counsel as we are considering this for another week and considering the amendments.'",
        "'speaker_0': 'What what is the policy reasoning for 10 p.m.? And let's make sure we know what it is and not just. Oh, I think everybody. I think that's a fair. Placement of time for this community, in this community and the community at large.'",
        "'speaker_0': 'I want us to really think about that. I'll be voting in favor of this and look forward to the debate next week. Madam Secretary, roll call.'",
        "'speaker_5': 'Councilor. Councilman, you need to make a motion. To order, publishers amended.'",
        "'speaker_0': 'Oh, yes. Thank you, Madam Secretary.'",
        "'speaker_2': 'Thank you, Mr. President. The Council will 324 be ordered published as amended.'",
        "'speaker_0': 'It has been moved. And second it Secretary Rocco. So.'",
        "'speaker_5': 'Black Eye. Clark Eye. Espinosa Gilmore. Herndon. Cashman. Kinney. Lopez. I knew Ortega. Sussman. Mr. President.'",
        "'speaker_0': 'I. Please go to the voting results.'",
        "'speaker_5': '11 eyes, one abstention.'",
        "'speaker_0': '11 Eyes, one abstention. Council Bill 324 has been ordered published as amended. Final consideration will be Monday, April 24th. On Monday, May 15. Council will hold a required public hearing. Council will three six to change zoning classification of 689 West 39th Avenue, 700 West Fourth 40th Avenue and 725 West 39th Avenue in Globeville require public hearing for'"
    ]
}