{
    "Rezoning of 4885 and 4889 South Quebec Street in Southmoor Park.": [
        "'speaker_12': 'You see the proximity. This is looking south from Quebec, simply from the light rail station into the subject site. And so this is looking at surrounding properties. This is looking north again, showing the proximity to the light rail station and the currently vacant site to the north and looking towards Union Avenue.'",
        "'speaker_12': 'And then looking south from Quebec again, but showing the park and ride, which is directly east of the subject's site in the Arapahoe County enclave here. It's a pretty small park and had only about 60 spaces here. And so this is looking south across Shenango, directly south of the subject site.'",
        "'speaker_12': 'And this is one of the newly constructed buildings, I believe this one's 211 feet, about 15 stories. And so this is looking kind of south southwest from the subject's site. These are the approximately 80 feet tall buildings, mixed use buildings.'",
        "'speaker_12': 'And then looking north more towards the currently vacant but again rapidly changing area. We're seeing lots of development activity in this area. This is kind of zoomed out looking at the subject site kind of in the larger context of the the tech center on the Bellevue Avenue and I-25 interchange.'",
        "'speaker_12': 'So you see the subject site called out on the right hand side of the screen in the context of several office buildings. And then looking east of the subject's site, there are several buildings that are over that 200 foot threshold as well.'",
        "'speaker_12': 'And so the rezoning process to date has been our typical rezoning process. I will note the planning board on December 5th did vote for approval of the rezoning by a vote of 8 to 1, and they did of note they did discuss some of the infrastructure issues that were raised at that meeting and were also raised in'",
        "'speaker_12': 'some letters that should be in your packet, and we can all note those in the next slide. But ultimately, they decided those those infrastructure issues were concern, but not related to the rezoning criteria. And so of note, there was a protest petition filed per the Denver zoning code.'",
        "'speaker_12': 'There's a provision for legal protest that was filed. And staff did look at the protest petition and determined that the minimum threshold was met. And so therefore, council would need ten votes tonight to pass this rezoning. So the public outreach, there are actually no neighborhood specific registered organizations.'",
        "'speaker_12': 'But we did receive two comments, both from the Belleview Station Metropolitan District expressing concerns about the development intensity on the subject site and potentially negative impacts on the infrastructure within the district. And also that the rezoning is inconsistent with the Bellevue Station General Development Plan.'",
        "'speaker_12': 'And so these are the criteria that staff uses to evaluate each of the rezonings and formulate our recommendations. So I'll go through each one. So in terms of the first criteria, consistency with adopted plans, these are the only two adopted plans that that are applicable to the subject site.'",
        "'speaker_12': 'These are both citywide plans, the Denver Conference of Plan and Blueprint in Denver. Of Note the subject site is not in the Bellevue Station General Development plan. So in looking at some of the policies that staff listed in more detail in the staff report for the Denver conference, a plan again, a citywide plan, staff did find in'",
        "'speaker_12': 'its analysis that the request is consistent with several conference of plan policies. I'll sort of paraphrase them, but mostly related to encouraging infill development and more density at transit nodes and sort of encouraging use of transit in those areas.'",
        "'speaker_12': 'The site is certainly right next to a light rail transit station, so staff does find the requests consistent with those policies. And so on to Blueprint Denver, the other citywide adopted plan. So two kind of map based designations for the subject site.'",
        "'speaker_12': 'One is that it's in an area of change, and two, that the future land use is transit oriented development. So area of change, a couple of policies to kind of lift up here. One, these are areas per the blueprint policies where new growth can best be accommodated and in particular does cite areas adjacent to or near transit'",
        "'speaker_12': 'that have not realize their full development potential. And actually, blueprint does identify the Bellevue Station area as one of the greatest potential opportunity areas for for transit oriented development. And again, this being a transit order in development area, very consistent with that land use designation in terms of its correlation and relationship to the mass transit system and'",
        "'speaker_12': 'an area per blueprint where the city should encourage compact mixed use mid to high density development. So other kind of non based policies that you cited in the staff report from Blueprint similar to the comp plan in terms of supporting trends in support of land use and development in and around transit stations and to concentrate the most'",
        "'speaker_12': 'intense types of development around transit stations. So staff in its analysis did conclude that the rezoning request was consistent with Blueprint Denver for a number of reasons, but it's a paraphrasing here one that the rezoning would support mid to high density development and a transit oriented development area, a site being adjacent to the light rail station.'",
        "'speaker_12': 'Again, two, that the rezoning would support redevelopment of a site that has not realized its full development potential. And looking at the current restrictions on the building height, certainly an area that is not going to be able to see its full development potential in a total area with those restrictions.'",
        "'speaker_12': 'And then lastly, the rezoning would eliminate a former Chapter 59 Custom Zone District, which is a policy that blueprint never supports doing. And so one other document to cite. So this is not an adopted plan, but staff did site it in the staff report.'",
        "'speaker_12': 'In its analysis, the city in 2014 did a transit oriented development strategic plans. This is a mayor led initiative with some general policies and recommendations for Todd areas and it did call out the Bellevue station area as an opportunity area and called it out as an urban center.'",
        "'speaker_12': 'And kind of with that designation, those being the areas that are higher density in multimodal areas and areas, up to a maximum of 20 stories. The second criteria, uniformity of district regulations. That's just essentially saying that the rezoning request, the zone district regulations will be consistent across the site.'",
        "'speaker_12': 'That will be the case. So that finds that criteria is supported by the rezoning. Third, the criteria to further public health, safety and welfare staff finds that the rezoning request is consistent with that criteria, primarily through implementing adopted plans for policies that were previously cited, but unrelated to eliminating a former Chapter 59 custom zoned district and the'",
        "'speaker_12': 'fact that both Blueprint Denver and the Comprehensive Plan support increased development intensity on this specific site in the specific area. Force criteria justifying circumstances. The fact that this reasoning would would remove an old code Chapter 59 Customs Zone District in itself as a justifying circumstance and bringing in the new code so that criteria is met.'",
        "'speaker_12': 'And then you could also cite the surrounding redevelopment pace that's happening in this area as a justifying circumstance for the rezoning. And then lastly, the consistency with the scene in the Urban Center Neighborhood Context Zone District, Permanent Purpose and Intent staff does find the rezoning request consistent with that criteria, primarily because it promotes a mixed use development'",
        "'speaker_12': 'where an adopted plan or plans supports larger scale TOD with excellent multimodal access. And staff does recommend approval of the rezoning, and I'd be happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. Tonight, we do have 20 individuals signed up to speak, so I'm going to call the first five and then call five at a time. If you if I call your name, if you can come up to this front bench and be ready to jump right in when I call your name to come up'",
        "'speaker_0': 'to the podium, because we'll start your time as soon as I call your name. So the first five that we have tonight are Jack Roy Tolle, Tommy Negro, Paula Williams, Howard Pollak and Taylor Hilliard. And Jack. Rose Voight.'",
        "'speaker_0': 'So you're up first. Good evening, Mr. President.'",
        "'speaker_13': 'Members of Council. My name is Jack Rizzoli, 1801 California Street, Suite 2600 Denver, Colorado. 80202 I'm here tonight on behalf of the applicant. And my sole purpose really here tonight is to is to lend additional support to the staff report.'",
        "'speaker_13': 'I think the staff report did a robust and admirable job of analyzing the zoning criteria before you and I would I would suggest that you you have that by your side when you're considering this decision. I'm actually I actually authored a letter that I believe became is in your packet.'",
        "'speaker_13': 'And it really was in response to the Metro District's letter that really took exception to only two parts of this, the rezoning criteria that you heard. One was consistency with the adopted plans, and the other one was for furthering the public health, safety and general welfare.'",
        "'speaker_13': 'The major thrust of the letter from the district is that you should be looking at the the Bellevue GDP. I think staff has suggested appropriately that that's not a plan before you. We are not in the GDP boundaries.'",
        "'speaker_13': 'And no matter how much twisting somebody might try to do, you can't we don't find ourselves in there. So we're we're not bound by those by that plan. Similarly, I I the they raised some concerns with regard to the health, safety and welfare and they mentioned they mentioned height and they mentioned density.'",
        "'speaker_13': 'As your staff has already suggested, this is this height and this proposed height and density is completely consistent with the adopted plans, and it's also consistent with the statements of the Metro District President and master developers in front of planning board.'",
        "'speaker_13': 'And I have supplied a record of that, of their transcript in front of Planning Board that you could you can make reference to. But essentially their comments were they were in front of planning board that we have no problem with the density.'",
        "'speaker_13': 'This is a TOD site. Of course we expect density. So between planning board and tonight, we find ourselves here contesting with with a letter that seems to indicate that the height is way too high and the density is way too too dense.'",
        "'speaker_13': 'I would suggest that it has nothing to do with land uses or proposed development. It has to do with infrastructure. And I would I would respectfully suggest to you that where the infrastructure is granted or where where we could get it, that is not something that city council should look at with regard to rezoning.'",
        "'speaker_13': 'That's the purview of site plan and it will be further discussed and vetted at that point. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Tommy Nigro.'",
        "'speaker_6': 'Thank you, council members. Appreciate your time tonight. My name is Tommie Negro. Addresses 4949 South Niagara. I'm here representing the applicant. I'm with Stonebridge Companies and we are a Denver based hotel developer, owner operator that is again based here in Denver.'",
        "'speaker_6': 'We were founded in 1991, have 21 hotels in Colorado with four currently under development. So we're long term owners, operators, and we are part of the community here. The way I look at I think this is a fairly straightforward decision when you look at the criteria.'",
        "'speaker_6': 'We own a property that was developed in the mid-nineties predating the district and the light rail station. It's currently characterized by a two story low rise, deteriorating motel that is surface parked and is not very esthetically pleasing. What we want to do is is transform that site across from the light rail station into a very high quality'",
        "'speaker_6': 'mixed use development that consists of ground floor retail, hotel rooms, you know, very high quality, four star, you know, level. A new hotel is not been built down in the tech center, at least a full service hotel in about 30 years.'",
        "'speaker_6': 'We think that's an amenity that the area is sorely lacking and that's what we do. So we'll develop something very high quality combined with with office as well. Part of that will be certainly some public improvements, sidewalk lighting, landscaping that users of the neighbors, certainly tenants of ours, can enjoy.'",
        "'speaker_6': 'I think the reality is real estate affects other real estate. Neighbors affect neighbors. And we think that this will be a really positive addition to the neighborhood. And we're asking for your support tonight. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Paula Williams.'",
        "'speaker_8': 'Good evening, counsel. My name is Paula Williams for 50 East 17th Avenue, Denver. I am with the law firm of McGee de Becker. Our office works extensively with Stonebridge. I'm available for questions in the event any questions come up with respect to metropolitan district matters.'",
        "'speaker_0': 'Thank you. Next up, Howard Pollack.'",
        "'speaker_6': 'Good evening, Mr. President. Members of the council. My name is Howard Pollack, and I'm general counsel for Stonebridge Companies. My address is 956 Olive Street in Denver. I've been Stonebridge attorney in one form or another for close to 25 years.'",
        "'speaker_6': 'So I'm very familiar with the company and with the principals of the company. I wanted to give you a few additional facts about the subject site as a follow up to what Tommy Negro just told you. First, the property was purchased by our predecessor, an interest extended Stay America back in 1995.'",
        "'speaker_6': 'They built a 160 room extended stay hotel, which is comprised of approximately 25,000 square feet of building area on the property. That hotel, as people have noted, is still operating there today, but it's generally considered to be an eyesore and is inconsistent with the redevelopment of the adjacent land.'",
        "'speaker_6': 'It's also a hotbed of criminal activity and something that really, I think everybody in the area generally feels needs, needs to be redeveloped. The important thing to note is that the existing hotel and the infrastructure that supports it were developed back in 1995, which is almost 20 years prior to the creation of Bellevue Station Metro District and'",
        "'speaker_6': 'the redevelopment of the adjacent land. This site, since its development in the in the nineties, has been operated independent of any other properties or metro districts and still operates that way today. The primary access to the site since the beginning is been off of South Quebec Street, which is a public street that predates the initial development of'",
        "'speaker_6': 'the site. And it's our intention that that access will continue to be the primary access. Subsequent to our redevelopment of the site, currently Denver water provides water service to the site and will continue to do so. The site is currently on the Goldsmith Gulch Sanitation District Sewer System.'",
        "'speaker_6': 'I think in your packets we included a letter that Goldsmith gave to us that indicated that they would be more than happy to have us remain on their system after the site is redeveloped. That's our desire as well.'",
        "'speaker_6': 'However, if public works in the city concludes that we need to connect to the to the city owned sewer system, we'll do that as well. And we're willing to bear the cost of extending the connection to that sewer system and to pay all applicable connection fees to the city.'",
        "'speaker_6': 'That, that that the cost, I understand, is fairly significant to extend that pipe. So that's just something that we do want to talk further with the city during the site development process, planning process. We strongly believe.'",
        "'speaker_0': 'I'm sorry, but I'm sorry. But your time is up 3 minutes. Okay. Thank you so much. Next up is Taylor Hilliard. And then I'm going to call the next five to come up to the bench. Mark Staton, James Neiman, William Kaufman, Diane Miller and Kim Kucera.'",
        "'speaker_0': 'If you want to come to the front.'",
        "'speaker_10': 'Of the evening, council members, thank you for being here. My name is Taylor Hilliard and I am here to answer any questions.'",
        "'speaker_6': 'That may come up about design or zoning something. Thank you.'",
        "'speaker_0': 'Thank you. Mark Staton.'",
        "'speaker_13': 'Good evening, counsel. My name is Mark Styron and my address is 5085 South Syracuse Street, and I am the managing partner at Shanahan Steak House in Denver. And I'm here to, first and foremost, thank you for the opportunity to speak and also speak in favor of the development of this hotel by Stonebridge.'",
        "'speaker_13': 'I'm very familiar with Stonebridge Hotels and their product and the quality of which they've provided in many locations throughout the Denver metropolitan area. And I just really believe that this hotel would complete the site on the west hand side.'",
        "'speaker_6': 'Of the highway on Bellevue.'",
        "'speaker_13': 'And be very consistent with the current architecture that's being constructed. As a business owner, I would also want to state that I am very much in favor of this hotel with the understanding that it will bring added commerce to the Denver Tech Center and support all of the existing retail and restaurants throughout.'",
        "'speaker_13': 'So thank you for the opportunity tonight and I'll look forward to hopefully this project coming to fruition.'",
        "'speaker_0': 'Thank you. Next up is James Neiman.'",
        "'speaker_6': 'Hello. My name is Jim Ninan. I'm the owner of Primus Development Company. We are currently the developers of 6900 Leyton Office Building immediately to the west of the subject property. We also developed the one Bellevue Station office tower immediately to the south of the subject property.'",
        "'speaker_6': 'My address is 7001 East Bellevue and Suite 650. Denver, Colorado 80237. I'm here to actually speak against the rezoning. In summary, I actually think the zoning is not inconsistent at all, as you've heard earlier, with the with the master thought process.'",
        "'speaker_6': 'However, the site is bounded by on three sides by existing development that has a general development plan approved on it. And the zoning would be inconsistent with that general development plan in this sense, and primarily in the sense that it does not require any open space where the general development plan for all the surrounding property requires it'",
        "'speaker_6': '. And this property would be zoned for buildings up to a height of 250 feet, whereas all the surrounding property has a maximum height of 200 feet. I do believe that this property should be zoned consistently with the general development plan that is, the zoning on the surrounding property.'",
        "'speaker_6': 'The major issue that I have with it, though, has to do with fairness. The the Metro District was formed years ago to to provide and to find and install all the infrastructure around this property, the streets and utilities, sewer, sewer capacity and distribution systems.'",
        "'speaker_6': 'And this property, as my understanding, will tie in to that, but will not be subjected to paying any of the metro district taxes that all the other properties pay for, including myself, as well as the tenants at and within Bellevue Station.'",
        "'speaker_6': 'And I think that's a very unfair situation that a property would be allowed not to have to fund any of those infrastructure costs, but be able to tie into those utilities. So therefore, I'm protesting this. Thank you.'",
        "'speaker_0': 'Thank you. Next up, William Coffman.'",
        "'speaker_5': 'Thank you, Mr. President.'",
        "'speaker_3': 'Council Members. William Kaufman, 679 East Bellevue.'",
        "'speaker_6': 'Denver, Colorado. 80237. As general manager at our restaurant at.'",
        "'speaker_3': 'Denver, Bellevue Station and a resident of my house at Bellevue Station.'",
        "'speaker_6': 'I'm in favor of the rezoning project. At 4885 South Quebec Street. The current extended stay hotel no longer fits.'",
        "'speaker_5': 'With the current development of the area. The proposed development.'",
        "'speaker_6': 'Will remove a dilapidated building that I see daily and replace it with an opportunity to bring more to our neighborhood and more support for our area businesses such as the restaurant. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Diane Miller.'",
        "'speaker_9': 'Good evening, council members. I'm Dianne Miller. Miller and Associates Law Offices 1641 California Street, Denver. I am general counsel to Bellevue Station Metropolitan Districts numbers one, two and three, which surround the property that's proposed for rezoning tonight. You know, since at least the 1960s, the incredible growth here in Colorado has been undertaken with an approach, a principle'",
        "'speaker_9': 'which is usually described to referred to as development, paying its own way. And what does that mean? The idea is that the cost of new development should be borne by those who are going to benefit from that development.'",
        "'speaker_9': 'And, you know, consequently, the cost of that new development should not be borne by those who will not benefit. It's Bellevue Station has created an incredible amount of public infrastructure streets, storm drainage, traffic control, parks and rec, storm drainage.'",
        "'speaker_9': 'But we wouldn't expect the people in the Bear Valley neighborhood to pay for that or Stapleton. We expected and what the city council approved were districts that allow the new development to pay its own way. The use of metropolitan districts is the result of a recognition by cities and counties throughout Colorado that special districts are particularly appropriate'",
        "'speaker_9': 'and suitable as a mechanism to ensure that development does pay its own way. Special districts are normally a very well defined area that encompass new development and that provide all that public infrastructure for the people who will use it.'",
        "'speaker_9': 'The property under consideration tonight is not within the Bellevue station metropolitan districts. The districts that surround it and that are providing substantial and significant public infrastructure to bring development into into this area. Are asking for your approval tonight for property that lies outside the district.'",
        "'speaker_9': 'But they will benefit in every conceivable way from the infrastructure that has been put in place by those districts. And because they are outside of the district, they will have no obligation to contribute to the payment of more than $33 million of bonds that have financed this new public infrastructure.'",
        "'speaker_9': 'Last week we requested the Denver elections division for a current voter list for our districts. There are 526 voters in the Bellevue station districts, and every one of those districts voters pays directly or indirectly to fund the cost of public infrastructure in our districts.'",
        "'speaker_9': 'We would ask and urge that you not approve the rezoning tonight unless or until that provision is made for this property, this development to pay its own way by contributing to the I'm sorry, I'm sure districts.'",
        "'speaker_0': 'Thank you very much. Next up, Kimberly, Sara and I will call the next five. David Foster, Mike Sullivan, Brooke Malloy, Lewis Bonds. Mark and Richard Farley.'",
        "'speaker_8': 'Good. Hello. Members of council. My name is Kim Kyocera. My address is 1660 Lincoln St number 1800. I am however, here to read a letter into the record from Hickmott RSK, who is the Chief Executive Officer of Western Union.'",
        "'speaker_8': 'His address is 7001 East Bellevue HQ 15 Denver, Colorado. They are their new headquarters located within the district. I sent this this to you via email, but it was late in the day. January 28th. Dear Denver Council Members.'",
        "'speaker_8': 'When people arrive at Bellevue Station to shop and eat, we want them to have a welcoming experience so they will stay longer and return a new building. Greeting them as they step off the light rail would enhance the visitor experience.'",
        "'speaker_8': 'We think the proposed building at 4885 South Quebec Street would significantly increase the experience in the station area for the public office workers, residents, customers and transit users. I have not seen the plans of the building yet. However, for the above mentioned reasons, I support the project application.'",
        "'speaker_8': '44885 South Quebec Street to Cmax 20. Sincerely Hikmet Herceg CEO Western Union. I'll also draw your attention to letters of support you have in the packet in front of you. Thank you.'",
        "'speaker_0': 'Thank you. Next up, David Foster.'",
        "'speaker_13': 'Good evening, Mr. President. Members of council. My name's David Foster. 360 South Garfield here. On behalf of the Belleview Station Metropolitan District. You have a letter for me that should be in your file, should be in front of you.'",
        "'speaker_13': 'I wanted to make a couple of additional points this evening. First, I want to make sure that as part of tonight's record, we include the 2006 GDP that has been referenced a number of times. Belleview Station, Transit, Orient Development.'",
        "'speaker_13': 'As you know, rezoning is a quasi judicial legal process, and it requires certain standards and documents for your review, I only point you to the staff's own report under consistency with adopted plans. In the first sentence, there is the following adopted plans apply to this property.'",
        "'speaker_13': 'It is really, I have to say, surprising to me that the 2006 general development plan that was approved and adopted after the 2000 comp plan and after the 2002 blueprint, Denver wasn't even contemplated in the review of this rezoning.'",
        "'speaker_13': 'It's not even contemplated by your staff. It wasn't even contemplated by the planning board. And even tonight in your staff report, yet again not contemplated. Mr. Roy Sole speaks to that's because you're not bound by the plan. And who said you are?'",
        "'speaker_13': 'Who said you are bound by the GDP from 2006? It's a plan that informs the rezoning of this site. It informs the rezoning of this site just the same way blueprint in just the same way. Comp plan 2000.'",
        "'speaker_13': 'You're looking at a donut hole in the middle of a donut by ignoring completely the implications of a GDP that was adopted in 2006. You're doing just that. There are a host of other issues that I've identified in my letter.'",
        "'speaker_13': 'I want to focus obviously on open space, which is infrastructure for anybody to walk away tonight thinking that open space is an infrastructure is it doesn't recognize the full implications that development has on the city. In fact, it was just last month we were rezoning another Todd Todd site downtown that in fact identified one and a half'",
        "'speaker_13': 'times the amount of open space that was required by the zoned district that it was rezone two one and a half times the amount of open space. So this has zero no open space, that's infrastructure, it's ignored and the GDPR speaks to that.'",
        "'speaker_13': 'The reference was the surrounding development space from the staff report and in fact that is consistent with the GDP. The GDP contemplated exactly this surrounding development pace. I appreciate your time tonight. And I again urge you to look at the 2006 GDP that references the site.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Mike Sullivan.'",
        "'speaker_6': 'Good evening, council members. My name is Mike Sullivan. I work at D.A. Davidson Company's 1550 Market Street, Suite 300 Denver, Colorado 80202. We are a regional investment bank and broker dealer with public finance headquarters here in Denver, Colorado.'",
        "'speaker_6': 'The practice group I work within specializes in special district financing throughout the state in Mountain West region. Our client, Bellevue Station Metropolitan District, would like us to share different cost sharing strategies that districts participate in around the state and the state of Colorado and the benefit in which those strategies provide.'",
        "'speaker_6': 'We typically see three strategies for when public finance is used as a solution equitable cost sharing, the inclusion of the benefitted property within an existing district encumbered with an ad valorem tax leading to cost sharing based on taxable value.'",
        "'speaker_6': 'Therefore, the benefited property included would be paying the same mill levy as the other property owners within the district based upon the taxable or assessed value of the property. Secondly, the inclusion of the benefitted property within its own special district.'",
        "'speaker_6': 'The newly created Special District would enter into an intergovernmental agreement with the Bellevue Station Metropolitan Districts. This could lead to an allocation of cost sharing based upon benefit determined in the negotiation. And thirdly, the benefited property owner could pay up front to Bellevue Station Metropolitan District in an agreed upon fee based upon benefit negotiated.'",
        "'speaker_6': 'We believe these cost sharing strategies benefit the motivation behind regional infrastructure and continue to maintain a balanced playing field for future real estate investments. Thank you very much.'",
        "'speaker_0': 'Thank you. Next up, Brooke, more.'",
        "'speaker_8': 'My name is Brooke Malloy and I live in Littleton, but I am a property owner as a member of Belkin's Limited Liability and moderate investment company who own the surrounding undeveloped properties. I've been involved with the redevelopment of Bellevue Station since the late 1990s and I currently manage the Bellevue Station Master Property Owners Association and the Bellevue'",
        "'speaker_8': 'Station Public Improvement Company. Front Range Land and Development Company, as master developer for the 50 acres surrounding this proposed rezoning, has had to give up nearly 20 acres of developable land for public right of way in open space requirements.'",
        "'speaker_8': 'And this applicant is not being required to give up any land under this rezoning. A CMCs 20 zoning would entitle the landowner to build over 2 million square feet of development on this property. And yet the city is not evaluating whether or not open space should be required, nor is the city considering the impact this development would'",
        "'speaker_8': 'have on the surrounding infrastructure. I would request Council to deny this application of rezoning until the applicant has agreed to provide some sort of open space and that the applicants for rezoning be considered in light of the Bellevue Station GDP that the city approved.'",
        "'speaker_8': 'I reviewed the video from the December 18th, 2018 Land Use Transportation and Infrastructure Committee meeting in which this rezoning was presented. City planner Jeff Hirt explained that the current zoning on the property carries a 30% open space requirement and that the new zoning requires none.'",
        "'speaker_8': 'Mr. Hirt also mentioned that the Planning Department has worked with the applicant to address certain deficiencies identified in the CMCs 20 zoning that were of concern. But apparently community planning and development does not view the reduction of open space from 30% to zero as an issue, because Mr. Hertz said that open space could be addressed, but staff'",
        "'speaker_8': 'elected not to do anything and no amendments related to open space were considered. Councilwoman Black also pointed out that this is one of the largest areas in Denver without a park, yet the committee passed the rezoning request without further consideration.'",
        "'speaker_8': 'Mr. Herbert indicated that there were two public comments concerning infrastructure. Trust me, there's been a whole lot of comments regarding this issue. I don't believe that there is one land owner in the immediate area here tonight that is supportive of this rezoning.'",
        "'speaker_8': 'Yet this is an area yes, this is an area of change. And I think it should ultimately be resolved to something. And I think the landowners in my Property Owners Association would agree with that. But we all know that once a property is re zoned, it is virtually impossible for the city to come back and get another'",
        "'speaker_8': 'chance to discuss adding open space and looking at their impact on traffic and infrastructure. This process of pointing out deficiencies but not addressing them and simply checking the box to to move a rezoning through the process is extremely concerning.'",
        "'speaker_8': 'And I would urge council to deny the rezoning in its current state and go back and evaluate open space and infrastructure issues before it is resolved. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Louis Bonds Mark.'",
        "'speaker_3': 'Hi. My name is Louis Barnes back and I live in Cereal's Village. I'm an adjoining property owner through my membership in Vulcan's Slim City, Light Limited Liability Company and Moderate Investment Company. I also sit on the board of the Bellevue Station Metropolitan Districts.'",
        "'speaker_3': 'I'm concerned that this rezoning in its current state does not meet the criteria outlined by the city, that it must further the public health and safety and general welfare of the area. In fact, I think this development, without any accountability towards traffic, utilities and open space goes to the detriment of the safety and general welfare of the'",
        "'speaker_3': 'area. Without the infrastructure built and paid for by the Bellevue Station metropolitan districts to which this property is not in the district, this property would be exclusively forced to use the intersection of Bellevue Avenue and Quebec Street for all of its traffic, which currently operates at a service level.'",
        "'speaker_3': 'F However, this applicant will have the use of the roads and underground infrastructure provided by the Bellevue Station Metropolitan Districts, yet will not have any obligation to help pay off their portion of those infrastructure costs, nor will it be required to participate in further traffic studies or traffic signals to which its development of potentially 2 million square'",
        "'speaker_3': 'feet of development will certainly have a stressful impact on the infrastructure. Thus, this rezoning will negatively impact the safety and general welfare of the area by forcing the area to increase capacity for sewage flows and traffic without participating in the solution.'",
        "'speaker_3': 'Ultimately giving this property a free ride at the expense of the surrounding property owners. I would urge Council to deny the rezoning of this parcel until it impacts. Until its impacts on the safety and general welfare of the area have been fully examined.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Richard Farley and McCall call the last five to come up to the bench. Robert Warren, Trey Warren Time, Tom Ragan, Eddie Chairman Sekou and Jesse Pierce, who come up to the front. Go ahead.'",
        "'speaker_5': 'Mr. President. Members of city council. My name is Richard Farley, and I live at 2500 Walnut Street, apartment 112. And we're Colorado. I'm speaking against the proposal because, you know, Bellevue Station underneath the old zoning has undergone a substantial public review and approval ranging from a general development plan for its streets and parks to design standards and'",
        "'speaker_5': 'guidelines and design review. City Design Review, which I wrote to ensure its quality. The proposal before you doesn't have to provide any of this to achieve a substantial up zoning. It doesn't provide the kind of usable, consolidated, open space that Bellevue station does.'",
        "'speaker_5': 'It takes advantage of an overtaxed Bellevue station's infrastructure without paying for it. And there is nothing to require good design in the public interest. You know, I don't oppose development, but I do oppose development that provides the minimum public return for its substantial gain.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Robert Warren.'",
        "'speaker_5': 'Good evening. My name is Robert Warren. I'm the president of the Bellevue Station Metropolitan District, formerly known as the Moderate Metropolitan District. And I am the manager of the MADRE Investment Company, which is the major landowner in Bellevue Station MADRE.'",
        "'speaker_5': 'For those of you who might be interested, was the name of my grandmother, which her name was Margaret Bonds back. But we called her madre. She taught us a lot. She taught us about hard work. She taught us to fulfill our responsibilities.'",
        "'speaker_5': 'And she taught us to pay our own way. And that we should never expect to get something for nothing. We have always lived by that credo. We paid our fair share to extend Denver Water Line Main, the conduit south to Bellevue Station.'",
        "'speaker_5': 'We paid to oversize the sewer line down Bellevue to accommodate Bellevue Station. We paid to oversize the pump station at Monaco and Bellevue to accommodate Bellevue Station. We paid to increase the size of the detention pond at Monaco and Bellevue.'",
        "'speaker_5': 'We worked with the city then to create a well-balanced and responsible general development plan with significant open space. We formed the Metropolitan District and we floated over $33 million worth of bonds to pay for the infrastructure. We built all the streets, all the curbs, the gutters, the sidewalks.'",
        "'speaker_5': 'We built the landscaping. We put in the sewer outfall lines, the water lines, the electrical conduits. And we dedicated five and a half acres of land for open space. And don't forget, we're still liable on those bonds. We still have to pay the principal and interest on those bonds.'",
        "'speaker_5': 'And we've not received one penny from the city and county of Denver. We've paid our own way to allow this parcel an island in the middle of our development, to increase its density 30 to 50 times and give it access to all the infrastructure that the district built for its own use without paying for any of the'",
        "'speaker_5': 'impacts on the district now or in the future and without contributing any open space is unconscionable. There's one other thing that Madrid taught us, and that was when faced with unfairness, fight and we're going to fight. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Trey Warren.'",
        "'speaker_3': 'Hmm. My name is Trey Warren. I live at 57 Charlotte Circle. I represent Front Range Land Development, the master developer at Bellevue Station. I just like to continue to point out the inequities in this potential rezoning. We all recognize the importance of growth and the development in Denver, but it needs to be smart.'",
        "'speaker_3': 'And we don't think that a blanket 30 times to 50 times increase in density on this particular site without any studies, standards or any open space requirement, especially reductions from 30% down to zero is very smart. In fact, it's destructive to the surrounding development, and we're all trying to move forward responsibly under completely different rules.'",
        "'speaker_3': 'Bellevue Station was subject to a great deal of public and city scrutiny. We were required to provide land for roadways, utilities, about 15 acres to dedicated to the city. We were required to set aside five acres more than this entire rezoning site for usable open space.'",
        "'speaker_3': 'We were required to perform Storm Sanitary Traffic Water Master plans, then form a metro district and finance and guarantee it all. We still remain obligated to complete roadways and traffic signals and to mitigate future impacts to the surrounding areas.'",
        "'speaker_3': 'Impacts that are sure to grow with the approval of this particular zoning. But the applicant in this case has been asked to do nothing, none of the above. You should understand that there is no density restriction whatsoever attached to your CM zoning.'",
        "'speaker_3': 'The site footprint may be somewhat small at 3.2 acres, but the potential development on the site of 20 storeys could exceed 2 million square feet. The Bellevue Station Master Plan, created under intense study and restriction, contemplates only about 6 million square feet of total development.'",
        "'speaker_3': 'To suggest that a 30% increase in size with no open space requirement will have no impact on the surrounding area is crazy. It certainly will, absent any area plans by the city. The Bellevue Station GDP should, in my opinion, be the governing plan for review of the area.'",
        "'speaker_3': 'So far, the city has completely ignored it. The spotlight is now on the city with growing frustration over density, the loss of open space. And this request simply illuminates exactly why the city council must take the reins of what is right and appropriate and steer this zoning because it's clearly in its purview.'",
        "'speaker_3': 'Abdicating this responsibility to public works only silences the public voice and in gender's ill will and frustration. Please do the right thing. Require an open space, commitment, appropriate density and mitigation of impacts, anything less shortchanging the neighbors and the taxpayers.'",
        "'speaker_3': 'And in my estimation, this will trigger a gold rush of all the time you thirties remaining in the city to seek CMC's rezoning so that they might sell their open space for higher profit. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Tom Reagan.'",
        "'speaker_6': 'Mr. President, members of city council. My name is Tom Reagan. Eddie. My address is 950 17th Street, and I'm here to speak on behalf of Bellevue Station Metropolitan District, which supports the Bellevue Station Project. The nearest neighbor to and which surrounds the subject property Bellevue Station is a 51 acre development and was first conceived in the mid'",
        "'speaker_6': '1990s when the BASBANES, Bach and Warren families, the owners were approached by Councilwoman Joyce Foster, who who suggested to them that they should consider a transit oriented development in connection with the new south east rail line and proposed station at Bellevue.'",
        "'speaker_6': 'The families agreed to, and they dove in hiring Civitas, a prominent local, fair planning firm, to lay the planning groundwork for the TOD and our firm to do the land use over a many year period. The plan took form and jelled and the owners even paid to have the first draft of the TMU 30 zoning prepared, which'",
        "'speaker_6': 'is the current zoning for Bellevue Station. They further dug in by doing a GDP, forming the Bellevue Station Metropolitan District and issuing well over $30 million in bonds to pay for the basic infrastructure, subjecting all real estate in the district to a mill levy of 50 mills.'",
        "'speaker_6': 'Now the current applicant wishes to develop cheek by jowl with Bellevue Station, with zoning that is larger and denser, with no open space, and to use both the district's infrastructure and open space for free. That's not only bad planning, but it's a serious injustice to the nearly 25 year dedication of the Bonds BLOCK and Warren families to'",
        "'speaker_6': 'producing a first rate geode with no city investment and to the infrastructure monies that they invested into the taxes paid by the district's taxpayers. I urge you to reject this reject this rezoning until the newly proposed development can be better coordinated with the existing and future development of values station.'",
        "'speaker_6': 'And until the range of. It can be made for the new development to pay its fair share of the district infrastructure it will undoubtedly use. I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you. Next up, Chairman Scoop.'",
        "'speaker_5': 'My name is Chairman. Say, who founded the Black Star Movement? Advocacy for poor, working, poor homeless elders and students. We stand opposed to the rezoning of this property for all of the above mentioned reasons. And when we look at the folks who've been doing the development in this area, there is an unconscionable absence.'",
        "'speaker_5': 'Of black contractors and workers on any and all of these sites. If you go by and look at the construction and workers that are doing that, you don't see. No, not one black person working, not even holding a sign, which is in violation of federal law and state law and city law.'",
        "'speaker_5': 'And you choose to look the other way. And this has been going on for 15 years that I've been down here. So here comes the Chinese water touch, because I'm going to tell you over and over and over again so that you get it and that you monitor these rezoning things with these unconscionable organizations that is just'",
        "'speaker_5': 'buck naked, raw dog pirate capitalism. How are you going to come up in and get some for nothing? What everybody else is paying for this and folks have to pay bonds and whatnot forever and ever. And this even gets to the border.'",
        "'speaker_5': 'That's an insult to the intelligence of this body. I don't even know how I got this far. Except for some corruption. Hook up. And when you looked at that board, it said it was initiated by the mayor. This is part of the development issue that we have going on in the city now where it is driven by'",
        "'speaker_5': 'raw dog capitalism and don't care nothing about the neighborhood and what the people say. And the time has come for city council to do what the people say, do not what to tell us to do. You represent us.'",
        "'speaker_5': 'Not developers, not the mayor. So we've got to stop this lapping, lapping dog up approach to that. And it's time for council to stand up and oppose the mayor. We're even having to do this kind of stuff which makes this body look corrupt and in bed.'",
        "'speaker_5': 'KING Michael. KING Michael. The most corrupt mayor in the history and got mess going on everywhere in the city full of nothing but confusion and madness.'",
        "'speaker_0': 'I'm sorry, but your time is up. Thank you very much. Next up, Jesse Paris.'",
        "'speaker_3': 'Good evening. The council. My name is Jesse Pierce. I represent for Denver Homicide allow Black Sox a movement for self-defense and positive action, a commitment for social change. And I'm also an at large candidate for 2019. Like we've previously stated, we are against this rezoning request.'",
        "'speaker_3': 'As usual, you do not heed the words of the community and take that into account before you make these rezonings which is already stated. This is capitalism on steroids and you want us to pay for something that clearly the community and the neighborhood in question does not want.'",
        "'speaker_3': 'I don't know how many times we have to come here and do a public comment. Honestly, I don't even know why we do public comment at this point, because it's pretty much useless at this point, because you do not take the words of the community into account.'",
        "'speaker_3': 'You just do what you're going to do. You are already being bought and paid. So please keep keep.'",
        "'speaker_0': 'Your comments.'",
        "'speaker_3': 'To this. What this is all to the question of how against this. So I urge you to vote no on this rezoning. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council? Councilman Ortega.'",
        "'speaker_4': 'Thank you, Mr. President. I do have a couple of questions. First, I wanted to ask someone from city staff. Number one, the city's policy on open space and why there was no recommendation for open space on this particular parcel.'",
        "'speaker_4': 'Normally when it's over an acre is my understanding. We require some open space and this is what, 3.7 acres? 3.2. So can you speak to that?'",
        "'speaker_12': 'Yeah. The only policy or regulation we have to establish open spaces for through the general development planning process and thus for a project over ten acres, actually. So this site is under that threshold. So in the CMCs 20 zone district in itself does not have an open space requirement.'",
        "'speaker_4': 'There is none. There is. No, no, no. So even when. Okay. Number one, let me let me go on with my next set of questions. So someone that represents the property. So, Mr. Niekro, if you wouldn't mind coming forward.'",
        "'speaker_4': 'So I'm trying to understand if this particular parcel was part of the original Met district or is has it always been excluded from the Metro District?'",
        "'speaker_6': 'It is. Excuse me. And it's always been excluded from the metro district and from the GDP. And that was certainly a factor when we acquired the site that we looked at. And, you know, at times there can be a reimbursement agreement for infrastructure, and that was not in place either.'",
        "'speaker_4': 'So can you just speak to what infrastructure is needed for the development that is being proposed for the site?'",
        "'speaker_6': 'Nothing that doesn't already exist and that we're not connected to. And that's, I think, some of my confusion with the opposition as we stated that this development was built in the mid-nineties and it's had infrastructure connected to it since that time.'",
        "'speaker_6': 'Quebec Street has been there. The light at Quebec and Bellevue was there, was there prior to the formation of the district. The sewer line that were connected to has been in place since this property was built in the mid-nineties or connected to Denver water.'",
        "'speaker_6': 'We're connected to Denver storm. So this infrastructure already exists on our site. And, you know, what seems like would be unfair to me is for us to pay for things that we don't want or need. So, again, the third district was formed voluntarily, presumably to, you know, improve the value of the land.'",
        "'speaker_6': 'And we weren't part of it. And I don't understand really why we're discussing infrastructure as it pertains to zoning when we already have it.'",
        "'speaker_4': 'Just a quick question about whether or not you plan to include any open space at all on the site?'",
        "'speaker_6': 'Yes, we do intend to include open space. If if my understanding is correct there, TMU, 30, which requires 20% open space. But it's my understanding that they negotiated that down. So while they're talking about all this open space, they worked to decrease theirs to 10%, if I'm not mistaken.'",
        "'speaker_6': 'And our development will have well over 10% of open space.'",
        "'speaker_4': 'Okay. So you're planning to include that? Yes. Okay. I have no further questions at this point in time. I may have some others.'",
        "'speaker_0': 'Thank you. Thank you. Councilwoman Ortega. Councilman. Espinosa.'",
        "'speaker_10': 'Sorry. I thought Wayne was in there. That's what.'",
        "'speaker_0': 'It was. I thought so, too, because we knew. Did you read?'",
        "'speaker_10': 'Okay, so probably, Jeff, this is going to be a familiar line of questioning. What what is the kind of st classification does all have st have.'",
        "'speaker_12': 'All the st is a local street.'",
        "'speaker_10': 'Local street to Nagle local street.'",
        "'speaker_12': 'Quebec local street.'",
        "'speaker_10': 'Are any other streets bordering this property?'",
        "'speaker_12': 'So I'm assuming you're referring to the Zone District purpose statement and which says that the site could be primarily served by an arterial. So there are local streets directly adjacent, but Bellevue Avenue and Union are both arterials and those are served by the site, including Interstate 25, certainly.'",
        "'speaker_10': 'So it says served primarily not by an arterial. But once again, we're talking about a major arterial. So we have these two classifications in our zoning code about arterial and major arterial. So where is the nearest major arterial?'",
        "'speaker_12': 'I don't know. If we call out major arterials, I may be mistaken. We have different categories of arterials. Bellevue and Union are both mixed use arterials and certainly 25 is sort of within some category.'",
        "'speaker_10': 'So we had this conversation before. So Federal Boulevard and would that be considered a major arterial.'",
        "'speaker_12': 'And I'm not sure.'",
        "'speaker_10': 'Colorado Boulevard, would that be considered a major arterial?'",
        "'speaker_12': 'Again, I don't think we have the major classification. I would have to look at it.'",
        "'speaker_10': 'Would it be considered arterial?'",
        "'speaker_12': 'That would would Colorado Boulevard it are in arterial? I don't know I mean, it wasn't part of the analysis here. We're looking at the.'",
        "'speaker_10': 'Large zoned district classification actually requires this to be primarily served by arterial major arterial streets. So I'm just trying to find out what the relationship of this zone, lord, to any major arterial streets. And you're telling me CPD has no idea where the nearest major arterial is, by definition.'",
        "'speaker_12': 'So I'm saying Bellevue and Union are both mixed use arterials and that fits that definition.'",
        "'speaker_0': 'And they.'",
        "'speaker_10': 'Primarily serve this zone on.'",
        "'speaker_12': 'Yes, yes.'",
        "'speaker_10': 'And how is that what's the definition of primarily serve?'",
        "'speaker_12': 'I don't believe ever deficient apparently served. But you certainly get to the site coming from Bellevue and Union.'",
        "'speaker_10': 'Okay. Because again, how we're doing this in other zone districts is using the rail. And you just mentioned I-25. And I will argue that at least Bellevue and Union are porous, meaning they can cross at any number of places on a fairly frequent basis at intersections.'",
        "'speaker_10': 'But is that true for the rail to be able can I cross the rail or I-25 as frequently as I can cross Bellevue or Union?'",
        "'speaker_12': 'I'm not sure. The rail is a fixed route. Yeah. So we're not talking about going east. West. We're talking about one one route.'",
        "'speaker_10': 'Okay. Because again, what I've heard from the administration and from planning board is that the number of passengers served by those sort of rails in the fact that they stop is proximate, is somehow akin to an arterial or a major arterial.'",
        "'speaker_10': 'However, we want to find this. But I'm trying to understand if arterials are all sort of created equal because I can cross Colorado Boulevard and a whole bunch of intersections on a very frequent basis. I can also access multiple modes.'",
        "'speaker_10': 'I can take an Uber, Lyft, a bus, you know. And so I'm trying to figure out how a light rail with as infrequent a stop as it has in the sort of the limits of its service equate an arterial.'",
        "'speaker_12': 'I'm not sure anyone saying that equates to an arterial. I think that's part of the balance of the multimodal access for the site, which is excellent.'",
        "'speaker_10': 'Okay. So we are now. Okay, great. Then let's go to your slide on consistent mean criteria, zone district criteria. I've got to go to that page. So. So specifically the criteria with consistency with adopted plans. So conserve item two is conserved lender by creating more density at transit nodes.'",
        "'speaker_10': 'What are we? So again, my time within this dais, we have done a lot of increasing density. We haven't done a lot of one of the things we've noticed is, is and this is sort of framing the question, we've noticed that we've had a decrease in open space relative to the number of people that we're bringing in'",
        "'speaker_10': '. And Denver has gone from a very respected place to sort of middling. What are we doing as a as an agency to conserve land area as we're increasing the density in these areas?'",
        "'speaker_12': 'Well, I mean, this is outside of the rezoning criteria, I think.'",
        "'speaker_10': 'But that is actually your net point number two on the next slide.'",
        "'speaker_3': 'Not sure which.'",
        "'speaker_10': 'So it's said review criteria. Consistency with adopted plans is the header right there. Right there. Back one more note there point to conserve land area. This is your justifying your justification conserve land area by creating more density at transit notice how what are what is CPD doing to balance this increase in density with conserving land area?'",
        "'speaker_10': 'Because what I see is greenfield development. Yeah.'",
        "'speaker_12': 'Yeah. I mean the open space issue has certainly been a hot topic lately and the Denver Post and CPD is looking closely at that. There are a few initiatives to look at addressing open space that we're working on.'",
        "'speaker_12': 'But again, those are city wide initiatives. And so what we're talking about here is BMX TOW, and so we're kind of bound by the requested hand in the standards within TMX 20.'",
        "'speaker_10': 'But that's what I'm saying. You're asking us to look at the density component, but relying on the conservation of land area component. And so I'm saying you're going, well, what are we doing in this station area and this TOD If we're not doing it by application, by application and waiting for only ten acre developments, do we have'",
        "'speaker_10': 'any other strategy in place to sort of make sure that we're actually hitting both sides of that just for justification?'",
        "'speaker_12': 'Yeah. I mean, again, it's certainly an issue that we're aware of, but that's a I mean, it's a citywide issue and it's not something we be tackling as part of this rezoning request.'",
        "'speaker_10': 'Okay, thanks. No further questions.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilwoman Sussman.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_4': 'You're Mike is not a. Turn on your mike.'",
        "'speaker_9': 'I'm going to keep a secret. Thank you. Let's talk about a GDP. A general development plan isn't a general development plan usually done after a zoning has come through?'",
        "'speaker_12': 'Not always. Yeah. Sometimes they can go concurrent as action. Sometimes the zoning can follow the GDP.'",
        "'speaker_9': 'Right. GDP is generally about the infrastructure where the roads are going to go, where the utilities are, and is a document for the city to review and make suggestions, changes, requirements. Isn't that true?'",
        "'speaker_12': 'Yeah. I mean, it's it's a tool that we're looking to revamp now, actually, but a tool to look at horizontal development systems, mostly focus on infrastructure and open space.'",
        "'speaker_9': 'Right. And it's though not always usually done after zoning is in place and deciding unless the the person requesting the zoning wants to show a GDP before zoning, it's not required before zoning is a.'",
        "'speaker_12': 'There is the ability for the city require the timing of zoning within the GDP approval framework. But it's been done a number of different ways. It's really been different for.'",
        "'speaker_9': 'And the council doesn't approve or not approve GDP. Correct.'",
        "'speaker_12': 'Correct. It goes to planning board as a public hearing and a recommendation to the Development Review Committee, which is an administrative body.'",
        "'speaker_9': 'Right. So the council doesn't approve GDP? Correct. Okay. I I'd like to ask Nate a question. Thank you very much. I think it's need I should ask. Is that correct, Mr. Crawford?'",
        "'speaker_10': 'Natural Resources attorney.'",
        "'speaker_9': 'If a property isn't in a metro district, is it ever is it is the fact of there not being in a metro district ever a criteria that we use on whether to approve or deny zoning?'",
        "'speaker_10': 'No, ma'am. The only criteria is the five that are listed in front of you and on the on the screens.'",
        "'speaker_9': 'So being in a metro district or not is not something we can consider when we decide upon zoning.'",
        "'speaker_10': 'No, it is not. One of the criteria for consideration.'",
        "'speaker_9': 'Is not being a part of a GDP. A reason for us to be able to decide about zoning? No.'",
        "'speaker_10': 'The way I would think about that or advise you to think about that is is as if it were any other sort of adopted plan. If we're talking about a neighborhood plan or or the citywide comprehensive plan or blueprint, Denver, if you fall outside of the boundary for neighborhood plan, then your requested rezoning wouldn't be reviewed against'",
        "'speaker_10': 'that neighborhood plan. Same with the GDP. If you're outside the boundary of a GDP, then staff city council won't consider that general development plan against your rezoning request.'",
        "'speaker_9': 'Okay. Thank you very much. I had a couple of other questions, too, and maybe, Jeff, you can help me with this. There were some folks who thought that this might be too dense. It's a 20 story request or an idea that they would put a 20 story in.'",
        "'speaker_9': 'How how tall is the Western Union building?'",
        "'speaker_12': 'It's 15 stories, 211 feet.'",
        "'speaker_9': 'You even know defeat?'",
        "'speaker_12': 'I don't know how I know that, but I'm pretty sure I'm right.'",
        "'speaker_9': 'Me up there. What about the Kimpton Hotel? Well, I'll tell you, sir.'",
        "'speaker_12': 'Well, sorry, I'm not.'",
        "'speaker_9': 'The Kimpton Hot Kimpton Hotel. Can't remember if it's the Kimpton or the.'",
        "'speaker_12': 'I'm not sure which side that is. Is it west of I-25? North of Bellevue.'",
        "'speaker_9': 'Somewhere near there?'",
        "'speaker_7': 'Sure.'",
        "'speaker_9': 'Okay. I think that's just about all the questions I needed to ask. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Councilwoman Black.'",
        "'speaker_2': 'Thank you, Mr. President. A lot of the comments tonight talked about the GDP and the metro district. So I've got questions on both of those. So City Attorney John McGrath, would you mind coming up to answer some questions about the Special District?'",
        "'speaker_2': 'And thank you, Councilwoman Saltzman, for starting that conversation. So.'",
        "'speaker_6': 'Which city attorney's office?'",
        "'speaker_2': 'Sorry. We've had a lot of conversations about this. Can you explain how districts are formed and who decides goes in and who decides doesn't go in? And can you ever force a property owner to go in?'",
        "'speaker_6': 'Sure. So a metro district initiates with the owners of the land that are within the boundaries of the proposed district. And, you know, case by case, it's difficult to say across the board. But generally speaking, a group of landowners or one landowner, if it happens to be under the ownership of of one group, will formulate a plan'",
        "'speaker_6': 'to, you know, presumably enhance the developer ability and and value of a property by bringing infrastructure to the site that would be needed for that purpose. There may be negotiations with neighboring landowners along the way to to determine whether other properties are interested in joining.'",
        "'speaker_6': 'But at the end of the day, it's it's a process that's initiated by the owners of the land within the district. And those are the individuals or entities that have a vote. And what improvements will be made and what indebtedness will be incurred to to pay for that.'",
        "'speaker_6': 'Obviously, the properties outside the district, whether they may in the future, benefit from that or not, don't have a say or a vote in in those decisions.'",
        "'speaker_2': 'And can a property that is outside of the district be forced to join the district?'",
        "'speaker_6': 'To my knowledge, there's no way for the city or anyone else other than just by negotiation between private landowners to to decide. There's a process in state law for individuals who are outside of a district to petition in a way to get included within the boundaries of the district.'",
        "'speaker_6': 'But I don't think that there is a reverse right or process for a district to decide to incorporate properties outside of their district boundaries.'",
        "'speaker_2': 'And are there other cases like this in the city where the first in developers create a special district and then another property owner benefits from those improvements but isn't paying into the district?'",
        "'speaker_6': 'It's not uncommon. If a district elects to make improvements that will become public improvements. Then at the point that those improvements are are the title to those improvements is vested in the city. The city is constrained to allow any property owner to have access to that infrastructure based upon the criteria that we have in place at the'",
        "'speaker_6': 'appropriate time. There's an analysis made about what the proposal is to connect to that infrastructure. And so public works in the city would go through that process to determine if there was sufficient capacity in light of the existing and planned uses in the vicinity and make a decision to either impose requirements or not.'",
        "'speaker_6': 'But it's a it's a public asset at that point. If if a private developer finances public improvements. Yes, there's an initial upfront cost. But eventually those improvements are transferred to the city. And the city then has the long term maintenance obligation for those assets.'",
        "'speaker_2': 'Okay. Thank you for clarifying that. My next question, I think, Jeff, this might be for you. As far as the GDP, GDP goes, are there ever instances where I wear properties are added to a GDP?'",
        "'speaker_12': 'I don't know of any in and um. GDP is pretty well I don't know of any that have been added. Certainly many have been amended, but I can't think of an example where one was brought in recently at least.'",
        "'speaker_2': 'Okay. And then I my final question for now is about open space. So I've read all of the the packet and all the additional letters and materials we've received and I've heard 10%, 20% and 30%. So maybe someone from the Belleview station.'",
        "'speaker_2': 'Can you talk a bit about that? I've heard 30%. And then I heard somewhere in one of these letters it says it was negotiated down to 10%.'",
        "'speaker_13': 'David Foster on behalf of Belleview Station. So the TMU rezoning had initially had a an obligation of 20% open space. And I and kind of going back to a question that Councilwoman Ortega was asking that I don't think was answered correctly.'",
        "'speaker_13': 'The open space obligations are not as a function of a GDP. A GDP works to aggregate or identify where infrastructure belongs. The obligation of open space is in the underlying zone district. So the TMU had a 20%, but it was able to be aggregated into a way that allowed for 10% open space in in places that made'",
        "'speaker_13': 'the most sense for this Todd station. And you'll see in my letter I highlight the page from the open space that indicates where the largest portion of that open spaces, which is directly north of this particular site, but it's in close proximity to the station.'",
        "'speaker_13': 'The 30% requirement that was identified is for the existing site. The B4 with waivers has today a 30% obligation for open space. If they were to redevelop under a before, they would have a 30% open space obligation. But again, the clarification that I thought was important from before is open space is a function of the underlying zone'",
        "'speaker_13': 'district. The GM, you, the gmc's tow requires no open space irrespective of any promises made today.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Black. Councilwoman Gilmore.'",
        "'speaker_4': 'Thank you, President Clark. Jeff, I have a question for you. I know we're we're just at the rezoning, but could you share with us what sort of additional infrastructure improvements might need to be made based upon the property that we're looking at rezoning?'",
        "'speaker_4': 'The density, you know, would it warrant traffic signals? You know, I know the gentleman said that they're going to be responsible for sidewalk, curb and gutter. But could you talk a little bit? Not specifically, because we don't know exactly.'",
        "'speaker_4': 'We don't have the traffic studies. But could you share with us what it might entail as far as infrastructure improvements?'",
        "'speaker_12': 'Yeah, I mean, that's generally out of my wheelhouse. I will say that the C-Max to allow is really a huge range of potential intensities. I mean, there's a there's a proposal that's being verbalized to you today, but anything can go on and see a mix tape from a one story drive thru restaurant, which I know is unlikely'",
        "'speaker_12': 'to a 20 storey building. So with that huge range, it's really only prudent to look at the infrastructure impacts when you have a site specific proposal and anything further related to specific infrastructure, I'd probably refer to Mr. McGrath or.'",
        "'speaker_12': 'Yeah, I'm not sure if there's a there's.'",
        "'speaker_4': 'So is the Sewer and Water Act adequate?'",
        "'speaker_12': 'Is it I'm sure.'",
        "'speaker_4': 'Is the sewer and water adequate to handle a project that would be as dense as what is being proposed? Or would there be a developer responsibility.'",
        "'speaker_10': 'To help improve it?'",
        "'speaker_12': 'Yeah. I mean, I can't speak to whether or not it's adequate at this time. I know that that would be a requirement. It would have to be adequate. And the applicant spoke to and I think in your packet there's a letter from the Goldsmith's district indicating they can serve the property and they indicated that they're on Denver'",
        "'speaker_12': 'water. But I'm really not the one nor I don't know if it's the time now to be able to make that determination. I would defer to others if they have anything else to add on that. But there's really not a lot you can say given the hypothetical nature of them.'",
        "'speaker_4': 'Okay. Thank you. Nate Lucero. I had a question for for unity. I'm since, you know, in District 11, we have quite a few metro districts. And I'm concerned that if a city council were evaluating the request of an applicant to or the request of someone in opposition of a rezoning to force or for us to, you know'",
        "'speaker_4': ', vote down a rezoning based upon, you know, them not wanting to join the metro district. Is this precedent setting for us as a city? If we voted down this rezoning based upon a really a private business conversation between two parties with a metro district?'",
        "'speaker_10': 'Are we setting a precedent? It's a good question, Councilwoman, and I appreciate that. And it sort of goes back to the questions asked by Councilwoman Sussman, which relate to the rezoning criteria under which you evaluate rezonings. So there's no criterion that says if there's a metro district, then council ought to consider that because that's just not not'",
        "'speaker_10': 'part of the criteria. And we don't know when, if ever, a metro district is going to be formed in this case. There is there is one. It's not related to this property, but there is one. But it still should have no bearing on on the rezoning decision.'",
        "'speaker_10': 'And I don't believe that there's any way for city council to compel the rezoning applicant to join the metro district.'",
        "'speaker_4': 'I think. Thank you, President Clark.'",
        "'speaker_7': 'I don't have any other questions.'",
        "'speaker_0': 'Thank you. Councilwoman Gilmore, Councilman new?'",
        "'speaker_3': 'Well, of course. Mr. Warren, please, sir, just trying to understand a little bit of the history of what the Metro District and the and the G and the general development agreement, the when when when the district was formed.'",
        "'speaker_3': 'Was there discussions with the previous owners for this property about joining the Metro District and joining the general development plan?'",
        "'speaker_5': 'Yes, there was. And they were productive discussions and they were about to enter into an agreement in lieu of joining a cost sharing agreement. But then they sold the property before the agreement occurred.'",
        "'speaker_3': 'Okay. So the owners of that property, have they ever paid for any improvements that the metro district has has entered?'",
        "'speaker_5': 'No, sir.'",
        "'speaker_3': 'So as they've been asked to pay for the improvements.'",
        "'speaker_5': 'Well, we have asked I don't know exactly how to answer that. We have asked them to step up to the plate and ascertain the impacts that their development would have on our district. We think we know a pretty good idea from the studies that we have done how they would impact the district.'",
        "'speaker_5': 'But we've asked them to negotiate and to enter into a cost sharing agreement and they've said they have no obligation to or they don't intend to do.'",
        "'speaker_3': 'It just became a legal matter then. They they weren't required to pay for anything. That's correct. Okay. Thank you, Mr. Wong. Stenographer, does your question, please? I was pleased to hear that you were going to. You're thinking about a 10% open space requirement for your development.'",
        "'speaker_3': 'Would you be willing to get into a development agreement with the Metro District to make sure you can provide that 10% open space?'",
        "'speaker_6': 'I'm sorry. Can you repeat that?'",
        "'speaker_3': 'Could you go into a due form, a development agreement with the Metro District? Just to give some assurance that you are going to provide the 10% open space.'",
        "'speaker_6': 'As.'",
        "'speaker_3': 'You develop the property?'",
        "'speaker_6': 'I think so. I'm happy to, I think, provide assurance. I guess I'm not quite as familiar with entering into a development agreement with the district. And I'd want to understand how that would work a little bit better. But I'm happy to stand here today and tell you we're very comfortable providing in excess of 10% of open space'",
        "'speaker_3': '. Okay. So you can't give them some assurance that's going to happen.'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'Thank you very much. Thank you, Mr.. Thank you, Councilman. Councilman flynn.'",
        "'speaker_5': 'Thanks, Mr. President. Jeff, could I ask you, every time we look at a rezoning and we have all the five criteria that match the application, I'm always struck by the fact that there are other probably other zone classifications that also can meet all the criteria.'",
        "'speaker_5': 'So I'm curious how this is the most dense CMCs classifications. He emerged 20. It allows up to 20 stories of all the mixed use urban center classifications. How is it arrived at that? This was the appropriate application for this site versus TMX 16 or 12 or one of the lesser lesser ones.'",
        "'speaker_12': 'Sure. Yeah. I mean, I guess the quick answer is we respond to the request from the and certainly we work with them to find the right zoned district. But ultimately, we responded to the requests at hand and did the analysis based on that.'",
        "'speaker_12': 'TMX 16 wasn't one of the ones that was requested. I will say that the height allowances for that zone district are below the surrounding heights as context, but again we respond to same x 20.'",
        "'speaker_5': 'Okay, so that 16 is slightly below, but 20 is slightly above.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_12': 'At the number of.'",
        "'speaker_5': 'The time you throw.'",
        "'speaker_12': 'Yeah. I think 200 feet is the max height and TMX 20.'",
        "'speaker_5': '250 252 to.'",
        "'speaker_12': '0 zero 200 feet.'",
        "'speaker_5': 'Okay. I think it's actually 250 and 620.'",
        "'speaker_12': 'I think it's 200, if I may.'",
        "'speaker_5': 'Okay.'",
        "'speaker_2': 'Not in your staff for.'",
        "'speaker_12': '2016 is 200 feet. C-Max. C-Max 20 is 250 feet. All right. You're getting my numbers mixed.'",
        "'speaker_5': 'I apologize for throwing out too many abbreviations. My fault. It's getting late, and I understand that. So let me ask Mr. Negro a couple of questions. The extended stay was built in 1995. Do you know any of the circumstances being the owner now, but not then, as to and how that was developed?'",
        "'speaker_5': 'And is that one of the first developments on the the former, you know, the site there? The.'",
        "'speaker_6': 'Yeah. Yes. I don't really know many of the details surrounding that. My knowledge of what happened then is, frankly, exclusively related to some of the images from Google Earth dating back there. I think that we could repackage.'",
        "'speaker_5': 'Was was the parcel that the extended stay is what was that part of the golf course? Also, if you know, I don't Mr. Warren is shaking his head. Yes. In lieu of him coming up to the microphone. I'll tell you.'",
        "'speaker_5': 'Okay. So when the extended stay was purchased, it was hooked up to the Goldsmith Sanitation? That's correct. District. So when a when a guest it extended stay flushes the toilet doesn't it is always gone somewhere before the metro district was established.'",
        "'speaker_6': 'That's absolutely correct.'",
        "'speaker_5': 'At least at least we hope so. And after the metro district was established, is that parcel connected to the sewerage lines of the metro district? Are they interconnected?'",
        "'speaker_6': 'No, it's not currently connected. The infrastructure for that, the subject proper did not change when the metro district was created.'",
        "'speaker_5': 'Okay. So if it were developed under catch 20 and you have a denser development when people on the 20th floor flush the toilet, that will go to the Goldsmith Sanitation District also.'",
        "'speaker_6': 'Yes, that is possible.'",
        "'speaker_5': 'As possible. Is it possible that it will use or that it will have to use some of the infrastructure provided by the Metro District?'",
        "'speaker_6': 'It is not necessary.'",
        "'speaker_5': 'Okay. I believe, Mr. President, those were the only questions I had.'",
        "'speaker_0': 'Thank you. Councilman Flynn. Councilman Espinosa, do you have more questions?'",
        "'speaker_10': 'I did.'",
        "'speaker_7': 'Correct.'",
        "'speaker_5': 'Correct answer. Yes. If he if his answer is different.'",
        "'speaker_0': 'Come on back up. Since we took a head nod and it sounds like the head nod was maybe not it.'",
        "'speaker_5': 'Was not part of the golf course. It was part of the clubhouse. Okay. But as part of the bounce back property.'",
        "'speaker_0': 'Thank you for the clarification, Councilman Espinosa.'",
        "'speaker_10': 'And I hate to bring up something that is completely irrelevant, but since we're talking about metro districts. At least in the formation of them, you can have a boundary that draw that's drawn in such a way that captures a minority landowner, and that landowner could be essentially compelled by a vote of the district.'",
        "'speaker_10': 'Is that true or not true?'",
        "'speaker_4': 'Sir.'",
        "'speaker_6': 'I. I don't know the answer to.'",
        "'speaker_10': 'Yeah, that's the question for City.'",
        "'speaker_0': 'Who are you directing your question to so we can get somewhere?'",
        "'speaker_10': 'Anybody from the city that's available to answer that or anybody who knows the answer to that question? Actually.'",
        "'speaker_12': 'I will start I will start by saying I do not know the answer to that question.'",
        "'speaker_0': 'One of our attorneys back there want to take this question.'",
        "'speaker_8': 'When forming a metro just metropolitan districts you can form, you can identify a boundary that is an inclusion area. In order to include that property, you have to have 100% of the property owners signatures in order to include the property into the boundary into.'",
        "'speaker_10': 'Okay, great. Good. So I have questions I'm going to ask Dick Farley and David Foster to come up. So I'll start with you, Mr. Foster. On the GDP, how familiar are you with the sort of pre 2010 GDP and post 2010 GDP and the differences between the two?'",
        "'speaker_13': 'I probably can't speak to a real specific difference.'",
        "'speaker_10': 'Okay. At some point in the history of GDP's, in the relative recent history, the process has changed and previously they actually had to come and be adopted by council.'",
        "'speaker_13': 'Yes, I believe.'",
        "'speaker_10': 'A GDP from 2006, the vintage of this one was in fact adopted by council. So you can tell, you contend that there were even though the GDP doesn't include this area in its boundaries, that it does speak to these to this parcel, the proposed map amendment.'",
        "'speaker_10': 'Is that correct?'",
        "'speaker_13': 'Well, all you have to do is look at page four of the GDP and it calls out this particular three acre site, identifies its existing use and proposed future use. And it's somewhat frankly preposterous that you would take an approved GDP and approve plan that has been recognized as an adopted plan by the city and not contemplate'",
        "'speaker_13': 'the entirety of the property surrounding this l parcel. I'm honestly, I'm baffled. Staff may have ultimately determined that the GDP doesn't or shouldn't influence what zone district it is, but to ignore it entirely. When infrastructure was brought up at the planning board and the GDP, GDP speaks to infrastructure.'",
        "'speaker_13': 'I mean, I'm frankly, I'm I am surprised with the somewhat callous disregard for this approved plan.'",
        "'speaker_10': 'So there is a hurry, hurry hierarchy of plans, though, right? In the sort of the more granular, the smaller the area, the more precedent it essentially has.'",
        "'speaker_13': 'But that you know that to be true. You know that if you have the 2000 comprehensive plan in 2000 to blueprint and then you have something that is specific to a site or a small neighborhood area or a small neighborhood plan, you know, that you rely you so do we.'",
        "'speaker_13': 'By the way, as developers and property owners, we rely on those documents to speak more to the specificity of those uses. Then a document that identifies every property across the city.'",
        "'speaker_10': 'And are you is your understanding the same as mine? When I heard the city attorney's response to the question about considering GDP's that he essentially put it in the same level as a small area neighborhood 100%. Okay. Thank you.'",
        "'speaker_10': 'No further questions. Dick Richard, Mr. Farley.'",
        "'speaker_5': 'Declined.'",
        "'speaker_10': 'So you heard the city's response from my previous questions about zoning, district purpose and intent and the response about relationship to arterials and open space. I'm going to read a couple of sentences again from the same zoned zone district.'",
        "'speaker_10': 'The section let me. So again, under the main heading that says general character, this is for urban center neighborhood context. So we're talking about urban center neighborhood context. Just so the record, can you state your credentials and who you are and your professional background?'",
        "'speaker_5': 'Well, I'm a urban designer. I was head of the Denver Urban Design section in from 2000. From 1987 to 96. And then I've been in private practice as an architect. I'm now retired. I've been an urban designer. I've been working with neighborhoods.'",
        "'speaker_5': 'And I mean, the last, you know, sort of five years or so, I was a principal at Civitas in charge of Urban Design. So, you know, I sort of bridge that gap between planning and architecture, between the built part and the policy part.'",
        "'speaker_10': 'Okay. I just wanted people to know that I didn't just pull you out of random. There's a very specific reason. So in section seven one, one general character, it says commercial uses are primarily located along mixed use arterial streets.'",
        "'speaker_10': 'Again, is there any is this or any of these streets that border, this property? Arterial streets.'",
        "'speaker_5': 'Well, Bellevue is close to the property, but is it along? It's not along, no.'",
        "'speaker_10': 'Okay. And then the. Sorry. Let me I'm trying to marry my notes with the actual text. It also then talks about the urban neighborhood context, and it says the urban neighborhood context, which this zone district is, is part of the proposed map amendment is part of this is the urban neighborhood.'",
        "'speaker_10': 'Context consists of a regular pattern of block shapes surrounded by an orthogonal street grid. Are the streets here orthogonal?'",
        "'speaker_5': 'Mostly. But, you know, there's that because of the topography and there's some warping of the of the orthogonal aspect of it.'",
        "'speaker_10': 'So. I was questioning the city because I've had this challenge with the the the sort of stretch that this administration has been doing with Tod's and applying zone districts that that seemingly are not appropriate for those zone districts, even though the densities may and the mix of uses idealized and all the notions that come with those zone'",
        "'speaker_10': 'districts that we may not, in fact, have the most appropriate zone district. Time and time again. And that maybe there is grounds for customized zoning in these regards when we have the uniqueness of these circumstances. So the reason why I brought up those questions challenging the, the relationship of the street grid because of the zone district preceded'",
        "'speaker_10': 'the zone district purpose and intent is not on arterials, but major arterials. You know, I was questioning the the validity of the of that relationship. But I'm am I to understand that you don't have those same reservations?'",
        "'speaker_5': 'Well, I think the the crux of the the issue is what is the city getting out of a massive up zoning? You know, what is a neighborhood getting out of a massive up zone? It's to me, the the aspect of some of the negotiations on the part of the planning office, you know, if you.'",
        "'speaker_5': 'I have no problem with the with an up zoning. But, you know, what are we getting out of it? You're going from something that is a 2 to 1 effort to something that probably is close to 15 or 20 FDR.'",
        "'speaker_5': 'And are we getting any additional open space on it or are we getting design review and design standards and guidelines? Or are we, you know, we're getting open space or we're getting housing? And, you know, I don't think we're getting much of anything with that kind of uphill.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman Flynn, you back up?'",
        "'speaker_5': 'Yes, Mr. President. Thank you. I was I while the discussion made me recall the other question I was going to ask, and that is and I Jeff May, you might be the most appropriate person to address this. And I promise to try not to confuse you again on the terminology, but the current zoning on all of the'",
        "'speaker_5': 'parcels here, including in the Bellevue station, GDP and the applicant property are all with one exception, that this council did in 2015. They are all old. Chapter 59 Zoning. Is that correct? There's an there's a one parcel that's smack 12 that was changed in 2015.'",
        "'speaker_12': 'But yeah, it's like someone can pull it up. Yes. Everything north of Bellevue, west of Quebec, is all old code zoning.'",
        "'speaker_5': 'Okay. And so we don't really have an option in the old for a rezoning of this parcel that the extended stay is on the applicant with, which is before with waivers and 50 foot height limit. I think I think most people would agree that just adjacent to a transit station that's probably not the that this this is'",
        "'speaker_5': 'under zoned right now according to all the planning for four transit stops to have a two storey.'",
        "'speaker_12': 'Yeah that's opinions that underutilized site for example.'",
        "'speaker_5': 'So we have to look to the 2010 code. So my question is and this gets to what I was asking earlier about the need to see Amex toe choice. And I know that was the applicant's choice, but what are what other classifications existed in 2010 code that would more that would better match the time you throw under'",
        "'speaker_5': 'chapter 59. We don't have one that's exactly congruent. But is this the closest to the zoning for the surrounding parcels of those that are available to us in the 2010 code?'",
        "'speaker_12': 'That's tough to say. I mean, the the team you throw, the fact that it has waivers on it to makes it a very layered, nuanced, custom zoned district. So we did not do that analysis of the most comparable.'",
        "'speaker_12': 'I will say we looked we looked both at the suburban context and the urban center context. And there was it really was in a suburban context zone district that really sort of fit in with the overall sort of land use and zoning framework.'",
        "'speaker_12': 'So that put us into the urban center context, and that is where we are today. There's just not I don't really have a great answer for you because it's such a customized, zoned district. We don't really have anything that.'",
        "'speaker_5': 'You throw the.'",
        "'speaker_12': '2330 with the way. With the waiver. Yeah. Yeah.'",
        "'speaker_5': 'Okay. Okay. So we don't have anything that can exactly match, but. But the CMH 20. Other than the 30 foot additional height and the open space. 10% minimum in the team. You're 30 and none here.'",
        "'speaker_12': 'Yeah, we don't, we, we don't have a zone district that based on district that has really robust open space requirements. I think we've got some in the Cherry Creek area that are specific to that area with some open space requirements.'",
        "'speaker_12': 'But other than that, not a requirement really that was carried forward into the current code, which is I mean, like it or not, it's kind of the system that we're working with right now.'",
        "'speaker_5': 'Then I'll say not. All right. Well, thank you, but that's almost frozen.'",
        "'speaker_0': 'Thank you, Councilman Flint, Councilwoman Sussman.'",
        "'speaker_9': 'Yes. I have a question about something that's been of concern to me about the protest petition. Certainly had an experience with that recently. In this particular protest petition, how many signatures did it require to engender a protest petition?'",
        "'speaker_12': 'Oh, gosh, I'll have to I have to pull out my staff report. I think it was only four. I'll have to confirm that for signatures. Well, it all depended on which property signed because it depends on the geographic area of the property owner who is signing.'",
        "'speaker_12': 'So in this case I believe you only needed four representing to get to that 20% threshold. But it really so isn't really the number of property owners, it's the number of property owners in tandem with the percentage area that they own.'",
        "'speaker_9': 'Exactly. So there are four owners that own 20% of the 200 feet.'",
        "'speaker_12': 'And if you'd like, I can confirm that with sense.'",
        "'speaker_9': 'Okay. Okay. Just wanted me to know how many it took. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Sussman. Seeing no other questions, the public hearing for Constable 1497 is closed. And we're going to move on to comments by members of Council. Councilwoman Black.'",
        "'speaker_2': 'Thank you, Mr. President. I'm going first because this is in my district. And Councilman Flynn, to follow up on your line of questioning about the zone district, also in my district is the Colorado station and it is actually zone and 20.'",
        "'speaker_2': 'So just as an employee. So it's great that you're all here on some friends are in the audience tonight. The Bellevue station is an incredible development for our city. And in my district, my constituents are really enjoying all the great new restaurants there as I am personally.'",
        "'speaker_2': 'Some of you may not know this little bit of trivia, but this family has owned this property for 160 years. Is that right? 1880s, I've been saying 1860s, 1880s. They are very patient. I also wanted to comment that the statistical neighborhood is called South Moor Park, which anyone who lives in south east Denver would never call that'",
        "'speaker_2': 'South More Park. In fact, the actual park called South Moor Park is not even in South Moor Park, this particular motel. I think all parties who are aware of the area are pleased that it's going away. It's been a.'",
        "'speaker_2': 'A development that has had a lot of crime. And I know the police have been there a lot trying to solve some of those issues related to that motel. As far as this rezoning goes, I think I first heard about it close to a year ago.'",
        "'speaker_2': 'I know it was winter and I really struggled with it. I have had countless meetings with multiple city attorneys and people in the mayor's office so I could better understand the legal issues around it. As a council, we often go off topic when we are discussing rezonings.'",
        "'speaker_2': 'And so I have been very clear in talking to our attorneys to make sure that we stay on topic and that we follow the legal criteria for this rezoning. There's a lot of issues that are important to this rezoning, and some of them are relevant to the criteria and some are not.'",
        "'speaker_2': 'I hear you all when you express your sense of unfairness around the infrastructure. I agree with you. And, you know, if there was a way to make them pay for your infrastructure, that would be great. I have asked both of you to talk to each other to see if you can come to some sort of agreement.'",
        "'speaker_2': 'But there is nothing legally that the city can do to compel you to do that. There is no legal way to force one party into a special district. It is a voluntary thing to be in a special district.'",
        "'speaker_2': 'Again, we've had numerous conversations about that, and it is my understanding that all over the city we have instances where the first developer in pays for the infrastructure and the next guy or woman in benefits. And it's just not fair, but that's just what happens.'",
        "'speaker_2': 'I still would love it if you all would get together and come to some sort of agreement on the open space issues. Yes, we need more open space in our city. I'm pleased to hear that your plans would include some open space.'",
        "'speaker_2': 'I have to acknowledge Chris Nevitt in the audience. I feel like I'm on the Academy Awards. I like to think of it now. Chris Nevitt, he is our manager of transportation oriented development, had a lot of conversations with Chris about this project.'",
        "'speaker_2': 'And it it it is an appropriate zoned district for a light rail station and for Todd. And as we as I said when I first started talking, the Colorado station does have this exact same zoning, so I will be supporting this.'",
        "'speaker_2': 'It aligns with the legal criteria that we are supposed to be looking at. Again, there are a lot of other issues, but they are not relevant to the legal criteria to resell this property. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Black, are there any other comments? Councilman Espinosa.'",
        "'speaker_10': 'All right. Sorry. I'm finishing up notes. I've heard that I'm better when I read than going off the cuff. My issue on this is as much the minimum as it is the maximum, and neither are adequately or appropriately addressed by the proposed zone district.'",
        "'speaker_10': 'In a zoning sense, we are trying to shove a square peg into a round hole and what can be built there is everything from a McDonald's to a 250 foot tall mass that covers every square inch of the parcel.'",
        "'speaker_10': 'No setbacks. No open space required. None. Which will it be? Who knows? We could, with more appropriate zoning, tailor to the unique circumstances and the opportunity that this land has for placemaking next to a TOD Transit Station. But we have to prioritize outcomes over the status quo.'",
        "'speaker_10': 'Selecting a base zone district to much of the things that Dick Farley just talked about is just accepting the status quo, which a lot of communities in this city have spoken out against that are based on. Districts do not do enough.'",
        "'speaker_10': 'We've done a two year planning effort. Denver Right. Talking about district standards and guidelines because of the deficiencies in our base zone districts. And not to take these opportunities to codify real outcomes that are. Todd is a dereliction of duty.'",
        "'speaker_10': 'There are major differences in concert mean there are major deficiencies in consistency with adopted plans and neighborhood contexts and non-conformists with the zone, district purpose and intent. The Base Zone District is intended and is defined in the Denver zoning code for an entirely different context.'",
        "'speaker_10': 'The area is clearly conducive to a mix of uses. I won't deny that. Increased density. That too. And has plan objectives for those outcomes with some much needed public amenities, including open space. This zone district is being taken out of context in an attempt to apply it to a zone lot that does not conform to the district'",
        "'speaker_10': 'purpose and intent. If we do not have an appropriate zone district due to the uniqueness of these circumstances that would capture the stated and codified objectives of all adopted plans, then you have the conditions. An applicant would need to justify a PUD that would appropriately address all requisite criteria.'",
        "'speaker_10': 'This MAP amendment fails to meet two of the most significant criteria and is wholly inappropriate. The fact that the city administration and appointees continue to ignore these simple facts continue to fail not only this particular station area, but all Denver communities, as it has repeatedly for the last ten years or eight years, sorry, since we adopted the'",
        "'speaker_10': 'new Denver zoning code. The things that Chairman Siku is talking about were real. And if we don't get these things right and we don't demand more from our city staff and push developers requesting. Dick Farley was right. 820 a tenfold increase in entitlement to go from basically far to too far.'",
        "'speaker_10': '20. That's 18 stories of zero set back that we are granting this developer for the cost of going through the rezoning process. If we can have tough discussions then and get better outcomes by the time it gets here and we continue and we continue to approve those things, don't be surprised what comes after the Denver right is'",
        "'speaker_10': 'adopted. Thanks. I'll be voting no.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilwoman Gilmore.'",
        "'speaker_4': 'Thank you, President. Clerk You know, based upon the current plans that we have and the legal responsibility that that we have to look at the information that's presented before us and. Would I like different things done around requiring open space?'",
        "'speaker_4': 'Of course. I think as a city council, we should really dig into the, you know, the general development plan process we have. We don't have a say in requiring open space in new developments. We're leaving that up to CPD and especially when there might be recommendations where a developer might split parcels so that you're not under that'",
        "'speaker_4': 'ten acres to move things forward that can affect a community very negatively, not having that open space, I understand that. But we've got to look at what's presented before us tonight and in everything that has been presented. In reviewing the criteria.'",
        "'speaker_4': 'I believe it does meet the criteria because this is by a towed station. We need the density by a Todd, by that within that Todd area. And I'm very concerned that we're blurring those lines between what we as council can do around metro districts.'",
        "'speaker_4': 'I would probably never have a successful rezoning in District 11 if we were taking as some of the criteria that we were going to compel a property owner to become part of that metro district, just for the very fact of the way that Green Valley Ranch was built.'",
        "'speaker_4': 'And that's very concerning to me, because we could try to compel someone to join into a metro district. And that, unfortunately, could affect us getting a full service grocery store to serve our neighborhood because they want to make a business a business direction that they don't want to come in under that metro district because the metro districts'",
        "'speaker_4': 'serve their purpose. They help us get development and infrastructure in the city, but they also tack on additional taxes and mills that can make it very hard for local owned businesses to stay in the neighborhood. Our you know, the the prices that we have in Green Valley Ranch sometimes rival near to the urban core.'",
        "'speaker_4': 'That makes it an undue burden. And we cannot use the metro district argument to vote down this rezoning. And so with that being said, I will be supporting the rezoning. Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore, Councilwoman Ortega.'",
        "'speaker_4': 'Thank you, Mr. President. So first, I just want to thank everybody on both sides for coming down and sharing all the different perspectives on this issue. I think it's critically important that we look at every single zoning on the merits of what is presented before us.'",
        "'speaker_4': 'I appreciate the commitment that was made to include open space on this site because that was a big part of tonight's conversation. This is an area of change under blueprint. It is a tod site. Across the city we have been seeing zoning increases to accommodate trying to get more people at our tod locations, encouraging more people to'",
        "'speaker_4': 'take public transit, try to make sure we're closing the gaps on first mile, last mile so that people don't have to drive their cars to go to work regardless of wherever they happen to work. And I think if we really want to see councils involvement, as was previously done when I served with a whole different body of'",
        "'speaker_4': 'people, then we need to change the zoning code if we want this body to look at the details that we used to see, because that authority was abdicated to the Planning Department under previous council, and we now no longer see that level of detail that used to come before this body.'",
        "'speaker_4': 'And I think there is less predictability for the neighborhoods, but I think that there is also less predictability for the developers because you then have to deal with the planning department to work through this process. So that's something we may want to have a collective conversation with our development community about.'",
        "'speaker_4': 'And I've had this conversation with a number of them. You know, when when we did a metro district in the Central Central Platte Valley in my old district, the city played a big role in basically doing some of the infrastructure, like building the parks, which actually were built to serve the Highlands neighborhood on the other side of'",
        "'speaker_4': 'the highway. But with all the new development that came in, it actually serves, you know, those constituents probably more so than it does people on the other side of the highway. The metro district obviously covered a bunch of other improvements that really kind of laid out the opportunity for the developers to come in and build a lot'",
        "'speaker_4': 'of that high density development that exists there today. This is a 3.2 acre site. And I know we're looking at just the merits of this case. But just to put this into context, we're now talking about approximately 500 acres of development that we're going to see along the I-25 corridor.'",
        "'speaker_4': 'And we're not even having the big picture conversation because we're not involved in that process, because we've been taken out of it to look at what are we doing to address the impact to the existing infrastructure of waterlines, sewer lines, all of our other utilities, the existing roads.'",
        "'speaker_4': 'I-25 is gridlocked today. I drive that corridor every single day, and we can't widen it through parts of that section because we've built right up to the edges. So as a city, I think we need to take a step back and look at how we are addressing the bigger picture of the impact issues when we are looking'",
        "'speaker_4': 'at huge parcels. And again, you know, just taking into account what we will be seeing on the I-25 corridor, it's going to be massive. And we think we have gridlock today. We need to be getting our arms around this on the front end and not wait until it hits us in the face and go.'",
        "'speaker_4': 'What are we going to do now and expect the taxpayers to pay for everything? So these are important conversations to have. I will be supporting this tonight. I appreciate the fact that the developer of the Bellevue Metro Station, this MIT district, you know, covered the cost of all the infrastructure to build out that site.'",
        "'speaker_4': 'And, you know, I served with Councilwoman Foster at the time. All of that was brought forward. The sewer lines, the water lines were were increased in size to accommodate the increase in development activity that was proposed at this new TOD site.'",
        "'speaker_4': 'But that doesn't that doesn't require that the current property owner has to cover those costs. Each metro district stands on their own. And we have seen more and more of them come before this body that have been approved for new development that is yet to come, some of which I just talked about.'",
        "'speaker_4': 'So. Legally, I can't see any justification to say this particular property owner because they will be utilizing the roads, potentially tapping into water or sewer lines, all which connected the city's lines. That that they should be held accountable or responsible for some of the costs that other property owners who came before them had to incur that are'",
        "'speaker_4': 'within the metro district. So for all of those reasons, I will be supporting this tonight. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Ortega. I don't see any other comments, so I'll just quickly add. Councilwoman Black, you had acknowledged our toddy guru, Chris Nevitt in the building. I just wanted to also acknowledge that he's a former member of this body representing Luckey District seven.'",
        "'speaker_0': 'So Councilman Nevett, honored to have you in the chamber this evening. Good to see you. I want to say thank you to staff for all your work on this, putting together the presentation, I think as outlined in the presentation tonight and in the staff report.'",
        "'speaker_0': 'For me, this meets the legal criteria for rezoning and I will be supporting it tonight. Councilmember Since Community Planning and Development has determined that the requirement for a legal protest has been met with petition signatures, then ten affirmative votes are needed instead of the standard seven to pass this bill this evening.'",
        "'speaker_0': 'With that, Mr. Secretary, roll call on Council Bill 1497.'",
        "'speaker_11': 'That's all.'",
        "'speaker_2': 'All right.'",
        "'speaker_7': 'Gentlemen. Brooks. I know. I feel more. I earned it.'",
        "'speaker_3': 'I kasmin. I can eat. I. Lopez I know.'",
        "'speaker_9': 'Ortega Hi. Sussman Hi.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_0': 'All right, Mr. Secretary. Close the voting. Announce the results. 12 hours, Mr. President. 12 eyes one day. Council Bill 1497 has passed. On Monday, February 25th, 2018, Council will hold a required public hearing on Council Bill 1480 for changing the zoning classification for 42 on Delaware Street in Globeville and a required public hearing on Council Bill 1540'"
    ]
}