{
    "Denver Zoning Code Text Amendment for Expanding Housing Affordability.": [
        "'speaker_0': 'Council member Sawyer has called out Council Bill 424 for an amendment and council members say to backing Flynn have called out Council Bill 401 for comment. Under Bill's for final consideration, no items have been called out. Under pending, no items have been called out.'",
        "'speaker_0': 'Madam Secretary, please put the first item on our screens. Thank you. Council Member Canete, would you please put the council bill 4 to 4 on the floor for publication?'",
        "'speaker_4': 'I move that council bill 20 2-0 4 to 4 be ordered published.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Council Member Sawyer, your motion to amend.'",
        "'speaker_4': 'Thanks, Council president. I move that council bill 20 2-0424 be amended in the following particulars. One actually it says one, but there's only one. So here we go. On page one, line 30, Strike Clerk File number 20220052. As filed with the Denver City Clerk on April 27, 2022 and replace with clerk file number 20220052a.'",
        "'speaker_0': 'Thank you. It's been moved. Can we get a second, please? Thank you. Comments by members of Council on the Council Amendment. Council Member Sawyer.'",
        "'speaker_4': 'Okay. Hang on. Let me look here. There's a little more for me to read. Do I need to? Yes. Specify elements will make my house.'",
        "'speaker_0': 'Okay. I'm going to do.'",
        "'speaker_3': 'Perfect.'",
        "'speaker_4': 'Okay. So thank you, Madam President, for clarifying that this amendment is just a small tweak to the amendment that Councilwoman Sandoval had brought regarding parking that was adopted in LUTI. And the purpose of it is just to align the requirements for any developer within a quarter mile of a proposed transit corridor or rail line with the current'",
        "'speaker_4': 'citywide parking requirements for affordable housing developers. So that's point one parking spots per unit. I agree 100% with Councilwoman Sandoval's amendment. I'm just concerned that there's going to be real world implications resulting from that change. Not only is it going to cause some safety issues in the neighborhood that board it border these transit zones.'",
        "'speaker_4': 'But actually I believe it will end up exacerbating gentrification and displacement in some of our most vulnerable neighborhoods. The way it reads now, it would require zero parking spots for any developer that's building the affordable units into their development along that planned transit corridor.'",
        "'speaker_4': 'So functionally, this does two things. First, people are still going to have cars and no parking means those cars are going to end up on the street. We see major problems with sightlines on the streets. That line major transit corridors.'",
        "'speaker_4': 'For example, we have a section of 14th Avenue between Grape and Hudson. In the three years I've been in office, we have had over 14 crashes. And I'm not talking about like fender benders, like rollover crashes that have taken out people's fences, people's front yards, people's almost people's houses.'",
        "'speaker_4': 'And we're still waiting for the city to do something about it. I don't want to make this problem any worse. Second, allowing a parking exemption in this area makes the land within that buffer zone more attractive to market rate developers.'",
        "'speaker_4': 'That drives up the cost of the land along our planned transit corridors. That means it's going to be impossible for affordable housing developers to purchase that land. So instead of getting 30 affordable units in a development being built by an affordable housing developer, we're going to get four affordable units and 26 market rate units built by a'",
        "'speaker_4': 'market rate developer. It will take ten of those developments to get the same number of affordable units along a transit line. We're already seeing this trend in East Colfax, even with the parking exemption in place. So, for example, we've got three motels in East Colfax that were all recently purchased by market rate developers, even though there were'",
        "'speaker_4': 'affordable housing developers bidding on those properties as well. We've see that the affordable developers simply cannot compete with the offers coming from market rate developers exempting all parking requirements for a developer who only plans to build to finish percent, maybe a little more of the total units as affordable is only going to make this problem worse and'",
        "'speaker_4': 'thus exacerbate the gentrification and displacement that we already see happening in East Colfax, which is one of our most vulnerable neighborhoods. That said, as I mentioned before, I agree 100% with the intent behind Councilwoman Sandoval's amendment. So I'm just proposing this point one parking amendment to align I think it strikes with the affordable housing developer requirement, which'",
        "'speaker_4': 'is city wide, not just along transit corridors. I think that this is sort of striking a balance. So it's offering an incentive to market rate developers to build those affordable units into their developments along the transit buffer zones.'",
        "'speaker_4': 'But it doesn't necessarily make those challenges to gentrification and displacement or those safety issues that we're seeing along these corridors any worse. So by aligning those parking incentives in the buffer zone, market rate developers with the already existing parking incentive for affordable housing developers, which, like I said, exists across the city, I think that's just a little'",
        "'speaker_4': 'bit of a better balance. So that's why I'm making this recommendation, and I hope you will support it tonight. Thanks, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Steuer. Next up, we've got Councilmember CdeBaca.'",
        "'speaker_3': 'Mine is just for comments, not a vote on an amendment tonight, but just wanting to give my colleagues a heads up that I will be proposing an amendment to the three on the 30th. And Blake, this one and the.'",
        "'speaker_3': 'The other piece of this, the map, one just to one increase our fees and then to to make the 38th and Blake amendment not up zone. I think it's area seven all the way to 12 stories that's out of compliance with the plan the neighborhood plan that we have.'",
        "'speaker_3': 'And so I'd ask my colleagues to honor that and take a look at them. And it'll be in your inbox tonight when you all get home. And then the map amendment to match it. Thank you.'",
        "'speaker_0': 'Thank you. We're going to go ahead then and return to the amendment on the floor. Councilmember Sandoval, go ahead.'",
        "'speaker_3': 'Thank you, Madam President. If it's okay, can I please call and please hook up to help us answer some questions?'",
        "'speaker_0': 'Sure. Just introduce yourself and Elise for the record.'",
        "'speaker_3': 'Good evening. Members of Council Annaliese Hoke, principal city planner with Community Planning and Development. Thank you for being here tonight, Annalise. So with this amendment, even though the language seems to be simple. I have found when I been working within the zoning code.'",
        "'speaker_3': 'It's not as simple as it always seems like. It's called out in in different areas. So can you just talk about are there any unintended consequences of this particular amendment? It's hard to know the magnitude of unintended consequences, as we haven't had a ton of time to really evaluate it.'",
        "'speaker_3': 'But one just piece, it's more of a technical drafting thing that sometimes we don't get into the weeds. Our Denver zoning code has our parking minimums, but then within that it also has parking exemptions, parking reductions and alternative parking ratios.'",
        "'speaker_3': 'The parking exemption language that is being proposed through this change is remaining in that parking exemption section of the code, but it's actually an alternative parking ratio of 0.1. So there's a little bit of a technical confusion where we're essentially adding another layer of an alternative parking ratio, but in kind of a different section of the code'",
        "'speaker_3': '. So there's sort of that technical piece. I think it's also important to note that this is not only peeling back the amendment that was passed out of ludy as it pertained to expanding this to BRT corridors once they were constructed.'",
        "'speaker_3': 'But it's also peeling back the parking exemption in areas that are within a quarter mile of a fixed rail transit station, which we have really not received any opposition or concerns about. If anything, we've seen a higher rate of comments supporting those to be expanded further.'",
        "'speaker_3': 'So I don't know if that's helpful. Thank you. So one quick one. Also question can cause this policy so dense? There's a lot in it. The. The proposal for the parking exemption. Can you talk about how it's an incentive to for the policy and how you would actually if a developer chose to go with the incentive, they'",
        "'speaker_3': 'would. What's their deliverable? Are they're in for the amount of affordable units we would get? Great question. Yes. So this policy sort of has two tiers of build on site requirements as well as alternative compliance. And the incentives are really designed to ensure that we are getting as many units built on site creating mixed income, affordable housing'",
        "'speaker_3': '. That first tier is base incentives, and that includes the alternative parking ratio, which gets a reduction down of all units by point one. And that's context sensitive. So that is for building units on site. Depending upon that compliance option, it ranges from 8 to 10% on their market area.'",
        "'speaker_3': 'However, in exchange for a greater level of affordability on site to more affordable units, developer applicants have the ability to then pursue additional incentives. Parking exemptions is one of those. It's important to note that these parking reductions and exemptions were really also derived out of conversations with the affordable housing development community, as they are commonly the ones'",
        "'speaker_3': 'who are looking at those really small, really challenging, hard to develop parcels that are often passed up by market rate developers because they are still continuing to provide parking that is well above the minimums that we see. And so this is really serving as another meaningful incentive to allow for projects to move forward in those transit rich'",
        "'speaker_3': 'areas and provide more units over affordable or excuse me, more units of both market rate and affordable over parking spaces. Thank you. And one last question, one last comments. Last question. In the public comments that you have received after the amendment from Moody, did you receive public comment for this bill supporting the amendment that we brought forward'",
        "'speaker_3': 'to reduce the parking around the quarter mile? And I want to make sure that I'm clear I'm built or something that is going to be built into it can't just be aspirational. And the city actually has to be something that we are going to build out.'",
        "'speaker_3': 'Can you talk to us about some of the public comment you received? Yeah, certainly. So throughout this process and up until the formal public hearing, we are going to continue to gather public comment that we receive. But there is a notable spike in public comments following the amendment.'",
        "'speaker_3': 'The majority of those comments coming in were speaking to support of those changes. There was certainly, you know, folks that do raise concerns, but it was certainly at a much smaller ratio than those in support and those will be included.'",
        "'speaker_3': 'Anything that came in after will be included in the council packets along with any other public comment. Great. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. And thank you, Annaliese. Next up, we've got Councilmember Hines.'",
        "'speaker_7': 'Thank you, council president.'",
        "'speaker_1': 'I share Councilmember Sawyer's concern. We have a lot of cars in our city, and we continue to have more cars in our city and we continue to have crashes.'",
        "'speaker_7': 'And lots of traffic and gridlock.'",
        "'speaker_1': 'Colorado, which my colleague from District five and I share, might as well charge for parking. It is just such a mess. That said, I think that we should get rid of we should get government out of the business of parking minimums at all.'",
        "'speaker_1': 'Frankly, if the funding stack would allow it, I would prefer parking maximums in our city. I think that that what we need to do is make sure that we have good alternatives to cars, including a broad.'",
        "'speaker_2': 'Inviting, pedestrian experience.'",
        "'speaker_1': 'Protected bike lanes and and other ways for people to get around our city without a car. We're expecting an additional 200,000 people to move to the city of Denver by 2040. That's in the Blueprint 2019 adopted plan. And if we don't provide viable alternatives to cars and encourage that, those 200,000 people will bring at least an additional'",
        "'speaker_1': '200,000 cars. So if you think parking is bad now when we have 30% more people in cars here, it'll just be way worse. So I recognize that we have a lot of challenges and issues with traffic in cars.'",
        "'speaker_1': 'I want to make sure that we encourage people to live along areas where we can have car alternatives, such as major transit corridors. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Hines, Councilmember Flynn.'",
        "'speaker_1': 'Thank you, Madam President. On a list, could you expand a little bit on the advisory committee? And it's how you address some of the comments and concerns that you heard with them, because my understanding is that when this went.'",
        "'speaker_1': 'From the advisory committee. Whenever I'm from CPD two Planning Board, it included part of an exemption only for affordable, deeply affordable at a near fixed transit stations like rail zacharek. Okay. And the recommendation from planning board was to bring it to committee where it was amended by Councilwoman Sandoval to extend or to restore that exemption.'",
        "'speaker_1': 'That was in the original proposal that had been modified at the advisory committee.'",
        "'speaker_3': 'Is that. Yeah. I'll clarify a little bit more. So the advisory committee is comprised of about 20 or so individuals with various backgrounds throughout the city of Denver. Councilman Sandoval and can each have also been serving on that committee and thank you for your continued time commitment on that.'",
        "'speaker_3': 'In the kind of last round of public comments before publishing that that planning board review draft, we did hear some concerns, particularly out of some of the committee conversations around the expansiveness of the parking exemption. And so we peeled that back to only apply to the fixed rail transit stations.'",
        "'speaker_3': 'At the advisory committee, we did have some members that, you know, expressed some concern and disappointment with that change. However, overall, we just felt like it was still appropriate and still a strong proposal to move forward with a parking exemption but allowed in fewer areas of the city.'",
        "'speaker_3': 'Councilwoman Sandoval then brought forth an amendment that did not restore it to its entirety of the original proposal, but rather take a more nuanced approach that was focused on corridors within that that capital investment that the city was making as realized.'",
        "'speaker_3': 'And we had that adequate infrastructure in place.'",
        "'speaker_1': 'Okay. Can you explain what that adequate infrastructure is? I'm thinking of Federal Boulevard, which is a really good service. Yeah, but it is proposed in the future for BRT. I'm sorry, bus rapid transit speak, an acronym. So would this not apply until and unless the BRT is built out on Federal Boulevard and it would not apply now'",
        "'speaker_1': 'when it's simply the Route 31 and 30?'",
        "'speaker_3': 'That is correct. So I think the nuance of it is it's not just saying transit corridors as they exist today and have high frequency transit service, but corridors as they exist as Denver moves envisions them with not only high frequency transit service, but also the infrastructure in place to support that high, high frequency frequency capacity where you'",
        "'speaker_3': 'have, you know, unloading offloading off of station. So all of that is detailed in the definition in the Denver zoning code. I thought I had it printed here, but I don't.'",
        "'speaker_1': 'Okay. Thank you for that clarification. I really appreciate it. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. Councilmember Sawyer, we have you back in the queue, but I wanted to see if I could go to each and Ortega first. Sure. Okay. Thank you. Councilmember. Can each.'",
        "'speaker_4': 'Thank you. Council President I just wanted to clarify two questions so everyone understands what they're voting on. You and Councilwoman Sandoval had a long conversation, but I just want to underscore. So if this amendment were to pass, we wouldn't just lose the parking exemption that Councilwoman Sandoval introduced for bus.'",
        "'speaker_4': 'Is that correct? What would we also lose?'",
        "'speaker_3': 'Yes, we would also lose the parking exemption of sites that are providing enhanced affordability within a quarter mile of a fixed rail transit station. So it entirely eliminates options for projects to to provide zero parking and provide that higher level of affordability.'",
        "'speaker_4': 'And we did not get feedback about that exemption around rail. So we would be losing an exemption. We got no negative feedback about, generally speaking.'",
        "'speaker_0': 'None, none.'",
        "'speaker_3': 'That I have directly received through our various feedback forms.'",
        "'speaker_4': 'The second question I want to ask is the exemption is not only available to market rate developers. So there was some rationale that, you know, this is going to change. But can you please describe how the incentives in this bill are also available to affordable developers and how this amendment would affect them?'",
        "'speaker_3': 'Yeah, absolutely. So, you know, while this is designed with market rate developers in mind, it has also been designed with how do we remove existing known barriers to affordable housing development of those low tech projects that are providing the deeply affordable, much necessary affordable housing that we need in the city.'",
        "'speaker_3': 'And so by even though they do have that existing point one alternative parking ratio for units at or below 60%, AMI this did allow for those projects to build on those really small, unique, challenging sites at a to zero parking ratio.'",
        "'speaker_3': 'So by peeling this back, it not only would have impacts on the market rate projects which have candidly kind of said Denver's not quite there yet. We need we need this infrastructure to come along. But the affordable housing projects, some of these really small sites, they can't fit the parking and the needed turn radius to develop the'",
        "'speaker_3': 'housing on it. And so it allows for them to actually go in and access some parcels that might otherwise be passed up by market rate developers, because there's still that expectation of needing to provide vehicle parking in the market rate development.'",
        "'speaker_3': 'So does that clarify?'",
        "'speaker_4': 'Thank you. So I'm just going to add my comments. I appreciate that. There are places where we as colleagues may just differ. So I respect the concerns that my colleague has. I will not be supporting this amendment tonight for the following reasons.'",
        "'speaker_4': 'One, because it does take us backwards on rail, and also because I believe that our bus rapid transit investments, when they are made with capital infrastructure, are intended to deliver rapid transit and the type of infrastructure to more neighborhoods than we would get through rail alone.'",
        "'speaker_4': 'So I supported the original Sandoval amendment and worked with the team and supported the creation of that very narrow piece. And so I absolutely do not believe that we need to remove this exemption, not just from those bus corridors, but also from those rail corridors.'",
        "'speaker_4': 'So that's the first reason. Secondly, I, I do not respectfully agree with the rationale behind the amendment. Affordable developers have always, in this city, had to compete with market rate developers for land. It's very rare that a piece of donated or city land is available.'",
        "'speaker_4': 'So this is not a new phenomenon. And yet they have managed repeatedly to identify more parcels than we've been able to find. Every year, multiple projects go into the low income housing tax credit application round and only a few are selected and other projects, unfortunately, are unable to succeed.'",
        "'speaker_4': 'That's on us to continue to grow the the resources that we have. But we have seen, you know, time and time again, that doesn't mean every affordable developer is able to take down every piece of property they compete for.'",
        "'speaker_4': 'But it means that we don't need to change our zoning code in an attempt to try to create market outcomes that have, you know, for decades managed to occur even in a tough market. I don't at all envy those affordable developers having to go out and do that competition.'",
        "'speaker_4': 'But there's no reason and there's no evidence behind the fact that this parking reduction alone would somehow create a differential in their ability to compete for land. There's just not data to support that. So for those reasons and then finally for the fact that we have a very dedicated planning board and a very dedicated set of stakeholders'",
        "'speaker_4': 'who spent time on this. And there was strong support from the stakeholders as well as from the Planning Board, for us to treat bus rapid transit a little more equitably with rail. That's the original intent behind the amendment.'",
        "'speaker_4': 'So for those reasons, I will not be supporting the amendments and I would urge my colleagues to reject it as well with the comfort that the market has been building plenty of parking in plenty of places where they're already not required to build any like downtown.'",
        "'speaker_4': 'The market has not under built parking in this city to date. And so I think that we do not need to go through back flips in our zoning code for for that purpose. So thank you very much, Council President.'",
        "'speaker_0': 'Thank you. Councilmember each. Councilmember Ortega. Thank you, Madam President. I wanted to ask an ELISA question about the developments that we're seeing so far at our TOD sites and what am i levels that we have seen commitments to.'",
        "'speaker_3': 'At a high level. I don't know if I have a clear answer for you is that's not something that I've specifically been tracking. I think it's important to note that today we do not have any requirements to construct affordable housing.'",
        "'speaker_3': 'We have a very nominal linkage, which most people choose, and then we have our affordable housing projects that the city has opportunities to put funding into. And then there's a handful of projects that pursue voluntary housing agreements as a part of rezoning.'",
        "'speaker_3': 'So if there's something in those three segments that's of particular interest, I'm happy to follow up on that. But generally, I don't think I have a summary point. My apologies.'",
        "'speaker_0': 'Okay. No problem. Thank you for answering the question. I wanted to speak in support of this amendment and. Let me spell out what those reasons are. First of all, I have served on the board of a nonprofit housing development group as the president for many, many years.'",
        "'speaker_0': 'Keep trying to give away that role to my colleagues, and none of them choose to take that. But I've had intimate involvement with many of the projects that we have worked on. They're all low income projects, and it takes multiple rounds to go through the low income tax credit application process with the Colorado Housing Finance Authority, because'",
        "'speaker_0': 'the dollars are very competitive, both for the 9% and the 4% dollars. What I have seen in the development that has occurred across our city where they are private development and they're being asked to include affordable housing lots of times, even when we have some of our money in there, we're typically seeing commitments at 60 or 80%'",
        "'speaker_0': '. Those are typically people that own cars. Where we see folks that typically don't own cars are 0 to 30% of the area median income. And even in projects that have the 0 to 30. Typically for nonprofits, they are blending incomes of people in a building there, not a project that is all 0 to 30 of the am'",
        "'speaker_0': 'I. It's a mix of 0 to 30 on up to typically 60, maybe 70% on the high end. So I am concerned that we are seeing for low income people that will live in a project that is an affordable unit, they're not going to they're not going to own a car.'",
        "'speaker_0': 'They're not going to need a parking spot. And they will be the people challenged to go find a parking spot for their cars. Yes, we all want to see people get out of their cars. But until we have the right transit system and the connectivity that allows people to get out of their car and address their first'",
        "'speaker_0': 'mile, last mile, we will still have people driving their cars, which is why we've actually been bringing some people from different countries and states to have presentations with this body to help us look at expanding our thinking about how we do transportation in this city.'",
        "'speaker_0': 'So I think this is a reasonable request. I really believe that there is a threshold difference between the 0 to 30 projects and anything from 60% above. And I would suggest that assuming this bill moves forward tonight, with or without the amendment, that we should address that threshold difference and review this ordinance at some time in the'",
        "'speaker_0': 'future to see exactly what is happening with the difference between those two emission levels and what's happening with the the parking issues and challenges. I can remember going to see a project in Seattle and I think some of you were part of the trip.'",
        "'speaker_0': 'I think this was a partnership trip, if I'm not mistaken. And we saw some affordable micro units that didn't have any parking and the people who lived in those units had cars and they were having to park four and five blocks away carrying their groceries.'",
        "'speaker_0': 'None of them had children because the units were too tiny. They were basically targeted for single individuals. But I don't want to exacerbate our parking issues, and I clearly understand there is an additional cost to create a parking space for a unit in these projects.'",
        "'speaker_0': 'But at the same time, I don't want to create a classism problem that says if you live in a low income unit, you're going to have to park your car further away because we just don't have a parking spot for you.'",
        "'speaker_0': 'But if you can afford one of the, you know, higher, more expensive units, then you'll get a parking spot in in your in the building. And that's that's a huge concern for me. So I will be supporting this amendment tonight.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Ortega. Councilmember Sawyer.'",
        "'speaker_4': 'Thanks, Madam President. Just wanted to ask Anshul to clarify. I heard several councilmembers say that this would that this was a drafting thing that would remove the parking exemption. And it does remove the parking exemption and replace it with 0.1 or 10% parking requirements for the total unit.'",
        "'speaker_4': 'Can you just walk through that with me and maybe clarify and confirm that what I'm saying is correct because it sort of presented a little bit differently.'",
        "'speaker_2': 'Sure. Thanks, Councilman Sawyer. So the the amendment that you're proposing would remove the exemption that's enjoyed by the and compliant structures in those areas, by rail transit authorities and then those particular design districts. And that exemption will point 9 to 27.1 units per unit.'",
        "'speaker_4': 'So it does apply to rail? Correct. And it does apply to BRT. Got it. It's just doing nothing else but changing. 02.1. Correct. Okay, great. Thank you for clarifying question for analysts really quickly. You had mentioned that you didn't have time to really take a look and dig in at this amendment.'",
        "'speaker_4': 'When was the first time I contacted you about this amendment?'",
        "'speaker_3': 'You followed up after alluding and I apologize. I've been out on PTO.'",
        "'speaker_0': 'So.'",
        "'speaker_4': 'Totally fair. I just wanted to make it very clear that two and a half weeks ago, two weeks ago, I reached out about this amendment. So there was plenty of time.'",
        "'speaker_6': 'Now, we.'",
        "'speaker_3': 'Looked at how we could have drafted it, but we weren't sure if you were planning to move forward. That is on my bad for not following up and understanding that this was something that you were seriously considering moving forward.'",
        "'speaker_3': 'So my apologies. Okay.'",
        "'speaker_5': 'Interesting.'",
        "'speaker_4': 'Great. Thank you. I really appreciate that. And no further questions at this time.'",
        "'speaker_0': 'All right. Thank you. Councilmember Sawyer, council member state.'",
        "'speaker_3': 'Thank you. I support this amendment tonight for many of the reasons my colleagues have shared. I do have some questions for Annalise. Can you tell us how much it costs a developer to build a parking space? Because we don't often talk about that.'",
        "'speaker_3': 'Yeah, certainly. So it very much depends as to whether it's a surface structured or a sub grade surface is anywhere from 8 to 12000. Sub grade goes up to about $40,000 per parking space structured as around 20 to 30.'",
        "'speaker_3': 'Obviously, construction costs have gone up substantially in the past year. So it might even be slightly higher than that.'",
        "'speaker_5': 'So we're talking about a range from 6000 to.'",
        "'speaker_3': 'About 15,000 or 30,000, 40000 to 40000, $6,000. So that's $40,000 we could be capturing per space that we're waiving to figure out what we want to do with it if we have another mode or method of approaching this.'",
        "'speaker_3': 'Right. If we charge developers what it costs, market rate developers, what it costs to wave a parking space. I'm not sure if I entirely follow your logic. My apologies.'",
        "'speaker_5': 'So instead.'",
        "'speaker_3': 'Of a. Broad brush stroke, exempting parking for market rate and affordable housing developers in these TOD areas, BRT areas. What we could be doing is continuing our parking waiver system and actually charging for each space that's waived and capturing those.'",
        "'speaker_0': 'Dollars for.'",
        "'speaker_3': 'Our affordable housing fund. Is that possible? Okay. Thank you for clarifying that. So saying we're going to require you and please correct me if I misunderstand this. So our code will still require you to provide one or 1.25 parking spaces per unit, but will let you provide none or a lower parking ratio if you pay us $40,000'",
        "'speaker_3': '. Is that correct? In terms of the scenario that that you would want to in these particular areas that we're asking them to provide in any way for free? Yeah. So I think it's important to note that while that is the cost to construct parking spaces are often times a revenue source.'",
        "'speaker_3': 'So in addition to the rents that folks are paying, then they're going to pay an additional cost to access those parking spaces. And so to say, to say a developer don't build a parking space and pay us is really does not have the market operates in terms of development.'",
        "'speaker_3': 'What this is really trying to do is eliminate a barrier. If we were to say you have to provide parking or pay us. I would be shocked to see a single developer pay us that fee and not provide the parking spaces because.'",
        "'speaker_3': 'It just doesn't quite work that way. What we see in our peer cities is really them taking a move to action, to getting zoning out of the way as a barrier to providing affordable housing and and ensuring that we're promoting our multimodal transportation system.'",
        "'speaker_3': 'So, you know, it's been, you know, something that I've heard before, but I, I just don't actually think that we would see anyone take advantage of that and pay into the funding. But we've never tried it, correct? No, we have never tried, nor has it any other city, because I think we understand the basic economics of market'",
        "'speaker_3': 'development. And the basic economics suggests that a developer can afford parking spaces, but it's more lucrative to not provide it. Correct. No. Right now, the market demands the vast majority of market rate developers are expected to banks are still expecting market rate developers to provide parking, which is why we see the vast majority of market rate developers'",
        "'speaker_3': 'over parking beyond what the minimum requirement is. What this is really doing is setting up a systems change to allow for areas in our city where we're making significant or have made significant investments to not provide parking in exchange for greater levels of affordability.'",
        "'speaker_3': 'But there's no control at in the area of transit or BRT. There's no control for making sure that we're getting affordable housing. This applies also to market rate developers, and so this applies to projects that have a covenant restriction, ensuring that they are providing a higher level of affordability.'",
        "'speaker_3': 'Anything in our zoning code that is one of these incentives requires an affordable housing plan at time of development plan and then a covenant that is recorded against the property in perpetuity prior to issuance of certificate of occupancy and the building permit.'",
        "'speaker_3': 'So this is not a just I'm a market rate developer and don't feel like providing parking. It is another lever for us to drive the outcomes that we want, which is providing more onsite affordable housing in our transit rich areas and which are making those investments.'",
        "'speaker_3': 'That higher level is not defined. So we it is it's the enhanced onsite. So in the DMZ, there's the base onsite affordable requirements and then there's the enhanced onsite affordable requirements. They must meet the enhanced onsite affordable requirements, which is a higher percentage of total affordable housing units to access those.'",
        "'speaker_3': 'They also have the opportunity for other fee and loos in which none of these parking reductions or incentives are available. So if a market rate project says, I'm only going to pay the fee and layer because I don't want to provide affordable housing, that's going to be a painful fee in lieu.'",
        "'speaker_3': 'And they have no access to these incentives or any of the other ones as a part of this package. But the affordable housing that they create, the value of it doesn't have to match the value that they saved from the parking that they don't have to construct.'",
        "'speaker_3': 'We don't have a formula. We're not checking that we don't even have a range pin down of what it costs per parking space that we're holding them accountable for. We have done analysis and that's included as a supplement to the financial feasibility to look at what is the added value of the incentives.'",
        "'speaker_3': 'So there is a notable value that we have calculated. I apologize. I don't know what off the top of my head because there's a lot of different pieces that we looked at. But essentially it shows that it is a significant value.'",
        "'speaker_3': 'But we also have to reality check it with what the market is expecting, where our lenders are at. We even see sometimes traffic being a little bit hesitant in some areas to go with lower parking ratios. So we know this is an evolution in our conversations and this is really us trying to lead the way of where'",
        "'speaker_3': 'we want our city to grow and evolve and to start to house people over cars. Well, in the information that you provided us, there was not a sufficient analysis of that. And given that our city has not reached a place where it is feasible to take multiple children across town to different schools in our School of Choice'",
        "'speaker_3': 'system and get to work in a reasonable amount of time, we are setting up a context where we are not building homes for people with children, for people with more than one job, for people who have disabilities or have medical conditions where they have to get to multiple doctor's appointments on public transit or on foot in a'",
        "'speaker_3': 'day. We're not building for the people that we say we're trying to house. We're not there yet. And so it seems as if we would be better off trying a more experimental approach to our parking waivers, expanding on the current parking waiver system that we have in a way that lets us control project by project in a'",
        "'speaker_3': 'more sophisticated way rather than a blanket approach to this. So for those reasons, I do not support the current bill as it stands, and I would support this amendment tonight. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember CdeBaca Councilmember Sandoval.'",
        "'speaker_3': 'Thank you, Madam President. I find it interesting that we're having a conversation about not supporting building more housing. We just had a whole entire conversation from people, from public comment who were telling us to build more housing. And so to build two parking spaces is about 600 and give or take 650 700 square feet, two parking spaces'",
        "'speaker_3': 'for your car. You can also have a condo for 700 square feet. That can house people with two bedrooms, a bathroom and a closet, actually, a really nice condo. So I prefer to spend money and I would prefer to give incentives to developers, to not house cars and to house people.'",
        "'speaker_3': 'And that's what this amendment is doing. Just along certain areas where the city and county of Denver is also putting money and dollars to get better transit along our city. I agree with everybody. Our transit is underpass. It is not very accessible.'",
        "'speaker_3': 'It's not very easy to take. It needs major overhaul and major updating. But we have to live in the reality where we are now. And I would rather have housed two people in a 700 square foot condo than two cars with 700 square feet.'",
        "'speaker_3': 'So I would hope that my colleagues do not support this amendment and have the bill moving forward as soon as it is presented. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. Madam Secretary, roll call on the amendment, please.'",
        "'speaker_3': 'Sawyer I.'",
        "'speaker_5': 'Torres They.'",
        "'speaker_3': 'Black CdeBaca, I. Clark.'",
        "'speaker_1': 'No. Flynn No.'",
        "'speaker_5': 'Hines?'",
        "'speaker_2': 'No.'",
        "'speaker_5': 'Cashman?'",
        "'speaker_1': 'No.'",
        "'speaker_5': 'Kenny Ortega. Sandoval No. Madam President?'",
        "'speaker_0': 'No, Madam Secretary. Close the voting and announce the results.'",
        "'speaker_5': 'Nine days, 3 hours.'",
        "'speaker_0': 'Three eyes the amendment to 20 2-424 has failed Council Bill 20 2-424 is on the floor for publication. Comments by members of Council on Council Bill 20 to dash 042 for Council member say to market.'",
        "'speaker_6': 'Just reminding you I explained my call.'",
        "'speaker_3': 'Outs tonight were for comments to let council members know that there are amendments to review in your inbox tonight so that everyone is not feeling like anything was sprung on them. They are the amendments that I mentioned at committee.'",
        "'speaker_3': 'So just getting it on record. They are coming to you and I hope you all will support them.'",
        "'speaker_0': 'Thank you. Councilmember CdeBaca. Councilmember Sawyer.'",
        "'speaker_4': 'Thanks, Madam President. Just wanted to say that I will be supporting this this evening. Obviously, I'm disappointed that the small change to the Luti amendment was not passed, but this is an incredibly important piece of legislation and no legislation is perfect.'",
        "'speaker_4': 'So I will still be supporting it tonight because it is too important for a small issue like that. So I just wanted to clarify that I will be voting yes tonight and next week, but I'm disappointed that the the point one parking amendment did not pass.'",
        "'speaker_4': 'However, this is the legislative process and this is what we do. Thanks.'",
        "'speaker_0': 'Thank you. Councilmember Sawyer. Madam Secretary, roll call on Council Bill 22, dash four. Two, four, please.'",
        "'speaker_5': 'Sawyer I. Torres, I. Black eye. CdeBaca, I.'",
        "'speaker_1': 'Clark Eye for an eye. Hines, I. Cashman I.'",
        "'speaker_5': 'Can eat. Ortega. Sandoval, i. Madam President, I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_5': '12 Eyes.'"
    ],
    "Ordinance to Prohibit Firearms in City Parks and Buildings.": [
        "'speaker_0': '12 Eyes Council Bill 20 2-424 has been adopted. Madam Secretary, would you please put the next item up on our screen? Councilmember CdeBaca, would you please go ahead with your comments on 20 2-401, please.'",
        "'speaker_3': 'Again, just a notice on record that you all have an amendment in your inbox to remove the parks, public parks from Bill 22, Dash 0401. This would be more aligned with how other people have implemented bans in city owned spaces.'",
        "'speaker_3': 'They often identify public facilities, physical buildings, and not necessarily the outdoors. And so this will be on your desk as well for next week.'",
        "'speaker_0': 'Thank you, Councilmember CdeBaca. Councilmember Flynn.'",
        "'speaker_1': 'Thank you, Madam President. I also look forward to next week. I'll vote yes to advance this to publication, but I remain very skeptical that this bill actually does anything. We've not yet been presented any evidence that it will result in any positive outcome, that there's a problem that needs to be solved by this.'",
        "'speaker_1': 'And I share Councilwoman Celia Barker's concerns that she's expressed in committee over where this where this bill's weaknesses are and where its unintended consequences might be. So I do look forward to receiving any any data that shows this would actually address a problem, rather than simply be a performative piece of legislation that sends messages, but that results'"
    ],
    "Zoning Change for Three Properties in North Park Hill.": [
        "'speaker_8': 'Hey Denver residents in 2022.'",
        "'speaker_0': 'Hearings tonight for those participating in person when called upon please come to the podium on the presentation monitor. On the wall you will see your time counting down for those participating virtually when called upon. Please wait until our meeting.'",
        "'speaker_0': 'Host Promote you to speaker when you are promoted your screen will ask permission to allow us to promote you. Please accept the promotion. Once you accept promotion, your screen will flash and say Reconnecting to meeting. Please don't leave the meeting.'",
        "'speaker_0': 'You will be reconnected and will need to turn on your camera. If you have one and your microphone, you will see your time counting down at the bottom of the screen. Once you have finished speaking, you will change back to participant mode and see your screen flash one more time.'",
        "'speaker_0': 'All speakers should begin their remarks by telling the council their names and cities of residence and if they feel comfortable doing so. Their Home Address. If you have signed up to answer questions, only state your name and note that you are available for questions of council.'",
        "'speaker_0': 'Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted. We will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating the virtual participants.'",
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Council member can reach where you please put Council Bill 20 2-307 on the floor for final passage.'",
        "'speaker_4': 'I move that council bill 20 2-0307 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 2-307 is open. May we please have the staff report?'",
        "'speaker_2': 'Good evening. Council members and members of the public. My name is. It's an evaluation. I'm with CPD before you. Today we have three specific properties, one located on in Door Street and the other one in Gallia Street and then Glencoe Street.'",
        "'speaker_2': 'All three of them are single unit zone districts and they're applying for a single unit zoned district that allows for an accessory dwelling unit. Two of the properties are in the urban edge neighborhood context and one of them is in the urban neighborhood context.'",
        "'speaker_2': 'All three properties are located in Council District eight in the North Park Hill neighborhood. Um, as you can see, the three specific properties are single unit dwellings. The properties on Endura and Glencoe are 6000, just above 6000 square feet, and the Dahlia property is just over 8000.'",
        "'speaker_2': 'Close to 9000 square feet. Like I mentioned, each of these properties are single unit zoned districts that are applying for an accessory dwelling unit, which allows for a maximum height of 24 feet. And the minimum lot size for the urban neighborhood context is 5500 square feet, and the minimum lot size for the urban edge context is 6000'",
        "'speaker_2': 'square feet, which. Um, now the zoning, like I mentioned, are two specific zoning districts. The first one, Dahlia, is located in the US, you see, which is a urban single unit city with a 5500 square foot minimum. And the other two properties, Endura and Glencoe, are in the east, which is the urban edge single unit D, which'",
        "'speaker_2': 'is a 6000, and the X would allow for urban and suburban forms. As you can see here, the indoor property is a single unit, land use. It is a one story structure. You can see it on the top left corner and then some of the single families across the street from it.'",
        "'speaker_2': 'The same thing with daylight. You can see here, it's a single unit, residential land use and the value property you can see on the top left is a one story structure and you can see similarly one story structures across the street as well.'",
        "'speaker_2': 'Then here is the Glen Cove property, which is like about 1.5 storeys in height. And you do have a mixture more here about between one and two stories. As you can see, some of the single families across the street is one and two stories.'",
        "'speaker_2': 'And so this went before planning board on March 16th. It was approved unanimously and it is before you. Today we have three comments, three letters of support, two letters of support, and then one letter of opposition. That letter of opposition pointed specifically on the quality of life.'",
        "'speaker_2': 'They had some concerns around traffic and parking. All three letters are attached to the staff report. And then there are five review criteria that we analyze that we get from the Denver zoning code, and I will jump through some of these.'",
        "'speaker_2': 'The first one is consistency with adopted plans. There are three plans that fall under this area which are comprehensive plan 2040, Blueprint, Denver, L.A. and Transportation Plan 2019 and the Park Hill Neighborhood Plan of 2000. There are several strategies specified in the staff report which these zone districts are consistent with, but I would just highlight a few'",
        "'speaker_2': 'of these under the equitable and affordable inclusive go to strategy a create a greater mix of housing options in every neighborhood for all individuals and families within the strong Atlantic neighborhood. Go one Strategy B Ensure neighborhoods offer a mix of housing types and services for all diverse populations, and then the environment for resilient goal h strategy a'",
        "'speaker_2': 'promote infill development where infrastructure and services already in place. When we're looking at a blueprint. DENVER The future neighborhood context for the Dahlia property is urban, which is more of a small multi-unit, residential and low intensity mixed use buildings, which are typically embedded in single unit and two unit residential areas.'",
        "'speaker_2': 'And then the properties for Endura and Glencoe are urban edge future neighborhood contexts, which are predominantly residential, and it tends to act as a transition between the urban and suburban areas. For the future place type it's all three properties are classified as residential low where it's predominately one two unit uses and accessory dwelling units are appropriate and'",
        "'speaker_2': 'as well as all three streets are classified as local or on designated streets, which are categorized predominantly by residential uses. And all three properties fall under all area, all other areas of the city for their future growth area, which we anticipate to see 10% of new employment and 20% of new housing, new housing in these areas.'",
        "'speaker_2': 'As well as blueprint has a policy regarding accessory dwelling is found in the in the land use and built form housing policy number four which talks about diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_2': 'Now when we jump into the Park Hill Neighborhood Plan, their specific sections, they talk about maintaining the existing character and the residential character, Park Hill, as well as compatible mix of housing types and densities, as well as action number three, which talks about create and maintain a mix of housing types that are all that are attractive and'",
        "'speaker_2': 'affordable. Now the staff report, it specifies how criteria two, three and five are consistent. And now for the fourth criteria justifying circumstances, a city adapted plan is highlighted based on what we discussed earlier in Blueprint Denver that talks about allowing accessory dwelling units in all residential areas.'",
        "'speaker_2': 'Therefore, CPD recommends approval, basing that based that all the findings of the review criteria have met. Staff is available for questions and the applicant is here as well, available for any questions you might have. Thank you.'",
        "'speaker_0': 'All right. Thank you for the staff report this evening. We have three individuals signed up to speak. Our first speaker. Are all three are on line test already. Okay. I'm going to talk to our producers. We don't have tests.'",
        "'speaker_0': 'Dougherty joining us tonight, so we'll go ahead and move on. David Hagan. David Hagan. Not seeing him there either. We're going to go ahead and move on. Our next speaker is Jesse Paris.'",
        "'speaker_7': 'Yes. Members of council can be heard.'",
        "'speaker_0': 'Yes, go ahead, please.'",
        "'speaker_7': 'Yes. I just want to start first off by saying Sam on you, Denver City Council, Oakland and Chambers, all those people. It's been a decade of this urban campus banner needs to be repealed. Somebody needs to take in this before the next election and repeal this urban camping ban in regards to the rezoning as set out to'",
        "'speaker_7': 'council the back office down there with the people in regards to this rezoning. Excuse me. My name is just with Tom Perez and I'm represented for Blackstar at the Movement for Self Defense, Positive Message Move Sultan's speech as well as the guilty party of Colorado.'",
        "'speaker_7': 'The East Denver Residence Council Front Frontline Black knows and I'll be the next mayor of Denver in 2023 and I reside in District eight and Councilman Hardy's this district. I'm in favor of this rezoning tonight. I supported 80 youth when I ran for City Council At-Large in 2019.'",
        "'speaker_7': 'I continue to support its. We're the city, just like we need to state our faces and other forms of attainable housing all over the city. We have a housing crisis, and if you didn't recognize that someday you will never recognize it.'",
        "'speaker_7': 'This has been a decade of doom and we can do better. It looks like it's going to take a whole new administration in order for us to do better. So I'm in favor of rezoning me of the criteria, which is consistency with adopted plans, a uniformity of district regulations as far as public health, safety and wellness and'",
        "'speaker_7': 'means justifying circumstances to say one neighborhood context zone, district purpose and intense song about zoning fight will once again slam on council members like days to let the people speak. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening for this hearing. Questions from members of Council on Council Bill 22, Dash 307.'",
        "'speaker_1': 'Councilmember Flynn Thank you, Madam President. Edson Could you address something I'm trying to figure out in the application or in the planning board comments, it includes a comment from someone who lives a couple of blocks away who said, What is it?'",
        "'speaker_1': 'Park Hill is not designed to have commercial businesses in the middle of a residential neighborhood. I would note that that, of course, there are commercial local commercial business strips in Park Hill. But I'm curious. Was there something about this application that prompted that remark?'",
        "'speaker_1': 'Is there any thing in the application that I didn't see that I missed that opens up commercial business with these ideas? Maybe they're going to use it for short term rental or. Was anything stated along that line.'",
        "'speaker_2': 'That wasn't specifically stated by the applicant?'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'And I believe the individual got confused and maybe it was a short term rental. I did reach out to the individual, but they never responded. Okay. Um, so I was just trying to understand more if it was more of a short term rental concern when they were describing that.'",
        "'speaker_1': 'Thank you. I think then I, I share your your mystification at that remark and why it was made. Thank you. That's all, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. The public hearing is closed. Comments by members of Council on Council Bill 22, Dash 307. And I'm not seeing any. And so I'll go ahead and weigh in. The this rezoning meets all of the appropriate criteria, and I'm happy to support it this evening.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 22, Dash 307, please.'",
        "'speaker_5': 'Black. I see. Tobacco, I. Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Flint.'",
        "'speaker_1': 'All right.'",
        "'speaker_5': 'Hinds. Cashman. Kenny Ortega.'",
        "'speaker_0': 'I swear.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Torres. I. Madam President, I.'"
    ],
    "Zoning Classification Change for Multiple Properties in Council District 3.": [
        "'speaker_0': 'Madam Secretary, close the voting and announce the results. 1111 I's Council Bill 20 2-307 has passed. Thank you, Edson, for the staff report. Councilmember Kasich, would you please put Council Bill 22, dash three, four, three on the floor for final passage.'",
        "'speaker_4': 'I move that council bill 20 2-0343 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 2-343 is open now we have the staff report, please.'",
        "'speaker_3': 'Yes, thank you. My name is Libby Adams. I'm with Community Planning and Development, and I'll be presenting the MAP Amendment to allow accessory dwelling units in Villa Park, Barnum and Barnum West. This application is sponsored by Councilmember Torres and the Map Amendment rezoning all single unit residential properties that currently do not allow for use in Villa Park'",
        "'speaker_3': ', Barnum and Barnum West to allow for aid to use as it had previously. The application is located in District three, and so the request includes nearly 3000 properties or 439 acres bounded by Sheridan Boulevard, Federal Boulevard and then Alameda to the south and 10th Avenue to the north.'",
        "'speaker_3': 'And the proposed zoned districts are the same as the current zone districts, except that they allow the accessory dwelling unit use either within the primary structure or in a detached structure. The proposed rezoning area is currently zoned urban edge single unit D and urban edge single unit decks.'",
        "'speaker_3': 'Both districts are single unit residential districts, allowing the Urban House primary building form with a maximum height of 30 to 35 feet. Additionally, the Eastside District allows a suburban house building form. There's one historic structure in this area located at 666 King Street, so any development proposed on this site would be subject to landmark review.'",
        "'speaker_3': 'The area is mostly single unit residential land uses with some public quasi public uses scattered throughout and a small handful of two in multi-unit uses. And the proposed rezoning is adjacent to a single unit two unit multi-unit commercial office mixed use public, quasi public and park and open space.'",
        "'speaker_3': 'Here's some images from within the proposed rezoning with Philip Park on the top, then Barnum and Barnum West. And then here are some images from the surrounding area. And then for public outreach. The District three Council office began outreach in the summer of 2021 and included postcards, fliers, yard signs, meeting with registered neighborhood organizations, a dedicated phone'",
        "'speaker_3': 'line, virtual office hours, virtual town halls, and in-person town hall, which is pictured here, and then a survey with 140 respondents. And these were both in English. We had bilingual, bilingual meetings as well. And so for the process, the informational notice was sent in the beginning of December and this went to planning board on March 16th where'",
        "'speaker_3': 'they unanimously recommended approval. And then for public comment, Councilwoman Torres included letters of support from the Community Coalition for Barnham and Villa Park Neighborhood Association with the application. And then during the process, staff received four letters of opposition, mostly citing concerns with increase in traffic, crime and trash.'",
        "'speaker_3': 'And then staff also received 33 letters in support, citing a desire to add an extra unit, particularly for family members, and to add density to the neighborhood. Additionally, the council office received mostly support for the rezoning from the survey they created.'",
        "'speaker_3': 'Because this rezoning is legislative, it is only subject to the three review criteria shown here. The first review criterion is consistency with adopted plans, and there are five plans that are applicable to this rezoning. The proposed MAP amendment is consistent with several strategies from Comprehensive Plan 2040, which are outlined in the staff report.'",
        "'speaker_3': 'So moving to Blueprint Denver, the future of the future neighborhood context is urban edge. And so the proposed zone districts are consistent with this plan direction of predominantly residential areas with single and two unit uses. And then most of the proposed area for the future place type is low residential and these are mostly single and two unit'",
        "'speaker_3': 'areas where 80 ewes are appropriate. The northern portion located in Villa Park is in the low, medium residential future place type, which is a mix of low to mid scale multi-unit residential options which allow for single unit with 80 ewes.'",
        "'speaker_3': 'And then there are small portions along corridors that are designated as local and community corridors which I permit primarily for shopping, dining and commercial uses and may also include residential uses. So overall, the proposed districts will expand the allowed residential uses consistent with all three of these future place types.'",
        "'speaker_3': 'And most of the future street types are local streets and residential collectors, which are mostly characterized by residential uses consistent with the proposed rezoning. And then under the Blueprint Growth Area Strategy, a majority of the area is within are expected to see 10% job growth and 20% housing growth by 2040.'",
        "'speaker_3': 'And then the areas along shared in Alameda are designated as community centers and corridors and are anticipated to see 20% of new jobs and 25% of new housing by 2040. So the additional 80 use permitted by this proposed rezoning are consistent with the strategy.'",
        "'speaker_3': 'And then blueprint also includes other specific policy recommendations. So policy for of the land use and built form housing section says they've tested diversify housing choice and through all of our residential areas in the city and then policy 11 of the land use and built form general section provides guidance to implement plan recommendations through larger scale legislative'",
        "'speaker_3': 'rezoning such as this one and then policy five of the land use and built for general section focuses on the importance of mitigating and voluntary displacement, which I'll discuss in the coming slides. So all large map amendments should be guided by the equity concepts detailed in Blueprint Denver.'",
        "'speaker_3': 'The Access to Opportunity Score is a composite of the neighborhood equity indexed event developed by Denver's Department of Public Health and Environment. Proximity to high capacity in frequent transit and access to centers and corridors. These neighborhoods have moderate scores in this category, with lower access to health care, grocery stores and transit, and high access to parks in'",
        "'speaker_3': 'centers and corridors. So the proposed rezoning to allow it to use throughout these three neighborhoods will bring more residents to an area that has access to job services and parks. And then the vulnerability to involuntary displacement score is calculated by the Department of Housing Stability and based on median household income, percentage of renter occupied units and percentage'",
        "'speaker_3': 'of residents with less than a college degree. And this area scores as more vulnerable, based on two of the metrics median household income and educational attainment. So the proposed MAP amendment will provide opportunities for existing homeowner homeowners to supplement their income, while also increasing housing options in the neighborhood, allowing people with a greater range of incomes to'",
        "'speaker_3': 'live in the area. And then this equity concept also includes supplemental data that highlights demographic and market changes in the area to give us a better understanding of the areas of vulnerability to involuntary displacement. So all three neighborhoods have a lower percentage of non-Hispanic whites than Denver as a whole, which could make it more vulnerable to displacement'",
        "'speaker_3': '. And two of the neighborhoods have seen an increase in the non-Hispanic white population. And while Barnard West has seen a decrease. And then Villa Park Barnum and Barnum was all have lower median household incomes than than the Denver average.'",
        "'speaker_3': 'And Villa Park has seen incomes increase significantly, which may indicate that some displacement may already be occurring. And then the three neighborhoods have similar percentages and residents who are over the age of 65. But in recent years they have seen an increase greater than the citywide percentage.'",
        "'speaker_3': 'And then the neighborhoods within the proposed rezoning have all seen a greater increase in median residential property taxes than the citywide average, which again may make these areas more vulnerable to involuntary displacement. And then moving to the housing diversity score.'",
        "'speaker_3': 'And the housing diversity includes five measures percentage of middle density housing, home size, diversity, ownership versus rental housing costs, and the number of income restricted units. And then the neighborhoods have below average diversity in terms of missing middle housing, housing costs and affordable units.'",
        "'speaker_3': 'And this map amendment to allow it to use will introduce a new housing type that is typically smaller and at a lower price point than what exists today. Additionally, is constructed through the West Denver Renaissance Collaborative, an organization that helps finance AIDS are required to be income restricted and which could lead to more affordable units in the'",
        "'speaker_3': 'area. And then lastly, this map shows the mix of jobs in areas of the city with the dominant industry depicted by color. So you can see this area shows a greater percentage of retail jobs in the city as a whole.'",
        "'speaker_3': 'However, there's not enough data in to classify the mix of jobs in the majority of the area, which is why it's not depicted by color in this map. And then it will have a negligible impact on jobs and that it doesn't allow for any commercial uses.'",
        "'speaker_3': 'And there are efforts underway in the West and other neighborhoods to help reduce barriers to ADA use, including the West, Denver Renaissance Collaboratives West Denver Single Family Plus Accessory Dwelling Unit Pilot Program. And this program allows moderate and low income homeowners design, finance and build an ADU in nine West Denver neighborhoods, including Villa Park, Barnum and Barnum'",
        "'speaker_3': 'West. There are also resources to help with the permitting process that CPD has developed in the ADA use and Denver project is currently underway to make it easier to construct drives and make sure they fit within the different types of neighborhood contexts.'",
        "'speaker_3': 'So then host five year strategic plan was adopted this past fall and contains recommendations that are directly relevant to this MAP amendment. The plan recommends supporting efforts to advance affordable housing strategies and blueprint Denver, such as expanding its use.'",
        "'speaker_3': 'And then the Villa Park Neighborhood Plan applies to the properties that are north of Sixth Avenue. And so the land use and zoning recommendation strategy, too, recommends discouraging development that is incompatible with the scale and quality of the neighborhood, and adds are a way to introduce general density that will fit within the existing character of the neighborhood'",
        "'speaker_3': '. And then the Barnum Barnum West Neighborhood Plan applies to the properties that are south of Sixth Avenue. And this rezoning will meet several of the land use and zoning goals, including maintaining the existing low density residential character, upgrading the quality of the present housing stock, and encouraging the construction of new low density housing.'",
        "'speaker_3': 'And this map amendment will result in the uniformity of district regulations within the urban and neighborhood context, in it furthers the public health, safety and welfare by expanding housing, diversity and opportunities to help residents at a range of income levels to continue to live in these neighborhoods.'",
        "'speaker_3': 'So finding that all review criteria have the Met staff recommend City Council approve this legislative proposal? And that concludes my presentation.'",
        "'speaker_0': 'Thank you, Libby, for the staff report. This evening, we have seven individuals signed up to speak. Our first speaker all are joining us virtually via Zoom. Our first speaker is Mara Owen.'",
        "'speaker_3': 'Can you hear me?'",
        "'speaker_0': 'Yes, go ahead, please.'",
        "'speaker_6': 'You mean devastate council? My name is Mark Owen and my address is 1035 Osage and the program manager for the West Immigrant Science Collaborative EDU Pilot Program, which is a program of the work with Habitat for Humanity and the city of Denver to help qualified homeowners design, finance and build affordable EDU on their residential property.'",
        "'speaker_6': 'So the EU pilot program began 2019. We have had 157 inquiries from West Denver homeowners. Without zoning, these homeowners reached out to our program. Interested in learning about building an affordable adu only to find out that their zoning does not currently allow it.'",
        "'speaker_6': 'Even if their neighborhood neighbor across the street or a friend in a nearby neighborhood can. Of those who did have zoning, the overwhelming majority of homeowners who have inquired to build an idea are hoping to house family, whether that's housing a grown child who is struggling to live in the neighborhood where they grew up.'",
        "'speaker_6': 'A parent in retirement, wanting to age in place near family, or a family member with a disability who needs a long term affordable housing option near their support network. In addition to housing families, aides are also a tool homeowners can use to create long term stability and prevent displacement.'",
        "'speaker_6': 'You can write a homeowner with additional income and flexibility to be resilient in the face of economic instability, such as job loss or sudden medical needs. There are now 42 individual homeowners in Villa Park, Farnham and Barnham West who applied to our program and are unable to participate currently because their zoning does not allow it.'",
        "'speaker_6': 'Supporting this rezoning would give those homeowners and many others in those neighborhoods access to the same tool and the option that many of their neighborhoods already have. Building an 80 year old house family create long term stability and economic resiliency to stay in place.'",
        "'speaker_6': 'Thank you very much for the opportunity to speak.'",
        "'speaker_0': 'Thank you. Our next speaker is Jessica Calderon.'",
        "'speaker_6': 'Hello? Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'Hi. My name is Jessica Calderon and my address is 613 Equipment Street. I am a resident of Villa Park. My history in the neighborhood is that. When I was two years old, my parents moved here from Texas so that we could have additional opportunities.'",
        "'speaker_5': 'We were from a very small town. Moved to Denver where I had an uncle Emmanuel, who lived on 10th and equipment. And so I spent my first couple of years of my time in Colorado as a two year old in West Denver.'",
        "'speaker_5': 'I went on to live in other areas of the metro.'",
        "'speaker_3': 'Before finding my way back.'",
        "'speaker_5': 'To West Denver with my husband, where we bought the home we currently live in.'",
        "'speaker_3': 'We spent a lot of time raising our.'",
        "'speaker_4': 'Three.'",
        "'speaker_5': 'Boys there and one one of which has recently passed. And so that is our family home. It is our foundation and and where we are strong together.'",
        "'speaker_3': 'Currently, I have a 25 year old son.'",
        "'speaker_5': 'Who has a child type of grandson.'",
        "'speaker_3': 'He could not buy a house in our neighborhood.'",
        "'speaker_5': 'If he wanted to because he's priced out.'",
        "'speaker_3': 'I have a 19 year old son who is a sophomore at Sea Boulder, and unfortunately, in two years when.'",
        "'speaker_5': 'He graduates, even if he gets a decent paying job, he likely could not buy a home in our neighborhood because he's priced out. I have.'",
        "'speaker_3': 'Aging parents who maybe someday would need to live.'",
        "'speaker_5': 'Near me. And so for those reasons, I would like the zoning change so that we can take this opportunity to build an EDU on our property, so that if our family needs support.'",
        "'speaker_3': 'And they want to be near us and they want to be in the neighborhood where we feel closest as a family, they would have the opportunity to do that. I also.'",
        "'speaker_5': 'If there were.'",
        "'speaker_3': 'Even if it weren't family or it's not needed by.'",
        "'speaker_5': 'Family right now, we could offer it to other people who want to stay in West Denver in a place that they can afford. If they don't want to leave the neighborhood.'",
        "'speaker_3': 'So for that reason, I am asking all of you.'",
        "'speaker_5': 'To consider passing the.'",
        "'speaker_3': 'Zoning for these adus.'",
        "'speaker_0': 'Thank you. Thank you. Our next speaker is Rene Martinez Stone. Go ahead, Renee. You'll just have to unmute. Can you hear me? Yes.'",
        "'speaker_6': 'Okay. Great. Good evening. My name is Rene Martinez Stone. And my camera is not quite. Okay.'",
        "'speaker_0': 'Might want to. Tilted a little bit more. Renee.'",
        "'speaker_6': 'Yeah. My shirt is clean. Yeah. They got anything? Thank you for having public comment tonight. I'm a resident of Denver, and I'm the director of the West Denver Renaissance Collaborative. It is, or one of the new tools that can help current affordable housing needs in Denver.'",
        "'speaker_6': 'As you've heard tonight, there is a solution that do not require an existing home to be demolished. They utilize existing lots, locks, utilities, and they fit in the character of existing neighborhoods. This is welcomed by residents that are seeing a lot of change within their neighborhoods where affordable homes are being replaced by quite expensive homes.'",
        "'speaker_6': 'It is provide a way for residents to personally invest and be a part of the housing solution in the neighborhood. And this is very often cited by homeowners who want to build a use. If approved, this legislation, this legislative rezoning, eliminates the first step in a process that is complicated, costly and takes too much value time for'",
        "'speaker_6': 'homeowners as well as staff. It's the type of regulatory regulatory change that's needed to increase the number of use built in Denver. Overall, there's just not enough. Our pilot program, which Mara introduced to help homeowners navigate the process of building affordable homes.'",
        "'speaker_6': 'We have 12 debuts in development, and our participants have been in the neighborhood on average 18 years, some over 20, some over 40 years. All of the units are ground level and many have 2 to 3 bedrooms. So their housing family is a family unit.'",
        "'speaker_6': '83% of the participants identify as persons of color, and most have immediate need to house family. They aim to create multigenerational stability and secure a family asset. Just as Jessica described, is the desire to house family, students and school participants, the need accessible unit.'",
        "'speaker_6': 'And many residents have moved and are now doubled up living in another household because they can't afford. They are essentially homeless, temporarily housed by a friend or neighbor. I want to thank Councilwoman Scores for her leadership and responsive to the community.'",
        "'speaker_6': 'I want to thank many residents who did not understand their views but welcomed a solution for their neighborhood. And I respectfully ask the council advance this and future policy to help homeowners and renters access the relatively untapped.'",
        "'speaker_0': 'Time we have allotted fight. Speaker Thank you so much. We're going to go ahead and move on to our next speaker. Janice Morris. All right. We're going to go ahead. And I believe Janice is on the phone. And Janice, we'll have to have you go ahead and unmute yourself.'",
        "'speaker_0': 'It's Star six.'",
        "'speaker_6': 'I did.'",
        "'speaker_0': 'Oh, wonderful. Go ahead, please.'",
        "'speaker_6': 'Good evening, counsel. My name is Janice Morrell. I've lived in the Barnham neighborhood at two, two, two Lowell Boulevard for about 36 years. I bought this house from my aunt and uncle. I would like to be able to pass this house on to and create generational wealth for my kids.'",
        "'speaker_6': 'But at the same time, be able to if I'm able to build an Adu on my property, not only could I rent it now to my son or even to provide separate space for my daughter to visit. Or allow my in-laws a safe place to live.'",
        "'speaker_6': 'That would be awesome. This is one tiny step that we're asking you to pass to clear the way so that more of us can utilize our properties. In a better way. Providing for our families, providing for our kids.'",
        "'speaker_6': 'Maybe even renting to people that are new to us. Our neighborhood, I feel, is inclusive and welcoming. But I think that we also need in Barnum the ability to stay or age in place at the same time keeping the wealth of our homes.'",
        "'speaker_6': 'We're lucky enough to have bought in this neighborhood and we want to stay. So we're asking you to consider clearing the path, clear the road, so that we can stay in our homes and provide additional income for ourselves and or help support our family.'",
        "'speaker_6': 'Thank you for listening.'",
        "'speaker_0': 'Thank you. Our next speaker is Valerie Kotch. Do we have Valerie with us? Valerie, I believe we're trying to bring you in to the panelists so you'll have to accept the promotion. I'm still seeing you and the attendees.'",
        "'speaker_0': 'We'll try to get Valerie into the queue. In the meantime, we're going to go ahead and move on to Adam Calderon.'",
        "'speaker_2': 'And Evening City Council. My name is Adam Calderon. I grew up in Villa Park. I attended Cal Elementary Lake Middle School and graduated from Denver West High School. I'm also a proud graduate and alumni of the University of Colorado, Boulder.'",
        "'speaker_2': 'My home address is 613 Quitman. I would like to see aid use allowed in our neighborhood. I have a I have a mother who is a 38 year employee of the city and county of Denver who lives off of 11 miles.'",
        "'speaker_2': 'And she's aging gracefully, thank God. But one day it's my hope that we could build an 82 onto our property so that she could come and live with us. It strikes me because a couple of weeks back, my neighbor across the street, Judith, was taken away to a nursing home.'",
        "'speaker_2': 'She was he she's about nine years old. She specifically wanted to stay in her home, but her family lives too far away.'",
        "'speaker_1': 'I don't want that for far from me.'",
        "'speaker_2': 'I want to be able to provide the opportunity for my mom to stand with her family as she is. She gets older and ages gracefully. I hope that you will find it in your hearts to pass this so that we can continue to grow as a family and and keep our people in place.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. We're going to go ahead and try to get you into the queue, Valerie. So we're going to send you the promotion again for it. Our next speaker is Jesse Paris. Do we have Jesse with us? Okay.'",
        "'speaker_0': 'The producers are telling me that we seem to not have Jesse with us, so we're going to move on. Did we get Valerie? Into the queue. Okay. We don't have either of them. And so that concludes our speakers questions from members of Council on Council Bill 22, Dash three, four, three.'",
        "'speaker_0': 'Councilmember Ortega. Thank you, Madam President. I wanted to ask if we could maybe have Renee Martinez Stone back in for just a minute. Yes. We'll go ahead and get her back into the panelists. Rene Martinez Stone. Okay. We've got her great back in the panelists.'",
        "'speaker_0': 'Go ahead. Humor. Renee, I wanted to ask you about. Whether or not we are seeing. An issue of some of the homes not having enough equity that affords the ability for borrowing against their property to be able to build the affordable adu on the property.'",
        "'speaker_0': 'And if if that is the case. Have there been discussions with the city about looking at funding to assist? This area of town in this particular these particular boundaries to assist the families in being able to build in aid to you.'",
        "'speaker_0': 'A lot of the applications we have seen come forward are our folks that may be in different economic. Categories, if you will. And I want to make sure that we create the same opportunity for people that may live in neighborhoods where the housing prices may be lower.'",
        "'speaker_0': 'And the either the value or the amount of equity that's in the home that could, you know, otherwise be used to help borrow the money to build and add to you. So if you can just kind of help address what efforts are in place or under discussion to try to ensure we're creating that same opportunity for folks'",
        "'speaker_0': 'in these neighborhoods.'",
        "'speaker_6': 'Okay. Thank you, Councilman Ortega. Briefly, I will respond to participants within our program that we're piloting with the Department of Housing. Stability provides an affordable adu subsidy on any am I. And it reduces the cost of any of you by $30,000.'",
        "'speaker_6': 'So that goes with a 25 year restriction on who's ending you and how much the rent can be. That's quite means that an incentive for participants within our program. To your second question, the majority of the participants in our program do utilize equity in their homes because we when someone applied to the program, they get a bonus'",
        "'speaker_6': 'or they've been in the neighborhood a lot of time and so many of them have many years of home equity built up and they're utilizing that. We have seen a few homeowners who refinanced and did not retain those funds to build the yield, and they have a little bit more difficult time financing.'",
        "'speaker_6': 'We do provide housing counseling, which is available to most anyone in West ever that seeks it, even if they're not within our program to look at their options for stabilizing their situation. And so we observed of the 12 way to use that we have developed, there were 50 homeowners that participated in housing counseling.'",
        "'speaker_0': 'Just want to thank you for your efforts in working with the families in West Denver. I actually grew up in Westwood when I moved here from New Mexico and lived there for a number of years through graduating from West High School and Cowboys.'",
        "'speaker_0': 'So we had a speaker who was a West graduate earlier in. And so I think this is important work that you have been doing for these neighborhoods, and that's it for my question. So thank you for answering them.'",
        "'speaker_0': 'Thank you, Madam President. Thank you, Councilman Ortega. And thank you, Renee, for answering those questions. We've got Councilmember Flynn.'",
        "'speaker_5': 'You're up next.'",
        "'speaker_1': 'Thank you, Madam President. Libby, could you tell us, was there discussion during this process about the rule that says properties with an ADU, one of the units must be occupied by the owner of the property. The reason I ask is I noticed that one of the supportive statements from a member of the public stated that that she'",
        "'speaker_1': 'wished that that would be taken away so that both units could be rented at some point down the road. Was was there discussion about that rule during the process?'",
        "'speaker_3': 'No, not to my knowledge. But, you know, I'm sure I can go if I see she's aware that she must live on the property to do NATO. But there wasn't specific lease. I didn't have specific discussion. I don't know if Councilman Torres at any of the virtual town hall.'",
        "'speaker_1': 'Madam President, could if Councilwoman Torres has information on that, could she.'",
        "'speaker_0': 'Got right into the queue. Councilman Flynn. So go ahead, please.'",
        "'speaker_1': 'The reason the reason I asked is I'm I am up in the air over the issue of ADOS and how they. Result in long term affordability. Especially when there's this requirement that the owner must live there. The reason being that assessor, the assessors figures show that in the last two years.'",
        "'speaker_1': '240 242, 240 properties in Denver with 80 use on them were sold on in the open real estate market. The median sales price was $980,000. And it seems to me that once you put an ADU on a property, you have substantially escalated the the market price for that, which pretty much limits the the universe of buyers for'",
        "'speaker_1': 'that. And I'm wondering if that's an aspect that's been examined.'",
        "'speaker_5': 'The. Absolutely. I can talk about the first question because it came up a lot while we were doing community engagement. So a lot of the community. Community meetings. Thank you.'",
        "'speaker_1': 'Okay. I think I can still hear.'",
        "'speaker_5': 'Okay. I think that came up frequently in residents wanting to make sure that that the city was very clear to folks who build to use that they know those rules and further really wanting to make sure that the city's enforcing those.'",
        "'speaker_5': 'So for, for example, a neighborhood association conversations centered a lot around how does the city enforce those rules? I think the biggest concern tends to be too many of them being used for short term rental. I think the neighborhoods are overwhelmingly interested in long term housing for folks and in particular for keeping residents housed who who currently'",
        "'speaker_5': 'own homes. Anti displacements are a key factor for that piece. It has been raised and I don't think we've seen a property turnover yet on that kind of price point for selling any to you. We certainly are seeing properties that are getting flipped that current that have the zoning for you to use that are not building them'",
        "'speaker_5': 'probably to stay within a different kind of price point. But we just haven't seen the turnover yet on how homes that have built them and are now selling them. But it absolutely is still one of those tools for trying to keep residents there who want to stay and giving them either a source of income or a place'",
        "'speaker_5': 'for additional family to go. So it has been that that largely that kind of source of the conversation for why folks have been supporting this, but still very much with an eye toward long term housing stability. Mm hmm.'",
        "'speaker_1': 'Thank you. You know, there's a lot of things to weigh here, obviously, and we don't have a track record long enough to be to be able to draw a strong conclusion if this rule limits the universe of buyers to those who are wealthy.'",
        "'speaker_1': 'Enough to afford almost $1,000,000 investment and then live in that property. Is that better or worse than removing the rule and having both units open as rentals to outside investors out of town? Investors. Out of state investors. So it's it's something I think we need we need a lot more data to learn from.'",
        "'speaker_1': 'Thank you. Thank you, Madam President. Thank you, Councilwoman Torres.'",
        "'speaker_0': 'Thank you, Councilmember Flynn.'",
        "'speaker_3': 'Uh, and we'll.'",
        "'speaker_0': 'Go next to Councilmember said.'",
        "'speaker_3': 'Thank you. I have some of the same tensions around support and opposition to use. I think it's. An incredible opportunity to keep families together, to keep people aging in place. And also, I've seen how it exponentially increases the value of land in a speculators market.'",
        "'speaker_3': 'And so I am to a little bit curious about if there's a plan or potentially putting into place some more parameters around. Making sure that they're being used for affordable housing and not just becoming an income stream for someone's Airbnb who you can't necessarily prove is there 50% of the time or not?'",
        "'speaker_3': 'We've seen that challenge with the Short Term Rentals Advisory Committee and people in our neighborhoods, but I don't know if we have a real plan to go back and figure out how to track this information better. Yeah. Thank you for that question.'",
        "'speaker_3': 'So I will say that because the Western Renaissance Collaborative is in this area, those units do have to be income restricted. And, you know, I don't know the numbers of what's being built under that program versus not. But so that's in place.'",
        "'speaker_3': 'And that will those who are required to be, like I said, deed restricted. And it's possible to tie all of these that are being resigned to a condition that makes them go through a pilot or a similar program like the West Denver Renaissance Collaborative, just to make sure.'",
        "'speaker_3': 'I think the challenges that the West Denver Renaissance Club also has income restrictions and so not everyone will be eligible for that program. And so I think I think that would be a challenge to tie it to that program or something similar, at least at this point.'",
        "'speaker_0': 'When we first heard the stories.'",
        "'speaker_5': 'Yeah. So thanks for the questions. And I'd also invite Rene if she had any comment on on those pieces. That's one of the critical for reasons why IWD RC is so valuable in the space, because they do apply a long term deed on that property.'",
        "'speaker_5': 'And I think that's only triggered because you're accepting funding in order to in order to access that affordability. And and they're deliberately working with families who might otherwise get pushed out because of property taxes or or because family really wants them to move to a larger location.'",
        "'speaker_5': 'So both of those have been the crux behind DRC. I think one of the things that we can do to support is to actually get a DRC type model elsewhere in the city. I think we've proven that it's very effective.'",
        "'speaker_5': 'I think we've proven that not just the navigation through the complicated process, but the access to capital in order to help build has been a difference maker that the families that DRC is working with is exactly who we want to make sure that they're able to stay.'",
        "'speaker_5': 'And and all of that is really working beautifully there. But there is a component that we can't control. We have not, though, seen a flood of 82 permits run for four properties that currently have a to use zoning in West Denver.'",
        "'speaker_5': 'So it's still a bit of a hurdle for any property owner in West Denver to build in to you.'",
        "'speaker_3': 'Yeah, I mean, I guess when we started with DRC, we were curious about how to have a parallel program in on the east side of Denver and would love to if anybody is exploring that, we would love to to do that.'",
        "'speaker_3': 'And I think the land trust is positioned well to do the 99 year leases to ensure that. So I think that would be great because we too, have, you know, contemplated what would it mean for me to pursue a legislative rezoning?'",
        "'speaker_3': 'Is it putting us more in harm's way because we now have, you know, these million dollar properties for speculators, or does it actually help us to do it? So I think it's a great opportunity and potentially can help us meet the need.'",
        "'speaker_3': 'I just really, really hope that we can do some intensive tracking and take on some responsibility as the city, make sure even in our rental registry we have a category to identify these to somehow show us in our portfolio where these exist and what kind of people are applying and what support they need so that we can'",
        "'speaker_3': 'expand the work that we're doing. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember CdeBaca. And I've been asked by the producers to ask folks if they're not speaking into their mikes, to please turn off their mikes, because apparently we need a few adjustments and that might be contributing to the feedback.'",
        "'speaker_0': 'And so thank you. Not seeing any other questions from members of council. The public hearing is closed. Comments by members of Council on Council Bill 20 2-343 Council Pro Tem Torres.'",
        "'speaker_5': 'Thank you, Madam President. Thank you, Libby, for shepherding us through this process. This this has been one that was responsive to community and what a lot of folks really wanted to see take place, especially as we were moving through conversations with the West Area plan, where folks were really identifying the limitations of blueprint and what needed to'",
        "'speaker_5': 'be allowed to get folks through. I think a really complicated and cumbersome process which is rezoning individual properties and just want to think, I think the the real initiator of of this model of thinking, which was Councilwoman Sandoval and really helping us think through what is a neighborhood wide process look like, what kinds of things do we'",
        "'speaker_5': 'need to consider to make sure that we're hearing from folks that we're giving them an opportunity to find out more information and get questions answered? And then, of course, to the residents who came out to support in DRC, always, I think, when establishing the foundation of empowering residents with information both about land acquisition, about development, about zoning'",
        "'speaker_5': 'in general, but then really trying to make it part of our civic vocabulary, what an edu is, what purpose it can serve, and how to really make it accessible to families who were absolutely threatened with displacement and having to find somewhere else to go.'",
        "'speaker_5': 'They have made it as affordable as possible by partnering with Habitat for Humanity, by really being there to walk folks through the entire process. This is one of those efforts that in and of itself does not solve displacement in West Denver, but it absolutely puts a new tool in property owners hands that if they want to stay'",
        "'speaker_5': 'in Barnham, in Villa Park and in Burnham West, they have a new way to make sure that they can do that and then pass on an asset to their children and family members. So I. Very grateful for everyone who supported this.'",
        "'speaker_5': 'We started it nearly a year ago to my team and I really do think all of the folks involved and would appreciate a lot of support from my colleagues. Thank you.'",
        "'speaker_0': 'Thank you, Counsel Pro Tem Torres, and happy to support this this evening. I think at least in my neighborhood and others were following closely the edu conversation. And I want to congratulate you, Counsel Pro-Tem Torres, because when you look at this, it's nearly 3000 parcels, approximately 439 acres.'",
        "'speaker_0': 'And this is creating a path forward. One of the speakers spoke about adult children living with her, and that is a reality in the city and county of Denver today. And so thank you for your leadership on this.'",
        "'speaker_0': 'And I am more than happy to support it. Madam Secretary, roll call on Council Bill 22, dash three, four, three, please.'",
        "'speaker_5': 'Torres, I. Black I. CdeBaca, I.'",
        "'speaker_1': 'Clark All right.'",
        "'speaker_5': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_5': 'Cashman can h. I. Ortega. Sandoval. I swear, I. Madam President, I.'"
    ],
    "Zoning Change for 2264 South Williams Street in University.": [
        "'speaker_0': 'Madam Secretary, closed the voting and announced the results. 11 Eyes. 11 Eyes Council Bill 20 2-343 has passed. Thank you to the members of the community who spoke. And thank you, Libby. We're going to go ahead and move to our final hearing this evening.'",
        "'speaker_0': 'Councilmember Kenny, will you please put council bill 22, dash 353 on the floor for final passage.'",
        "'speaker_4': 'I move that council bill 20 2-0353 to be placed upon final consideration and do passed.'",
        "'speaker_0': 'Thank you. It has been moved to get a second. Okay. We've got. Thank you, sir. We've got council that Councilwoman Canete was made the motion and Councilmember Cashman seconded it. The required public hearing for Council Bill 22, Dash 353 is open.'",
        "'speaker_0': 'May we have the staff report?'",
        "'speaker_3': 'Good evening, Madam President and Council. I'll try to make this quick, because I know we've had a very manic Monday. My name is Valerie O'Hara, senior city planner with CPD, and I will be presenting an ad rezoning for the subject property located at 2264 South William Street.'",
        "'speaker_3': 'The property is located in Council District six with Councilman Cashman. And is located within the university neighborhood. The subject property is currently 6250 square feet with a zone width of 50 feet. The request is for urban single unit C1 to allow for a detached accessory dwelling unit in the rear of the lot.'",
        "'speaker_3': 'The site and the surrounding properties to the Northwest and South are all UCC, allowing the Urban House primary building form with a minimum zone lot of 5500 square feet. To the east, the zoning is classified. You are h38a multi-unit district that allows up to two and a half storey row house building form as well as urban house'",
        "'speaker_3': 'detached accessory, dwelling unit duplex and tandem house building forms. And then campus IU oh three, which is the University of Denver campus is to the east as well. Evans Avenue is just north of the site and with Iliff Avenue is located directly south.'",
        "'speaker_3': 'How would you? The site is single unit residential and surrounded by single two and multi-unit existing residential land uses in the neighborhood. East of the property is mainly public, quasi public again due to the campus and commercial retail is found north of the site along Evans Avenue.'",
        "'speaker_3': 'The subject property is mid-block with alley access is located adjacent to South William Street. There is an existing primary single unit structure and detached accessory structure currently on the lot. The bottom photo shows the single unit residence directly across the street for added context, and the top photo is a photo of the alleyway.'",
        "'speaker_3': 'In terms of process. This MAP amendment went to the planning board on Wednesday, March 16th, where the item was recommended approval on the consent agenda. The rezoning was moved forward to final hearing of city council by Land Use Transportation Infrastructure Committee on Consent on March 29th and is being heard today.'",
        "'speaker_3': 'Staff received input from the University Neighbors Neighborhood Association, R.A., through a position statement that is in opposition to the rezoning. They expressed concerns around approving adus or rezonings prior to completion of the Adus in Denver Text Amendment Project and upcoming change to the Board of Adjustment.'",
        "'speaker_3': 'A resident email was also received after Luti stating support for the proposed rezoning. The Denver zoning code has five review criteria. The first is consensus consistency with adopted plan, starting with comprehensive plan 2040. Staff found this rezoning to be consistent with several strategies shown from the plan 2040.'",
        "'speaker_3': 'The first is equitable, affordable and inclusive. Goal one Strategy Increase development of housing units close to transit and mixed use developments. Equitable, affordable inclusive goals. Strategy Goal two. Strategy eight Create a mix of housing options, a greater mix of housing options in every neighborhood for all individuals and families.'",
        "'speaker_3': 'Oh, I apologize. Environmentally resilient goal eight Strategy to promote infill development where infrastructure and services are already in place and then environmental resilient. Goal eight. Strategy B Encourage mixed use communities where residents can live, work and play in their own neighborhoods.'",
        "'speaker_3': 'Blueprint. Denver identifies this property and this area as urban context. And Residential low, which consists of predominantly single and two unit uses on smaller lots and allows for accessory dwelling units to be thoughtfully and appropriately integrated where compatible.'",
        "'speaker_3': 'South William Street is a designated local street classification. For criteria two and three staff found that this rezoning is consistent with adopted plans. The proposed rezoning will result in uniform application of zoned district building form, use and design regulations, and it will further public health, safety and welfare through implementing adopted plans and facilitating increased housing density.'",
        "'speaker_3': 'Four criteria. Number four, staff found that the proposed rezoning is justified through a city adopted plan. Criteria five And finally, the context zone, district purpose and intent of USC one are all appropriate for this particular location giving, given the surrounding area, the adopted plan guidance and the location of the sites.'",
        "'speaker_3': 'Given the finding that our review criteria have been met. CPD Recommends City Council Approve Application 2020 1i00170. Based on the finding, all review criteria have been met. Just a note that approval of a rezoning is not approval of a proposed specific development project.'",
        "'speaker_3': 'Thank you. And I'll take any questions you might have.'",
        "'speaker_0': 'All right. Thank you, Val, for the presentation. We have one individual signed up to speak this evening. Jesse Paris.'",
        "'speaker_7': 'Yes. Get even with the council. May I be her?'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'Yes. My name is just the last person I'm representing for Blackstar at the moment for self defense, positive, massive, massive social change, as well as the Unity Party of Colorado, the East Denver Residence Council for a long black nose.'",
        "'speaker_7': 'And I'll be the next November 2023. And I resigned in District eight in Christopher Herndon's district. I am in favor of this rezoning tonight, as I stated at the first hearing. I supported Eddie Hughes when I ran for City Council at large in 2019.'",
        "'speaker_7': 'I'll continue to support them in 2023 as I run for mayor of Denver. So, yes, it meets all five of the criteria. I'm supportive of this wholeheartedly. We need to use all over this city. I support any meals and other attainable housing forms of every district in the city.'",
        "'speaker_7': 'So with that being said, meets all five of the criteria. So I'm in full support. Again, Sam, on your council for clearing the chamber earlier, you need to repeal the urban camping ban this decade and don't miss the ends.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of Council on Council. Bill 22. Dash 353. Not seen any. The public hearing is closed. Comments of comments by members of Council on Council Bill 20 2-353. Council Member Cashman.'",
        "'speaker_1': 'Yeah. Thank you, Madam President. I do think this application meets the legal criteria and we'll be supporting it this evening. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Cashman. And I do agree with you that it does meet all of the rezoning criteria and will be supporting it as well. Madam Secretary, roll call on Council Bill 22, dash 353, please.'",
        "'speaker_5': 'Cashman. I can h i Ortega. Sandoval.'",
        "'speaker_0': 'I swear.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Torres, I.'",
        "'speaker_3': 'Black I.'",
        "'speaker_5': 'CdeBaca, I. Clark. All right. Flynn.'",
        "'speaker_1': 'Hi.'",
        "'speaker_5': 'Madam President.'",
        "'speaker_0': 'I, Madam Secretary, close the voting and announce the results.'",
        "'speaker_5': '11 Eyes.'",
        "'speaker_0': '11 Eyes Council Bill 22, Dash 353 has passed. Thank you so much, Val.'"
    ]
}