{
    "Mayoral Reappointment and Appointments to the National Western Center Authority Board.": [
        "'speaker_0': 'The item has been called out under bills for final consideration elsewhere, and each is called accountable. 388 for a comment under pending. No items have been called out. Did I miss anything? All right. Madam Secretary, will you please put the first item on our screens?'",
        "'speaker_0': 'And, Councilmember Torres, will you please put councilor resolution to 79 on the floor.'",
        "'speaker_2': 'And the Council Resolution 2279 we.'",
        "'speaker_1': 'Adopted.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Questions or comments by members of Council. Council Member Sandbach.'",
        "'speaker_2': 'Did you put on 386? Correct.'",
        "'speaker_0': 'This is 279.'",
        "'speaker_2': 'Okay. So this one is an issue. Thank you, Mr. President. This one is an issue for me. I'd like to call the vote on this because a National Western Authority is something that I had been involved in way before even getting elected.'",
        "'speaker_2': 'And there was a huge fight from community to have representation, voting representation on the National Western Authority. In the last few months, we've lost our voting member who is a resident of the neighborhood, and we sent multiple applicants to boards and commissions to fill that seat.'",
        "'speaker_2': 'While I don't have any objection to the individual who was appointed the voting member as a person. I think that we missed the intent of that seat to have resident representation because the individual does not live in our neighborhood.'",
        "'speaker_2': 'The other person being appointed is a non-voting member of our neighborhood, and I think that's incredibly problematic and not true to the intent of this seat. So I will be a no on this, and I encourage my colleagues to honor the neighborhood and the intent of this position as the only neighborhood or only resident representation on this'",
        "'speaker_2': 'board and vote no on this as well, and send boards and commissions back to the drawing board to ensure that we have resident representation as a voting member on this board.'",
        "'speaker_0': 'Thank you, Councilmember. Next up, councilmember talks.'",
        "'speaker_2': 'Just a question. I don't see groping in the room.'",
        "'speaker_1': 'I don't know if you.'",
        "'speaker_2': 'Have any information.'",
        "'speaker_1': 'About this particular bill.'",
        "'speaker_0': 'And if you could go over to the iPad is the presentation.'",
        "'speaker_2': 'Oh, sure. Skye Stewart from the mayor's office. I have not been totally involved in this, but are happy to try and answer questions for you. Here is the.'",
        "'speaker_1': 'It looks like the.'",
        "'speaker_2': 'Residence that was in terms of women concerned about providing them as well to keeping her place for them.'",
        "'speaker_1': 'As well.'",
        "'speaker_2': 'As the resident board.'",
        "'speaker_1': 'Member.'",
        "'speaker_2': 'I believe that is correct, yes. So we're looking at every almost scenario as a community member, board.'",
        "'speaker_1': 'Member, but the non-voting one in.'",
        "'speaker_2': 'So I'm talking off the top of my head here, so I probably will need to get you a more complete answer. But the way the framework agreement set up this or before that, there is a nonresident voting member and then a community member that does not necessarily have to be from the neighborhood but should represent a certain'",
        "'speaker_2': 'perspective and not just the seat that Curtis house is filling. And then the neighborhood seat is a non-voting seat. So there would be no voting member who a resident of the.'",
        "'speaker_1': 'Parliament for the various functions.'",
        "'speaker_2': 'I believe that is correct. But I would really have to check back with our remaining moments in a long time, because I look at that framework agreement.'",
        "'speaker_1': 'And.'",
        "'speaker_2': 'I think concerned about that too. I have no objection to this House actually, which.'",
        "'speaker_1': 'Is a phenomenal individual and a.'",
        "'speaker_2': 'Great board member. But I do concerned that it could getting compared to a.'",
        "'speaker_1': 'Community block.'",
        "'speaker_2': 'When there's no other.'",
        "'speaker_1': 'Residents from the neighborhood also on the board. So I'll be in the room as well. All right.'",
        "'speaker_0': 'Thank you, Councilmember Councilmember Hines. Thank you, Mr. President.'",
        "'speaker_1': 'And Mr. Reid, thank you for your.'",
        "'speaker_0': 'Willingness to field these questions, even though.'",
        "'speaker_1': 'This isn't totally your wheelhouse to see. You know it is. Is this the board or a third of the board members are District ten residents.'",
        "'speaker_2': 'I do not know the answer to that off the top of my head.'",
        "'speaker_1': 'So I am excited. I guess I believe that that's the case. So I'm excited that a district that has an outsized sense of representation for the board and I would share some concerns as well that someone from the neighborhood is it that this opportunity has become part of the has been saying nothing about us without us?'",
        "'speaker_1': 'And I would like to see that at least one member of District five of that specific community is is represented. So thank you, Mr. District Councilmember.'",
        "'speaker_0': 'Councilmember CdeBaca.'",
        "'speaker_2': 'Thank you. Mr. President, I have a proposal. If Sky is able to make the has the authority to accept it. Is it possible to flip these two appointees? Because one is the voting, one is the non-voting, one is a resident, one is a nonresident.'",
        "'speaker_2': 'Is it possible to appoint Mr. House as the non-voting member and the other person as the voting member? So again, the roller coaster ride of memory on the framework agreement, I believe. Well, so let me start first by saying that we would have to take that through a process that needs to happen for more efficient appointments.'",
        "'speaker_2': 'Romanian media involved. And we would need to talk with the mayor. But I believe the answer to that is no, because the non-voting member serves specifically has to be a neighborhood resident. I would again have to go back to the framework agreement and check that.'",
        "'speaker_2': 'But if I remember correctly, that is the case that there has to be a member of that neighborhood in that seat as a non-voting member or in this House would not be able to be put into that seat.'",
        "'speaker_0': 'Anything else?'",
        "'speaker_2': 'Is it possible for you to verify who is being replaced? Because although Jonathan Zobayan is on the board, he is not a resident of the neighborhood. He's a property owner in the neighborhood, but not a resident. And and I would be curious to know if he's cycling off or who is cycling off, because there are three other'",
        "'speaker_2': 'people that we know of who are cycling off. So I don't have that information in front of me. If you want to hold on voting on this one, I can see what I can do to get that if you want to come back to it.'",
        "'speaker_2': 'But I don't have it in front of me right this minute. Thank you.'",
        "'speaker_0': 'All right. Council member, can you. There are few more people in the queue sky.'",
        "'speaker_2': 'And my intelligence.'",
        "'speaker_0': 'Firm. Yes, go ahead, counselor.'",
        "'speaker_2': 'Thank you, Mr. President. I appreciate some of the questions being raised. I actually have a question about the third appointee. And this happens to have a success. I can't remember if I voted against this Pakistani person, but I know history concerns about the individual who informally got to the staff position immediately when they left.'",
        "'speaker_2': 'The employment being put on the board did not feel appropriate to me at that time having that continue. So it seems to me like it might be. This is a great example. We've made it a long time without committee, but I think we should send this committee for some discussion.'",
        "'speaker_2': 'I mean, it just seems like we can get more information on the current membership as a whole. It's very difficult always talking about an appointment without understanding the other members of the entire board. That's the practice that we now speaking on.'",
        "'speaker_2': 'When we're making council appointments, we never leave them in a vacuum. We uniformly serve. And so I think it's not about the individuals per se, but it is about what's the overall balance of representation, of importance of this body in particular.'",
        "'speaker_2': 'I'm afraid of the fact that given some of the economic impacts that are happening, you know, understanding how this may affect the national progress in terms of larger staff, it just seems like these are pretty important appointments at this moment.'",
        "'speaker_2': 'So I would make the motion to send this back to committee. And in generally speaking, I don't think we have to have a date associated with that because I don't know how that's going to be done this year.'",
        "'speaker_2': 'But if I can have a second, I will make that most of the sentence.'",
        "'speaker_1': 'That's all right.'",
        "'speaker_0': 'Madam Secretary, do you need anything else for that motion to be referred to through? And I'm seeing Councilmember Ortega as seconded. That you're a voice that Councilmember Ortega so that we have you on record on voiced you.'",
        "'speaker_3': 'So yes, I would like to second that. I think it's important for us to have complete information. And I've texted a couple of people just trying to clarify whether or not Mr. Zuckerman has left. And so I think it's important for us to have complete information on where we are with all those positions.'",
        "'speaker_0': 'Okay. And Councilmember Torres, I still have you in the queue. Are you okay with the referral to committee or if you want to jump in as well? Okay, then let me go over to you. Go ahead.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'I am fully supportive of the Reform Committee. What I am remembering was I actually made the request.'",
        "'speaker_1': 'Of.'",
        "'speaker_2': 'The National Center to see.'",
        "'speaker_1': 'Someone from.'",
        "'speaker_2': 'The native community. And so I appreciate that this house was put forward. What I see as community representation. So I think there could be greater accommodation.'",
        "'speaker_1': 'For community representation and.'",
        "'speaker_0': 'Right. Councilmember, can each and every forward vote when you were.'",
        "'speaker_1': 'Like three or four.'",
        "'speaker_2': 'Yes. A specific request which is that if we can have this information provided by running for office and the information circulated well before committee, I think it's time to have a challenge getting responses from the information office. And I think it's really critical that we not wait until the committee date to begin answering some of the questions'",
        "'speaker_2': '. And so we request that that information begin getting gathered in there, because it's possible that there could be some discussion and perhaps even, you know, the administration may decide to withdraw its proposal. So I don't think that our work needs to begin in subcommittee, but with that.'",
        "'speaker_0': 'Thank you, Councilmember. All right. Secretary, let's vote on the motion on the floor to refer.'",
        "'speaker_1': 'To the committee.'",
        "'speaker_2': 'Who am I.'",
        "'speaker_1': 'With? Hi. You're fine.'",
        "'speaker_2': 'I can eat. So I thought I said about coffee. I. Cashman.'",
        "'speaker_0': 'Councilmember Cashman We couldn't be more different.'",
        "'speaker_1': 'Ortega I know.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Council President.'",
        "'speaker_0': 'Of Surgery Christos Boateng, announced results.'",
        "'speaker_1': '1339.'"
    ],
    "Third Amendatory Agreement with Mile High United Way for Small Business Emergency Relief Program.": [
        "'speaker_0': 'Council Resolution 279 will be referred back to committee. All right, Madam Secretary, if you please, for the next item on our screen, it is called out by two different members. This is 386. So, Councilor Canete, you ought to go ahead with your comments.'",
        "'speaker_2': 'Thank you, Mr. President. This bill is inspiring to a friend of who has made way more contact for me at the United Way to administer visits. So it takes the contract from $3500000 to $5705000 for this small emergency program.'",
        "'speaker_2': 'I wanted to walk through a little the history of this program really quickly before we vote on March 19, the mayor announced this program would be created. Just to take you back. That was three days, just three days after the second order.'",
        "'speaker_2': 'We had virtually no information about the sales taxes and the revenue service. And you can see we had no idea how long these words would be necessary for public health, the the better for the in terms of our community.'",
        "'speaker_2': 'And yet the administration, the mayor and the Office of.'",
        "'speaker_1': 'Denver.'",
        "'speaker_2': 'Economic Development and Opportunity Office took the courageous move to say that it was so critical to help small businesses in our community that they would immediately $24 million. So when this plan was announced, it was now announced to a million about the primary contingency.'",
        "'speaker_2': 'Contingency is the one source that we have for emergency to help with services and department funding. This was courageous and it was bold. We didn't ask, well, where will the money come from to build other hospitals? We didn't ask what what the impact might be of dedicating this money early.'",
        "'speaker_2': 'Just to give you some perspective. We care about $127 million. Denver was not signed until March 27. We did not know that there was a local government allocation or exactly where taxpayers would be and what it would be bringing to Denver.'",
        "'speaker_2': 'Yet we took courageous. It strikes me as you think about this pandemic, that governing is all about health care. It's about courageous actions, but it's also about corruption. I have supported these investments because they are the right thing to do, particularly for small businesses.'",
        "'speaker_2': 'I do not believe that we have to put everything into work. I believe that the science and the programs and the investments we make in one benefit the other every single time I believe that we sink or swim as a community together.'",
        "'speaker_2': 'Businesses and workers. I read from the status report the importance of investing.'",
        "'speaker_1': 'In workers.'",
        "'speaker_2': 'Who are being left behind. Workers have worked to build this community, clean this community to comfort food, many of whom have lost their jobs, and many of whom to the tune of 100,000, were not born here. Some are excluded from those programs because of their status.'",
        "'speaker_2': 'Some are leaving because of how they keep their taxes. And those workers are just as important to this community as the businesses who employ them. So while we look forward to our budget, we do need to be concerned.'",
        "'speaker_2': 'We need to think about how we're going to get through the rest of this year, which we now know will be managing this pandemic for many months to come. We need to be cautious about our city's budget and thinking about how things will get paid for for basic services.'",
        "'speaker_2': 'But I ask you, what is the definition of equitable? Is the definition of equity that one group we take great fashion for that group and another group are waiting to see if there's money left over at the end.'",
        "'speaker_2': 'I don't think so. I believe the definition of equity is that we take bold action for those who have been often left behind. We take it on page one, and that means we have to take it before we know everything at this point in time, in the coming months.'",
        "'speaker_2': 'I believe that this administration is injustice committed to workers as I am. We work together on the minimum wage last year with an economic equality to thousands of workers in our city. First, the contractors who do business with us and we are all the residents of the city.'",
        "'speaker_2': 'This mayor has been a champion. He was our partner in signing the Public Safety Enforcement Priorities Act in 2017, and he has worked to.'",
        "'speaker_1': 'Support.'",
        "'speaker_2': 'Every effort to undermine the work that we do to support the immigrant communities. So I believe we have shared values. The next step is to take that value and make it into action and find some way to bring the courage that we said to the Citizens Assistance Fund and massive and come up with these similarly sized, courageous'",
        "'speaker_2': 'investments and workers that can be done in partnership that can include foundations and partners. But it does take us to the city meeting. So I will be supporting this investment today because I believe that the small businesses we are helping are also a form of equity.'",
        "'speaker_2': 'That is not a group that answering my questions, demonstrating the number of businesses who are owned by women and people of color. We're not talking about different people here. We are talking about different entities. Right. Whether you bring attention to your business or when you bring into your household.'",
        "'speaker_2': 'Both are critical. So I will be voting for this today, but I voted for it because my expectation that it is the same courage we made on March 19 and we take that same cruise and we make an investment of equal equal to the workers for the next few months.'",
        "'speaker_0': 'Thank you, Councilmember Dodson. Reversing blocking would also help us to go ahead.'",
        "'speaker_2': 'Correct. Thank you, Mr. President. And thank you, Councilman Cohen, each for those comments. I agree. Hold wholeheartedly with many of them. Is there anybody in the room who can answer questions on this contract?'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'My question is about the overhead that's being paid to Mile High United Way. The number has changed a couple of times in my conversations. And I'm wondering if somebody can explain if the overhead percentage is changing for this amendment or if the overhead is the same for the full amount of our contract with them and what exactly'",
        "'speaker_2': 'that's paying for. Can you hear me? Yes. I'm Deborah Cameron from Zito. And it's good to be with you again this week. And thank you for considering this contract request in response to Councilwoman Baucus question. I want to talk a little bit about her administrative fee and her partnership with United Way and our straight into an approach'",
        "'speaker_2': 'with Mobile. United Way has changed since the first contract, which was our system impact opportunity, which was how United Way actually helped create and build that program and develop that program with us. So they were providing a great deal of technical assistance in that realm.'",
        "'speaker_2': 'So we pay you for the second expansion, which was the one shortly after March 19th, where we were putting $2 million into the by you right away. The administrative fee at that point was 10% for the first $10 million.'",
        "'speaker_2': 'And what that paid for at that time was mile high because of the expertize that they had in implementing in the fire funds and they provided in-depth training to our businesses are stepping up to speed in terms of not only helping us develop the application and scoring criteria, but really the financial analysis that our teams had to'",
        "'speaker_2': 'do with each of the applications to demonstrate and understand the financial impact that COVID was having on the on revenue streams. So they provided a great deal of technical expertize and assistance in that first $2 million segment of grams, which we announced 290 words at the end of last week for the contract extension modification that you're considering'",
        "'speaker_2': 'today. The administrative media's dropping down.'",
        "'speaker_1': 'To.'",
        "'speaker_2': '5% of the contract agreement because we feel like our team is fully.'",
        "'speaker_1': 'Up to speed.'",
        "'speaker_2': 'I will remain available.'",
        "'speaker_1': 'For daily phone calls with their team to continue to talk about questions. But primarily one role.'",
        "'speaker_2': 'Will be to execute payments to the companies that were awarded and selected by the U.S. government to function in this. And that criteria that was created. We've asked for that a couple of times. Who who is who needs to provide that Mile High United Way or DITO facility?'",
        "'speaker_2': 'Though I know we have presented information on the steps and factors of how the applications are scored, and I'm happy to go back through those the seasoning or up with you. Now, it's just the seven factors. It's not a rubric.'",
        "'speaker_2': 'It's a rubric with a numerical values for and the and the subsections. Yes. Okay. I'll follow up for that. Thank you. That's all my comments, Mr. President.'",
        "'speaker_0': 'Thank you. Next up, councilmember for.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'No. Oh, I saw your hand. I'm sorry about that. Councilmember Ortega.'",
        "'speaker_3': 'Thank you, Mr. President. So since the last meeting where this came up, I think it was our committee meeting, I had raised some questions and concerns about nonprofits and food banks. And I did have an opportunity to talk with Erik Crockett from Dito, and he assured me that they are putting out some funding that will be available'",
        "'speaker_3': 'for nonprofits. And I wanted to ask Debora. I texted him, but did not hear back yet if she has any idea how much and when that will be put out. Because many of our nonprofits are the very people they're not necessarily classified as businesses, but they're being expected to really do so much more with so much less'",
        "'speaker_3': '. And a lot of them who would historically rely on volunteers, many of those volunteers are not coming in because of COVID. And so I would just like to know when those dollars will roll out. And is there a max amount that's being set aside to assist our food banks and nonprofits specifically?'",
        "'speaker_3': 'Can you pull that a little closer there? Thank you.'",
        "'speaker_2': 'I can't answer your question specifically, but I do know that I thought there might be more submitted.'",
        "'speaker_1': 'Ideas coming to this.'",
        "'speaker_2': 'Over the weekend with.'",
        "'speaker_1': 'Some suggestions.'",
        "'speaker_2': 'On how it would be used against.'",
        "'speaker_1': 'You. I don't know if I could.'",
        "'speaker_2': 'But I think discussions are ongoing, and I think you're.'",
        "'speaker_1': 'Expected to share some potential ideas as early as Friday.'",
        "'speaker_3': 'And I just want to make a comment. Mr. President, I appreciate the work that the administration has done in trying to help our small businesses. We have many of them struggling very, very hard. Not all of them got any of the stimulus funding.'",
        "'speaker_3': 'And it was like the ones who got in there first were the ones that got funded and anybody else who came behind because there were so many. Unfortunately, not everybody got some of that funding. I also agree with Councilwoman Kimmich about the the focus and the need for protecting our workers.'",
        "'speaker_3': 'A lot of workers are being expected to show up and and have masks. We need to make sure those are being provided for the workforce. A lot of low income workers were struggling just to pay rent and to put food on the table and didn't have money to buy masks.'",
        "'speaker_3': 'So those are some of the things I think we need to be addressing and will be talking to to Mr. McDonald about that when he's on the northwest town hall on Thursday. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. And if you're staying put, we're just saying we have another question coming in from council member Joe.'",
        "'speaker_2': 'Thanks, because.'",
        "'speaker_1': 'I can't get out as far as Vito's capacity.'",
        "'speaker_2': 'Things not in the first.'",
        "'speaker_1': 'Allocation, there was 150,000 for technical assistance, knowing that there was a low number. And the other point that's been made by my colleagues, equity, it was top priority for us. And so with the very, very small number of businesses who were wanted in this.'",
        "'speaker_2': 'First round, I think.'",
        "'speaker_1': 'There were nine that were. And can you talk a little bit about how many staff within the DOE are going to be assisting folks who are contemplating applying for these?'",
        "'speaker_2': 'But that's a great question. And other questions that.'",
        "'speaker_1': 'Were was asked last week was how.'",
        "'speaker_2': 'Was the breakdown between.'",
        "'speaker_1': 'Enterprise reporting to self?'",
        "'speaker_2': 'And based on the 290 words that we have announced.'",
        "'speaker_1': 'That we went to writing, 44%.'",
        "'speaker_2': 'Were either in the neighborhood or in the.'",
        "'speaker_1': 'Communications.'",
        "'speaker_2': 'But to get back to your specific question, we have probably over 20 people that are now working on this project, and we're going to go from the 1980s voting of health help.'",
        "'speaker_1': 'We're going to talk about helping out.'",
        "'speaker_2': 'So I would say in total, we have about 20 different people. We do have some bilingual staff that are available to.'",
        "'speaker_1': 'Help.'",
        "'speaker_2': 'Individuals and companies who might.'",
        "'speaker_1': 'Need.'",
        "'speaker_2': 'Reading.'",
        "'speaker_1': 'Applications as well.'",
        "'speaker_2': 'And also the staff of the Office of Financial Empowerment. We've been partnering with.'",
        "'speaker_1': 'Them and they're also working.'",
        "'speaker_2': 'With companies that might need a little.'",
        "'speaker_1': 'Extra help responding to an application.'",
        "'speaker_2': 'As well. And we're also utilizing as well the degree to work with with some of our.'",
        "'speaker_1': 'Businesses because they work.'",
        "'speaker_2': 'In their real. So we're driving across the city. Great. Thank you for that information. And.'",
        "'speaker_1': 'You know, we always have folks who want to apply for something that they just don't have the capacity at this point in time. So I would ask, as you're going through applications or if you identify specifically folks who have applied.'",
        "'speaker_2': 'That maybe they need some.'",
        "'speaker_1': 'Help with the technical assistance that.'",
        "'speaker_2': 'We have, some sort.'",
        "'speaker_1': 'Of game plan to give them that assistance. Maybe it's in the SEC around the city, but that we're really setting them up for success.'",
        "'speaker_2': 'We really are making this effort and I have never seen.'",
        "'speaker_1': 'The company to respond to questions and provide technical.'",
        "'speaker_2': 'Assistance. And we actually saw an email that went to the Denver Post this weekend specifically thanking their team for reaching out and providing them personal touch in terms of phone.'",
        "'speaker_1': 'Calls because.'",
        "'speaker_2': 'So many of the other services that.'",
        "'speaker_1': 'They provided for.'",
        "'speaker_2': 'Them having that kind of personal attention. And our team really is dedicated to putting ourselves.'",
        "'speaker_1': 'In the position and they're working on.'",
        "'speaker_2': 'Themselves. And it's been it's been both personally and a little bit traumatic. Francine Anderson.'",
        "'speaker_1': 'Thank you. Thank you.'"
    ],
    "Grant Agreement with the State of Colorado for Public Assistance COVID-19 Program.": [
        "'speaker_0': 'Thank you, Councilmember. I'll raise other comments on this one. We're going move on to the next one. Secretary, please put the next item on our screens. This is 393. And Councilmember CdeBaca, you close enough for comment? Go ahead.'",
        "'speaker_2': 'Thank you, Mr. President. I caught this one out because I've been getting multiple calls from Denver health workers, employees who have felt like their safety and health has been jeopardized and they haven't had an outlet to speak up.'",
        "'speaker_2': 'They're afraid to speak up for fear of retaliation from Denver health. And so several of those individuals pulled together a letter that I'd like to read on record for council members. Distinguished Council members. We are a group of dedicated bedside nurses and employees at Denver Health caring for patients battling coronavirus, all while we continue providing the essential'",
        "'speaker_2': 'care that our community relies on our hospital for. We want to thank you in advance for approving desperately needed emergency funds and at the same time rightfully actioning the allocation of money inside our organization. Your commitment to ensuring the fair and ethical distribution of resources is reassuring to us at a time when we are being forced to'",
        "'speaker_2': 'reanalyze and reevaluate the assumptions we have taken for granted. We share your concerns, concerns we didn't think we would ever have. After some of us left for profit health care jobs in favor of nonprofit ones, we have been diligently working with the understanding that from top to bottom, this hospital was a team working in service of a'",
        "'speaker_2': 'shared mission. When our administration asked the front lines to make cuts and sacrifices, we assumed those cuts would be shared across the organization. We weren't. We were reluctant to ask questions, assuming these requests were being made in good faith.'",
        "'speaker_2': 'When the same hospital executives who asked us to sacrifice took over $1,000,000 in bonuses, we felt betrayed and demoralized by our leadership as our concerns for more, more as our concerns for patient safety and our rights as workers were repeatedly dismissed.'",
        "'speaker_2': 'We have begun to feel ever more expendable as COVID 19 lingers, claiming more lives. We are concerned not only for the outcomes of our patients, but for the first time we are concerned for our own safety. As you know, many of us are distancing ourselves from loved ones and have not seen our families for over a month'",
        "'speaker_2': '. Knowing that when we come home from saving the lives of our patients, we may risk the lives of our families with the substantial viral load covering our close face and hair. We know we are in danger. The fear of contracting this illness or giving it to loved ones keeps us up at night and puts our dedication and'",
        "'speaker_2': 'altruism to the test. In nursing school, we were taught to always assess the scene, to ensure our own safety before caring for others. We were taught that the safety of others would never be expected to take precedence over our own.'",
        "'speaker_2': 'Until now, as we face emergency PPE shortages, we are extending the use of one N95 mask from a minimum of 12 to over 36 hours three weeks in some cases. This is a mask that was designed for single use and to realistically only be worn for at most an hour or two.'",
        "'speaker_2': 'We don't have access to full body suits necessary to protect our face, neck and clothing. Instead, we utilize single use gowns which only protect our arms and front portion of our torso. We are providing our own safety glasses because shields used to protect our entire faces are often hard to come by and are in questionable condition being'",
        "'speaker_2': 'reused between multiple staff and even patients. Cleaning supplies and disinfectant wipes are also in short supply. Advice to think carefully about what we clean and to judiciously use disinfectants. Nurses are are accepted to be expected to be the professional experts on a holistic view of patient's lived experience while in the hospital.'",
        "'speaker_2': 'We know firsthand how the quality of patient care has been reduced in efforts to preserve PPE and cleaning supplies. Many of our patients at Denver health are gravely ill and often have medical histories with multiple preexisting conditions due to income and systemic health disparities.'",
        "'speaker_2': 'Simply put, our patients are sicker than those that other hospitals. They have fewer resources, lower health literacy rates and diminished coping skills. Their care is complex and more involved than patients at other facilities. We can confidently inform this council that supplies and money for training are desperately needed to maintain the health of the most vulnerable members of'",
        "'speaker_2': 'our community. As the frontline nurses, we're committed to this mission, but we need Denver Health to have the support and leadership it needs. We can't do it alone. Thank you. So much for your time, consideration and commitment to the public of the of Denver County.'",
        "'speaker_2': 'And this was a letter that they brought to me due to their concerns over the insufficient paid help paid leave for people or professionals who come down with coronavirus for a paycheck loan program through Denver, Denver Health that has an 18% interest rate for the most vulnerable workers.'",
        "'speaker_2': 'And this is all due to that, what we're being billed for or what we're trying to have reimbursed by FEMA through the grant agreement that we're passing tonight. It's important for us to look at the many spreadsheets associated with this request and to demand continued reporting on modifications to this grant agreement amendments, deliverables, financial reports and even'",
        "'speaker_2': 'approved expenses. I think that we need to make sure that we're getting these reports on a regular basis, and I request that our leadership has this for us so that we can be in lockstep with what's happening on the ground and make sure that we're getting these resources to people on the ground.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember. Next up, Councilmember to our editors.'",
        "'speaker_2': 'Thank you, Mr. President. I really appreciate that letter. I think those.'",
        "'speaker_1': 'Six.'",
        "'speaker_2': 'Employees really quickly put into words.'",
        "'speaker_1': 'What it's like to hear from our district offices. And this.'",
        "'speaker_2': 'Is a reminder of even those that.'",
        "'speaker_1': 'We have to for how.'",
        "'speaker_2': 'We don't we may not have the authority of our personnel decisions, but we expect the demand.'",
        "'speaker_1': 'Leadership to work towards.'",
        "'speaker_2': 'These kinds of communities, and we expect that to work as well, which is really important. Failure of the leadership team is what I've seen, and I hope they.'",
        "'speaker_1': 'Will correct it.'",
        "'speaker_0': 'Thank you, Councilmember. Except Councilmember King.'",
        "'speaker_2': 'Thank you so much, Mr. President. I was not in favor of delaying that approval. And this is body politic that we've defined is critical. That said, important information that has come out of this many of us. Over the last few weeks.'",
        "'speaker_2': 'I want to thank them for answering some of those questions, but one that I would like to ask the members of the administration once again, if you could do it very obviously, or sometimes the connection between them or help in the in terms of things like security and purchasing of equipment.'",
        "'speaker_2': 'So I would like to understand better. You can follow up with that email. Understand when you've been asked to help to procure PPE, when you've done that, when you've obviously exhausted or declined to participate, whether it's the client and 95 because the price is too high when they were available.'",
        "'speaker_2': 'So if you could just help us understand how much we are involved in your health and think that was great, I don't want to put you on the spot and help it provide that and it would help me a little better.'",
        "'speaker_2': 'I know that we're separate entities that the president that our public health arm that they operate. It's my sense that there is some information happening at the government level.'",
        "'speaker_1': 'So it's needed for me for that.'"
    ],
    "Security Services Contract for Homeless Shelters and Facilities during COVID-19.": [
        "'speaker_0': 'Thank you, Councilmember. All right. Singular comments on this one. Madam Secretary, please put the next item on our screen. Councilmember Torres, would you please put Council Resolution 416 on.'",
        "'speaker_2': 'Approving Council Resolution 20 416 to adopt this?'",
        "'speaker_0': 'Thank you. It has been moved and seconded. We're going to be questions or comments by members of council members and must be sent up for vote.'",
        "'speaker_2': 'Yes. Thank you, Mr. President. I've called this one out for a vote because I raised concerns several times about contracting with this company. They've been in the media multiple times and most recently for a brutal beating of a constituent in Union Station.'",
        "'speaker_2': 'I have a letter here that I think captures most of my reasons for calling this out and voting no. I believe it was sent to other council members, but I think it's important to get it on the record.'",
        "'speaker_2': 'This came from the Greater Denver Ministerial Alliance, and it reads as such Dear Denver City Council members, I'm writing this letter to express my disapproval and objection to City Council awarding universal protection services, doing business as allied universal security.'",
        "'speaker_2': 'A contract for $4 million to provide security for homeless shelters at National Western Complex in response to COVID 19 pandemic. Our community has reported multiple grievances against what we believe are racial profiling practices against African-Americans by allied universal security guards throughout the RTT system.'",
        "'speaker_2': 'Most egregious was two years ago, when Allied universal security guards in the RTD Union Station terminal viciously beat Rivero Stinnett, a local Denver artist, while he waited after midnight to catch a train home. He sustained injuries so severe that they have permanently affected his life.'",
        "'speaker_2': 'We do not trust allied security to fairly and respectfully protect our most vulnerable community members, especially with the heightened stress of COVID 19 pandemic. We respectfully request the Denver City Council to decline this contract and seek other agencies to perform security.'",
        "'speaker_2': 'Respectfully, Bishop Jerry Demmer, I am in full agreement with this. I believe that we are signing up for a liability with this company. They are still in litigation on this particular case, and there have been other cases. And I believe that if we open the doors to a company that has known harms against specifically our homeless and'",
        "'speaker_2': 'black and brown community, we are not doing our city any justice. And I request that we decline this contract and go back to the drawing board with other individuals who can provide security for this complex during this very sensitive time.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_0': 'Councilmember next up, Councilman Ryan's.'",
        "'speaker_1': 'Thinking as president. I am guessing that no one is here representing our universal credit protection services or universal protection services. And I would say that the letter is troubling, and I'm not sure exactly what to do without any sort of response or or the ability to provide a response.'",
        "'speaker_1': 'So I think this by the way, this.'",
        "'speaker_0': 'Thank you, Councilmember. Next up, Councilmember Ortega.'",
        "'speaker_3': 'Is Brennan still in the room?'",
        "'speaker_0': 'Brendan Henry.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Yes, he is.'",
        "'speaker_3': 'Okay. Brennan Can you tell us just based on kind of where we're at and the fact that we're looking at a safer to safer at home model after the eighth? How much longer we anticipate having the National Western and the Coliseum shelters open?'",
        "'speaker_3': 'Same with the hotels. I'm real concerned about what are we going to do next? Where where will these people go, especially some of those who are sick? Because that ties back into Councilwoman CdeBaca question about, you know, how long will it take to find somebody else different, to do the security at this location?'",
        "'speaker_0': 'You know, the Microsoft.'",
        "'speaker_1': 'Their lessons are there.'",
        "'speaker_3': 'And you got to speak real close.'",
        "'speaker_1': 'Really? Yeah.'",
        "'speaker_0': 'Brendan Hanlon So Chief Financial Officer comes home and I'm going to get you some additional information. I wasn't prepared to talk about that today.'",
        "'speaker_1': 'Our guys here to talk about that. Okay.'",
        "'speaker_3': 'Thank you. I asked the wrong person. Okay.'",
        "'speaker_2': 'And can we delay what the Department of General Services is available to? I'm sorry. I was having trouble and muting. So Skye Stuart Mayor's office again Cammy is on from general services and can speak more specifically to the contact details of this.'",
        "'speaker_2': 'To your question about how long this will go on, we don't have an answer to that yet. This contract runs through June 1st and that is what we're anticipating for the moment. But as we're evaluating things, we will continue to look at that.'",
        "'speaker_2': 'Many of the hotel contracts we have have rolling options throughout the rest of the summer that we can execute as we go along. So we'll continue to evaluate the situation on the ground. As you said, the safer at home orders come into place.'",
        "'speaker_2': 'But we don't have a definitive time frame for when we will rule on those, meaning the use of artillery shelters, where the hotels are looking at currently providing services at least through the end of May.'",
        "'speaker_3': 'Okay. And tell me, since you're on the line, can you tell us what the process was to make the selection of this company over any of the others that are available in the Denver community?'",
        "'speaker_2': 'Absolutely. Councilwoman Ortega, thank you very much for the question. So we were just to give you a little bit of context of timeline of of what occurred with the security specifically at National Western. General Services was pulled into that discussion on April 11 and asked to provide security.'",
        "'speaker_2': 'So on April 11, we were able to assemble a small team of security agents who were able to provide that. The post at National Western. It's been a very small or it was a very small contingent of security officers that cover that post through the 23rd.'",
        "'speaker_2': 'And they were not able to fully meet the capacity of the needs at the national national Western complex. And also, they were not able to meet the the requirements of the Denver Coliseum, which opened on April 20th. So we had to take within within about nine days from the 11th to the 20th, which was, again, the Coliseum'",
        "'speaker_2': 'opening to look for qualifications and quotes from different vendors in the Denver area as well as the as Colorado. We reached out specifically to ten vendors and we got proposals back from from those folks. And the only the only security company that was able to meet the city's needs and the most immediate needs was Allied Universal.'",
        "'speaker_2': 'We've met extensively with them. They are providing security services under a purchase order currently at the National Western Center, as well as the Denver Coliseum, until we could get this contract through the city council. We met with them extensively to discuss the services that are being provided there and the training that's being provided.'",
        "'speaker_2': 'And I've been on site pretty routinely to check in with all of the with the project managers. So there's a dedicated project manager that is on site working between those sites. There's extensive supervision within the site. And these are unique sites.'",
        "'speaker_2': 'And I'm sure that you all have have been out or had the opportunity to go out. But there are a lot of different people that are at these sites. So there's a tremendous amount of oversight, whether that is our partner providers, the Colorado Rangers are providing some security as well, daytime hours, as well as the Denver Police'",
        "'speaker_2': 'Department, which are primarily on the exterior of the facilities, but just to create a secure and safe environment for the residents that are coming into both of the shelters.'",
        "'speaker_3': 'And under this contract. How many employees does this include?'",
        "'speaker_2': 'So each of these shelters has 11 staff on it at any eight hour shift. So really, you're looking at, you know, somewhere between 30 and 40 that are dedicated to each each shelter. Plus, again, as I mentioned, supervisory staff as well as the project manager.'",
        "'speaker_2': 'So those are additions.'",
        "'speaker_3': 'So was the staffing part of the the issue that we looked at in terms of of trying to meet that demand immediately?'",
        "'speaker_2': 'That is correct. That's absolutely correct. Our current contractor, HFCS, which we would have liked to have continued working with them, they just simply didn't have the capacity as well as the fact that since our city facilities are going to be reopening and and getting back up to sort of the capacity that we were there, they couldn't necessarily'",
        "'speaker_2': 'provide the service that we needed. And they're also providing some of that security at the respite locations that were mentioned before this restroom.'",
        "'speaker_3': 'Great. Thank you. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'I want to go to Councilmember Tourism. I've got a view on this issue. Actually, go ahead.'",
        "'speaker_2': 'Thank you so much. So that line of questioning makes me feel like this is an impossible situation because there's only one agency qualified and.'",
        "'speaker_1': 'There are even more. So the.'",
        "'speaker_2': 'Review and the approval of this contract.'",
        "'speaker_1': 'Really increase.'",
        "'speaker_2': 'From the purchasing department, city and county.'",
        "'speaker_1': 'Facilities.'",
        "'speaker_2': 'Camden County victims did. Do you know or does anyone know.'",
        "'speaker_1': 'What the lawsuit just concluded? I guess.'",
        "'speaker_2': 'Did that come up at all in the vetting of the agency? Thank you for the question, Kaplan Torres. So we did we meaning myself and Chief Security Officer George Hunt had a conversation with the startup team that was assigned to this project and brought our concerns to their attention.'",
        "'speaker_2': 'They did assure us that that would not be the case and that that is not the the organization that is that is Allied Universal. But we we were concerned and rightfully so, and knew that this would be a question that we were asked.'",
        "'speaker_2': 'And we wanted to do our our due diligence and ensure that we were employing the correct staff at these locations, because we're extremely committed to providing a safe and secure environment to these individuals. And I've spent a lot of time in the shelters recently and and certainly have a newfound respect for for the individuals there, as well'",
        "'speaker_2': 'as our partner providers. We did a background check or not necessarily a background check, but let me step back. We requested the names of all of the agency agents that would be assigned to either shelter. And then we ran them through a check with access and license to ensure that the guards didn't have any sort of history'",
        "'speaker_2': ', that perhaps, you know, perhaps they somehow slipped through slipped through the background, normal sort of background checks that that were required or that allied universal requires. And so all of those checks came back negative or came back that there weren't any sort of issues with with the agents.'",
        "'speaker_2': 'Allied has done extensive training with them because obviously this is a very sensitive population. And and we had a lot of conversation about that before before bringing them on board. And then also specifically within the women's shelter at the Coliseum, the partner provider, I believe Catholic Charities also did about a 40 minute specialized training with all of'",
        "'speaker_2': 'the agents assigned there to talk about the specific sort of trauma and issues that the women and transit transgender population encounter in a homeless sort of situation. And so that each of those agents went through that training with our partner provider.'",
        "'speaker_2': 'And and I think that that was definitely, definitely helpful. Now just one more question. How long is the purchase.'",
        "'speaker_1': 'Order been in place from the.'",
        "'speaker_2': 'I'm sorry. I had a hard time hearing you.'",
        "'speaker_1': 'How long have the purchase orders in place? Without.'",
        "'speaker_2': 'With Allied forces. They began working at the Colosseum whenever it opened on April 20th, and then they transitioned to the National Western Center on the 24th. So HSF was there until the 23rd and the transition happened on I believe that was Friday the 24th.'",
        "'speaker_1': 'I'm sorry. One last.'",
        "'speaker_2': 'One. What is the procedure at the National.'",
        "'speaker_1': 'Security Center if.'",
        "'speaker_2': 'Any of the guests have an issue with a security guard? Do they take that to. Sure. So if any of the residents and I believe this was your your question any of the residents had an issue with the security guard.'",
        "'speaker_2': 'Where could they take that? So obviously, there are several supervisors with Allied that are on site. However, someone may not be comfortable with that situation, so they can really go to any one of the providers that are at the location there.'",
        "'speaker_2': 'I think, you know, Denver Rescue Mission is the primary provider there. But I know that there are some other contract type work that, you know, being in that setting, people get to know one another. And so Aramark and some other.'",
        "'speaker_2': 'So they could potentially take it to any of those individuals if it if they had an issue over at the Coliseum, I believe. There are several different partner providers. Catholic Charities, I think, is the main one. And then there are several others that they could take concerns to.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_0': 'Next up, back to council, Eduardo.'",
        "'speaker_2': 'Just a comment and a question. This is a case that was pretty high profile because of the permanent brain damage sustained on video. And so it's hard for me to wrap my head around the city going with this provider, knowing what happened in this case.'",
        "'speaker_2': 'Even from an outsider's perspective. I would like some answers about some things you mentioned. You said that HFCS cannot meet the requirements. Can you explain to me what the requirements are for this contract and for this specific site, if the site was what made it more cumbersome?'",
        "'speaker_2': 'Sure. Absolutely. The the. Thank you for the question, Councilwoman CdeBaca. I certainly hear you. And that's really the issue with HFCS is one of capacity. So they as I mentioned before, they were only able to provide about half of the capacity that we needed at National Western.'",
        "'speaker_2': 'And even that was a bit of a challenge where we would typically have ten or 11 staffed for an individual shift. They were coming up with only about five security guards that could cover that shift. So we were asking them to cover city facilities as well as these rested hotel rooms in addition to National Western.'",
        "'speaker_2': 'And I did understand that whenever we asked HFCs to come in and assist us on that, you know, April 11 two with security services, that that was very much a temporary sort of arrangement and that we would very soon after that has to figure out something that was a bit more long term meaning could sustain us through'",
        "'speaker_2': 'potentially June or maybe, you know, into September if need be. So really, HSF was one of capacity. What is what are the other requirements? Do they need to be armed or do they need some kind of specific certification?'",
        "'speaker_2': 'What are the other requirements around who can who can do this work? Absolutely. So we did require a merchant guard license issued by the city and county of Denver. So we require that of anyone perform it performing security services for the city.'",
        "'speaker_2': 'We also required that that we have a heavy focus on men agents at the National Western Complex and female agents at the Denver Coliseum. We wanted to create a safe environment for those individuals and felt very strongly that men should be at the men's shelter and women should be at the women's shelter.'",
        "'speaker_2': 'And and it's balancing out rather nicely. As far as the orange piece is concerned, absolutely none of our guards at either one of the locations are armed. We did have one. And I just I want to be very transparent on this.'",
        "'speaker_2': 'We did have one armed guard with us that works for that period of the 11 through the 23rd. He was a supervisor. He was the first one on on the property on the 11th whenever we needed assistance. And he actually did a really fantastic job.'",
        "'speaker_2': 'He worked the overnight shift and was able to bond with the residents and had a really good rapport with them. However, he's with HSF, so now he is back in the city facilities providing providing work. So we have absolutely no armed staff, allied staff.'",
        "'speaker_2': 'And if I could just share here quickly as well that it is very much an observe and report situation. There is never and whenever we sent out a request for for qualifications and quotes, it was a strict no contact, no touch sort of security position.'",
        "'speaker_2': 'So so it is observe and report. There is never to be any sort of physical engagement with anyone that is any of the residents. That's what our partner providers are for or that they are there to engage and to calm and to de-escalate and to assist the residents with any sort of issues that they may be encountering'",
        "'speaker_2': '. And so do you know if the the officers who are in litigation right now with us, do you know if they had any of these red flags on their record prior? And is is that. I mean, if they didn't have these things red flags on their record prior, they would be like anyone else.'",
        "'speaker_2': 'We're setting up in this position and could potentially have situations where these guards are doing the same thing that those guards did. So do we know if there were red flags on the other officers record? I do not know that.'",
        "'speaker_2': 'I can certainly ask that question of Allied I and I do. I do understand your concern, and this was definitely a concern that myself and the chief security officer had. And again, we spoke extensively with, you know, with Allied before moving forward.'",
        "'speaker_2': 'I would have to say that. We have been very pleased with their performance. While I have checked in with the folks that are on site daily, sometimes, you know, 12, 15 hours a day. Everyone is very pleased with how they're performing, with how they are engaging with the residents.'",
        "'speaker_2': 'We've really set this up in the expectation with Allied that this was that they were there really to provide customer service. And even though they're in a security uniform, it's customer service where a lot of times you're going to get questions and things like that from from the residents.'",
        "'speaker_2': 'And so to be able to answer their questions, you know, and to provide them some information. But again, absolutely no sort of contact whatsoever. And so two more quick questions. One, are they prohibited from having brass knuckles and studded gloves with them, which were the the tools they used to beat this man?'",
        "'speaker_2': 'Absolutely no. No weapons whatsoever are allowed to be carried by any of the guards that are working in either of these facilities. And is is it our typical is it customary for us to engage in contracts with people we know we're in litigation with?'",
        "'speaker_2': 'I can't necessarily answer answer that. I think I would have to defer and get an answer from our city attorney's office for you on that. Councilwoman feedback. Thank you. That concludes my questions, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember. All right. Seeing no other. Nobody else in the queue. Madam Secretary, roll call.'",
        "'speaker_2': 'What I.'",
        "'speaker_1': 'Are I?'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'I'm saw your friend.'",
        "'speaker_1': 'I know. Cashman by.'",
        "'speaker_2': 'We're taking. You know, I.'",
        "'speaker_0': 'Sorry. These guys going to announce the results.'",
        "'speaker_2': 'In two days.'"
    ],
    "Amendments to Leases, Licenses and Concession Agreements for COVID-19 Relief.": [
        "'speaker_0': '11 hours, two days. Council Resolution 416 has been adopted. Madam Secretary, if you put the next item on our screens and howsoever can each. This is three eight. Go ahead with your comments.'",
        "'speaker_2': 'Thank you, Mr. President. This is the ordinance authorizing location.'",
        "'speaker_1': 'Of what you need to.'",
        "'speaker_2': 'See the process here. I mentioned this last week, and I want to take my prior comments about the values that this administration has shared about. This is a perfect example.'",
        "'speaker_1': 'I want to.'",
        "'speaker_2': 'Thank the administration for working with me to think about ways that we can make sure that we give residence to these tenants in our city owned building the commercial scale that we're thinking about here. They had an envoy as well.'",
        "'speaker_2': 'So the leases include a of subway store.'",
        "'speaker_1': 'A restaurant.'",
        "'speaker_2': 'A coffee shop. The EPA.'",
        "'speaker_1': 'Has.'",
        "'speaker_2': 'A gallery of theater and includes everything. The Statue of Liberty is a great example. And then the people, Republicans and as well wide array and many of the workers who work for these companies probably at any level important stuff for them.'",
        "'speaker_2': 'And based on that conversation with the administration, there been a commitment to the protection so that when companies hopefully get back money, they are going to bring back the workers that they have before they hire others. This will probably be a very different stock market, but it is no small thing to know that you go back to'",
        "'speaker_2': 'the founding cap, that there will be any potential motivation to think about workers.'",
        "'speaker_1': 'Whether that be.'",
        "'speaker_2': 'People or whether they do not begin with, be getting pregnant with or without food or without health conditions, for example. So this eliminated any of those risks by giving those workers that local reward the businesses that it wouldn't have health insurance.'",
        "'speaker_2': 'That is so critical right now. We don't have all the tools we need at.'",
        "'speaker_1': 'With government to address the.'",
        "'speaker_2': 'Very large structural issues that our government needs to take on. But in a small way, we can report the right thing and say for private insurance, really a great.'",
        "'speaker_1': 'Precedent.'",
        "'speaker_2': 'And to show the way it can be honored, both the businesses that have to pay your rent as well as the workers that they have. So I just want to say thank you to this network. This is not something you're going to see in the audience.'",
        "'speaker_2': 'We're not supposed.'",
        "'speaker_1': 'To.'",
        "'speaker_2': 'Describe how this is going to be put into effect. So folks understand the mechanism.'",
        "'speaker_0': 'Yep. Go ahead.'",
        "'speaker_2': 'Great. Thanks so much. Sure, Sky Stewart from the mayor's office said Alchemical Mechanics explained that this is an ordinance to allow the property finances division of real estate to renegotiate some lease terms with these tenants. As part of that, there will be an addendum to their lease that outlines the specific provisions that we're talking about here, where'",
        "'speaker_2': 'if they take advantage of that rent deferral, will their rent be deferred, a term added to the end of their term, but they will be required to meet these obligations in terms of the rehire provision. So they'll be required to try to stop their employees when they leave.'",
        "'speaker_2': 'Though she said that she will have the ability to check when they begin rehiring them. They have made the offers to those same employees. And also on the health insurance side, the one who was being provided health insurance, if they are being paid for that health insurance throughout the terms of the rent deferral, we will actually offset'",
        "'speaker_2': 'the cost in an equal amount to what they are paying in terms of that insurance. But that said something in doing that, as the council, I mentioned that a lot of these are part time jobs and a lot of Pacific operations here.'",
        "'speaker_2': 'So not everybody was receiving health insurance, but there are some more employees and management employees that we know are receiving health insurance that have to be paid over that time. So I want to make sure that they are rewarded for continuing to support their employees during this crisis.'",
        "'speaker_2': 'Thank you, Mr. President. Nothing other. I want to.'"
    ]
}