{
    "Rezoning of Property at 3901 - 3991 North Cook Street in Council District 9.": [
        "'speaker_11': 'And you see the property highlighted in yellow, the northern portion fronts, 40th Avenue, where you have RTD, bus route service 44, which connects between downtown and the 40th and Airport Park. Right. You also see outlined the property of the market lead, which the city recently acquired from BNSF and that was just recently acquired in the month of'",
        "'speaker_11': 'January. The property is 1.72 acres and within a half mile walk of the fort of Colorado station platform. And this will be the second station along the University of Colorado Line, which opens in April 2016. Here's another view of the property and the you are h 2.5 zone district that's being requested requires a full block face as'",
        "'speaker_11': 'a minimum area requirement. So the applicant's primary interest is in the property that they hold towards the south or the left end of this block face. But the entire block face, with a 58% approval or signatures representing 58% of the property, is in support of this application.'",
        "'speaker_11': 'The owners are requesting zoning to allow for infill residential development. And specifically the general urban neighborhood. Context Rowhouse 2.5 Story Maximum Zone District is being requested. This district promotes safe, active, pedestrian, skilled residential uses. Building forms and reinforces desired residential patterns, including shallow front yards, tapered building heights on sides and the rear.'",
        "'speaker_11': '20% of the lot is limited to one story, consistent with development patterns in urban residential neighborhoods. The site and surrounding zoning is ESU d x or urban edge single unit d x, which allows for single family houses on a 6000 square foot minimum lot size.'",
        "'speaker_11': 'Existing land use is predominantly single family. But as you saw in previous images, across the street east of Cook Street is fairly intensive industrial use and outdoor storage to the north side of Colorado. Across from the site is so a variety of mixed uses, occasional small industrial site or religious quasi public use in the blue.'",
        "'speaker_11': 'There are also some vacant parcels nearby. Here. You can see the site in the center image. We're looking at the property from the corner of 39th and Cook to the north. You see one of the small religious assembly buildings on the north side of Colorado to the east.'",
        "'speaker_11': 'On the right, you see single family residential as well as the larger scale industrial and outdoor storage use. To the south, we see residential and also this abandoned rail track system that you see here is a sliver of that market lead property that city is now the owner of.'",
        "'speaker_11': 'And to the west, 39th and Adams. We're looking at single family residential. The applicant and city of Denver have reached out to the registered neighborhood organizations listed here and have met all of the written and required written and posted notice requirements for hearings and meetings leading up to the public hearing this evening and to present no public'",
        "'speaker_11': 'comments have been received. Let's move to the review criteria beginning with consistency with adopted plans. Comp Plan 2000 encourages conserving land by promoting infill development consistent with neighborhood character and encourages neighborhood investment for a range of housing types and prices.'",
        "'speaker_11': 'Concept Land Use in Blueprint. Denver is Single-Family duplex, which allows which encourages primarily residential uses of moderate density and allows for a mix of housing types, including single family duplex rowhouses, small apartments, and I would add garden court apartments or garden court bro homes.'",
        "'speaker_11': 'And this is an area of stability. The Street Classification and Blueprint Denver for 40th Avenue, which fronts the northern short side of the block, is a mixed use. Arterial arterial streets connect major destinations between neighborhoods, regional destinations, and in this case, it's an east west connector between 40th and Colorado and 30th and Blake Station area and on'",
        "'speaker_11': 'towards downtown. And as I mentioned earlier, RTD bus Route 44 runs along Fourth Avenue. Cook Street is local and designated street type provides access to individual homes and businesses. The O'Leary and Swanson Neighborhoods Plan adopted just a year ago 2015, actually captures this site around the 40th and Colorado stationary, which was the slightly expanded portion of the'",
        "'speaker_11': 'response to a neighborhood planning effort. And as such, we have very clear land use and building height guidance. You see here single family duplex similar to the concept land use and blueprint Denver. This kind of tennis yellow color and then the maximum building height shown as two and a half stories.'",
        "'speaker_11': 'And you see a progression from the site moving to the east or to the right, two, three stories and five stories. And that's really marks the transition at Cook Street from lower scale established or traditional residential areas to what's anticipated as transit oriented development getting closer to the rail station.'",
        "'speaker_11': 'So for traditional residential areas in the area in Swansea, a plan, there is encouragement to allow for some investment in these areas of stability, infill development, but allowing or providing for some economic benefit, not just to the reinvestment areas of the station areas, but also for residents in the neighborhood, thus encouraging infill population to support desired services'",
        "'speaker_11': 'and providing economic opportunities such as what you see here in this image is a tandem house similar to an accessory dwelling unit, but in this case could be sold off or owned entirely as a separate, separately owned unit.'",
        "'speaker_11': 'And here's some of the text from the earlier in Swansea Neighborhoods Plan showing that a range of housing types is encouraged and allowed in single family duplex ranging from single family to row homes and small apartment buildings. The second review criteria is uniformity of district regulations and you RH 2.5 would result in uniform application of district use'",
        "'speaker_11': ', building form and design regulations, and would further public health, safety and welfare by implementing recommendations from these adopted plans. The justifying circumstance or fourth criteria is that the change or changing condition of the land and its surroundings, specifically the station, platform, park and rider nearing completion, soon to open in April 2016.'",
        "'speaker_11': 'And the city's recent acquisition of the BNSF market property, which runs right along the south and the southern boundary of the site. And there are new sidewalks being designed and soon to be built along 40th Avenue. Fifth and final criteria is consistency with neighborhood context, own district purpose and intent in the you are each 2.5 district is'",
        "'speaker_11': 'consistent with the recommended urban neighborhood context as called out in the alerts. Once the neighborhoods plan, the existing community fabric matches the the description of that context and the you are each 2.5 is consistent with the purpose and intent of his own district.'",
        "'speaker_11': 'CPD finds that all review criteria have been met and we recommend approval of this. Application and Planning Board has also unanimously recommended approval. Thank you.'",
        "'speaker_1': 'Thank you. We have three speakers called up. We have three speakers for this bill. And I'll go ahead and call all three speakers, Michael Tumor, Ken Gilman and Mr. Sekou. If we can make your way up to the first Q Mr. two men, Mr. Gelman and Mr. Sekou and.'",
        "'speaker_1': 'Mr. Toomey, you can begin your remarks when you reach the podium.'",
        "'speaker_11': 'I am Michael Tara. I am here to answer any questions that you may have in regards to this project. And we'd like to just kind of let you know, our excitement in doing a project that's so close to all the new light rail development at the 40th station and to provide a project that's.'",
        "'speaker_11': 'Someone affordable. The way that the real estate market has kind of developed in Denver, we can do some pretty nice. Things with this piece of property.'",
        "'speaker_1': 'We'll do questions later on. Thank you, Ken Gilman.'",
        "'speaker_11': 'Ken Gilman. I'm the other owner, you know. So again, we just think the project will improve. The neighborhood fits into the neighborhood plan, especially around that transit oriented development. And we're here to answer questions.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Mr. Sekou. Let's just take a. She's.'",
        "'speaker_4': 'Yes. My name is Jeremy Sekou. Organize it. Founder Like Star Action Movement. Representing poor, working poor and homeless people. First of all, it's an honor to be here. To have this kind of conversation is a very serious one.'",
        "'speaker_4': 'And from my experience, from being down here previously for the last six years, there is a tendency to come and get the zoning approves. And are according to the plans of 2000. And here we are in 2016 with changing conditions.'",
        "'speaker_4': 'Everything that I'm seeing tonight is market value. No consideration for poor, working, poor homeless people. There was an article in the paper today, different weekly news that says. There are over 3000 homeless people in this town and only 1200 beds available.'",
        "'speaker_4': 'That leaves 1800 people every day subjected to a hostile environment with the weather. So as you gobble up the land during this. Open market stuff. There's nothing there for us. Including jobs so that we could even afford to buy one of these things.'",
        "'speaker_4': 'Especially in the black community, where we go to any site in the city that's being built now, and you will see black workers on that site like flies and buttermilk. You can't count the ones that are there because they're not there.'",
        "'speaker_4': 'And so now we're talking about historical black community that folks can't even work in and then get gentrified and pushed out. And we call ourselves civilized. And this is a city for everybody, except if you're poor, working poor and homeless, you've got to go.'",
        "'speaker_4': 'There's no place for you. And yet these are taxpaying people. And so most of the folks here well, not most folks, but folks who've been here for a while, they've heard this story before. And I've said it over and over and over again.'",
        "'speaker_4': 'And I still get a response. Of apology, rationalization, denial and impact. When they say they're working on it. Has the impact of a net by an elephant on the butt and you call that progress? You are treading very dangerous water when you have a sizable population of people who are not stakeholders in the development of the city'",
        "'speaker_4': '. They have no reason not to rebuild. And so you have another Ferguson and you have New York and you have San Francisco housing riots, all of that.'",
        "'speaker_1': 'Because to say to people. Mr. Sekou, listen, Mr. Sekou, you're 3 minutes is up. Thank you very much. All right. That concludes our speakers. Now time for questions of council councilmember.'",
        "'speaker_7': 'Yeah. Thank you, Mr. President. Illustrative verse. Tim, quick question. I want to I wanted you to go back to the Olivia Swan, to your plan. You highlighted this. I didn't hear what you said, though. You highlighted this particular parcel.'",
        "'speaker_7': 'How does it relate to the plan?'",
        "'speaker_11': 'Yes. So I pulled up the graphic of the of land use in the Swansea neighborhoods plan and it is recommending single family duplex, which is defined in very similar terms as Blueprint Denver, which is anything from single family to duplex to row home and even small apartments.'",
        "'speaker_11': 'But specifically in this plan, it calls out. Rowe homes as appropriate building form within this.'",
        "'speaker_7': 'And the overall plan speaks to affordable housing, does it not?'",
        "'speaker_11': 'Yes. There are many recommendations related to affordable housing investments, particularly near rail transit, but also in established residential areas. And I pull this graphic up, these graphics are actually in the plan showing that there can be modest infill within.'",
        "'speaker_11': 'Stable residential, traditionally stable residential areas where a homeowner could actually even sell off a portion of the lot or bring some rental income. So stabilizing a stabilizing these established residential areas. So there are multiple strategies.'",
        "'speaker_7': 'Yeah. And In The Heights, you didn't really speak to that.'",
        "'speaker_11': 'Sorry if I went over that too quickly. And here are the highlights. On the same slide as the land use to the right, we see maximum building heights at two and a half.'",
        "'speaker_7': 'Got it. Okay. Thank you. And maybe one of the representatives. Yep. Did you guys. What neighborhood did you get a chance to talk to and talk about this project?'",
        "'speaker_10': 'We spoke with Clayton as well as.'",
        "'speaker_11': 'The Neighborhood Association, right? Yeah. Oh, man, I'm primarily Clayton.'",
        "'speaker_7': 'Clayton, so. Yeah. But I know Elyria. I know Leary and Swansea are, you know, kind of in a shuffle, but do Dutcher Candi CdeBaca, did you get a chance to talk to any of those folks?'",
        "'speaker_1': 'No.'",
        "'speaker_7': 'Okay. And who did you talk to from Clayton?'",
        "'speaker_2': 'And John Ricky.'",
        "'speaker_7': 'Okay. You know, one of the things I want to get to is, you know, when we talk about rezoning, we talk about some of the values in the neighborhoods. And I just wanted to know, you know, what do you hear from them and what are you looking to apply from those values into your project?'",
        "'speaker_2': 'I guess when we first kind.'",
        "'speaker_11': 'Of started talking about this project, I had actually spoke to you two and a half years ago, probably, and. Kind of one of your thoughts was, well, you know, maybe a little bit of mixed use would be great on that site.'",
        "'speaker_11': 'And from that point, we kind of started going through different discussions with the city of Denver with Tim, and kind of looking at Blueprint Denver. And so from all of what's already been kind of developed on that side, it was determined that because of the that particular street having the industrial use on the other side of that'",
        "'speaker_11': 'street, that to try to step the the neighborhood kind of down, like trying to step it from industrial to residential in one street, wasn't going to work and wasn't going to promote kind of the the. I guess kind of the development that needs to happen in that area with the being so close to the light rail station'",
        "'speaker_11': 'and creating the density and so that the commercial side kind of kind of dissipated where everybody has more.'",
        "'speaker_7': 'Did they speak to you about just attainable housing for affordable housing and trying to, you know, get some of that in the neighborhood, different army levels at all?'",
        "'speaker_11': 'No, they didn't. We did. We did go knocking on all the neighbors doors and on the block. Every one that we talked to seemed to be in favor of having more options for their properties as far as making the neighborhood, as far as making it a little more affordable instead of being single family, you know, by having'",
        "'speaker_11': 'multiple units, we can take the price down. You know, a lot of the prices in Denver have really gotten out of hand. We did talk to John with the Clayton Neighborhood Association and he said he only got positive feedback, no opposition and he posted it on their Facebook page a couple of times.'",
        "'speaker_7': 'I don't know. Okay, great. Just last question. Thank you, Mr. President. Would you guys be open to having a larger conversation with some, you know, should this go through with other neighborhood leaders? What kind of vision of the neighborhood, what the neighborhood is looking for?'",
        "'speaker_7': 'Mm hmm. That's kind of some of the the meat of why we asked folks to meet with the neighbors.'",
        "'speaker_11': 'And I think we sent some emails out. You know, I. I live in Whittier, so I get it. Like, I don't want to see the neighborhoods go away, you know, totally lose their character and culture and that sort of thing.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilman Espinosa.'",
        "'speaker_7': 'Yeah. And I apologize, Mike. My option isn't there to chime in. So to the owners, are you familiar with the garden court for. Either. It is fine. I know. I know you are. I'm asking these guys, the developers.'",
        "'speaker_1': 'But we need you to come up to the podium.'",
        "'speaker_11': 'Not so mean. I can't describe it to you right now, but I know that there's different forms of building structures that are all part of this particular zoning.'",
        "'speaker_7': 'And how does the garden court form deviate from a row house form? And I apologize to my colleagues. I this was the one plan committee that I missed. And there's important information in these questions.'",
        "'speaker_11': 'So I just first. Are you saying like garden court as far as. The structure surrounding kind of a center area. Yeah. Yeah. I mean, the site provides for the potential for that. Okay.'",
        "'speaker_7': 'So do you have any sense about how many units you can fit on this development?'",
        "'speaker_11': 'So like we've had some, we've had architects look at it and kind of depending on how it would lay out somewhere between 12 and 14.'",
        "'speaker_7': 'Interesting. Okay. So thank you for that, Tim. If they were to phase this project in such a way that they developed row houses on 41st and 40th avenues, would that then move the the the primary street set back so that any infill between those would now go to the five foot side setback.'",
        "'speaker_11': 'I'm going to pull up a map, councilman, if I may, and refer to that. So you referenced 40th and 41st, correct?'",
        "'speaker_7': 'So if they oriented low housing to those streets. Then their five foot side setback would be the north south street, which. I'm sorry. Let me bring it up. Oops. What is that? Cook Street. So the Cook Street has a primary street set in a block since street set back, which is considerably more than five feet.'",
        "'speaker_7': 'But if they were, since this is a RH three, I mean, RH two and a half, they could then redevelop a portion on the north side, in the south side of the assemblage, so that it was oriented both to the south and to the north in a five foot side setback would then be on Cook Street.'",
        "'speaker_7': 'And then a primary if they were to remove the houses in between a primary, I mean, a block since the setback at that point would be five feet.'",
        "'speaker_11': 'So my understanding is that in. Site plan review. They would be under rules of measurement. Section 13 adult.'",
        "'speaker_7': 'Primary would be.'",
        "'speaker_11': 'Primary to primary yes. Being Cook St and likely then for their particular holdings. 39th being a side street then yes, five street. And then Cook Street would be a context sensitive step back 20 feet, or they would look at the general set back of structures along Cook Street and take the average of those.'",
        "'speaker_7': 'So my hearing with 100% confidence that Cooke Street the front that mean the setback for any developed redevelopment of the site under this proposed zoning would be consistent with the street the front setback that we see today.'",
        "'speaker_11': 'That's the intent and the guidance in the code.'",
        "'speaker_7': 'I understand that. But you can develop. We had this conversation about some GMU three down in Curtis Park where that we were going to create new blocks since me, new C-Max on the corners, which would then allow zero set back.'",
        "'speaker_7': 'And as a result the new GM, the existing GM U three moves that set back up several feet closer to the curve. And so there is a development scheme here that would actually alter what is now considered block sensitive if they phased it in such a way.'",
        "'speaker_7': 'I'm just making sure that that can't happen. What happened in another place can't happen here. Okay.'",
        "'speaker_11': 'So what I can definitively respond with tonight is that for the Rowhouse building form.'",
        "'speaker_7': 'I get the real hospitals when I'm.'",
        "'speaker_11': 'Talking in garden court that yes, a block sensitive setback is required and where it does not apply, which will be determined by development services under site plan review be a 20 foot setback would apply.'",
        "'speaker_7': 'Okay. So what I want my colleagues to know is that in his in what Tim said specifically he mentioned in his presentation was, well, we talked a lot about the rowhouse form. He specifically mentioned garden court. And the garden court is not a row house form, but it is allowed in the RH 22.5.'",
        "'speaker_7': 'And so when I want to get back to is what is the specific language of the code here in section 5.2. Point to point to specific intent in. Row House 2.5 urh2 point 5urh 2.5 is a multi-unit district that allows up to two and a half storey rowhouse building, for it also allows the urban house, the detached'",
        "'speaker_7': 'accessory dwelling unit, the duplex and the tandem house building forms. There's no mention in the specific intent of a garden court, but it is allowed. And so why I'm telling you this is that. There are development schemes on here that are significantly more dense than a row house form and they mentioned the garden court.'",
        "'speaker_7': 'The developers familiar with the garden court. And this is a designated area of stability. You've seen the neighborhood plan images there, nothing at all like the density of a row house and certainly nothing at all like the density of the of the garden court, which would allow considerably more density if you start making those developments perpendicular to'",
        "'speaker_7': 'the street rather than horizontal. So I get that if they were to just blanket come in with a single block proposal today, that they would be restricted by the block since the setback. But there are development schemes here that could actually alter that and there are no protections.'",
        "'speaker_7': 'And so that is a loss of eight potentially affordable units with a development scheme that is far more dense, potentially, and with no commitment to affordability in an area of stability. So I just wanted to say that.'",
        "'speaker_11': 'Councilman, if I may, the primary building form standard section 5.3.3 does list the garden court as one of the allowable building for rent.'",
        "'speaker_7': 'That's exactly what I'm talking about. Okay.'",
        "'speaker_1': 'And thank you. All right. Thank you, Councilman. Another questions, Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. First, I want to ask a question of the proposed developer. One of you two, if you wouldn't mind coming to the microphone. So do you own the entire half block today?'",
        "'speaker_11': 'We have.'",
        "'speaker_5': 'All the property.'",
        "'speaker_11': 'From 39th on the corner of 39th and.'",
        "'speaker_5': 'Just to the first square here.'",
        "'speaker_2': 'Well, there's no there's.'",
        "'speaker_11': 'It's basically 28,000 square feet worth of a lot. So it's I would say it's probably the first third of the block.'",
        "'speaker_5': 'But what we're doing is we're being asked to rezone the entire half block.'",
        "'speaker_2': 'That was the requirement.'",
        "'speaker_11': 'To rezone the whole front facing of the block. So we yes, we own the in the yellow from 39th. If you go all the way up to there's like a little white beach. Yeah. Right where that garage and then the yellow line cuts off there.'",
        "'speaker_11': 'So I guess maybe just a little more than a third of it.'",
        "'speaker_5': 'Okay. And in are you are you all trying to purchase the other properties to do this development or your intention is only to do within that four square in the yellow?'",
        "'speaker_11': 'Yeah, our intentions are to work within that square.'",
        "'speaker_5': 'Okay. So I don't understand why the city made you. Three zone, the whole half block. That makes no sense to me. And you want to speak to that.'",
        "'speaker_11': 'Yes. So there are minimum area requirements for certain zone districts. And in this particular case, you RH 2.5 requires. Either a certain minimum acreage, which is either two or four acres or a block phase. I think the intent is to apply the zone district in context of a block and not necessarily a smaller site by site basis'",
        "'speaker_5': '. And so the other property owners were completely on board with having their properties zoned.'",
        "'speaker_11': 'The applicant acquired signatures representing 58% of the ownership of that block face.'",
        "'speaker_5': 'And does that include them? As the property owner?'",
        "'speaker_11': 'Yes, the 58% includes property owners plus additional property owners. And you can speak to your conversations with the residents that you saw, their property owners that you saw signatures from. Of all the property owners we talked to, we're in favor of it.'",
        "'speaker_11': 'We went door knocking a few different times. Sometimes you would get a husband who wasn't on the deed or a wife or was or. So everyone that we talked to, we got a signature from. And you know, once we.'",
        "'speaker_5': 'How many properties is that of the total?'",
        "'speaker_11': 'Probably us plus I think maybe for three or four.'",
        "'speaker_5': 'Okay. So there's three or four of the seven properties that are on here that do not include yours.'",
        "'speaker_11': 'Yeah.'",
        "'speaker_5': 'Okay.'",
        "'speaker_11': 'Now there's three. Yeah, there's several properties. Now they have more options.'",
        "'speaker_5': 'Okay, so. Tim, I want to get back to asking you a question about a statement you made that they can sell off a portion of the lot. Now, is that only allowed in this particular zone district? And just help me just understand that.'",
        "'speaker_11': 'So that's related to the tandem house building form, which is very similar to accessory dwelling unit. The difference being that you could sell a tandem home, but you cannot sell an accessory dwelling unit, you must rent out the accessory dwelling unit.'",
        "'speaker_11': 'So that's an A. So under you RH 2.5 zoning, you could build an accessory dwelling unit and rent it out, or you could build a tandem house behind your existing house and rent it out or sell it. So those are additional options available to these existing homeowners should this.'",
        "'speaker_5': 'So so when it's zoned, does it have to be split up into two separate zone lots on each parcel?'",
        "'speaker_11': 'I don't know the zone lot requirements. I would have to get back to you on the.'",
        "'speaker_5': 'I'm asking this because I worked with a woman in the Highland neighborhood who had a carriage lot in her back yard that was used for a commercial purpose. And she was told she could sell it. And when she tried to sell it, she was told that she had to rezone it as a separate zone lot.'",
        "'speaker_11': 'I said, you know, district that applied to that property.'",
        "'speaker_5': 'I do not. I'd have to go back to getting.'",
        "'speaker_11': 'An understanding.'",
        "'speaker_5': 'That it's in the lower highlands neighborhood. So that helps you.'",
        "'speaker_11': 'With if it was a two unit zoning or row house, then it would seem that that option should be available. If it was single family, then no would not necessarily be an option.'",
        "'speaker_5': 'Okay. I was just trying to understand how that would work for somebody that wanted to buy a unit and might then find out later that they need to rezone it to to have separate legal, you know, definition for for the property they're purchasing if they're buying one of those tandem units.'",
        "'speaker_11': 'Okay.'",
        "'speaker_5': 'So. Do you know whether they would be required to do that?'",
        "'speaker_11': 'I do know the tandem house building form is allowed under you RH 2.5 zoning and it allows for multiple ownership of two structures on one's own. Got it. So exactly what I would be purchasing if I was purchasing a rear front unit, whether I'm purchasing the building only with.'",
        "'speaker_11': 'The right to reside on his own on buying a piece of property. I don't know the mechanics of that. But I'd be happy to get back with you.'",
        "'speaker_5': 'That would be helpful. I have no further questions, Mr. President. Thank you.'",
        "'speaker_1': 'Councilman. I take it. Councilman Flynn.'",
        "'speaker_4': 'Thank you, Mr. President. Councilwoman Ortega got at what I was going to ask would if I could explore that a little further. I'm somewhat uncomfortable changing the zoning on someone else's property where they might not know about it.'",
        "'speaker_4': 'The the applicants have indicated that they have 58% of the of the frontage I imagine ownership representing that they've approved or they they approve of this change. That leaves 42%, if my math is correct. I know I got a head cold here.'",
        "'speaker_4': 'I'm having trouble with math. But as 42% of the owners are seven other properties on that block, some of which are houses that were just built three years ago that are being impacted by this change. So I'm a little uncomfortable being asked to consider changing their zoning if they might not be aware of it.'",
        "'speaker_4': 'Is there anything in our code or our procedures that requires when we rezone, when we require a full block face to be resolved, such as this rowhouse zoning that we have to obtain registered mail, or we have to make sure that the owners of those properties I literally know that we're changing our zoning.'",
        "'speaker_11': 'So the requirement is that at least 51 signatures representing at least 51% of the area to be resolved are on the application, in which case they exceeded that by 7%.'",
        "'speaker_2': 'Right.'",
        "'speaker_11': 'And then the door knocking that and of course, the signage which was posted on Cooke Street, 40th Avenue and 39th Avenue for 15 days prior to the planning board hearing and 21 days prior to this hearing. Okay.'",
        "'speaker_4': 'And the owners indicated that of those they spoke to, they all approve. Can I ask one of you to tell me whether you spoke to all of the owners or because you said all the owners we spoke to approved of it?'",
        "'speaker_4': 'That begs the question.'",
        "'speaker_11': 'Some we ended up speaking to via phone because we were over the 51%.'",
        "'speaker_4': 'We didn't bother you didn't need their signature.'",
        "'speaker_11': 'But yeah, we didn't get their signature. But every single one we had spoke to, either the husband or the wife or one person, the head of household gave our numbers out, asked for any further questions that they may have about it.'",
        "'speaker_11': 'But every we did speak to every single person on that. Okay. Whether it be, you know, by phone or by by face to face meeting.'",
        "'speaker_4': 'That's good to know. Thank you. That's all, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Flynn, Councilman Cashman.'",
        "'speaker_10': 'Thank you, Mr. President. Again, for the developers wondering if I realize where rezoning a piece of land and not a particular project. But I'm wondering if you can envision at this point how large these units might be and what kind of price point you're envisioning.'",
        "'speaker_11': 'From what we've looked at. We've looked at units that would be two and a half stories. That would be somewhere around 13 to 1450 square feet each, kind of. Basically. Then as far as they'd all have backyards, they'd all have garages, and they would have a price point of somewhere around 350.'",
        "'speaker_11': '300, depending on where they are in the block, 300 to 350.'",
        "'speaker_10': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Cashman and Councilman Gilmore.'",
        "'speaker_5': 'Thank you, Mr. President.'",
        "'speaker_6': 'I guess this would be for the property owners.'",
        "'speaker_5': 'So you answered part of my question, I about the units having garages.'",
        "'speaker_6': 'Are they one.'",
        "'speaker_5': 'Or two car garages?'",
        "'speaker_11': 'We haven't totally. Yeah, we haven't gotten that far yet. I think some would be two and some would be one, but it's just going to be a space layout on the how they're going to be. So yeah, I think it'll pretty much be some two in someone.'",
        "'speaker_11': 'Okay.'",
        "'speaker_5': 'And that leads me to my next question, where the property owners.'",
        "'speaker_9': 'That that you spoke with.'",
        "'speaker_5': 'Even if you didn't need their signature, were there concerns about.'",
        "'speaker_6': 'Street parking.'",
        "'speaker_5': 'Or added traffic? I mean, ideally we'd have folks, you know, taking transit, but that doesn't always happen. And so were there concerns from.'",
        "'speaker_6': 'The other property.'",
        "'speaker_11': 'Owners? No, there wasn't. You can see from that picture how few cars are on either of the two sides of those streets. So I don't think that has ever been much of a concern on that particular block anyway.'",
        "'speaker_11': 'But no, that was never a a concern from any of them.'",
        "'speaker_5': 'Okay. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. You know the questions. 0001. Mm hmm. CNN public hearing is now closed. Time for comments, Councilman Brooks.'",
        "'speaker_7': 'Thank you, Mr. President. I you know, I said I want the you know, first of all, this is in the Clayton neighborhood. This isn't in Elyria, Swansea. And one of the reasons it was in response to a plan is because Clayton does not have a small area plan.'",
        "'speaker_7': 'And so to simply be here's another neighborhood that is looking for a small area plan because there's a lot of stuff going on in Clayton. I've heard it from their neighborhood president and also their community. So I appreciate the I didn't want to give off as if they didn't meet with the correct president because you did.'",
        "'speaker_7': 'And John Rickey, although he has stepped down, they have a new president. But. I would love number one for those other neighbors to be contacted about what's going on. And also for you to understand a little bit about what the neighborhood is envisioning in their values so that we can see what we can do with the property'",
        "'speaker_7': '. So some site design, all that kind of stuff. I'd love to do that with the community just for a little, just to orient people to this part of the city. This is at 40th and Colorado, the type of developments that are going in there.'",
        "'speaker_7': 'We just we just did a 100 and 120 0 to 30% am-I homeless housing right there on the corner. One of the best units, best developments that I've seen in a long time from Colorado Coalition for the Homeless.'",
        "'speaker_7': 'Catty corner behind the retail is 160 workforce housing units. Beautiful, just gone up behind that is some more workforce housing units, too. So this corner is is seeing a diverse level of investment in affordable housing. So I'm happy about that.'",
        "'speaker_7': 'I would love for the property owner to look at ways to making this affordable. I think $300,000 in this neighborhood, new construction is going for $500,000. So it's attainable, you know, when you look at the whole neighborhood. But to start looking at affordable, subsidized housing in that sense, I would love to have a conversation with you all'",
        "'speaker_7': 'and consider that I'm going to I'm going to go ahead and support this redevelopment. And I hope that we can continue working together with the community. And this is this is going to be a really interesting location because the market lead is going to be a part of the drainage process project in the in the two basin'",
        "'speaker_7': 'that we're going through. And so I think there are a lot of neighbors concerned. I probably got a lot of support because there's a lot of neighbors concern that people are going to want to live in that area.'",
        "'speaker_7': 'And so it's going to be a really interesting area. But I'll be supporting this. It obviously is in line with our adaptive plans and in context. And so I'm in support. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilman Espinosa.'",
        "'speaker_7': 'Yeah, I, I well, I don't believe that you're necessarily intend to develop the half a block as needed to achieve maximum density. However, in an area in an area of stability that that has a smaller you plan that specifically speaks to rowhouse and single family and duplex and then has a vision graph that shows something that is'",
        "'speaker_7': 'far less dense with the tandem house forms. That means that I can't support this rezoning.'",
        "'speaker_1': 'And you can't have another Councilman Cashman.'",
        "'speaker_10': 'Thank you, Mr. President. Just as a matter of general policy, as I understand it is 51% of the landowners need to sign on. And I think you said you have 58 and I'm unclear. And I did listen as to exactly how many people you spoke to and how many responded, if there were questions.'",
        "'speaker_10': 'I just wanted to say that if for me, when we're rezoning, I think it's important to get as as much of a buy in as you possibly can and at least be sure you make that extra effort to talk to all the neighborhoods that are affected by a development.'",
        "'speaker_10': 'And I'm not interested in, you know, 58, 42 range wars, you know, and so I'm just not confident that there was a full outreach on this project. So I just wanted to say that.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Kathryn Lopez.'",
        "'speaker_2': 'Thank you. You know. You know, listening to the back and forth and some of these questions on the council. I mean, I. You know, I'm very familiar with this neighborhood. I know it's pretty active. I know a lot of people feel a lot of pressure regarding gentrification or development, at least some of these areas, especially at the'",
        "'speaker_2': 'price point. What we're looking at, looking to rebuild, I think, you know, as a general practice, I think it's super important that you have that outreach to folks no matter what community. But I was a little surprised that, you know, they didn't really have very lasting or meaningful conversation with some of the neighborhood associations that are there'",
        "'speaker_2': '. And I think that that is a big deal. I know in our area, if we reason, at least we look at rezoning a parcel. I have a whole neighborhood of folks that are coming to the table and thinking about it.'",
        "'speaker_2': 'And here's the thing. I there's nothing to fear with it. I think it's something to be straight forward. Now, I do agree that that I mean yes, that you are requires that 51%, but it also requires that that minimum area coverage.'",
        "'speaker_2': 'Right. And I do believe that that's been met right across the street. I was trying to figure out what that what the what the uses were, but it didn't look residential. This could be a good buffer that you are h is definitely a zone district that can provide that buffer between some of those urban or some of'",
        "'speaker_2': 'those residential ESU type single home properties. And so here's the thing. I I'll see a reluctant support for it because most of the folks that come here in these chambers and that want to see a rezoning, especially at this magnitude, in a neighborhood like this, they've done their due diligence in making sure that people in the neighborhood'",
        "'speaker_2': 'have been outreach to. And it's much more than just knocking on doors and getting signatures and saying, hey, look, we got a lot of these folks on this block to support it, but you really want to get there and engage that community, whether they're for or against it, whether they support or oppose it.'",
        "'speaker_2': 'The matter, the fact is you just at least get to them an outreach to I don't know who the neighborhood association is there, but it was kind of surprising that there had been no conversation with some of those folks.'",
        "'speaker_2': 'So. Anyway. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Lopez. In other comments, Council Bill one. Seen none. Madam Secretary, welcome.'",
        "'speaker_3': 'Brooks Clark. All right. Espinoza. Yeah.'",
        "'speaker_4': 'FLYNN Hi.'",
        "'speaker_3': 'Gilmore. Catherine Carnage. Lopez. I knew Ortega. Sussman Black. Hi, Mr. President.'",
        "'speaker_1': 'Hi, Councilwoman Black. Thank you, Madam Secretary, please close the voting. Now for the results.'",
        "'speaker_3': 'Ten eyes, two names.'",
        "'speaker_1': '11 Lebanese, two nays Council Bill 0001 has passed. All right. We're on two counts, Bill. 39. Councilman, do you please for the council? Bill 39 on the floor.'",
        "'speaker_8': 'Thank you, Mr. President. I move that council bill 39 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. We will wait for technology. It has been moved. He's been moved and seconded. Public hearing on Capitol 39 is now open. May we have a staff report.'",
        "'speaker_5': 'As soon as I can get to my PowerPoint? Okay. So seriously. Sarah representing community planning and development. This is a rezoning of property located approximately 6756 Archer drive from oh one to general excuse me urban context multi-unit five stories and this is in the Lowry Field neighborhood in Council District five.'"
    ],
    "Rezoning of Property at 6756 Archer Dr. from O-1 to G-MU-5.": [
        "'speaker_6': 'So. So for all of those reasons, I'll be very proud to support this tonight. I wish. And my guess is the city of Denver is paying in a subsidy for any of the additional costs of that parking, which is why I care.'",
        "'speaker_6': 'It's great to have more parking than you need. It's just that it's generally the government that's paying for it and it's less that we're not spending in units. So trying to get that match right is challenging, but obviously I'm very supportive in spite of that concern, and I'm glad there's a plan to monitor it closely and be'",
        "'speaker_6': 'thinking about ways to share with other projects. I think that's very innovative. So so thank you and enthusiastic support tonight.'",
        "'speaker_1': 'Thank you, Councilwoman Kenney to Councilman Brooks.'",
        "'speaker_7': 'Yeah. Thank you, Mr. President. My comments would be similar. I want to first support this project. And number two, I think it's a national model around, you know, homeless housing to make sure that sites all over the city and not just focused in one area.'",
        "'speaker_7': 'And I think you guys are serving as a model. I read through some of the letters of support that a community would say, yes, we want an integrated model in our community and which also support is the design elements.'",
        "'speaker_7': 'I mean, you're not going to know which housing is of different incomes. And so just want to really, you know, give you guys a lot of credit and just say thank you for that because that's what we're looking for in this city, is is a city with diverse incomes, you know, a continuum of housing opportunities all over'",
        "'speaker_7': 'the city. So thank you.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. I want to add my comments of support for the project as well, and thank the team of all the players, including the neighborhoods who have been engaged in the conversation for a number of years.'",
        "'speaker_5': 'The one thing I want to mention that hasn't been said is that there are some great schools in this area and the fact that there are two and three bedroom units and we'll have families of children who will go and will be going to school in this neighborhood.'",
        "'speaker_5': 'It's it's going to benefit them tremendously. So kudos to all of you for the great work on this one. Thanks.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega in the comments. Council Bill 39. See none. Madam Secretary.'",
        "'speaker_3': 'Recall Specimen Black by Brooks i clerk by Espinosa.'",
        "'speaker_11': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Gilmore I Cashman can eat Lopez. Hi, new Ortega. I Mr. President.'",
        "'speaker_1': 'Hi. Councilman Flynn. Thank you. We got it. Madam Secretary, please consider the results. 3939. 39 has been placed on final consideration and does pass. All right, we've got one more. And that is Council Bill four zero. Councilman New, would you please put council bill four zero on the floor?'",
        "'speaker_8': 'Thank you, Mr. President. I move the Council Bill four to be placed upon final exploration and defense.'",
        "'speaker_1': 'It has been moved. We need a second. Got it. Thank you. A public hearing for Council Bill four zero is now open. May we have a staff court?'",
        "'speaker_5': 'Theresa may, Sarah with community planning and development. The next rezoning request is at 668 through 670 Inka Street. It is in the Lincoln Park neighborhood in Council District three. One block north of Sixth Avenue. One block east of Santa Fe Drive.'",
        "'speaker_5': 'Four blocks west of the Denver Health Campus and Speer Boulevard. Property is about 12,500 square feet or about a third of an acre, and there is an existing single family structure on the property. The property owner is requesting the rezoning to redevelop a vacant portion of the property.'"
    ],
    "Rezoning of Property at 668-670 N. Inca St. in Council District 3.": [
        "'speaker_5': 'Existing zoning is an old chapter excuse me, 59, and the requested zoning is urban context rowhouse. Three stories from the eight associated with this zone district allows apartment buildings on certain streets, collectors and arterials, which doesn't apply to this site because the both streets on the site are local streets.'",
        "'speaker_5': 'So urban neighborhood context the. Sorry. Multi-unit in. Allowing apartments on collectors on. Mr. Here's my page. Low scale single unit multi-unit, residential and commercial uses embedded in the neighborhood residential structures are urban house rowhouse townhouse structures. Commercial may contain a mixture of uses, single unit and are located on local streets and commercial uses located on mixed use'",
        "'speaker_5': 'and main streets. And again, this Rowhouse three zone district is a three story height limit intended for use in this context and promotes low scale residential uses. So pretty. 144 is the zoning currently single family residence and a vacant portion of the property.'",
        "'speaker_5': 'The current structure is two stories. The party was adopted in 1984 and it was not it was related to uses not building new structures. It was adding use of office and design studio to the residential use. And all of the surrounding zoning of the property is you are age three with the euro three overlay.'",
        "'speaker_5': 'The Euro three overlay is four historic properties that are designated properties and that allows some commercial limited commercial uses in those properties. This property is not designated and would not apply here, but in surrounding properties it would allow office, bed and breakfast and one other use that I have I'd have to look up in the code.'",
        "'speaker_5': 'So again, it's an existing residential use, a single family surrounded by duplex and single family for a fairly residential area. This gives you an idea of the property we're talking about has been altered to a degree. My understanding that the property was originally built as a church and then became a single family house and then the artist's'",
        "'speaker_5': 'studio and all were added. And so there has been some, some mixing abuses in this property and then lower that's on the upper right. Lower right is a commercial structure that's become a residential structure across the alley to the east.'",
        "'speaker_5': 'And then below is the duplex next door. Lower left is a single family house across the street, and then upper left is a townhome apartment across seventh Avenue from the property. So criteria is consistency with adopted plans, uniformity of district regulations, furthering public health, safety and welfare, justifying circumstances and consistency with neighborhood context and zone district purpose'",
        "'speaker_5': 'and intent. Registered neighborhood organizations in the area were notified October 22nd of our receipt of a complete application, as well as council offices, as well as all of the renos, were notified of our planning board hearing on January 6th.'",
        "'speaker_5': 'At that hearing, the Planning Board unanimously voted to recommend the City Council approve this zoning. We did clear planning plan committee on January 20th and the renos notified are the law on the Lincoln Park Neighborhood Association. La Alma Neighborhood Association.'",
        "'speaker_5': 'Denver Arts District on Santa Fe. Santa Fe Redevelopment Corporation. Denver Urban Resident Association. Denver Neighborhood Association and Inner Neighborhood Cooperation. And today we have one letter that's in your packet in opposition to this rezoning. So the plans that are pertinent are comprehensive plan 2000 Blueprint Denver and the Allman Lincoln.'",
        "'speaker_5': 'Lincoln Park Neighborhood Plan adopted in 2010. So current plan to conserve land by promoting infill development. Encourage quality infill development. Identify areas where increased density and new uses are desirable and can be accommodated. Blueprint Denver The land use concept is mixed use, which is higher intensity than other residential areas and an employment base with some with housing'",
        "'speaker_5': 'as well. And it is an area of change. Blueprint Denver Future Street classification. As I said earlier, for both Seventh Avenue and Inca Street, are on designated local streets. So long. The Lincoln Park Neighborhood Plan has a vision set this segment and a framework plan and then subrosa sections.'",
        "'speaker_5': 'So the overall vision was to read to focus redevelopment in three general areas in the neighborhood 10th and Osage Station, the Santa Fe Corridor, and then 13th Avenue, west of Osage. But also the vision statement that applies to this property was stability of existing residential areas, maintaining that stability and within established residential character areas and applying the'",
        "'speaker_5': 'appropriate small light residential zoning to these areas. And it did provide we'll see in a few moments a land use plan and a height of the structures plan for the proposed property. It is 1 to 3 stories in what they call this southern residential neighborhood.'",
        "'speaker_5': 'So this is the land use plan. You can see kind of where there is a red box. At the bottom is the property we're talking about. It is in a area that the plan calls for townhouse development. And then in the building height map, the.'",
        "'speaker_5': 'The orange where our square is, is up to three stories in height. These are the recommendations out of the law in the Lincoln Park neighborhood plan. So this is just to show you those character areas, the two yellow areas are the two residential areas, the southern yellow areas, that southern residential area where the townhome is recommended up'",
        "'speaker_5': 'to three stories. So staff believes that this proposal is consistent with these neighborhood plan recommendations and that by getting out of the poverty and into a standard zone district, we are furthering the uniformity of district regulations. And by implementing the law on the Lincoln Park Neighborhood Plan, we are furthering the public health, safety and welfare justifying circumstances'",
        "'speaker_5': '. Again, the plan or its surrounding environs has changed or is changing to a degree that it's in the public interest to encourage redevelopment or to recognize the changed character of the area. I think that with the on the Lincoln Park plan recommending that we go with townhome in this area, it is favoring the redevelopment of the area'",
        "'speaker_5': 'and acknowledging that the area is going to change. So this is the appropriate justifying circumstance. And we did also talk a little bit about neighborhood context and the zone district purpose and intent. I wanted to say that the plan actually does call for this specific zoned district in this portion of the neighborhood, which is a little unusual'",
        "'speaker_5': 'for an area plan. But that's what we have with this one. And so with that, staff is believing that all of the criteria are met and is recommending approval.'",
        "'speaker_1': 'Thank you. All right. We have four speakers and Alaska. Go ahead and say hi for Tim Pawlenty, Nancy Bachmann, Robert Pacheco and Mr. Saca. So, Mr. Tim, you can make your start and the other three, you'll be right afterwards.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_11': 'Thank you very much. I'm the owner of an architectural firm and it's very small. There's two of us. And what we really focus on is.'",
        "'speaker_1': 'You say your name and introduce yourself. You didn't do that, Tim. Just introduce yourself. I'm sorry.'",
        "'speaker_11': 'Oh, I'm sorry. My name is Tim Politics. I am an architect with one line studio architects representing revision real estate, a sole proprietor who is developing properties and particularly low rent facilities. And so what I will like to talk about is the idea of low rent.'",
        "'speaker_11': 'When I met this individual last summer, I was intrigued by the idea that he wanted to do small apartments, and the idea was that if you could put small apartments in a row home, you make it more attractive.'",
        "'speaker_11': 'And so it's not something that's in an apartment. It's actually a rental unit that has a front porch that addresses the street and is small enough that it becomes affordable and is well below what the average rent is for the area right now.'",
        "'speaker_11': 'So this owners particularly looking to build studios and one bedroom places units. And when we looked at this particular property, what was attractive is that it's got a bus stop right in front of it. It's within a block away from the Santa Fe Arts District.'",
        "'speaker_11': 'It's in a neighborhood that wants to be an area of change and is just a beautiful neighborhood. And when we looked at the existing property, he said to me, How can you make this work with the way it's zoned?'",
        "'speaker_11': 'So we looked at the PD 144 that was approved years ago and discovered that there's a 57 foot foot setback on the North End. There's a 64 foot setback on the East End, just to say a few restrictions that are there.'",
        "'speaker_11': 'Basically, they can't move beyond the existing framework of the existing structure and the property that's at the corner of seventh and anchor is left open. Now, the sad thing is certainly there's many ways to use that, but when you see the townhomes across the street on seventh, when you see the way the corners are treated and this'",
        "'speaker_11': 'allows them a park neighborhood, they're actually really substantial. Every corner, whether it's sixth in Santa Fe, eighth, and anchor of every single street around there, just to name a few. They do something interesting at the corner. And instead this is one block where there's nothing interesting.'",
        "'speaker_11': 'And we said, how can we best go about this? And we started looking at the zoning plans and realizing that it's right there in front of us. This should have been zoned along with the current new zoning to be use today because it's most fitting it allow the consistency of the existing neighborhood to preserve it, to preserve'",
        "'speaker_11': 'all the requirements of that, but yet allow it to be developed so that it is for excuse me, fulfill in that corner the way it should be. We did reach out to the Councilman Lopez before we even submitted and just kind of got the idea about what the process would be.'",
        "'speaker_11': 'We also reached out to the planning agencies and all the neighborhoods did receive a letter, have not received any comment back from them, to be honest with you. And we know that this is in support of them.'",
        "'speaker_1': 'You're 3 minutes is up.'",
        "'speaker_11': 'Oh, I apologize. Thank you very much.'",
        "'speaker_1': 'Nancy Berman.'",
        "'speaker_5': 'So I am against this zoning change. I live right behind the property.'",
        "'speaker_1': 'Do you say your name.'",
        "'speaker_5': 'In Nancy Berman? And I'm against the zoning change. I live right behind the property they're trying to rezone. Nobody in the neighborhood was notified about this at all. We found out by accident about the first meeting and went to it.'",
        "'speaker_5': 'At that time I said something about doing a petition and I was told I was too late for that. They posted a change and I went to get a form and I was told, Oh no, this form is just for petition.'",
        "'speaker_5': 'And I said, Why didn't it see anything on the board? And I was told there was no room for it. I feel like if I had been notified, I could have gone around the know the neighborhood and gotten enough signatures.'",
        "'speaker_5': 'The people in the neighborhood are really upset with the development that's going on all up and down our streets. The houses are being changed to apartments and condos. We feel that the neighborhood has become very dense. There's so much development going on.'",
        "'speaker_5': 'And there's there's just so much happening. There's so much congestion in. And like he said before, there are two bus stops on seventh. There's traffic on sixth. There is so much happening in in. When I went to the meeting before, we were told this is going to be 14 units and it's right there and they want to'",
        "'speaker_5': 'put it right on the street and three storeys high in. And, you know, I'm listening to this lady before talk about higher intensity, increased density, stability of residential areas. I sent a letter to the city council. I don't know if you got a chance to talk about it.'",
        "'speaker_5': 'I went to the meeting with my boyfriend. He's lived there since 1980. I've lived there for ten years. And it is just it's making our heads spin to see the development that's going on. It's incredible. It's happening so fast.'",
        "'speaker_5': 'And I don't know why this property that has a little bit of grass on it. It's just overwhelming to me. I'm just here to say that I. I feel like everything that is coming up is being rezoned and being developed for I mean, less than half a mile away, there's this huge apartment complex at 11th and Galloping'",
        "'speaker_5': 'Eagle with hundreds of units. And everywhere I look, there are apartments and condos and everything. And I feel like now it's happening right behind me. And to get into this parking lot for this condo or whatever it is, is going to be right between our garage and the one right next door to us.'",
        "'speaker_5': 'The alley can handle all the parking. Right now, we can't get out of the alley on six. We can't get down on seventh. There is so much going on in our neighborhood. It is jam packed. It is really jam packed.'",
        "'speaker_5': 'And I just wish that somebody from the city council would just come and walk the neighborhood. It is just so dense right now. I just I don't know. I just feel like this is not a good idea for this is part of our neighborhood.'",
        "'speaker_1': 'You 3 minutes are up now. Thank you. Robert Pacheco.'",
        "'speaker_0': 'My name is Robert George Pacheco, and I've been a resident in that neighborhood and I live right across the alley from this proposal. And I've been there since 1969. And then I was down three more blizzards since 1956.'",
        "'speaker_0': 'So the neighborhood is changing way too fast. That alley that we're we're dealing with my back alley. My garage is the garage recessed out to the alley in that whole block. And his property, the property they're talking about.'",
        "'speaker_0': 'I'm constantly painting their fences because people graffiti the hell out of it, you know? And the kids, they get out of school across the street from Del Pueblo Elementary. Now it's a girls school and there's a nice grass field there now because I took out BLOCK Grant and had been put in since I've been out and about'",
        "'speaker_0': 'in the neighborhood. I'm a neighborhood watch captain also, and I make it a point to meet everybody that moves into the block. And I know everybody firsthand who lives on that whole block. And I've never met this young man, the architect, and never even met the new owner that bought the property that we're talking about, as a'",
        "'speaker_0': 'matter of fact, that you keep on saying that it's a residential property. That house that's sitting there now, houses over eight people is more than 12. People living in it are not residential. There's only one kitchen in that house and they all share a kitchen about that's what sits there now.'",
        "'speaker_0': 'And I think it's supposed to be designated a historic little house or church, whatever it used to be, but technically it never has been. And the person who sold it actually hasn't even got paid for his property yet.'",
        "'speaker_0': 'So we're talking about building something that's three stories tall that you're going to sit there. Are you going to block our view to the mountains? We're really getting sandwiched in between Denver Health and Sixth Avenue. This way, this way and this way.'",
        "'speaker_0': 'And we're going to have more houses coming up on the block that he's talked about on that corner. The block around the next corner, they're going to knock down a auto place that was there and a house and a lot they want to put other units in there.'",
        "'speaker_0': 'The kids are ready. Cross the street. They're almost there. So much for they don't even want to go to drop their kids off on galloping hill street. And they it's it's a tragedy. Every morning I will walk my dogs out there and, you know, they just there ain't no where to put a car.'",
        "'speaker_0': 'And there are two bus stops, one on this side and one on this side and everything. They seem to come at the same time. And I got hit once by a bus out my door, ripped my door on the car in front of Gilbert.'",
        "'speaker_0': 'So there really is no parking. And what is he going to put parking on this property? Is he going underground? I have AC mentioned somebody had sent a letter I've never received nor that I live right across the alley from.'",
        "'speaker_0': 'Ain't nobody in that block ever received a letter. What they was going to build on the problem. What they proposed to build on that property. And I can't see it does not conform with the units that are on that block right now.'",
        "'speaker_0': 'There is not one single three story unit on that block. And he's talking to row houses. And I can't envision it. I don't see no pictures of it, but I can see it in the mind what it is, because I work on buildings.'",
        "'speaker_0': 'I worked on the Mile High State, I worked on a few buildings around here, the Buell on right up on Broadway. So I know that there are plenty of housing in the state.'",
        "'speaker_1': 'Mr..'",
        "'speaker_0': 'Pacheco It would be nice if it was just single housing.'",
        "'speaker_1': 'You're 3 minutes away. Thank you, sir. Mr. SEC, you.'",
        "'speaker_4': 'Yeah. We at the Black Star Action Movement support Nancy.'",
        "'speaker_1': 'Mr. Speaker, could you say your name, please, sir?'",
        "'speaker_4': 'My name is Chairman Sekou. Black Star Action Movement representing poor. Working for homeless people. The struggle in the city. Is for everyday folks. One thing needing to take back their neighborhood. And the pace of development that's happening. And most of these paradigms and construction schemes and dreams are coming either out the East Coast, the West Coast, or'",
        "'speaker_4': 'Chicago. We are none of that. This is Denver, Colorado. This is the wild, wild west. We like room, not density. Room to stretch out. What happened with our political leaders who gave up the vision of the wild, wild west?'",
        "'speaker_4': 'Having room people, having healthy environments and able to breathe, man. You're stacking people up in this thing like slave boats now. And there's nothing healthy about that. Nothing. And there have been studies and all the rest of that that talks about New York City and how uncivilized people are in attitude and all the rest of that.'",
        "'speaker_4': 'And people are snapping at a drop of a dime. And now you want to recreate that here. I was born and raised in Colorado, and I've visited and been to over 40 states in this country. Never had the opportunity of leaving the country because I was too broke.'",
        "'speaker_4': 'To go. And yet what I have seen in this town is abysmal, man. Did you hear what they just said? There was no community engagement in that. When they come to discover the process is already fixed and corrupt and they didn't miss deadlines.'",
        "'speaker_4': 'You're talking about the neighborhood, man. A house is not a home. Our neighborhood homes man bested in that tradition in that. Believe in that. And then you come here outside like a refugee from somewhere else. That none of this is working.'",
        "'speaker_4': 'Where you came from. And you bring that here. And then what will politicians do or trust to say? Who gets? Pockets of these developers who are nothing more than lapdog lackeys of these developers and pushing these things through without neighborhood involvement.'",
        "'speaker_4': 'Put a stop to this. You didn't put this one on hold. This one speaks to the heart of it, like Colonel Dunn. And if you don't smell this and stop this and work on your instincts as human beings, why are we here?'",
        "'speaker_4': 'Why don't we just shut this down? Everybody stop lying about who we are and what we represent. All that campaign material and we the people to do to do all of that and just say who you really represent, because your actions speak louder than your words.'",
        "'speaker_4': 'And it's a bunch of hypocrisy that's going on in this room, except for a couple of people. Mr.. Thank you. Mr..'",
        "'speaker_1': 'Mr.. Sekou. Yeah. Yeah. Three more like your ground. Yeah. 3 minutes is up, Mr. Speaker. That concludes our speakers. Time for questions of members of the Council. Councilman new?'",
        "'speaker_8': 'Yeah. THERESA Yes, of course. Would you like to talk about just the outreach to the community there a little bit? Was there an R.A. that that represented that area? And were they contacted and did you hear from them or.'",
        "'speaker_5': 'No, I didn't hear from them. They were contacted.'",
        "'speaker_8': 'What R.A. is.'",
        "'speaker_5': 'Well, those are that I listed. Let's get back to that slide. Oops. There it is. Well, that's not it. Actually all of these on the Lincoln Park Neighborhood Association, but all my neighborhood association, Denver Arts District on Santa Fe, Santa Fe Redevelopment Corporation, Denver Urban Resident Association, Denver Neighborhood Association and Inter Neighborhood Cooperation.'",
        "'speaker_8': 'So no.'",
        "'speaker_5': 'Residents.'",
        "'speaker_1': 'Ma'am. Ma'am. Ma'am, please. This is a question for councilman.'",
        "'speaker_8': 'No letters of support or opposition for me in either room.'",
        "'speaker_5': 'No letters. No letters at all from any R.A.. Just the letter from Ms.. Berman.'",
        "'speaker_8': 'Thank you. Yes. Which is architecturally. To talk about your outrage. What did you do with that neighborhood and how did you reach out to the residents in that neighborhood?'",
        "'speaker_11': 'We actually we were trying to learn about the process of how to submit for Arizona application. And we were advised by the planning department originally that it's encouraged to go to reach out to the neighborhood associations. They didn't actually mention to go door to door because and particularly they weren't too concerned at the time the representatives, because'",
        "'speaker_11': 'this was changing a zone to match what was the neighboring properties and all sides. So we were actually not encouraged to do that when I presented it to the owner and said, you know, we were encouraged to do this.'",
        "'speaker_11': 'And he said, Well, if we're not required to do that, then let's just get the letters to the associations. And it wasn't our understanding that this being a rezoning application, that it was about getting the neighbors to sign on to it exactly who lived across the street.'",
        "'speaker_11': 'So in that respect, certainly if I were a neighbor, I would want to know what was going on. But that was our understanding that the notification process and the signages and stuff like that were there to do that.'",
        "'speaker_11': 'So that's the level of contact that went out. We did not go door to door or send out any fliers for the reason. Furthermore, we actually don't have any plans in place about what to build on that site, other than the fact that the idea of real homes is desired.'",
        "'speaker_11': 'We've explored possibly how many years could go on there, but a lot of it still has to go through the planning department to figure out what the setbacks, what can happen there. So not knowing what to present exactly, other than the fact we want to rezone to match the neighbors, we didn't go beyond that.'",
        "'speaker_8': 'What size and price range are you talking about from the units that you're thinking about?'",
        "'speaker_11': 'Just I actually the size of the units would be in the realm of about 4 to 700 square feet is what they were looking at. They would even go less but does get into micro apartments and they're becoming difficult issues and we're not looking at that.'",
        "'speaker_11': 'So that sort of thing, the price point is below. I don't recall what the actual average price for a one bedroom is here in Denver, but the numbers that were told to me were several hundred dollars below.'",
        "'speaker_8': 'Historic market rate.'",
        "'speaker_11': 'They are market rate. It's a private it's a private development. They're not using any subsidized housing at this time.'",
        "'speaker_8': 'Any parking plans for the site.'",
        "'speaker_11': 'Do not have any parking plans yet other than the fact that we were going to follow the Denver zoning code, which at this current time is one parking space per stall and it doesn't take any considerations for transit and all the other potential, I guess, deductions for those things.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman there, councilman espinosa.'",
        "'speaker_7': 'Teresa the so currently and in the future neither street that this borders is in collector or arterial streets. The apartment form is not available to this parcel. Correct?'",
        "'speaker_5': 'Correct.'",
        "'speaker_7': 'Good. The. Uh. Once again confirm what we already know. There is no required notification of immediate neighbors and no. Okay. Um.'",
        "'speaker_5': 'Although the signs on the property usually notify immediate neighbors just saying.'",
        "'speaker_7': 'Yeah, that's it. Thank you.'",
        "'speaker_5': 'That's it. Yeah.'",
        "'speaker_1': 'Thank you, Councilman Noser. Councilman Flynn.'",
        "'speaker_4': 'Thank you, Mr. President. Theresa, maybe you can. I'm a little bit confused, and maybe I missed something on the Cook Street rezoning that we did to Tyrone Urban Dash Rowhouse. They were required to do an entire block face, and here they're not.'",
        "'speaker_5': 'Is that because they're. Because they're directly adjacent to the same zone district that they're applying for? They are not required to do that.'",
        "'speaker_4': 'They're directly adjacent to.'",
        "'speaker_5': 'The you are three.'",
        "'speaker_4': 'Okay.'",
        "'speaker_5': 'And so in calculating the area to be reasoned, we count the RH three adjacent as part of that. And so we don't require that two acres or one block face. Okay.'",
        "'speaker_4': 'Thank you. That's all.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Kathryn Lopez.'",
        "'speaker_2': 'Yes, sir. Historic preservation of historic buildings or anything historic on that side or adjacent.'",
        "'speaker_5': 'So I had a conversation with our landmark staff. There has not been an application to designate this property, even though it was built in the 1880s, and there's not been an application to demolish the property either. So when I tried to push a little further and say, well, with the property be eligible for designation, they thought that'",
        "'speaker_5': 'it had been altered so much that maybe not, but they needed to do the research and they haven't done that.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_5': 'I'd like to ask the architect that.'",
        "'speaker_0': 'But.'",
        "'speaker_5': 'Tim, can you tell us? Based on the 12,500 square feet and considering what the set back requirements would be, how many units could realistically be put on this site, given your estimation of 4 to 700 square foot units?'",
        "'speaker_11': 'That's actually something that's challenging because we initially there's there's all sorts of rules about blocks, sense of setback. And so we were trying to figure out if we applied for those, because some of the neighboring properties actually have buildings closer to the street.'",
        "'speaker_11': 'And that actually makes a difference because when you have to consider parking, parking stalls and buildings. But we were the latest we looked at it was somewhere between seven over seven is where it was. It could totally fit on there.'",
        "'speaker_11': 'I don't I think you would struggle as you get to the teens to really make it work. I'm not saying it's impossible. We are very creative in the way we try to do things, but the idea is that it has to work as a solution, integrated both to the street, to the neighborhood, parking, the whole thing.'",
        "'speaker_11': 'It's not about how many units you can get, it's about how many living residences can you get.'",
        "'speaker_5': 'And is this proposed to be an apartment? Building. I mean, help me understand.'",
        "'speaker_11': 'It's the zoning district.'",
        "'speaker_5': 'Sale or rental development.'",
        "'speaker_11': 'There for a rental. Could they be converted in the future to sale? It's quite possible. I don't know that the regulation in Denver currently is favorable for that, but if rental is what I've been told and that these are townhomes, so they're side by side units.'",
        "'speaker_11': 'But this Denver zoning code does not allow them to be stacked in any way. They have to be separated and there is a requirement that they can only be two stories at the front street and they step back where they are beyond the view of the street, where they can go up to what they call the 2.5'",
        "'speaker_11': 'story, which is a limited third story unit. The urh3a specifically wants ro homes. And that's why the matching of the existing ro home district next to it.'",
        "'speaker_5': 'Okay. So just factoring in seven units. What is the requirement for parking in this area? Theresa, if you can answer this, please. One unit per one parking space per unit. So they'd have to be able to fit 77 parking spaces on the site.'",
        "'speaker_5': 'Yes. While trying to squeeze in seven units on a 12,500 square foot lot. Yes. Okay. Thank you. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Ortega. Councilman, this motion a piggy leapfrog you get the councilman clark had that chance to ask a question yet. Councilman Clark.'",
        "'speaker_2': 'Thank you, Mr. President. To serve another question, I'm looking at Slide eight in my deck. It's the existing contact zoning. And then I also pulled up the Denver zoning map. So this this is really an island surrounded by this zoning on all sides, correct?'",
        "'speaker_2': 'Yes.'",
        "'speaker_5': 'So where minus the overlay, the you are three.'",
        "'speaker_2': 'But in terms of the the kind of food that could be built here. Yes. Okay. And so the the block that the neighbors who have come tonight to to talk are is on is already zoned exactly the same as what is being proposed.'",
        "'speaker_2': 'This site would be, in.'",
        "'speaker_4': 'Fact, that entire.'",
        "'speaker_2': 'Block, it looks like in and most of the adjacent are either zoned that or even higher. It looks like if you get a half block to the west, then the density gets even higher.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'That's correct. Okay. Thank you very much. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Clark. Councilman Espinosa, you back up?'",
        "'speaker_7': 'Yeah. So this is sort of related to that. Councilman Flynn asked the question about minimum area. And the the reason why we have the minimum area so we don't get in the business of doing spot zoning, even though that's sort of effectively what we had just approved was a spot zoning, but by creating a giant area.'",
        "'speaker_7': 'That's also sort of a problem in that. And I'm actually working and I'm in discussions with others and hopefully you guys are too about whether that minimum area is really doing what it needs to do or is it capturing areas that don't need to be captured in order to bring forth projects that are meaningful.'",
        "'speaker_7': 'QUESTION For the one of the to the the Miss Cook is it I'm sorry.'",
        "'speaker_4': 'Herman Berman.'",
        "'speaker_7': 'Yeah. So are you aware that the question that I asked Theresa before about the the street classification restricts you? What, like what's going on at 11th and gallop go can't happen at this location because it's constrained by the street classification.'",
        "'speaker_5': 'I'm sorry, could you repeat that? Because I was talking to her.'",
        "'speaker_7': 'So it's kind of a nuanced question, but what's going on in 11th in Gallup, go Galapagos goes considered a collector street. That's a different category of street than the two that bordered this property. And therefore, you can't put that same apartment form here.'",
        "'speaker_7': 'You were restricted to this row house, the which is what he was describing.'",
        "'speaker_5': 'Right. I understand that. I brought that up because I was saying there are so many apartments we're surrounded by apartments and condos in in the people who live right there don't understand why the zoning is being changed to bring in any more.'",
        "'speaker_5': 'I know on that side of Inka there are condos, but across the street there are houses, homes in. Across the street there are apartments. But right across the street on Galapagos, there are homes.'",
        "'speaker_7': 'And then do you also realize what Councilman Clarke is saying, that actually all of the adjacent property in north, south, east and west of this parcel is the exact same zoned district that is being proposed.'",
        "'speaker_5': 'Yes. And I think if I'm I don't know because I don't know a lot about zoning. Santa Fe is very dense because of all the art galleries. So I am I assuming correctly that that's zoned that way and it carries it on to our streets because of that?'",
        "'speaker_7': 'Yes. It goes all the way to goes to Mid-Block between India and Santa Fe.'",
        "'speaker_5': 'Right. So I'm assuming because we live so close to Santa Fe that that zoning carries over on to our residential streets.'",
        "'speaker_7': 'Yeah. So what you're going to if fortunately you don't follow this this forum and all of the different meetings, what you're going to find is no fan of the disconnect between existing fabric and context based zoning. But you're going to hear in my comments an explanation on why I'm going to go where I'm going to go with'",
        "'speaker_7': 'this zoning. And I feel for you. But but there there are within the constraints of our zoning code, the way it's written today, there are significant protections, particularly for this block relative to the context. And I can't believe.'",
        "'speaker_5': 'Right. But my concern is as a homeowner, it is so dense there right now, there's so much congestion and traffic and and the streets are loaded up all day long. We can't get up and down sixth or seventh or eighth or people from the hospital are parking already and galloping go.'",
        "'speaker_5': 'Inka is packed in for the city council. I understand because of zoning changes, the zoning is there already. But as you change this zoning and make these properties able to change it from a from a home to a condo or an apartment or a row house, it just keeps building up and building up.'",
        "'speaker_5': 'And you don't live there. But we do. And it's the biggest it it's just jam packed and it's so hard to live there. And I'm just asking for your consideration to maybe not do it to one little corner of this part of the community.'",
        "'speaker_5': 'It's just crazy to live there now. It really is. And I feel like if I had had the opportunity to do a petition and you could have seen how many signatures I would have gotten. There are a lot of Spanish speaking people there.'",
        "'speaker_5': 'There are a lot of working people or they would have been here.'",
        "'speaker_6': 'I'm. Oh.'",
        "'speaker_5': 'I'm just very frustrated. I understand what you're saying, and I know that it's open to the zoning change. I understand that. But as a homeowner and my boyfriend is out of the state now, but he's been there since 1980 and my neighbor has grown up there.'",
        "'speaker_7': 'But it's.'",
        "'speaker_5': 'What these.'",
        "'speaker_7': 'And I was going to reserve all this for comments and oh, they don't mind. But unfortunately, in our role in this, in reviewing these things, every single element that has to stack up in support of a rezoning does and and where this even breaking you know I still feel that this we break down in our notification process'",
        "'speaker_7': 'and I've already got conversations with Kyle in and will with Theresa on how we can fix that. Even notifying you and giving you the heads up that this is going to happen doesn't change the fact that there is plan support at every single level and that you're surrounded.'",
        "'speaker_7': 'This is an island in a zone district.'",
        "'speaker_5': 'So what can you do as a homeowner? I mean, when you know, I mean, we own six, six, seven and six, seven, one, two, we just watch it grow up around us and walk everywhere. I mean, what do you do as a resident of Denver.'",
        "'speaker_1': 'Ma'am? I paused. Someone there?'",
        "'speaker_5': 'Oh, I'm sorry.'",
        "'speaker_1': 'I think other councilmembers might address some of your concerns there in the comments. I.'",
        "'speaker_5': 'I believe so. I just is just thinking.'",
        "'speaker_1': 'And the questions come from Espinosa.'",
        "'speaker_7': 'Oh, no, sorry. Thank you, Councilman Flynn.'",
        "'speaker_4': 'Thank you, Mr. President. Tries to get you to give me a little bit, maybe one minute, if it's possible. Understanding as to why this neighborhood was in the 2010 was reason to row house when most of it, as I've driven through it over the years, is single family bungalow.'",
        "'speaker_4': 'So how did this come to be Row Rowhouse three story in the first place?'",
        "'speaker_5': 'I didn't work on this neighborhood. I believe it was. It was our two zoning, which was the multi-unit zoning that was prevalent in a lot of Denver and. That's as much as I can tell you. I honestly did not work on the zoning in this section of the city.'",
        "'speaker_5': 'And I don't know. Kyle, did you work on this portion of the city?'",
        "'speaker_4': 'Can you address like. So this neighborhood has been set up for for many, many years for densification.'",
        "'speaker_2': 'To which close it is.'",
        "'speaker_4': 'And it just hadn't happened until recently.'",
        "'speaker_7': 'I'm Kyle Dalton with the Department Community Planning and Development. So this area of Zone R three previously, which is multi-unit residential, that's why it has the all three overlay because that's mapped wherever our three used to be. It was zone two yards three eight, because the neighborhood plan immediately proceeded our zoning code effort and it specifically calls'",
        "'speaker_7': 'for UAH three A in the southern residential area as the products of, you know, a couple of years worth of neighborhood outreach and public meetings in the neighborhood specifically to articulate the vision for their neighborhood. So your age three was a little bit of a reduction in entitlement from the former our three zone district under the old'",
        "'speaker_7': 'code, but it directly implemented the recommendation of the adopted plan.'",
        "'speaker_4': 'Thank you very much. That's that clears up very, very nicely. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Flynn, Councilwoman Canete.'",
        "'speaker_6': 'Thank you, Mr. President. May I ask a question of the architect, please? You're definitely not the owner, and I understand that. But are you authorized tonight to make a commitment to this council and to these neighbors that you would be doing an inclusive process in your rest of your design?'",
        "'speaker_6': 'So, for example, can you commit to holding a meeting with the immediate neighborhood and firing them so they know about the meeting to share any ideas as they are developed and to get feedback? Is that something that you can commit to for this owner?'",
        "'speaker_11': 'Truly, I've never had that conversation with the owner so that I don't feel that I could speak for them on that regard. But what I will tell you is after the Planning Commission, we got to meet several of the neighbors last time and they brought up concerns, the first concerns we had ever heard about.'",
        "'speaker_11': 'And so we actually took time after that meeting and listened to the concerns and kind of addressed how we would potentially deal with trash, how we deal with alley improvements so that it would take the traffic, how we would address certain things.'",
        "'speaker_11': 'It would absolutely just kind of comply with those sort of things. So, um, personally, I have a lot of interest in what people have to think and what they say. But I, beyond that, I don't know that I can speak for anybody else at this time.'",
        "'speaker_6': 'May I ask where this owner is located? Are they in Denver?'",
        "'speaker_11': 'Yes, they actually currently reside off of. Actually, they live in Bonnie Brae and have offices off of 22nd and Lafayette. And I was a Denver resident until I couldn't afford to have a family in Denver anyway.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Kennedy. Councilman Lopez.'",
        "'speaker_2': 'Can we have Mr.. Mr. Politi say we want to come up with the and. On the property in the max build out. You said it's probably looking like seven units, definitely not in the teens. Do you know in your conversations with the owner and I'm glad that my colleague asked the question whether you can commit or not'",
        "'speaker_2': '. And I really appreciate your answer. But does it necessarily need to be built out to seven units? Is the owner looking to max out on what can be built there?'",
        "'speaker_11': 'I think that's something that they have to analyze about how they can. There's a number in order to do small units. There's sort of an inefficiency with them because especially when you're dealing with vertical nature and stairs. So there's a certain amount of development that has to happen just to actually afford construction prices today, even if you'",
        "'speaker_11': 'consider the most creative and least costly ways to do that. So what I'd say is, like I said, seven is probably the minimum and it could go into the teens, but there's a limit on that just because there's only so much space on to that.'",
        "'speaker_11': 'Does that answer your question?'",
        "'speaker_2': 'It does. I appreciate that. Thank you.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez. Councilman, New.'",
        "'speaker_8': 'Castle, let me ask you one question with car. Yeah. Just real quick when they went through the zoning process, did this property have the option to come out as opposed to adopt the new zoning?'",
        "'speaker_7': 'I think generally when we we did the Denver zoning code process, which was adopted by council in 2010, of owners of pods like this one approached the city. And, you know, we're actively involved. Some of them chose to voluntarily rezoning to the new code because of the vast numbers of properties in the city.'",
        "'speaker_7': 'The city did not proactively outreach to owners of parties. And so, you know, it's doubtful that they were directly reached out as part of that process.'",
        "'speaker_8': 'Okay. But they could have chosen to opt into the new zone if they had pursued it.'",
        "'speaker_11': 'That's correct.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilman, new councilman, I'll tell you.'",
        "'speaker_5': 'I just wanted to clarify one last question on the parking. So if the developer decides that he wants to squeeze in more units. Teresa, you mentioned that they would be under the code required to have one parking space per unit per 12,500 square feet is not a large block size.'",
        "'speaker_5': 'That's going to limit the number of units. It'll limit the number of units. But does the applicant have the. Oh, it's the right word. I want to use the opportunity to request a waiver as part of the application process as they move forward to do the actual build out.'",
        "'speaker_5': 'Well, I suppose they could go to the Board of Adjustment, but typically.'",
        "'speaker_2': 'Not to be done here.'",
        "'speaker_5': 'If they go there. If it's new construction, it's sort of looked at as well. You're creating your own hardship and just design it differently and meet the standard so it's not received with very much sympathy. But I suppose that is an option.'",
        "'speaker_5': 'Okay. I just I think the parking on this site is absolutely going to restrict how many units can be on there, regardless of the size of the units, whether they're 400 square feet or 700 square feet. But I think the number of units is what will will drive, how many parking spaces are required to provide.'",
        "'speaker_5': 'Right. Well, thank you. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega, you in other questions? 140. Seen in public hearings now closed time for comments. Councilman Lopez.'",
        "'speaker_2': 'Thank you, Mr. President. I represent this area. First of all, let me just thank you both for coming down here and at least for sending that email in to us and the letter in to us, and let's get some kind of response.'",
        "'speaker_2': 'You know, I did meet with the applicant early on. They were very forthright in coming and just kind of let us know what was coming down the pike and just in terms of just changing the pool to be absorbed into the irh that was around the area, you know, to.'",
        "'speaker_2': 'To. The question that Councilman Flynn raised this was the you know, the old R three and it was an area that was designed to go a little higher. But here's the thing. And this is probably my I what my my thinking is at the planning board out there in this neighborhood, you have a lot of 100 year'",
        "'speaker_2': 'old homes. You have a lot. This is one of Denver's original neighborhoods, and you do have a lot of that original build. I don't see a lot of people. They realize the value of those homes and some of the, you know, potential historic designation.'",
        "'speaker_2': 'A lot of those folks aren't going to want to scrape it. Right. So I know that there's a lot of worries in our neighborhoods about it changing drastically and dramatically and seeing a lot of those homes disappear. And there's not not very many of them that do if they haven't been changed or altered, a lot of them'",
        "'speaker_2': 'are existing historic structures. As a matter of fact, in the Lamar Lincoln Park neighborhood, there's a bunch of them. Right. And almost every other door, you knock on it, you know. Mr. Boucek, I really appreciated what you said.'",
        "'speaker_2': 'You had to rock around the neighborhood to really understand it. I do. That's the neighborhood I used to go to school here. I went to West High School and I walked anybody every single day. And even as it's representative, I walk that neighborhood.'",
        "'speaker_2': 'And it is it is definitely changing, but it's definitely something worth keeping. And, you know, if I. If I may really, really push for this. I think it's and this is for the architect as a bullet is if when you have that discussion with the owner great architecture.'",
        "'speaker_2': 'As you know, I'm not an architect, but I learned this just on this diet and also just just learning about it as we go. It great architecture always seems to mimic its surroundings. It always seems to blend in.'",
        "'speaker_2': 'And I know a lot of the heartburn that folks have when they have these great shoeboxes with no patios in the middle of an area that has brick and patios and is charming like these neighborhoods. Right. We don't want to see that kind of and I think a lot of folks in this neighborhood, they react more to'",
        "'speaker_2': 'the architecture than the density. Right. Because it sticks out like a sore thumb and it just does not it doesn't carry the character to as much as possible. You can achieve that with your age here. You can actually achieve that, that that style of architecture as you're building out.'",
        "'speaker_2': 'I don't think it's going to be seven units. I really don't. I think there are parking space requirements are going to definitely force the card in terms of what you can do and what you can't do. And and that property, hopefully we don't max out and hopefully we do include and mimic that architecture in that style, those'",
        "'speaker_2': 'front yards, you know, those those homes that are so close together so that they didn't prevent the horses from running through. Right. Like in the old days. And that's what they were for. And, you know, this is definitely I definitely understand your angst.'",
        "'speaker_2': 'I definitely understand that you see the neighborhood changing all around. However, with this particular area, it's been changed for a long time. Even before our zoning code update in 2010, this was a high density unit area. People could go in and put four and five places in here, even six places.'",
        "'speaker_2': 'So think of how much worse that could have been. And the you are h description, that zone district that do that you are all in is much more strict in terms of what you can build than that are three that are three wreaked havoc in some of our neighborhoods and just west of there in Villa Park in'",
        "'speaker_2': 'Westwood Barnum so you have those four plex is multi units, people are parking in the front, right? I mean they put a concrete pad, it's oil drip slumlords, nobody takes care of it. That's not what's going to happen over here now with this zoning district.'",
        "'speaker_2': 'It actually restricts that. So that's the one thing if that does ease it off is is to your mind a little bit. But, you know, back to back to the architect, Mr. Bullet, I think, you know, you really convene some people if you really get to the owner and say, hey, look, we got to really blend in'",
        "'speaker_2': 'here because it is ownership. It is people like Mr. Pacheco that are walking around their neighborhoods, that are the captains that are going to keep eyes on that property. Right. And that's that's exactly what we try to go for.'",
        "'speaker_2': 'And that's the kind of untold story in the zoning rezonings that says untold benefits when you when you actually work with some of these folks that get it done. Let me see. That last thing I was going to say was that it's a vacant lot now.'",
        "'speaker_2': 'I am not surprised that people tag on that fence and that people don't hit that building up it. When you have vacant lots, when you have vacant property, it attracts so many different things. Right. You don't that's those are multiple lines that are not looking after that property.'",
        "'speaker_2': 'Right. And you want that there. The other opportunity that's there with that beauty is you have a business there. You have a business and you have multiple cars going in and out of there. Right. And there's very I mean, it's it's less restrictive.'",
        "'speaker_2': 'So as the neighborhood changes, I just hope that when we have these applications, that, one, we understand exactly what it does and what it doesn't do. Right. But second, that the architecture and the style and the future, the rezoning hearings, these zoning hearings can't dictate.'",
        "'speaker_2': 'We can't say that you have to have a porch, has to be this color with these kind of trees. We can't do that out here. It's not legal for us to be able to consider that. But hopefully what we can do is just encourage folks mimic that neighborhood.'",
        "'speaker_2': 'Right. There's a reason why these like these neighbors in are here tonight. There's a reason why the houses look the way they do on the West Side. It's that kind of character. It's a reason why it's preserved. Let's mimic it.'",
        "'speaker_2': 'Right. If we can do it in Chicago and I've seen it done in Chicago, we can definitely do it here. So with that, I, I do support this rezoning moving forward. And, and hopefully we can get you information today.'",
        "'speaker_2': 'I'd like to get a hold of those block captains in our neighborhood. So we thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez. Councilman Espinosa.'",
        "'speaker_7': 'So this is actually this is very similar to my comments on the earlier one, but it has. But it has kids, but it's completely different in that my concerns on that prior on the two age rezoning was the ability to create garden court forms in a neighborhood that was clearly destined for CO2 development by plan and by'",
        "'speaker_7': 'everything else. Here is a situation where, again, there's a lot of talk about Row House, but I didn't talk about the fact that, yes, the garden court form this is now one one step above where we were before with the three a in this garden court form is allowed here and it wouldn't take much more property acquisition'",
        "'speaker_7': 'to get and I'm going to get a visual here of a garden court for. So a row house for my colleagues, a row house form implies that these units are facing the street in front setback. That's a garden court form.'",
        "'speaker_7': 'That's a perpendicular non addressing the street sort of thing with a 15 foot slot. So you have what's unique about this on a corner lot is you have a row house that's facing one street and then a garden court next and now you've got three sets of townhouses.'",
        "'speaker_7': 'So here if you want some ideas and that is intrinsically. Not part of the fabric. It's not part of the intent. I read 5.2.2.2 last time. I'm not going to read it to you again, but this is the next line.'",
        "'speaker_7': 'I mean, this is the next section right after that, where once again, on the specific intent of this rowhouse zone district, there is no mention that the desire is a garden court for yet it is in the tate the used to mean the allowable form table, and then it allows this 30 foot high block sense of setback'",
        "'speaker_7': '. But you can then redefine your sensitivity. And that, I believe. What? What we're doing here is a serious issue, which is we're going to reason this to be consistent with the surrounding things. And then all you have to do is acquire the proper amount of square footage, get the right zone lot, and now you can do a'",
        "'speaker_7': 'garden court form that is sort of antithetical to the neighborhood plan. And so it doesn't matter this in this case, everything supports. This zone district. The problem is, is the zone district doesn't support its own intent. But that's a different argument, one that I'm gearing up to have.'",
        "'speaker_7': 'But they just so I will be supporting this rezoning, not because I love it and think it's the greatest thing since sliced bread, but this is one of those cases where all the checks to check box are checked the way they are supposed to mean they're required to be.'",
        "'speaker_7': 'And all the legalese and whatnot point this direction. Usually I'll find a piece of daylight. I don't see a piece of daylight here. And so to the residents that are here, I feel for you. Really do. Thanks.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Councilwoman Black.'",
        "'speaker_6': 'Thank you, Mr. President. I'm going to be very brief. Thank you both for being here tonight. I totally understand your frustrations, and I appreciate your passion and your dedication to be here so late. I did read your letter numerous times and I listened very carefully to you.'",
        "'speaker_6': 'The problem is.'",
        "'speaker_5': 'As I you've been made well.'",
        "'speaker_6': 'Aware, is this little party is an island of the same zoning, and that is actually how your own houses are zoned. So as Rafael Espinosa just pointed out, it does meet all of the required boxes that we need to check off.'",
        "'speaker_6': 'We can't be subjective in these decisions we make and we cannot approve development plans. And a lot of the conversation tonight on all three of the rezonings we talked about, we talked about actual development plans, but that's not what we do.'",
        "'speaker_6': 'We only look at the requirements for the zoning. So I feel for you. I appreciate your passion and thank you for being here.'",
        "'speaker_1': 'Thank you, Councilwoman Black. Councilman Nu.'",
        "'speaker_8': 'I just wish the owner was here to understand his thought process when they. When they were in the rezoning of the whole area of why he decided to stay with the board instead of convert it to the zoning.'",
        "'speaker_8': 'He probably would have saved a lot of hassle tonight. And but in anyway, I sure hope I'd like to echo Councilwoman Canisius. Yeah. Appeal to you to go through a design process, include your neighborhood and discussion about that.'",
        "'speaker_8': 'You know, if if if the owner decides and maybe you decide, it is better to have less units and maybe even a home ownership situation to create a better citizens for that community to create a greater neighborhood. That's great.'",
        "'speaker_8': 'I know I'm talking about development plans from plans from my colleague, but I sure hope that they'll be that you learn the lesson, that you'll be inclusive of what's going on. This zoning goal will occur tonight. But the main thing is you still have an opportunity to bring the neighborhoods together and design and and feel a part'",
        "'speaker_8': 'of that neighborhood. Thank you.'",
        "'speaker_1': 'Thank you, Councilman. New Councilwoman Ortega.'",
        "'speaker_5': 'The only thing I want to add to this conversation is that when the applicant comes back to CPD to move forward with the application, that you carry the message forward, Teresa that we are asking the applicant to work very closely with the immediate neighbors on the design.'",
        "'speaker_5': 'You know, I think you're hearing loud and clear that the zoning changes that were made in 2010 take us out of the process of, you know, defining the number of units, the number of parking spaces, some of the details that this body used to deal with.'",
        "'speaker_5': 'But if we were dealing with the old zoning, as Councilman Lopez said, the R three zoning actually allows higher density in in this neighborhood. And some neighborhoods across the city where they were over zoned have gone through and done overlay zoning to try to, you know, restrict how much development can come in the neighborhood.'",
        "'speaker_5': 'And I understand the concern that when you have a single family block and you now start with allowing, you know, a multifamily development in one lot, you know, then you start seeing some of that effect, as we've seen all over the city.'",
        "'speaker_5': 'But it's all also based on people in the neighborhoods, whether they're willing to sell their properties or not. And, you know, it's it's a slippery slope in terms of, you know, whether people are going to choose to stay in their neighborhood or whether they're going to be enticed by the increasing price of land in this city.'",
        "'speaker_5': 'But as the zoning for this particular site is being requested, it is consistent with the zoning completely surrounding the property. So I will be supporting this tonight as well. We've had many different conversations about the form based zoning and whether the way it is, whether it's working correctly or not.'",
        "'speaker_5': 'And some of these conversations, I believe, will come up as the updated blueprint Denver begins to move forward. I don't know where that process is. It would be helpful to get an update from the Planning Department on how much they're planning to engage city council in that discussion in that process, because I think it's very important for'",
        "'speaker_5': 'us to be involved before we have a final product that gets brought to us to adopt. So thank you much, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Ortega, any other comments? Council Bill four zero. Scene nine. Madam Secretary. Roll call.'",
        "'speaker_3': 'Lopez. I knew Ortega, I. Black Eye Brooks Clark.'",
        "'speaker_2': 'Eye.'",
        "'speaker_3': 'Espinosa Flynn I Gillmor I Cashman Canete. Mr. President.'",
        "'speaker_1': 'Madam Secretary, please cast a vote and as a result.'",
        "'speaker_3': '12 eyes, 12.'",
        "'speaker_1': 'Eyes, four zeroes in place on final consideration and does pass on Monday, March seven, 2016. There's a required public hearing on Council Bill 79 approving service plan for the creation of the West Global Metropolitan District number one in West Global Metropolitan District.'",
        "'speaker_1': 'Number two relating to the development project known as a 2570 development. On Tuesday, March 29, 2016, Council will hold a required public hearing on Council Bill 69, changing the zoning classification for 5050 South Syracuse Street in a required public hearing on Council Bill 87, changing the zoning classification for portions of 601 South Bannock Street, 81 South Broadway'",
        "'speaker_1': 'and 99 West Kentucky Avenue. Any protest against Council Bill 69 or Council Bill eight seven must be filed with the Council offices no later than noon on Monday, March 21st, seeing no other business before the body. This meeting is adjourned.'"
    ]
}