{
    "Proclamation for Rent and Mortgage Moratoriums due to COVID-19.": [
        "'speaker_0': 'Thank you, Councilmember. All right. I don't see any other. Anybody else. So that concludes our announcements. That concludes our announcements. There are no presentations, there are no communications. But we do have one proclamation this evening and I council member can each.'",
        "'speaker_0': 'We did it just a second and then go over to you for that. Go ahead.'",
        "'speaker_1': 'Thank you. Council President Clark. Today we have Proclamation 20 Dash 20350 urging rent and mortgage moratoriums for those unable to pay during the COVID 19 emergency. I'm going to read this a little differently than usual. It's a little longer than our typical proclamation.'",
        "'speaker_1': 'And I want to thank Councilman Chris Hines and Councilwoman Candi CdeBaca for helping to shape the language. I'm going to summarize some sections, read a few. And Councilman Hines will be reading the closing of it. So thank you for your forbearance and we'll try to make it a little faster by not reading every word.'",
        "'speaker_1': 'So the first two paragraphs of this proclamation outline the history of the coronavirus in Denver and the health orders that resulted in a massive range of unemployment among the residents of our city. The third paragraph outlines the massive unemployment from those, especially in industries like food, retail, non-essential manufacturing, fitness, hairstylists and all those others, to the tune'",
        "'speaker_1': 'of more than 127,000 claims for unemployment. But recently employed workers and some immigrants are not eligible for unemployment, and even eligible recipients experienced delays in their benefits and only partial replacement of earnings. Whereas the federal stimulus package will provide most adult Americans with a one time check for 1200 dollars.'",
        "'speaker_1': 'But many immigrant workers will not receive these benefits in spite of paying their taxes. Low income non-tax filers face significant barriers to getting these benefits, and even filers who are eligible may not receive their checks for weeks or months if they do not use direct deposit.'",
        "'speaker_1': 'And many households monthly rent and necessity expenses exceed the amount of this one time payment. Now the CDC recommends extreme social distancing. And we have been warned today by our mayor that that distancing will not and suddenly we will come out of it slowly, which means that many of our residents will remain out of work, even as'",
        "'speaker_1': 'some orders change in the coming months. Whereas many Denver ites were already struggling to keep up with their rent payments prior to this crisis, with an average rent of 1470 $5 and 46% of renters paying more than 30% of their income to housing costs, making them cost burdened or severely cost burdened.'",
        "'speaker_1': 'And home price appreciation had already outpaced wage growth, causing 24% of homeowners in Denver to be cost burdened or severely cost burdened. Now, our courts in Denver are closed through May 31st, and our mayor has directed the Denver Sheriff's Department to not assist in eviction orders during these health orders.'",
        "'speaker_1': 'But when these courts reopen, eviction filings have continued to be accepted and there will be a massive accumulation of debt and a risk of housing loss when courts reopen. Now, our governor has issued an executive order that makes requests to help residents of our state and ask lenders to provide leniency and asks his departments to work with'",
        "'speaker_1': 'them. But that executive order does not issue any requirements to do so. Whereas renters in Denver have shared that some laudable landlords have worked with them as tenants to reduce rents or accept delayed payments. But others have continued to post rent demands on doors, file evictions and have refused requests to accommodate their renters.'",
        "'speaker_1': 'And while both Denver and the state fund rental assistance programs, Denver already saw a 245% increase in applications for temporary rental and utility assistance in March 2020 alone. And there will not be sufficient city or state funding to pay all rent shortfalls in the city or state.'",
        "'speaker_1': 'Whereas the closure of businesses to prevent the spread of COVID 19 has also caused significant financial hardship to small business renters, also impacting their ability to pay rent. And. Whereas, the Governor's Emergency Declaration on March 11, 2020, Gov.'",
        "'speaker_1': 'Polis opened the opportunity to use certain emergency powers under the Colorado Disaster Emergency Act. Now our Federal Reserve Bank has given a massive infusion of $1.5 trillion in loans to banks to help them make due if they are missing payments from those who have mortgages for their properties.'",
        "'speaker_1': 'And this, in turn, provides the ability of banks to provide relief to those who owe debt on homes or on multifamily properties that are rented to tenants directly impacting those landlords ability to then provide rent relief for rent to tenants.'",
        "'speaker_1': 'And by halting mortgage payments. During this time, the urgent need for landlords to collect rent will be paused. Whereas to date there is no national rent or mortgage relief program other than restrictions in the CARES Act for properties with federally backed mortgages, which protect only about one third of rental apartments.'",
        "'speaker_1': 'And there is no government program of any kind for mortgages on multifamily dwellings. And I'll now turn it over to Councilman Hines to complete the proclamation.'",
        "'speaker_0': 'It's almost a full page document is. All right. Welcome. Go ahead.'",
        "'speaker_2': 'Thank you, Mr. President. I just want to I want to thank Councilmember Canete and Councilmember CdeBaca and the entire delegation for for letting us bring this forward. The proclamation is about everyday working folks. We've all heard about trickle down.'",
        "'speaker_2': 'We've all heard about the top will get the money and pass it down to the rest of us. In the COVID pandemic, as Councilmember Kinney just mentioned, we're already giving a one and a half trillion dollar bailout to banks.'",
        "'speaker_2': 'But lots of people are losing their jobs and can't pay rent. And lots of mom and pop landlords are unable to pay their mortgage. This proclamation is about them. Big banks got a bailout in 2008 and another one just a couple of weeks ago, and so did large real estate conglomerates.'",
        "'speaker_2': 'Yet I've heard from District ten renters that not all they're not all this way, but I've heard from District ten renters saying that their property managers are encouraging people to use their credit cards for rent. And I've heard from mom and pop property owners that the big banks are being inflexible, too.'",
        "'speaker_2': 'This proclamation is about giving our state and federal elected officials support to get this done statewide or nationally so that our money helps all of us and not just the 1%. And just, you know, Denver and Colorado are not alone.'",
        "'speaker_2': 'California and New York have mortgage deferrals in place through action at the state level. Oakland, San Francisco, Seattle and our neighbor Aurora have already passed similar resolutions. Both the state and federal officials could use federal rental assistance aid to create rental vouchers, to pay rents directly to landlords, landlords for people who cannot pay.'",
        "'speaker_2': 'And this isn't about telling our state and federal electeds how to do their jobs. I wouldn't ask them. I wouldn't tell them how to do their jobs, as I wouldn't imagine that they would tell me how to do mine.'",
        "'speaker_2': 'But it's about giving them the support so that they can fight for all of us who are working and for all of us, through no fault of our own, recently became all of us who are working and all of us who have recently lost our jobs as a result of COVID.'",
        "'speaker_2': 'So thank you, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilmember. We're a little bit out of order because we're reading the proclamation. But, Councilman Keyser, are we all read our covered on the reading. Can we.'",
        "'speaker_1': 'Not we? I'm sorry, Councilwoman Hines is going to be 50 it resolved before we went to the comments. Kind of an apology under oath. Do you have it in front of you or would you like me to do that for you.'",
        "'speaker_2': 'Councilmember? I have it so I can read it. Apologies.'",
        "'speaker_1': 'Just the down there for.'",
        "'speaker_2': 'Yes. Okay. You can hear me still. Great. Okay. So now therefore being proclaimed by the city and county of Denver, Section one, that the Council of the City and County of Denver calls upon Governor Jared Polis to use the full legal extent of his emergency powers to impose an immediate moratorium on residential and small business commercial rent'",
        "'speaker_2': 'payments for those unable to pay due to COVID 19 and public health orders such that no Coloradan or small business who is unable to pay through no fault of their own should be required to pay rent during this health emergency.'",
        "'speaker_2': 'Nor should they accumulate debt or interest for unpaid rent and to support efforts to achieve similar action from other state and federal elected officials as described in Sections two and Section two that the Council and the of the city and county of Denver calls on the administration of President Donald Trump, members of the congressional delegation representing Denver'",
        "'speaker_2': 'and congressional leaders, specifically Representative Diana DeGette, Senator Cory Gardner, Senator Michael Bennet, Senator Nancy Pelosi, or excuse me, Speaker Nancy Pelosi and Financial Services Committee Chair MAXINE Waters to enact by executive order or law an immediate moratorium to all residential and commercial mortgage payments and rents for those unable to pay due to COVID 19 or public health'",
        "'speaker_2': 'orders, such that no owner of property in the nation who is unable to pay through no fault of their own, should be required to pay mortgage during this health emergency. Nor should they accumulate additional debt or interest for unpaid mortgage payments.'",
        "'speaker_2': 'And no renter in the nation who is unable to pay through no fault of their own should be required to pay rent during this health emergency. Nor should they accumulate debt for unpaid rent. End Section three that the Clerk of the city and county of Denver shall affix the seal of the city and county of Denver to'",
        "'speaker_2': 'this proclamation, and that a copy be transmitted to Governor Jared Polis. Representative Diana DeGette, Senator Cory Gardner, Senator Michael Bennet, Speaker, House Speaker Nancy Pelosi. Financial Services Committee Chair MAXINE Waters and President Donald Trump. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. Committee or motion to advance.'",
        "'speaker_1': 'Thank you, Mr. President. I move that proclamation 20 dash 30350 be adopted.'",
        "'speaker_0': 'If you had moved in second to now or the comments from members of Council Council, would you like to go first?'",
        "'speaker_1': 'Thank you, Mr. President. And thank you to my colleague, Councilman Haines, whose comments maybe be a minute early, but we're 100% on point. Why would we do a proclamation that's not binding? Well, because the residents of our city are hurting.'",
        "'speaker_1': 'And they have asked us from day one, the first communication I got when these orders came down and folks began to lose their jobs is how would they handle housing and what could we do to help? We have a rental utility assistance program.'",
        "'speaker_1': 'We stepped up and increased the application volume that's coming in through that. We have worked with our courts and advocated many council members, signed letters urging an eviction moratorium at the state level and continue to be advocates where we don't have the power to solve the problem directly.'",
        "'speaker_1': 'It is important for residents of Denver to know that we see you and we hear you. We know that small businesses are struggling with their rents. And we know that property owners who depend on rental income and to pay their mortgages and those multifamily properties.'",
        "'speaker_1': 'This proclamation connects all three of those levels. Both the banks and the lenders, as well as the owners, as well as the renters. But at the bottom of that pyramid is the renters who are struggling and who are at risk of losing their housing and displacement.'",
        "'speaker_1': 'This is a challenge that, as Councilman Hines mentioned, is national and scale. And the conversation needs to be national in scale. And sometimes what we have in Denver City Council is the bully pulpit to say we want to be a part of that conversation with colleagues in California and New York, San Francisco and Seattle and other cities'",
        "'speaker_1': 'like Aurora, our neighbor who passed this proclamation, very similar proclamation just a couple of weeks ago. Thank you for your leadership, Rivera. But to say that we all need to be part of this conversation now, I got many questions today from folks, some of whom I think weren't sure and didn't understand that this was not a binding'",
        "'speaker_1': 'law. But beyond that, a question about whether it was a wise thing to do or not and what the details would be. And I think one of the things that's really important to highlight is when you raise a conversation, it's okay that it takes different directions.'",
        "'speaker_1': 'If our state and federal government take these proclamations and the calls of the residents who are calling into every show I've heard every town hall, I've heard every call in show with the news. This question has been asked if they are hearing those voices, perhaps they have an idea we didn't propose in this proclamation.'",
        "'speaker_1': 'Maybe they know whether it should be 90 days or 120 days, or what the exact eligibility criteria might be to demonstrate an inability to pay. As Councilman Haynes mentioned, it is it is up to those levels of government to debate those details.'",
        "'speaker_1': 'And I hope the residents who reached out to us today reach out and share their ideas for other ways to tackle this massive housing crisis at the scale at which we have done the pandemic, because the two are connected.'",
        "'speaker_1': 'If we cannot keep people housed, we will see an increased risk for themselves of homelessness and increased risk of transmission, as we are seeing now. The challenge we have with more people seeking congregate care in homeless shelters than we have hotel rooms to put up.'",
        "'speaker_1': 'So each of these things is related. If we want people to stay at home, if we want them to honor social distancing, we have to ensure they won't lose their housing. It is absolutely integral to the public health of these orders, and that's the case we're making today.'",
        "'speaker_1': 'I am also welcome to answer any questions from my colleagues to the best of my ability. Again, this is not a policy, it is a conversation starter. But I know that there may be questions and we were unable to have committee.'",
        "'speaker_1': 'So with that, I thank you and urge my colleagues to join us in sending the message that this is the right conversation to have at the state and federal levels. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman and Councilman Owens, you already made some comments. Is there anything else that you wanted to add?'",
        "'speaker_2': 'Yeah, I did. Just a couple of words to thank you, Mr. President. Just a couple of more statistics. The percentage of people nationally who could pay rent in March was 82%, and in April it dropped to 69%, and that's nationally.'",
        "'speaker_2': 'So we just had a 12% drop in the ability of renters to pay their rent just in the span of a month. And since April 1st, we've had an additional 1213 million Americans file for unemployment for the first time.'",
        "'speaker_2': 'So that's that percentage of people able to pay will continue to change and become even more taxing for us as a city, but also for us as Americans. And speaking of taxes, we we can't. Our taxes are going down because people aren't staying in hotels.'",
        "'speaker_2': 'People aren't buying things. And that's half of the city's budget is sales tax and lodgers tax. And so we're we're doing what we can to to to assist. But as Councilmember mentioned, we can't do it all alone at the local level.'",
        "'speaker_2': 'We can't even do it all alone at the state level. This is a national issue. It's an international issue. But but it's certainly something that we have to take care of as a nation. And I'm excited to give the support to my state and federal counterparts so that they can help get this done.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. All right. Next in the queue, household and tourism, we go to you. So go ahead.'",
        "'speaker_1': 'Thank you, Mr. President. We got a lot of calls in District three, both from landlords and property owners and affordable housing providers, as well as renters and residents. So this this action we're taking up nationally would have a profound impact.'",
        "'speaker_1': 'And I think even though what we're proposing is a is a symbolic gesture, just letting folks know where we're.'",
        "'speaker_0': 'Coming from when it comes to our city council.'",
        "'speaker_1': 'I think what it what it speaks to is what's needed is the entire continuum of housing. Looking at relief for residents. There will still be some folks who complete their rent, those who cannot their rent roads. Everyone has a bill to pay.'",
        "'speaker_1': 'And that's why this goes beyond just any requests around rent to mortgages and commercial as well. So I really just want to emphasize that for my residents in District three, I recognize how hard this is going to be.'",
        "'speaker_0': 'For the.'",
        "'speaker_1': 'Next year.'",
        "'speaker_0': 'If not longer, for all of you. And if.'",
        "'speaker_1': 'What we can do is send a message to.'",
        "'speaker_0': 'Those throughout the country and to our federal leadership.'",
        "'speaker_1': 'And we will thank you.'",
        "'speaker_0': 'If you don't have a home in America.'",
        "'speaker_1': 'Thank you, Mr. President. I want to thank my colleague for bringing this forward. A year from now, historians and visitors will read about what actions we took to help Denver ensure the future and vitality of our economy right now.'",
        "'speaker_1': 'And there will be plenty of time to play my Monday morning quarterback in the years to come. But what's important to the residents of Denver is how we help them today, because they're not getting a ton of help from a lot of places.'",
        "'speaker_1': 'Right now, the federal government is fighting over whose name is going to get printed on the texts that we're about to get. The state is working to do what it can, but it's facing an estimated two and a half billion dollar shortfall.'",
        "'speaker_1': 'And that leaves the city as the last line of support, or maybe better the first line of support for our residents and for our small businesses. And we are working around the clock to provide our residents that support.'",
        "'speaker_1': 'So this proclamation isn't asking for debt forgiveness forever. And it's not a law. Right. We're asking we're asking our government counterparts and the big banks that hold most of these mortgages and our fellow community members to come together in a compromise.'",
        "'speaker_1': 'And it may hurt a little bit now, but it will benefit everyone in the end. And we're not asking banks to walk away from income that's rightfully theirs forever. We're asking for a pause on this debt collection until our residences and our businesses, our residents and our businesses are steady, are on their feet, and our economy can'",
        "'speaker_1': 'reopen safely. And our office has received reports from our residents of landlords that are presumably applying for the financial assistance themselves, but failing to pass that on to their tenants. And that's simply not acceptable. That's not in the spirit in which these financial supports were meant to be utilized.'",
        "'speaker_1': 'And that's it's not okay. Because if there's one thing that's become abundantly clear in the last month, it's that we are all in this together and together we're going to get through this. But that's going to take a little bit of compromise.'",
        "'speaker_1': 'And the city is doing what it can. We're looking at taking a significant economic hit and making significant budget cuts, but we're still finding ways to provide the community support that our residents deserve, like the true a program and the expanding the bio program to help renters and small businesses and waving our parking fees and our interest'",
        "'speaker_1': 'on our property tax payments to help our property owners and small businesses. We've helped. We set up the $10 million COVID relief fund, and we're pursuing every possible financial avenue for reimbursement wherever we can, which is a huge job.'",
        "'speaker_1': 'So thank you to all of the city employees who are working on that. That's amazing. Is it perfect? No. Is it going to be enough for our residents? No. At the end of the day, it is not going to be enough.'",
        "'speaker_1': 'And so we are all in this together and together we'll get through this. If you live here now and you're a part of what makes the city the greatest city on the planet. But tonight I'm a yes vote and giving the keys of the city back to the people who built it, which is our small business owners'",
        "'speaker_1': 'and the hardworking people like our service workers who can't make ends meet right now because the help we're giving them simply isn't enough. And so I hope that our banks and the landlords who are able to will join us in that.'",
        "'speaker_1': 'So thank you very much to my colleagues for bringing this forward. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember. Next to Councilmember.'",
        "'speaker_1': 'Thank you, Mr. President, and thank you to my colleagues for bringing this forward and those of you who will support it tonight. While it is symbolic, it does send a strong message to the thousands of people who have been contacting us, asking us to stand in solidarity, asking us to help figure out a solution to this problem'",
        "'speaker_1': 'and where our hands are tied. As the legislative body, I think that this is an important statement to for us to make. And since we don't get to give the proclamation tonight to somebody or some group like we typically do, I'd like to list off some of the many organizations that had been working on the original rent'",
        "'speaker_1': 'cancelation rent freeze, mortgage freeze petition. And so those those individuals and organizations include Indigenous Voices of the Poor People's Campaign. Denver Black Educators Caucus. Black Lives Matter 50 to 80. Colorado Latino Forum. Colorado Rent Strike and Eviction Defense Front Range Mutual Aid Network Missing Indigenous Sisters Tools Initiative Johnstone of Inglewood City Council Warriors for High Quality Schools'",
        "'speaker_1': 'Invisible Front Range Resistance Tae Anderson DPS School Board Bobby La Brea, Colorado Poet Laureate Reverend Reverend Jessica Abel Chantelle Lewis RTT Board Goldie Vandal DC to President Tiffany Choi Hassan Latif Second Chance Center Second Chance Center as an Organization.'",
        "'speaker_1': 'Our Voices, Our Schools. The Kaleidoscope Project. Lorena Garcia, U.S. Senate Candidate. K.A. Johnson. Our Revolution. Metro Denver. Denver. Democratic Socialists of America. Colorado. No More Prisons Yes. Coalition Focus Points. Family Resource Center Roosters Boxing Club Recovery Lab Colorado Statewide Parent Coalition Doctors Sochi Bailes Aurora.'",
        "'speaker_1': 'Young Democratic Socialists of America How to Call Indivisible Denver Project Voice Democracy. Enter Colorado 9 to 5 Colorado Megan The Mere East Colfax East Colfax Neighborhood Association. Jasper, Colorado Jobs with Justice Together Colorado Indivisible Highlands Ranch Juan Marcano Abolish Ice Curls on the BLOCK Two dope teachers in the Mike Denver area Labor Federation, United Food and Commercial'",
        "'speaker_1': 'Workers, Local seven Colorado AFL-CIO, Asian Communities Together, Denver Artists for Rent Control and Colorado Peoples Alliance. Thank you all of you. Please is continue your activism. It's the only way that we can move forward together. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Next up, we're going to go to Councilmember when unmuted. And thank you. Hold on. Just like I unmuted you. Let me do it from here and then we'll start. Going over each other, I think.'",
        "'speaker_4': 'All right. Go ahead.'",
        "'speaker_0': 'Yeah. No, they can't. So maybe you do need an unmuted there.'",
        "'speaker_3': 'Very like a brave new world here. I know some people in my family would love to have that view, but right now for me, I wanted to thank Council English for working with me all weekend in the wording on this because it's beginning and actually much preferred.'",
        "'speaker_3': 'The resolve that Councilwoman CdeBaca had first proposed. But I am satisfied that in calling for the Governor to use the legal extent of his power to affect the situation, I think I think it's proper and right. So thank you, Councilman Kasich, for doing that.'",
        "'speaker_3': 'Thank you, Councilwoman CdeBaca, for your original wording, which I have been able to witness, is actually happening around the city. In fact, just afternoon, a woman who rents rental properties in the valley called my office and was very concerned about if the governor were able to somehow impose a rent moratorium, it would greatly affect her ability to'",
        "'speaker_3': 'carry on the business of the rental properties. But on the other hand, she is right now working with her tenants who are impacted by being unemployed or reduced hours and are not able to pay their rent. And she's working out deferrals, waivers and things like that.'",
        "'speaker_3': 'And I think a lot of our smaller landlords are doing I don't know what the corporate rental companies are doing on their own. And I also want to recognize that a lot of our banks and other financial institutions are working with their their mortgage as well.'",
        "'speaker_3': 'I can't speak for all financial institutions. She can't speak for any of them, but I can speak about my own. For instance, Firstbank Colorado already has a program to defer payments to waive fees for people who are affected.'",
        "'speaker_3': 'I think what we want to tell folks is if you can pay your rent and your camp, please continue to do so. Otherwise, I think every effort should be taken in line with the spirit of this proclamation to work with people whose lives are being devastated right now by this this virus and the reaction to it and'",
        "'speaker_3': 'what's happening in the economy. And so having worked through the weekend with the councilwoman on this subject, I'm happy to support it and to vote yes. Thank you.'",
        "'speaker_0': 'Thank you. Councilman, next up, we're going to go to you, Councilmember Cashman, and go ahead. Hold on. Just as I can remember, we're having trouble hearing you and Chambers.'",
        "'speaker_3': 'All right, we should.'",
        "'speaker_0': 'Okay. Great.'",
        "'speaker_3': 'Thank you. I want to repeat a little bit of the point that Councilman Flynn just made. This proclamation should not in any way be interpreted as anti landlord. That we recognize that we're calling on our state and federal leaders to craft what is a complex solution that needs to protect all sides.'",
        "'speaker_3': 'Well, especially the mom and pop landlord situation that there the monthly rent is necessary for their basic living expenses and that needs to be taken into account. I also want to salute the many landlords, big and small, around the city who've been proactive in addressing this situation, reducing rents, giving grace periods.'",
        "'speaker_3': 'But as I said earlier in announcements when I was talking about so many people are going around the city wearing their masks and social distancing and others many, many others not doing so. We're faced with a large number of landlords in Denver and around the country who are not being responsible citizens.'",
        "'speaker_3': 'And we as a society, we can't afford that. We cannot afford to have tens of thousands, hundreds of thousands, perhaps millions of people thrown out onto the street because of the situation. They had nothing to do with creating hard, hard working people that have just been put out of work by a situation not their own.'",
        "'speaker_3': 'So I as well, in recognizing the complexity of the problem and the solution, I want to thank Councilwoman CdeBaca and Hines Company for the hard work in moving this issue forward. I look forward to supporting it tonight.'",
        "'speaker_0': 'Thank you, Councilmember. Next up, we're going to go to Councilmember Sandoval.'",
        "'speaker_1': 'Go ahead, Councilmember. Thank you, Mr. President. So I would like to offer my support for this proclamation as well. And just to remind my constituents that a proclamation is not policy, we are asking our Colorado delegation and other national leaders who have more power than us at the municipal level to have this conversation.'",
        "'speaker_1': 'And it is an outline, as Councilman Canete talked about. It doesn't specify policy or eligibility or time period. It just calls upon them having a conversation and as though a proclamation. For me, this proclamation does tell the residents of our community that their pain is heard, that we support the effort to alleviate their pain, and most importantly'",
        "'speaker_1': ', that we recognize the connection between people being able to stay in their homes and protecting their health by slowing the spread of the virus. So when you have a stay at home order and you're not able to pay your rent, it goes it's counterintuitive of what we're asking from the public and the public health order.'",
        "'speaker_1': 'So absolutely, we need to support this. And I have a rental property and I've reached out proactively to my tenants. And so thank you for everyone in North Denver who's been proactive and who's working with their tenants until we can come up with some solution.'",
        "'speaker_1': 'Thank you for the three councilmembers who worked on this and everyone else who had an effort into getting this passed. And I will be offering my support tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Right. I don't see any other hands raised. So last chance to flag me on comments. And we are going to go over to Madam Secretary and do a roll call.'",
        "'speaker_1': 'Black back when Herndon clicked for Torres, Silverman got. I.'",
        "'speaker_0': 'We're going to go through slowly on these remote ones because this is causing a lot of feedback in chambers and we're going back to court. So, Madam Secretary, if you could just can go one at a time and just pause for a couple seconds.'",
        "'speaker_0': 'Council members, unmute yourself, your remote state, your vote, and then we'll move on once we can hear it in chambers. So we get started again with the ones who are not here. That's. I think they could hear you.'",
        "'speaker_0': 'So what happens in Europe? I.'",
        "'speaker_1': 'Gillmor, I.'",
        "'speaker_0': 'Times I.'",
        "'speaker_1': 'Question.'",
        "'speaker_0': 'I swear.'",
        "'speaker_1': 'To you. Sandoval. I. Council president.'",
        "'speaker_0': 'Madam Secretary, please both announce the results.'",
        "'speaker_1': '13 eyes.'",
        "'speaker_0': '13 is progress. In theory, 15 has been adopted. Thank you very much. And thank you for your patience, everyone. I was you're going to go fast forward for you. And once again, 15 minutes to read the bills are Internet.'"
    ],
    "Emergency Occupancy Agreement for Homeless Housing during COVID-19 with MHF Denver Manager V, LLC.": [
        "'speaker_0': ', four and under bills for introduction. No items have been brought out under bills for final consideration. Councilmember Clinton's called out Bill 286 for questions and a vote, and Councilmember Marquez called Article 262 for a vote on pending no items, although conceptually complete with the first item up on our screens will.'",
        "'speaker_0': 'I remember. Of course.'",
        "'speaker_1': 'Thank you, Mr. President. I have three questions that I sent through to the administration, and I just wanted to read, recap.'",
        "'speaker_0': 'What.'",
        "'speaker_1': 'Those were and what the responses were from my colleagues in public. One And the satellite thing to do with the accessibility question number one was over 151 rooms. How many are accessible? Responsive Nexus seven. Two was How will individuals be identified for placement in this location and how we will ensure the 88 compliant units will be allocated'",
        "'speaker_1': 'to folks with mobility needs. The response to this was the contract we reviewed tonight is the first one slated for rooms from protective action. Generally speaking, we are prioritizing people.'",
        "'speaker_2': 'At high.'",
        "'speaker_1': 'Risk to COVID 19 for these rooms. There's an intake form that is utilized for prioritizing access to rooms, and that form includes identifying needs of people with disabilities. People are then connected to the appropriate resource based on their needs.'",
        "'speaker_1': 'We know that we have more folks at high risk than we have rooms until we can provide our resources and personnel for more. So we are working with our public.'",
        "'speaker_2': 'Health.'",
        "'speaker_1': 'And health partners as well as service and shelter providers to get into that process for how to prioritize people entering these firms. A third question was for those occupying a room at this location, are their personal belongings being kept at a separate storage facility?'",
        "'speaker_1': 'The answer was Colorado Coalition for the Homeless Staff are currently managing the intake process, so we're checking with them on how belongings are being handled. The response later to.'",
        "'speaker_0': 'That.'",
        "'speaker_1': 'Question was folks are able to take their personal.'",
        "'speaker_0': 'Belongings with them at this time.'",
        "'speaker_1': 'Thank you, Mr. President.'"
    ],
    "Amendatory Agreement with Argus Event Staffing for Security Services at Auxiliary Shelters.": [
        "'speaker_0': 'Thank you. Number one. Right, Madam Secretary, if you will, please put the next item out of our screens. Health care reform. Give me a quick second and then be ready to vote. Council. Vote three, four, five on the floor.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_3': 'Okay. Actually, this is Resolution 345 and this is one that was direct filed by me last week and in the interim over the weekend. This is a contract for security at the Western Center for the facility that we've opened up there.'",
        "'speaker_3': 'And the weekend.'",
        "'speaker_0': 'Before we get into it, promised just.'",
        "'speaker_3': 'Three or four departments. They moved the council resolution 345 we adopted.'",
        "'speaker_0': 'Here. It has been moved and seconded. Questioning and comments now a complete record.'",
        "'speaker_3': 'As I was saying before, I was properly interrupted. It was discovered after Argus got in and started doing forming under an initial issuance of the contract that this would amend to add value to. It was realized that their their expertize is not really a good fit for working in this sort of a situation.'",
        "'speaker_3': 'They do more event related activities like at the Colosseum, at Red Rocks, at the Arts Center, the theater, and and in fact, they also do Pepsi Center and maracas, I believe, under contracts with those entities. And it just wasn't a good fit.'",
        "'speaker_3': 'So what the administration has to do, I was told, and I'm sure this guy, Stuart or Evan will not agree one way or the other if I get this wrong, is that we will use an existing contract that has financial capacity with one of our security contractors, HFCS, to perform these functions in place of what Argus was'",
        "'speaker_3': 'going to do. So there is no need to to do this contract and to amend it to add value, in fact. So that's why I'm recommending that we now vote no, ask everybody to vote no on this so that it dies right here.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Council member. The Council never, ever said that you had a hand up or that it would look good. Right. Councilmember Ortega, hold on just a second. When you go over the you. All right, Councilmember Ortega, go ahead.'",
        "'speaker_1': 'Thank you. So what we did, what we did in some expenses. So how do we account for those that need to be paid to our guest for the work that they did do over the weekend? It's my understanding they work for three and a half days, so I'm assuming somehow we need to take care of that.'",
        "'speaker_1': 'And I don't know if we have an existing contract with them or we can just take care of it that way. Does anybody have an answer to that question?'",
        "'speaker_0': 'Like Councilmember Flynn you want to take out or do you want me to kick them over to the sky? Okay, hold on a sec. No. I can hear all of the great noise. I can get to it in the second year.'",
        "'speaker_0': 'Okay. Looks like you're good to go.'",
        "'speaker_1': 'Hi, Sky. Stuart. Mayor's office. So the way we move forward with several of these contracts, including the Argus contract, was in order to get people on site very, very quickly. We did a much smaller dollar, very short term agreement to get them paid and get them on site.'",
        "'speaker_1': 'So that agreement has been signed. It is in place. What we were considering tonight was an amendment to that contract to add capacity and time. So we just don't need to take that word. We have the original contract signed it in place to be able to pay for the 72 hours worth of service that our guest did'",
        "'speaker_1': 'provide on site.'",
        "'speaker_0': 'All right. Great, great. Thank you. I don't see anyone else with a hand up. So, Madam Secretary, hold on just a second. About to go to you, and then we'll do. And a reminder, the recommendation for this is a no vote or a no vote.'",
        "'speaker_0': 'On this one. I'm sorry. You are muted. Collect your.'",
        "'speaker_1': 'For Herndon. How can Sawyer.'",
        "'speaker_0': 'Dance?'",
        "'speaker_1': 'Tourists see tobacco. Gilmore. No kinds.'",
        "'speaker_2': 'Of things.'",
        "'speaker_1': 'Cashman. Ortega.'",
        "'speaker_0': 'We're clear. We didn't. It was. No.'",
        "'speaker_1': 'No. Sandoval. No. Council president.'",
        "'speaker_0': 'Now an electorate that is close to voting in its results.'",
        "'speaker_1': '13 nays.'"
    ],
    "Rental of Mobile Shower Trailers for Emergency Shelters during COVID-19.": [
        "'speaker_0': '13 nays. The resolution three four, they're not pleased with the next item on our screens and have been for as long as they're going to remember you for your. Question on.'",
        "'speaker_1': 'Thank you, Mr. President. And again, questions around accessibility.'",
        "'speaker_3': 'Challenges.'",
        "'speaker_1': 'For being contracted for. There are will be eight trailers. Six of them will have ADA compliant showers. First question was on the image from the vendor's website. There are either stairs or to the trailer or a ramp. Do they provide the room and is compliant or do we need to provide the ramps?'",
        "'speaker_1': 'Answer We have worked with the Office of Disability Rights to get appropriate ramps in place for these shower facilities. Ramps were provided by the vendor and also supplemented with additional ramps from.'",
        "'speaker_0': 'A separate vendor.'",
        "'speaker_1': 'Three Question If we have to provide the ramps, is that a separate vendor? EXTRA Yes. QUESTION Because we contracted these units, do they fall under the Department of Justice.'",
        "'speaker_0': 'Settlement.'",
        "'speaker_1': 'Agreement? Answer the non-compliant. Sorry, this is the question. The non-compliant locations serve the unhoused community, including the Denver rescue mission. Do not.'",
        "'speaker_0': 'Affect.'",
        "'speaker_1': 'Our agreement because they run a separate nonprofit. Does the acquisition of these facilities now make them, quote unquote, a city facility under the agreement? Answer The acquisition of these towers in and of itself should not subject to the liability for breach of the DOJ settlement agreement.'",
        "'speaker_0': 'Mr. President, thank you. Thank you, Governor. Councilmember Sawyer, you also have a special.'",
        "'speaker_1': 'Thank you, Mr. President. Yes. So I just had a question that I also asked via email and wanted to just make sure that it was read into the the answer was read into the record. My question was regarding the price of this contract and whether we had looked into the possibility of purchasing the showers instead of renting'",
        "'speaker_1': 'them, given the costs of it. So the answer to that is that we had looked into it. So I'm just going to read the email. British fish are actually asked the same question you're asking about the rental versus purchase when we were procuring shower resources.'",
        "'speaker_1': 'She also asked if Rent to Own was a possibility. After doing a little research, the procurement team found that purchasing the showers is significantly more expensive than a short term rental. It's also not recommended to own this equipment because it's difficult to maintain.'",
        "'speaker_1': 'And those maintenance costs for keeping up the equipment, especially if not used regularly, can be considerable. So in the end, it was determined that we're better off from a cost perspective and a long term maintenance perspective with the rental at this time.'",
        "'speaker_1': 'So I just wanted to make sure that that was read into the record as much.'"
    ],
    "Amendatory Agreement with SMG for Convention Center Management during COVID-19.": [
        "'speaker_0': 'Thank you, Councilmember. And I don't see anybody else waving at me and I'm going to move on. Madam Secretary, if you please, go to the next item on our screen and counter terrorism to go back to you for your questions on 348.'",
        "'speaker_0': 'Go ahead. Go ahead.'",
        "'speaker_1': 'Okay. My question was, what is the funding path for this particular contract? Who initially pays the 9.9 million is for the city budget and from rents until we reverse the Federal Government's answer as part of our lease agreement for the state to lease the Colorado Convention Center.'",
        "'speaker_1': 'The state will pay 1.8 million per month or a total of 10.8 million.'",
        "'speaker_3': 'For the full term.'",
        "'speaker_1': 'Of the agreement. And these costs include reimbursement for SMP facility management. During that period, the 9.9 million paid to SMG will be fully covered by the state's overall agreement with us because the state is reimbursing us through this.'",
        "'speaker_1': 'We will not seek reimbursement. Period. Thank you, Mr. President.'"
    ],
    "Revisions to the Minority and Women Business Enterprise Contracting Ordinance and the Small Business Enterprise Development Program.": [
        "'speaker_0': 'They were all right at the next screen and then yourself. And then for accountability for.'",
        "'speaker_3': 'This person, I'm.'",
        "'speaker_0': 'Going to.'",
        "'speaker_3': 'Be placed upon final consideration in defense.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Questions and comments by members of Temple.'",
        "'speaker_3': 'Thank you, Mr. President. I raised some questions about this last week on introduction and got answers, some pretty extensive answers this afternoon to a number of those questions that I sent to Audrina Gibson. Thank you for coming down the arena.'",
        "'speaker_3': 'And under these difficult circumstances that we're all operating under, I have a great concern that the prompt provision that's in this ordinance that requires the prime contractors, the general contractors that have city contracts of $1,000,000 or more to pay their AWB subcontractors within 35 days of that subcontractor submitting the invoice for the work.'",
        "'speaker_3': 'In actuality is shifting the problem of prompt pay from us because we don't pay promptly in every circumstance and probably in most circumstances within 35 days. Shifting it to the prime contractors or to the subcontractors under them who may have third tier or fourth tier subs as well.'",
        "'speaker_3': 'And so we're kind of making those prime contractors the bank for our city contracts. And Mr. Gibson has and her office has provided through working with public works and the airport and all the other folks to do contracting.'",
        "'speaker_3': 'They have developed a ten point initiative that is trying to fix our end of the logjam, if you will. And but I'm still concerned how we will measure that going forward, because my concern in voting on this tonight is that we're opening a box of problems when maybe we could have taken time to come up with a'",
        "'speaker_3': 'way to solve that before we came to council. So maybe, Mr. Gibson, without going into detail with all the questions that you answered in which I forwarded to some other members who were interested in that same issue, could you talk to us about what happens if this doesn't work?'",
        "'speaker_3': 'What happens if a year from now we discover that a lot of crimes who used to do business with us will no longer bid on our work because they can't afford, particularly if the Prime is itself an mbie or we prime acting as a GC on one of our contracts that they can't afford to pay within 35'",
        "'speaker_3': 'days their subs and then wait for payment from us for maybe six months. If there's a lot of change orders involved, how will we know and how will we fix that? Thank you.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Okay. Good evening. Adrina Gibson, director of the Division of Small Business Opportunity. This is a new norm for me. So excuse me if I'm a re-adjusting. Thank you for having me and asking for me to come down. And Councilman Carlin, that's quite a large question.'",
        "'speaker_1': 'So I'm going to try to answer it to the best of my ability, but feel free to reiterate any of those questions in the meantime. So I think the first question that you had was the concern around the city paying their crimes and your concern with moving this bill forward, which is directly related to Mwb, which is'",
        "'speaker_1': 'a small minority women owned businesses with regards to 50% pay. And so just a couple of items with that, I want to state that the concerns that have been brought forward with contractor prompt pay is not the same as city pay.'",
        "'speaker_1': 'There are two distinct issues that we've been solving for for the last several months. You had brought up the concern that if we move forward with contractor prime pay, which is to pay mwb ease within 35 days, we could be opening up larger problems, a can of worms, if you will.'",
        "'speaker_1': 'But those can of worms have already been opened for several years and for many of our small businesses. And we're solving for that problem by putting this contractor provision into place for solving that issue. As it relates to that, the city pay is our responsibility.'",
        "'speaker_1': 'Responsibility. It's our accountability as the city to pay our prime contractors within 35 days of an acceptable invoice. The contractor prime pay aligns with that. It flows down from the city to the prime to the small businesses. It's with no surprise that we haven't been necessarily holding up to that as truthfully as we could.'",
        "'speaker_1': 'But throughout this extension that we received in December, that's what we've been focused on more than anything. And even outside of the contractor, shoring up our processes, our procedures and our policy to ensure that we are, in fact, meeting the requirements of city pay and getting our times paid with within those 35 days.'",
        "'speaker_1': 'It's not enough for us to remove contractor pay. The contractor can't pay is just it's fair. We have city pay for crimes. We should have prompt pay for small businesses as well. And during that time, while we're implementing as we're doing right now, we will ensure that our crimes are being paid on time because we have been'",
        "'speaker_1': 'working diligently, weekly and work groups with all of the city agencies collaborating to make sure that we better we can better measure our ability to pay on time that are the pay apps and the invoices. And those reviews are cut in half, that our technology systems are shored up and moving at a quicker speed.'",
        "'speaker_1': 'Nine different initiatives have moved forward with the help of the mayor's office and convening all the city agencies so that we're working on implementing those. I think to some of the city council members make examples of those nine initiatives and the action item lab for where we're at with each of those initiatives.'",
        "'speaker_1': 'I just want to again restate that, yes, my job is small minority women owned businesses and we've been focused on that. But with that, we've also been focused on making sure the crimes are paid in a reasonable time as well.'",
        "'speaker_1': 'So we are aligned. It's just and it's equitable. It's it's not enough to remove it because of the uncertainty, but rather to push forward in these times and make sure that in a very balanced way we're doing everything that we should be for both crimes and for small businesses.'",
        "'speaker_0': 'But.'",
        "'speaker_3': 'Am I still muted.'",
        "'speaker_0': 'In your views that you'll have to mute yourself? Very good.'",
        "'speaker_3': 'Thank you. Adrina, could you address perhaps how will we know that we are succeeding? Do you and will you commit to come back to committee to counsel? What are the measurements? Because my understanding is from pay for the fines from the city.'",
        "'speaker_3': 'We start our clock when when the invoice is accepted, when we check everything out. But for the bodies, the clock starts when they turn in the invoice before the Prime or the GC actually can say, well, is all the work accepted, etc..'",
        "'speaker_3': 'Are there differences between the two systems that we can try to align better? Because I'm concerned that we're required especially to smaller crimes. Even those who are be themselves might not have the wherewithal to borrow the money to pay their subcontractors while waiting for us to go through change orders to finalize costs and to issue them a'",
        "'speaker_3': 'check. What will they pay them with if it's not the money that they're expecting from us, short term loans? Or how are we going to work with them on that? So how will we know, say, over the next year that that this has been a successful effort?'",
        "'speaker_1': 'So to answer your first question, yes, I am committed to coming back to city council. And I know that Councilman CdeBaca had asked for us to also put together a plan to show and measure how we're doing with regards payments to you and their needs, as well as to our crimes and how that's being measured.'",
        "'speaker_1': 'And in fact, one of our initiatives, one of the nine initiatives that we're pushing forward is our Power BI dashboard, which will look at an agency by agency to see how quickly we are paying our crime within that 35 year period and what area of the flow chain is being reviewed, maybe slowing that up or what was'",
        "'speaker_1': 'the reasoning for it. But we are looking at keeping that clock on so that we can see throughout the many different approvers, if you will. What is the lag time and where we bolstering and streamlining those efficiencies. So we will have an actual system that we're working on right now in place to be able to look at'",
        "'speaker_1': 'that. And yes, I am committed to coming back regularly to make sure that you will see that these changes are being met. It's not just the job of this, though, but also of all of the other city agencies.'",
        "'speaker_1': 'And we have a system that will allow us to do that.'",
        "'speaker_3': 'Okay, Adrina, I would like and as long as the administration is sitting up here, also, I would like to see a report maybe in a year that takes into account the number of bidders on each contract so that we can see are we getting more bitters or are we losing bitters where we might have expected five times'",
        "'speaker_3': 'to come in and bid? We're only getting to two. So to measure that impact also, it would be nice to have public works in the airport. Give us that kind of report after a year, because some of the crimes are very concerned that that will thin the field of potential bitters by putting this additional, in some cases'",
        "'speaker_3': ', what could be an onerous requirement. Thank you.'",
        "'speaker_1': 'Yes. And I would just like to state with that. We'll make sure that we put that report together. But I do want to just note that looking at whether it better does or doesn't fit on a project can be a multitude of things, especially given the economy that we're in right now.'",
        "'speaker_1': 'And to your other concern, which I've also heard from nine MWP, is their ability or their unwillingness to potentially work with the city. I just want to reiterate that this provision is nothing new. It's nothing pending as the city has it for the crimes.'",
        "'speaker_1': 'Our city has this provision and Zita has it on their central 70 projects. Many of these firms, including Mwb, are very familiar with this provision. If they've worked within this provision for several years, in fact throughout all aspects.'",
        "'speaker_1': 'And then, as you know, in Central 70 and small businesses who were small businesses and now crimes grew throughout this provision, it actually assisted them in keeping their doors open. And so I just wanted to state that for the record also that many of the businesses that we work with, contractors in Vietnam, are very used to this'",
        "'speaker_1': 'provision and have no effect on it, that I'm aware.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you for coming down. Thank you. You know, a couple of other people in the queue and have a number or take a look at some really good work where you wanted to be able to. Give me an idea.'",
        "'speaker_0': 'First of all, Councilman Cashman, the director of the company Casanova, over your way.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you. Thank you, Mr. Lynch.'",
        "'speaker_0': 'I believe.'",
        "'speaker_3': 'Lot of feedback here. I'd like to start by giving a sincere shout out to our former colleague, Councilman Wayne New, for the incredible amount of ground work he did over a year or two in addressing a variety of dispo related issues with prompt pay for subs being perhaps the most important of the issues that we looked at'",
        "'speaker_3': ', he was kind enough to involve Councilman Ortega and myself in discussions, and we interviewed sub after sub after sub that told horror stories about the lack of prompt payment, the lack of adequate payment from Prime's that had been paid.'",
        "'speaker_3': 'And this is a while I agree 100% with my colleague, Councilman Flynn, that we on the city side have the responsibility to do what we're asking our primes to do. I truly feel that in Ms.. Gibson, we've got the right person with the right background to ensure that all sides in this situation are treated fairly.'",
        "'speaker_3': 'I very much, again, appreciated the work that Councilman Nu did along the way. I'm sorry. He's. I hope he's watching tonight. I hope he's watching tonight. He deserves credit for where this where Dismas sits today, which I think is in a far stronger position than it did a couple of years ago.'",
        "'speaker_3': 'So I will look forward to both keeping an eye on Ms.. Gibson and her staff to ensure that our crimes are treated in the way they deserve. And I look very forward to supporting this tonight. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. And now we're going to go to council member or take our. You can go ahead.'",
        "'speaker_1': 'Okay. Thank you so much. I first want to say thank you to Adrina and Jason Moore, who spent a lot of time with me walking through different provisions of the ordinance. Some of that was with other people who had many questions about it as well.'",
        "'speaker_1': 'And I just want.'",
        "'speaker_3': 'To.'",
        "'speaker_1': 'Get on the record a couple of clarifying points. So first of all, throughout the process, when I met with Diaz, both staff and contractors, both Prime as well as Mwb is this issue was brought up over and over again, correct.'",
        "'speaker_1': 'So now that we're getting ready to adopt, it is not the first time that this issue has come up. Can you just clarify that? The battery for this is going. Okay. Yes. This has been an ongoing matter for small businesses for some time coming on board last year.'",
        "'speaker_1': 'This was actually brought forward by many of the small businesses within the community, small and large, who brought this directly to the mayor's office. Many of the council members. And it was a topic of ongoing discussion internally, where we convened subcommittees through our business equity leadership team and many of the agencies and their staff.'",
        "'speaker_0': 'So I have a couple more questions from an article. We can't hear you in chambers and we got a quick look at the bison. So, Zach, I remember the first president order. And you tell them to switch over to alcoholism.'",
        "'speaker_1': 'Are you ready for me or.'",
        "'speaker_0': 'Can we get to your audio? I get it from my definition here and the feedback. So it was just as I. Give. Thumbs up. I think we already. All right, go ahead.'",
        "'speaker_1': 'So what I'm going to do is just kind of roll through the next three items, just very briefly, so that we don't have to bounce back and forth. I appreciate a lot of this is about how quickly the primes get their buildings in because if they're.'",
        "'speaker_1': 'Holding up, getting their billings in, then that's going to hold up them getting their their allotments on a monthly basis as it's anticipated. So it's incumbent on everyone, including the minority and the women. Of subs on a project to be as thorough as possible.'",
        "'speaker_1': 'So one of the questions related to the billing is we heard this over and over that if there is a question about one item on a bill that gets submitted by the Prime and it's holding up everybody else that has their billings in with that monthly allotment that that one item holds up the entire billing, not just'",
        "'speaker_1': 'that one item. And so I'd like you to address that. So let me go on to the next two items. If it looks like we have major issues with the prompt pay or any other provision of the ordinance, we don't have to wait for the next disparity.'",
        "'speaker_1': 'Study you all, and we together can look at making changes to the ordinance just like we did working with Councilman New to make the one change that was reflected in when the prime would submit. I mean the subs with submit their billings and it showed transparency in the billing process.'",
        "'speaker_1': 'And then the last issue is about. Creating the transparency that we need in tracking what's happening with on call contracts. There are some that end up having these goals attached to a project, but there are some that may not.'",
        "'speaker_1': 'And unless they go through the SBA, we normally don't see that that criteria. And I think being able to track that data is equally as important as tracking the ones that have the goals attached to. So that's it.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_1': 'Councilmember. Go ahead. Okay. So to answer and further elaborate on many of the points that Councilman Ortega brought up. Yes. When we started looking, the first question was with regards to accountability and some of the information that we received back about crimes, building payoffs, which was which has and continues to cause I'm due financial strain on small'",
        "'speaker_1': 'businesses. Yes. The process for prompt pay is with regards to multitude of things. I mean, there can be the instances which were brought in by Councilman Flynn where the city needs to go through their checks. Checks and balances to make sure that we've received all of the documentation needed.'",
        "'speaker_1': 'However, there's also the case in which you have prime contractors that will hold their invoices from submitting them to the city because it incurs interest and they want to keep it in the bank as long as they can before they have to then submitted or the documentation isn't ready or someone's going on vacation.'",
        "'speaker_1': 'That does happen. Prompt pay for contractors so contractor can't pay as well as with the city. Proper pay allows for accountability on all ends to require the city is doing their checks and balances that all documentation is present, that we're living within those 35 days and we're moving the process forward.'",
        "'speaker_1': 'It requires accountability from the prime contractors to say, I need to have all of this documentation, I need to get it in because I'm going to be required to pay my says you're very soon. So let me make sure that all of this information is correct, which we are now creating checklist for our crimes.'",
        "'speaker_1': 'Let me make sure that the certified payroll is complete, which they'll receive earlier notification on if something is missing, as well as the accountability on the small business to make sure that all of their eyes are dotted and t's are crossed when they're submitting that information up to the crime.'",
        "'speaker_1': 'So, again, it's it's not enough to just rely on paid when pay, because there are other there are other issues that occur with crimes paying their subs outside of just the city potentially being delayed in paying them. And so with regards to all of those processes, from city to crime to small businesses, our nine initiatives employ accuracy'",
        "'speaker_1': ', timeliness and streamlined process improvements. The second question that Councilman Ortega brought up was that if there's one air within an entire park, which can be several pages long, it holds up payment for all of the subcontractors working on the project.'",
        "'speaker_1': 'That's absolutely correct. In many instances, because of paid when paid, you can have one piece of information that will delay the payment of another mwb or another non mwb. So that prime contractor then is met with a situation of waiting until that issue is resolved or pulling that one piece out and then resubmitting the pay.'",
        "'speaker_1': 'It's it's unfair for the subcontractors and even their employees to have delayed payment for the work that's been completed because of another error, be it on the prime or the other subcontractors working on the project. And so that is an error within the paid when paid contractor properly means that it allows for that small business once their'",
        "'speaker_1': 'work is done. They've invoiced for it. It's been deemed completed and acceptable by the prime per their scope of work and their subcontractor specs to be paid and be able to have that cash flow to move on to another project, to be able to pay their people, to be able to put food on their kids table.'",
        "'speaker_1': 'And so it's it's just and it's fair. And then with regards to looking at the ordinance in moving this forward and in the future, seeing if there's additional edits that need to be made or additional rules that need to be put into place.'",
        "'speaker_1': 'We're doing that now. The ordinance is the enforceable language. Our rules and regulations will allow us to provide that fine line of detail as to how prompt payment will flow from the crimes to the subcontractors and what areas are disputable where we have leniency and flexibility.'",
        "'speaker_1': 'And once we come back from this in a year or so or the next disparity study, it will be able to measure all of that and if needed, amending any time between there. But the rules in Mexico, it really allowed for us to allow for that additional flexibility and detail.'",
        "'speaker_1': 'And tracking of the data. Yes. To my point, too, Councilman Flynn, we do have our dashboard that will allow us to track this information to see how we're doing with payments to crime as well as payments crimes are doing with payments to these.'",
        "'speaker_0': 'Council member Ortega. Are you good to go? Okay. All right, then. Let me go over Councilmember Lynne, if you can unmute yourself. I see you're back in the queue. Go ahead.'",
        "'speaker_3': 'Thank you, Mr. President. I know that some folks were mixing questions and comments, so I just want to make sure I got my comment in. And that is that this is an important program that will expire at the end of this month if we don't pass this.'",
        "'speaker_3': 'And I think it has a lot of challenges to this provision. This prompt pay provision has a lot of challenges to it. There's just so many situations, as Mr. Gibson has pointed out here, where it is maybe the fault of the prime by holding onto the payments that are received from the city.'",
        "'speaker_3': 'But in many cases it's where the city has not paid. And I'm particularly concerned about those instances, and this is something else that needs to be tracked over the next year or so as this gets implemented. When when a when a prime pays the subcontractor for a piece of work and then later invoices the city for it'",
        "'speaker_3': ', but then the city might reject that work that's already been paid for by the prime. So there's a lot of a lot of areas that need that are disconnected right now that need to be reconnected. But what I wanted to say, my comments was that I will vote yes on this tonight and get this passed.'",
        "'speaker_3': 'But I do it with some hesitancy, as I've said in other situations where sometimes you're 55, 45 on how to vote, you're not always 100% not all these votes are 100%. Yes, sir. I know it's an important program that needs to go forward.'",
        "'speaker_3': 'We're trying something that I think is very risky for all sides and it has to work. Right. And so we want to make sure that in a year's time, in two years time, that we keep track of the right data, the right measurements to make sure that it is working.'",
        "'speaker_3': 'And it's not hurting us. It's not hurting the suburbs and it's not hurting the primes as well. One other reason that I want to vote, that I'm going to vote yes now is that I there are only seven of us here in the room.'",
        "'speaker_3': 'And in order to avoid any unnecessary problems down the road with any potential challenges to some of the members participating virtually, I think it's I think it's advantageous to us to have seven yes votes here in the room.'",
        "'speaker_3': 'And so for that reason as well, I put aside my misgivings and vote yes and just rely on the staff to implement these initiatives and get it right. Thank you.'",
        "'speaker_0': 'Thank you, councilmember. Someone to go to council member all.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_0': 'I am.'",
        "'speaker_2': 'Here we go. All right. Thank you, Mr. President. I want to thank Councilmember Torres for her inclusiveness of the disability community on another topic tonight. And in that similar vein, I just want to put on the record that I hope that future surveys include the disability community.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Horowitz, in other questions or comments, we are going to move on to the vote. So, Madam Secretary, try this a little bit different. If we can make this work a little bit better and you can hear everything, if all of you are participating remotely and unmute yourselves now and then if you can'",
        "'speaker_0': 'just pause for a quick second. In between the in-person and the Outlook Room, I think our audio work a little bit better. Is that really? No. All right. Don't do that. Okay. All right. Never mind. I'll just try and go through it slowly again.'",
        "'speaker_0': 'So I'm secretary. See if I've been. There you go. When you are. And you. All right. You should be getting a.'",
        "'speaker_1': 'Black.'",
        "'speaker_0': 'Car.'",
        "'speaker_1': 'When Brendan can eat Soya Torres. See the burka? I go more. I was hired.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Ortega. I. Sandoval. I council president.'"
    ],
    "Ordinance to Authorize Medical Marijuana Research and Development Facilities and Conform with State Statute.": [
        "'speaker_0': 'Madam Secretary, please. Both following up through the 13 hours, 13 eyes, accountability. Your decision has passed. All right. Please put the next item on our screens and you'll be ready to put up to six to on work this.'",
        "'speaker_0': 'They were supposed.'",
        "'speaker_3': 'To go to six to Series two 2020 to be placed upon final consideration and do that.'",
        "'speaker_0': 'Thank you, Madam Secretary. Are you going to move? We're going to go to council member. So the market. You are in use. You are.'",
        "'speaker_1': 'Thank you so much, Mr. Chair, and thank you, Councilwoman Cohen, each for delaying this last week so that I would have an opportunity to speak on why I would like to vote no and strongly encourage my colleagues to vote no on this ordinance.'",
        "'speaker_1': 'I think it's really appropriate that it's coming on the heels of our discussion around the new dispo ordinance. We've had legalized marijuana for almost a decade in our state in its different forms with medical, recreational, and to date, we don't have a disparity, a completed disparity study to reveal to us where the gaps are.'",
        "'speaker_1': 'We only know anecdotally that there are less than ten license owners that are black or brown in the state of Colorado and even less in the city of Denver. We have a major equity problem, and that is why I supported extending the the moratorium or the date until we start our new lottery.'",
        "'speaker_1': 'On the other ordinance, what I don't feel is appropriate is passing this ordinance tonight. This is an ordinance that opens up an entirely brand new license type. We know from experience that we did not plan well for other license types.'",
        "'speaker_1': 'We know that we had such severe inequities we needed to place a moratorium and caps on different license types in specific with gravity.'",
        "'speaker_3': 'You can find really good. No.'",
        "'speaker_1': 'Can you hear?'",
        "'speaker_0': 'Yup.'",
        "'speaker_1': 'And so now I believe that if we're going to delay the lottery for the other license types, we must delay the lottery for this brand new license type. We must delay opening the license type until we have an equity plan in place.'",
        "'speaker_1': 'Unfortunately, what this is going to do if we do not maintain it as a pilot, is that it opens the floodgates for outsiders, people outside of the state, to invest and participate in this industry. Because we've had the we've had those changes happen at the state level that allow for this to happen.'",
        "'speaker_1': 'All I'm asking for is either that we treat this initial license as a pilot and don't allow any other licenses of this type until we figure out our equity plan or that we pause on this license until we have an equity plan.'",
        "'speaker_1': 'The only thing being proposed is a mechanism for obtaining information. No benchmarks, no requirements, no expectations around equity that we would have for a new licensee under this license type. And so I'm asking my colleagues to think about the responses to the questions that we that I raised and how there's nothing in there that's going to protect'",
        "'speaker_1': 'our marginalized communities from the same thing happening again. That happened when we opened up our medical marijuana licenses and then our recreational licenses. Please vote no on this tonight. Give it one year to to become a part of our equity plan.'",
        "'speaker_1': 'Give us a year to think it through or treat this individual licensee as a pilot. Thank you.'",
        "'speaker_0': 'If you can't remember, don't see anybody else in the queue. So. Madam Secretary, I go to you for. Roll call. All right. Black are.'",
        "'speaker_1': 'Herndon can h. Sawyer. Torres. CdeBaca. No. Gilmore. I kind.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Ortega, I. Sandoval I Council President.'",
        "'speaker_0': 'Secretary Bruce $100,000.'",
        "'speaker_1': 'To advise.'",
        "'speaker_0': '2012 as well as to have passed that does include the little of numbers. Remember that this is a concern because this is your last chance to vote for a resolution to the document. No consideration on the floor. It is unusual for you.'",
        "'speaker_0': 'You. Go ahead.'",
        "'speaker_3': 'Good to go. Thank you. I move the resolution to be adopted and those final considerations are placed upon final consideration and do pass and block for the following items. All series of 2023, 42, three, 47 and 348 340 9301 300 340 208 237 230 8303 220 73043 ten 312 262 and two 9262 four.'",
        "'speaker_0': 'Just voted on. Not on. Right. Sure. Okay. So much to do. But everything else. Is that correct, Victoria? That's correct. Okay, great. And second tier. So. I'm secretary. Black.'",
        "'speaker_1': 'Black. Flynn. Herndon. Sawyer. Torres. CdeBaca.'",
        "'speaker_0': 'I'm sorry.'",
        "'speaker_1': 'Stuart. About the Gilmore Girls. I can't. I Cashman. I Ortega.'",
        "'speaker_0': 'I want.'",
        "'speaker_1': 'Sandoval High Council president.'",
        "'speaker_0': 'Voted.'",
        "'speaker_1': '1313.'",
        "'speaker_0': 'On the resolutions I've been adopting and the bills have been placed on final consideration and due to council will not take recess as evening and single the business for this body. This meeting is adjourned.'"
    ]
}