{
    "Rezoning of Property in Barnum West from Single Unit to Mixed-Use.": [
        "'speaker_4': 'Looking at the blueprint Denver future growth strategies again this is these parcels are considered community centers and corridors which are anticipated to see around 25% of new housing growth and 20% of new employment growth by 2040. Most growth in the city is guided to regional centers, community centers and corridors and select districts of high and medium, high'",
        "'speaker_4': 'intensity residential areas. And this community centers and corridor certainly falls within that anticipated growth pattern. So Blueprint Denver contains three equity concepts to help guide change to better to benefit everyone, and each equity concept has associated measurements that help inform implementation actions through large rezonings and one with other implementation actions.'",
        "'speaker_4': 'CPD undergoes the equity analysis when a parcel is proposed to be zoned at five acres or larger at 5.1 acres, this site did undergo an equity analysis. Our first equity concept is access to opportunity. So the basis for measuring access opportunity is a composite of the Neighborhood Equity Index developed by Department of Public Health and Environments, proximity'",
        "'speaker_4': 'to high capacity, infrequent transit and access to centers and corridors. Access to opportunity helps us to consider if we are making progress towards achieving the vision for complete neighborhoods across the city. So this subject property is an area with moderate access to opportunity score as well.'",
        "'speaker_4': 'One access to community corridors and centers and scores average on the equity index measurements. Those are social determinants of health, access to health care, child morbidity and built environment subjects while scoring poorly on access to transit. I did want to caveat that, that the access to access to transit metric is specific to two rail transit.'",
        "'speaker_4': 'There is a so while the subject site scores poorly on access to transit due to little proximity to light rail stations, the RTD number three bus line has a stopped directly in front of the property on Alameda Avenue.'",
        "'speaker_4': 'The second equity concept is vulnerability to involuntary displacement. Basis for measuring this metric is the vulnerability to use Displacement Index, developed by the Denver Economic Development and Opportunity Office. This combines data from median household income percentage of people who rent and percentage of population with less than a college degree.'",
        "'speaker_4': 'This application scores actually. Pardon me, the parcels associated with this application score a moderate to high vulnerability to involuntary displacement, displacement scoring vulnerable. In two of the three metrics that's median household income ratio and bachelor's degree attainment ratio and not vulnerable on the third metric of rental occupancy ratio.'",
        "'speaker_4': 'The application identifies the Salvation Army's housing and components are paired with programs that provide career guidance and workforce training, initiatives that allow those living on their property the opportunity to incrementally move their way up, creating new and better opportunities.'",
        "'speaker_4': 'Staff finds that this rezoning application has the potential to have a positive impact on the vulnerability to displacement metric if the Salvation Army is able to. To continue with the services that they have outlined in their application. So the third concept in equity is expanding housing and jobs, diversity.'",
        "'speaker_4': 'We're looking at the housing map here. Housing diversity map combines census tract level data measuring the percentage of middle density housing, and that's housing with 2 to 19 units. Home size, diversity, ownership versus rental housing costs and the number of income restricted units.'",
        "'speaker_4': 'So this parcel is in an area that scores not diverse in four of the five metrics. There is diversity in home size, but housing diversity, tenure diversity, housing costs and number of affordable units. Are all. Not as diverse as.'",
        "'speaker_4': 'As as desired. The application. The applicant states in the application that the proposed development on the site would create a greater mix and range of housing types in the Burnham West neighborhood, offering diversity and housing types with amenities attached and supported by programs through the Salvation Army.'",
        "'speaker_4': 'Steph concurs with this based just on the on the base zoning of the mixed three, multi-unit residential is an allowed use in the proposed zone district and that can have a positive impact on the housing diversity by allowing an increase in the number of multi-unit residences in the area.'",
        "'speaker_4': 'And finally, to jobs diversity. So this map shows the mix of jobs depicted by color within the city block groups with less than 100 total jobs, including the block that this parcel falls in, do have less than 100 jobs.'",
        "'speaker_4': 'So we're left out of the analysis. So there are not a whole lot of jobs located in this area. The proposed zone district max three allows for a very for various commercial office and retail jobs. And increasing access to a range of many quality jobs enables people of different incomes and education levels to find employment and wealth'",
        "'speaker_4': 'building opportunities as there are few jobs in this area. Staff finds that this application could have a positive impact on the area's job diversity by allowing a zone district that allows for more and different commercial and. Office retail uses.'",
        "'speaker_4': 'Moving on to consistency with the neighborhood plan. So the Barnham Barnham West Neighborhood Plan was adopted in 1986. Some of the key concepts within the plan were a desire to maintain residential zoning along West Alameda, developed setbacks and landscape policies for new developments within the neighborhood business zones.'",
        "'speaker_4': 'Focus on developer owner occupied infill and am looking for traffic solutions. I wanted to call attention to one specific recommendation in this plan that is now 34 years old. It shall be the recommendation to maintain the residential zoning along West LME Avenue and to selectively review any proposed developments which might be advantageous to neighborhood interests through the'",
        "'speaker_4': 'planned unit development approach. In the years since this plan guidance was initially developed, the city has moved away from a preference towards customized zoning and plan unit developments. The adoption of the 2010 Danbury Zoning Code greatly increased the menu of available zoned districts, with the hope that customized zoning would be less necessary.'",
        "'speaker_4': 'And given the many more standard options now available that could be tailored best to a community needs. Further blueprint Denver explicitly recommends against the use of custom zoning solutions, such as periods when standard zoned district solutions are available due to the problems that arise, inconsistency and inefficiency of administration, among other challenges.'",
        "'speaker_4': 'So I just wanted to point out that that recommendation for a PD approach would seem to be outdated with current plans. And while a mixed use zone district is not a residential zone district, the M three does not preclude the development of residential uses.'",
        "'speaker_4': 'And in fact, the applicant is. Again, not germane to this rezoning application, but the applicant is proposing to develop four multifamily I'm sorry, multi unit residential in this area. Criteria. Two, there are no waivers or special considerations being made.'",
        "'speaker_4': 'It will be standard zoned district being adopted, which is consistent with uniformity of district regulations. Number three, furthering of public health, safety and welfare. This rezoning is consistent with this criteria, primarily through implementation of adopted plans and allowing for a mixed use of districts which enable a mix of uses on one zone which allows people to live'",
        "'speaker_4': ', work and play in the same area. Reducing car trips and achieving improved public health outcomes. For a justifying circumstances. A significant portion of the person has retained chapter former Chapter 59 zoning in the form of 5550. So that in and of itself is a justifying circumstance to get it into a new standard zone district.'",
        "'speaker_4': 'And the applicants also note the change to such a degree that the proposed rezoning is in the public interest and that is specific to the e sud x parcel two on the eastern edge of the proposed rezoning. Geoff also finds that the proposed rezoning is consistent with the neighborhood context on district purposes and intense the request to'",
        "'speaker_4': 'the maximum district is within their advantage. Neighborhood context again generally consists of single and two unit residential with uses with small scale multi-unit residential uses and commercial areas typically embedded in the residential areas. And the general purpose for the mixed use zone districts, as stated in the DCC, is to promote safe, active and pedestrian scaled diverse areas'",
        "'speaker_4': 'through the use of building forms that clearly define and activate the public street edge and ensure new development contributes positively to established residential neighborhood and character, and improves the transition between commercial development and adjacent residential neighborhoods. I also wanted to take this moment to clarify that this parcel would be subject to protected district standards as it is'",
        "'speaker_4': 'surrounded by some single unit and two unit zoning. So keep that in mind as well. And again, talking about the earmarked three districts specifically applies to areas or intersections or primarily by collector or arterial streets where a building scale of 1 to 3 stories is desired and the property to be resolved is on Alameda Avenue, which is'",
        "'speaker_4': 'classified as a mixed use arterial street, and the desired building heights articulated in redacted plans are up to five stories. And again, the request here is only to go to three. CVD recommends City Council approve the application based on a finding that all review criteria have been met.'",
        "'speaker_4': 'The applicants are available for questions, as am I. Thank you.'",
        "'speaker_0': 'All right. Thank you, James. Council has not received any written testimony on Council Bill 966, and we have six individuals signed up to speak this evening. And I'd like to remind the speakers to please give us your name and city of residence.'",
        "'speaker_5': 'And our first.'",
        "'speaker_0': 'Speaker is going to be Brant Bartels.'",
        "'speaker_4': 'Madam President, Brant is with the applicant team and perhaps is not prepared to offer testimony at this time. All right. He should be on the line.'",
        "'speaker_0': 'Yeah. Check in with the staff. We want to, at least since we're in the public hearing portion, have Brant. Come on up. Because if he'll answer questions, we want to acknowledge him. And so we'll go ahead and. I try to get.'",
        "'speaker_0': 'It's not looking like we have Brant. So we'll go ahead and move on to Brian Conley.'",
        "'speaker_4': 'Good evening, Madam President. Members of council, this is Brian Conley with the law firm of Arden Johnson. I'm the project's land use attorney, and Brant and I are both on for the purpose of answering questions. So I'll leave it at that.'",
        "'speaker_4': 'And Major Richard Pease of the Salvation Army is I'm going to be giving the outlook and presentation.'",
        "'speaker_5': 'All right.'",
        "'speaker_4': 'I Major Richard Pease. I reside in Lake.'",
        "'speaker_0': 'Oh, you know, we're going to go ahead, Mr. Pease. We have you scheduled a bit further down, so we'll.'",
        "'speaker_4': 'Go.'",
        "'speaker_0': 'And come back to you here. Next up, we have Jessie Parris first. Go ahead, Jessie.'",
        "'speaker_3': 'Was a council that marched Apple. The missile. Pierce and I live in District eight. In Denver, Colorado. Now from Denver, it's now black star for self defense calls for social change as well as the of Colorado and mile high schools.'",
        "'speaker_3': 'Now will be the next mayor of Denver in 2023. And a few questions for the occupant. With this rezoning, I want to know exactly what is going to be here. A saying something about mixed use commercial. Is it going to be shops?'",
        "'speaker_3': 'Is it going to be a mix of housing and shops? If there's going to be house, then what is going to be the Amala before the house? And if there's not going to be house, then what kind of shops are going to be present and how long?'",
        "'speaker_3': 'If doing so, would it be actually affordable? Would it be for 20, 60 years? 100 years? And was there a traffic study done? It's not complete to answer those questions. I was going. Appreciate it. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. Next step now we have Richard piece. Go ahead, sir. And we're going to need to go ahead, Richard, and have you unmute.'",
        "'speaker_4': 'All right. Have you got me there now? Mm hmm.'",
        "'speaker_0': 'Yep. Go ahead.'",
        "'speaker_4': 'Great. So I'm Major Richard Pease with the Salvation Army. I'm a resident of Lakewood, but I do work at the Salvation Army on 1370 Pennsylvania Street here in downtown Denver. So, honorable members of city council, it's my privilege to represent Salvation Army this evening.'",
        "'speaker_4': 'I would just share with you that we are committed to serving our neighbors in need in the Denver metro area. Having been here since 1887, keeping our promise of doing the most good for our community. And we plan to do so for at least the next 133 years.'",
        "'speaker_4': 'We are seeking this rezoning as our property is currently under a very restrictive period which effectively only allows for what is currently built on the site and prevents us from best serving the needs of Denver rights. The proposed IMX three zone district would allow us to build housing first trauma informed model bridge housing, providing comprehensive case management'",
        "'speaker_4': 'for up to 85 homeless families at a time, enabling them to get back on their feet to build a new core community center, which would be a gathering place for the neighborhood, providing after school programs, a gymnasium that the community may use, programs for seniors and much more, and to build a new regional headquarters and administration building'",
        "'speaker_4': 'on our property. While Blueprint Denver Height Guidance calls for up to five stories on this site, we believe the proposed zone district allows for a project that will provide significant community benefits while being in line with the character of the neighborhood.'",
        "'speaker_4': 'We're particularly excited about the opportunity to build the new bridge housing, which will expand on the success of our existing Lamberth Family Center at 29th and federal. Last year, 79 families were served using the Housing First Trauma Informed Care model, and 98% of them exited into permanent, stable housing, giving the current circumstances, we believe more strongly than'",
        "'speaker_4': 'ever that housing like this will be necessary for families in the years to come. We also believe that this will be a win for the residents of the city and county of Denver. Building on our existing partnership with Denver, working together, we will continue to address the issue of homelessness among families in a Housing First trauma informed'",
        "'speaker_4': 'care model that seeks to break the cycle of poverty and meet people where they are at. Together, we can provide life transforming services to our neighbors in need. We hope to have your support and we are happy to answer any questions that you may have on this rezoning proposal.'",
        "'speaker_0': 'Thank you. Our last speaker is comrade defense.'",
        "'speaker_4': 'Hello. City Council of Denver. Fuck you. Me, Major. Whatever. From the Salvation Army. 75 families. Really? 75 families. Today alone, myself and some comrades fed over 200 individuals and families. I distributed over $300 worth of emergency winter gear that the city and county of Denver fails to do.'",
        "'speaker_4': 'It is going to be freezing tonight. It is wet outside. People are going to die. And we're talking about rezoning. We're talking about pedestrian friendly walkways, which really is just a racist term and a way in which you're going to prevent homeless people from being able to find somewhere to survive.'",
        "'speaker_4': 'Fuck you.'",
        "'speaker_3': 'Major. Fuck you.'",
        "'speaker_5': 'We'd ask you to please address.'",
        "'speaker_0': 'The council as a whole.'",
        "'speaker_4': 'Figure out how to better serve the city. These are residents. They're human beings. People. It's not people. Over the top property. Over people. People over property. I am ashamed of how this city is falling apart.'",
        "'speaker_3': 'Fences everywhere. What is this, The Hunger Games?'",
        "'speaker_0': 'We're asking you to. Where are you on the rezoning for zero nine?'",
        "'speaker_4': 'Getting their houses dry, cozy while thousands are freezed. Seeing what you can actually see.'",
        "'speaker_0': 'From the.'",
        "'speaker_2': 'There. I don't give a fuck.'",
        "'speaker_5': 'I read.'",
        "'speaker_4': 'My first three.'",
        "'speaker_0': 'Merits of the fuck.'",
        "'speaker_3': 'You President. Fuck you. It's a race.'",
        "'speaker_5': 'To.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_5': 'On.'",
        "'speaker_0': 'The merits of the rezoning. All right. Thank you. That concludes our speakers this evening. Questions from members of council. Councilwoman Torres.'",
        "'speaker_1': 'Thank you, Madam President.'",
        "'speaker_5': 'My first question is for James from CPD. One of the things that you mentioned wasn't something I have a lot of understanding about. It was the subject to protected district standards. Can you describe that a little bit more for me?'",
        "'speaker_4': 'Absolutely. So the protected districts are any of our single unit or two unit districts within the city of Denver. And the protected district standards are specifically designed for the single and two unit zone districts that are adjacent to non protected districts.'",
        "'speaker_4': 'So in adjacent to mixed use zone districts or commercial zone districts or something like that. And I don't have the memorized, but there are, you know, a series of setbacks and setbacks and things that are designed to allow white access and deference in general to the single unit and to unit zone districts.'",
        "'speaker_4': 'You know, in recognition of it being a, you know, there being a transition area from community corridor areas to more residential areas.'",
        "'speaker_5': 'What would that look like with with this particular project?'",
        "'speaker_4': 'So that would look like, as I sort of mentioned, enhanced setbacks and and setbacks in bulk planes to properties. So this is there are single unit districts to the specifically to the north. Weather map for you. So again, to the north, west and east, there are single unit zone districts in direct proximity to this parcel, so they'",
        "'speaker_4': 'would have to comply with additional set back and bulk plan requirements. I don't have them pulled up off the top of my head, but it's a.'",
        "'speaker_5': 'Yeah, I know James Justin even in big picture, not really knowing what like blueprints are what they're exactly planning the the prop there's a big green there's a big open field in a large part of the property. If they were to build something there, you're talking about four three stories.'",
        "'speaker_5': 'It wouldn't be three stories right up to the house. It would have.'",
        "'speaker_4': 'Yes, that's exactly that's exactly what we're talking about.'",
        "'speaker_5': 'Okay. Okay. And, Major. I'm sorry, Mr. Pease. The. Question around. The project that you're you're hoping to build. I'm I'm thrilled about the prospective of the community center there, the bridge housing. It really is one of those kind of housing components that's desperately needed.'",
        "'speaker_5': 'I am curious, though, about the potential of it not getting built and what would happen to the property in in that circumstance.'",
        "'speaker_4': 'So. Councilmember, we would not proceed with construction until we have the funds for the project. And unless we do the project, we don't plan on making any changes to the property. So we've been there since the seventies and we're not planning on going anywhere.'",
        "'speaker_4': 'We just want to improve the services that we provide on our property.'",
        "'speaker_5': 'Okay. Madam President, I think those were all of my questions for now.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Torres. Councilwoman Ortega, you're up.'",
        "'speaker_5': 'Thank you, Madam President. My first question is for James. James, on this particular site, will there be a separate curb cut into the property or will they have to pull it off one of the side streets? I'm trying to figure out whether or not that's going to require any approvals from C dot.'",
        "'speaker_5': 'I believe this is a state highway corridor. I could be wrong about that, but wanted to get your input on that.'",
        "'speaker_4': 'Thank you for the question, Councilwoman Ortega. I do not know the answer to that question and I would be happy to try and find it out for you.'",
        "'speaker_5': 'Okay. I know with some of our projects that we've done in various areas of the city where it does require a curb cut, sometimes it hasn't always been that cooperative. And I'm not sure, Mr. Pease, you may be able to speak to kind of where the traffic will come off of Alameda into this site.'",
        "'speaker_4': 'Sure. I would just we would continue to use the curb cut that we have that goes to our existing senior residents. That would be the main curb cut. We do also actually have three three on the property already, and we're actually going to be taking that down to two.'",
        "'speaker_4': 'So certainly that all, I believe, happened during the design phase.'",
        "'speaker_5': 'Okay. And so besides the 85 units, first of all, can you talk about what the bedroom sizes are that you're looking at? And then is there any other anticipated housing besides those 85 units?'",
        "'speaker_4': 'So certainly the current plans are still in development, but we're looking at a 450 square foot apartment per family that has the bedrooms and a bathroom in it, and there would be no additional housing on the campus.'",
        "'speaker_5': 'So those are very big families. There are only 450 square feet.'",
        "'speaker_4': 'They're about twice the size of our current rooms at the Lambeth Family Center.'",
        "'speaker_5': 'Okay. Okay, let's see. So will you be looking to get any low income tax credits for the project?'",
        "'speaker_4': 'We would certainly be open to any funding opportunities that would be available. And I would also. I'm sorry. Go ahead, Councilmember.'",
        "'speaker_5': 'I'm just asking if you have someone on your team that's familiar with the low income tax credit process, because it can be very cumbersome and it's rare that an applicant gets funding their first time out of the chute.'",
        "'speaker_5': 'It also requires support from the city if you're going to be asking for any city financing, because that helps sort of, you know, kind of line you up for for a greater approvals at the at the charter level.'",
        "'speaker_4': 'Sure. We do have legal counsel that's familiar with the low income housing tax credit process, and we have been successful in other jurisdictions in obtaining that. So we're confident that if we were to move in that direction, we could be successful in partnering with the city on on getting that.'",
        "'speaker_4': 'And then if I could, just going back to your question about the unit sizes. I did want to mention that we are actually designing the property as well to have all of the the units be interconnected with adjoining doors so that as family sizes change, we could scale up to give them two of the units if it's'",
        "'speaker_4': 'a a, you know, a six or eight member family. So we certainly wouldn't expect a large family to be put into a small space.'",
        "'speaker_5': 'Right. Okay. So the commercial space, a lot of that will be your admin offices moving to the campus still, is that correct?'",
        "'speaker_4': 'Correct. So the the we are moving our divisional headquarters, which serves as the regional administration for Colorado, Utah, Wyoming and half of Montana onto the property. We are taking it down from our current size, partly because of COVID, partly because of the requirements of the property.'",
        "'speaker_4': 'But it will give us a more cost effective way to serve the community and probably reuse a building we have on Capitol Hill that there are others in the community that could make better use of it than us.'",
        "'speaker_5': 'I was going to ask if that if this project is contingent on selling that property, or do you intend to continue to keep and utilize it for other purposes within your Salvation Army family?'",
        "'speaker_4': 'Sure. We do plan on on selling that property. We believe that there are significant folks in the community that would love to to be there and would provide a significant funding towards the project for the privilege.'",
        "'speaker_5': 'Okay. Thank you. Those are all the questions I have, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. Councilman Flynn.'",
        "'speaker_4': 'Thank you, Madam President. James, maybe you could address just the basic question for me on the selection of the image, the reason for this. Did you were any other zone designations considered with the applicant? There's already a five storey building on the site, six storeys.'",
        "'speaker_4': 'If you go on the north side downhill and IMX three is one, two, three storey. So I'm just wondering, does the existing.'",
        "'speaker_3': 'Building.'",
        "'speaker_4': 'Become a non-conforming use or was there some other zone designation that was that was discussed here? What an excellent question. Let me go to some of my hidden slides. I ask only excellent questions. The reason I ask is because if it does become a non-conforming use in the next three, there might be restrictions on alterations or changes'",
        "'speaker_4': 'to the existing building that might in the future be problematic. I'm just wondering if that was discussed and vetted. Yes, sir. So this question came up, that planning board as well pulled the relevant zone section or definition. So the five storey structure would become a compliant structure, which is a structure that was legally established that meets one'",
        "'speaker_4': 'of these two following conditions. So in this falls in number number two, the legally established structure was conforming under former Chapter 59 on June 24th, 2010, but does not currently comply with an rezoning code building height standards, citing form standards or design element form standards.'",
        "'speaker_4': 'So we have there are different levels of, you know, conforming compliance, illegal, irregular. This is the most lenient of those of those forms. They would not have issues. They couldn't put a sixth or seventh storey on top of it, obviously, but they would not have issues in modifying the existing structure.'",
        "'speaker_4': 'Okay. That was my one concern with this. Thank you, Madam President. That's all.'",
        "'speaker_0': 'All right. Thank you, Councilman. Councilwoman Sandoval.'",
        "'speaker_2': 'Thank you, Madam Chair.'",
        "'speaker_1': 'So my question is for the Salvation Army. You have your you used to be headquarters in Globeville, correct? SS Pennsylvania. Yeah, we had a site down there.'",
        "'speaker_4': 'If you're referring to our adult rehabilitation center, that was at the rate below where 25 and 70 crossed. That's actually a different part of the Salvation Army. That wasn't a facility under our purview.'",
        "'speaker_1': 'What part? How can you explain that in a different way?'",
        "'speaker_4': 'Sure. We have an adult rehabilitation center command that handles all of our adult rehabilitation centers in the 13 Western United States. And that is, well, we're one Salvation Army. We have different departments, as you can imagine. We're pretty, pretty significant sized.'",
        "'speaker_4': 'And so they handle the alcohol rehabilitation program. So that was their men's residence that is temporarily suspended operations. While we're trying to find they're trying to find a new location and restart that program. They do still have a women's residence here in operation in north northeast up near Westminster.'",
        "'speaker_1': 'Okay. Thank you. How can we guarantee that you won't sell this land? Now that I know you've been here for a long time, that in if you look at the redevelopment of Denver as a whole zone, districts that are red zone two or three stories have the most desirability through developers.'",
        "'speaker_1': 'And this one. Did you talk about adding a date and a development agreement with the Office of Housing Instability? Did you talk about entering into some type of housing agreement or a development agreement so that we can guarantee that the actual affordability of this land will be there?'",
        "'speaker_4': 'Oh. Oh, there you go, Brian. Yeah. Councilman, the end of all this is Brian Connelly, land use attorney for the project. We did have those conversations, as I think you're aware, at the Luti committee hearing. But the idea of having a development agreement that would basically obligate the Salvation Army to remain at this property was discussed, and'",
        "'speaker_4': 'we explored that with the city attorney's office. And I will just say that the Salvation Army was willing to enter into some type of agreement like that. The reality is that under both city and state law, zoning regulates, uses, not users.'",
        "'speaker_4': 'And so the city doesn't actually have the authority to enter into an agreement that would obligate a particular user to remain at the property. Now, with respect to the question of whether.'",
        "'speaker_1': 'Talking about so you're you're speaking to a different type of a development agreement, I would never want a development agreement that says the Salvation Army had to stay on the land. That's ridiculous. I'm talking about a development agreement that the city.'",
        "'speaker_2': 'Often.'",
        "'speaker_1': 'Times enters into where it requires affordability for the build for the for the developer. I would never. So if you have we're talking about a type of development agreement that made the Salvation Army stay with the land. That's not legal.'",
        "'speaker_1': 'But I'm talking about a type of development agreement that says if you redevelop this land, you will develop 80% units or ten 20% units at 80% AMI. That happens all the time.'",
        "'speaker_4': 'Yeah. And where that happens and I guess I would also, as a member of the city attorney's office to speak to this, where that typically happens is where there is an up zoning occurring, where there's a height increase that goes over and above what blueprint Denver calls for.'",
        "'speaker_4': 'And my understanding is that it's not the city's practice to require that where you have a zoning designation that generally complies with the blueprint designation, as is the case here.'",
        "'speaker_1': 'Well, that's that's new to me. So I've never heard that before because you can't get a rezoning if you don't follow Blueprint Denver standards. So each applicant has to be within the recommendations within Blueprint Denver's. It would be odd for us to be approving something that goes above and beyond the recommendations of Blueprint Denver.'",
        "'speaker_1': 'Correct. Intoning stay within the form of Blueprint Denver. And I'm working on several in my council district. So contrary to your belief, we, we, we enter into these all the time at Denver City and the city and company of Denver does.'",
        "'speaker_4': 'Correct in your code criteria though don't contemplate entry into a development agreement as just a matter of course.'",
        "'speaker_1': 'No, you're correct. It's not it's not required. There's nothing that is required right now because of the Telluride agreement until the state amends the Telluride. I'm asking why you didn't voluntarily do that. If that is your mission for the Salvation Army, it doesn't seem like it would be above and beyond anything that goes beyond the mission of'",
        "'speaker_1': 'the Salvation Army. It actually seems like it is in alignment with the Salvation Army and their mission to house those most vulnerable in who need housing. So I'm just wondering why it wasn't done yet.'",
        "'speaker_4': 'Like I say, Councilman Sandoval, we offered that we were willing to enter into this agreement. We were told that this was not a circumstance in which the city would enter into this type of agreement. So I guess I would defer to staff and the city attorney's office for further explanation.'",
        "'speaker_0': 'And Councilwoman Sandoval, we have Adam Hernandez from the city attorney's office.'",
        "'speaker_1': 'I don't think it. But but with all due respect, Madam President, it's not Adam Hernandez. It would be with someone, Britta. Because oftentimes we enter into our development agreements with the Housing the Office of Housing Stability. We don't enter into the agreements with Adam Hernandez.'",
        "'speaker_1': 'So I'll just I'll quit asking my questions. But I just find it interesting that you were not willing to enter into a development agreement when you are rezoning and you are abandoning the rest of the land from the current PWD.'",
        "'speaker_1': 'Thank you, madam. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman Sandoval. And James, I think we can go ahead and have you stop sharing your screen for us. Thank you for putting up the complaint structure. Slide up. All right. And our next question is from Councilwoman Each.'",
        "'speaker_1': 'Thank you, ma'am. I'm president. A couple of the questions here I think might be clarified by a little more clarity on the type of housing. So, major, please, you use this term bridge housing, which kind of is, you know, I think it may be an insider term.'",
        "'speaker_1': 'Can you clarify a little bit about the difference between bridge housing and like what we would consider permanent housing? That is an apartment with a kitchen that, you know, so tax credits, for example, and some of the types of housing agreements were describing are generally for permanent housing, where a family has a lease and they get to'",
        "'speaker_1': 'stay until, you know, the end. And so can you just, I think, talk a little bit more about bridge housing and what it is and how it's different.'",
        "'speaker_4': 'I'd be happy to. So bridge housing, which uses the Housing First trauma informed care model, is specifically designed to be 90 days or less. So the idea here is not that we're building transitional housing. That's up to two years, which is, as you mentioned, one of the requirements generally of low income housing tax credits, which is why'",
        "'speaker_4': 'we've thought about it, but not really explored that too deeply. That is the model that we use at Lambeth, which is very successful and we believe that in moving forward with that model, if we expand to 85 units, we could conceivably for those who don't know, Lambeth Family Center has 20 units, so we're talking over four times'",
        "'speaker_4': 'the number of units, which means that we could conceivably help four times as many families each and every year with with our bridge housing, which, as I said, is up to 90 days, offers intensive case management. We also do some case management after the fact, combined with several other programs that we do, as well as other providers'",
        "'speaker_4': 'in the Metro Denver Homeless Initiative and the various partners that we have, including the city and county of Denver and with host that is that helpful? Councilmember.'",
        "'speaker_1': 'I hope so. Thank you. Okay. I'll I'll I'll save the rest of your comments. Thank you.'",
        "'speaker_4': 'All right. You're welcome.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. Councilman Hines.'",
        "'speaker_5': 'Thank you, Madam President.'",
        "'speaker_4': 'Major peace. Do you. Do you currently serve anyone who needs this housing? Is there. Is there anyone that you might turn away who might apply or be interested in this housing? No, councilmember, we. Our mission is to meet human need without discrimination, so we do not turn folks away.'",
        "'speaker_4': 'I do know that we do work very closely with coordinating entry to make sure that folks are coming through, both coming through coordinated entry so that we can make sure they have access to all of the resources that are available throughout Denver Metro.'",
        "'speaker_4': 'That's just more of a technical side of things, but we definitely do not turn away folks that are in need. So there's there aren't any classes or protected classes like the LGBT community except anyone who applies or anyone who meets the qualification space available.'",
        "'speaker_4': 'Yeah, typically the qualification is the spaces available and you generally have to be literally homeless or we have a referral through a coordinated entry. So other than that, to be honest, we don't ask any of those other questions because they're not relevant when someone is homeless or hungry or cold or needing needing housing.'",
        "'speaker_4': 'Thank you, Major. I would agree. One other question. What about accessibility for people with disabilities who people who have mobility impairments or intellectual disabilities? Is that are you are you considering that population as well? We are as we as we develop the program elements.'",
        "'speaker_4': 'Certainly, this is kind of an on ongoing process to improve that. Certainly the building will be built to all ADA specifications. And then from a programs perspective, we will make sure that we tailor that's part of the the Housing First trauma informed care piece that goes into that may have we have several experts in our social services'",
        "'speaker_4': 'department that work with that and certainly we work with Host as well and would collaborate on making sure that we met those needs. Yeah. Thank you again, Major, for those comments. I think I actually saw you on the sidewalk in front of your location and cattle and that's my district.'",
        "'speaker_4': 'And I think you you happened to be walking by as I was rolling by. So could could be. I like walking out for lunch occasionally, especially down to the Great Wall. They have good orange chicken. Yeah. Yeah, I, I heard I've heard people come from all over the metro area to, um, to that particular Chinese restaurant, so'",
        "'speaker_4': '. But your on your location and Kapil is a gem. I'll just. I'll just look at that. Thank you, Madam President.'",
        "'speaker_0': 'Councilman. Councilman Torres.'",
        "'speaker_5': 'Thank you, Madam President. Major piece. What's the space? The square footage of the open space that you have now.'",
        "'speaker_4': 'I would have to defer to my team so much. I don't have that number off the top of my head. So either Brant or Brian, does one of you have that number? I don't have the current open space in the property and I think rent might be on.'",
        "'speaker_4': 'He may be a participant and with his hand raised.'",
        "'speaker_5': 'That's okay. I don't need an exact figure. Off topic. I'm just wondering if you had or the Salvation Army had considered whether or not this face could be used for an open campsite like a safe outdoor camping location.'",
        "'speaker_4': 'We have not discussed that with the Safe Outdoor Spaces Committee.'",
        "'speaker_5': 'Would you mind if I followed up with you about that?'",
        "'speaker_4': 'Sure. I'd be happy to to discuss that with you, Councilmember.'",
        "'speaker_5': 'Okay. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman Torres. All right. Seeing no other questions from my colleagues. The public hearing for Council Bill 20 Dash 20966 is closed. Comments by members of Council. Council Member Torres.'",
        "'speaker_5': 'Thank you, Madam President. This I appreciate the amount of engagement that the Salvation Army has done with neighbors and through a number of back and forth comments. I think it was really important that all of the property owners and residents that surround this property in what is now a pretty large, wide open space, know and appreciate kind'",
        "'speaker_5': 'of what what your vision is and and and what your what you're hoping to build. I 85 units is 85 units. And I think everyone is is necessary and needed. And so I appreciate the work that you've all undertaken to to try to bring that to reality.'",
        "'speaker_5': 'Thank you, Madam President. And I look forward to supporting the project.'",
        "'speaker_0': 'Thank you, Councilwoman Torres. Councilwoman Canete.'",
        "'speaker_1': 'Thank you. Madam President, I also just want to thank the team for having done outreach extensively over, I think probably well over a year ago, if not longer ago, that I first heard about this. And, you know, the inclusion of a range of services.'",
        "'speaker_1': 'Right. It's hard to believe gymnasiums right this moment. Right. It feels very far away in our future. But we know that more than ever, kids will need places to go to recreate when they can safely. And, you know, in particular, I think that bridge housing is is an example of the range of options we need.'",
        "'speaker_1': 'We have a lot of families that, you know, kind of fall off the cliff of motel and shelter before they're able to get the permanent housing. And so that that word bridge, it literally means kind of that that feeling of that gap.'",
        "'speaker_1': 'And so, you know, I do think that your history in the city and, you know, I appreciate the experience you all have had running emergency camps in other countries for those who are refugees of war and civil unrest.'",
        "'speaker_1': 'And in our case, we have economic conditions here. And so, you know, I also am assured I appreciated the questions about not turning anyone away, although our federal government took a minute to try to undo a number of anti-discrimination provisions in the shelter arena, which I think bridge housing will more likely fit under that than housing.'",
        "'speaker_1': 'But we also have state public accommodations laws that cover the full range of housing. And so if anyone needs, you know, reassurance about that, we've spent a lot of time over the past few years educating providers on the range of anti-discrimination protections.'",
        "'speaker_1': 'So I'm excited that that we are, you know, moving forward with this rezoning today that meets the criteria in particular for the land use change proposed. But it's always great when the use is also something our community needs.'",
        "'speaker_1': 'So thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman Canete. And I'll go ahead and chime in as well. But based on the criteria, this rezoning meets all of the guidelines that are laid out for it, and I would encourage folks to support it. Madam Secretary, roll call.'",
        "'speaker_2': 'Tourist. I. Black I. See tobacco. Clark, I. When?'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Brendan, I. Hi. I. Cashman.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'I. Ortega, I. Well, I. Sawyer. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the result.'",
        "'speaker_2': 'Climate.'"
    ],
    "Denver Zoning Code Text Amendment #7: Urban Edge Single Unit B1 Zone District.": [
        "'speaker_0': '12 Eyes Council Bill 966 has passed. Councilmember Black, will you please put council bill? 1027 on the floor for final passage.'",
        "'speaker_1': 'Yes, Madam President, I move that council bill 20 dash 1027 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. You've got either Herndon or Hines.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_0': 'Thank you. Councilman Herndon, the combined public hearing for Council Bill 1027 and Council Bill 1028 is open. Speakers may offer comments on either, either or both items after the conclusion of the public hearing. Council will vote separately on each.'",
        "'speaker_0': 'May we please have the staff report and we have Liz Weigel up.'",
        "'speaker_1': 'It evening. Thank you, Madam President. And Council members. Can you see my presentation carefully? This presentation will cover both the Text Amendment and Map Amendment, both of which are sponsored by Councilwoman Amanda Sandoval in order to allow accessory dwelling units or to use in the Chaffee Park neighborhood.'",
        "'speaker_1': 'The tax amendment creates a new zone district, the ESU B1 district, which would allow accessory dwelling units on single unit residential lots with a minimum lot size of 2500 square feet. The map amendment reasons all single unit residential districts in Chevy Park to allow accessory dwelling units.'",
        "'speaker_1': 'While I'm presenting the two amendments to concurrently text amendment must be considered for approval first. This will allow consideration of the MAP amendment pending the establishment of a new zone district. The proposed rezoning is located within Council District one in the Chaffee Park neighborhood.'",
        "'speaker_1': 'It includes the area in Chevy Park that has residential zoning. This includes approximately 1400 parcels bounded by Federal Boulevard, Osage Street, 52nd Avenue and Interstate 70. The proposed Map amendment intends to rezone properties between federal and town that are currently ESU dx2 ESU d1x properties b between Tyrone and Paco Street that are currently ESU B to the'",
        "'speaker_1': 'proposed ESU b one zone district properties between Pecos and Osage that are currently ESU d t s d once the proposed zone, districts are the same as the current zoning districts, except that they would allow accessory dwelling unit use either within the primary structure or in a detached structure.'",
        "'speaker_1': 'Similarly, the new ESU b one district would retain the same standards of the ESU district, but would allow it to use. I'll go over the existing context. The proposed rezoning area is currently if you be if you Denise had access I mentioned all three zone districts are single unit residential districts and they allow the Urban House primary'",
        "'speaker_1': 'building form with a maximum height of 30 to 35 feet. The district also allows the suburban house primary building form. There is a view plane in this portion of this area that starts at the park at 4/51 Street and extends towards downtown.'",
        "'speaker_1': 'This results in building height limits, ranging from approximately 34 square feet at the south end of the park to approximately 75, 79 feet towards Interstate 70. This range of heights generally exceeds the allowable maximum height for both the current and proposed zone districts and does not.'",
        "'speaker_4': 'Impact the rezoning.'",
        "'speaker_1': 'In terms of existing land use. The area is predominantly single unit residential land use that you can see in yellow. On this map. There are a few public and quite public uses throughout and the proposed rezoning is adjacent to a commercial office mixed use, parking, open space and some industrial uses.'",
        "'speaker_1': 'Here are some images from within the.'",
        "'speaker_5': 'Proposed.'",
        "'speaker_1': 'Rezoning, with examples from each of the three zoned districts. And here are some images from surrounding areas. The Council office worked closely with the Chevy Park Neighborhood Association and began outreach for this rezoning last fall. This outreach included fliers canvasing two town halls and an online survey.'",
        "'speaker_1': 'We also took the text amendment to the agency's Zoning and Planning Committee in July of this year. The application was formally submitted in May of 2020, and on September 16th, the Planning Board voted unanimously to recommend approval. 12 speakers at that hearing, ten in support and two in opposition.'",
        "'speaker_1': 'CPD has received a letter of support from the Chevy Park Neighborhood Association. We've also received 26 comments in support from members of the public, citing a desire and appropriateness for its use in this neighborhood and the importance of use as a tool to promote affordability and aging in place opportunities.'",
        "'speaker_1': 'We've also received six comments in opposition, citing concerns around parking density, neighborhood character and short term rental. Because this rezoning is legislative, you know, it is only subject to three review criteria shown here. Text amendment is subject to these same criteria, so I will discuss them together.'",
        "'speaker_1': 'But the first is consistency with adopted plans. So we do find that the press text and map amendments are consistent with several strategies from current Plan 2040 shown here, and there are a few that I'll call out specifically.'",
        "'speaker_1': 'The amendments are consistent with the to these two equity strategies because the text amendment creates a new zone districts that will allow any use and the map amendment enables it to use in the entire neighborhoods. Use can provide additional housing options, including those for seniors and families, and they can provide residents more flexibility to remain in their'",
        "'speaker_1': 'homes. The amendments are consistent with our climate strategy because they will allow additional housing units on lots with existing houses where we have existing infrastructure and services such as sewer, water and transit in place. In Blueprint ever the theories called out as an urban edge context.'",
        "'speaker_1': 'The proposed zone districts are consistent with this plan direction, which would remain predominantly residential.'",
        "'speaker_4': 'With.'",
        "'speaker_1': 'A single and two unit uses. The proposed.'",
        "'speaker_5': 'Zone.'",
        "'speaker_1': 'District are consistent with the future places mapping, which is called out as low residential and described as single and two unit and places where accessory dwelling units are appropriate. There are some residential collectors and arterials in the area, but most of the.'",
        "'speaker_4': 'Streets.'",
        "'speaker_1': 'In the rezoning are on designated locals.'",
        "'speaker_2': 'Under.'",
        "'speaker_1': 'The Blue Point growth strategy. These areas are expected to see 10% of job growth and 20% of housing growth by 2040. The additional accessory dwelling units permitted.'",
        "'speaker_5': 'By the.'",
        "'speaker_1': 'Rezoning would be consistent with that growth strategy. The amendments are also consistent with additional strategies and blueprint. These are detailed in the staff report, but I'll briefly summarize them here. A policy for of our land. Usain Bolt form section states that we should diversify housing choice by through the expansion of accessory dwelling units throughout all our residential'",
        "'speaker_1': 'areas in the city. Policy 11 recommends that we implement Blueprint's plan recommendations through large scale legislative legislative rezoning, which should include community input and be guided by our equity concepts. Now Policy five focuses on the importance of mitigating involuntary displacement, which I'll discuss in the next few slides.'",
        "'speaker_1': 'So similar to the reasoning you just heard text amendments and a large map amendment should be guided by our equity concepts and blueprint over the first of which I'll go over access to opportunity. This is a composite score that includes our Neighborhood Equity Index, also proximity to high capacity, frequent transit and access to centers and corridors.'",
        "'speaker_1': 'The Chevy Park neighborhood has moderate scores in this category, with access to rail transit lower and access to centers and corridors marrying throughout the neighborhoods. The text amendments create ECB. One will create a new zone district within our urban edge context to allow to use, which would allow more residents to live in neighborhoods with access to amenities'",
        "'speaker_1': 'and quality of life infrastructure. The proposed rezoning in Chaffee Park will bring more residents to an area that has access to health care, high life expectancy, and it does have access to bus transit and corridors and centers in some portions of the neighborhood.'",
        "'speaker_1': 'The proposed rezoning will not have a direct impact on creating new corridors or centers, as it will only allow residential uses. The second equity concept is vulnerability to involuntary displacement, and this is a score that includes median household income, percent of renter occupied units, and the percent of residents with less than a college degree.'",
        "'speaker_1': 'Chaffee Park is more vulnerable based on median household income and education levels, as shown in bold on the slide. It does have high homeownership. The text amendment will allow more properties in the urban edge context neighborhoods to establish an 82 on their property, which can be an important opportunity to build wealth and help keep current residents in'",
        "'speaker_1': 'place. It also provides more options for households for.'",
        "'speaker_4': 'Vulnerable.'",
        "'speaker_1': 'To displacement to stay in the neighborhoods. The proposed map will similarly provide opportunities for existing homeowners to supplement their income, while also increasing housing options and allowing a greater range of incomes to live in the neighborhoods. The third equity concept is housing diversity, and this includes five measures, including the percent of middle density housing, home size, diversity'",
        "'speaker_1': 'of bedroom size, ownership versus rental housing costs and the number of income restricted units. Chevy Park is considered not diverse for the three measurements shown in bold. The text amount amendment will expand housing diversity by allowing a new housing option that is typically smaller and a different price point than existing single unit homes, often found in urban'",
        "'speaker_1': 'edge neighborhoods. The map amendment to allow it to use will introduce a new housing type to Chaffee Park and bring more renters to a largely owner occupied single unit residential neighborhood. The last equity concept is jobs diversity. This map shows the mix of jobs and areas of the city with the dominant industry depicted by color.'",
        "'speaker_1': 'Chevy Park shows a greater proportion of retail and manufacturing jobs compared to the city overall. The text amount map amendments will have a negligible impact on jobs for the city because their residential district. And I will also cover housing inclusive difference.'",
        "'speaker_1': 'This plan was adopted in 2018 and contains recommendations that are relevant to the Text and Map amendment. The plan recommends expanding the development of accessory dwelling units as they incentivize affordable and mixed use housing. It also promotes their development as a wealth building tool.'",
        "'speaker_4': 'For low and moderate.'",
        "'speaker_1': 'Income homeowners. The proposed text and Map amendment expand access to A2 use and are therefore consistent with these recommendations. In terms of the additional criteria, we define that the amendments will result in uniform regulations applicable to all new development within the urban edge zone districts.'",
        "'speaker_1': 'The proposed Text Amendment and Map Amendment will further public health, safety and general welfare by implementing Blueprint Denver.'",
        "'speaker_4': 'For.'",
        "'speaker_1': 'Excuse me, the proposed rezoning. We'll also improve public health outcomes by allowing more residents in an area that has higher life expectancy and access to health care, plus.'",
        "'speaker_4': 'Transit.'",
        "'speaker_1': 'Centers and corridors. It will also further the general welfare of the city by providing more housing, diversity and opportunities to help residents at a range of income levels continue to live in the neighborhoods. Given the finding that all review criteria have been met, staff does recommend approval of both the TEX Amendment and the MAP amendment.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Liz, for the staff report. Council has not received any written testimony on Council Bill 1027 NOR Council Bill 1028. And we have seven individuals signed up to speak this evening. And we will start out with Jason Warnock.'",
        "'speaker_4': 'Hi there. Sorry about that. Good evening. My name is Jason Hornick, and I live at 50th and Decatur Street. I'm on the board of the Chevy Park Neighborhood Association, and I'm the leader of our ADU Task Force. So I'm delighted by the opportunity to speak in support of both items on this historic bill.'",
        "'speaker_4': 'This vote is the culmination of a two year effort that began when multiple residents approached the R.A. asking how they could build an ADU on their property. After consulting with CPD and examining the comprehensive plan, we realized that the best path forward would be to pursue a mass legislative rezoning with the help of our city council office'",
        "'speaker_4': '. With their leadership, we performed extensive outreach in the neighborhood, and I'm very proud that we were able to show that a majority of our residents are in favor of this gentle increase in density. The physical character of Chaffee Park hasn't changed that much since it was built in the 1940s.'",
        "'speaker_4': 'But the situation around it has changed quite a bit. This neighborhood was on the edge of town. It was built, but it's now just two neighborhoods away from the downtown of a major American city with miles of sprawl on the other side.'",
        "'speaker_4': 'Even though Chaffee, the park's built environment, remained stable, despite all this external change, our land values have skyrocketed, which has caused economic and social instability for our residents. Under our current zoning code, our residents only have two options to deal with this instability.'",
        "'speaker_4': 'Stay and try to keep up with their rising property taxes or they can cash in and sell their property and move away. We're trying to give people a third option, one, where they can capitalize on the increasing land value without having to move out.'",
        "'speaker_4': 'An option that could allow them to alleviate the pressures of increasing housing costs and provide care for their extended family without sacrificing their independence.'",
        "'speaker_3': 'An option that won't benefit them. It won't just benefit them as the.'",
        "'speaker_4': 'Owner of the property, but will benefit the person that rents it as well by providing them a reasonably priced home. This option allows us, the residents of Chaffee Park, to do something this city has been struggling with for years, providing more housing.'",
        "'speaker_4': 'Legalizing 80 years will give us that option. So I won't directly benefit from this bill as I won't be building an ad on my property. But I strongly believe that my neighbors should have the right to do so if they choose.'",
        "'speaker_4': 'Because I realize that this is bigger than me as an individual and it's bigger than us as a neighborhood. It's about the city and our land use values as a whole. We're growing so fast that attempting to live the same way we did in the past is actively harming our future.'",
        "'speaker_4': 'So our comprehensive plan clearly recommends that 80 years should be allowed by right everywhere in the city. I'm extremely proud of the work we did to get here tonight, and I'm very thankful for our council, women's leadership and courage.'",
        "'speaker_4': 'And I'm hopeful this process provides enough proof of concept that it should be legalized across the whole city without having to duplicate this effort neighborhood by neighborhood. So we can instead use that time to figure out ways to make them more affordable for the people that need them the most.'",
        "'speaker_4': 'And that will be our next effort. So if you vote yes, of course. Thank you very much for your time. Have a good night.'",
        "'speaker_0': 'Thank you. Our next speaker is Frederick Glick.'",
        "'speaker_4': 'Hi. Good evening. My name is Fred Glick. I reside at 3850 North York Street in the Clayton Neighborhood Council District number nine. I'm also a property owner in the Chaffee Park neighborhood. I'm here tonight to urge you to support this combined text amendment and map amendment to allow to use throughout the Chaffee Park neighborhood.'",
        "'speaker_4': 'The application before you tonight represents the outcome of an admirable and amazing public process in the R.A. and Councilwoman Sandoval and her staff deserve great respect and gratitude for their efforts. There are a lot of good reasons to allow aid use throughout the Chaffee Park neighborhood, providing opportunities for residents to age in place, helping homeowners to build'",
        "'speaker_4': 'their equity in their homes, enabling multi-generational and extended families to live together. The residents of Chaffee Park have also made clear that they would like the benefits of increased density, including opportunities for neighborhood retail, which would be made much more viable with increased density.'",
        "'speaker_4': 'When I participated.'",
        "'speaker_3': 'In one of the public.'",
        "'speaker_4': 'Sessions organized by Councilwoman Sandoval's office in the Arno, I heard people express fears that they wouldn't know who is living in their backyards. As the owner of an aide to you. I'd like to make sure it's clear if you choose to have an aide to you.'",
        "'speaker_4': 'You also get to choose what you do with it. Rent it out. How does a family member use it as a.'",
        "'speaker_3': 'Home office.'",
        "'speaker_4': 'Store? Old newspapers in it. We rent our Adu and we used.'",
        "'speaker_3': 'A web platform to take applications and conduct background checks on.'",
        "'speaker_4': 'Prospective tenants. We interviewed them called references. We chose who to rent our you to. In approving this application.'",
        "'speaker_3': 'You begin to fulfill the Denver Rite Mandate to allow.'",
        "'speaker_4': 'To use throughout the city the one off rezoning to allow you to use on individual properties the city is seeing more and more of are a barrier to those hoping to have a to use. Not everyone can readily afford the fees required and navigating the city rezoning process.'",
        "'speaker_3': 'Isn't necessarily easy. These one off.'",
        "'speaker_4': 'Rezonings also consume considerable city resources, which I cannot believe the city comes close to recouping through the fees charged. In many respects, the application before you tonight is about equity and opportunity. Many residents, including in my own neighborhood of Clayton, see the borders between where 80 use are allowed and where they are not as arbitrary.'",
        "'speaker_4': 'Many of my neighbors who are on the wrong side of the line would like the opportunity to have an ADU to house an aging parent, to generate additional income to do their part to help alleviate the housing supply crisis Denver faces.'",
        "'speaker_4': 'I hope you will not only approve this application, but also look at it as a model of what should come next, whether citywide or neighborhood by neighborhood. The ability for residents to have air to use should not be reliant upon whether they can risk the fees required.'",
        "'speaker_3': 'Whether they come to feel.'",
        "'speaker_4': 'Comfortable navigating the rezoning process. I thank you for your time and consideration.'",
        "'speaker_0': 'Thank you. Our next speaker is Nola Miguel.'",
        "'speaker_1': 'Good evening, councilmembers. Nolan Miguel, 4930 Vallejo Street. I also live in Chevy Park and I'm part of the R.A. and I'm actually interested in this reason, both for personal reasons and for systemic reasons that I think are important for the whole city.'",
        "'speaker_1': 'I would like to build a Grammy flat and I say Grammy because that's what my kids call my mom. And I would like her to be able to move in my backyard, ideally or any place close to us.'",
        "'speaker_1': 'And we have been looking around the neighborhood walkable distance from our house.'",
        "'speaker_2': 'Where my kids to walk over to.'",
        "'speaker_1': 'And there's nothing in the neighborhood that's affordable under $400,000. We've been looking at ARIA, at the condos there, looking for housing there.'",
        "'speaker_2': 'We're looking over $400,000 for all of those options. She retired.'",
        "'speaker_1': 'About two years ago.'",
        "'speaker_4': 'From.'",
        "'speaker_2': 'The University of Wisconsin and would like move here because.'",
        "'speaker_3': 'All.'",
        "'speaker_2': 'Of us and especially her grandchildren.'",
        "'speaker_1': 'And we need a different a different type of option. We're also, you know, we have a pretty big lot. It's 10,000 feet. I'm very interested in the idea of activating our alleyway. It's a huge amount of space that it's unused and activated.'",
        "'speaker_2': 'Throughout the neighborhood.'",
        "'speaker_1': 'I also think that we have plenty of parking. I just just say that throughout the neighborhood and in our front and back yard, there's parking. Systemically, I think of as many have said so far, we really need affordable housing and rental options outside of just building large, large apartments.'",
        "'speaker_1': 'And this is a great infill option. Also very thankful to Councilwoman Sandoval and her office in figuring out a solution for the east part of the neighborhood. I'm really thankful that we could do this as a comprehensive neighborhood and appreciate all your work on this.'",
        "'speaker_1': 'Also, just 80, you should be across the city. It's the reason we've been looking at it in D.C. for a long time as well. But our little there's so many pressures in D.C. with with investments happening right now.'",
        "'speaker_1': 'That putting another thing in there just didn't seem like quite the right time. And we really would like to see this be across the whole city instead of being neighborhood by neighborhood. Also, those support services for low income homeowners is critical.'",
        "'speaker_1': 'Critical. We could I've looked into how much I could get for a loan, how much we could if we could figure this out. And we couldn't do this without the investment from my.'",
        "'speaker_5': 'Mom.'",
        "'speaker_1': 'To be able to build this. So I think it's critical to have investment strategies to do some of the West Denver Renaissance programing. Also, just to use, if possible, to have a structure that could be a one story garage and unit on the same level.'",
        "'speaker_1': 'That's really the most affordable.'",
        "'speaker_2': 'Thing to build. Thanks very much.'",
        "'speaker_0': 'Thank you. Our next speaker is Lucia Brown.'",
        "'speaker_1': 'Hello. My name is Lucia Brown and I live in the Baker neighborhood in Council District seven with John. And I'm also president of the Baker Historic Neighborhood Association. And. We've had 80 youths in Baker forever. We had carriage houses built and so even before 80 were allowed in the zoning, we had them here because of grandfathering.'",
        "'speaker_1': 'I have a carriage house in my backyard and we converted. It was my husband's office for 16 years and we just converted it over to an apartment. And not only does it provide more necessary housing in Denver, it's an extra source of income.'",
        "'speaker_1': 'And so I'll when my husband retires, we'll still have some income coming in to the house. And I know that there are people who are concerned about like short term rentals and issues like that. But because Denver has such strong short term rental laws with the property having to be the primary residence, there really would be very'",
        "'speaker_1': 'little negative impact. And also the area of Chaffee County, I don't think would be a high demand area for short term rentals. It's not like it's close to downtown or close to a lot of amenities. So it would probably be more profitable for the home owners to lease long term.'",
        "'speaker_1': 'So I just want to be on the record as saying that I fully support this text of amendment change and I agree with NOLA that this should be done citywide and not neighborhood by neighborhood. It's a no brainer way to do gentle increase in density and allow for different kinds of housing options and allowing people to age'",
        "'speaker_1': 'in place. It also deals with being green, you know, more dense. It lowers your carbon footprint. So that's where I stand. And I appreciate the council allowing us to speak on this issue. All right. And hi.'",
        "'speaker_2': 'Everybody.'",
        "'speaker_0': 'Hello. Thank you. Next up, we have Susan Powers.'",
        "'speaker_5': 'Good evening, everyone. First of all, I wanted to thank Councilwoman Sandoval for bringing this forward. This is and actually also thank the Chaffee Park Neighborhood Association, because I think they're the most thoughtful, I know in the city. And how often do you have the R.A. coming here saying, yes, we have.'",
        "'speaker_5': 'We we approve this, we we recommend this. So I'm I'm I'm speaking as a property owner as part of the RDA Denver development within Chaffee Park. But I guess those percent 11 1475 Dale Gagne, which is District nine, the area Denver development, which is the 17 acre redevelopment of the former Mary Kress Convent, is immediately adjacent to'",
        "'speaker_5': 'this area. It's it's part of the city and in Chaffee Park is not part of this rezoning because it's being built out in in in ways where we have adus already there. And I am going to say, too, and if she's still listening to this, that we do have an affordable co-housing unit available.'",
        "'speaker_5': 'So I, I think I have to make sure that I let that person who was speaking earlier know that she maybe her mom can move in there. But I'm here to support this. We've been we've been involved with with this neighborhood for over 15 years, with the Mary Kris property.'",
        "'speaker_5': 'And we have intentionally developed it as a as a mixed income project will end up with for 40% of the units as as affordable as it's developed and finished up in the next two years. But I think that having the 82 option here is, as everybody has said, is gives people who are long term homeowners in the'",
        "'speaker_5': 'Chaffee Park neighborhood who are you know, it's the neighborhood that is being impacted by the growth that's coming from the south, the ability to stay in their homes, build a unit that might provide them with the income that is necessary for them to carry to carry on their normal life.'",
        "'speaker_5': 'In this in this neighborhood. We've I've watched this for the last however many years as as things have jumped across I-70 and have been concerned about whether the character of that neighborhood was going to change, to continue to change.'",
        "'speaker_5': 'And and I think this is a way to kind of counter some of that gentrification. So I hope that your support this tonight. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Alison O'Kelly.'",
        "'speaker_1': 'Thank you. Can you hear me? All right?'",
        "'speaker_0': 'Go ahead. Perfect.'",
        "'speaker_1': 'Thank you. So, my name is Allison O'Kelly. I live in the 4800 block of Decatur Street in the neighborhood as well. I bought my home a little over seven years ago right before a property values started skyrocketing. So I was I was lucky to be able to afford a house at the time.'",
        "'speaker_1': 'And I'm lucky now to have realized some of those equity increases that Jason spoke about earlier this evening. I speak today in support of the neighborhood rezoning of the neighborhood. I do want to make sure I disclose that I do work in affordable housing.'",
        "'speaker_1': 'So I would support this gentle density increase in any neighborhood in Denver. But I do in particular as a resident of JP Park. I think that creating this neighborhood zoning allowance makes it possible for us to do so without creating the administrative burden that has already been discussed but is put upon the Planning and Zoning Commission, as'",
        "'speaker_1': 'well as any residents who would like to build an ADU. And so I think the fact that we're doing this is a neighborhood wide proposal has been a really smart thing. And I also agree with recommendations that this become a city wide approval rather than additional neighborhoods needing to go through the process that we did.'",
        "'speaker_1': 'I think that the height and setback limits on buildings that were discussed in the presentation earlier will ensure that there aren't any abuse that would cause negative impacts on the adjacent homes like I know a number of neighborhoods have been concerned about before ideas came in and they saw what the limits were on those.'",
        "'speaker_1': 'I also think that we can ensure community access in safety to the neighborhood because as NOLA said earlier, we have fairly wide streets and a lot of space for parking. Most of the houses in our neighborhood have parking both in the front and in the back.'",
        "'speaker_1': 'So access to those units is not going to create additional traffic and it's not going to create.'",
        "'speaker_2': 'A lot of mobility.'",
        "'speaker_1': 'Of the residents. I think that not everybody in the neighborhood will be in a financial position to start building 80 years if this is approved. I myself wouldn't build one anytime soon, but I think it's really important the opportunity that's going to provide to increase affordable housing in the neighborhood and homeownership stability.'",
        "'speaker_1': 'I think those of us who have elderly relatives in the neighborhood or in the broader metro area see this is a great opportunity to discuss with those family members the possibility of senior family members downsizing and being able to combine homes in a way that works for the entire family.'",
        "'speaker_1': 'And while I don't see myself doing that soon, my family, my parents live in North Glen and they're very vital seniors now. But things can always change. And I like the fact that we can look at this together as a potential opportunity down the road.'",
        "'speaker_1': 'So I do want to thank our council member and Naomi Grant as well. And I thank all of you for your time and hope you will support this. Thank you.'",
        "'speaker_0': 'Thank you. Our last speaker is Jesse Paris.'",
        "'speaker_3': 'It's getting in the middle of the council watching at on her. So Black star maximum for self defense. It makes it harder for social change as well as the Unity Party of Colorado email lines. And I live in district eight and Christopher Hamm is district and I will be the next member in 2023.'",
        "'speaker_3': 'I support this rezoning tonight and are one of the many hopes as our push for the green for city council our laws last year. And I am very familiar with this district because I've marked this area. Two years in a row for candidates that ran for office, most recently in the state Senate.'",
        "'speaker_3': 'So on the safety part area. So I'm a councilwoman and I support this rezoning. I believe that this should pass tonight. I just got a few questions. I want to know that some of the comments or lack of the opposition at the planning meeting and what were the six?'",
        "'speaker_3': 'Not as an op ed or comments at the at the hearing that the company had in regards to these animals. I support it. I would like to see them in every district in this town, as Laura and others have already stated.'",
        "'speaker_3': 'So if someone can please answer my questions, I will greatly appreciate it. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. That concludes our speakers questions from members of Council on Council Bill 1027 and or Council Bill 1028. Give it another moment for any hands raised. All right. See? No questions of members of council.'",
        "'speaker_0': 'The public hearing is closed. Comments by members of Council on Council Bill 1027 and or Council Bill 1028. Councilwoman Sandoval.'",
        "'speaker_1': 'Thank you, Madam President. So thank you all. It's an honor to be here before you today with this application. As it's been discussed, this is the first time an entire neighborhood has been zoned to allow accessory dwelling units.'",
        "'speaker_1': 'And honestly, I wouldn't be here today with all of you if it wasn't for the residents of Chevy Park. They came together and approached me before I was even sworn into office to talk about how we could get this done.'",
        "'speaker_1': 'And one of the things that we found out early on is that you're voting on two things. You're creating a new map and then you're creating a new zone district, because on the east side of town, the parcels are so small that there was not actually a zone district that would allow accessory dwelling units.'",
        "'speaker_1': 'So I had to create I had to slow the process down a little bit and work with community planning and development and create equity throughout the whole entire neighborhood. So the whole entire neighborhood would be able to allow it, have the opportunity to have accessory dwelling units.'",
        "'speaker_1': 'I would also like to think my aid council I'm sorry, my aide, Naomi Grundy's, who graduated with her master's in land use planning and she and I came up with an idea and how to get involvement from the neighborhood.'",
        "'speaker_1': 'She worked on a survey that was really well received and did a lot of the back work, which I call talking to neighbors and explaining this in a way where it's digestible. I feel like a lot of times when we're talking about rezoning and we're talking about land use, we use terminology that's not very accessible.'",
        "'speaker_1': 'And those in the city and county of Denver or those of us on city council, we understand it because we have lots of meetings with planners who explain it. And so I feel like it's my job to be able to explain it to everybody who would be impacted by these rezonings.'",
        "'speaker_1': 'So thank you, Naomi, for your steadfast leadership on this. And I would also like to talk to Jesse's concern. So some of the people who were opposed to this were nervous about having strangers in their backyard. They were nervous about parking and they were nervous about change in northwest Denver.'",
        "'speaker_1': 'I was born and raised. There has been a lot of change. The built environment has changed drastically since the 2010 zoning code, and so a lot of change. Change can be challenging and it can be a lot of fear based.'",
        "'speaker_1': 'And so we listened to everybody, and I made the tough decision to move forward on the application based on a lot of the equity concepts that you would have found in the document that Liz presented. And we also met with the city assessors to make sure we talked about taxes.'",
        "'speaker_1': 'We met with the fire department to talk about Allie with we met with Rene Martinez Stone, who runs the West Denver Collaborative, Renaissance Collaborative, who works on building 80 years in West Denver to figure out how we could work all together in TAPI Park.'",
        "'speaker_1': 'I had this survey in English and Spanish. We had our fliers done in English and Spanish, and so we had two responses in Spanish. So that shows me that it's working as long as they can have access to the information.'",
        "'speaker_1': 'And with that, if anyone if my colleagues have anything, any other comments, I would absolutely, really appreciate your support. This is a big deal for those who have housing over there. And I'll give a personal example. I have a cousin who has Down syndrome who lives in this neighborhood, and I would like his caretaker to be able'",
        "'speaker_1': 'to live there. We are making succession plans for him. He's one of my dear cousins. He's exactly my age in 40 and been working at McDonald's. And I would like Ben and all my other relatives who live in Chevy Park to stay in this neighborhood.'",
        "'speaker_1': 'So with that, I would ask that you support this initiative to help create some gentle density in Chevy Park, and I feel like it meets all the criteria. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Sandoval. And seeing other hands raised for comments, I'll comment. I would hope that all of our colleagues do support both 1027 and 1028. And just want to give you a huge congrats, Councilwoman Sandoval, because this was a heavy lift and your leadership and your community engagement and to have seven speakers here to all basically'",
        "'speaker_0': 'be in support of it goes a long way towards your community outreach and engagement. And so I just want to sincerely congratulate congratulate you and the Chaffee Park neighborhood, too, that they're going to have this additional tool for general dental density in the neighborhood.'",
        "'speaker_0': 'And with that being said, Madam Secretary, roll call on Council Bill 1027, please.'",
        "'speaker_2': 'Sandoval, I. Where I. Torres, I. Black.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'See the buckets, I. Clark.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'When? I turned in.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Can I? Ortega. I. Madam President.'"
    ],
    "Zoning Change for Accessory Dwelling Units in Chaffee Park.": [
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results. 1313 Ies Council Bill 1027 has passed. Counsel Woman Black, would you please put Council Bill 1028 on the floor?'",
        "'speaker_1': 'Yes, Madam President. I move that council bill 1028 be placed upon final consideration and due process.'",
        "'speaker_0': 'Thank you. It's been moved and seconded by Councilman Herndon. Madam Secretary, roll call on Council Bill ten 1028.'",
        "'speaker_2': 'Black. I. CdeBaca. I. Clark, I. Twin. I. Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Hi.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Cashman. Hi. Janet, I. Ortega. I. Sandoval. Hmm.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Sawyer. I. Tomorrow, I. Madam President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting and announce the results. 3913 EIS Council Bill 1028 has passed. Congratulations, Councilwoman Sandoval. Our pre adjournment announcement on Monday, December 7th Council will hold a required public hearing on Council Bill 1133 changing the zoning classification for 2201 Arapahoe St in five points and required public hearing on Council Bill 113 for'",
        "'speaker_0': 'changing the zoning classification for 1055 Locust Street in Montclair. Any protests against Council Bill 1133 or 1134 must be filed with the Council offices no later than noon on Monday, November 30th. There being no further business before this body, this meeting is adjourned.'"
    ]
}