{
    "Proclamation for Brother's Redevelopment Paint-A-Thon Day.": [
        "'speaker_2': 'day in the city and county of Denver. Section two at the clerk of the city and county of Denver shall attest and affix the city the seal of the city and county of Denver to this proclamation and that a copy be transmitted to the Devoe Board.'",
        "'speaker_4': 'Thank you, Councilman Lopez. Your motion to adopt.'",
        "'speaker_2': 'Madam President, I move that proclamation number 582 series at that of 2014 be adopted.'",
        "'speaker_4': 'Second, it has been moved and seconded. Comments from Council. Councilman Lopez.'",
        "'speaker_2': 'Being that you this is for seniors. Chris Nevett man, you've got to benefit from this and it's just sad to pick on him. I'd like to call Jeff Martinez for him. If you wanted to come pick. Is it am I.'",
        "'speaker_4': 'On your you're in the comment period. I haven't voted on it.'",
        "'speaker_2': 'That's right.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_4': 'Well, that's okay, Jim.'",
        "'speaker_2': 'So prepare to speak.'",
        "'speaker_4': 'Mr. Martinez, get ready. He's given you warning.'",
        "'speaker_2': 'Can we skip a week and I'll completely lose it? So I. I wanted to. I've read this proclamation, I think, for the last, like, four or five years. And I do that with a lot of pride and with a tremendous amount of honor, because not only have I seen the work, but I've actually participated in this and'",
        "'speaker_2': 'this and this event and this effort. I see countless people smile and cry and just jump for joy and just are so full of gratitude. I seen in Edgewater when you didn't match water. I've seen it in Denver and and the district and the neighborhood that I grew up in and some of the houses that they were'",
        "'speaker_2': 'that were rehabbed and painted or houses that had not been touched by a paintbrush since I was a little kid and now always recognized that house was the house in bad need of some TLC. And it was a house that a sweet, sweet lady lived there forever.'",
        "'speaker_2': 'And to go back and see that house not only painted, well-maintained and taken care of, it's it's a microcosm on why you do what you do and why the employees in Denver do what they do on a volunteer basis in this effort.'",
        "'speaker_2': 'There's a lot of different efforts that our employees get involved in. But this is my favorite because this is where, you know, no matter what department you work for, no matter you know, what your desk looks like or what building it is in the city that day, you work for the volunteer department and you're a painter and'",
        "'speaker_2': 'you get to enjoy the best paycheck ever. And that is that warm feeling in your heart and that sense of accomplishment when you see that gratitude on your fellow brother and sisters face. And that is done through the tremendous amount of hard work and efforts and a lot of coordination and user and your colleagues and our employees'",
        "'speaker_2': 'plan on an annual basis. So, Madam President, it is absolutely a prideful moment to be able to read this for the fifth time.'",
        "'speaker_4': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Madam President. First of all, I want to thank brothers for development for the many, many years of service they have provided to our community. I can remember when you had your headquarters in the Sun Valley neighborhood, and interestingly, when I worked at the Denver Human Service Department and we began to figure out how to solve'",
        "'speaker_6': 'our homeless problem, we realized that the women from the Delores Project used to stay in that building, and during the summertime they would have all their volunteers come in from out of town and stay at their building, and that would displace the women.'",
        "'speaker_6': 'So we had to find temporary locations for the women until they basically established their own home that ended up being in a city building. But I also want to take a moment to say thank you to all of the city employees who volunteer their time, as well as all of the other volunteers that come out from all'",
        "'speaker_6': 'over the place and do these homes for seniors across the metro area. I know one year that I volunteered, I was in unincorporated Adams County at the home of an elderly couple. But as Councilman Lopez said, these families are so grateful for the opportunity because if it were not for this program, those improvements would never take place'",
        "'speaker_6': '. And so I know how important it is for our community that these things happen, because oftentimes when something falls into a state of disrepair, if it's not taken care of, it will continue to deteriorate. And so I'm very grateful for the work that you all do.'",
        "'speaker_6': 'And I just want to say a big thank you.'",
        "'speaker_4': 'Thank you, Councilwoman Ortega. Madam Secretary, roll call.'",
        "'speaker_0': 'Lopez. Hi, Montero. I never. I. Ortega. Rob Brown.'",
        "'speaker_5': 'Rex Rice. Rex.'",
        "'speaker_6': 'But I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_1': 'I can.'",
        "'speaker_0': 'Each lemon. Hi, Madam President. Hi.'",
        "'speaker_4': 'Madam Secretary. Close the voting and announce the results. 11 911 ies the proclamation is adopted. Now, Councilman Lopez, is there someone you'd like to call up?'",
        "'speaker_2': 'Absolutely. I'd like to bring Jeff Martinez to the podium.'",
        "'speaker_1': 'Well, thank you, Madam President. Member City Council Councilman Lopez. Councilman Ortega, for those kind words. And there's not a lot for me to say. You both hit it out of the park just now, and that means that you really do get it and understand the value of this program.'",
        "'speaker_1': 'And more importantly, because this day it's proclamation, we have clients who are truly in need and who truly deserving of this. These are longtime homeowners in the city. They've lived right. They've done right. They just can't get on those ladders anymore.'",
        "'speaker_1': 'They just need a a hand or in this case, a brush to help them with that, that maintenance. But this day is really about those city city of Denver employees, members of Devo, who come out and get on those ladders, get on those tall peaks, get up there on those tall peaks and paint the homes and interact'",
        "'speaker_1': 'with that homeowner and show them, you know, just how much this community cares. And the sheer support of all of this is so tremendous. So you all alluded to the value to that homeowner is huge. It's also important to neighborhoods across the city.'",
        "'speaker_1': 'We're preserving that seniors most important investment. We're also doing some neighborhood stabilization in the process. Neighbors come out and they say, Gee, how can I get my house painted next year? You know? So we're really lending, I think, to a greater sense of community.'",
        "'speaker_1': 'And again, hopefully giving those folks an opportunity also to dedicate the resources that they might have spent on that paint job now to pay for their groceries or utilities because they're on fixed income. So really, I just want to say thank you to folks up here in the dais and also those hardworking city of Denver employees who'",
        "'speaker_1': 'come out every year this Saturday. They're going to be painting, I think, ten houses across the city. And it's going to be, you know, those tremendous stories are going to come out once again, art and everybody else, just the work that they do is so tremendous and so valuable to to our seniors.'",
        "'speaker_1': 'So I just I have nothing but gratitude. And again, thank you so much for your support this year and every year.'",
        "'speaker_4': 'Thanks for all that you do.'",
        "'speaker_6': 'Madam President, can I just ask a quick question? Do you have enough volunteers for this Saturday or are you still in need of more volunteers?'",
        "'speaker_1': 'We never have enough volunteers. Okay. Always have another ladder, another brush for you.'",
        "'speaker_6': 'This is a great pitch. Where would someone reach out to?'",
        "'speaker_1': 'Absolutely. Well, I think get in touch with Arthur. You can call Brother's redevelopment directly and we can put you in touch with other brothers. Redevelopment org is our website. 303202 6340 is our phone number. And again, even if you can't make it out this weekend and this is part of the big Denver day, we'll be painting houses'",
        "'speaker_1': 'really till it snows. But we have another big day coming up in mid-August. So another opportunity to rally your neighbors, your church, your office, anybody you can get involved. Because we have so many seniors on our waitlist. It's just I can never do enough.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_4': 'Thank you very much. And congratulations.'",
        "'speaker_1': 'Thank you.'"
    ],
    "Proclamation on Indian Arts and Crafts Act and Symposium.": [
        "'speaker_4': 'Next, we have a proclamation that I'll ask council and can use to read proclamation number 583.'",
        "'speaker_0': 'Thank you, Madam President. It's my honor to read Proclamation 583 series of 14 Acknowledging the Indian Arts and Crafts Act of 1990 and the American Indian Arts and Crafts Symposium in Denver. Whereas, in 1990, the Indian Arts and Crafts Act was passed to prohibit misrepresentation and mark in the marketing of Indian art and craft work in the'",
        "'speaker_0': 'United States. And. Whereas, the Act makes it illegal to offer or display for sale or sell any art of craft product in a manner that falsely states it is Indian produced an Indian product or the product of a specific Indian tribe which can result in a fine of up to $250,000 and or imprisonment up to five years'",
        "'speaker_0': 'for an individual. If the total sales transaction is valued at $1,000 or more, or a fine up to $1 million for a first time violation by a business. Whereas the Indian Arts and Crafts Act defines that an Indian and or Indian tribe is a member of a federal or official state recognized tribe, and that a certified Indian'",
        "'speaker_0': 'artisan is certified as a nonmember Indian artisan by the governing body of an Indian tribe from which the individual is a direct, lineal descendant. And. Whereas, on Thursday, July 17th, 2014, the Denver American Indian Commission will host the U.S. Department of the Interior for a one day American Indian Arts and Crafts symposium at the McNichols Building, starting'",
        "'speaker_0': 'at 9 a.m.. That will bring various key organizations together to discuss local and statewide museums and historic sites across Colorado to encourage them to buy and sell authentic American Indian and Alaska Native art within their respective shops. And.'",
        "'speaker_0': 'WHEREAS, in addition, the symposium will expand markets for authentic American Indian goods. And therefore increase economic prosperity for American Indian artists and give them the opportunity to showcase their work. And. WHEREAS, The Denver American Indian Commission is one of the co-sponsors of this symposium and an active partner in addressing these issues, the Commission encourages people to contact'",
        "'speaker_0': 'the Indian Arts and Crafts Board at w dot i acb that dui dot gov. If you become aware of any market activity in violation of the act. Now, therefore, be it proclaimed by the City of the Council of the City and County of Denver, Section one that the Denver City Council acknowledges the Indian Arts and Crafts Act'",
        "'speaker_0': 'of 1990 and encourages residents of Denver to attend this symposium to learn more about Indian art and craft work in Section two that the Clerk of the city and County of Denver shall attest in a fix the seal of the city and county of Denver to this proclamation and that copies be transmitted to the Denver American Indian'",
        "'speaker_0': 'Commission, the Rocky Mountain Indian Chamber of Commerce, and the Department of the Interior, Indian Arts and Crafts Board.'",
        "'speaker_4': 'Thank you. Councilman Kenny's your motion to adopt.'",
        "'speaker_0': 'Thank you. Madam President, I move that, perhaps proclamation 583 be adopted.'",
        "'speaker_2': 'Okay.'",
        "'speaker_4': 'It's been moved and seconded. Comments by Council Councilwoman Kennish.'",
        "'speaker_0': 'Thank you, Madam President. I love this job. Serving as a member of City Council on a daily basis, I learn new things. And in the course of serving on the Health and Safety Committee, we receive updates from our commissions.'",
        "'speaker_0': 'And this is one of the updates they provided about this symposium. I have been, like many of you have been at museums or gift shops where you see beautiful jewelry, maybe earrings or trinkets, maybe some turquoise that you believe might be American Indian art.'",
        "'speaker_0': 'And maybe you turn it over and you look at it and it says, Made in China on the bottom. And you have this kind of feeling like something isn't right there. And in the case of this proclamation, I thought it was important for us all to understand not only is that not right, it's not legal.'",
        "'speaker_0': 'And I think it's really great that our commission is getting together with the federal government to really not just identify what the law is in regards to really making sure that the things that you sell are authentic, but also saying, if I am a museum, if I am a gift shop, how is it that I could find'",
        "'speaker_0': 'authentic art? Who do I call? Where do I find an artisan who makes great earrings, makes great jewelry, makes great paintings? And this is the opportunity, this symposium on Thursday. So I shared this proclamation because I was pleased to know that after the many wrongs that the U.S. government has perpetrated over time with regard to native peoples'",
        "'speaker_0': ', that we are also working to use the law to help protect those artisans who, you know, are trying to make a living as artists, but competing against goods that might be made overseas or elsewhere and certainly made at lower cost than a handmade artisan would be doing from a native tribe.'",
        "'speaker_0': 'So I encourage all of us to be smarter shoppers and to help when we are in places where Native American art could be sold to help educate our shopkeepers and others about this act as we move forward and to maybe think about checking out this symposium on Thursday the 17th.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman. Councilwoman Robb.'",
        "'speaker_0': 'Thank you, Madam President. And thank you, Councilwoman Kennish, for bringing this forward, because I to learn something new every day.'",
        "'speaker_6': 'And this was.'",
        "'speaker_0': 'One of the things I learned. I'm very supportive of this. When I was a young adult, my father had retired and was a marketing consultant to the Navajo Nation, and that was a very interesting experience for our whole family.'",
        "'speaker_0': 'What I think is great is that this is a this is a great event for the McNichols building. This really shows what our cultural.'",
        "'speaker_6': 'Buildings can do, too.'",
        "'speaker_0': 'So it brings the strength of the city to a very interesting topic. So thank you for bringing it forward.'",
        "'speaker_4': 'Thank you, Councilwoman Robb. And Madam Secretary, it looks like we're ready for a roll call.'",
        "'speaker_0': 'Can I. Lemon Lopez. Lopez. All right. Monteiro, I never i. Ortega, I run i. Brooks, i. Forts i. Herndon, i. Madam President.'",
        "'speaker_4': 'I. Madam Secretary, closed the voting. Not so.'",
        "'speaker_0': 'Results 11 eyes.'",
        "'speaker_4': '11 Eyes. The proclamation is adopted. Councilwoman, is there someone you'd like to invite to the podium? Yes.'",
        "'speaker_0': 'Jennifer Williams, who's a member of our American Indian Commission.'",
        "'speaker_4': 'Good evening. I just want to really say thank you to all.'",
        "'speaker_6': 'Council members for voting on this.'",
        "'speaker_0': 'Proclamation.'",
        "'speaker_6': 'Tonight.'",
        "'speaker_0': 'I think the event on the 17th is really going.'",
        "'speaker_6': 'To help build.'",
        "'speaker_0': 'Awareness. And really the bottom line is to build.'",
        "'speaker_6': 'Economic.'",
        "'speaker_0': 'Development among native artists locally, you know, and within the whole state of Colorado. This kind of came about.'",
        "'speaker_4': 'Because the commission did.'",
        "'speaker_0': 'Some art.'",
        "'speaker_6': 'Shows up at Red.'",
        "'speaker_0': 'Rocks. And while we were sitting outside and it was really beautiful to have 25 vendors.'",
        "'speaker_6': 'Selling their art. I noticed inside at the gift shop, you know, native stuff, supposedly native items that were.'",
        "'speaker_0': 'Really made from China excuse me, really made from China and different places. And so after about a year of a couple of years, we've been planning this event. So I just think that it's really important, especially for our artists, to be able to build their build their art and not to have it taken for granted.'",
        "'speaker_0': 'So I hope you guys can all come out. We also are going to do a walking tour in the afternoon to the Colorado History Museum and the Buyers Evans House and the Denver Art Museum. So hopefully you can stop by.'",
        "'speaker_6': 'And.'",
        "'speaker_0': 'Then we're going to have a reception at the Native American Trading Company right on 13th.'",
        "'speaker_6': 'Bannock after that.'",
        "'speaker_0': 'So hopefully you can come by and check it out. Thank you.'",
        "'speaker_4': 'Thank you very much, Ms.. Williams. Okay. We are ready for the resolutions. Madam Secretary, would you please read the resolutions.'"
    ],
    "Reappointment of Lori Mack to the Denver Office of Strategic Partnerships Commission.": [
        "'speaker_4': 'Under bills for final consideration. I see no bills called out and under pending. I see no bills called out. So, Councilman Brooks, what would you like us to do with the bill for 43?'",
        "'speaker_2': 'Thank you, Madam President. I'd like to call it up for a vote.'",
        "'speaker_4': 'All right, Councilwoman CORNISH, will you read the motions this evening?'",
        "'speaker_0': 'Yes, Madam President, if.'",
        "'speaker_4': 'You please put Resolution 443 on the floor for a vote.'",
        "'speaker_0': 'Thank you, Madam President. I move that resolution 443 be adopted.'",
        "'speaker_4': 'It has been moved and seconded. Comments by Council Councilman Brooks.'",
        "'speaker_2': 'Yes. The mayor's administration needs to make some changes on the board for the Denver Office of Strategic Partnerships, and they're going to look at those necessary changes and come back to us with some appointments. But they would like us to vote down this appointment.'",
        "'speaker_4': 'Okay. Thank you, Councilman Brooks. I see no other comments. Madam Secretary, roll call.'",
        "'speaker_0': 'Brooks. No.'",
        "'speaker_6': 'But no.'",
        "'speaker_0': 'Herndon. No Carnage, no Liman, no Lopez. No. Montero, no. Nevitt? No. Ortega, Rob. No. Madam President.'",
        "'speaker_4': 'No. Madam Secretary. Councilman. Councilwoman Ortega. Madam Secretary, will you close the voting, announce results? 11 nays, 11. This resolution for 43 is defeated. Okay. That being said, I'm going to say all the other bills for introduction are published, and I think we are ready for the black vote cast for McNeish.'",
        "'speaker_4': 'Will you please put the resolutions on the floor for a block vote?'",
        "'speaker_0': 'Thank you, Madam President. Well, we have no resolutions remaining, Madam President, but.'",
        "'speaker_2': 'Now you've got a mess.'",
        "'speaker_4': 'So do I have them all? Oh, we have my back. I'm sorry. 43. That's.'",
        "'speaker_0': 'I was looking at the wrong section. Yes, Madam President. I move that following resolutions be adopted. Five, 17, five, 18, five, 19, five, 25, 26, five, 29, five, 33 and 541.'",
        "'speaker_4': 'Thank you. Council. And. They have been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_0': 'Brooks. Hi. But I. Herndon I can each I laman. Hi, Lopez. Hi, montero. Hi, Nevitt. Hi, Ortega. I rob i. Madam President. Hi.'",
        "'speaker_4': 'Madam Secretary. Close the voting. Announce the results.'",
        "'speaker_0': '11 911.'",
        "'speaker_4': 'As the resolutions are adopted. Castro On the condition. Will you please put the bills for final consideration on. On the floor, for adoption? For passing?'",
        "'speaker_0': 'Yes. Thank you, Madam President. I move that they'll die in.'",
        "'speaker_4': 'Just a second. I've got a message from the Secretary Jones. Oh, I missed this part. Castro says Bill's on file consideration except for Council Bill for 70. A companion bill regarding the Walton Corridor. Urban Redevelopment Plan Council will vote on this bill after the conclusion of tonight's public hearing on Council Bill 471.'",
        "'speaker_4': 'Okay, I understand that. Okay, so I guess just omit the 470 in your reading.'",
        "'speaker_0': 'Yes, ma'am. Thank you, Madam President. I move the final following bills to be placed upon final consideration and do pass. Five 1436 450 65065095 ten and 516 All series of 2014.'",
        "'speaker_4': 'Thank you, Councilwoman Kennish, that they have been moved and seconded by the secretary roll call.'",
        "'speaker_0': 'Liman by Lopez. All right. Monteiro Nevitt I Ortega I rob i Brooks. Hi, Fats Herndon. I can eat i madam president.'",
        "'speaker_4': 'Hi. Madam Secretary, close voting announced the results.'",
        "'speaker_0': '11 eyes.'",
        "'speaker_4': '11 Eyes. The bills for final consideration do pass tonight. Council will continue from June 16, 2014. Its required public hearing on Council Bill 398 as amended, allowing fresh produce and cottage food sales as a home occupation council will hold a required public hearing on Council Bill 502 approving the service plans for the proposed JCC Metropolitan District Number'",
        "'speaker_4': 'one and JCC Metropolitan District Number Two. Council will hold a required public hearing on Council Bill 471, amending the Walton Corridor. Urban Development Plan. Urban Renewal Plan. Please note the speakers are allowed only one opportunity to speak on Council Bill 398.'",
        "'speaker_4': 'If you testified on June 16, you will not have an opportunity to testify a second time tonight. Anyone wishing to speak on any of these matters must see the Council Secretary to sign up during the recess of Council.'",
        "'speaker_4': 'Madam Secretary, how many minutes do you think we will need? 20 minutes. Okay. If there are no objections from members of council, we will take a recess until about a quarter till six. Yeah, of course it's 677. Oh, my goodness.'",
        "'speaker_4': 'Poor little store.'",
        "'speaker_1': 'Ride the train to the.'",
        "'speaker_2': 'Water tower and enjoy a short hike, give you a multitude of wildflowers, then enjoy a catered boxed lunch on the lawn at the Healy House Museum.'",
        "'speaker_1': 'Reservations required. What is sound.'",
        "'speaker_6': 'And how does it.'",
        "'speaker_2': 'Work? Make some music and explore sound. From bird songs to drumbeats to a laser show. What may be music to your ears may just be noise to others. Rock on 21 and up only. Then enjoy a free day at the Museum of Nature and Science this Sunday afternoon.'",
        "'speaker_1': 'Council is reconvened. We have three required public hearings this evening. We could just reconvene, please.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'We are reconvening, please. Thank you. Council President Sussman had to step out on Council President Pro Tem Herndon. I will be finishing the meeting for her. We have three required public hearings this evening. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses'",
        "'speaker_1': '. If you are here to answer questions only when your name is called, come to the podium, state your name and note that you are available for questions of council. Each speaker will have 3 minutes unless another speaker has yielded his or her time, which would result in a total of 6 minutes on the presentation manner on the'",
        "'speaker_1': 'wall. When the yellow light comes on, you will have 30 seconds to conclude your remarks. And when the red light appears, your time is up. Speakers must stay on the topic of the hearing and must direct their comments to the council members.'"
    ],
    "Zoning Code Amendment for Home-Based Food Sales.": [
        "'speaker_1': 'Speakers are prohibited from using profanity or making personal attacks during their comments. Audience members Please understand that council members use electronic devices for various kinds to access the materials relevant to the public hearings before us. Be assured, however, by mutual agreement and common practice of the City Council, these devices are not being used for texting, emailing or'",
        "'speaker_1': 'other communications during our public hearings. And we will begin with Council Bill 398 as amended. Councilwoman Kenney So will you please put Council Bill 398 on the floor?'",
        "'speaker_0': 'I will. Mr. President, I move that council bill 398 be placed on final consideration and do pass.'",
        "'speaker_1': 'All right. We are catching up with the technology for a movement. And in a second it has been moved and seconded. The public hearing for Councilor Bill 398 is continued from Monday, June 16, 2014. We have five individuals to speak this evening.'",
        "'speaker_1': 'I'm going to call up the first five if you can make your way to the podium here at the front. That will help speed up the proceedings. We have our five our Mr. Texter. Mr. SEKOU. Mr.. KORNACKI. This is Grant and Mrs. Glassmaker.'",
        "'speaker_1': 'So those five can feel free to make your way to the podium. And we will begin with Mr. Texter.'",
        "'speaker_8': 'That tax of 4535. Julian Street, Denver. Growing fruits and vegetables in the city seems like a good idea. Maybe making a few dollars selling it isn't all that bad.'",
        "'speaker_1': 'However, on July 9th, a homeless man sleeping in a Denver alleyway beneath plastic sheeting was run over by a recycling truck. In the meantime, through Denver's Rent a Cop program, the Downtown Denver Partnership is sanitizing the 16th Street Mall for the enjoyment of tourists.'",
        "'speaker_1': 'It seems that instead of passing this ordinance, the city would bring more credit.'",
        "'speaker_8': 'To itself if it bought.'",
        "'speaker_1': 'The produce and distribute it on the mall.'",
        "'speaker_8': 'To the neediest of its citizens.'",
        "'speaker_1': 'Thank you. Thank you, Mr. TEXT. Mr. Sekou.'",
        "'speaker_7': 'My name is Chairman Siku. I am the founder organizer of the Black Star Action Movement for Self-defense. We unconditionally support this ordinance, which will legalize what folks have been doing since the last 60 years. I've been born with or without permission of government because it was a practical thing to do.'",
        "'speaker_7': 'And when I was growing up, there was canning going on in my house. We were sharing that with neighbors and sometimes there was a bathroom. You know, I'll give you this a can of peas and you give me some cabbage or some greens or some yams and whatnot.'",
        "'speaker_7': 'And so it's nice to be able to say that people can now come out from the shadows of illegality and do something that makes some sense without any fear of being prosecuted or persecuted, for having the ability to do something that we were made to do as human beings.'",
        "'speaker_7': 'And that was to grow our own food and feed ourselves without the interference of anybody, as long as we were preserving the land so that we can continue that on and make the land better for the next generation so they could do the same thing.'",
        "'speaker_7': 'And so it makes sense. And so we thank counsel for coming together, because I know this vote is going to be unanimous, because the truth is, you've already made up your mind. It was in subcommittee. Once it comes up, once the horse get out, the barn is a done deal, even when it's close.'",
        "'speaker_7': 'If you understand the process and I come to accept that as just part of the way we do what we do down here after coming here for three and a half years to study and research the process. So congratulations on having the common sense to let folks do what's been practical all my life.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_1': 'Thank you. Mr.. Q Mr.. KORNACKI.'",
        "'speaker_8': 'Thank you, Mr. President. My name is Eric Renacci. I live at 160 Hooker Street in the Burnham neighborhood. I shared the previous speakers enthusiasm for this bill. It's about time that we return to the common sense practice of feeding ourselves and feeding our neighborhood.'",
        "'speaker_8': 'I'm extremely proud to represent the Sustainable Food Policy Council of Denver today, where we took up this issue about two years ago as something that not only made sense, but we also knew that it would make an incredible impact on communities throughout Denver, particularly the low income and underserved communities that do not have access to healthy food'",
        "'speaker_8': '. I also an executive director of a nonprofit called Revision and Rework in the Southwest Corridor, primarily the Westwood neighborhood where Councilman Lopez, just out of faith, invited us in 2009 to come meet residents of the community that I think we're tired of not having the power to bring a grocery store into their community.'",
        "'speaker_8': 'And we're suffering from some of the worst diet related health effects in the entire city of Denver. And we started with a very basic premise of teaching people to grow their own food, utilizing their own land. What started in 2009 with seven families, I'm very proud to say, is over 300 families in southwest Denver this year growing'",
        "'speaker_8': 'their own food and feeding their neighbors. And last year alone, we produced over 20,000 of food. These are many small time small households that are starting a ten by ten plot in their own yard. And what we came to find is that not only were they producing such an abundance for their own family, but they were sharing'",
        "'speaker_8': 'with their neighbors whether it was an extended family, someone at their church, someone at their school. But there was clearly enough surplus to go around. In addition, many of these families live on less than $15,000 a year. That's self-reported.'",
        "'speaker_8': 'And so we said, hey, would you be interested in selling your own food? And every one of them said, yes. How do I go about doing that? So we're in the process of starting a community owned grocery store.'",
        "'speaker_8': 'You may have heard that in the mayor's State of the City address today, but one of the most immediate solutions is allowing people to set up a stand at their house and say, Come buy my produce from their neighbors.'",
        "'speaker_8': 'So I think, Councilwoman, can each four, four spearheading this bill and everybody else that has been in support of it. And I thank you for taking it up today.'",
        "'speaker_1': 'Thank you, Mr. KORNACKI. Beverly Grant.'",
        "'speaker_6': 'Greetings, Honorable Council members. I appreciate this opportunity to speak before you. I live at 3615 York in the Cole neighborhood. I would also like to thank Councilwoman CORNISH, Councilwoman Shepherd in her absence and Councilwoman Brooks, because they were kind of like the trio that spearheaded this movement.'",
        "'speaker_6': 'A couple of things I would like to share. I have been working for the past six, seven years in our local food movement. My work has been primarily focused in northeast Denver, which is a food desert neighborhood. And this particular legislation, in addition with the agricultural food producing legislation that's already passed and the Kurdish Food Act, plus'",
        "'speaker_6': 'this one that's on the table right now, lay a strong foundation to strengthen our urban ag movement, because we'll have fresh agricultural products, value added foods that can spurn a lot of neighborhood economics, that little bitty pockets block by block.'",
        "'speaker_6': 'You heard Eric story of 300 neighbors in a neighborhood. I have that same vision where I live, where there's not nearly that much growing going on. And this legislation will help to get us organized, lay a strong platform for doing it.'",
        "'speaker_6': 'My vision is to start in five points. Keep moving east.'",
        "'speaker_2': 'That's the Green Valley.'",
        "'speaker_6': 'Little by little, I like to point out that this is also a step toward raising food production in our mayors overall goal of of our city being able to feed itself with local foods. Then one other thing. The definition of a food desert is where residents have to travel miles to get to food.'",
        "'speaker_6': 'This would kind of create a tipping point where the shift would be going blocks to get food. And in closing, I would like to say that not only does this legislation encourage individual families to be a part of their own food solution, but it will also encourage more neighborhood connectedness around food, around sharing and around improved health'",
        "'speaker_6': '. Thank you for listening.'",
        "'speaker_1': 'Thank you. And our last speaker to maker. And I apologize if I misspoke.'",
        "'speaker_6': 'I'm Sue Glass Maker. I'm here representing Curtis Park Neighbors. Curtis Park Neighbors was advised early on in this process by the cottage food people. They did an excellent job of helping us understand this. And also we knew about it from planning at I.N.S., so we're pretty well versed in it.'",
        "'speaker_6': 'Curtis Park neighbors voted unanimously to support this text amendment, and we feel that you just have to look at Vermont to see how this works. Vermont is the leader in the nation on this type of cottage industry stuff because the people there have to scrape for jobs.'",
        "'speaker_6': 'And what happens is people develop an entrepreneurial mindset and they start doing this. And it's amazing what happens when a little thing happens. And it's an easy way for people to not only feed themselves good food, but it's an easy way for them to start a business with with low risk and low startup cost so they can'",
        "'speaker_6': 'take a little whirl at it in a very small way. And it's amazing what can come out of that. And it's mostly that independent spirit that gets fostered. So, again, we were unanimously in favor of this. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Are there any questions from members of council? Seen on the public hearing for 398 is close and now it's time for comments from members of council. Councilwoman Cannick.'",
        "'speaker_0': 'I will yield to my colleagues. Mr. Chair, thank you for the opportunity. I'll ring in at the end here.'",
        "'speaker_1': 'Certainly, Councilwoman Lehman.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_6': 'Councilwoman Sheppard could not be here this evening and asked that I read her letter for you. So I'm going to read the letter from Councilwoman Shepherd. I am very sorry not to be able to be here for tonight's historic vote, as I am on vacation with my family.'",
        "'speaker_6': 'That was planned long ago. I am definitely with you in spirit. However, as I'm very proud of all the.'",
        "'speaker_5': 'Work the local food.'",
        "'speaker_6': 'Community and my colleagues, council member Albert Brooks and especially Councilwoman Robin Kennish, have done to move this ordinance forward. As many of you may know.'",
        "'speaker_0': 'I actually did.'",
        "'speaker_6': 'Backyard vegetable.'",
        "'speaker_0': 'Farming on my own.'",
        "'speaker_6': 'Just prior to being elected to council in 2011. This was during two and a half year period where I was home taking care.'",
        "'speaker_0': 'Of my son and it provided me with a little income and something to keep me and my.'",
        "'speaker_6': 'Mind busy engaged when I wasn't changing diapers or feeding the baby.'",
        "'speaker_0': 'I did it on a very small.'",
        "'speaker_6': 'Scale basis and my profit margins were extremely slim, especially since the only way to easily distribute my produce was to drop it off at my customers home and my vehicle, further eating into any profits that I made due to money I spent on gaffs.'",
        "'speaker_6': 'I often and fantasized about how nice it would be to be able to sell vegetables from my own home and also some minimally processed products such as jam. Recently I taught Revision International, a nonprofit organization that teaches people how to grow food for themselves and their neighbors in Council District three.'",
        "'speaker_6': 'I had the opportunity to meet a wonderful family of seven who lived in a very small one bedroom house with the help and direction from Rent Revision International and access to a little bit of land. This family is growing all their own food, sharing quite a bit with their neighbors, and selling the extra to help supplement their'",
        "'speaker_6': 'very modest income. Their gardens are beautiful national my showcases in a food desert and have attracted the attention of many.'",
        "'speaker_0': 'Including.'",
        "'speaker_6': 'Media outlets such as encryption. These are a couple of examples of the type of people and enterprise this ordinance can help. And I precisely the reason I am proud to co-sponsor this ordinance, this my carefully crafted bill can.'",
        "'speaker_5': 'Increase.'",
        "'speaker_6': 'Access to healthy foods in areas where none exist, contributing to a healthier parents and children in areas where it may take years to recruit a major grocery store. This ordinance also gives opportunity to many people who are prolific gardeners or talented home food producers to sell a little bit of their bounty and help bring some much needed'",
        "'speaker_6': 'income to supplement their incomes. It also gives communities the chance to learn more about where their food comes from and helps children and adults reconnect meaningfully with the land in a way that has been lost in our hectic culture.'",
        "'speaker_6': 'It gives the opportunity for more of our dollars to continue circulating locally and boosting our economy rather than draining away to out of state or out of country. Agribusiness producers, whom we had never met and may not share our values on what it means to grow food.'",
        "'speaker_5': 'In a.'",
        "'speaker_6': 'Sustainable manner. Once again, I applaud all the hard work that has transpired to bring this ordinance forward, and I strongly urge my colleagues to vote yes. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Lemon. Councilman Brooks.'",
        "'speaker_2': 'Thank you, Mr. Chair. I for a ten minute joke. I'm sorry. Thank you, Mr. Chair. I never thought when I took office how how much of an issue, a social justice issue, the price and location of a vegetable would be and this is this has truly been a transformational process for me personally.'",
        "'speaker_2': 'I think any time I sponsor legislation, I want to have the kind of the three the three piece. Right. The personal transformation has some specific projects in the district that we're working on and and always thinking of some larger policy issues.'",
        "'speaker_2': 'And so for the projects we live in. Northeastern was one of the largest food deserts in the city. And as I was knocking on doors when I was running for office in 2011, a lot of folks commented on this and they talked about the length it was to walk to a grocery store in District eight, only had'",
        "'speaker_2': 'Safeway. And so 55,000 residents with one major grocery store. You know, it's ridiculous. So we worked really hard with a couple of developers and also with Sunflower, which then changed its name to to locate right there on Colfax.'",
        "'speaker_2': 'And thanks to the council and a lot of community support, we were able to to get to get that sunflower there. And it is one of the, you know, top revenue producing grocery stores in their whole network. So it was really exciting to see that, you know, we we've been working really hard to find out.'",
        "'speaker_2': 'Can we get another one in five points? Can we get another one in right now? And all over the northeast, northeast, Denver, in collaborating even with Globeville, Elyria, Swansea, where these nodes and these pockets of of grocery empty grocery stores are, you know, I, I was excited when Councilwoman Canete brought this forward and I want to thank'",
        "'speaker_2': 'her for her leadership in this. She's been wonderful to work with, very thorough and the community support that's behind it. I have neighbors, actually. Beverly Grant is my neighbor. So, you know, I had to get my stuff together.'",
        "'speaker_2': 'But I have neighbors who are so excited about this piece of legislation. And it's it's I think it is a tremendous microeconomic plan for neighbors to get involved, not only to become healthy by growing their own, but by being able to be a part of this local economy.'",
        "'speaker_2': 'Last last week, you know, we've been we've been planting our own little garden in the Brooks household. And my joy comes when my my kids, every day, they get home from school, they run straight to the garden and they're able to see, how's the zucchini doing?'",
        "'speaker_2': 'Okay. How's the tomatoes doing? Okay. The squash is looking pretty good. And so you see that we're instilling this in young people. And even in my family, we didn't we didn't have these kind of opportunities. And so that my kids are already starting at this young of age and they understand how to plant and they understand how'",
        "'speaker_2': 'to be a part of this healthy lifestyle is transformational. And that's why it's so important that we pass this piece of legislation. So I will I'll be supporting this. I think it's important when we when we tackle food deserts, that we have the macro in the micro envision, we've got to make sure that we have these grocery'",
        "'speaker_2': 'stores. But at the same time, we've got to make sure that there's a local grass root education going on throughout our community. And I think this policy is going to create that. So I hope that my colleagues will support this.'",
        "'speaker_2': 'And once again, thank you to Councilwoman Shepherd and Councilwoman Cohen each.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilman Lopez.'",
        "'speaker_2': 'Thank you, Mr. President. I am absolutely supportive of this ordinance. I think this is frankly a no brainer for us. And I think that you'll find that, you know, a lot of folks are very supportive in this city, and a lot of folks would probably say, you mean we couldn't do that in the first place?'",
        "'speaker_2': 'Right. I mean, there's there's a lot of support. Hmm. Unfortunately, we still have food deserts and having Eric and folks at revision and the bottom up thought out in Westwood working to stand in the gap. Basically when it comes to food deserts, they do it passionately.'",
        "'speaker_2': 'They do it despite the rising cost of water. Although in these chambers we vote to create this ordinance to support this, there are other quasi governmental chambers that still give give us grief about a reduced rate in water so that folks can actually grow.'",
        "'speaker_2': 'I'm talking about Denver water. We need to be able to partner and we need to be able to do this, not just the city and county of Denver, but in all of our agencies to support this and to support this effort, because that's the gap.'",
        "'speaker_2': 'The gap is that in very many neighborhoods, for decades, they've had. No grocery store. And if they do, it's potato chips and Pepsi. And it's not something that is healthy and not something that promotes a healthy lifestyle or combats disease and obesity.'",
        "'speaker_2': 'In some zip codes in Denver, you have folks who suffer from such high rates of diabetes and heart disease and obesity that they live 12 years less than other zip codes and people in other zip codes. That's how bad this crisis is.'",
        "'speaker_2': 'And if we are witnessing a health crisis now, imagine what it will be like ten, 20, 30 years down the line when those same communities do not have access to fresh produce. So this is absolutely standing in the gap and allowing folks to build that local economy because jobs are still hard to come by.'",
        "'speaker_2': 'But I don't want this passes tonight, which I expect it to and expect to see. A lot of the proponents in this chain, in these chambers continue to do the hard work that they're doing. I don't want this to be an excuse as to not put a grocery store in a neighborhood and not fill those gaps in'",
        "'speaker_2': 'this city where people do not have access to healthy food. We have the power and we have the resources in this city combined to do that. The entities constructed and assembled and boardrooms ready to do that. It just takes the will.'",
        "'speaker_2': 'My son has guns, as we say, in Westwood and in West Denver. The desire to do it. Until then, I apply to you all for taking this commonsense idea, turning it into legislation. I applaud sponsors for doing this and making sure that in the meantime, great folks like you are standing in the gap and there's great progress'",
        "'speaker_2': 'and there's an amazing sense of community that is born out of this. So I absolutely support this, and it's something that's long overdue. It is something that is absolutely ancient in its ways and ancient in its wisdom. Thank you, madam.'",
        "'speaker_2': 'Thank you, Mr. President. I didn't mean that like Brooks did. I meant that. I'm sorry. Thank you, counsel. Mr. President.'",
        "'speaker_1': 'Mr. President. Councilwoman Fox.'",
        "'speaker_6': 'Thank you, Mr. President. I've heard how enthusiastic some of our citizens are about this proposal, both from tonight and the time before. And they've convinced me that it may be a worthwhile project for some areas of town. Unfortunately, this proposal applies to almost all zoning districts.'",
        "'speaker_6': 'And I do think, Councilwoman CORNISH, for exempting several small areas in my district that historically have had very restrictive zoning. Now, not the areas in my district are in a food desert. So that's different from the testimony that many of you have given.'",
        "'speaker_6': 'We do not have that issue, and that's not something we're solving for by considering this ordinance. My three most active associations chose to take a formal vote on this proposal. And all three of those will be included in the sales.'",
        "'speaker_6': 'So they are included under this ordinance. One neighborhood split. Two unanimously opposed. Ironically, the night that the two that unanimously opposed these ordinances, the night that they took the vote, they had a guest speaker. And it was a master gardener, a professional gardener who had supplies that he had brought.'",
        "'speaker_6': 'And he was trying to have people even have some freebies to take home. So there was a good crowd and they were all ones who wanted to garden. They really did find a number of problems, however, and chose that they didn't want to support it.'",
        "'speaker_6': 'They did, however, say that they wished that the ordinance was trying to promote more farmers markets on arterials that they would have supported. They did. I would say that the most common complaint I get from constituents when I send out my survey is they write back saying, please don't let my neighborhood go downhill.'",
        "'speaker_6': 'Traffic and commercialization. Are two of the things they're concerned about now. I would say their biggest concern about this ordinance is that it dramatically increases commercialization in residential areas and it's visible. I mean, not like somebody cutting hair behind your closed door.'",
        "'speaker_6': 'You don't do that out on the front lawn. Here, you're going to be doing it out on the front lawn. There's going be a stamp set up, could be from 8 a.m. to dusk every day of the year according to this ordinance.'",
        "'speaker_6': 'That is something that they are extremely concerned about. Likewise, we have such a large yards and the potential of growing so much vegetable that there would be a possibility that traffic could increase because people would be drawn to these areas.'",
        "'speaker_6': 'And that is something that concerns them. I'd certainly be tempted to support this if it started with, say, areas of change and allowed stable neighborhoods that wanted.'",
        "'speaker_4': 'To to opt.'",
        "'speaker_6': 'In. If we were to start smaller and see how this goes in areas that really do have the need. That would be something I'd be tempted to support. But that's not how this ordinance is written. And given the feedback I have gotten in my areas, I will not be supporting it.'",
        "'speaker_1': 'Thank you, Councilman Fox. Councilman Nevett. Thank you, Mr. President.'",
        "'speaker_2': 'Oh, excuse me. So I want to express my support for this. But I also want to do two other things. One is to make a whiny little complaint, and then I'll follow that up with something that might maybe a civics lesson that I've learned from the whining complaint.'",
        "'speaker_2': 'So starting with the expression of support, this move makes perfect sense. In a perfect sense, it's it's the obvious next step in a trajectory that we began some time ago, a trajectory towards a more inclusive, a more local, a more diverse, a more sustainable food system.'",
        "'speaker_2': 'And each step on this trajectory, each step that we've taken has been preceded by a great deal of anxiety and nervousness and controversy. And each step that we've taken has been followed by almost complete silence and no problems whatsoever.'",
        "'speaker_2': 'This started with Councilwoman Lemon. She was the one who kicked this off down this road by moving to legalize the keeping of bees inside the city and county of Denver. So you can imagine the controversy associated with potential of your neighbor keeping bees.'",
        "'speaker_2': 'But she persevered. We legalized the keeping of bees. And as far as I know, there have been virtually no complaints of the keeping of bees. Great. So people who want to keep bees can keep bees. Some people are better off.'",
        "'speaker_2': 'Nobody's worse off. I followed that up by legalizing the keeping of chickens. Again, a great deal of anxiety controversy. Your neighbors are going to keep chickens and all hell is going to break loose. But we persevered and we passed the legalization of the keeping of chickens.'",
        "'speaker_2': 'And we have had virtually no complaints over the keeping of chickens. So once again, people have more diverse food sources. They get to enjoy what they are doing. They have new freedoms and some people are better off and no people are worse off.'",
        "'speaker_2': 'So this is clearly the the next step. We're a diverse city with diverse interests and diverse enthusiasms. If you want to do something, even if I don't particularly like it, and you can do it without causing problems for your neighbor.'",
        "'speaker_2': 'Who are we to say no? So now let me get to my whiny little complaint. Inside this bill is the provision that the sale of cottage foods cannot begin until 8:00 in the morning. But in the rest of our code, you can begin almost anything at 7:00 in the morning, so I can start hammering shingles on my'",
        "'speaker_2': 'roof at 7 a.m., I can start running a table saw in my backyard at 7 a.m.. I can start jackhammering up my sidewalk at 7 a.m., but I have to wait until 8 a.m. to go next door and buy a basket of tomatoes from my neighbor because otherwise it would be too disruptive.'",
        "'speaker_2': 'So down the road this perversity will be ridiculed and the people ridiculing her will wonder what kind of morons were on city council who thought that buying vegetables was more disruptive than jackhammering your sidewalk? And you know, our code is rife with this.'",
        "'speaker_2': 'Everyone can point to pieces of our governance that are obviously ridiculous and that, you know, the who were the idiots on city council who approved this. But this is actually a great opportunity to offer maybe just a little bit of a civics lesson.'",
        "'speaker_2': 'This kind of outcome isn't the product of morons because there's 13 brilliant people on the city council. This is one of the dis tempers of democracy. This is what happens actually, when democracy works. Councilwoman Kennish has done exactly the right thing.'",
        "'speaker_2': 'She had a good idea. She saw input from all corners of the city. That input was diverse. Some people were supportive. Some people were opposed. People had concerns. And she tried to address those concerns. And one of the ways as a good representative, Democratic representative, addressing some of those concerns involved, allaying some of the fears of some'",
        "'speaker_2': 'people in some neighborhoods by moving the start time from 7 a.m. to 8 a.m.. And I noticed tonight this was not without controversy, but tonight everyone is testifying in favor. So those who are opposed appear to be somewhat mollified and they're not here.'",
        "'speaker_2': 'Councilwoman Kennish did exactly the right thing, and this ordinance is the product of that democratic process. But that democratic process is not always internally coherent. It's not always absolutely consistent in the way it would be if we simply wrote the rules with a single point of view and a single point of time with a single perspective.'",
        "'speaker_2': 'So down the road, when you find something that the city is doing that you think is moronic or crazy or perverse or incomprehensible, just think back to this. And remember, sometimes when democracy works, you get outcomes that aren't necessarily coherent, but they're democratic nonetheless.'",
        "'speaker_2': 'And I look forward to getting this passed and letting people sell food to their neighbors, as they should have been all along. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Nemec, Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. First of all, I want to thank Councilwoman Kenny for her efforts. I know that she's been working on this for some time and has done very extensive outreach to our RINO's and other organizations that care very much about this issue.'",
        "'speaker_6': 'I was part of a group that went to New Mexico a couple of months ago looking at and talking about food sustainability issues, and we came back with some very important lessons learned and suggestions. And we're actually following up with two meetings next week with a number of our key city players to talk about some of those'",
        "'speaker_6': 'lessons learned, including the fact that if you have not looked at the food section in the mayor's climate action plan, there's not very much in there about food. And so we've got some strong suggestions that we're going to be talking with some of the Cabinet members about that we'd like to see incorporated into the Climate Action Plan'",
        "'speaker_6': ', because that's a document that looks, you know, years into the future. And you've got to take into account the new opportunities that are available. And when you look at what cities are doing all across the country and we had a chance to learn from other cities in the southwest, this was a tremendous opportunity where they're trying to'",
        "'speaker_6': 'address many of the same topics that we talked about here tonight of providing food for people that are in food deserts, creating the opportunities for people to grow food in their home, and they can make a little bit of money from that.'",
        "'speaker_6': 'We have organizations in Denver like Denver Urban Gardens, who has been around for, I want to say, almost 30 years. Is that. Correct. Whereby we have specific fixed site locations in the city of Denver that are serving people in those neighborhoods.'",
        "'speaker_6': 'Many of them when they started, were very low income communities. But many of those original gardeners, even though many of them may have left that neighborhood, still garden in those in those locations and are providing food for their families.'",
        "'speaker_6': 'I think the opportunity to be able to allow folks to sell what they are growing to their neighbors, to folks that are in need. I think you're going to see some traffic reduction because you're going to see neighbors walking to neighbors homes.'",
        "'speaker_6': 'You're not going to see people getting in cars and driving to the grocery store because they're going to enjoy having access to fresh fruit and vegetables. And so I think that's a good thing. I think this is a big step forward for the city.'",
        "'speaker_6': 'I'm excited about the opportunities that it's going to create. I've been gardening for a number of years. As a matter of fact, Councilman Brown, who's not here tonight, has historically shared tomatoes with many of us. I'm growing some yellow tomatoes from a plant that he gave, and I'm just waiting for them to get ripe so I can'",
        "'speaker_6': 'try to see how they compare to the red tomatoes. I'm not planning to sell anything out of my garden because I usually just give stuff away when I have any excess. But I think this is a big step in the right direction for the city of Denver, and I'm very happy to support it.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you again, Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you, Mr. President. I also wanted to thank Councilman Kennish and Councilman Brooks and Councilwoman Sheperd for bringing this creative and most needed amendment forward several years ago. I was able to sponsor a text amendment that would allow for aquaponics in this in the Swansea neighborhood.'",
        "'speaker_6': 'And at the time it was something that wasn't really being done. But the whole idea behind aquaponics in this old and this old greenhouse was to allow for fish to float in a tank and swim around and then be able to use the fertilized water to grow lettuce and other vegetables in this particular greenhouse.'",
        "'speaker_6': 'And that's when I began to learn so much about the merits of the food justice system and movement and the empowerment that people feel when they grow their own food. The awesome, amazing power that people feel when they when they can do that.'",
        "'speaker_6': 'And then that was followed by the bees and the chickens and the goats. And and now today, we're talking about being able to just put a basket out in front of your yard and be able to sell. So I am really, really excited about that.'",
        "'speaker_6': 'The idea that the city of Denver actually recognizes the food justice movement is so amazing and incredible to me that something so simple as being able to grow your own food in your garden can actually help you with your and your family and being able to bring everybody together, your community, but even the basic economics of growing'",
        "'speaker_6': 'your own vegetables. I'll just give you a real quick example. The other day, we were in the mood for color visitors, which is, you know, squash and onions and jalapenos and garlic. And we went to the farmer's market because we didn't want to go to a to a grocery store.'",
        "'speaker_6': 'And I took tabs on how much I paid for everything. You know, each squash was like a dollar 50 each could eat. You know, each dollar piano was, you know, like two for a dollar 50 and the onion and the garlic.'",
        "'speaker_6': 'And I thought, Oh, if I had a garden in the back, I could have just gone and, you know, picked my own little garden. So it wasn't a lot of money, but, you know, it kind of adds up.'",
        "'speaker_6': 'And I thought I could, you know, I could do this. Now I want to say that I have just one little tomato and his name is Tiny Tim and he's sitting in the kitchen. And I'm trying to do my best to have him thrive.'",
        "'speaker_6': 'And maybe someday he'll, you know, maybe someday I'll have tomatoes. But what I'm trying to say is that if you're talking to somebody that doesn't really know how to grow a garden, but here's what I'm willing to do.'",
        "'speaker_6': 'You know, I'm willing to learn about composting. You know, I'm willing to pull weeds and. Willing to try my garden. And I think, you know, the idea of just being able to have that possibility. And I would be so excited if I was able to grow something and somebody would buy it from me, you know?'",
        "'speaker_6': 'You know, the squash or the garlic. I would just be so happy with myself to be able to do that. So I, you know, I come to it with the idea of actually being joyful about growing and having fun doing that.'",
        "'speaker_6': 'So I support this. Many of my constituents have weighed in and, you know, they're excited about it, too, because we live in an amazing city that's always pushing the envelope and trying to do new things. So I will be supporting this and congratulations to all the sponsors.'",
        "'speaker_1': 'Thank you, Councilwoman Monteiro. Councilman Rob.'",
        "'speaker_0': 'Thank you, Mr. President. All right. Just a couple of word choice or semantic differences with my colleagues, but general support of this bill. Councilman Lopez said that this is a no brainer. And I think you said for us.'",
        "'speaker_0': 'I think that's definitely true in some neighborhoods.'",
        "'speaker_6': 'That this is.'",
        "'speaker_0': 'Pretty universally wanted. But in my neighborhood, I didn't find.'",
        "'speaker_6': 'It a slam dunk in my district.'",
        "'speaker_0': 'To talk to the neighborhoods. I probably have 15 neighborhood organizations at least. I put this in my newsletter three times, about three months in a row.'",
        "'speaker_6': 'Asking for feedback.'",
        "'speaker_0': 'Referencing all the links. Of course we know how much people read email, so maybe not everybody read it. But of all of that, in Councilwoman Connection's outreach, only two neighborhood groups discussed the ordinance enough to then contact me.'",
        "'speaker_0': 'One couldn't agree to support it, but they also couldn't.'",
        "'speaker_6': 'Agree to oppose it. And so I sort of had this letter.'",
        "'speaker_0': 'Or communication of.'",
        "'speaker_6': 'We discussed.'",
        "'speaker_0': 'It and we don't know it. It wasn't a no brainer for them.'",
        "'speaker_6': 'They had some real.'",
        "'speaker_0': 'Concerns and they had some real desires. One neighborhood did oppose it, which has given me a lot of pause and probably for some of the reasons that Councilwoman Frances neighborhood opposed it. The commercialization of a neighborhood which I understood, but I but both Councilwoman and I took some time to talk to those neighborhood leaders.'",
        "'speaker_0': 'And then while I get thousands of emails on all sorts of topics, I don't think I had more than five.'",
        "'speaker_6': 'Personal emails.'",
        "'speaker_0': 'On this topic from Council District ten, and probably this just shows how different all our districts really are. We don't have large lots in my district. It's probably not a huge income burner for.'",
        "'speaker_6': 'Folks in my district.'",
        "'speaker_0': 'And that's a second sort of word choice disagreement I have. I don't know if this is a huge step for Denver. I actually think it's sort of a small step. One of the neighborhood leaders, zoning chair in Cherry Creek North and I were chatting and I said, I don't think this is going to happen much in our'",
        "'speaker_0': 'district, sort of like the corner lemonade stand. And he laughed and he said, Yeah, we'll probably have a celery stand on the corner. Some kid will be out selling celery. And there.'",
        "'speaker_6': 'Wasn't that that.'",
        "'speaker_0': 'Great a concern. We're not talking, although it's important to grow your own produce. It's a good hobby, can be healthy, can be a lot of work. But we're not talking about a get rich fast scheme here in growing produce and selling it.'",
        "'speaker_0': 'Councilwoman Sheppard's letter referenced how little she actually made. Still, I think it's good for the neighborhoods where they want to do it and not harmful for the neighborhoods where there's not as much interest. So I am going to go ahead and support this.'",
        "'speaker_1': 'Thank you, Councilwoman Robb. Councilwoman, can each.'",
        "'speaker_0': 'Thank you, Mr. President, and thank you to all of my colleagues for the thoughtful comments. This job. I love this job. Did I say that once tonight? Already it's really a privilege. And you can choose to make an impact in a lot of different ways from the Council.'",
        "'speaker_0': 'We have a rule in our office which is that we only ever take something on if we have a partner. We're small, we only have myself and two staff who are outstanding, but we want things to live past my term in office.'",
        "'speaker_0': 'We want things to live past what three people can do. And so every now and then you get lucky and in walks the door, an amazing set of partners, and they have an idea. And so in this case, it was the Sustainable Food Policy Council, which is a group of appointees of the mayor and also a collaborative'",
        "'speaker_0': 'known as the Live Well Regional Community Collaborative, few other revision and other organizations. But thank you to those. Partners, some of whom spoke today. But also thank you to the other residents who spoke. We had Curtis Park here and in the prior hearing we had other residents.'",
        "'speaker_0': 'We really did have what I call true democracy, which is people came up with an idea and they researched it and then they brought it to our office. So so I didn't do very much work on this one.'",
        "'speaker_0': 'And really the work was done by those partners and my staff. So Dana miller, Shayna Spurlock, our planning person, Sarah Showalter, and also my staff even, that's on it. I also want to thank Mayor Hancock because I appreciate his evaluation of this ordinance compared to the priorities that he has for the city in which today was our'",
        "'speaker_0': 'state of the city, where he talked about these things. He talked about food that doesn't travel so far and food that's accessible. And so I thank him for his support of this ordinance, which he shared with all of our colleagues last week to those who've had a few concerns about neighborhood quality of life.'",
        "'speaker_0': 'We did research the other cities that have done this. Wheat Ridge has had this in place for some time. Not one complaint related to quality of life. The city of Seattle, almost identical in size 600, some thousand residents, very similar, you know, size of the city, neighborhoods that are somewhat dense with some neighborhoods that are somewhat more'",
        "'speaker_0': 'suburban or bigger, bigger yards. No complaints related to quality of life. Parking just has not been an issue, and we have no evidence that it would become an issue. There is an interest the city has in uniformity of zoned districts, and I want to share that.'",
        "'speaker_0': 'Although I'm passionate and part of the reason I was excited to bring this ordinance up in terms of food deserts in low income neighborhoods, I am at large and I took this on with the intentional desire that it was really something that should be available to all neighborhoods, that which may be small for the city, could be'",
        "'speaker_0': 'very large for an individual. And so when I heard from a retired woman in a very middle class, stable neighborhood with access to three grocery stores that she felt pretty excited about making her jam available and that this was something in her retirement that would give her joy.'",
        "'speaker_0': 'That's an opportunity. And so I don't think that this only is about some neighborhoods in the city. I do think it's a different opportunity in different neighborhoods, but equally valid and equally important. And so I do want to thank Sue Ackerson from from Curtis Park about the economics in my own house, the entrepreneurial spirit as is taking'",
        "'speaker_0': 'wind. And I recently had, you know, access to regular and my five year old son informed me that we were no longer allowed to give it to the neighbor because we were supposed to be selling it. So, so clearly.'",
        "'speaker_0': 'Clearly, that entrepreneurial spirit starts early and takes off with a vengeance. Nothing in this ordinance prohibits the free distribution of vegetables. And I'll just please note. And so I'm excited that it's not often you can with one swoop, one person can earn a little cash and one person can get some fresh food.'",
        "'speaker_0': 'And you don't have to leave the neighborhood. And that's what this does. And I believe we will have a review at one year point. I'm sure at that point we're going to find that there were very few problems, but we will follow up on any that arise.'",
        "'speaker_0': 'And I appreciate the city for engaging in the dialog. People learned a lot through this process about why it's safer to buy your vegetable from your neighbor than it is from a farm. Produce in a country that uses pesticides that are banned here, or from a farm that uses machinery, equipment, even if it's on the western slope'",
        "'speaker_0': 'that's subject to bacteria in ways that handheld vegetables are not. And so people learned a lot about food safety and about all of the pieces of this. So so this was a conversation not just here at the dais, but across the city.'",
        "'speaker_0': 'And so I think everyone who is engaged in it and who communicated, regardless of their concerns or their side on the issue. And with that, I thank my colleagues and urged them to vote yes and respect those who will dissent, but appreciate their engagement as well.'",
        "'speaker_0': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Canete. See no other comments from members of the Council. Madam Secretary, roll call.'",
        "'speaker_0': 'Can each I Liman by Lucas Montero. Nevitt Ortega, Rob Fry, Brooks.'",
        "'speaker_2': 'I.'",
        "'speaker_6': 'But no.'",
        "'speaker_0': 'Mr. President. Hi.'",
        "'speaker_1': 'Councilwoman Lehman. Thank you, Madam Secretary. Please go to the end and have the results. 9199918 Council Bill 398 has passed. We are moving on to our second public hearing council bill. 502 Councilwoman Kenneth, would you please put council bill 502 on the floor?'"
    ],
    "Service Plan for GCC Metropolitan District No.1 Formation and Establishment.": [
        "'speaker_0': 'Yes, Mr. President. I move that council bill five oh to be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved in, seconded the public hearing for council bill. Final Two is now open. May we have the staff report? Good morning or good afternoon. Good evening.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_1': 'I'm Andrew Johnston. I'm here at the Department of Finance on special districts and I'm here on Council Bill 502 Series 2014, which is an an ordinance to approve the service plans for the creation of the JCC Metropolitan Districts, number one.'",
        "'speaker_1': 'And two, the service plans for the JCC Metropolitan Districts. One and two are being submitted for the City Council approval on behalf of Globeville One LLC, pursuant to the requirements of the Special District Control Act, Title 32 of the Colorado Revised Statutes.'",
        "'speaker_1': 'This are these districts that we're going to hear about today have been a true collaboration between the Adams County and Denver County as the metro districts are located on a site that is the former Asarco smelting plant site, with approximately 80% of the project being located in Adams County and 20% located in Denver, generally located at the'",
        "'speaker_1': 'northwest corner of East 51st Street and Washington, running north to East 55th Street. The development will not have any residential development and accommodates only commercial and manufacturing development within the district's physical boundaries. The service plans address public infrastructure financing on the multi-jurisdictional, multi-jurisdictional site districts one and two are located in Denver and are the service plans pending'",
        "'speaker_1': 'for approval tonight. The service plans of districts number three and four are concurrently going through Adams County approvals process and should receive final approval on July 22nd. The service plans of Adams County are substantially the same as Denver's service plans.'",
        "'speaker_1': 'Adams County has agreed to include Denver's requirements of prevailing wage, smaller disadvantaged business enterprises, discrimination and public art. The districts will be responsible for coordinating the construction operation, financing and maintenance of all the improvements the JCC metropolitan districts have.'",
        "'speaker_1': 'All the powers of a metropolitan district described in Title 32 of the Colorado Revised Statutes as limited in the pending service plans. The financing plan specifies that a debt cap of 50 mills for debt and a total debt cap for all four districts not to exceed 25 million.'",
        "'speaker_1': 'The service plans anticipate 9.6 million of estimated infrastructure cost, utilizing only 40 mills for debt and issuing bonds to fund the infrastructure over time, including principal and interest. The service plans also anticipate levying ten mills for operations. The district's proponents are aiming for a November 2014 election for district creation upon approval by property owners in the districts'",
        "'speaker_1': 'at the November election and the court order, the districts will have the authority to operate in a manner prescribed in their service plans, city staff recommends and approval of Council Bill five or to the applicant. Their representatives and city staff are here tonight to respond to your questions regarding this Council bill.'",
        "'speaker_1': 'We will hear quickly a presentation from the developer and via finance group Cameron Birch, Ron and Sarah Laverty are here. The law offices of McKee de Cisneros, including Cassie Affirmant and Megan Becker, are here, and the city attorney's office.'",
        "'speaker_1': 'Karen Adolescent Nathan Lucero also worked on this project. Now we'll hear from Cameron Bertrand. The presentation, Madam Secretary. And. So.'",
        "'speaker_2': 'Thank you, Mr. President. Members of City Council. My name is Cameron Bertrand. I work for Enviro Finance Group and our company, Globeville One LLC is the applicant. Our company is located at 475 17th Street in downtown Denver. We are a Denver company, and I just wanted to provide a brief bit of context around the technical portions of'",
        "'speaker_2': 'the metropolitan district that Andrew just brought forward. Enviro finance group is a company that is Denver based. We're headquartered here and we specialize in what we call brownfield redevelopment. We acquire, remediate and finance the redevelopment of environmentally contaminated properties.'",
        "'speaker_2': 'And it's always exciting for us to have a project in our own backyard, as this one very much is. The project itself, as Andrew said, is located between 55th Street and 51st Street in north central Denver, along the corridor that is Washington.'",
        "'speaker_2': 'It's a 77 acre site which in a fully built out city like Denver, is quite a large area and we think create a great opportunity for the neighborhood and for Denver as a whole of that area. You see the county line in the slide in front of you is located along 52nd Avenue.'",
        "'speaker_2': 'So approximately 15 acres are in Denver and approximately 62 are in Adams County. That being said, I think it's worth noting that the neighborhood most immediately affected by this site, both historically and going forward, is the Globeville, Elyria, Swansea neighborhoods.'",
        "'speaker_2': 'This was a historic source of employment for them and we hope will be again in the future. Once we accommodate for roads, drainage, infrastructure, we get about 60 net developable acres. It is a contaminated site and has been for many, many years.'",
        "'speaker_2': 'The history of this site is one of the Asarco companies Globe plant where they've smelted metal dating back as early as 1886. On the good side of that is it created a great many jobs for a great many people for a long time.'",
        "'speaker_2': 'The downside of that is that the process of smelting metal contaminated the buildings, the soil and the groundwater. And it's been that case for many, many years. Our company has gone about the remediation process, and that includes the abatement and demolition of all the buildings that were out there, remediation of the groundwater that would otherwise flow as'",
        "'speaker_2': 'a base and into the South Platte River and then also soil remediation so that the soil itself is not a danger to health and human environment. I won't go into the details on this slide, but I've got it here.'",
        "'speaker_2': 'If anybody has questions later, the process for development is to take the site where we find it today or where we found it in 2011 when we started abate and demolish those buildings. That work has been done and was completed in 2012.'",
        "'speaker_2': 'That sets the stage for groundwater and soil remediation, which then sets the stage for grading and infrastructure. And then that middle slide, what you see is what what? Once we've been stopped, once we've graded out the site and installed the infrastructure you will have, which is basically four large super pads that can then accommodate individual commercial development'",
        "'speaker_2': '. So that image on the right is one version of how this site might build out. That grading is not a small matter. There's about a 40 foot grade difference between 55th and 51st. So a lot of the exercise is one of creating flat, developable pads.'",
        "'speaker_2': 'The picture that you see on the right is just one example of how it might built out. But that example, there is a million square feet of new commercial development, which we think is an exciting opportunity for central Denver, north central Denver, but also its capacity to create jobs for for the residents of North Denver.'",
        "'speaker_2': 'In terms of timeline, like I said, we completed abatement and demolition of the buildings in 2012. Groundwater remediation was fully installed in two phases and completed by late last year. It is working, we think, extremely well. All the readings that we're getting suggest that the remedy is working and we believe that by the end of this year'",
        "'speaker_2': ', the first quarter of next year, the groundwater remedy will be completely signed off on by the Colorado Department of Health and Public Environment. Soil remediation is follows. Groundwater remediation is underway now. It's an exercise of mixing the contaminated soils to stabilize them and then place them in a location where they don't come into contact with either groundwater'",
        "'speaker_2': 'or people. That is work that we expect to be done before the end of this year and it will then concurrent with over lot site creating or the placement of clean soil on top of the contaminated soil. What that does is that puts us in a position at the end of this year to actually begin to install'",
        "'speaker_2': 'site infrastructure, stormwater pipes, sewer pipes, water pipes, roads, streetscapes, etc. Which brings me to why we're starting this process now to create the metropolitan districts to do this site entitlement, to get the sign off so that at the end of this year, when the remediation is done, we'll have all the approvals that we need to go immediately'",
        "'speaker_2': 'into site site development and we think set the stage for vertical development as early as the second half of next year. So we think it's an exciting opportunity. The Metropolitan District is the tool that helps us finance that site infrastructure.'",
        "'speaker_2': 'Specifically, we think we have about $9.7 million worth of public infrastructure to install on this site, mainly consisting of streets, streetscapes, stormwater, sanitary sewer and water. The metropolitan district, we believe, has a bonding capacity of about 11.85 million, which, after fees and other costs, yields about $9.7 million worth of capacity to spend.'",
        "'speaker_2': 'It's worth noting that those models were run at 40 mills while the district has a capacity of 50 mills. So that extra ten mills that we don't intend to use do provide an additional $6.1 million in capacity if the infrastructure were to cost more than we anticipate the district is.'",
        "'speaker_2': 'The service plan includes a $25 million maximum debt issuance with a 50,000,000 million maximum. Debt service limit in terms of the mills on the site. And the other thing that we just put on here to note is that this site is also an urban renewal area with a property tax increment area, again in both Adams County and'",
        "'speaker_2': 'our county. So we will also have an agreement with Deer to provide for what I would call sort of the pass through of those property taxes that would go to Daera and then come back to the district so that the district can make its debt service.'",
        "'speaker_2': 'And then just in in in closing, I just wanted to say a broad thank you to an enormously long list of people that I won't go through. But this is a project that has been around in Denver since at least 2007, if not longer.'",
        "'speaker_2': 'The cooperation between Denver and Adams County has been remarkable. The work that the city agencies from Finance and Office of Economic Development that provided a grant, Adams County provided a HUD 108 loan, the Denver Urban Renewal Authority and the City Council provided a backstop for that loan to give HUD the comfort, to put it in place in'",
        "'speaker_2': 'the first place. And then all of the many, many neighborhood groups and neighborhood meetings that have gone into it. And a personal thank you to Councilwoman Monteiro, who has been there every step of the way, sometimes patting us on the back and sometimes kicking us in the butt to keep this one moving forward.'",
        "'speaker_2': 'And it has been a real privilege to work on it. And we're excited to be at a place where we can start talking less about cleaning it up and more about building buildings. And with that, I'll sit down.'",
        "'speaker_2': 'I do. If you have actual questions or hard questions. Kathy and the folks from D.A. Davidson are here and we can answer those questions. Thanks.'",
        "'speaker_1': 'Thank you, Mr. Bergeron and Mr. Johnston for the staff report. We have three speakers signed up and all three of them can come to the front pew and speak. We have Kathy Affirmant, Zachary Bishop and Mr. Saco.'",
        "'speaker_4': 'Good evening, councilors. My name is Kathy Offerman. I'm here with Mike Cisneros on behalf of the applicants of the JCC metropolitan districts.'",
        "'speaker_0': 'I don't have any independent comments, but I'm.'",
        "'speaker_4': 'Available for questions. Should the Council have any?'",
        "'speaker_0': 'Thanks.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Zachary Bishop. Good evening. I'm Zach Bishop with D.A. Davidson and Company. We are bankers for the Metropolitan District located at 1600 Broadway and also just here available for questions.'",
        "'speaker_1': 'Thank you, Mr. Speaker. Yes.'",
        "'speaker_7': 'Germans say Ku Klux Arts Movement Self-defense advocates for poor, working, poor and homeless people. Metropolitan districts. We require a lot of research and study. Especially when they're being organized and sponsored by corporations. And if you don't have strong community support in education, then what you will have happen is that a superimposed authority, quasi judicial, who can tax'",
        "'speaker_7': 'commercial and private properties through the House written up. And I haven't seen the write up in terms of how this thing is going to operate, operate because you have to create a board that's going to control this thing, say.'",
        "'speaker_7': 'And when you get to talk about how the board is going to be appointed or elected and how the community is going to be involved in that in terms of selection of the people who are going to participate in this thing.'",
        "'speaker_7': 'And then it's a hidden tax because most people don't even know they're in metropolitan districts who are in metropolitan districts because most of the citizens don't either look at this stuff going on down here or is explained to them thoroughly what this is going to happen before it gets on the ballot.'",
        "'speaker_7': 'And then they missed it. And then it pops up in the text and they say, What is this? And then it becomes the law. Because you didn't participate, because you weren't paying attention, because you was watching a baseball game.'",
        "'speaker_7': 'When these kind of decisions are being made, that's going to impact you for the next 20 years. 20 years. And you don't even know these people here. You don't even know him. You haven't even been in the corporations to see what their community involvement has been historically.'",
        "'speaker_7': 'And you're going to pass this. You've already made up your mind to do it. I know you're going to do it. And that's okay. Because one thing I've learned from coming here for three and a half years is that I had to learn tolerance.'",
        "'speaker_7': 'There were things that I was going to have to accept that I hated, and yet I'd have to tolerate it because of the misinformation and education of the masses of people. They wouldn't understand what I was talking about anyway, and what he was just talking about was so garbled and mixed up with folks who had happy.'",
        "'speaker_7': 'Y'all don't even know what he was talking about.'",
        "'speaker_1': 'Mr. Speaker, you.'",
        "'speaker_7': 'Say with this.'",
        "'speaker_1': 'Mr. Speaker, thank you for your time.'",
        "'speaker_7': 'Support this thing just on the strength of tolerance.'",
        "'speaker_1': 'Until the people wake up to this. Thank you. That concludes our speakers for Council Bill five of two. Do we have any questions for members of council? Starting with council members?'",
        "'speaker_2': 'Yes. CAMERON Well, I'm sorry I stepped down and you may have already talked about this, but I'd love to get kind of a grander vision of what you guys hope to accomplish here on the site. You talked a little about commercial, but I don't know if some some visioning has been done.'",
        "'speaker_2': 'And maybe you can go into that a little bit. A little. The answer to your question is a little bit. Sorry. I'm trying to see if I can make that this image a little bit bigger. But the the site is is for a variety of reasons, got a number of restrictions that will stay in place that will'",
        "'speaker_2': 'prohibit residential use, agricultural use. So commercial use is the is the principal use. And we really think, given its location at the really the crossroads of I-70 and I-25, that it's a fabulous opportunity for Denver and Adams County to build new warehouse logistics distribution, flex new modern manufacturing.'",
        "'speaker_2': 'So I would I would really describe it as a business park. And then the site layout itself is actually dictated to some extent by that grade differential, where the Adams County site is almost 35 to 40 feet higher than the Denver County side.'",
        "'speaker_2': 'So the infrastructure almost starts to lay itself out. But the way I would describe it is sort of akin to Stapleton Business Center or Compaq or other large, you know, commercial business parks in the metro area. The nice thing about this one is, is it's right in central Denver where we're losing a lot of that opportunity to'",
        "'speaker_2': 'years. But it's exciting to get some light in manufacturing capacity. What's the zoning on this? It's today the zoning is it's got four zoning districts because it's got two in Denver and two in Adams County. In the old code, I would sort of call it eye to.'",
        "'speaker_2': 'Yeah, well, on the Adams County side, there will be a pudi that'll overlay that zoning. But we're really focused on clean, modern manufacturing logistics distribution. And we think that the other thing that's nice about this site is it's got some the potential for some very large parcels where you can build some some 300,000 or larger square foot'",
        "'speaker_2': 'buildings, which is kind of unique for central Denver.'",
        "'speaker_1': 'Thank you. Thank you. Councilmember Councilwoman Montero.'",
        "'speaker_6': 'Thank you, Mr. President. Um, I'll just I'll ask this question and then you guys can figure out who who should take it. So let's talk about the election and who's going to pay for the election. When is the election for the metro districts?'",
        "'speaker_6': 'And then who gets to vote?'",
        "'speaker_4': 'Looks like he's gonna like Councilwoman Monteiro.'",
        "'speaker_0': 'I'm happy to respond to those questions. Garcia from Anthem. Mickey D's for.'",
        "'speaker_4': 'Should the service plans be approved by both city.'",
        "'speaker_0': 'And county of Denver and Adams County? We're gearing up for a November 2014 election.'",
        "'speaker_4': 'The electors of the districts will be.'",
        "'speaker_0': 'Qualified by the property owner.'",
        "'speaker_4': 'The district is consist the district boundaries consist of only, while the service area consists of only the 77 acres, which is our commercial property.'",
        "'speaker_0': 'So in order to vote in an election, they will be qualified by the property owner, which at that time will be Global One LLC.'",
        "'speaker_6': 'Okay. So this is I just want to want to clarify that city of Denver, across the board will not be voting on these two particular metro districts. Right. How many property owners will be voting.'",
        "'speaker_0': 'At this point? There will be only one property owner. That would be Globeville, one LLC, we anticipate at the time of the election, and that is also the only property owner that will be subject to any taxes of the district.'",
        "'speaker_0': 'Okay.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Montero. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you. I have a couple of questions. So the first one is, can you, Cameron, tell me where the entrance to the site will be? I'm assuming that there will be access points both from Adams County and Denver, Kelly.'",
        "'speaker_2': 'You bet. And is it is it possible to put this back on the screen?'",
        "'speaker_1': 'I'm secretary of the department.'",
        "'speaker_2': 'Oh, it is on the screen, is it? Sorry. There you go. So I tried to make that one image just a little bit larger, if that helps, folks. So the two main entrances to this site will very likely be 52nd Avenue, which is the county line on the south.'",
        "'speaker_2': 'Yep. Because that will come in if. I don't know if you can see my cursor. Yeah. That will come in right in the middle of the lower what I call the lower pad because that everything to the left of this road right here, all this area is about 35 feet lower than everything up here.'",
        "'speaker_2': 'So this is larger. Adams County area will very likely enter off of 55th Avenue, where we expect through the pad process to install a new traffic light. So 55th Avenue will see those larger buildings on the north end and then 51st and 52nd will feed the traffic and the low and the smaller and medium sized buildings on'",
        "'speaker_2': 'the south end.'",
        "'speaker_6': 'So do you expect the the development on the south side of 52nd Avenue to look and feel any different than the development that will be on the north side?'",
        "'speaker_2': 'I think it will in that the nature of the buildings are necessarily probably different right there. Those are 20 to 50, maybe 100,000 square foot buildings, whereas the buildings on the north side at least have the potential to be 150 to 300, even 500,000 square feet.'",
        "'speaker_2': 'So I definitely think there's an architectural difference there and a use difference. That being said, we have we are imposing a set of design standards and architectural guidelines over the entire site so that will function and feel like a single cohesive business park.'",
        "'speaker_6': 'So I want to ask some financial questions and I'm not sure. Maybe here you might be the right person. So help me understand the cost sharing on the administrative cost to get us to this point. And then what is any of the cost sharing look like as the revenue is being generated?'",
        "'speaker_6': 'I mean, you know, just looking at the map alone, you could see that you're going to have bigger buildings on the north side. Obviously, there's more land in the Adams County side. So how does that work?'",
        "'speaker_2': 'I think I understand the question. So by cost sharing, you mean infrastructure cost across the site relative to where then where the income is generated? Right. Got it. So to answer your first question from the cost, not only to get us here, but the cost to where we're going will be financed entirely by Global One LLC, in'",
        "'speaker_2': 'part through assistance from the HUD one away alone. So we do have some financing tools that help us spend what will ultimately be more than $10 million, both to bring the site to this point, but also build all the infrastructure that you see on this on this page.'",
        "'speaker_2': 'The Metropolitan District, on a day in which these buildings are built and taxes are generated, we hope will be able to issue debt to reimburse those costs in the future. But they are not going to be financed by the Metropolitan District on day one.'",
        "'speaker_2': 'Globeville one will advance those funds and hope to be repaid.'",
        "'speaker_6': 'And what was the amount of the Hudson-Odoi loan?'",
        "'speaker_2': 'It's a maximum outstanding principal balance of $10 million.'",
        "'speaker_6': 'Okay. So one last question and this is about the the tax increment piece. So it's my understanding that Doura is playing that role and I see Tracy in the audience for the entire property. Correct. So does that function in the same way then in terms of cost share, all of that associated with where the taxes are being'",
        "'speaker_6': 'generated and where they're going to be applied in terms of offsetting any of the infrastructure costs or any of those things?'",
        "'speaker_2': 'You would think so. So that the answer to your question is yes. The the urban renewal area covers the entire site and is sort of agnostic as to where revenues are generated and where costs are needed because we're trying to redevelop the entire site.'",
        "'speaker_2': 'So it is truly regional cooperation. And in that regard, I did want to be clear, though, that the purpose of of the urban renewal area in the tax increment area that has been approved so far. Was to backstop that had 108108 loan.'",
        "'speaker_2': 'And so as we sit here today, we, we don't actually believe that we will need to utilize tax increment to repay that loan, which is great news. Okay.'",
        "'speaker_6': 'So, so given that it was created as a Doura district, that typically when Doura participates in these projects, there are some administrative costs that are reimbursed back to Doura. Is that going to be handled like they're typically done with this project?'",
        "'speaker_6': 'So Tracy, I'm looking at you. Do you want to come forward and just elaborate on that?'",
        "'speaker_0': 'Good afternoon, members. Good evening, members of council. I'm Tracy Huggins. I'm the executive director of the Denver Urban Renewal Authority. The answer is yes. To the extent that there are administrative expenses incurred by Doura, it is the developer's responsibility to reimburse those costs that are incurred.'",
        "'speaker_6': 'Which may or may not happen.'",
        "'speaker_0': 'I understand there have been some costs already incurred and already reimbursed, so they are doing what they're supposed to do.'",
        "'speaker_6': 'Okay, great. Thank you. That answers all of my questions.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you, Mr. President. I have two additional questions. The the first one is, why is in viral finance not able are future developers able to build residential on the parcels in the city and county of Denver? And then the second one is maybe you can answer.'",
        "'speaker_6': 'It also is, can you share with my colleagues the public outreach efforts that you have gone through? Thank you.'",
        "'speaker_2': 'Yvette. To the to the first question, it it dates back to first and foremost, the legal answer is there's an environmental covenant that is restricts uses on the site. It was put in place by CDP. She at the time that CDP and EPA were imposing on then Asarco as the owner the cleanup standards that today we're implementing'",
        "'speaker_2': 'and it's fairly simple it is while we are remediating remediating the site to an end to a commercial industrial standard where it will be safe for people to work on the site and build buildings on the site and construct buildings on the site.'",
        "'speaker_2': 'The cleanup standards don't meet those for a residential development. It would not be you would not want children, you know, playing vegetables, growing. It really is that straightforward. And it is not a choice that Denver had. It's not a choice that Globeville one had.'",
        "'speaker_2': 'It was imposed by EPA and CDP. And it is it is the law of the land is where the site is regard is is regarded with regard to public outreach. It really goes back, almost to my knowledge, as early as 2007, there was a lot of public outreach both around the clean up of the site and the'",
        "'speaker_2': 'property around the site, then surrounding the creation of the urban renewal area, then surrounding the passage of the HUD 108 loan. Globeville one EFC is a company, has met at times quarterly, but always at least biannually with with the community to update them both on the status of the clean up answer questions about the trucks that were'",
        "'speaker_2': 'driving in and out of the community and what was going on there. And then most recently about the development plans and the creation of this metropolitan district, we had a meeting, as you know, because you were there the as recently as last month surrounding the Pudi on the Adams County side.'",
        "'speaker_2': 'So we I haven't counted them up, but I'm sure it's north of 20 or 30 and I'm sure there will be that many more to come as we develop the site.'",
        "'speaker_6': 'And then with two months ago that the Globeville Neighborhood Planning Steering Committee, we did a bus tour. Yeah. And yelled and talked for about this is like 45 minutes about about the development there on the site.'",
        "'speaker_2': 'Yeah, it's it's it's a it's a it's been a long time coming. But this this neighborhood really has gotten very involved. I think that they they really do understand what caused the contamination. They understand what we're doing to to clean it up.'",
        "'speaker_2': 'And they're excited to be moving into the to the to the point in time at which it gets gets redeveloped and and the buildings can be built and jobs can be created.'",
        "'speaker_6': 'The only other thing that I just want to clarify is I just want to ask the question can can housing be built on this property?'",
        "'speaker_2': 'Housing cannot be built on this property.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Monteiro. Councilmember, you said something mean. Did you want to.'",
        "'speaker_2': 'Oh, just going to have camera make sure that all the acronyms that he was describing.'",
        "'speaker_1': 'Colorado Department of.'",
        "'speaker_2': 'Oh, got it. Yeah. I'm sorry. So, EPA, Environmental Protection Agency, CDP, Colorado Department of Public Health and the Environment. See, EPA has given its authority to CDP to oversee us as we clean the site. Housing and Urban Development, thousands of viewers.'",
        "'speaker_2': 'Yes. Even give that. Yeah. All right. Thank you.'",
        "'speaker_1': 'Gotham Councilwoman Lyman, for bringing that up. Any other questions from members of council and seen the public hearing for Final Two is closed now? Time for comments from members of Council Council Monteiro.'",
        "'speaker_6': 'Thank you, Mr. President. Thank you so much for your presentation this evening. As was mentioned, we've been talking about the Asarco site for four years and I then I choose to count. But in this in this particular situation, I'm very excited about the cooperative agreement and partnership between Adams County in the city of Denver.'",
        "'speaker_6': 'The majority of this property is in Adams County. And as I understand it, they're probably going through a similar review for their service plans around this situation. This particular project has a possibility on the Denver site. I sound so territorial and the city and county of Denver to create a possibility of between 350 and 400 jobs and'",
        "'speaker_6': 'on the Adams count and around 1500 to 2000 on the whole site, including Adams County, that depends on the density and the development. But also we'll focus on middle skill and middle wage jobs in this in the city of Denver.'",
        "'speaker_6': 'In my opinion, there's a huge need for light manufacturing in industrial locations in the city, since many of the operations have been taken up by another industry. As far as the locations in Council District nine, the industrial park areas, as was shared with me, have the lowest vacancy rates to date.'",
        "'speaker_6': 'And on this particular site, the facilities will be modernized industrial areas, making them even more attractive to to the Globeville area. So I wholeheartedly support advancing this forward and ask for the support of my colleagues as well. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Monteiro. Councilwoman Ortega.'",
        "'speaker_6': 'Mr. President, I want to also express my support for this project moving forward. I think having known much of the history of this site and worked with these neighborhoods back when it was actually an operating smelter and lived through the whole process with the neighborhood and the whole CDP, you know, process of of cleaning up the neighborhood'",
        "'speaker_6': 'and working with EPA and, you know, looking at the cleanup that really went beyond the Globeville neighborhood, but realizing that there's an interested party that is wanting to do this development and has taken the steps to remove the buildings which in themselves required significant cleanup.'",
        "'speaker_6': 'This is exciting for these neighborhoods, creating the opportunity for employment. Looking at a site that has sat there as a vacant, sort of abandoned parcel that really wasn't contributing to the community at all in creating these new opportunities for something that will look nice in the neighborhood, that will add the jobs, stimulate our economy for not only'",
        "'speaker_6': 'that area, but for the city of Denver as a whole and in the interface with our neighbors to the north. So I think overall, this is really a great opportunity for Denver, and I appreciate the role that Dora has played in sort of brokering this between the two counties to help move it forward.'",
        "'speaker_6': 'And I want to thank Councilwoman Monteiro for her role in working with the neighborhoods to make sure their voice was a part of the process throughout every step of the way. So with that. Thank you, Mr. President.'",
        "'speaker_1': 'Councilwoman Canete.'",
        "'speaker_0': 'Thank you. Thank you, Mr. President. I don't know if folks remember, but when we have the urban renewal area come through for this part of the city, during that process, one of the residents of this area said, you know, industrial, you don't need more industrial.'",
        "'speaker_0': 'That's how we got into this spot in this neighborhood. And I think it's such a testament to Councilwoman Montero's leadership and the outreach of EFC that we now have residents excited about the jobs, because I think we've really educated folks about the way that, you know, I always say from my mother's factory, right, that that modern manufacturing'",
        "'speaker_0': 'doesn't have the same environmental impacts if it's well planned and well designed for high quality, you know, high input, low, low output kind of production. So I'm excited about the potential and I'm so pleased and so appreciative of your leadership and the level of community support that we have for this use.'",
        "'speaker_0': 'My one favor to ask is that since this may be our last time to see you for this project before you go out and flourish, is that please hold out for the manufacturing over the warehousing warehouse is great.'",
        "'speaker_0': 'It takes up huge stretches of land. It's important for getting products to market very few jobs per square foot. And so please don't jump at the first tenants if they are, you know, distribution warehouse, please hold out for some of that higher intensity employment if you can, because it would be really great to see the higher end'",
        "'speaker_0': 'of those estimates rather than the lower end. So if that's possible in the market, if it does, it have a real spur. If it did, it would be perfect. We have so many employers who need that, but the great transportation asset access should be an asset even without rail.'",
        "'speaker_0': 'So thank you very much. And I'm very enthusiastically supportive of this district tonight. Thanks.'",
        "'speaker_1': 'Thank you. Councilwoman Canete. See no other comments by members of Council. Madam Secretary, Roll Call.'",
        "'speaker_0': 'Montero by Neville.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Ortega I, Rob Brooks.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'But I can eat lemon lopez.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Mr. President.'",
        "'speaker_1': 'Hi, Madam Secretary. Please close voting and announce the results.'"
    ],
    "Amendment to the Welton Corridor Urban Redevelopment Plan for the 2300 Welton Project.": [
        "'speaker_0': 'Tennis.'",
        "'speaker_1': 'Tonight's Final Two has passed. Our third public hearing tonight is for Council Bill 471. And I want to remind my colleagues at the conclusion of this public hearing will be the opportunity to vote on Council Bill 470, the kind companion bill.'",
        "'speaker_1': 'So please do not bolt out after this last public hearing. So, Councilwoman, can we please put Council Bill for 71 on the floor?'",
        "'speaker_0': 'Thank you, Mr. President. I move that council bill 471 be placed upon final consideration and do pass.'",
        "'speaker_1': 'In has been moved and seconded. The public hearing for Council Bill for 71 is now open. May we have staff report?'",
        "'speaker_0': 'Good evening, Mr. President. Members of council again. My name is Tracy Huggins. I'm the executive director of the Denver Urban Renewal Authority. I know it has been a long day, starting with the mayor state of the city in a long night.'",
        "'speaker_0': 'I would ask that you hang in there with us for another 15 minutes or so while we bring forward a proposed amendment to the Walton Corridor, Urban Redevelopment Plan. And that is why we are here this evening to request your consideration of the amendment to the Walton Corridor Urban Redevelopment Plan to add the 2300 Welton Street Project'",
        "'speaker_0': 'as an approved project and create the 2300 Welton Street property tax increment area. The Walton Carter Urban Redevelopment Area was established in 2012 to encourage redevelopment along the Walton corridor. The urban redevelopment area is comprised of approximately 29 blocks, generally and approximately bounded by Broadway Street on the West Glenarm Place and 24th Avenue on the South Downing'",
        "'speaker_0': 'Street on the east and on the north by either California street or the alley alley between Walton and California streets. At the time the Urban Redevelopment Plan was approved, no projects were identified. However, the plan allowed for future projects to request tax increment assistance and contemplated tax increment areas that would be approved as projects were brought forward'",
        "'speaker_0': 'within the urban redevelopment area. The project, being considered through an amendment to the Urban Redevelopment Plan is the redevelopment of the site located at 2300 Welton Street. The project site, which is primarily vacant, is bounded by Welton Street, Park Avenue, 24th Avenue and Glenarm Place.'",
        "'speaker_0': 'The project is comprised of two separate buildings. The larger of the two structures will span the entire block facing Welton Street between Park Avenue and 24th Avenue and contains 195 units. The smaller building will be situated on the corner of Glenarm Place and Park Avenue and contains 28 units.'",
        "'speaker_0': 'Project amenities will include a central courtyard fitness center, 24 hour secure keycard access, laundry facilities on each floor, bike storage and maintenance, space residents storage and a pet wash area. In total, the two buildings will yield 223 units, with an overall square footage of just over 268,000 square feet.'",
        "'speaker_0': 'The project will have 11 units designated for residents qualifying at 30% of the area, median income or AMI. With the remaining 212 units restricted to residents qualifying at 60% of AMI. The Urban Redevelopment Plan authorizes Derry to finance projects within the urban redevelopment area by the use of tax increment financing.'",
        "'speaker_0': 'The Urban Redevelopment Plan Amendment will add the 2300 Street Welton Street property tax increment area drew. A staff has reviewed the budgets and proforma submitted by the developer and believes there is a financing gap in the project of $769,000.'",
        "'speaker_0': 'This financing gap will be addressed to property tax increment generated by the redevelopment of the property. The site is currently owned by the developer who is paying approximately $69,000 per year in property taxes. This amount will constitute the base taxes from which property tax increment will be calculated.'",
        "'speaker_0': 'The estimated taxable value following redevelopment is anticipated to generate approximately $70,000 per year in net property tax increment. These incremental property tax revenues will be used to reimburse the developer for eligible expenses of the $769,000 over a period not to exceed 25 years.'",
        "'speaker_0': 'The Plan 2000 contains numerous objectives and policies relevant to the redevelopment of the Urban Redevelopment Area, which is designated as an area of change in Blueprint Denver, including conservation of land by promoting infill development within Denver at sites where services and infrastructure are already in place by designing mixed use communities and resident i.'",
        "'speaker_0': 'I'm sorry. By designing mixed use communities and reducing sprawl. And by creating more density at transit nodes. Encourage development of housing that meets the increasing diverse needs of Denver's present and future residents. Encourage quality infill development that is consistent with the character of the surrounding neighborhood, that offers, offers opportunities for increased density and more amenities.'",
        "'speaker_0': 'And that broadens the variety of compatible uses. Encourage mixed use trends aurion development that makes effective use of existing transportation infrastructure supports transit transit stations increases transit patronage, reduces the impact on the environment, and encourage encourages vibrant urban centers and neighborhoods.'",
        "'speaker_0': 'Identify areas in which increased density and new uses are desirable and can be accommodated. Focus incentives and design controls on private development, fronting major new, existing and historic roadway corridors. Continue to support mixed income housing development that includes affordable rental and for purchase housing for lower income, entry level and service employees, especially in downtown and along transit'",
        "'speaker_0': 'lines. Identify and capitalize on opportunities to develop housing along transit lines. Support a variety of housing opportunities for Denver's current and future workforce. And use public private partnerships to facilitate development and redevelopment projects that advance the city's goals and objectives.'",
        "'speaker_0': 'In particular, when appropriate, take advantage of the Urban Renewal Authority's powers and experience. In addition, the proposed project meets the following objectives of the Northeast Downtown Neighborhoods Plan, which has as its primary goal, quote, quite simply, to catalyze development, end quote.'",
        "'speaker_0': 'Those goals include high intensity development near downtown transit stations and along key streets, promote economic and housing diversity, and promote housing density, including structured parking. The general objectives of this urban redevelopment plan are to reduce or eliminate blighted conditions and to stimulate the continued growth and development of the urban redevelopment area.'",
        "'speaker_0': 'The proposed project meets the following objectives of the Weldon Corridor Urban Redevelopment Plan to eliminate the present and growing factors which contribute to the blight in the redevelopment area. Such blighting factors are detrimental to the community and represent an economic liability to the city.'",
        "'speaker_0': 'To renew and improve the character and environment of the urban redevelopment area and its surroundings by preventing or ameliorating economic, physical and environmental deterioration. Encourage residential retail and commercial development and redevelopment that is socially and economically inclusive and from which the urban redevelopment area and its environs can draw economic strength to more effectively use underdeveloped land within'",
        "'speaker_0': 'the urban redevelopment area. Encourage land use patterns within the urban redevelopment area and its environs, which will reduce dependance upon private automobiles for transportation. To encourage land use patterns within the urban redevelopment area and its environs, where pedestrians are safe and welcome to encourage the participation of existing property owners within the urban redevelopment area in the redevelopment'",
        "'speaker_0': 'of their property. Encourage high and moderate density density development where appropriate, including structured parking, and to promote a diverse mix of dense housing options. There are a number of other findings that are required by the Colorado Urban Renewal Law.'",
        "'speaker_0': 'Of the 2300 Welton Street Project is located within the 2300 BLOCK Welton Corridor Urban Redevelopment Area, and will promote the objectives set forth in the Walton Corridor Urban Redevelopment Plan. A feasible method exists for relocation of displaced individuals and families and business concerns.'",
        "'speaker_0': 'The project area contains no residences. Therefore, no individuals or families will be displaced. Additionally, due to the vacancy of this site, no business concerns will be displaced by the project. Written notice of this public hearing has been provided to all property owners, residents and owners of business concerns in the resolution setting this public hearing.'",
        "'speaker_0': 'City Council requested thorough to undertake this task. Written notice was mailed first class mail to all known property owners, residents and owners of business concerns in the Welton Corridor, Urban Redevelopment Area on June 12th, 2013, which is at least 30 days prior to this public hearing.'",
        "'speaker_0': 'The statute requires that no more than 120 days have passed since the first public hearing before City Council on the Plan Amendment. Tonight is the first public hearing before Council on this Urban Redevelopment Plan Amendment. The statute also requires that two years must elapse before council can consider an urban redevelopment plan amendment if they previously failed to'",
        "'speaker_0': 'approve an urban renewal plan amendment for this project. This is the first consideration by City Council of an Urban Redevelopment Plan amendment for this project. Also, the plan amendment contains no property that was included in a previously submitted urban redevelopment plan amendment that was not approved by the City Council.'",
        "'speaker_0': 'As such, the requirement to wait at least 24 months since any prior public hearing is inapplicable. Conformance with the Denver Comprehensive Plan. On June 18th, 2014, the Denver Planning Board unanimously found that the proposed amendment to the Walton Corridor Urban Redevelopment Plan conforms to the Denver Comprehensive Plan and applicable supplements.'",
        "'speaker_0': 'A letter to this effect has been submitted as part of the record of this hearing. Thorough request. The City Council concur with that finding. The Walton Corridor Urban Redevelopment Plan, as amended by the proposed amendment, will afford maximum opportunity consistent with the sound needs of Denver as a whole for the rehabilitation or redevelopment of the Welton Corridor'",
        "'speaker_0': '. Urban Redevelopment Area by Private Enterprise. 2300 Welton LLC, an affiliate of Century Development, is the owner and a private development entity who intends to undertake the redevelopment project. This amendment to the Walton Corridor Urban Redevelopment Plan contains provisions for property tax increment financing.'",
        "'speaker_0': 'Accordingly, Denver Public Schools District One has been permitted to participate in an advisory capacity with respect to the inclusion in the plan of the tax allocation provisions authorized by Section 3120 5107419 of the Colorado Urban Renewal Law. Denver Public Schools has provided a letter of support for the Plan, amendment and the use of tax increment financing.'",
        "'speaker_0': 'A copy of this letter has been submitted as part of the record of this public hearing. Finally, the city and county of Denver can adequately finance and agreements are in place to finance any additional city and county of Denver infrastructure and services required to serve redevelopment within the 2300 Welton Street Urban Redevelopment Area Project area for the'",
        "'speaker_0': 'period during which the incremental property taxes are paid to the authority. The plan allows for cooperative agreements between the city and borough to address additional infrastructure requirements in city services should they arise. In closing, there is very pleased to work with the city and county of Denver to bring forward this project.'",
        "'speaker_0': 'The redevelopment of this site and the delivery of 223 affordable housing units near downtown and along an existing transit corridor captures many city wide goals, objectives and strategies that are found in the Denver Comprehensive Plan, Northeast Downtown Neighborhoods Plan and the Wilton Corridor Urban Redevelopment Plan.'",
        "'speaker_0': 'Projects like this are exactly the type of redevelopment that was intended when this urban redevelopment area was established two years ago. The ability to secure an additional five years of affordability for the 11 units reserved for persons earning not more than 30% of AMR.'",
        "'speaker_0': 'I am I as part of the tax increment financing commitment is another benefit of this project. We asked for your favorable consideration of this amendment, and I will be happy to answer any questions that you may have.'",
        "'speaker_1': 'Thank you, Ms.. Huggins. We have seven speakers for this, and I'm going to go ahead and have all call off them names and please come up to the to your seats and we'll go and order. Mr. SNYDER. Ms..'",
        "'speaker_1': 'Winchester, Mr. Saca, Mr. Miller's Mr. Trekker, Mr. Schlanger and Ms.. Glassmaker so you can come on up to those that are still here, that are still would like to speak to this front pew and we going to start with Mr. Snyder.'",
        "'speaker_1': 'Actually, I think. Mr. Snyder. Okay. Then the next person will be Ms.. Winter. No, no. I know.'",
        "'speaker_2': 'The other, Mr..'",
        "'speaker_8': 'President, and City Council members. I just want to say that I'm here available for questions either from city council or from whomever. We've been working on this development for quite some period of time. And quite honestly, without the help of Durham, we wouldn't be able to get this into the endzone.'",
        "'speaker_8': 'So it's very important for me and for us. So I'll sit down if someone has any questions or someone here would like to ask any.'",
        "'speaker_1': 'Questions, and we'll do the questions after all the speakers. Mr. SNYDER. Thank you. Ms.. Winchester Yeah.'",
        "'speaker_6': 'Mr. President, members of the City Council. My name is Tracy Winchester. I'm the executive director of the Five Points Business District. We are located at 2444 Washington Street in the heart of the historic district of Five Points. On behalf of the Five Points Business District Board of Directors, I'm here in support of this development project and also'",
        "'speaker_6': 'to talk about all of the many hearings and planning meetings that Brant Snyder had last year in coming up to this point in time. We support his efforts to meet with San Rafael, Curtis Park, Enterprise Hill and the Five Points Business District.'",
        "'speaker_6': 'Neighbors Register Neighborhood Associations. Numerous, numerous meetings were held at our neighborhood last summer, and even as recently, Dora had a community meeting on July 1st. We support his efforts to bring affordable housing to the Five Points Business Corridor.'",
        "'speaker_6': 'Our recent revitalization strategy cited affordable housing as a necessary component to attract and maintain the population that is eager to live within our urban neighborhood. Residential developments, such as his will bring new consumers, new revenue streams and activities that will support commercial redevelopment.'",
        "'speaker_6': 'We also are appreciative of the fact that he is working with Mile High United Way because they are about to open up their new building in September of this year. And even last year he met with the president of Mile High United Way to talk about identifying landscape that will look complementary and create this gateway into our'",
        "'speaker_6': 'historic district. So this has been taking a long time coming, and I'm glad we're here at this point. I also wanted to mention a little bit about the fact that last year some of the concerns that the community had was the fact that it was affordable housing.'",
        "'speaker_6': 'A lot of our residents feel that we have enough affordable housing in the area because of our shelters, because of our Section eight housing. And really what we did is we took the time to explain exactly what affordable housing means in this particular instance.'",
        "'speaker_6': 'And what we're talking about is 60% AMI. Well, of course, we had two ends of the spectrum, 60%. AMI was great, but some people thought that was too high. And so it's very nice to know that in this particular project in front of you today, we have at least 5% of the units that are being designated at'",
        "'speaker_6': '30% AMI. So this has really been reflective of what the community has asked for, and I'm very appreciative of that for bringing this to our area. Thank you for your time.'",
        "'speaker_1': 'Thank you, Mr. Sekou.'",
        "'speaker_7': 'James Jacob Black. Social Action Movement. Self-defense advocate. Poor, working, poor and homeless people. You got to be kidding me. For real? I don't see no financial numbers on the screen. When we asked in our community meeting that we had at five points at the gas station.'",
        "'speaker_7': 'What were the numbers in terms of how much per month is the studio going to rent? How much per month is a two bedroom going to rent? How much is a three bedroom? I didn't got the numbers real.'",
        "'speaker_7': 'You don't know what you're going to rent. Come on, yo. And then you tell me about a community outreach. What time did we have the meeting? In the five points. 6:00. During rush hour traffic with the masses of the people can't even get there.'",
        "'speaker_7': 'Come on, y'all. Talk to me. About what? Outreach in rush hour traffic. And you have one.'",
        "'speaker_3': 'Five people there at the meeting out of the entire neighborhood. Five.'",
        "'speaker_7': 'So we go. Now we're talking about living authentically. And stop lying. There was no community meeting at rush hour traffic. Now you kill me online. Tell me. I'm like like there ain't no community meeting here.'",
        "'speaker_3': 'At 530 doing rush hour traffic. Tell me I'm lying.'",
        "'speaker_7': 'And it's institutionalized. Hate is okay. Yo! Woo woo! You satisfied the letter of the law? Really? Come on, give me a break with this and then ask the developer, how much money are you putting in to this cash compared to the $43 million you got in loans and this and that from this agency and that agency.'",
        "'speaker_7': 'And then what happens? The city council, we get all leverage in on this thing. It goes under he turns it into a syndicate and then run it off on taxes for the next 30, 40 years if it don't work.'",
        "'speaker_7': 'But does he lose his land? Do we get the land if there's don't work? So let's look at the details of this thing, because that's what happens to us. We get caught up in these kind of real estate deals where we're all in and a little bit out and then it goes under and then you have to'",
        "'speaker_7': 'renegotiate the loan. Otherwise, you look absolutely ridiculous spending the taxpayers money. And then who's going to pay for this? The people who run it, that's the taxpayer. So now he's going to pay interest loans and all the rest of that money that's given to him.'",
        "'speaker_7': 'The building.'",
        "'speaker_1': 'Is there. Thank you. Your time is up. Are you kidding me? Thank you for your. Thank you for your comments. David Miller's. Good evening.'",
        "'speaker_2': 'Y'all are troopers. It's late. My name is David Millis. I live at 426 24th Street in five points. And I appreciate the opportunity. Thank you. Ladies and gentlemen, Mr. President, for letting me speak briefly. I'm going to reduce my points to a very short amount of time in the interest of keeping y'all awake.'",
        "'speaker_2': 'My concerns with the project really boil down to a couple of things. One is we've talked about a diversity of housing needs, which is which is true. 223 units of affordable units in one place is a lot. As was pointed out, I live about a block from the from the project site.'",
        "'speaker_2': 'I've got various a variety of low income units all around. We have a lot of submarket housing units in our area. I understand the need, but in this case I would actually suggest a higher diversity of of housing would be useful.'",
        "'speaker_2': 'I mean, a mix of both market and affordable would be helpful for this quarter. The other thing I really wanted to mention is the size, the size of the project. The structure itself is a five story, a couple of structures, five stories tall, which dwarfs everything else in the area.'",
        "'speaker_2': 'This particular area, the the what we think of as the historic Welton district, the Wealth Street District, there is nothing higher than three stories. Most of the buildings in our neighborhood are one, two and three stories tall, including the new library that we really like.'",
        "'speaker_2': 'Right. So the library fits in nicely with the character of the neighborhood itself. This picture building, again, architecturally, it's just too tall. It doesn't really architecture doesn't try to, I don't know, respect or fit in or make any nods to the historical nature of the of the block itself, of the of the neighborhood, the Welton Quarter itself'",
        "'speaker_2': 'in this case. And I'm going to paraphrase another Mayor.'",
        "'speaker_1': 'Hickenlooper.'",
        "'speaker_2': 'Who pointed out, you can't create historic. So once we kind of build all sorts of other stuff around and ruin the characteristic of the neighborhood, it's gone. So I, I understand the need for the to redevelop. And, in fact, I'm excited about the redeveloping the neighborhood.'",
        "'speaker_2': 'I'm excited about five points being redeveloped. I love my neighborhood. I understand the need for affordable housing. I just asked to be careful before we right here at the entrance to this wonderful historic Welton corridor, for we put something that is maybe architecturally could be a little better, could show a little more honor, a little more respect'",
        "'speaker_2': 'for the corridor itself. Thank you for your time.'",
        "'speaker_1': 'Thank you, Mr. Miller. Matthew. And I apologize if I may speak this trucker. TR It's written to RC okay, so guys left and he has left. All right. Next we have Schneider, Tim Slinger, who's left as well, and then our last speaker, Ms..'",
        "'speaker_1': 'Glass Glassmaker.'",
        "'speaker_6': 'Again. I'm Sue Glass Maker. I'm here representing Curtis Park Neighbors, a registered neighborhood organization. It's really surprising to hear some of this because we have quite a different view at Curtis Park Neighbors, our some of our neighbors worked on the development of the urban redevelopment area and back three years ago, and we were involved in that.'",
        "'speaker_6': 'We were updated on that. We knew what was going on and we wanted that to go on because it's about time for well to get developed. It's overdue, way overdue. And that's part of our neighborhood. And so we don't have that.'",
        "'speaker_6': 'We support it as a neighborhood organization. We supported the creation of this district unanimously. We also were involved. We were invited in to be part of the design process, and we did have a lot of influence and say on this design.'",
        "'speaker_6': 'Now the design you see here tonight doesn't do what the final was going to look like, doesn't do justice to it. But this is not part of the historic area. It is part of the commercial area, but not the historic area.'",
        "'speaker_6': 'So it can go up. This is zoning here can go up much higher than the four stories that it's slated to. We were delighted with having four stories. We think that's very acceptable across the street. The neighborhood spearheaded by John Haden and Keith Prior Reed we did got the park across the street, sunny Gotham Park, which was'",
        "'speaker_6': 'a problem park got it redeveloped and it's doing beautifully right now. And we want to keep it that way until this project is built. And it was designed with we designed with this project in mind to attract the residents over to that park and keep it safe for everybody.'",
        "'speaker_6': 'Now to the question of affordable housing. It's always a powder keg because we do have a lot of affordable and low income housing in the area. However, it always has. We believe that it has to be balanced off.'",
        "'speaker_6': 'And you can you need mixed income and a block away from this development is another development in the on the books it's coming to pretty soon and it has 100 market rate units. And right across the street on park are another 30 units going in right now.'",
        "'speaker_6': 'So this is how you make mixed income. Mixed income neighborhoods. You balance it off. It has to be balanced. And we have no problem with affordable housing here.'",
        "'speaker_1': '3 minutes is all right.'",
        "'speaker_6': 'So Curtis Park neighbors definitely supports this.'",
        "'speaker_1': 'Thank you. And thank you to all of you speakers for your patience. We are now moving on to questions from members of the council, and I'm starting with Councilman Brooks.'",
        "'speaker_2': 'Thank you, Mr. President. I just want to bring up Brett Snyder for just a second. And Brant, to the question of the 60%. Am I. Do you do you know the rents for your particular units for the 221, 223 212 60%.'",
        "'speaker_2': 'And my units in the 11:30 a.m. I.'",
        "'speaker_8': 'I believe that are because I when I I usually have to carry the list with me because I'm so focused on other items. But I think with our price.'",
        "'speaker_2': 'He has it right there. Thank you, Mr. Gibson. Switching agencies right there. Thank you, Chris.'",
        "'speaker_8': 'Okay. For our at 60%, our one bedrooms are 806 are no. Our studios are $806 a month. Our one bedrooms are 921. Our two bedrooms are 1000. 37 are now I'm sorry, our thousand 37 are the three bedrooms.'",
        "'speaker_8': 'And at 30%, they start at 400, $403 for a studio, $461 for a one bedroom and 518 for a three bedroom.'",
        "'speaker_2': 'And the deed restriction of the property, it depends also on how many.'",
        "'speaker_8': 'Heads you have. One is 20 plus years.'",
        "'speaker_2': '20 plus years. But if there is a single, single mom with two kids like. It depends. Right. It rests down. That's correct. Can you. LSD, what you would have to make for some of these units?'",
        "'speaker_8': 'Well, generally, just broadly speaking, we're around 30 to $35000, if you want.'",
        "'speaker_2': 'Okay. Yeah. Tracy. Yeah.'",
        "'speaker_0': 'It's always difficult when you when you hand someone else your. Your own spreadsheet. So. So, Councilman Brooks, if I if I'm understanding your your question correctly, you want to understand what basically 30%. And so for different family sizes.'",
        "'speaker_2': 'Yeah, so we got the rents. So now that we understand that, so the community can understand that. So the number the individual what they have to make.'",
        "'speaker_0': 'So a single person to qualify at the 30% AMI can't make more than $16,110 a year. Family size of two is $18,420. Family size of three is $20,730, and a family size of four is $20,010. Comparatively, at the 60% AMI level one, a single person at 60% AMI can earn no more than $32,220.'",
        "'speaker_0': 'A two person family $36,840. Three people 41,000 for 60 and for people $46,020.'",
        "'speaker_2': 'Perfect. Thank you. And Brant, let me just ask you one more question. Did you get any letters of support from I know you met with San Rafael, the Hospital Design Forum. Many of those folks were supportive. I'm just wondering if they wrote your letter support.'",
        "'speaker_8': 'We have one from the Hospital Design Forum and also from Curtis Park neighbors.'",
        "'speaker_2': 'Okay, great. Four and five points. All right. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks, Councilman Lopez.'",
        "'speaker_2': 'Thank you, Mr. President. I do have one question, and it really speaks to the breakdown of the units and how many you have terms of the bedrooms. Is one unit or was each unit is either a one bedroom, two bedroom or three bedroom, correct?'",
        "'speaker_8': 'That's correct.'",
        "'speaker_2': 'How many units do you have breaking down? I know, I know. I've asked this question before and I don't have it in front of me, but I'm just I'm just wondering percentage wise or just the raw numbers, how many units do you have that right?'",
        "'speaker_8': 'Well, we have 22 studios. We have 109 one bedrooms.'",
        "'speaker_2': 'We have added.'",
        "'speaker_8': 'Two bedrooms and we have four.'",
        "'speaker_2': 'Three bedrooms. And if I may ask you, what was the reason? And, you know, my concern here and what the question doesn't seem to be marketed towards families. I mean, it's with that many three bedrooms, you only have three bedrooms compared to 109 plus 22 single families that maybe just two people, maybe three pushing it.'",
        "'speaker_2': 'So when you compare three to the 109 plus 22 and then you have 82 bedrooms, what was the purpose for creating that many? Either 109 or 22 studio and one bedroom units as opposed to more. Right. So why it so heavy on that on that one bed, one in one bedroom, the studio side?'",
        "'speaker_8': 'Well, because, quite honestly, the majority of our tenants are single and they're starting out in their working careers working downtown. And they're not in the family formation stage yet.'",
        "'speaker_2': 'Do we? I mean, so it was geared towards those numbers. Do you have that kind of data?'",
        "'speaker_8': 'Well, I'm scared. We have at Broadway Plaza, we have 223 units where I currently office. And when we did that, we had a majority. It was more lean towards one bedrooms over the course of a mature maturing on that property.'",
        "'speaker_8': 'Now we we have a waiting list for two bedrooms. So we expanded the number of two bedrooms that we were going to have. But we also went ahead and decided we would go ahead and have some three bedroom units as well.'",
        "'speaker_8': 'But we don't typically I right now I don't know the number of children we have in our building, but I very seldom see them because the closer you get to the central business district, quite honestly, the fewer you see because of the infrastructure where you have to go to schools and things like that.'",
        "'speaker_8': 'And right after I got married, I lived downtown at the Windsor, the Windsor Gardens, and we were there about nine months and we were already thinking about children. And my wife said, no, and we love downtown, but she said, No, I like to have a yard and and trees and things like that.'",
        "'speaker_8': 'So it's a little bit different lifestyle when you're the closer you get to the downtown area, it's it's challenging.'",
        "'speaker_2': 'We're still talking about five points and five points. Is a lot of families correct?'",
        "'speaker_8': 'Yes, I do.'",
        "'speaker_2': 'And I'm just I'm just wondering why it was geared towards, you know, the pushes for the studio and the one bedroom. And you look at the need in our city. There's a lot of families that do not have.'",
        "'speaker_2': 'Units to rent. I mean, it's sparse. And when we look at building affordable housing, I mean, I don't know when you sat down to look at that. I miss. I'm just puzzled why when we're using the tax credits and building affordable housing, that we're not taking that into account.'",
        "'speaker_2': 'And I really wish that when we develop this kind of housing, are we looking at the whole picture and really look at the need to meet that need? It's you know, I think there's discussions of a affordable. I mean, there's plans to build a very similar affordable housing project and the number of three bedrooms and this is'",
        "'speaker_2': 'in district three off Alameda and Irving and a number of three bedroom units is a dramatic increase from this. It's a stark difference. And the more I you know, I think we have a school in downtown, I think and it's not downtown.'",
        "'speaker_2': 'It's five points in five points. We have schools of children. We have Mestizo Curtis Park Pool. It's very family friendly is where people move to raise families as well, too. I'm just I'm just wondering what what got those numbers there?'",
        "'speaker_2': 'Why is it why didn't we meet that need, if that's a definite need? So I appreciate I appreciate your answer.'",
        "'speaker_1': 'So thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_6': 'I just have a quick question for you, Mr. Snyder, about the number of parking spaces that you're planning to provide for the two structures, or is the parking different for this smaller building than it is for the large building, or is it all being treated as one property, one project?'",
        "'speaker_8': 'Well, it's all being treated as one one development, and all the parking is underneath the large building. And for 223 units, we have 207 parking spaces.'",
        "'speaker_6': 'Okay. And I'm trying to remember what bus service is in the area, is there? I can't remember. Are there busses, Tracy, that run along Park Avenue?'",
        "'speaker_1': 'Seriously. If you had one, can you come up to the microphone, please?'",
        "'speaker_6': 'I have to admit, Councilwoman Ortega, that I'm not familiar with Park Avenue, the bus line that runs along there. But I know that we do have transfers over at 30th and Downing that you can grab the bus there.'",
        "'speaker_6': 'But I'm not familiar enough with the bus lines on Park Avenue West.'",
        "'speaker_1': 'Councilwoman Ortega, I think Councilman Brooks has an answer for you. Yeah.'",
        "'speaker_2': 'And I think I think David might know the exact bus line, but obviously this is right on the light. Right? Right, right. Light rail line. That goes right to the main kind of bus terminal for all of five points at 30th and Downing.'",
        "'speaker_2': 'And that's where most a majority of the individuals in neighborhood pick up. But. Okay.'",
        "'speaker_6': 'Great. Thank you.'",
        "'speaker_1': 'That was a council meeting. Just like any other questions from members of council. Seen the public hearing for 471 is now closed. We are moving to our comments and we're starting with Councilman Brooks.'",
        "'speaker_2': 'Thank you, Mr. President. 2012 September. Many of my colleagues may remember you may not remember we were setting up our urban renewal area for Welton, and this was the vision of it, that we would have diverse opportunities for housing, that we'd have some entertainment opportunities, that we would get redevelopment opportunities on.'",
        "'speaker_2': 'Welton And this project is the first to come through. And so I'm really excited about that. It's a it's been a labor of love. Brant, thank you for for working so hard on this and Tracy for working so hard.'",
        "'speaker_2': 'There's already has been involved in this. Tracy Winchester from Five Points Business District has been incredible on this. You know, there's a lot of concerns. I mean, I had the questions like, why has development been so tough in five points?'",
        "'speaker_2': 'And I think as you all are starting to hear some of these public hearings, you're starting to see some of the some of the conflict. There's a there's a portion of the population that feels like we shouldn't have any more affordable housing.'",
        "'speaker_2': 'As David began to share sentiments. And there's some data that shows that of our rental units in five points, 30% of it is all the restricted and affordable. But what if you look into that a little bit deeper, you understand that some of those deed restricted units and and land is starting to come up in the next'",
        "'speaker_2': '5 to 10 years and it will be market rate units in housing. So we're trying to keep a balance of this gentrified movement that's come into this area at a very, very quick clip. Speed and housing prices that are going up very high in the Curtis Park neighborhood in San Rafael in the Enterprise Hill neighborhood, and saying'",
        "'speaker_2': 'what does the balance look like for affordability to all? So it's been a tough balance, but we're trying to strike it. Right. I think someone mentioned the next development that you all see at 25th in Walton will be a market rate project, which is a beautiful project, five storeys, but will have all market market rate housing, which'",
        "'speaker_2': 'at a at a 95% AMI type of level or 90. We'll see when the numbers come in when just ten blocks down the road, all of the rental units are at about 115%. Ami. So I feel like we're we're trying to get it get it right.'",
        "'speaker_2': 'And it's been a struggle. But I think folks need to know that we're not trying to rush got run roughshod all over the market and and throw this housing anywhere but we're trying to make sure that we were getting the housing where people really need it, too.'",
        "'speaker_2': 'Councilman Lopez, this point of the the three units, I think it's a good one. I think it's important to to remind folks that, you know, 50 almost 50% of the units are two bedroom. And I'm glad that we got to that place.'",
        "'speaker_2': 'Obviously, a piece of what Brian's trying to do is serve the market where he currently is. But I think there's there's there's a question about land and space at the Park Hill units that we just approved. We have a number of three bedroom units in District eight, but they had quite a bit more land to work with'",
        "'speaker_2': '. And so it's all of these things. And Councilman Lopez, I would assume that you have a little bit more land where you are and the footprint isn't quite as tight as we were working on this project. Brant had the opportunity to go up to eight storeys, but because of cost and because of construction, he could only go'",
        "'speaker_2': 'up to five. And so there's some there's some things to consider here. But your point is a good one is well taken and it's something that we're definitely looking at. One more thing I want to point out, to Brent's credit and Sue Glass Maker is the design of the building.'",
        "'speaker_2': 'Anyone knows that if they're doing a development in Curtis Park, they are about to get schooled on landmarking, on design, on architecture, and Brant and Curtis Park and Sue and Joe Noble all really worked on this design and went through many, many iterations and they came out with a beautiful design that I really think is going.'",
        "'speaker_2': 'To be great on five points. And if you think about 2013, Walton, you look across the street and you see about $200,000 of improvements. And Sunny lost some part the baseball field and also a new playground and workout facility that's over there by Blair Caldwell.'",
        "'speaker_2': 'And you look across the street and you see one of the premiere nonprofits in In the City. It's really exciting to see that whole block come alive. And all of that was due to OED, Dora and all of these partnerships coming together.'",
        "'speaker_2': 'So in the next couple of years, you're really going to see a lot of exciting things. And I will also tell counsel and and folks out in the public that this is not the last TIFF application, that there are other folks who have come to the table.'",
        "'speaker_2': 'And hopefully in the next year, year and a half, you will see a number of of projects within one mile radius of of this project are now on water. I hope that my colleagues will support this long and arduous part process and partnership.'",
        "'speaker_2': 'It's been a good one.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilman Lopez.'",
        "'speaker_2': 'Thank you, Mr. President. I wanted to thank you for for working in this area to make sure that there is a good stock of affordable housing. The problem in this city is, as it's success, as we grow as a city, as we become more economically viable and stronger and always bring more business to Denver, more people want'",
        "'speaker_2': 'to come here, more people want to be a part of it, and that's a good thing. And sometimes it can be a force and it can be a negative thing. And I always say that in this context, because there are a lot of people in this city that have always called Denver home and have called this neighborhood'",
        "'speaker_2': 'our neighborhoods in the West Side and North Denver home that can now no longer be able to afford not even a single one bedroom apartment, let alone a home. And that although some people may say it's good for business, it's a strong market.'",
        "'speaker_2': 'It's bad at our core. It doesn't take that into account and we had to balance that. And the only way we balance that is in we have a hand in the matter. We have we have already and we have the tools available for us to be able to help balance.'",
        "'speaker_2': 'I'm a city councilman now, but you go back a good 30 years ago, I'd even say 20 years ago, and I shared a two bedroom duplex in my family of six with three younger sisters and my parents. And that's just about as good as a guy in Barnum.'",
        "'speaker_2': 'In Westwood, in Valverde of almost every single neighborhood that I represent, excluding Sun Valley. We've never had more than that many bedrooms as far as I can remember. I think at one point I slept in a tent in my grandmother's backyard because it was just too darn expensive and because everybody who wanted a three bedroom place were'",
        "'speaker_2': 'jumping all over each other for it. The demand was big then. I assume with a lot of folks who have lost their homes in the recession. A lot of families. Whose parents were either out of work or coming back into it, back into the market, or trying to stay in their neighborhoods.'",
        "'speaker_2': 'That is the case still in, Councilman Brooks, in this area. And in five points. It's it's so diverse. Not just. Demographically speaking ethnicity but also sizes of families. Income gaps. Right in one area, you have very expensive homes.'",
        "'speaker_2': 'Summary You have projects. Right. So the population is there. All you got to do is go to the pool at Mestizo Curtis Park and you see these wonderful, beautiful kids. I call this neighborhood at home. Same goes in my Alma and Lincoln Park.'",
        "'speaker_2': 'Same goes in Villa Park or in the North Side. Right. As a city, we have to plan better. And we have to encourage development that has not just one bedroom or studio for our kids that are in college or singles still.'",
        "'speaker_2': 'You know, they're either poor in coffee or working at a bar late at night or, you know, doing side jobs here or there or doing all three right, trying to put themselves in school. But families families that make part of the create this the soul of Denver.'",
        "'speaker_2': 'Right. And it's not just about, you know, the creative class downtown. In Highlands for some of these areas in West Colfax. What about those families? Right. I call Denver home. We have to be able to create enough units.'",
        "'speaker_2': 'Three better, two better and above. For them to be able to call Denver home and keep this truly affordable and truly guided, to take all of those families who are in a Samaritan House and other areas. A lot of families are homeless.'",
        "'speaker_2': 'A lot of women and children, many children, families who are homeless because they cannot find anything else right in their squeeze out of that market. So I'm advocating for making sure that we do have that stock built. We're encouraging our developers that we're using our dollars that we're delivering away from the schools in the best interest of'",
        "'speaker_2': 'some of those kids. Right. And so I'm absolutely in support of this because it fills that gap that we need. But I want to really encourage my point. So thank you. I appreciate the time.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Seen no other comments? We will vote on 471 and then remind my council members we will be voting on the companion bill 470 right after that. So 471 Madam Secretary, Roger Brooks.'",
        "'speaker_0': 'I fox i Herndon sorry can each by Laman.'",
        "'speaker_6': 'Lopez.'",
        "'speaker_0': 'All right. Montero, I never i. Ortega, i. Rob I. Mr. President. Hi.'"
    ],
    "Cooperation Agreement for the 2300 Welton Project with the Denver Urban Renewal Authority.": [
        "'speaker_1': 'Madam Secretary. Please, both of you announced results tonight. Tonight for 71 has passed and now for the. Are there any comments on the companion bill council bill 470. Approving the cooperation agreement for the 2301 property tax increment area.'",
        "'speaker_0': 'Mr. President, I think you want me to put it on the floor.'",
        "'speaker_1': 'Okay. Candidate Yeah. Sorry about that, councilman. To be pleased with 47470 on the floor.'",
        "'speaker_0': 'Yes, Mr. President, I move that 471 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Has been moved in second. Now do we have any comments on 470? The scene on Madam Secretary, roll call.'",
        "'speaker_0': 'Brooks I futz i Herndon I can eat lemon. Lopez All right, Montero. Nevitt Hi.'",
        "'speaker_6': 'Ortega Hi.'",
        "'speaker_0': 'Mr. President.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Rob. Hi.'",
        "'speaker_1': 'Madam Secretary. Please call the voting and announce the results tonight. Tonight, 470 has been placed upon final consideration and does pass. Seen no other business before this body. This meeting is adjourned. Telephone.'"
    ]
}