{
    "Contract Approval for Environmental Planning Services at Denver International Airport.": [
        "'speaker_0': 'All right, Councilman Flynn, consideration of resolutions 957 and 958 will be postponed for one week to Monday, October 14th. No formal motion or vote is required under that rule. Madam Secretary, please, for the next item on our screens.'",
        "'speaker_0': 'Councilman Sawyer, would you go ahead with your questions?'",
        "'speaker_2': 'Thank you, Mr. President. And is someone from the airport? Angela, can you come and just answer a couple of questions? I had called this out last week for some questions, and unfortunately, the airport wasn't able to make it because it was very last minute.'",
        "'speaker_2': 'My apologies on that. Thanks for being here today. Thank you. So I just had a couple of questions. This is an environmental services on call contract, and it just was worded kind of broadly. My questions were sort of in the examples of expected tasks under.'",
        "'speaker_2': 'To work consists of researching, preparing documentation for airport development projects and then g preparing affected environmental and environmental consequences. Analysis for 16 energy supply and Natural Resources. Can you just explain to me a little bit about exactly what that means or what that is?'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'Angelica CSM with Denver International Airport.'",
        "'speaker_2': 'And I'm here to answer these questions tonight.'",
        "'speaker_1': 'So basically, this contract is a.'",
        "'speaker_2': 'Consulting contract that sits with our sustainability division. And so these are contracts that when.'",
        "'speaker_1': 'You develop solar or different.'",
        "'speaker_2': 'Projects at the airport, these are the people who are going to analyze the environmental impacts of those of that development.'",
        "'speaker_1': 'So with solar, you're always required to do a NEPA process.'",
        "'speaker_2': 'And so basically this just keeps us in line with and in compliance with that, with that requirement. And so when you're considering natural resources use, when you're putting like a solar farm or something in on airport property, then basically what this does is it analyzes what the impacts to the environment would be like.'",
        "'speaker_2': 'If there's a wetland that's protected by, you know, federally protected, how would it impact that or those types of things? Okay, great. Thank you. And so we're in the contract. Does it say kind of the specific scope? Is that all under appendix A?'",
        "'speaker_2': 'I believe so, yes. And then is there a specific place where we would be able to see in these contracts what exactly where exactly we would know that it was specific to the sustainability project as opposed to some other kind of project?'",
        "'speaker_2': 'Well, there is there is a line and after we talked, I found it it's on the ordinance request that says where the funds are coming from. Okay. And so there is a line on page two of the ordinance request that gives that information.'",
        "'speaker_1': 'So this one specifically comes from CERP.'",
        "'speaker_2': 'Funding and operations and maintenance funding. So that's that is a line item in there. I don't know.'",
        "'speaker_1': 'How we would distinguish it.'",
        "'speaker_2': 'Necessarily, other than if I explicitly called it out in an in an ordinance request to kind of say this is for sustainability projects only or something like that. Okay. Is there have we ever gone outside of the scope of a contract previously or is there is has that ever happened previously?'",
        "'speaker_2': 'No. No. So, I mean, you know, every division has its own set of money and funding. And so we use we usually align that pretty closely with the funding that's available and the needs of the division.'",
        "'speaker_1': 'So we would rarely kind of.'",
        "'speaker_2': 'Move move money between divisions. And so if it is specific, the source of funds is specific to this contract, we can look to that source of funds and that's how we would know which division of the airport this was, this particular service.'",
        "'speaker_2': 'Yes, yes. Okay, great. And so these specific services in this on call contract are in no way related to oil and gas. No, no, they are not related to oil and gas. So this is actually the type of contractor who would actually expose the impacts of any sort of building or other other types of development at the'",
        "'speaker_2': 'airport. Okay, great. Thank you very much. No, no more questions. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Toia. All right. That concludes the items to be called out this evening. All bills for introduction are ordered published. We are now ready for the block vote on resolutions and bills on final consideration. Council members, please remember that this is a consent or block vote and you will need to vote.'"
    ],
    "Zoning Change for 3141 Raleigh Street to Allow Accessory Dwelling Unit.": [
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilwoman Gilmore, will you please put Council Bill 817 on the floor?'",
        "'speaker_2': 'Yes, President Clarke, I move that council bill 19 dash 0817 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you, Councilwoman. My screen has gone dark. Can I get a second? Thank you. It has been moved and seconded. The required public hearing for Council Bill 817 is open. May we have the staff report?'",
        "'speaker_6': 'Good evening, Teresa Lucero with community planning and development. This is a rezoning at 3141 Raleigh Street. The proposal is to rezone from urban single unit to urban single unit, allowing an accessory dwelling unit. So the application is located in City Council District one in the West Highland neighborhood.'",
        "'speaker_6': 'It is within an urban context, and that contest text is intended to promote and protect residential neighborhoods, does allow an urban house and accessory dwelling unit with a maximum height of 30 to 35 feet on a 3000 square foot zone lot minimum zoned lot.'",
        "'speaker_6': 'So existing zoning is useful on all four sides and the property itself, existing land use in the area, a few multi units, some two units and a lot of single unit residential. This these pictures give you an idea of the surrounding properties, most of them 1 to 2 stories and height.'",
        "'speaker_6': 'Top Left is a condo project across the alley from the subject site where there are five units. Otherwise, there are all single unit homes. So the process this started in May of 2019 when we noticed a complete application and we were at planning board in July.'",
        "'speaker_6': 'They recommended unanimously that we approve this and we were at Moody in August, and here we are for the public hearing that has been properly noticed. There are no letters from our registered neighborhood organizations and there are no other comment letters received on this application.'",
        "'speaker_6': 'So you know, the criteria, the plans that apply are plan 2040. Blueprint Denver 2019 and Housing and Inclusive Denver. Current plan 2000 2040 several. Several recommendations that are detailed in your staff report supporting this application. Blueprint Denver This is an urban context and blueprint Denver one and two unit residential with embedded small unit and commercial in the'",
        "'speaker_6': 'residential areas and a regular grid pattern of streets. Future place is low residential, which is single and two unit residential, up to two and a half storeys in height. Street types are. Raleigh is an undesignated local street. 32nd Avenue is a residential collector.'",
        "'speaker_6': 'Growth area strategy is all other areas of the city, which is anticipated to see 20% of all the new housing growth and 10% of new employment by 2040. And then housing an inclusive Denver speaks to including in our regulations and in through blueprint, in including expanding our housing choices to allow accessory dwelling units and promoting, in fact'",
        "'speaker_6': ', accessory dwelling units. So staff believes that this application is consistent with the adopted plans. By using a standard zoned district, we are furthering the uniform application of. Arizona districts by implementing our plans. And we're. That with development that's consistent with our the character of our neighborhoods that we're implementing, the public health, safety and welfare and justifying circumstances'",
        "'speaker_6': 'is the change. The change has been the adoption of New Blueprint that supports the development of accessory dwelling units citywide. We did talk a little bit about the urban context, and staff believes this is consistent with that context and with the purpose and intent statements of promoting and protecting our residential neighborhoods.'",
        "'speaker_6': 'So staff believes this is consistent with all of our criteria and recommends approval.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening. First up is Richard Kerr.'",
        "'speaker_7': 'Hello. I'm Richard Kerr. I'm the homeowner at 3141 North Raleigh. If you have any questions and I'd like to answer them.'",
        "'speaker_0': 'Thank you very much. We will save questions for a different part, but thank you very much. Okay. Next up, Jesse Pierce.'",
        "'speaker_10': 'Even now. Members of council, it's good to see you again. I just came from vacation. I was there. So I'm just. It was shot in Paris. I'm represented for Denver Homicide. Low black star action moment for self-defense. Positive action.'",
        "'speaker_10': 'Come in for social change. And you YPO, which is African. People's Organization. We just started a chapter about three months ago, so I am also an At-Large candidate for 2019. Election was on top of the ballot. The almost 15,000 votes with no money.'",
        "'speaker_10': 'And I will be running again in 2023. So where I stand on this is what is the AMA level going to be for this proposed rezoning in the Highlands, in the north side that has been rapidly gentrified? And who is going to occupy this space?'",
        "'speaker_10': 'Because, like I just alluded, it has become white affluence right before our very eyes. I used to live in a in a diverse city where you could see multiple colors of people living in a neighborhood. That is not happening.'",
        "'speaker_10': 'Or my people were being displaced, gentrified, moved out. Ethnic cleansing out of our communities. And we're not going to stand for this any longer. So it will continue to put candidates run candidates for office so that that can be ushered in.'",
        "'speaker_10': 'So someone could please answer my questions are greatly appreciated. And thank you all for coming out tonight.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_3': 'Okay, guys, start. Good evening, ladies and gentlemen. And. My name is Chairman Sekou. Unbound, an organizer of the Black Star Action Movement. And. Press release came out today. I'm a 2020 candidate for the United States Senate. Yeah. It was very important that I come to know because you guys won't see me as much.'",
        "'speaker_0': 'Mr. Speaker, if you could stay to the agenda item, please.'",
        "'speaker_3': 'I'm getting there. I'm getting. I'm just trying to catch my breath. I'll just go to the hospital. So here we go. This has already been said. I know it. You know it. I wouldn't be surprised. On the 13th, the vote, at worst, maybe one.'",
        "'speaker_3': 'Or as Tekken Princess. And if we stand on principle. We've always had this conversation before. And so I support it because it's a done deal. And this dog and pony show needs to stop because the decision already was made in subcommittee.'",
        "'speaker_3': 'Yeah. And you know what? I know it. And this is too little, too late because there's nothing. Nobody's going to say. It's going to change your mind. You're already committed. And so for the people that are watching Martin Luther King in 1957 doing the bus boycott in Montgomery, that was consistent with 373 days that stop that segregation'",
        "'speaker_3': 'of the bus to put us on the back seat with Rosa Park. He said, look, you show me a man and woman who's not committed. Do anything. That they're willing to die for. They are not fit to live.'",
        "'speaker_3': 'Martin Luther King, 1957, inscribed a city park at his memorial. Yeah. Well, that one live by that one. So what are you willing to die for? For poor people. What? Nothing. Because you committed to your lifestyle and you're stuck on stupid, just capitalism.'",
        "'speaker_3': 'You couldn't quit if you had to. You're like a bunch of crackheads who come here and.'",
        "'speaker_0': 'You could please stay to the agenda item. Thank you. All right. That concludes our speakers this evening. Are there questions for members of council? Councilman Sawyer.'",
        "'speaker_2': 'Thank you, Mr. President. I was just a little bit curious, maybe for the homeowner about what sort of community outreach you did. It's pretty rare that we don't get any sort of comments or from any registered neighborhood organizations or neighbors at all.'",
        "'speaker_2': 'So I'm just curious.'",
        "'speaker_7': 'I went I went and met with all my neighbors. No one objected. So and I, I had a signed petition, but I didn't bring it. I also joined the neighborhood organization. Then they did not respond, I guess. But they did.'",
        "'speaker_7': 'They they did resist or one person on that on the neighborhood organization opposed. But it wasn't representative of the neighborhood. So that's why you have no letter from the neighborhood organization. But I did. I was actively involved. My neighbors, I consulted the R.A. and and it's been a long process.'",
        "'speaker_7': 'I know I submitted the application in May, but it was a year before I was reaching out to people in my neighborhood.'",
        "'speaker_2': 'Thank you very much. No, no more questions.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Flynn.'",
        "'speaker_8': 'Hey, Mr. President. Mr. Kerr, could you tell me you are seeking this change so you can add an accessory dwelling unit? And is this a garage conversion? There's a garage on the back of the property.'",
        "'speaker_7': 'Currently, there's a one car garage built in 1925. It does it right. Modern car.'",
        "'speaker_8': 'Right. And so will this be in place of the garage or are you keeping the garage and putting the adu elsewhere on the.'",
        "'speaker_7': 'On the lot? It will replace the garage. Okay.'",
        "'speaker_8': 'Okay. Thank you, class Teresa. Question. This lot is 6350 square feet. What are the what are the coverage and what limitations on one footprint on. On a lot of that size. How large would need to you could be.'",
        "'speaker_6': 'Built or maybe Kyle do you know that I thought it was 600 square feet. But don't don't quote me on that. But I believe it's 600 square feet.'",
        "'speaker_8': '600? Mm hmm. Okay. Mr. Kirk, could you come to my.'",
        "'speaker_7': 'Minus my understanding from my architect. The footprint can be 864 square feet.'",
        "'speaker_8': 'Okay. That's after. Because the garage will be the.'",
        "'speaker_7': 'Garage and the garage footprint will be 864 and the upstairs will be 75% of that.'",
        "'speaker_8': 'I see. Okay. I get it. All right. Thank you, Mr. President. It's. I needed.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. For the homeowner, if I might. Thank you. And I apologize. I didn't get your name.'",
        "'speaker_5': 'Rick or.'",
        "'speaker_7': 'Richard.'",
        "'speaker_4': 'You've said it, but I. Anyway, I'm not good at retaining it anyway. So you started this process over a year ago, is it? And you'd submitted the application in May. Right. What might you do if if this wasn't approved?'",
        "'speaker_4': 'Would you I mean, are there other options that you would consider? Would you consider scrapping or would you? I mean, this is just a no.'",
        "'speaker_7': 'I'm just when I bought the property in 97. It was zoned out too. And I thought of it when at that time we had one child, brand new child, and I thought, that's great. There's a future here beyond our raising our family.'",
        "'speaker_7': 'And then it was resolved where that evaporated and became a single family again. And I was too busy to protest at the time because I had two young children. But now we're at a different my children are gone and we're at a different place.'",
        "'speaker_7': 'And so I'm here to get back to where I was. And I have a vision for this property. And what would I do if denied? Nothing tomorrow. Nothing, not nothing rash. But ultimately, we would probably sell.'",
        "'speaker_4': 'And what is your how much time do you think you've invested? And maybe if you're willing to disclose how much has been your financial commitment for this rezoning process?'",
        "'speaker_7': 'Plenty of time. But in plenty of pacing back and forth and wringing my hands. But money. It was $1,000 for the application. I have $1,000. 1500 dollars in to my architect. That's. You know, I had to print signs or twice.'",
        "'speaker_7': 'That's $300. 150 each. Yeah. That's okay.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'It was it's been a substantial investment. It's been a and a lot of hand wringing. Yeah.'",
        "'speaker_4': 'Got it. Thank you. And thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I just wanted to ask Teresa a question, if you wouldn't mind coming up to the microphone. I just want you to clarify whether or not any of the short term rentals are allowed in an accessory dwelling unit.'",
        "'speaker_6': 'They are if it's licensed and if the applicant lives or if the property owner lives on the property. So living on the property and living in the property are two different things. And so it was my understanding that the, the language in the short term rental ordinance was that you had to reside part time within the property'",
        "'speaker_6': 'that within the the unit that is being rented out. Can you clarify that? That's not the language that I'm familiar with. The language I'm familiar with is you live on the property and you can rent out whatever unit you've got.'",
        "'speaker_6': 'Okay. So let me just ask the applicant if that is one of the proposed uses that you're expecting to have in this particular property if they're successful.'",
        "'speaker_7': 'I plan on renting it out to a tenant. Okay. And I have the other vision I have is I have two young adult children now. Both of them are away. In the event they would come back. They could they could rent it.'",
        "'speaker_7': 'Okay. But other than that, I have no short term rental visit. In my understanding of the short term rental thing is you have to live on the property. It is now part time.'",
        "'speaker_6': 'Yes. You have to reside within the property. I thought it was 50% of the time. I could be wrong about that. But so thank you. I just want to share that. I think as we were saying.'",
        "'speaker_0': 'QUESTION You sounded like you were maybe getting ready for comment.'",
        "'speaker_6': 'Oh, wait for that.'",
        "'speaker_0': 'All right. Almost. Let me bang the gavel and we'll be there. All right. Seeing no other questions. The public hearing four counts. Bill 817 is closed. Comments by members of council. Councilman Sandoval.'",
        "'speaker_1': 'Sorry about that. Thank you, Mr. President. So thank you for bringing this request forward. I remember meeting you as a council aide talking about this this property, and for clarity. Councilman Sawyer, this is one of the answers that doesn't have a very active land use committee.'",
        "'speaker_1': 'And I have been pushing for five years to get this specific or no more active when it comes to land use so that they can offer an opinion. When we're sitting up here behind the dais, I think it's important.'",
        "'speaker_1': 'So thank you for taking the time to go to those meetings. I think I've seen you at every single one over the last year, and I know every time I ask for them to have a land use meeting.'",
        "'speaker_1': 'I know you're also there backing me up. So I appreciate that. As these accessory dwelling units come forward since the passing of Blueprint Denver, I think you're going to probably see a lot more in northwest Denver where people the the cost of living has is exorbitant and people need another way to offset some of their income and'",
        "'speaker_1': 'or they have an aging in place. They want someone to age in place or they have young children who are going to go off to college and come back. So I think there's very many variables and thank you for doing the outreach that you have because no one's called my office.'",
        "'speaker_1': 'I haven't heard much about that. And that's what I prefer to see behind this dais. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I think as. We continue to move forward in trying to address the housing needs of the city, creating the opportunities where ideas can be constructed, where they fit onto a lot. I think that makes sense.'",
        "'speaker_6': 'I am concerned and I will be asking the city attorney to help me draft language to ensure that this is not a loophole where a tight attached dwelling units would be used as short term rentals. That that is not the reason why as a city, I think we've moved to try to expand that.'",
        "'speaker_6': 'It's it's really to ensure that people who are struggling, trying to find affordable housing and people who are looking for the opportunity to augment their income and be able to stay in the city where that makes sense. But I think if they become nothing more than short term rentals for out-of-town people and folks who are living here'",
        "'speaker_6': 'that are struggling, trying to find housing, that doesn't make sense to me at all. So I'll be supporting this tonight. But I think this is something that I want to make sure that we have an opportunity to discuss and and really be thoughtful about that.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Ortega. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I want to echo Councilman Ortega's comment. I also want to say I'm really excited that we have increased use of an opportunity of this opportunity to allow seniors to have a way to offset some of their property taxes after they've retired and they don't have, you know, steady income.'",
        "'speaker_4': 'Certainly, our property taxes continue to go up. And and allowing people to age in place, I think is important. And I think this gives people another tool in the tool belt. Also, parents who want to give their kids a little more privacy as as the applicant has mentioned, you know, if his kids want to come back, I'",
        "'speaker_4': 'think that's a great use as well. And and the flipside is also true. We've heard over time that, you know, the secret's out. People are moving to Colorado and they want to bring their parents with them, too, but but not in the same house.'",
        "'speaker_4': 'And so this gives, you know, an opportunity for people to have their their parents come and have their parents have a little bit of privacy and the kids to have a little bit of privacy, too. I'd be interested in, you know, that blueprint has has established that areas should be considered city wide.'",
        "'speaker_4': 'I'd like to look at that. So I'll be supporting this as well. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Hines. So you know their comments. I'll just add a thank you to staff for putting this all together and the great staff report. I think this clearly meets the legal criteria for rezoning. And I will be supporting this this evening.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_1': 'CdeBaca I. Flynn.'",
        "'speaker_9': 'I.'",
        "'speaker_1': 'Gillmor, i. Herndon.'",
        "'speaker_4': 'Hines I.'",
        "'speaker_1': 'Castro. I can teach. Ortega, i. Sandoval, i. Sawyer, I. Torres, i. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please. Because voting in US results.'"
    ],
    "Text Amendment to Denver Zoning Code for Tiny Home Village, Large Development Review, and Affordable Housing Parking.": [
        "'speaker_1': '11 eyes.'",
        "'speaker_0': '11 eyes, Constable 817 has passed. Councilwoman Gilmore, will you please? What counts? About 834 on the floor?'",
        "'speaker_2': 'Yes, President. Clerk, I move that council bill 0834 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The required public hearing for accountable 834 is open. May we have the staff report? Try and get technology to cooperate here. There. Much easier to see. Thank you. All right. Take it away.'",
        "'speaker_11': 'Great. Thank you. Members of the council, Andrew Webb here from Community Planning and Development to present on a text amendment number six to the Denver zoning code, which would establish a new temporary tiny home village use and associated use limitations and regulations.'",
        "'speaker_11': 'It would also make some small updates to large development review procedures in the zoning code, as well as a clarification to a cross-reference on parking reductions for affordable housing, which I'll detail further on in the presentation. And I'll invite the sponsor as well to jump in at any point during the presentation if she has anything else she'd'",
        "'speaker_11': 'like to add. So first of all, I'll just briefly set the stage here with an overview essentially of what tiny homes are. These are communities of small, individual sleeping units, typically arranged on a site with common facilities in single in a separate structure, common use structure.'",
        "'speaker_11': 'Kitchens, bathrooms, that sort of thing there. They exist around the country. And they've gained popularity as as one of many tools in the toolkit for addressing homelessness. They are particularly of interest to vulnerable populations such as the LGBTQ community, veterans, people with pets, couples and others that have challenges accessing conventional shelter systems in cities.'",
        "'speaker_11': 'So we're doing this text amendment, proposing this text amendment because tiny home villages are not currently addressed at all. The Denver Zoning Code, the rising popularity is something that the larger group Living Project noted over the last year and a half.'",
        "'speaker_11': 'And we do have, as I'm sure most all of you are aware, a community, tiny home community here, beloved community village. That village has operated on unlisted, temporary use permits. This text amendment would take some of the lessons we've learned during that pilot project and codify them into clearer regulations and use limitations for future applicants and create'",
        "'speaker_11': 'transparency and predictability. This slide shows the actual proposed use definition for this temporary use. Again, we're talking about multiple relocate of all structures on foundations just sleeping in. It's not full dwelling units located on a single zone lot with common facilities.'",
        "'speaker_11': 'The zoning use permit for temporary tiny home villages would be aligned with whatever building permits were issued. Building permits will vary in length based on the permanency of utilities and facilities. So, you know, chemical toilets and temporary utilities are permitted.'",
        "'speaker_11': 'But in those cases, building permits and zoning permits would be shorter. The maximum permit duration is up to four years. And then upon expiration of those zoning permits, no new temporary tiny home village could be permitted on a exist on a subject site for at least four years.'",
        "'speaker_11': 'The slide highlights how this particular use is different from a kind of a permanent, temporary or a permanent tiny home village concept that we're working on as part of the Group Living Project. The intent here is to grant some flexibility from the zoning codes, building form and site design standards, especially as they address the public realm, the'",
        "'speaker_11': 'pedestrian realm. For operators that are seeking to address this very important need in the city to address homelessness. We are working on the group Living Project on a permanent version of this that would require at least one common structure to be built up at the at the primary street and meet the city's typical build to transparency and'",
        "'speaker_11': 'active use requirements so that it would so that a permanent use would fit in better with the fabric of the community. This slide shows the zone districts that would be where this temporary use would be permitted. It's essentially all zone districts in the city except for open space districts in the lower intensity residential zone districts.'",
        "'speaker_11': 'So the single unit to unit and row home districts, that would be permitted only on properties where there is an existing civic or public use like a church or community center. And there would also be a limit of 30 sleeping units in a tiny home village in those lower intensity residential zoned districts.'",
        "'speaker_11': 'For all implementations of this use of community information meeting is required and I'll detail that in a subsequent slide here. This slide shows the requirement of applicants. They include an operational plan that details how the how the facility, how the village will be operated, a required community input information meeting prior to a zoning permit application and a'",
        "'speaker_11': 'site plan that demonstrates compliance with the siting and design standards of this temporary use, which I'll detail here shortly. The community information meeting is a is a new process that we developed with other stakeholders for this use and also for the large development review use.'",
        "'speaker_11': 'It is a pre application requirement where the applicants would go to the community and gives an opportunity for them to begin building a relationship with the community. There are expanded notice requirements from some of our typical zoning code requirements for this community information meeting that are new as part of this amendment.'",
        "'speaker_11': 'They include the typical mailed notice to affected city council members and property owners. We're also expanding the requirement from the typical 200 foot buffer to 400 feet. So R.A. is within 400 feet. Other community organizations that are not registered are knows within 400 feet.'",
        "'speaker_11': 'And not only owners of properties, but also tenants of of of rental properties, both residential and commercial. So as a part of this, CPD has worked with a vendor to, to create a new database of about 135,000 apartment unit address data.'",
        "'speaker_11': 'So it's essentially all the apartment units in the city so that postcards can be sent to those units as well as commercial units where, where businesses might rent space to allow for us to to implement that new requirement.'",
        "'speaker_11': 'The operational plan requirements are listed on the slide. I won't go through every single one of them, but generally speaking, we're will be asking upfront for details on how residents will be selected for a tiny home village, how the facility will be maintenance, how housekeeping facilities will be provided, things like laundry and health care, that sort of'",
        "'speaker_11': 'thing. We'll ask for details on community governance procedures and how how community will deal with members that have violated those requirements. Single point of contact for emergency and mitigation of external effects, among other requirements. The slide shows the the zoning requirements that would be established for temporary tiny home villages by this text amendment.'",
        "'speaker_11': 'So the primary street or front setback in lower intensity residential zoned districts would be 20 feet, which is generally aligned with typical requirements in residential districts, and it would be per per the zone district minimums elsewhere, side and rear setbacks requirements would be five feet.'",
        "'speaker_11': 'Entry features would be required on common use structures if they're located within 25 feet of a primary street. An entry feature is essentially a door that is accessible to pedestrians and is an obvious point of entry to the site.'",
        "'speaker_11': 'We're not requiring off street parking, minimum off street parking for this use. We've heard from operators that there's generally not really a demand for vehicle parking for this use. The number of units permitted on a site would, as I mentioned, in the lower intensity zone districts would be capped at 30 sleeping units on on all other sites'",
        "'speaker_11': '. It would be determined by lot size and and required building separation requirements. Those are. Part of the of a recent building code amendment that the council adopted in July, also setting up some building code requirements for tiny home villages.'",
        "'speaker_11': 'The building separation requirement is ten feet, though there are allowances for smaller separation distances if buildings are built to meet certain fire suppression standards. And I'll also highlight here that accessory uses like pets and gardens would be allowed as they are and regulated as they are for typical residential uses.'",
        "'speaker_11': 'The slide just highlights some of the additional accountability mechanisms for temporary tiny home villages above and beyond a typical residential use in the city and county. So I mentioned the operational plan and its set of requirements. If there is public funding being used to assist or pay for a tiny home community, there would be contract requirements for'",
        "'speaker_11': 'that funding. While we're not requiring good neighbor agreements, the community information meeting is the opportunity for an applicant to have that conversation with neighbors and potentially enter into that. Adding another layer of accountability between the operator and the community.'",
        "'speaker_11': 'And then the the Pre-Application outreach, the community information meeting provides an opportunity beyond a typical residential uses to to make the community aware of what's happening and answer get their questions answered. This slide shows some some possible development scenarios based on different lot sizes, accounting for building separation and typical structure sizes on a on a do so'",
        "'speaker_11': 'on a typical, very small lot of 4000 square foot lot inclusive of common structures. You could fit about five sleeping units and that goes up exponentially as you get larger on a 12,000 square foot lot, you could get about 24 units.'",
        "'speaker_11': 'This slide highlights some of the changes to other sections of the code that would be made by this text amendment. The first is too large development review. As I as I mentioned, that process was adopted into the code on in July and did include the community information meeting requirement.'",
        "'speaker_11': 'However, at that time, that meeting requirement was included in the section of the code that actually deals specifically with a large development review. This amendment would move the community information meeting requirement out of the older section and into a standalone section in the code where it can be cross-referenced by upon this text amendment.'",
        "'speaker_11': 'Elders in temporary tiny home villages but potentially future uses as well. It also adds the expanded notification buffers and the renter and business occupant notification requirements to the LDR process. Additionally, this amendment makes a small change to a parking reduction section of the code to clarify a cross-reference that allows for reduction of parking to for affordable housing'",
        "'speaker_11': 'projects that meet the requirements of the inclusionary housing ordinance, which has since been repealed and replaced. This amendment updates those references to the city's current affordable housing standards so that current new developers of affordable housing can take advantage of this parking reduction.'",
        "'speaker_11': 'This line details the process for for this project. This has been going on for for quite some time. We really started talking about the whole universe of group living and kind of these unique and emerging uses in March 2018 as part of the group living process or project.'",
        "'speaker_11': 'And we've had many public meetings about this type of use and many other related uses. In spring of this year, it was we decided to pull this project at the request of the sponsor out of that larger project and send it through on its own.'",
        "'speaker_11': 'And we had several meetings at that time with inter neighborhood cooperation and a public meeting to present on the proposal and take some community input. We put a summary and red line draft of the text amendment out in late June for review planning board hearing took place on August 7th and received a unanimous recommendation of approval.'",
        "'speaker_11': 'The Land Use Transportation and Infrastructure Committee considered this on August 27th and did send it to the council. And that brings us to where we are today at the council public hearing. This slide just highlights a few of the changes that we did make based on some of the public input that we did receive.'",
        "'speaker_11': 'They include the limits of of the tiny home village use on sites in low intensity residential districts to those sites that already have some sort of civic or public use and limiting them to 30 sleeping units in those lower intensity districts as well, allowing the or requiring that for years past between establishment of a new tiny home'",
        "'speaker_11': 'village on a subject site after one vacates the site and then notice the new notice to renters and non R.A. community entities that serve an area. We have received quite a few letters about the project and providing feedback.'",
        "'speaker_11': 'Those have all been included in your in detail, in full detail in the staff report. These are the criteria for adopting a text amendment to the zoning code. This text amendment is impacted by three adopted plans the Comprehensive Plan Blueprint Denver and Housing and Inclusive Denver.'",
        "'speaker_11': 'This amendment is consistent with the goals and strategies from two of the two key comprehensive plan elements. It would advance several of the equitable, enforceable and inclusive element goals enabling by enabling a range of a range of housing types, promoting flexible options to and and promoting flexible options to meet the needs of people transitioning out of homelessness'",
        "'speaker_11': '. It would also advance the strong and authentic neighborhood element by introducing the new renter outreach requirement and expanding outreach requirements in general. In general, such as expanding the the boundary in which we have to actually send notification to two community members and residents.'",
        "'speaker_11': 'The Sixth Amendment is consistent with many blueprint goals and strategies aimed at responding to the city's unique housing needs. It would enable a new housing option, essentially to be part of the toolkit for addressing homelessness. And this text amendment was developed through a robust public process as detailed previously.'",
        "'speaker_11': 'Implement several of all three of Blueprint's three equity concepts by expanding options for low cost housing that can help stabilize people's lives and improve access to jobs and services. And by permitting the use citywide, it helps contribute to the diversity of housing types citywide.'",
        "'speaker_11': 'And finally, this text amendment implements policies and recommendations from the housing an inclusive Denver that's the city's housing plan by adding a flexible new housing use that can help address homelessness and by establishing new outreach and public engagement opportunities.'",
        "'speaker_11': 'With regard to the second criterion. This text amendment would further public health, safety and welfare by implementing adopted policies for enabling affordable housing and options for people experiencing homelessness, and by creating more predictable, transparent city processes. And it would address the third criterion by resulting in uniform processes and regulations for temporary tiny home villages that are uniform'",
        "'speaker_11': 'within each zone district in which this temporary use is allowed. So with that, staff recommends the council adopt this text text amendment based on a finding that all review criteria have been met. And I'm happy to stand for any questions.'",
        "'speaker_0': 'Thank you very much. We do have 16 individuals signed up to speak on this issue this evening. So I'm going to call five at a time up when I call you up, if you could come up to this front row so that you're ready to jump up to the microphone when I call your name.'",
        "'speaker_0': 'Charles Allison Godfrey and Elizabeth James. Ron see Paul Bendell and John Hazen, if you could come up. And Charles Allison Godfrey, you are a first.'",
        "'speaker_12': 'Thank you, counselors. My name is Charles Allison Godfrey. I live at the cross streets of 30th and Zuni, and I'm here on behalf of myself, the University of Denver Law School's Land Use Law Society and the National Lawyers Guild.'",
        "'speaker_12': 'I have gathered about 50 signatures here from the law students that support the tiny home village zoning amendment. For years, the homelessness crisis in our city has existed at unacceptable levels. Metro Denver Homeless Initiatives Point in Time survey documented a 14% increase in the total homelessness population from 2018 to 2019.'",
        "'speaker_12': 'The crisis will continue to grow as homeownership has become increasingly unattainable for the majority of our city's residents, as rental rates skyrocket and as funding for housing assistance decreases. With the tiny home village zoning amendments. Denver has an opportunity to make a low cost investment.'",
        "'speaker_12': 'Will having an immense impact on the lives of individuals experiencing homelessness. As the beloved community village has shown time and time again. These village can villages can exist side by side with welcoming neighborhoods. The villages help foster an environment where formerly homeless individuals can have a space of their own, something many have lacked for years.'",
        "'speaker_12': 'The villages also allow time for people to develop skills that will help them stay housed in the future. We urge you to vote yes to expand housing opportunities for homeless individuals in our city. Thank you.'",
        "'speaker_0': 'Thank you. Next up, an Elizabeth.'",
        "'speaker_6': 'I'm an Elizabeth. Located at these 50th and Washington very near East 50th and Washington in Globeville. And I want to thank the council for having this public hearing. I'm here not to speak for or against the amendment, but to ask that the process be a deeply well-considered process, given the residual of the pain that continues to linger'",
        "'speaker_6': 'in Globeville because of the manner that this came to Globeville, out of which came many of the lessons that are now being brought into this piece of, I guess it's legislation. One of the things I'd like to ask is that all all city council members really recognize that this is a citywide problem that can be resolved by'",
        "'speaker_6': 'creating an inventory and it can be a matter of talking, looking quickly, going to find where the many diverse needs of homelessness solutions can be found. But I do feel like this process has not generated the deep learning that I think needs to happen for operators of these facilities, the tiny home projects, to be vetted for their'",
        "'speaker_6': 'their cultural sensitivities and ability to create the bridges between the residents of tiny homes and the residents in the neighborhoods. Globeville. I'm here as an individual, by the way, not affiliated with any of the Arnaud's I've worked with, not on behalf of anyone else, and quite aware of many people in Globeville that are not here, that are'",
        "'speaker_6': 'wishing that that there there could be more constructive empathy. The situation, the process was mishandled both by the city council person at the time and the staff that came in from the DCC. I don't have any questions about where people's hearts are at.'",
        "'speaker_6': 'I wish that this was the type of process that could be audited.'",
        "'speaker_9': 'Through the city auditor sociologically.'",
        "'speaker_6': 'I think there's a great deal to discuss. I would like it to be looked at deeply without it being politicized. I think Globeville has all of the elements in concentration that have to be considered in every neighborhood when bringing in the mixture of populations that have a variety of combined stresses and and and aspirations and hope.'",
        "'speaker_6': 'A lot of what the stress was in Globeville was because the clover was the first neighborhood where the neighborhood planning was rolled out, deploying the planners. And there was there was a blow in relationship to that, too, and with the love for the tiny home residents, which should be respected.'",
        "'speaker_6': 'I would just ask the City Council to rise up to a deeper evaluation of what this process has been. Do a debriefing, look for best practices, use the standards that are used when National Science Foundation grants come in with programs come in.'",
        "'speaker_6': 'We need to look more deeply at this because.'",
        "'speaker_9': 'Just listening I'm sorry.'",
        "'speaker_0': 'Was your time is up. Thank you very much for full. Next up, James Ramsey. Thank you. My name is James Ramsay. I'm a resident of Denver. I own my own home in the Capitol Hill neighborhood.'",
        "'speaker_8': 'I'll just be brief.'",
        "'speaker_0': 'This thank you for considering this amendment to the zoning code. It offers a regulatory environment that allows individuals and members of the community to provide the sort of attainable housing that is not otherwise provided through higher costs and private development.'",
        "'speaker_0': 'I, for one, as a homeowner, would welcome a tiny home village on my block and in my neighborhood without question. Thank you for your consideration. Thank you. Next up, Paul Mindel.'",
        "'speaker_10': 'Hi. Thank you for having me. I'm here to speak in favor of the support of tiny home village tax amendment. I'm grateful for all the work that the Community Planning and Development Agency has done, and I've been a part of that group Living Advisory Committee the whole way.'",
        "'speaker_10': 'Um, so I'm also speaking on behalf of Quinn City Cooperative in Capitol Hill. I believe these forms of housing strengthens Denver's community by providing an opportunity for shared governance and micro solidarity. So micro solidarity is the act of small groups of people banding together and supporting each other economically and emotionally.'",
        "'speaker_10': 'It's not a particularly new kind of thing. People have done that since Indigenous resistance to colonization all the way through the Underground Railroad to today. You know, small groups of people trying to survive. So in this context, though, I think it's very necessary in the face of Denver's real estate, runaway real estate values and also just the'",
        "'speaker_10': 'neoliberal policies that we've inherited. And so I believe it's amazing that tiny home villages can allow sort of small groups of people to come together. And in the case of a beloved community village, support each other to create jobs and access to permanent housing.'",
        "'speaker_10': 'I also see it providing shared governance, which is also an important thing. I worked in a homeless shelter in Flagstaff, Arizona, and saw firsthand that, like moving dozens and hundreds of people in and out of a building each night created high pressure, and it also reduced the amount of autonomy and dignity that individuals received.'",
        "'speaker_10': 'And so I believe that, you know, these communities, which do allow an aspect of shared governance, of people having a say in a in the circumstances and decisions that affect their lives. I think shared governance is just a huge asset to Denver's community and to building out greater resources to those who are, I guess, most excluded by'",
        "'speaker_10': 'our current economy.'",
        "'speaker_0': 'Could you state your name for the record? Paul Bender. Thank you. Next, John Haden.'",
        "'speaker_7': 'Hello. Members of council. My name is John Haden. I live in the Five Points neighborhood and I have a property at 34th and Lawrence, which is just a few blocks from where the first community village, beloved community village was located.'",
        "'speaker_7': 'And so I'm here to testify firsthand as a neighbor about how extraordinary that experience was to have the village in in our neighborhood and what a difference it made for the people in that village to have that sense of community versus what we've seen in the larger shelters on the other end of of our own neighborhoods.'",
        "'speaker_7': 'So we had kind of this view of of two very different ways of treating people who are experiencing homelessness. And the village, the tiny home villages really are something I would love to see our city embrace. And I'm here to actively support that because I believe they are beneficial to the people who who live in the village'",
        "'speaker_7': '. And also and perhaps more importantly for you, because I believe they're beneficial to the neighborhoods where the villages are located. And this amendment does something very important, which is provide the opportunity for these villages to be located throughout the entire city.'",
        "'speaker_7': 'And I, I really believe that if we have these villages in, in neighborhoods across the city, even in high income neighborhoods, that it will help reduce the sense of the homeless are other from us. People need to understand that people who are experiencing homelessness are in fact their neighbors, that they are people just like them.'",
        "'speaker_7': 'And by reducing the segregation of our city, by providing housing types from people of all income levels, we do we're taking a step in the right direction to do that. I would like to recommend one thought for you.'",
        "'speaker_7': 'There is a piece of land outside the city county building that was recently considered for a park, for art, for a museum that's not coming. It's owned by RTD, and I think it would be a fantastic site for a tiny home village right in the center of downtown, where our city can speak loud and clear.'",
        "'speaker_7': 'These are our neighbors. This is something to be proud of. Thank you.'",
        "'speaker_0': 'Thank you. I'll call the next five if you could come up to the front. Duane Petersen, Tyrese Howard Cole. Chandler, Jesse Paris and Julie Patino. Duane Petersen. Europe.'",
        "'speaker_4': 'Hi.'",
        "'speaker_9': 'Updating the zoning code for the tiny home village would allow for the expansion of tiny.'",
        "'speaker_5': 'Homes to be built in other locations.'",
        "'speaker_9': 'Providing opportunities to more individuals experiencing homelessness to achieve housing. Having a secure place to reside is important to one's self-esteem. Tiny homes offer safety and stability while providing an individual.'",
        "'speaker_5': 'With independence and dignity. Thank you. My name is Dwayne Peterson.'",
        "'speaker_0': 'Thank you very much. Tyrese Howard.'",
        "'speaker_6': 'Hello. My name is Patrice Howard. I'm going to speak with two hats. Now, most of y'all know me as an organizer with Denver homeless out loud, but I'm also a part of the Village Collaborative as a board member and original founder of this village.'",
        "'speaker_6': 'And I want to speak a little bit to the history which brings us to this place. So back in 2015 and 2016, I and others were in this very council chambers asking you all council members for support for legalization of tiny home villages, which were not yet legal at that time.'",
        "'speaker_6': '2017 that legalization came came about through a variety of supports, mostly from community planning and development and others.'",
        "'speaker_2': 'And and the beloved community village.'",
        "'speaker_6': 'Was able to open up.'",
        "'speaker_2': 'For the first temporary temporary site. That struggle of.'",
        "'speaker_6': 'Of three or four years to just legalize the villages themself did not end. In 2017.'",
        "'speaker_2': 'When the village became legal.'",
        "'speaker_6': 'The unlisted temporary use permit process that the original village was under. Well, it was a great initial pathway was filled with flaws and and struggles that made it extraordinarily difficult to find other sites to to to go through the zoning process in.'",
        "'speaker_2': 'A streamlined and efficient manner.'",
        "'speaker_6': 'And so passing this zoning is is a critical step forward to streamlining the process to enable more of these villages to go up throughout the city of Denver in an efficient way and in a way that can build that community connection that is being talked about, and most importantly, in a way that faces the reality that housing'",
        "'speaker_6': 'is a basic human need and that right now we have thousands and thousands of folks who are homeless, sleeping on our streets, our alleys, our parks, our abandoned buildings, our busses, our shelters, and will continue to be. So this is a pathway just to make this a little easier to have a place to call home.'",
        "'speaker_6': 'So I am grateful for the support of Councilwoman Kennish in bringing this forward and in all her work that has made this a law that we can now vote on or that you can now vote on. And I don't have a vote, and I ask you all to please support this and moving forward.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Cole Chandler.'",
        "'speaker_10': 'Good evening, counsel. I'm Cole Chandler. I live at 3024 Elizabeth Street and Denver's District nine. And I'm a co-founder of the Carter Village Collaborative. I'm also here on paternity leave. I just welcomed a new baby into my life.'",
        "'speaker_10': 'So I've gotten to talk with lots of you about the specifics of this text amendment. And I'd like to talk a little bit higher level this evening. And I think many of you will be familiar with this history.'",
        "'speaker_10': 'But we know that throughout the history of many of America's great cities, that certain zoning ordinances have been used as tools to exclude certain groups of people from accessing certain parts of town. We've regulated a lot sizes, home sizes, built forms, etc., in order to in order to produce well formed cities that serve to increase and preserve'",
        "'speaker_10': 'the wealth of a few while others are excluded. This historical reality has been one of the primary points of tension since the beginning of our effort. The history that Teresa was just remembering from back in 2015, when people were standing here in these chambers asking for a dignified resident led, tiny home communities.'",
        "'speaker_10': 'As soon as we started that process, we immediately found ourselves immersed in the power and access that has land accessibility in the heart of our city. Utilizing city planning tools, we have segregated our neighborhoods and communities based upon race, class, religion, gender, sexuality and more for generations.'",
        "'speaker_10': 'And we are weaker for that. The work of creating an equitable city is to take an honest look at that reality and find places to use the tools at our disposal to change that reality and rewrite that history, thereby liberating the land and the people who live on the land.'",
        "'speaker_10': 'This is what we have the opportunity to do tonight. We have the chance to make it permissible to build more community based housing, to put more houses on his own lot, to move outside of our traditional build to requirements in order to make space for a group of people in our city that are currently being excluded.'",
        "'speaker_10': 'We have the chance to rewrite just a tiny bit of history as we make a powerful statement that we all belong in Denver, regardless of our wealth, our racial background, our educational attainment, or the depth of our various struggles.'",
        "'speaker_10': 'This bill takes steps to make land access a bit more possible for those that don't otherwise have that right. And for that reason, it makes our city a bit more just and equitable, and thereby it makes all of us a bit more free.'",
        "'speaker_10': 'If this bill passes, the Colorado Village Collaborative looks forward to utilizing the tool, this tool, as we work with Denver's historic neighborhoods to find attractive ways to integrate our brothers and sisters on the streets into these historic communities.'",
        "'speaker_10': 'Together, we can weave a strong, robust social fabric that will make Denver an equitable, resilient and beautiful city for future generations. So thank you for your support and vision as we move together to free the land and free ourselves so that we may enter into deeper relationship with one another.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pearce.'",
        "'speaker_10': 'Good evening. Jesse Pierce represented for Denver Home, a sellout Black Star action moment for self, defense and positive and commitment for social change as well as universal African people's organization. We are in favor of this rezoning. As my colleagues have already stated, this has been a long fight with the city to allow for these things to be'",
        "'speaker_10': 'even possible. This fight has been going on since 2012, since the urban camping ban was passed and we are currently asking for a repeal of that ban. So somebody sponsor. But back to this, there's been a long fight and now the city is coming to grips with the reality that we have a homeless crisis, even though we'",
        "'speaker_10': 'have 23,000 vacant apartments. Because it's a real estate deal that the city refuses to do and members of this council. But I'm permitted to just trust the council as a whole. So I'm just going to leave it at that.'",
        "'speaker_10': 'With that being said, City, don't sit up here and try to take the credit for these villages, nor for the repeal of a ban that has been inhumane in 2019. We're still dealing with these type of laws, these sundown.'",
        "'speaker_10': 'Okeydoke. Jim Crow laws in a supposedly progressive, liberal city. So I don't even know where my city is anymore. I'm a native, long term native, and I don't know where this is going, but this is not my home and I do not feel at home here.'",
        "'speaker_10': 'So this is a start of we can do better and so on. The public actually what that looks like. But this is just a start. There's much more that's needed besides this. This isn't even scratching the surface, especially when we have 23,000 vacant apartments.'",
        "'speaker_10': 'So, yes, I'm in favor of this rezoning. Please pass this. It's a step in the right direction, especially since we could do better and we had the money and the resources to spend to program the public into thinking that it's time to show improve.'",
        "'speaker_10': 'I just came from the Show Me State, so you got to show me where and you can tell me. And that being said, I'll be running again in 2023.'",
        "'speaker_0': 'You could stay on the topic of this hearing.'",
        "'speaker_10': 'And we ask that you vote in favor of this. Thank you. Thank you. I'm not done yet. Thank you. Clinician others for your.'",
        "'speaker_0': 'Please address the councils of all individual council members.'",
        "'speaker_10': 'This is pushing this to actually get us this far. And like I said, there's more need. So since we can do better, let's do better and show us exactly what that looks like. Hold Council.'",
        "'speaker_0': 'Thank you. Thank you. Next up, Julie Pitino.'",
        "'speaker_2': 'Good evening, honorable counsel. My name is Julia Patino. I serve as the director of Basic Human Needs. How's that for a job title for the Denver Foundation? I'm here tonight in support of the zoning code update relative to tiny homes.'",
        "'speaker_2': 'The Denver Foundation is a 95 year old community foundation which invest very heavily in this community. We support not only community based organizations and individuals through grantmaking, but also through partnerships. The Tiny Homes Village, the Interfaith Alliance, a number of organizations that have been involved in the involvement of tiny homes, villages.'",
        "'speaker_2': 'Are all organizations that we've supported over the last five years alone. We have invested over $5 million in housing and homelessness and meeting basic human needs for this community. This is another cornerstone to ensuring that we have housing stock that is otherwise not available in the barren landscape that we have before us, particularly for individuals experiencing homelessness'",
        "'speaker_2': 'or other vulnerabilities. We have a two fold relationship with the Tiny Homes Village. Not only have we been a funder and funded, not forks or excuse me, shovels in the ground, but really villages who came to us looking for funding relative to navigation and services that villagers sought out to help find jobs to attend school to meet'",
        "'speaker_2': 'health needs to address another an array of needs. We have various nonprofit partners like Bayside Enterprises who are involved with that. We also have a role in terms of partnership in advancing housing policy and addressing homelessness from a grassroots level.'",
        "'speaker_2': 'Recognizing that people experiencing homelessness are the experts when it comes to addressing homelessness, and that even our well-intentioned efforts are not served unless we are including their voice and leadership. Thank you.'",
        "'speaker_0': 'Thank you. And recall the next group up. Tanya Sully. Mark Foul. Loretta Koehler. Chairman Sekou Kate. Bridget and Jeff Baker.'",
        "'speaker_2': 'Hello. My name is Tanya Saleh. I am a co-director of the Colorado Village Collaborative. I want to thank you all for your continued involvement and support for the Tiny Homes Village and finding a solution to the housing crisis in Denver.'",
        "'speaker_2': 'I would just like to start by saying you got a background of the Tiny Homes Village, but really what we see it as is transformational housing. We really seek to transform the lives of every resident that comes through our gates and our doors and give them a house and a key and a place to feel safe and'",
        "'speaker_2': 'dignified and unified in a community that they're not an outsider. But we are all one in the same space. Our goals are to expand and allow more people to have this sense of dignity and feel this sense of community.'",
        "'speaker_2': 'And due to their unfortunate situations of, you know, impossible rent in Denver and all the other factors that contribute to the housing crisis allow people to have an opportunity outside of shelters, outside of the limited other options for housing, and to provide a unique solution, not the only solution, but it is one.'",
        "'speaker_2': 'So we want to pave the way for expansion and fill a gap in this continuum of housing and to have an opportunity to expand on our women's village that we've already put the groundwork for. But this will allow a more streamlined path for that to happen and for more villages to come.'",
        "'speaker_2': 'So the personal transformation that I've seen in the village, through the residents, through people who have even supported this, is this sense of community, through even the success of us being in a part of a community. So we've we've seen crime go down in a neighborhood.'",
        "'speaker_2': 'We've seen either a positive impact or no impact at all. And so allowing this to take place in different neighborhoods outside of District nine and other districts in other places across the state, this is going to be the first step.'",
        "'speaker_2': 'This is a model for the city. This is a model for other organizations that are looking to find solutions for housing and clearing. Things such as permitting will allow us to focus on what we really seek to do, which is provide transformation, to provide healing, to provide community, and to provide a sense of ownership in the House'",
        "'speaker_2': ', in the places they live in and feel part of it moving forward. Having this stability is the main factors that see success. So having a long term, a longer term place on the site will allow more stability and that'll be more success within our villages.'",
        "'speaker_2': 'This will be an opportunity for other organizations to implement similar model models. The biggest piece is equitable community engagement. As you can see, we've had some we're still healing from past community engagements with not enough time. So this will allow us to approach it in a time where renters, homeowners, businesses, Arnaud's we can all get together and'",
        "'speaker_2': 'collaborate to see what we want our city to look like. So thank you all and I hope you can support this.'",
        "'speaker_0': 'Thank you. Next up, Marc, Val.'",
        "'speaker_8': 'Thank you. My name's Mark Fall. I'm a resident of Douglas County, unincorporated. And I want to speak tonight on sort of the technical aspect of the tiny home village I've been involved in the in the process since 2017 and being familiar with the design of the tiny homes and also how the community, Denver Community Planning and Development'",
        "'speaker_8': 'Department has supported this. There's been great concern for the quality of construction and the quality of the built environment. So I think that expanding the length of time that these units are in place is a doable and reasonable thing.'",
        "'speaker_8': 'I don't think that it's a substandard building for that kind of stay, and I think that that's very, very important because to let someone stay someplace for an extended period of time at all, the environment has to be built safely.'",
        "'speaker_8': 'And I think that the CBD has shown great concern for that. They've required a builder with a Class A license to do the construction and oversee the construction of these tiny homes. And the designs have been done by, you know, registered architects, profession, very professional manner, all that's been done.'",
        "'speaker_8': 'The other aspect of this is that if the tiny homes can stay in one location for six months, you need a new location every six months. If they can stay in a location for four years, then that decreases the number of new locations you need to scale this effort up.'",
        "'speaker_8': 'And it's a very successful effort, but for a very small segment of the homeless community. So to make it a more effective solution for a larger group of homeless people, a longer stay is important to accomplish that. Lastly, I think there's a proactive measure where the city of Denver will not be reacting to problems that come forward'",
        "'speaker_8': 'with that that other cities have seen in other tiny home communities. So I applaud the city of Denver for looking at this in a very proactive manner, and it's a great opportunity to be out in front of this and prevent problems that might occur with these villages in the future.'",
        "'speaker_0': 'Thank you. Next up, Loretta Koehler.'",
        "'speaker_2': 'Hi. I'm Loretta Kaylor, and I live in Baker historic neighborhood. And and I'm part of the group Living Committee. And and I want to just talk about a little bit about me and why I think this is a really appropriate First Amendment.'",
        "'speaker_2': 'And I think we should you should go ahead and vote for this. I've worked most of my adult life with in in low income resource kind of areas. So I still do. And so I see the needs that aren't being met by a lot of different communities and I see where we're failing for our city.'",
        "'speaker_2': 'I would like to see I've worked a lot in in housing in the past and a lot with transit, transitional housing and a lot with domestic violence. And I think there's a lot of people who end up finding themselves homeless.'",
        "'speaker_2': 'We know because of medical needs, because of bills, because of domestic violence, for whatever other reasons. And I think this is a means for some people to have some other kinds of housing. When I worked for Boulder County Housing Authority, we worked on ways to work for housing for all kinds of individuals.'",
        "'speaker_2': 'And it was difficult because housing is so prohibitively expensive. And we know that Denver's become prohibitively expensive. We see this on a daily basis. When I see Homeless off of Broadway coming into our neighborhood and I see people everywhere.'",
        "'speaker_2': 'I am very supportive of this because there are benefits for somebody having a roof over their head. And we all know that. We all know that having somewhere safe to go to that you can call your own is very important.'",
        "'speaker_2': 'We know that those kind of supportive services that have been offered for those people in tiny home villages have been beneficial for those people. And the goal is that they can move on and have.'",
        "'speaker_6': 'Something more permanent.'",
        "'speaker_2': 'We need to have transitional housing across the city. As James said, I think the one thing that I would do is I would support it in my neighborhood if they are the industry said they wanted to have that down the street from me.'",
        "'speaker_2': 'I more than welcome.'",
        "'speaker_6': 'It because I think it's appropriate.'",
        "'speaker_2': 'I'd rather have people off the street. The other thing is I want my city to be forward thinking. I don't want is to be.'",
        "'speaker_6': 'Regressive and not look at what the needs are of people. I think we need to find.'",
        "'speaker_1': 'New ways to fit those needs.'",
        "'speaker_6': 'And this is one.'",
        "'speaker_2': 'Of those ways. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_3': 'Okay. Contrary to popular belief, my name is not Notre Dame. I'm not Jimmy the Greek. But I'm telling you flat out, this is going pass. 100%. It's not because all of a sudden there's been a moral change here.'",
        "'speaker_3': 'You have seen the coming. You don't pass this, Jack. You're in trouble. And I'll tell you how I knew I was going to pass. I saw Herndon outside Lehman. I knew. I knew it. I knew it because if I was.'",
        "'speaker_3': 'Brooks had been sitting there when you came up. But there is a caveat here. I want to pay attention. It would go. There used to be a sitcom called The Little Rascals. And there was a young kid in there.'",
        "'speaker_3': 'That they call missed data. And she ended up being the advocate for the group, like the lawyer. But lawyers talk out of both sides of their neck because they always create the loophole for the pendulum swing because they always want to be getting paid on both sides.'",
        "'speaker_3': 'They don't get. So watch this here. The caveat and the loophole in this one is what? Temporary. Hmm. Not permanent. Temporary. That means it is subject to change when there is a regime change. Uh huh. Yeah. So there's no closer to that.'",
        "'speaker_3': 'But that's all right. In a morning, I'll be meeting with Michael to change this and give back to make it permanent. Permanent? If it's not permanent, it's not real. When that last zoning change came up, was it temporary that you could temporarily build another house inside your backyard?'",
        "'speaker_3': 'No. So now we've got two standards one for the privileged, one for the poor, and they're diametrically opposed to each other. So you can fool some of the people some of the time, but you can't fool all the people all the time.'",
        "'speaker_3': 'Age Data.'",
        "'speaker_0': 'Please refer to the counsels of all but individuals.'",
        "'speaker_3': 'As a whole. Little rascals. You need to grow up. You're too old for this. Acting like children.'",
        "'speaker_0': 'I'm sorry, but your time is up. Thank you very much. Next up is Cricket.'",
        "'speaker_3': 'Good job.'",
        "'speaker_2': 'I. My notes. My name is Kate Rigo. I am not in any formal role with CBC, but I have some background working with CBC informally, and I also have a number of friends who live our beloved community village.'",
        "'speaker_2': 'So I spent some time just hanging out there as sort of a part of the extended community connected to that village. I'm also an urban planning student at UCD, so I've done a little bit of study related to planning and zoning best practices around townhouse villages.'",
        "'speaker_2': 'I don't have anything comprehensive prepared for that, but I just wanted to speak about one thing I hadn't heard mentioned. Yeah, I mean, fortunately so far everyone has been pretty supportive, but I wanted to encourage members of council to not listen to any whatever naysayers might be out there who are going to say things like, well, you'",
        "'speaker_2': 'shouldn't, you know, shouldn't be bothering with Tanya's village stuff because it's not going to end homelessness. You can only house, you know, 14 to 30 people or whatever at a time. And there's however many thousands of people here who are experiencing homelessness and done it right now.'",
        "'speaker_2': 'So there's really no point. It's only a tiny drop in the bucket, so therefore you shouldn't do it. So I just wanted to I mean, hopefully no one is thinking along those lines here, but at least wanted to say it's I haven't heard anyone here say that we think this is going to just end.'",
        "'speaker_2': 'Homelessness across the board is just an important piece of lots of solutions and things that that we're all part of supporting across the board. So I want to put that out there cause folks to go ahead and pass this, recognize that it's not the be all and end all of something that's going to end that's going to'",
        "'speaker_2': 'end homelessness or anything. But then once that is passed, continue to look for further ways to be proactive and brave in addressing homelessness and more and more creative ways. I'd also wanted to and just real quickly echo lots of other things that folks have said about the importance of these of of this type of housing, the diversity'",
        "'speaker_2': 'of housing type that it adds to cities as well as positive impacts on communities around them. And most importantly, I think the kind of dignity that does just that is part of this form of housing that that brings to people who are living in it.'",
        "'speaker_2': 'And I think that it's all time for. Thank you.'",
        "'speaker_0': 'Thank you. Geoff Baker Hello Council.'",
        "'speaker_5': 'I'm representing Curtis Park Neighbors and president of Curtis Park Neighbors. And we are fully in support of this because it is a small step in the right direction. We would like to see this go to a more permanent down the road.'",
        "'speaker_5': 'So hopefully we'll be back again to talk about getting this into permanent. But this is a great step. One piece of the puzzle for solution towards homelessness. There's many other things that need to be done, of course, but hopefully with this moving in the right direction, we will see these popping up in neighborhoods and down the road'",
        "'speaker_5': '. We won't even think anything of it.'",
        "'speaker_7': 'They'll just be part of the the housing stock that we have in Denver. So that's really all I got.'",
        "'speaker_5': 'We are in support of passing this. Thank you very.'",
        "'speaker_0': 'Much. Thank you. That concludes our speakers. Are there questions from members of council on this item? Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I just wanted to ask, first of all, CPD, if we have seen any other applications come through just knowing that this is pending legislation and possibly now includes, you know, other sites around the city.'",
        "'speaker_11': 'While we've heard some interest in coming forward with an application, we have not heard of any anything formalized yet. We have not received any specific applications. Okay.'",
        "'speaker_6': 'And would you mind coming up for a minute, please? Can you just share whether or not the tenants who live at the beloved tiny home village are expected to contribute financially towards their housing? And if not, what other kinds of contributions they're making?'",
        "'speaker_10': 'So the current residents of the beloved community village are not required to make financial contribution. They are required to participate in upholding the community agreements and participate in community life, including coming to meetings that occur weekly at the village and then also participating in upkeep and chores around the village.'",
        "'speaker_10': 'So those are their community requirements.'",
        "'speaker_6': 'All right. Thank you. Have no further questions.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman CdeBaca.'",
        "'speaker_1': 'Thank you, Mr. President. Cole.'",
        "'speaker_2': 'Can you come back? Sorry.'",
        "'speaker_1': 'I almost jumped on there to ask you earlier. Quick question about the cost of setting one of these up and.'",
        "'speaker_2': 'What do you have options with the types of material you use?'",
        "'speaker_10': 'So when we first built this pilot project, we built 11 units for $145,000, which was an amazing thing. And it was done by 6000 hours of volunteer service and lots of just community involvement all around. We think that was awesome and we think as we try to scale, that's really difficult to replicate.'",
        "'speaker_10': 'So we've been working on a financial model, working with social impact solutions. And Ken, while on that and what we've found is that our startup capital costs for creating a tiny home village of 25 units, which is really the goal that we're trying to get towards, would be $600,000.'",
        "'speaker_10': 'And so that would include all the staff time, construction, time, design time, all that kind of stuff for $600,000 and a community building with water and sewer hook ups like what we're trying to currently do in Globeville. So that comes out to $30,000 per unit, but the material costs for the unit within that are 15,000.'",
        "'speaker_10': 'And so that's with what we're doing right now, a stick build that's gone through a traditional permitting process. You know, there could be possibilities for innovation with shipping containers and other kinds of things like that over time. But right now what we're looking at is that stick build $30,000 per unit kind of price point.'",
        "'speaker_1': 'And so when since these are temporary, when the time is up on one of them, you guys had a unique situation and I think you kept the materials from the original one.'",
        "'speaker_2': 'What happens to the materials when the time on this one is up and is there a commitment to keep the materials circulating?'",
        "'speaker_10': 'Yeah. So everything that we have on that site at 4400, Pearl would go to to a future site. The only loss, so to speak, would be whatever pipes we put in the ground and any improvements that we might make to the fence or those kinds of things.'",
        "'speaker_10': 'And so our move costs factor it out over four years. Time is something like $160,000. When you figure out the cost to move the buildings, the cost of that piping and infrastructure. So we build that into our operation costs for $40,000 a year over the four year time period.'",
        "'speaker_1': 'Awesome. And Andrew, can I ask you a couple of questions.'",
        "'speaker_2': 'About the material? Does this does this amendment.'",
        "'speaker_1': 'Say anything about what we can use, what we can't use for these villages?'",
        "'speaker_11': 'It does not. As long as the materials meet the the building code requirements, which are essentially the international building code and the international residential code requirements for a structure.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Councilman Cashman.'",
        "'speaker_5': 'Yeah, thank you, Mr. President. Yeah. Following up a little bit on what Councilwoman CdeBaca said. Andrew Sorry. Not trying to take it easy on your knees. So this particular zoning would not allow things like are these? How about prefab mobile homes?'",
        "'speaker_11': 'It would not. This anticipates purpose built sleeping units that are not full dwelling units that don't have, you know, kitchens and bathrooms in them built for this specific use. This does not permit the use of RVs or mobile homes which are regulated separately in the zoning code.'",
        "'speaker_5': 'Okay. Thank you very much. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Cashman.'",
        "'speaker_4': 'Councilman Hines. Thank you, Mr. President. Mr. CHANDLER. Yeah. I just want to follow up on something you said a minute ago. You said there's no financial contribution, is that right.'",
        "'speaker_10': 'From the residents themselves? That's correct, yes.'",
        "'speaker_4': 'Thanks for read my mind. So no one has to contribute like $17 a day. They don't have to contribute at all financially.'",
        "'speaker_10': 'Correct.'",
        "'speaker_4': 'Do you require residents to do some of your residents work? Yes. Do you require them to surrender their paychecks?'",
        "'speaker_10': 'We do not.'",
        "'speaker_4': 'Do you require the residents to get permission to leave the premises?'",
        "'speaker_10': 'No.'",
        "'speaker_4': 'I'm just thinking of reflecting back to another kind of marginalized community that we've had discussions about recently. And you're not a for profit corporation, is that right?'",
        "'speaker_10': 'That's correct.'",
        "'speaker_4': 'Who are your investors? Who who gives you money?'",
        "'speaker_10': 'So we're back to Colorado 501c3 We fundraise from individuals and from foundations like the Denver Foundation and the Colorado Health Foundation. And we would love to see a third leg of that investment strategy be the city investing in us as well.'",
        "'speaker_4': 'Thank you. And congratulations on your little one.'",
        "'speaker_0': 'Thank you. Thank you, Councilman. Councilman Flynn.'",
        "'speaker_8': 'Mr. President, I. Andrew, a couple of questions. The. Are the civic, public and institutional uses in in the low density residential zones single unit, twin unit and row house. The use tables in the zoning code don't have a lot of them listed something.'",
        "'speaker_8': 'A lot of them are not permitted like a postal processing center and and a museum and things like that. What are what are examples of those types of uses that are permitted with limitation in those zones? Can you in.'",
        "'speaker_11': 'Those in those church density.'",
        "'speaker_8': 'Churches. What else?'",
        "'speaker_11': 'Community centers and schools.'",
        "'speaker_8': 'So what is it? I didn't see a good definition of community center in the zoning code. Could that be a private one? Like. Like a VFW hall or. Or does it have to be open to the public?'",
        "'speaker_11': 'That is a great question. I believe.'",
        "'speaker_8': 'I only ask great.'",
        "'speaker_11': 'Questions. I believe it would. I believe it would include something like a like a Fraternal Order Hall kind of thing. Like you like you mentioned not just a publicly operated.'",
        "'speaker_8': 'Okay. So the one and one problem that I see and I don't know if this is something that came up during the vetting and I'm just seeing it during the hearing as I'm listening. Is that in the zoning code, in the zone, in those residential zones, community centers, overnight accommodations are prohibited.'",
        "'speaker_8': 'Does this need to be addressed or is this something that this text amendment overrides intentionally?'",
        "'speaker_11': 'This would be a separate temporary accessory use to.'",
        "'speaker_8': 'The primary site. That's right. So the primary use does not allow overnight accommodations, but the accessory use can.'",
        "'speaker_11': 'That's correct.'",
        "'speaker_8': 'Okay. That's all I have. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn, seeing no other questions. The public hearing for Councilman 834 is closed. Comments by members of council counsel managers, the sponsor. Did you want to go first?'",
        "'speaker_2': 'Yes, I did. I'm sorry. I'm stuck on the wrong screen.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_2': 'Thank you so much to all of the speakers for coming out tonight. We have, if you think about an analogy for this project, is like the Olympic torch. It's really those who are experiencing homelessness who lit the torch and really said, this is what we want to try and this is what we need.'",
        "'speaker_2': 'And then that torch got passed at one point to city agencies with a directive that said, figure out how to do this. And one of the people who spent the most hours I'm really pleased is here tonight, which is Jill Jennings Golic, who is our former she was our deputy director of planning at the time.'",
        "'speaker_2': 'She was an acting director for a portion of this conversation. And she and many staff members took the torch and figured it out. It wasn't a sprint. It was like a worldwide marathon. Like you imagine the torch having to go around the whole globe maybe several times.'",
        "'speaker_2': 'And I think that that was hard. It was hard for me and other council members to watch how long it took. It was hard for the staff who once they thought they figured something out, found another piece. And I want to share that.'",
        "'speaker_2': 'One of the things that was hard about it was the tradeoff between safety and the same standards for folks experiencing homelessness and speed. And I personally had a few rounds on that with, you know, the building official particularly saying, you know, can't we sacrifice this for speed?'",
        "'speaker_2': 'Can't we sacrifice that for speed? And then the question of, well, you know, do we want to, you know, for example, sacrifice the safety risk of a floodplain for the speed of putting a village in. So this was not easy.'",
        "'speaker_2': 'And I want to thank all of the folks who took the torch next, which is many of you who are here from the group Living Zoning Code Group. So I may miss someone, but I got Loretta James, Paul, John, folks who spent a lot of hours and many folks who aren't here who took the torch to say'",
        "'speaker_2': ', what are we mostly as residents who have not experienced homelessness? We had some work groups that had folks with lived experience on them. But what do we as groups feel like our obligation is and thinking about making our city more flexible.'",
        "'speaker_2': 'And so all I really get to do is carry the torch across the finish line like a foot and a half. Right. So I'm pretty humble. It's not my ordinance. I just I'm just here to help at the end, the staff.'",
        "'speaker_2': 'I also want to just thank Andrew and Tina Axelrod, who's not here for spending all of the hours they did as long along with Polly in my office. So I put up a visual because one of the things that folks ask me a lot in the community is what are we doing to address homelessness?'",
        "'speaker_2': 'And I've tried to find a one page thing that visually demonstrates the continuum. And what I say to folks is some of the things on this list we're working on making better. So emergency shelter is on the far left end of the spectrum and.'",
        "'speaker_2': 'We're trying to make it work better by moving it to the right so that it's more oriented towards housing navigation. And so that's something that's happening. A lot of what we do is we try to move our way to the right, we try to get out of the red and into the blue.'",
        "'speaker_2': 'And so one of the things that for me is really important when I when I came to the decision, I spent almost all of my time on the blue, right end of the spectrum, my time in office. That's what the housing fund was about.'",
        "'speaker_2': 'That's what doubling the housing fund and bringing forward $50 million for land, for supportive housing and those below 30% of median income was about and I was passionate and that's where I thought I needed to spend all of my time and talents, because that's the end of the spectrum.'",
        "'speaker_2': 'At that point, you're housed and you're safe and you're stable. It doesn't mean you don't need other supports, but it means you're no longer homeless. And for me, the moment where the realization occurred was when we had one project come forward for supportive housing in 2018, only one, and they did not get state tax credits.'",
        "'speaker_2': 'The city had all of our money sitting there and waiting to fill the gap, but our money's little and the tax credit money is big. And when the tax credit money fell through, we didn't have a new project in all of 2018.'",
        "'speaker_2': 'And that for me was the line that we had this big gap right in the middle where tiny home villages sits, right? We're trying to make all the things, all the shelter better and move people along. And we have the solution that we know works.'",
        "'speaker_2': 'And I just have to say it every chance I get. 300 folks chronically homeless, some for decades were offered housing for supportive housing, and only one person turned it down. People don't turn down supportive housing. It's just not common.'",
        "'speaker_2': 'And so what we know is folks want to be in this housing, but I can't build it fast enough. I couldn't make up all by myself for that 2018 project that went away. This proposal for me was about understanding that there was this gap right in the middle and that we had to put more energy into it'",
        "'speaker_2': '. And I appreciate the willingness of the community planning and development to take this piece out and move it faster. Because even if we don't have an application pending, we do have sites. There is fundraising already done for a whole new village and they are looking for sites.'",
        "'speaker_2': 'And so we would have been six months behind the game if we had waited to do this ordinance. But we're doing it tonight to move faster and to have more creative options. So what I often say to folks is the things on the blue end of the spectrum, especially even in the middle, they work.'",
        "'speaker_2': 'The challenge is getting them to scale. And that's what this ordinance is about. This ordinance is about saying we need a whole bunch of land to choose from because it's really hard to get. And I want to just address one question about why temporary.'",
        "'speaker_2': 'I agree that we should have permanent tiny home villages, too. But in order to build a building attached to the ground and hook it up to plumbing and hook it up to electricity, you need to own the land.'",
        "'speaker_2': 'If you're going to build it forever, it has to be your land. And that is hard to find and it's expensive to find. So the most important thing was to get any land quickly. So this was one of those speed things.'",
        "'speaker_2': 'It was about saying if there's a piece of land that's needed for a rec center in three years, let's use it. Now. If there's a piece of land that's needed for a grocery store in five years, let's use it now.'",
        "'speaker_2': 'If there's a condo project, that'll come someday, let's use the land now. So temporary land is not saying that folks don't deserve permanent homes. Everybody, I hope, will move out of that tiny home village and to the supportive housing that comes next and to the permanent affordable housing that may not have any of her services because they'",
        "'speaker_2': 'don't need them anymore. But the land itself is hard to come by. So while I'm working to get people into permanent homes, this is about creating spaces for villages as quickly as we can so we can get to scale.'",
        "'speaker_2': 'It's about the most people we can serve. And then I just want to close by saying that this is about more than just this ordinance doing the work. The ordinance is really the easiest part. As long as it took to get that torch around the globe three or four times, it is easy compared to finding that land'",
        "'speaker_2': '. So we need to call upon our civic institutions, our landowners, those folks sitting on something and ask them to step up. Our city has stepped up. We're going to keep doing that, but we don't have a lot of we don't keep a lot of unused land around, but we all need to think about that.'",
        "'speaker_2': 'Secondly, most of you know, I've proposed and the council has graciously agreed to put forward a request that our budget include support services. Folks can't move from tiny homes to the next step on this scale without housing navigators, who can help them make the applications and do the work to get that permanent step next.'",
        "'speaker_2': 'And so I hope that we're able to get support for that change in the budget, and we need to do more than that. Right. So we heard the $600,000 cost. The best practice research was presented last year at the Housing and Homelessness Workgroup, and we know that cities are often contributing to operations, sometimes to capital, not always'",
        "'speaker_2': '. But we can be thinking about other financial investments. We can only grow the scale if the resources are aligned. And then lastly, our neighborhoods. This is a new use. There were a lot of questions, which is why it is so important that we have the community informational meeting in here.'",
        "'speaker_2': 'That is not the sum total of community outreach, but it happens before the application goes in and the application has to note what feedback came from that meeting and how it was addressed. That's a first for those of you keeping track of our land use process.'",
        "'speaker_2': 'We don't require anyone else in our land use. So I got questions about that. Actually from Inter Neighborhood Cooperation, they said, Is it fair to ask our most vulnerable project to do more than we ask other developers and others to do?'",
        "'speaker_2': 'And the answer for now is yes, because this is a new use and people need more time to learn about it and understand. But it is incumbent upon our neighborhoods to engage in this conversation with good faith and with open hearts.'",
        "'speaker_2': 'Everybody in our city deserves a chance to live in a home. It might be next door to you. The desire for something to always happen somewhere else is not realistic. And so I ask our neighborhoods to think about learning about these homes now, maybe before a project is proposed tour, a supportive housing project now and get to'",
        "'speaker_2': 'understand why those services create a greater amount of safety, both for the residents who live there as well as for your neighborhood, than it does when you're living in an alley right in your vulnerable and you are a potential victim and you are highly traumatized on a daily basis.'",
        "'speaker_2': 'So I call upon our neighborhoods to help make the final step of this possible, which is by engaging in good faith and helping to welcome these and learning about them and preventing rumors from spreading and using your sincere desire to shape how you can be related to this.'",
        "'speaker_2': 'There is a lot of room to shape the relationship here. I do commend Globeville for being at the table to help say, here are some things about how this site could be designed and how these things could be shaped.'",
        "'speaker_2': 'And I hope every neighborhood will step up and engage with those ideas. With that, I thank my colleagues for their consideration and urge a yes vote tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. It's kind of difficult to go after Councilwoman Kane each those very powerful. Thank you. Denver. We can do better. As we heard last November, we can do better. So thank you, Councilman Kane Cannick, for your foot and a half of movement, which is a lot of work to move it a foot and a'",
        "'speaker_4': 'half. And thank you all of all the people here today who spoke in support of it and all the people who aren't here today who did a lot of work to make this happen as well, that you're bringing this text amendment forward.'",
        "'speaker_4': 'I also want to thank the district ten residents who are here today who came tonight and support call it perfect ten for a reason. And you're helping me realize how perfect perfect ten is. Mr. Ramsey, I hope I pronounce that correctly.'",
        "'speaker_4': 'It's specifically you who stated that you would be happy to have a tiny home village on your block. As Councilwoman Kennedy said, we need our neighborhoods to come forward. And we need to all of us, we need to make make a commitment to all of us as humans.'",
        "'speaker_4': 'And I would make the same commitment. I would be happy to have a tiny home village on my block as well. I think diverse neighborhoods are make better neighborhoods. And and I think that the some of the neighbors who who have concerns are in neighborhoods that have that are very homogeneous.'",
        "'speaker_4': 'And as we as we diversify our neighborhoods, I think we we've become healthier as a city. We've become healthier as a neighborhood. And frankly, I think that we've become healthier as individuals as well. So. This is as Councilwoman Kennedy showed in her and her visual.'",
        "'speaker_4': 'This is just one more tool in the toolbox. I look forward to considering additional tools as we in Denver continue to do better. As we do better. I'm excited to see a model that that treats residents as partners and success.'",
        "'speaker_4': 'And and I wish you success with my yes vote.'",
        "'speaker_0': 'Thank you, Councilman Consommateurs.'",
        "'speaker_2': 'Thank you, Mr. Chair. I also just want to thank everyone for coming out in support of this ordinance and the work that Councilwoman can each and CPD all put into this? Mr. Hazen I think it was it's something around who would love to see this, the city embrace this, and I would like to echo that.'",
        "'speaker_2': 'It is going to take all 78 of our neighborhoods to really embrace the potential of what this has and the potential it has to change people's lives. Mr. Chandler reminded us how zoning in our history in Denver was used to exclude people, and it will only change when we actually use zoning to include folks.'",
        "'speaker_2': 'So thank you so much. We still need a number of solutions. I love Councilwoman Nature's Spectrum of all of the housing solutions that are required and all of the parts that play a role in trying to address this true crisis.'",
        "'speaker_2': 'I really want to thank also the Denver Foundation and Ms.. Virginia for helping to fund these efforts. These are not free. These are not easy and they are temporary. So it does take investment and and belief that this actually makes a difference.'",
        "'speaker_2': 'This isn't a singular solution. It's one way to give stability and peace to a small group of people who only need a chance to figure out their next step. Tiny home villages may not be for everyone experiencing homelessness.'",
        "'speaker_2': 'They are for those for whom it does work a roof in a place of their own that can and will change their lives. So thank you all so much. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Councilman Cashman.'",
        "'speaker_5': 'Thank you, Mr. President. I want to thank our members of our unsheltered community and their allies for for the grace and courage with which you've leaned into this topic, especially in recent years. You've created a movement, and it wouldn't have been done without you.'",
        "'speaker_5': 'I want to congratulate Cole Chandler on the addition to your family. Hope your child is healthy and happy and carries your spirit of service. Thanks for what you do. Councilwoman Canete, his outstanding work. Thank you for your leadership on this.'",
        "'speaker_5': 'So this is an amazing evening. President Clark and I and maybe some others on the previous council will remember a gentleman named Bob Sperling who came around to council four years into the planning department lobbying for accessory dwelling units.'",
        "'speaker_5': 'And when he first came around, he was just shoot away. You know, it was kind of like, what are you even talking about? He, unfortunately, some months ago passed away after a brief battle with ALS and now on a somewhat regular basis.'",
        "'speaker_5': 'Now we're talking about this new tool to increase our housing stock, and I find that very exciting. A number of us went to Austin, Texas, this summer to visit their community first village, and they had 51 acres on the first 24 acres.'",
        "'speaker_5': 'They've got 225 tiny homes and mobile homes and RVs, and they're just started developing the remaining 27 acres for another 300 units. And they have a they're building a 20,000 square foot health center, etc., etc.. So we came back very motivated and wondering how do we replicate that?'",
        "'speaker_5': 'Does it have to be on 51 acres? Can it be done high rise? Can it be done in different just a different format? And what we're getting ready to vote on tonight provides us at least a shot at that.'",
        "'speaker_5': 'You know, and I like so much the idea of of individual homes rather than apartments in buildings. You have a you know, while they're certainly not large, they're your own. The door locks, there's space around it. You can sit on your porch and, you know, look out at whatever you care to look at.'",
        "'speaker_5': 'This is just a wonderful tool and it's such a fitting thing that we're talking about these both of these new additions to our housing stock. And as I would say to Mr. Chandler and say to our tiny homes, may you multiply.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'They just mean cash and Councilman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I want to piggyback a little bit on what Councilman Cashman was just saying. I was one of those council members who got a chance to go to the Austin community first. Residents. And to see how they have incorporated social enterprises into their living environment was was pretty exciting.'",
        "'speaker_6': 'But really what we saw was a community and that's what we see at the beloved tiny home village as well. And that is so much different than putting an individual in a unit because sometimes they lose that sense of community that they've had, that camaraderie, that that that has been built with the people they've been living on'",
        "'speaker_6': 'the streets with. And by creating what's more of a community environment, it it gives the individuals that support that is needed. Yes. The all the support services are important, but that sense of of community and belonging is equally as important.'",
        "'speaker_6': 'And that's part of what I have seen that our beloved tidy home village has created. Sokol I want to thank you and your board for really moving the needle on this conversation, being part of the group living conversations and elevating this to be part of that agenda and making sure that the committee that worked on on this'",
        "'speaker_6': 'particular section just kept moving the needle on it. Councilwoman, for for taking it across the finish line as you. Articulately elaborated on. But I think the importance here is that we have a shelter system. We have some supportive housing.'",
        "'speaker_6': 'We've got a lot of market rate housing. We need the layers in between so that we have all the right options for people that are coming out of our shelter system, that are working, that need to get into stable housing, that people who leave the tiny home village can get into housing that's affordable.'",
        "'speaker_6': 'And again, yes, it does take a while to get through, you know, the tax credit process in making sure that we've got the affordability built in, but really having the continuum of options for people at different stages in their life so that we're ensuring that we don't have people returning to the streets because we have it address'",
        "'speaker_6': 'that continuum of options. So for everybody who's been involved with this, I just want to say thank you to our our staff at CPD. Andrew, Jill, Tina. You guys have played an important role in, in shaping all of this and moving the needle as well.'",
        "'speaker_6': 'So I'm going to be supporting this tonight. I'm excited that we will have the opportunity to show folks that this really works. And, you know, we've got people in the Lincoln Park neighborhood who will be seeing, you know, something happened with the Burnham yards.'",
        "'speaker_6': 'And they're one of the communities that said, pick me. We'd like to have a tiny home village in our community as one of the options on this site, assuming she doesn't take the whole site when they're talking about, you know, creating some new route for the I-25 corridor.'",
        "'speaker_6': 'But I think this gives us the opportunity and the fact that we have so many large churches around our city that are being underutilized, that have huge parking lots, I think this creates tremendous opportunity for options all across the city where it's not just one neighborhood or one part of the city being asked to, you know, to'",
        "'speaker_6': 'do their part in helping make sure that we've got these opportunities here. And the last thing I'll say is. In Austin. I know when I've had a chance to travel to Europe and saw a tiny home village. These are communities that the larger community is very proud to have in their neighborhoods and to be able to say'",
        "'speaker_6': 'this is ours. And I think Denver has one and can have others, and it's not going to be for everybody. But having that as one of the options will give all those people who get to take advantage of them the opportunity to stabilize their lives.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Gilmore.'",
        "'speaker_2': 'Thank you, President Clark. You know. There's really no.'",
        "'speaker_6': 'Opposition.'",
        "'speaker_2': 'So congratulations on on a really robust community engagement process and want to support and acknowledge the work of the community first and foremost, because you do that work every single day. I want to also acknowledge, you know, Cole, Andrew, Jill and Councilwoman Kenney each and hopefully, you know, being one of the council.'",
        "'speaker_6': 'Members who attended the trip when we went.'",
        "'speaker_2': 'To Austin, Texas, and toured the community first village.'",
        "'speaker_6': 'You know, a lot of that.'",
        "'speaker_2': 'Education and experience will always stay with us. That being said, I think there's benefit to other city individuals or other council members going and visiting and kind of seeing that model.'",
        "'speaker_6': 'Because one of the things with their.'",
        "'speaker_2': 'Model was that they were also generating income for the residents. And that was so meaningful because you were validated that if you're creative or you make artwork or you make sculptures.'",
        "'speaker_6': 'Or you make jewelry or whatever it is that is.'",
        "'speaker_2': 'Your livelihood that you know in your heart is your life livelihood. They were able to really foster that. And I'm hopeful that with some time under our belts that we could look at more permanent solutions for these villages, because it's not unheard of that somebody might do improvements on a parcel of land that they never intend to'",
        "'speaker_2': 'own.'",
        "'speaker_6': 'They are only making those.'",
        "'speaker_2': 'Improvements so that they can operate and then someone else owns that land into perpetuity. It could be a corporation, it could be a developer. And right here in the permitted.'",
        "'speaker_6': 'Zone districts, we have churches, community centers and cultural.'",
        "'speaker_2': 'Facilities. And so what would.'",
        "'speaker_6': 'That model look like that.'",
        "'speaker_2': 'This investment.'",
        "'speaker_6': 'That is not a small.'",
        "'speaker_2': 'Investment could be valued for years and years to come.'",
        "'speaker_6': 'And I'm just curious as to.'",
        "'speaker_2': 'You know, following this trajectory and hopefully, again, we get a little bit of time under our belts and so that we can look at this maybe in another way after we see how this one works and where there might be others through the city.'",
        "'speaker_2': 'But, you know, it's troubling to me that we might have a significant initial investment that would be moved around every four years throughout the city without truly being able to realize and and really partner with maybe those churches or community centers or cultural facilities to support more individuals for a longer term duration.'",
        "'speaker_2': 'So congratulations again to everybody. Looking forward to seeing how this moves forward. And my one ask would be, please allow us. However, we might invite our registered neighborhood organization leaders, our community leaders in a respectful manner again. But just people need to see it and they need to meet individuals and really, truly understand.'",
        "'speaker_2': 'And so I make that ask and I'm here to always help and support. So congratulations again. Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilwoman. And thank you all for coming, for being here, for engaging in the process and for sticking with us as the night gets late. Madam Secretary, roll call.'",
        "'speaker_1': 'CDEBACA I.'",
        "'speaker_10': 'FLYNT All right.'",
        "'speaker_1': 'Gilmore, I.'",
        "'speaker_4': 'Hinds High.'",
        "'speaker_1': 'Cashman. Kenny Ortega High. Sandoval High.'",
        "'speaker_2': 'Sawyer, I. Torres, I. Mr. President.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'Madam Secretary, please close voting in those results.'"
    ]
}