{
    "Proclamation for Dr. Charles Brantigan's Retirement.": [
        "'speaker_0': 'Thank you. Thank you very much. Thank you for being here. Councilman Lopez, thank you for bringing this forward. All right. We're going to move on to our second proclamation of the evening. Councilman Brooks, will you read Proclamation 166?'",
        "'speaker_4': 'Yeah. Thank you, Mr. President. I am honored to read Proclamation 166 honoring Dr. Charles Chuck Brannigan as he retires as chair of the Health District Design Forum. Whereas Dr. Charles Brannigan has recently announced that he is retiring as the chair of the Uptown Health Care District Design Forum after more than 27 years of volunteer service, of working'",
        "'speaker_4': 'tirelessly and selflessly on behalf of residents, businesses and health care institutions of the Uptown Neighborhood. And. Whereas, he and other neighborhood leaders branded, banded together and collaborated with several Uptown hospitals and other health care institutions in 1993 to persuade City Council to establish a specific hospital zone district and to prevent hospitals from creeping into the destabilizing, destabilizing'",
        "'speaker_4': 'residential neighborhoods. Under Dr. Branigan's leadership for 27 years, the forum has fostered friendly communications between registered neighborhood organizations and health care organizations. In Uptown worked with Denver Planning Office to develop an Uptown Health Care Design District and helped shape the expansion of the Presbyterian St Luke's Hospital, the redevelopment of the former St Luke's Hospital into a mixed'",
        "'speaker_4': 'use area, the acquisition of the Saint Joseph's Hospital and the Children's Hospital campus, and the construction of the new Saint Joseph's Hospital. He's met with many developers to comment on the improve various new projects in the neighborhood and and fought crime and other problems within the neighborhood.'",
        "'speaker_4': 'Whereas Chuck has conducted a successful medical practice from the La Langley Restored Gilbert mansion, he has also affiliated with many Denver hospitals and gone to Egypt. Yes, he's been in Egypt for two weeks for the past 17 years to train Egyptian military surgeons.'",
        "'speaker_4': 'He served as the chief of surgery at Presbyterian St Luke's Medical Center and is currently serving in a volunteer capacity at the University of Colorado Medical Center, Department of Vascular Surgery. And. Whereas, he and his wife Kathy have restored several Victorian homes and worked to have their block designated as the Lafayette Street Historic District in the Find'",
        "'speaker_4': 'District nine. Their current historic passion is the restoration of the narrow gouge roundhouse in Carmel, Colorado, to a working roundhouse and a museum complete with historic steam engine restored the railcars from the original South Park and Pacific Line.'",
        "'speaker_4': 'Chuck has received numerous awards for his efforts and historic preservation. He also founded the William Lang Society and has done much research and education about Denver's premier early architects. And. Whereas, Checking Kathy are also the founders of one of Denver's finest cultural organizations, the Denver brass, a 14 member.'",
        "'speaker_4': 'Brass musical ensemble that performs many concerts every year. And. Whereas, in all of his service to the Uptown community, Denver, Dr. Branigan has earned the respect and loyalty and admiration of those who have worked with those he's worked with, including residents and neighborhood organizations, health care institutions, developers and city council members.'",
        "'speaker_4': 'We all appreciate and celebrate his past and continuing services to the Uptown neighborhood and to all of Denver. Now therefore be a proclaim that the Council of the City and County of Denver, Section one, the Council of the City County Denver, hereby expresses its sincere appreciation to Dr. Charles, who we call Chuck Brannigan for his dedicated work'",
        "'speaker_4': 'and tireless efforts on behalf of the residents, businesses and health care institutions of the Uptown neighborhood. And that the city and the Council for the City and County of Denver, Colorado, hereby officially proclaims February 25th, 2019 be known as Chuck Branigan Day.'",
        "'speaker_4': 'Section two that the Clerk of the county, the city and county of Denver shall attest and fix a seal of the city in County Denver and this proclamation be transmitted to Dr. Branigan.'",
        "'speaker_0': 'Thank you. Councilman Brooks, your motion to adopt.'",
        "'speaker_4': 'Yes, I move that proclamation. 166 be adopted.'",
        "'speaker_0': 'It has been moved and seconded comments by members of council. Councilman Brooks.'",
        "'speaker_4': 'So this is I mean, this proclamation said it all. But this dear leader in our community who I've never called Chuck. By the way, Dr. Branigan is he's an institution for northeast Denver. Many folks do not remember the days, and I don't remember the days because I wasn't here.'",
        "'speaker_4': 'But when the hospitals were running wild in the neighborhoods of City Park West and Uptown, there was a leader. There was someone who, you know, who who said, you know, I'm a I'm going to go outside of my normal duties as the doctor of this area and start to be a caring neighborhood leader and see if I'",
        "'speaker_4': 'can start to coalesce and bring some collaborations to make sure that these hospitals understand that they are in a neighborhood and they're in our neighborhood. And so Dr. Brennan gets a lot of credit for that. But as you see, he's one of the most talented individuals you've ever met before.'",
        "'speaker_4': 'Not only is he fixing hearts, which would be enough in life, he's playing instruments. He's saving historic buildings. He's leading in communities. And he's been doing it for many, many years. And I just got to say, as a young city councilperson, newly elected, who didn't know a lot about the history of Dr. Branigan in 2011, he really'",
        "'speaker_4': 'took me under his wing and said, this is how we do neighborhood revitalization. This is what historic preservation looks like. Here's our history. And. I invite you to be a part of this? He wasn't judgmental, which he could have been like.'",
        "'speaker_4': 'You know, young city council person. I won't tell you a thing or two about what this neighborhood is all about. He was loving. He was kind, but always educating. And so it is an art is what a great honor and privilege that we get a chance to recognize Dr. Brannigan today.'",
        "'speaker_4': 'And there are many just to show you his influence. You know, when I tell people all the time, first of all, we got a packed house because there's a couple of issues going on neighborhoods. But I tell people all the time, if you pay for parking, come through security and sit in these benches, it's because you really'",
        "'speaker_4': 'love the city and it means something. So if you are here for Dr. Brennan, I just want you to stand up right now. You mean something, Dr. Brannigan, to all these people. So thank you very much.'",
        "'speaker_0': 'Thank you. Councilman Brooks, knock. Hold on just a second. Hold on just a second.'",
        "'speaker_1': 'We saw that Duvall is going to be reading facts.'",
        "'speaker_0': 'Hold on. Hold on just a second. We still have a few things to get through, including voting. Real quick. So if you just hang tight for just a second.'",
        "'speaker_4': 'You can just you can have a seat right there.'",
        "'speaker_0': 'There you go. Thank you, Councilwoman Ortega.'",
        "'speaker_3': 'Thank you, Mr. President. I just wanted to add some accolades as well to Dr. Branigan's years of service to not only the neighborhood community, but to the health care community for your many years of service, the work you have done, not just in Denver, Colorado, but across the globe.'",
        "'speaker_3': 'One of the titles I would give you is an R.A. activist title, because you really did play that role. I can remember many meetings and many times when you would meet with members of city council to talk about so many of the changes that were happening in the uptown neighborhood.'",
        "'speaker_3': 'And you were that catalyst that would pull the community together and and help make sure that we as a body city council were listening to the voice of community as those changes were coming forward. So I just want to thank you and your wife Cathy, for your years of service to the Denver community and for making the'",
        "'speaker_3': 'Uptown community a better place for everybody, including the hospital complexes that still exist there. So thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. All right. Let's make this official, Madam Secretary, roll call.'",
        "'speaker_4': 'BROOKS Oh, yeah.'",
        "'speaker_2': 'Black All right. Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon. All right. Cashman. I can eat. I. Lopez. I knew Ortega. I just knew. Right. Mr. President.'",
        "'speaker_0': 'I. I'm. I'm secretary. Please close voting. Announce the results.'",
        "'speaker_2': '11 Eyes.'",
        "'speaker_0': '11 Eyes. Proclamation 166 has been adopted. Councilman Brooks, is there anyone you would like to call up to accept this proclamation?'",
        "'speaker_4': 'Well, I tell you what, we're just excited to talk about Dr. Brannigan tonight. So we have two people tonight. We have Mr. Jim Wiseman, who's been in the neighborhood for a long time. And then we also have Dr. Branigan.'",
        "'speaker_4': 'So if you guys can make your way up, Mr. Weisman, you can go first.'",
        "'speaker_1': 'Thank you. You'll have to excuse me. I'm. I have a profound hearing loss, and they all over here poked me, and I thought, oh, that's my cue. So. And I've got a terrible head cold. So I'm really profoundly hard of hearing tonight, but I'm gonna have a few notes here I'm going to read from primarily because I'm'",
        "'speaker_1': 'so emotionally invested in this whole thing that I don't trust myself to do otherwise. But ladies and gentlemen of the Council, I'd like to thank you. Councilman Burke, thank you very much for this opportunity. I'd like to thank community members, particularly Mike Henry and Marty Jones, who were instrumental in helping move this event forward.'",
        "'speaker_1': 'I'd like to bring special attention to Kathy Brannigan, Chuck's wife, who has been his most important coconspirator and supporting cast member in so many of these things. Kathy raised her hand there, and most importantly, the man we are all here to honor tonight, which is Dr. Charles Brannigan.'",
        "'speaker_1': 'He's back here. So where are you, Charlie? Oh, hey. Snuck up on me anyway. My name's Tim Weissmann, and having had the pleasure of working with Chuck for many, many years, I am honored and humbled to be able to have this opportunity to speak tonight.'",
        "'speaker_1': 'There are too many things to address here tonight in terms of this man's contributions, the co-founding of the Denver Browns with Cathy restoring the Roundhouse and rail facility at the historic Como, Colorado, and other historic work volunteer surgical training in Egypt.'",
        "'speaker_1': 'And much more than that, the profound event that precipitated this recognition tonight with Chuck's retirement, as we all know at this point from the AMP Town Design Forum, a little historic context I'd like to pass on. About 30 years ago, there were 44 residential property owners in an area we we came to call the island, which was'",
        "'speaker_1': 'a group of homes that were sandwiched between a number of the hospitals in the uptown area over here. They were being negatively and unjustly impacted by the hospital encroachment with no legal options. This was two blocks from the Branigan's historic home and the historic district that they had established with his empathy and compassion for these neighbors and'",
        "'speaker_1': 'his position in the health care community. He was uniquely positioned to help. Chuck jumped in with all four feet and was involved and instrumental in working with all the parties to create a process and the resulting redress an equitable buyout for all of the properties in the island area.'",
        "'speaker_1': 'It was huge for any of you that we might remember a great councilman named Hiawatha Davis. He was also intensely involved with us in that process, in developing that policy out of this two year process. We did come up with that new and all important hospital zoning, H one and H two, which present which we have today'",
        "'speaker_1': ', which is instituted through city wide. I'll just be another 30, 40 seconds here. But at any rate, at that point, the Uptown Hospital District Urban Design Forum was established with Dr. Branigan being considered the founder, and that was a carryover from what we had developed over that two year period.'",
        "'speaker_1': 'And it was so successful and Chuck did such a great job with it. We're going, Chuck, you got to keep this thing rolling. So he raised his hand and he he volunteered to chair and he's been there for 27 years.'",
        "'speaker_1': 'That's crazy. His unique skill set and on the balance, moderating has kept all of the parties, the hospital community, the city and the affected neighborhood groups willingly participating and highly effective for almost three decades. And one of the reasons this is so crazy is because in in any normal situation, these people would all be adversaries.'",
        "'speaker_1': 'But here they've all come together over all this time to be so effective. So, Chuck, I just want to thank you from the bottom of all of our hearts for the selfless and dedicated work you have done for our community all of these years.'",
        "'speaker_1': 'Thank you so much.'",
        "'speaker_8': 'I don't know what to say. It sounds like my head's getting bigger and bigger. The more I hear people talk about me here. City council. I can't begin to tell you how much I appreciate the honor that you've bestowed on me.'",
        "'speaker_8': 'I'd like to mention a couple of things that are I think are important. Of all of the things that I've done, the Hospital District Urban Design Forum, I think has been the most important. That was created as an inspiration of two city planners, Leslie Lipp.'",
        "'speaker_8': 'Stein And. That's the trouble. I just lost my thought. I can see his face. In any case, they're the ones that inspired. Inspired us and had the vision to create an urban design plan. City Council then joined in and approved it, and that gave us some official standing for the Urban Design Forum, which has persisted to the'",
        "'speaker_8': 'present. It's true that when we started, it required some real skill to keep the meeting together. We had hospitals that were in mortal competition with each other. We had hospitals that were in competition with neighborhoods. We had people, real estate developers, who were in conflict with everybody else.'",
        "'speaker_8': 'And we got to the final point where. It was clear that everybody really wanted the same thing. The hospitals wanted a safe, stable neighborhood for their customers. The people who lived here wanted a safe, comfortable space to live in.'",
        "'speaker_8': 'And once we got everybody on the same page, it was possible to begin to bring all these diverse organizations together. And the remarkable thing is that over the years, we've seldom had to vote on any issue. We've managed to build the consensus between the people that have conflicting interests.'",
        "'speaker_8': 'Sometimes we've been in favor of people and sometimes through organizations of have met our disapproval. But overall, the group has functioned by consensus, and that's been the key. I'm. I have mixed feelings about stepping down as the chairman of the forum.'",
        "'speaker_8': 'It seems like that's been part of my life for most of it. I'm not going to disappear by any means, but it's time for me to turn the gavel over to somebody else. So, again, thank you very much for the honor that you've bestowed on on me.'",
        "'speaker_8': 'And there's this other city planner that I mentioned was Dennis Swain, Dennis Swain and Leslie Lipski and had the idea of putting together an urban design plan which would be passed by city council. And that's been what's been the glue that held the organization together and the support from the various issues we've brought before.'",
        "'speaker_8': 'City Council has been great and the support that Albert Brooks has provided us has been wonderful as well. So I will begin by saying that if you wish to live in the inner city, you must be proactive. And that's the way I began my career in downtown Denver and in inner city Denver.'",
        "'speaker_8': 'And I believe that piece of wisdom to those who follow. Thank you very much.'",
        "'speaker_0': 'Thank you. All right. That concludes our proclamations for this evening. That brings us to the bills for introduction. Madam Secretary, will you please read the bills for Introduction.'"
    ],
    "Cannabis Consumption Pilot Program Sunset Date Repeal.": [
        "'speaker_0': '. Thank you, Madam Secretary. We do have one item for separate consideration this evening, so we will now vote on final consideration of Council Bill $19 002 for repealing the sunset date of the cannabis consumption pilot program. Councilman Flynn, will you please put Council Bill 19 Dash 0024 on the floor?'",
        "'speaker_6': 'Certainly. Mr. President, I move that council bill 19, dash 24 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. Are there any questions or comments by members of Council or Councilman Flynn?'",
        "'speaker_6': 'Thank you, Mr. President. I was absent last week when this was on first reading and the public hearing was held. And I but I did go back and watch it. I missed last week's meeting just after I, my youngest son, got married and happened to choose that Tuesday for his wedding.'",
        "'speaker_6': 'But I did go back and watch the the testimony. And as I said in the marijuana committee, I don't believe that simply repealing the sunset, which the voters had approved, in which the authors of the initiative are included, is going to make any difference in the context of all the other changes that would have to be looked'",
        "'speaker_6': 'at before this program can actually take off and have an attempt to be successful. I believe at this point now we will have only one such business open and I don't see that removing the sunset would. Result in any new businesses suddenly coming forward with all the other restrictions that I believe are truly the reason that more'",
        "'speaker_6': 'of these licenses have not been sought by other businesses. I think we should solve all the problems together and move them forward as a package. I don't oppose repealing the sunset when it's part of a larger package that addresses all the other reasons that that that would need to be addressed before we could see more businesses come'",
        "'speaker_6': 'forward. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn. See no other questions or comments. Council members. This is just a reminder that any reform ordinance adopted by a vote of the people may be amended or repealed by city council only by a two thirds vote or nine affirmative votes instead of the standard seven affirmative votes of council are required to pass this'",
        "'speaker_0': 'bill this evening. Madam Secretary, Roll Call.'",
        "'speaker_2': 'Black Eye. Brooks Flynn.'",
        "'speaker_1': 'Now.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Cashman. I can eat Lopez. I knew Ortega. I assessment. I Mr. President.'",
        "'speaker_0': 'I Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_2': 'Tonight in one night.'",
        "'speaker_0': 'Ten eyes one accountable 19 0024 has passed. All right, councilmembers, this is your last opportunity to call out an item. Councilman Flynn, you've already begun, but will continue with you for the motions this evening. Unless you object. I'll do a quick any objections?'"
    ],
    "Salaries of Elected Officers for Terms Beginning July 15, 2019.": [
        "'speaker_0': 'Councilwoman Sussman has called out Council Bill 19 0055 for a postponement. Miss, anything? All right, now, Secretary, would you please put the first item on our screens? And, Councilman Flynn, will you please put Council Bill 19 0120 on the floor?'",
        "'speaker_6': 'Yes, Mr. President. Move the council bill 19, dash one to be ordered published.'",
        "'speaker_0': 'It has been moved and seconded questions or comments by members of Council or Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. Let me switch back to the other screen. First of all, I want to make it really clear that I respect the the consideration that every member gives to this every four years. The city charter literally requires us to vote on this one way or the other, to set the salaries for the next term'",
        "'speaker_6': 'of office for all elected officials. That's the 13 council members. The mayor, the auditor and the clerk and recorder voters gave us a very good roadmap about 16 years ago, I believe, for taking the politics out of it or minimizing the politics of setting the pay raises.'",
        "'speaker_6': 'And it sets two measurements. And one is the cumulative four year increase in the average is the average or the median wage of the career service employees. It doesn't matter because that's not the one we're using or the cumulative increase in the consumer price index for the Denver metro area.'",
        "'speaker_6': 'And we cannot exceed the lower of those two. And for this four years, as is true in most four years, it is the CPI that we're using as the index. And that's a very good road map because I remember a lot of how political it could have.'",
        "'speaker_6': 'It always was prior to 2003. And in fact, we lag even four years behind because for this coming term of office, we are using the benchmark of consumer price index for the prior four years going back to 2015.'",
        "'speaker_6': 'So it could be argued that we're even four years behind in approving this. Nevertheless, I'm voting no on this and I would ask my colleagues to take these points into consideration, even though it's it's entirely reasonable to follow the voters instruction in the charter.'",
        "'speaker_6': 'I'm asking my colleagues to take these points into consideration and join me in taking a four year timeout from pay raises for the elected officials. Our positions are just fundamentally different from city employees in the career service. If a traffic engineer over in public works believes that he or she is underpaid in the market, they look to'",
        "'speaker_6': 'other jurisdictions or the private sector for their advancement, and they may they may find employment elsewhere. A manager in the building department may look outside the city for a better salary. That's why our H.R. department spends so much time doing pay surveys and adjusting adjusting the wage scales that the city uses to make sure that the city'",
        "'speaker_6': 'not only attracts but can keep the best talent for our agencies. This reasoning, though, does not apply to us and our positions. These positions are not on a career path for advancement. We are temporary placeholders. We act as a body.'",
        "'speaker_6': 'We are 13 individuals, but we only act as a. Audie. And we hold these jobs temporarily for eight or 12 years. So I don't have to take a test to be promoted to council member first class. Right. It just doesn't work the same way.'",
        "'speaker_6': 'If I felt the page is not sufficient here. It's not like I would start to look around and maybe I'll look at the L.A. or New York City Council. I'm going to move up to other city councils. This is just a fundamentally different citizen legislative position, and it's not like the current salary is not attracting people to'",
        "'speaker_6': 'run for office. Right now. There are currently on the street 61 individuals who are circulating petitions to earn one of these elected positions. That's more than four years ago when we actually had six open seats on this body.'",
        "'speaker_6': 'And in fact, right now we are earning more than the governor of Colorado. Our salaries are higher than than the governors. In 1991, this council salary first surpassed the $30,000 a year mark. I was sitting right over there where Andy and David are sitting, and I was thinking, Wow, they just passed $30,000 and I was covered by'",
        "'speaker_6': 'a Union Guild contract and I was actually earning more than the council members. I think I don't think Andy or David can can say that they're earning $90,000 now. In fact, council salaries have tripled since then, whereas the Social Security Administration data shows you the average American wage earner over that same time frame has gone up in'",
        "'speaker_6': 'annual wages only 130% in the same time period. The median income for a single person household in Denver is about $63,000. Tomorrow in the Finance and Governance Committee, as Councilwoman Cannick noted, we will hear a bill that would raise the minimum wage for workers on city, on city projects and in city buildings to $15 an hour.'",
        "'speaker_6': 'Against this background in data, even though the voters have given us permission to follow the formula that's in the charter to set our salaries in the fashion proposed in this ordinance, I believe it's appropriate that we consider for the 20 1923 term of office that we take a pass on elected official pay increases and I will vote'",
        "'speaker_6': 'no on it. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Seeing no other questions or comments. Madam Secretary, roll call.'",
        "'speaker_1': 'Flynn No.'",
        "'speaker_2': 'Black Brooks High. Hernan Cashmere.'",
        "'speaker_0': 'High.'",
        "'speaker_2': 'Can each. Lopez I knew.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'Ortega Hi. Sussman Hi, Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting, announce the results.'",
        "'speaker_2': 'Eight eyes. Three names.'",
        "'speaker_0': 'Eight Eyes. Three names. Constable. 19 0120 has been ordered published. Madam Secretary, will you please put the next item on our screens? And Councilman Flynn, will you please vote? Council will 19 Dutch 0055 on the floor.'",
        "'speaker_6': 'I just.'",
        "'speaker_1': 'Moved move that followed.'"
    ],
    "Zoning Change for 4519 Pearl Street in Globeville.": [
        "'speaker_0': 'I think your microphone.'",
        "'speaker_6': 'Yes, Mr. President. I move that final consideration of Council Bill 1955 with its public hearing be postponed to Monday, March 18, 2019.'",
        "'speaker_0': 'I think that was I think you got a little bit ahead of it. You're just putting it taken out of order. And then Councilman Sussman was come up. So can you. You want to move that?'",
        "'speaker_1': 'Yes.'",
        "'speaker_6': 'Thank you. I withdraw that motion. Maybe you should have replaced me when you had the chance. Mr. President, I move that council bill 19, dash 55, be taken out of order.'",
        "'speaker_0': 'All right. That has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_2': 'Black. All right, Brooks.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Flynn. Hi, Herndon. Hi, Cashman. I can reach Lopez. I knew Ortega. I Sussman. Hi, Mr. President.'",
        "'speaker_0': 'I'm secretary. Please close the voting and announce the results. 1111 Eyes Council will 19 0055 has been taken out of order. Now, Councilwoman Sussman, would you like to make a motion to postpone?'",
        "'speaker_2': 'Yes, Mr..'",
        "'speaker_5': 'President. I move that final consideration.'",
        "'speaker_2': 'Of Council Bill 19 0055.'",
        "'speaker_5': 'With its public hearing be postponed to Monday, March 18th, 2019.'",
        "'speaker_0': 'It has been moved and seconded. Are there any questions or comments by members of Council Councilwoman Sussman?'",
        "'speaker_5': 'Yes, it's a.'",
        "'speaker_2': 'Matter of posting time and time to post. We need to push it out a little bit farther.'",
        "'speaker_0': 'Thank you very much. See no other questions or comments, Madam Secretary, roll call.'",
        "'speaker_2': 'Black. All right. Brooks.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Flinn i.'",
        "'speaker_0': 'Herndon, I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Can each. Right. Lopez. I knew Ortega. Sussman. Hi, Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting. Announce the results.'",
        "'speaker_2': '11.'",
        "'speaker_0': '11. Eyes Final Consideration of comfortable 19 0055 with its public hearing has been postponed to Monday, March 18th, 2019. That concludes the items to be called out this evening. Other bills for introduction are ordered published and we are now ready for the black vote on resolutions and bills on final consideration.'"
    ],
    "Zoning Change for 4201 Delaware Street in Globeville.": [
        "'speaker_0': 'Please refrain from profane or obscene speech structure comments to the Council as a whole, and please refrain from individual or personal attacks. Councilman Flynn, will you please put Council Bill 18, Dash 1484 on the floor?'",
        "'speaker_6': 'Yes, Mr. President. I move that council bill 18, dash 1484 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 18 1484 is open. May we have the staff report?'",
        "'speaker_9': 'Thank you, Mr. President, and Council Scott Robinson with Community Planning and Development. This is a request to read Zone 4201 Delaware Street from IAU oh two to see our x eight property is located in Council District nine in the Globeville neighborhood in the 41st and Fox Stationary.'",
        "'speaker_9': 'It's at the northwest corner of 42nd Avenue and Delaware Street, and that's 7000 square feet. Currently has a house on it. Request is to rezone from IAU road to which is light industrial with the billboard use overlay to see our eight, which is urban center neighborhood context residential mixed use with an eight storey maximum height and the'",
        "'speaker_9': 'billboard use overlay would be removed. The applicant is requesting the rezoning to redevelop the property. You can see the property is surrounded by the same IAU oh two zoning immediately, but there is a mix of CMC R, X and CMC in the 41st and Fox stationary as well.'",
        "'speaker_9': 'As I mentioned, the site is currently residential with a mix of industrial residential office, multi-unit, residential and mixed use surrounding it. The subject property is in the bottom right photo and then you can see some of the surrounding properties in the other photos there.'",
        "'speaker_9': 'This application went to Planning Board on November 7th, 2018, received the unanimous recommendation of approval. There was no public comment at that meeting, went to the Land Use Transportation and Infrastructure Committee on January 15th. This year, we received no other public comment on this application.'",
        "'speaker_9': 'In order to approve a rezoning, the city must find that these five criteria have been met. The first criterion is consistency with adopted plans. There are four adopted plans that apply to this property. The first is comprehensive plan 2000.'",
        "'speaker_9': 'As described in your staff report, staff has found the first rezoning is consistent with these six strategies from comp plan 2000, mostly relating to infill development, mixed use and mixed use development around transit stations. The second plan is Blueprint Denver from 2002.'",
        "'speaker_9': 'The concept land used for this property is urban residential, which calls for primarily residential, but with complementary mixed uses at a higher density. It's also in an area of change, which is an area where the city wants to direct additional growth in the city.'",
        "'speaker_9': 'And both 42nd Avenue and Delaware Street are designated locales intended to provide connections from the property to larger streets. Fox Street, BLOCK and a half to the West is a collector and then turns into an arterial two blocks further south and connects down to 38th Avenue, Park Avenue and the I-25 interchange.'",
        "'speaker_9': 'The 41st and Fox Station area plan from 2009 designates this area urban residential to date stories, which is intended for moderate density residential with a range of housing types that support the commercial in the area, which is again consistent with the proposed see our exit zone district.'",
        "'speaker_9': 'And then the fourth plan is the Globeville Neighborhood Plan from 2014, which mostly just reinforces the recommendations of the 29/41 and Fox stationary plan, calling for a diverse, transit supportive neighborhood in the area with a broad base of jobs and housing.'",
        "'speaker_9': 'So staff finds the first criterion that the second criterion is the uniformity of district regulations. Staff finds the proposed rezoning would result in the uniform application of the C r zone district. The third criterion is to further the public health, safety and general welfare of the city.'",
        "'speaker_9': 'Stefan's proposed rezoning would do so by implementing the city's adaptive plans and facilitating the redevelopment of this property in a pedestrian friendly and appropriate manner. The fourth criterion is justifying circumstances. Staff finds the proposed rezoning justified by the changes, change and changing conditions in the area.'",
        "'speaker_9': 'There's been the recently adopted plan in 2014 and there's also been a fair amount of investment in the area with the new transit station that's been constructed but is not yet open. And there has been some new development, new apartment buildings just to the east of this and some other new development in the 41st and Fox station'",
        "'speaker_9': 'area, making this proposed rezoning appropriate. The fifth criterion is consistency with neighborhood context, zone, district purpose and intent. Stefan's proposed rezoning would result in development consistent with the description of the urban center neighborhood context and the purpose and intent of the See Our Zone District, which is intended to apply to residential areas served primarily by collector or'",
        "'speaker_9': 'arterial streets where building scale to date stories is desired. As mentioned, the plans call for to date stories consistent with the district purpose and intent. And while the site is not directly on a collector or arterial, it is a block and a half from a collector in an area that is served by collectors and arterials.'",
        "'speaker_9': 'So staff finds the fifth criterion is met and recommends approval. I'll be happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. We have two individuals signed up to speak this evening, so if you signed up to speak on this item, I'd ask that you come to the front row. First up, we have Isaiah Salazar. Good evening, council members.'",
        "'speaker_1': 'I'm here on behalf of the ownership group of 42 A1, one Delaware Street here to answer any questions. We are very.'",
        "'speaker_0': 'Excited about this.'",
        "'speaker_1': 'Smaller property we have in the area that we are looking to redevelop. We're looking at building small seven townhomes, hoping to break ground later this summer and very excited for the future of what hold in this neighborhood. This will be one of the first newer townhome projects in this area of the Fox Street neighborhood.'",
        "'speaker_1': 'We're very excited to see how the light rail continues to change the neighborhood once it does open up. There's been a tremendous amount of rezoning efforts going on, on multiple properties in the area with not a lot of action going on yet, but a lot of a lot of people starting for future development.'",
        "'speaker_1': 'And we're hoping to be a great townhome addition to the neighborhood.'",
        "'speaker_0': 'Would you mind stating your name for the record?'",
        "'speaker_1': 'Isaiah Salazar.'",
        "'speaker_0': 'Thank you very much. All right. Next up, Jesse Pierce.'",
        "'speaker_8': 'Jesse Pierce represented for Denver Homicide, a low black star action moment for self-defense and positive action commitment for social change. And I'm also an at large candidate for 2019 May election. We are against this, as has been stated numerous times.'",
        "'speaker_8': 'And involved in this area, this property, this area, this this area. Globeville is under a rapid gentrification. And this is just another rezoning that reinforces that this property is not going to be for those that live in the neighborhood, is not going to be affordable.'",
        "'speaker_8': 'There is no Amaro level listed on any of these properties. Seven townhomes in the already gentrifying neighborhood. Yeah, we're definitely against this. When you sweep the council, like they sweep the homeless every night. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council on this item? Councilman Brooks.'",
        "'speaker_4': 'Yeah. Just a quick question, Mr. Salazar. You guys owned the Regency as well with student housing?'",
        "'speaker_1': 'That is correct, yes.'",
        "'speaker_4': 'And how many students are currently in there?'",
        "'speaker_1': 'Over 900 students live in the neighborhood or in our complex.'",
        "'speaker_4': 'Okay. And can you just tell you know, I know you and your family do a lot of work in the community as far as real estate in your own life. Can you just share a little bit about that?'",
        "'speaker_0': 'Yeah. So my family.'",
        "'speaker_1': 'Purchased the Regency Hotel in 2000 for under the impression of not knowing exactly what we wanted to develop in the neighborhood yet. And we found that there was a large need at the time for a very a campus to have some sort of housing on site.'",
        "'speaker_1': 'Unfortunately, we're not on site, but we own and operate a shuttle service that takes kids to and from campus Monday through Friday. And we have developed we were able to renovate the entire inside of the former hotel into a college dormitory.'",
        "'speaker_1': 'So now gives the three schools honorary a campus, a dorm style of living. In 2014, we developed the north parking lot. That was a vacant parking lot that this property we're looking to resell and kind of overlooks, which was just an empty parking lot.'",
        "'speaker_1': 'We reasoned that we the actually reason that and we developed that into more traditional apartments three bedroom, three baths, conventional apartment style living. But it's all part of the Regency campus. And that is kind of a continuum of student housing that we have seen.'",
        "'speaker_1': 'And it's been very successful, very great for the neighborhood. It's really cleaned up the neighborhood from from what the hotel was initially. And we've also developed a lot of other. Parcels in the neighborhood. My my sister actually runs the doggie daycare service at 42nd and a lady that has over 50 employees there.'",
        "'speaker_1': 'It's a great doggie day care complement to the Sunnyside in the Highlands neighborhood. Uh, extremely busy. And we've also developed the the Fox Street shops is what we call it in house, but it's got the crafty fox, it's a restaurant, there's a yoga studio, a physical therapist, as well as a small liquor boutique liquor store.'",
        "'speaker_4': 'Okay. I'm just curious, on the Regency, is there any plans? I'm concerned about the 900 students. Any plans to redevelop that or you guys want to continue to preserve that?'",
        "'speaker_1': 'No, as of right now, we are our goal is to continue to preserve the student housing in that neighborhood. Unfortunately, the Regency.'",
        "'speaker_0': 'Property is currently under the old.'",
        "'speaker_1': 'Zoning, which we are looking at to rezone that this upcoming year here soon just to make it a conforming use as well as to help out with the parking requirement. Okay. But our full intention is to continue student housing in the neighborhood.'",
        "'speaker_4': 'And on this particular project, what have you calculated your linkage fee that a go to affordable housing.'",
        "'speaker_1': 'For the townhome project? No, we have not. I think it falls under that requirement, but I have to look into that.'",
        "'speaker_4': 'No. If it's if it's a new build. So if you could just. I'll confirm that. Yeah. Ortega is probably going to. Councilman Ortega ask a question, but just figure out the amount of square footage off of about 50 foot.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_3': 'Thank you, Mr. President. My question is for Scott Robinson from planning. So my question is about. Have we, as a city taken a look at this area in terms of how much more new development we can get? I know that there is the next step study that is going on in this area that's part of some of'",
        "'speaker_3': 'the the bigger parcels, particularly the Denver Post site. Where we're basically needing to look at that intersection at 38th and Fox High 25 Park Avenue. Can you just kind of give us an update of where things are at with that whole process?'",
        "'speaker_3': 'And does it include anything related to drainage?'",
        "'speaker_9': 'So I don't know where we are on drainage. I don't know what we're looking at for that. But as far as the next substudy, that's looking at the infrastructure needs based on the projected build out. In the meantime, we're working on rules and regulations to sort of set a cap on the development based on what the current'",
        "'speaker_9': 'infrastructure can handle. You mentioned the intersection, so based on what things can handle right now so that once we hit that cap, we'll hold off on development until we get the new infrastructure in place to handle additional development.'",
        "'speaker_9': 'We're also looking at a an overlay to limit the amount of parking in the area that we're working on right now.'",
        "'speaker_3': 'Any idea on when that next step study would be available?'",
        "'speaker_9': 'I don't know. Sorry.'",
        "'speaker_3': 'Okay. So in the meantime, we're continuing to take applications from the area that is basically increasing the density in every one of the applications that we've seen. This one seems to be much smaller in scale than all the rest of them that we have seen come through.'",
        "'speaker_3': 'But I'm just curious kind of where we're at with the bigger picture, because we've got one road into this site. And I did see on the application, I believe it was for the other one, that it did include looking at the the little two, two lane road, the two lane unimproved road that goes over I-25 and connects'",
        "'speaker_3': 'to Globeville, which should not be included as one of the access points into this area. And so I think, you know, as a city, we just keep bringing applications forward without really looking at, you know, how we're addressing whether or not the infrastructure can handle the volume of what is going to be there ultimately.'",
        "'speaker_3': 'And at some point, we as a body should be concerned about that, because if we're putting more development in there than what the roadway can handle and, you know, the assumption is the next step study identifies perhaps what some of the solutions are and parking to some degree addresses part of that.'",
        "'speaker_3': 'But, you know, one of my concerns is if if I'm somebody developing in the area and I'm not the first project in and you're capping how much parking can go in and I'm the last project to develop. No banker is going to finance my project if I have no parking and it's already been utilized by all the'",
        "'speaker_3': 'other projects. So I think looking at that big picture of who's who's managing all of that is really important for us to be paying attention to, even though it's not the level of detail that we as a body get to see.'",
        "'speaker_3': 'So I'm a little concerned about that. So I appreciate the fact that you all are working on the next step study and look forward to getting some information on when that will in fact, be available. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. Scott, maybe could you address for me just briefly the the district that's being applied for allows update stories. This is just one small lot where there's only a single family house right now. Correct. The way I see that from according to the map.'",
        "'speaker_6': 'And so I'm just concerned that this too dense of a zone, did we look at other zones that would accomplish the same purpose of redevelopment? Because as we develop this under the allowable density that this district allows, as change continues to occur on Delaware and on Aladdin, that whole Fox Island, once once we get the train running'",
        "'speaker_6': 'and stopping at 41st and Fox Station, it would seem that that block would justify a greater density. And if a project is built and already in place and under utilizes the entitlements. I'm just concerned about the future development here.'",
        "'speaker_6': 'So how did we arrive at the eight story classification and did we look at any others?'",
        "'speaker_9': 'Yeah. So the the eight stories was the request of the applicant. Okay. So they can perhaps speak to why they chose its story as the plan, as I mentioned, recommended to date stories. Mm hmm. So we evaluated the request for eight stories, found it consistent with the plan and the other four criteria.'",
        "'speaker_9': 'And so that's why we're recommending approval. But, you know, as far as whether you can develop eight stories on the lot or whether it's underdeveloped, you know, it's something for the applicant to to worry about.'",
        "'speaker_6': 'Okay. So we we didn't look at any alternatives.'",
        "'speaker_9': 'Again, they they requested eight stories. We found it consistent. So, yeah, we didn't try to steer them than anything else.'",
        "'speaker_6': 'All right. Thank you, Mr. President. That's all.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Councilman Brooks, you back up for. Yeah.'",
        "'speaker_4': 'I just wanted to respond to. Councilman Flynn. But specifically, Councilwoman Ortega, I got to tell you that, you know, I think the concern is right. Looking at the rezonings, but actually, you know, working with CPD, specifically our former colleague Chris Nevitt, and working with the building department, the power is actually in their control and now they are'",
        "'speaker_4': 'because of the studies that they have done and because now that they they know a number of cars are coming into the area, they're putting certain requirements on building developers and owners. And so one of them was the max maximum parking requirement.'",
        "'speaker_4': 'We had the community push really hard against that, and we're giving them a a year to get things under control. And we're probably going to have parking maximum and other requirements in this area because of that density that you talked about.'",
        "'speaker_4': 'And so I'm not sure the answer is in zoning. I think the answer is in and building requirements and the number of units and parking requirements in the area. And so, you know, that conversation is hard, but I encourage you guys to reach out to almost say Councilman Nevitt, Chris Nevitt and our Field Artillery office.'",
        "'speaker_4': 'And they have done an incredible amount of work on making sure they know exactly how much is coming in, per permits being poured. And they're not letting people just build whatever they want to. There are a lot of requirements things.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Seeing no other question. The public hearing for Constable eight dash 1484 is closed. Are there any comments by members of council? Seeing none. I will just think staff are putting together a comprehensive staff report.'",
        "'speaker_0': 'I think it's clear that this meets the criteria for rezoning and I will be supportive. Madam Secretary, Roll Call.'",
        "'speaker_1': 'A.'",
        "'speaker_2': 'Black Eye Brooks.'",
        "'speaker_0': 'By.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'By.'",
        "'speaker_2': 'Herndon Cashman.'",
        "'speaker_0': 'By.'",
        "'speaker_2': 'Kenny Lopez. I knew Ortega by Susman. Mr. President.'",
        "'speaker_0': 'Hi. I'm secretary. Please close the voting. Announce the results.'",
        "'speaker_2': '11 eyes.'"
    ],
    "Rezoning of 4055 Elati Street in Globeville.": [
        "'speaker_0': '11 eyes. Comfortable. 18 Dash 1424 has passed. Councilman Flynn, will you please be accountable? 18 Dash 1540 on the floor.'",
        "'speaker_6': 'Yes, Mr. President, I move that council 18 dash 15 four to be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded the public hearing for Council Bill 18, Dash 1418. Dash 1540 is open. May we have the staff report?'",
        "'speaker_9': 'Yes. Thank you again, Mr. President and Councilor Scott Robinson with Community Planning and Development. This is a request to rezone 4055 LRT Street from IAU oh two to see annex it. This property is also located in Council District nine in the global neighborhood in the 41st and Fox stationary.'",
        "'speaker_9': 'This is at the southwest corner of 41st Avenue and Lottie Street. Property is about 19,000 square feet currently used for outdoor storage. The quest is to go from IAU, you oh two, which is light industrial with the billboard use overlay to see Annex eight Urban Center Neighborhood Context mixed use with an eight storey maximum height and again'",
        "'speaker_9': 'removing the you oh two billboard use overlay. The applicant is requesting the rezoning to develop the property. Property is surrounded on three sides by the same iau o two with c r x 12 across lrt street to the east, and then again a mix of CMC's, S.R. Ex and CMC in the 41st and Fox station area along'",
        "'speaker_9': 'with the property currently shows up as vacant, as used as outdoor storage, a mix of industrial office and multi-unit residential in the surrounding area. The subject property is the bottom right photo and then some of the surrounding properties in the other photos.'",
        "'speaker_9': 'This went to Planning Board on December 19th, 2018. I received a vote of 7 to 1 recommending approval. There was no public comment at that hearing. The Land Use and Transportation and Infrastructure Committee reviewed this on January 15th of this year, and there is a letter of support from Globeville Civic Partners in their staff report.'",
        "'speaker_9': 'And that's the only public comment we've received. In order to approve of rezoning, the city must find that these five criteria are met. The first criterion is consistency with adopted plans. There are four plans that apply to this property.'",
        "'speaker_9': 'The first is comprehensive plan 2000. As described in the staff report, staff finds that the proposed rezoning is consistent with these six strategies from campaign 2000, mostly relating to infill development, mixed use development near transit stations. The second plan is Blueprint Denver from 2002.'",
        "'speaker_9': 'The concept land use in Blueprint Denver. This for this property is transit oriented development, which calls for a mix of uses at mid to high densities. This is also in an area of change where the city intends to channel additional growth and both LRT Street and 41st Avenue are designated locals providing connections from the property to larger'",
        "'speaker_9': 'streets. In Fox Street, half walk to the West is a collector and then turns into an arterial a block south at 40th Avenue, connects down to 38th Avenue, Park Avenue, which are major arterials and the I-25 interchange. The third plan is the 41st and Fox stationary plan from 29.'",
        "'speaker_9': 'The Disney land use for this property is pedestrian shopping district to date stories, which calls for a ground floor, retail and mixed use with prominent street facing entries, which is consistent with the proposed Sea Max eight zone district.'",
        "'speaker_9': 'And the fourth plan is the Globeville Neighborhood Plan from 2014 again, which mostly just reinforces the recommendations of the 41st and Fox station area plan, calling for a mixed use development around the station so staff finds the first criterion is met.'",
        "'speaker_9': 'The second criterion is uniformity of district regulations. Staff finds the proposed rezoning would result in the uniform application of the C Annex eight zone district. The third criterion is to further the public health, safety and general welfare of the city.'",
        "'speaker_9': 'Staff finds that the first to do so by implementing the city's adopted plans and facilitating the development of the property in a pedestrian friendly manner appropriate for a transit oriented development. The fourth criterion is justifying circumstances. Staff finds the proposed rezoning is justified by the change in changing conditions in the area.'",
        "'speaker_9': 'The plan adopted in 2014, as well as the recent investments in the area with the transit station and some of the new development that has already been constructed in the area, making this an appropriate rezoning. The fifth criterion is consistency with neighborhood context, zone, district purpose and intent.'",
        "'speaker_9': 'Staff finds the proposed rezoning would facilitate development consistent with the description of the urban center and neighborhood context and the purpose and intent of the C and Zone District, which is intended to apply to areas and intersections served primarily by arterial streets where building height of two date storeys is desired.'",
        "'speaker_9': 'As I mentioned, the plans call for to date stories here and again. While the property is not directly on an arterial street, it is in an area served by arterial streets. And so staff finds all five criteria met and recommends approval of answering questions.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening on this item. If you are one of those three people, I would ask that you come up to the front row so that we can get through everyone as quickly as possible.'",
        "'speaker_0': 'First up, Bruce O'Donnell.'",
        "'speaker_1': 'Thank you, Mr. President, of members of council. My name is Bruce O'Donnell. I'm at 386 Emerson Street in Denver, and I'm the owners representative for this rezoning request this evening. And I'm joined tonight by the applicant himself who will also speak.'",
        "'speaker_1': 'This is an excellent implementation step of the city's tod plan, the 41st and fox station area plan, the Globeville Neighborhood Plan and Blueprint Denver. These plans prescribe eight storey mixed use zoning at this location. We have a letter of support from Globeville.'",
        "'speaker_1': 'Civic Partners and CPD staff and the Planning Board both recommend approval to City Council for this this evening. You also should know that it's a vacant site today, and so reinvestment is a good opportunity for this vacant site.'",
        "'speaker_1': 'And with that, I'm going to request that city council vote to approve Council Bill 18, dash 1540 rezoning 4055 allotted to CMC and I'm available. Available? Pardon me to answer any questions. Should you have any? Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chris Hudson.'",
        "'speaker_1': 'Good evening. My name is Chris Hughton. 1630 Welton Street, Denver, Colorado. I work for Highland Development Company. We really think this would be a great opportunity to forward the goals of Denver through rezoning this property. Our company is really focused on what we call attainable housing.'",
        "'speaker_1': 'And so we'd like to is we're studying as far as the linkage fees goes for affordable housing that we would actually build our units within this development. We feel that goes right in line with our goal as a company to provide attainable housing alongside with affordable housing.'",
        "'speaker_1': 'So I would request that the Council approves rezone from industrial to CRM eight. And Bruce and I are here for any questions.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_8': 'Jesse Pierce, represented for Denver Homicide, Low Black Star Action, Movement for Self-defense and Positive Action A Commitment for Social Change. And I reside in Albert Brooks District. We are all right. We are still against this. This literally sounds like another rhino redevelopment to me.'",
        "'speaker_8': 'And every time you have these rezonings, you don't listen to the public. You don't invite the public to these meetings. The public is not able to make these meetings because of the time they're in rush hour traffic. They're not able to make these meetings.'",
        "'speaker_8': 'This literally streams another rhino redevelopment to me. I hear attainable. That's now in the lexicon. I wonder why it's attainable for who this whole neighborhood is being gentrified. People are being displaced throughout this whole neighborhood of Globeville. And you're sitting up here saying that this is going to be attainable housing and that this is going to include'",
        "'speaker_8': 'the community. I don't see it. So I want to know what the AMA level is going to be for this property. I want to know exactly how many units are going to be built that are actually going to be affordable between zero and 30%.'",
        "'speaker_8': 'Ami. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council? Councilman Brooks.'",
        "'speaker_4': 'Yeah. Just wanted to know. One member of planning board voted against it. It was a.'",
        "'speaker_9': 'Yes. One member of planning board voted against it. He felt that CMC was more appropriate and that C and X8 was therefore not consistent with the plan recommendations.'",
        "'speaker_4': 'Plan recommendations have. Can you pull that up again? I thought it was c r x for this site.'",
        "'speaker_9': 'Now it seems x, so it calls for pedestrian shopping district.'",
        "'speaker_7': 'Okay.'",
        "'speaker_4': 'And, and, and to just do the explaining again on CMC why why did he the person feel like that was.'",
        "'speaker_9': 'Yeah. So the, the plan calls for this pedestrian shopping district, pedestrian friendly design with you know transparency and built up to the street which is really the intent of the see MI eight as described in the staff report.'",
        "'speaker_9': 'There's really not much difference in what actually gets built between the CMC and the Sea and so staff found that both would be consistent and the CMC, not the planning criteria, but the the planning board member disagreed.'",
        "'speaker_4': 'Okay, great. And then just a developer question for you. So on a lot of these in this 41st and Fox, we don't get comments from the civic partners. Globeville cares, but the civic partners wrote a letter support and I I'm sure it's in the staff report some more but I couldn't find out what was the reason they'",
        "'speaker_4': 'supported this project.'",
        "'speaker_1': 'Do you have a letter? I'm not sure. Bruce may have the letter. Yeah. Thank you, Councilman. So we met with them and spoke with them and walk them through the the rezoning. They were the one R.A. that was willing to engage.'",
        "'speaker_1': 'And basically they felt that it was consistent with the plans for the area. And there are justifying circumstances in their seek reinvestment in this area and felt it was a good fit. And we're more than happy to write the letter of support.'",
        "'speaker_4': 'Okay. And you guys are going to take the equivalent of the linkage fee and build those units out. Is that what the commitment is?'",
        "'speaker_1': 'So as Chris said, that that's being studied right now and it fits in with their business plan. We've done the calculations in for the building that's in conceptual design right now. The formula would yield three units.'",
        "'speaker_4': 'So there are a lot of there are a lot of individuals who, you know, we've done a lot of rezonings in this area and have seen few build in this area. Do you have a timeframe when you're thinking about.'",
        "'speaker_1': 'As far as timeframe goes? You know, I would I would say in the next. Within the next year, we would start.'",
        "'speaker_4': 'Start construction, correct? Okay. Yeah, we haven't you know, as you know, you're in the area. I haven't seen any any real dirt turning and moving. And so I'm wondering if a lot of this is speculative.'",
        "'speaker_1': 'Yeah. No, I mean, we're not a speculative developer. Yeah. We've really, really been focused on finding areas in top areas that that's that's really the plan, the areas that are going to use density and promote public transit. And we just think that that we can have lower price points, but we can also build in the affordable aspect'",
        "'speaker_0': '. Yeah. Thank you. Thank you. Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_3': 'Councilman Brooks asked my questions. Thank you.'",
        "'speaker_0': 'Thank you. All right. Seeing no other questions. The public hearing for Council 18 Dash 1540 is closed. Are there comments by members of council? Councilman Brooks. All right. See no other comments. I'll again say thank you to the staff for putting together a comprehensive staff report.'",
        "'speaker_0': 'I think it's clear that this meets the legal criteria for rezoning, and I will be supporting tonight. Madam Secretary, Roll Call.'",
        "'speaker_2': 'Black Eye Brooks.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Herndon Cashman. I can reach Lopez. I knew Ortega. I assessment I. Mr. President.'"
    ],
    "Rezoning of 3411 Albion Street from Single-Unit to Mixed-Use.": [
        "'speaker_0': 'All right. Madam Secretary, please close voting. Announce the results. 1111 eyes constable 18 dash 1540 has passed. Councilman Flynn, will you please put council bill 18 does 1541 on the floor?'",
        "'speaker_6': 'Yes, Mr. President. I move that council bill 18 dash 1541 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. It's a public hearing for Council Bill 18. Dash 1541 is open. May we have the staff report?'",
        "'speaker_5': 'Yes. Thank you. Good evening. I'm Courtney Livingston with the Planning and Development. This is a request to rezone a single property at three four 3411 Albion Street from ESU D X to IMX to x. The property is located in Council District eight in the Northeast Park Hill statistical neighborhood.'",
        "'speaker_5': 'The subject property is located at the northwest corner of the intersection of Bruce Randolph and Albion Street. One half block east of Colorado Boulevard. The site is approximately 31,000 square feet in size and has an existing 7100 square foot brick building on site, which was previously occupied by a church.'",
        "'speaker_5': 'The rezoning to AirMax two X has been requested to allow redevelopment for the property as the congregation is relocated. The site is currently zoned Eastside Tax, which is a single unit residential district that allows both the urban and suburban building forms.'",
        "'speaker_5': 'Earmarks two X can be found to the east, east three X zoning and APD is found to the west. In the south is ESU DCS. The subject property was used as a church and the surrounding properties to the south and east are also places of worship.'",
        "'speaker_5': 'The property directly to the north was once a restaurant and is now vacant. Generally, there's a mix of commercial uses you'll find along Colorado Boulevard, and then there's various types of residential densities and residential uses found interspersed throughout the neighborhood to the east.'",
        "'speaker_5': 'So these are photos, this site and the existing building. And then here are some photos of the immediate surrounding context with the multi-unit residential to the northeast of the site, a converted single unit Victorian home that was converted to the resident restaurant use that's now vacant.'",
        "'speaker_5': 'We also have the places of worship found directly to the east and to the south on site, and then you have the gas station to the west there. So this application was noticed according to code requirements. In December, the planning board voted 6 to 1, recommending approval of the rezoning.'",
        "'speaker_5': 'Representative of the Northeast Park Hill Coalition spoke at the Planning Board hearing in opposition to the rezoning with concerns related to the provision of affordable housing and the development paying a linkage fee rather than to providing affordable units at that time.'",
        "'speaker_5': 'The applicant, Northeast Park Hill Coalition and the Denver Islamic Center voluntarily entered into mediation after the planning board hearing. Discussions at the mediation focused around the provision of affordable housing. Additional details about the mediation can be found in the staff report and attached to the staff report.'",
        "'speaker_5': 'In terms of public comments received by CPD prior to today, there were eight letters of support for the rezoning. There are 29 form letters opposing rezoning, 104 signatures on a petition letter in opposition, as well as 200 signatures on a Change.org petition in opposition of the rezoning.'",
        "'speaker_5': 'There was a protest petition submitted last week related to this rezoning. We reviewed the protest petition and found that the signatures were not the valid signatures were not obtain, and it did not constitute a valid legal protest. So to approve a rezoning council must find that the proposed change meets five criteria from the Denver zoning code.'",
        "'speaker_5': 'I'll step through each one. How? Each one? So first, with consistency with adopted plans, we have comprehensive Denver 2000 blueprint Denver 2002 and the Park Hill Neighborhood Plan of 2000. In terms of the comprehensive plan, the proposed amendment will enable walkable mixed use development encourages quality infill development through its design standards that is consistent with the character'",
        "'speaker_5': 'of the surrounding neighborhood. The proposed district is proposed zoned district is consistent with the comprehensive plan 2000 strategies. So in Blueprint Denver 2002, the site has a concept land use of single family residential and these areas single family homes are the predominant residential type.'",
        "'speaker_5': 'Although the proposed Imac's two zone district will allow for more than just residential uses, its limited application will still maintain the character of the low scale district. It's also identified as a area stability blueprint. Denver notes that the area's stability is to maintain the character of the area while accommodating some new development and redevelopment.'",
        "'speaker_5': 'The application asserts that this area should be considered as a reinvestment area and these areas have opportunities for reinvestment through modest infill. Blueprint also notes that in areas of stability, the appropriate transitions should be used as a tool for ensuring compatibility of development.'",
        "'speaker_5': 'The IMX Chest X District includes building form, skills, setback and use limitations that ensure compatibility. The proposed rezoning would support limited redevelopment as inconsistent with the blueprint Denver Areas of Stability Recommendations. So in Blueprint Denver, Bruce Randolph is shown as a residential collector and Albion Street is an designated local.'",
        "'speaker_5': 'The proposed rezoning is consistent with the plan's recommendations of support for limited redevelopment on a corner of a collector and a local street embedded in a preexisting neighborhood corridor. So then we have the Park Hill Neighborhood Plan of 2000.'",
        "'speaker_5': 'It was adopted by council in 2000. Implies this subject property goals generally discuss maintaining character mix of housing types and densities, minimizing visual impacts and maintaining enhancing the viability of the residential and commercial uses along Colorado Boulevard. The rezoning will allow for low skill multi-unit dwellings, limited commercial, which would support the viability of Colorado Boulevard and provide'",
        "'speaker_5': 'a compatible mix of housing types. The proposed rezoning of IMAX to EX is consistent with the goals of the plan because the allowed building forms, the design standards and the use limitations of that zoned district ensure compatibility with the surrounding neighborhood.'",
        "'speaker_5': 'Staff also finds that the proposed rezoning meets next to criteria that the rezoning will result in a uniformity of district regulations and will further the public health, safety and welfare through its implementation of adopted plans. And it will also allow for the compatible redevelopment that allows more opportunities to live, work and play within the Park Hill neighborhood'",
        "'speaker_5': '. The application meets the justifying circumstance criteria by identifying change or changing conditions. The application calls out the recent development in the neighborhood of those townhomes across the street. Additionally, the commuter rail station at 40th in Colorado is less than a mile away, and it came online in 2016.'",
        "'speaker_5': 'And finally, the proposed redevelopment is consistent with the urban edge description because of its low scale multi-unit commercial areas embedded in residential areas. The rezoning is consistent with the general purpose, as is an existing neighborhood site, and promote a pedestrian, skilled, walkable area.'",
        "'speaker_5': 'Finally, there is consistency with the intent of the mix to district as it's located on the corner. It's limited in nature to just one parcel and with low scale and low intensity uses within an existing neighborhood. In conclusion, CPD recommends approval based on finding all review criteria have been met.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you very much. We have eight individuals signed up to speak this evening, so if we can make room in this front bench, I'm going to call the first five up Matthew Kingsbury, Glenn Goldberg, Dr. Robert Davis, Jessie Pearce and Abdul Rahim Ali.'",
        "'speaker_0': 'If you want to come up to the front, Matthew Kingsburg, you are up first.'",
        "'speaker_7': 'Mr. President, for council members, my name is Matthew Kingsbury and the pastor of Parkhill Presbyterian Church at 3411 Albion St Grace Church in Pearce from God the Father and our Lord Jesus Christ. Amen. Our congregation came to the difficult decision to sell our property about two years ago.'",
        "'speaker_7': 'The this property at 3411 Albion Street has been owned by the congregation since the early 1950s when we moved there from. 26 and Downing Street. I've been the pastor there since 1999 and help the congregation work through this process.'",
        "'speaker_7': 'One of the reasons that we determined to make the move is that over the last 30 years, we've had no new members come from within the immediate community. Our last member from the Park Hill neighborhood moved out into an assisted living facility about 15 years ago.'",
        "'speaker_7': 'Since that time, we've seen growth from outside the neighborhood. And so we don't we've not been able to bring in anybody from the neighborhood, haven't had influence from people in the neighborhood and worshiping with us. We think that selling the property and so that it can be developed into residential housing would benefit the neighborhood.'",
        "'speaker_7': 'Right now, there's an awful lot of drug dealing, vandalism, vagrancy going on on our corner, things that you don't want your kids finding in our church parking lot, drugs and human waste products, for example. So we think that having residents there can help clean up that a little bit just by having more people in the area.'",
        "'speaker_7': 'We also want to point out that or I'd like to point out that as we've been negotiating with the with the neighborhood and through the mediation process, hearing their concerns that the congregation made the decision to lower the cost of what rather price what we would receive for selling our property in order to provide affordable housing.'",
        "'speaker_7': 'The congregation, many of the members of the congregation at that meeting, one we agreed to do so, stated that they wanted to be able to give up some funds that we would be able to use to further our mission in a new location in order to help those who are underprivileged in the Denver community, which we will'",
        "'speaker_7': 'now be leaving so that we can move to a places closer to where our members currently live. We want to point out that the planning board and the planning was a planning staff, so I can't keep track of all the meetings I've been to and who everybody is over the last number of months.'",
        "'speaker_7': 'They're all in support of this. And so for these reasons, and I could keep on going, I'm a preacher, I want to recommend that the council does approve this change in zoning. And I will be here if you have any other questions.'",
        "'speaker_0': 'Thank you. Next up, Len Goldberg.'",
        "'speaker_6': 'Good evening, members of City Council. My name is Len Goldberg. I'm the developer and I'm here just to answer any questions you might have during the process.'",
        "'speaker_0': 'Thank you. Next up, Dr. Robert Davis.'",
        "'speaker_1': 'The Evening City Council. I stand in support of this rezoning for a couple of reasons. The first is that we were able to come to a an agreement to put four affordable units in the development. And the second one being that we are going to promote the units in community publications so that we can attract a a'",
        "'speaker_1': 'larger swath of the community, both economically and racially. And I hope that this becomes a model for future development projects that we will build upon this to make sure that as we are developing in the city, that we're doing so with an eye towards being more inclusion based.'",
        "'speaker_1': 'But I do have a few concerns that I want to speak about, even though I stand in support of this and hope that it will be voted tonight. The first concern is I feel that the process that the city has currently is very favorable toward the developer and does not encourage community input.'",
        "'speaker_1': 'And so I'm asking the city council that as you look toward the future, that you become more conscientious about the needs and the desires of the individuals who currently live there. Currently, Minister, they're currently working to build up.'",
        "'speaker_1': 'It's nice to have people come from the outside, but we need to hear more of the voice of the individuals who are actually living in the community. We need to be intentional about seeking out those voices and hearing them as the second thing that I'm concerned about is that we're not really addressing the larger issue of affordable'",
        "'speaker_1': 'housing in Denver. Putting four units in the park community does not really address the larger problem. We're kind of trying to empty the ocean with a teaspoon and we're not getting in the way. So I'm hoping that this body will will take that into consideration.'",
        "'speaker_1': 'The last thing is this process did not lateral naturally lend itself to promoting racial diversity. And we put a little Band-Aid on it by asking that the sale of these units be publicized in community newspapers such as Fivepoint News and the Body of Christ and the Denver Weekly, etc. But this that was not a natural part of'",
        "'speaker_1': 'this process, and nor can that be the end of this process. So I'm really admonishing and asking that this body will be more intentional about a including the community intentional be about making sure that as we're doing these developments, as we voted to previous ones tonight, that we are attracting people from various economic and racial groups.'",
        "'speaker_1': 'And with that, thank you very much.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_8': 'Jessie Paris represented for Denver Homicide, Low Black Star Action Movement for Self-defense and Positive Action Commitment for Social Change. And I'm also an At-Large candidate for the May 2019 May election, and I reside in Council Brooks District. I was against this.'",
        "'speaker_8': 'But after hearing the words of the community that I was born and raised in, I grew up in this neighborhood. I went to Smith and Hallett. I resonate with the residents of this neighborhood, predominately the black and brown neighbors that feel that they do not.'",
        "'speaker_8': 'Are included.'",
        "'speaker_1': 'In the city.'",
        "'speaker_8': 'Planning and development that is rapidly happening throughout this whole town. There's rapid gentrification going on and the community's input is not being heard. And the community has come out today and let you know that. So I'm not just speaking, but the whole community is speaking.'",
        "'speaker_8': 'And I hope that you hear us loud and clear. So with that being said, we are for this. But as the previous speaker stated, you need to take it to full consideration the input of the community. And think about the decisions that you make before you make them.'",
        "'speaker_8': 'Because we don't need any more unintended consequences. The city has a housing crisis. This is the least that could be done. These are affordable units. I want to know exactly what the ammo level is going to be for these, and I won't know exactly how many units.'",
        "'speaker_8': 'Who is going to be residing in this property and.'",
        "'speaker_0': 'When the.'",
        "'speaker_8': 'Groundwork for this is going to begin.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Abdul Rahim Ali.'",
        "'speaker_1': 'Good evening. City Council. This has been a arduous task over the last over the last month. And we we were happy that we came to a resolution. We've been able to speak with the mediator and and go through mediations.'",
        "'speaker_1': 'And we've had personal conversations with Mr. Goldberg. And we feel that this resolution that we are coming to now is fair and we support it. But we we would be remiss if we didn't mention the fact that affordable housing is an issue in city of Denver, not just park here, but in the city of the entire city'",
        "'speaker_1': 'of Denver. This is the issue. But this particular process has brought consequences, good consequences, where we have actually Christians, Muslims and Jews working together. And that's historic in itself. We hope that you consider this resolution that. We go forward in support of this housing and that this is just the beginning and this is just the first step'",
        "'speaker_1': '. And we think that there will be many opportunities in the future for the city of Denver and particularly Park Hill and diversifying the community and park here.'",
        "'speaker_0': 'Thank you. Thank you. I'm going to call the last three up so if we can make a room for them in that front bench. Patrick Key David more of it's and Bruce O'Donnell if you want to come up to the front and Patrick here up next.'",
        "'speaker_0': 'A tricky. All right, David. More of its.'",
        "'speaker_1': 'Thank you very much for your time. And if David more of its own property directly across from the the church lot definitely in favor of the the zone change we think that the the project fits the scale of the neighborhood.'",
        "'speaker_1': 'We think that the the price point though some may think that it is high for the neighborhood. It actually does fit in with the proximity of the neighborhood and some other projects down Martin Luther that are that are currently being developed and being finished.'",
        "'speaker_1': 'So we think it fits the scale as well. I was able to talk to a few of the neighbors, the letters that you guys actually have in your packets. I was able to talk with them to get them to to kind of discuss the project.'",
        "'speaker_1': 'And they're not just in favor but actually kind of excited about it having a new development across the street. And we think that it all fits in. So with that said, I hope that you guys all vote in favor for the project.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Bruce O'Donnell.'",
        "'speaker_1': 'Thank you, Mr. President, a members of council. I'm Bruce O'Donnell again at 386 North Emerson in Denver. And I'm the owners representative on this rezoning request. As you know from the testimony this evening, there is a staff recommendation of approval and also planning board recommending approval.'",
        "'speaker_1': 'There is good plan support and justifying circumstances for this rezoning request. This is a mostly vacant and largely underutilized site bordering Colorado Boulevard. It's zoned for single unit. Across the alley is a car wash and a gas station and fast food on the other side of the street on the east side of Alby.'",
        "'speaker_1': 'And this entire block is already zoned m x to ex the exact zone designation that we're requesting. And it supports townhomes exactly like we are proposing to build here. And so those entitlements have been in place and been successful for some time.'",
        "'speaker_1': 'You mentioned or you heard earlier in the staff report that there had been significant opposition to this rezoning request, and that was true until we sat down with immediate neighbors and the registered neighborhood organizations. And so today we have letters of support from nine immediate neighbors.'",
        "'speaker_1': 'We also have a letter that's in your file from the Northeast Park Hill Coalition, the R.A., recommending that you vote in favor of this rezoning and supporting the rezoning. And then tonight, I was able to hand the end to the council secretary.'",
        "'speaker_1': 'And there are officially in your the records of this meeting, letters of support from the Northeast Denver Islamic Mosque and the Denver Park Hills Seventh Day Adventist Church. And you've just heard the representatives of those religious institutions speak in favor of and requesting that you approve this rezoning.'",
        "'speaker_1': 'So with that, I'm going to sum up by also requesting that you vote to approve Council Bill 18 1541 rezoning 3411 Albion Street to M x to x. This support largely came through work we did over the past couple of weeks with CPD and OED to come up with an agreement we're working on to build affordable units'",
        "'speaker_1': '. And the plan is to build for deed restricted affordable units consistent with Ovid's formulas and calculations. And we're available to answer any questions. Should you have any. Thank you.'",
        "'speaker_0': 'Thank you. All right. That concludes our speakers. Are there any questions from members of council? Councilwoman Ortega.'",
        "'speaker_3': 'Thank you, Bruce. I'm not sure if you're the one to answer this question, but what will the project require for tax credits in order to meet the affordability on the units it.'",
        "'speaker_1': 'No, it will not.'",
        "'speaker_3': 'And then lastly, how how will the agreement be enforced?'",
        "'speaker_1': 'So right now we have a memorandum of understanding with the Northeast Park Hill Coalition and the mosque in the Seventh Day Adventist Church are in and the applicants are all parties to this memo you and there's an exhibit to the memo U is an OED document called agreement to build affordable units.'",
        "'speaker_1': 'And we ran out of time today to get that actually executed. But it will be recorded against the property. And I'm not sure if there's a representative from OED here tonight or not. But if not, Courtney has been very familiar with it from KPD who gave the staff report.'",
        "'speaker_1': 'And so it would all it will all be enforceable through Lloyd's regulatory toolkit.'",
        "'speaker_3': 'And that's because of the requirement for the.'",
        "'speaker_1': 'What's the the the build alternative?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Yes. So we're we're going to do the build alternative instead of the linkage fee.'",
        "'speaker_5': 'Great.'",
        "'speaker_3': 'Thank you so.'",
        "'speaker_1': 'Much. Thank you.'",
        "'speaker_3': 'I have no further questions.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega. Councilman Brooks.'",
        "'speaker_4': 'Yeah. Just a couple quick questions. There was another I was actually at this planning board, but I didn't see the entire deal. There was another no vote for planning boards, according to you. Is there?'",
        "'speaker_5': 'Yeah. At that December hearing, there was one no vote. Interestingly, there wasn't a ton of testimony and conversation that led us to understand fully why the no vote was voted on that way. There wasn't a ton of testimony.'",
        "'speaker_4': 'Okay, great. And then, Dr. Davis, quick question for you. So, you know, been on the diet for about eight years looking at these rezonings and looking at other cities the way they do rezonings and outreach. And and by far don't have a perfect process.'",
        "'speaker_4': 'But you said some pointed comments around. There needs to be more community process. And this this process we have is an advantage to the developer. Can you give us some specific examples that you would request for us to change around the process?'",
        "'speaker_1': 'So one of the things that I think would be beneficial is, of course, that it would be mandated that developers have to meet with the various community organizations to get a better understanding. Because one of the things that was discussed in of the proposal was that it's going to be very similar to the units that are across'",
        "'speaker_1': 'the street. So right there on Albion, but on the other side of the street, those units are really what we considered, what I considered to be the problem or one of the symptom of the problems. Let me say that what I mean by that is we did a I had my administrative assistant to do a search on'",
        "'speaker_1': 'the owners of the property. It's not ethnically diverse so that, you know, so if that's the model that we're using, I was not here when those units were built. But so but I don't know how many I know as I spoke to the leaders of my congregation.'",
        "'speaker_1': 'They were not brought in, even though the units that were built were right across the street from us. But we were not brought in on the process. We have the imam here. I don't know how much they consulted the mosque in the building of those units.'",
        "'speaker_1': 'All that right there in and of itself brings a problem. And so, as the gentleman said, he went and spoke with people in the community and the people that he spoke with, people in those developed units, but they're not from the community.'",
        "'speaker_1': 'What I mean by that is they bought those units and moved there. But that's not they don't have the historical understanding per se. And I'm not trying to isolate them and say that we shouldn't talk to them. But I think there needs to be a larger conversation that includes those registered community organizations that says when we when'",
        "'speaker_1': 'we do these type of developments, we're going to make sure that they're in on the process and especially the immediate neighborhood should be invited to come to the table. When we get to when we get to an, I don't know, all the various acronyms, but not when we get to the to the city to apply for these'",
        "'speaker_1': 'various things. But at on the front end, we sit down and have these conversations.'",
        "'speaker_4': 'Yeah. So I appreciate that. And I just wanted to just say it since we're on the record talking about that outreach, because I think it's really important and I think we need to be talking about specific outreach changes.'",
        "'speaker_4': 'So one specific change and if you indulge me, Mr. President, we passed we just passed this ordinance, and it was sponsored by Councilman Espinosa that every home within 200 feet of a new rezoning must be alerted. Right. They get something in the mail.'",
        "'speaker_4': 'Every developer that comes in here must reach out to a neighborhood organization. Some don't respond, things like that. Those are kind of things we have in place today.'",
        "'speaker_1': 'Okay.'",
        "'speaker_4': 'But when you say mandate, what is the that extra? I'm just trying to.'",
        "'speaker_1': 'You know.'",
        "'speaker_4': 'Well, that extra piece.'",
        "'speaker_1': 'So you're saying that those things are already in place. And again, I'm I'm new here. So but as I was as I was a part of this process, I did not. First of all, my church, which is right across the street, literally across the street from it, was not you didn't receive.'",
        "'speaker_1': 'And no one. I receive anything. No one reached out to us. No conversations were made with us. And I'm pretty visible in this community. So that was concerning to me.'",
        "'speaker_4': 'That's helpful. And I'm just going to stay on this real quick, because this is something that we pass. And if you didn't get notification, this this is a problem with our system. Cordy, can you just come?'",
        "'speaker_1': 'You want to say opposite down about me?'",
        "'speaker_4': 'You do what you want you to, pastor. So I'm just curious. Every property within 200 feet should receive a notice of any rezoning that comes through for City Council for review. Far before we get to planning board. So what do churches not receive that?'",
        "'speaker_4': 'Is it commercial properties do not receive that.'",
        "'speaker_5': 'What's the every property within 200 feet should receive that postcard. It's a postcard. So, you know, it might have been missed. I'm not sure. But I do know that this rezoning was noticed according to the code requirements. That is the mail postcards at time of application.'",
        "'speaker_5': 'And for the planning board hearing. So we sent out two mailings. We also post the property and then send that notification to the Arnaud's. Okay.'",
        "'speaker_4': 'And just just for the public's edification, when do you post the property?'",
        "'speaker_5': 'The applicant posts the property and they post it for the planning board hearing. And then they post it again three.'",
        "'speaker_1': 'Weeks or two weeks before to two weeks.'",
        "'speaker_5': 'Before, prior to the planning board. And then again for this city council hearing three weeks prior.'",
        "'speaker_4': 'Okay. Thank you. Thank you.'",
        "'speaker_0': 'Doctor. Thank you. Councilman Brooks. Councilman Herndon.'",
        "'speaker_1': 'One question for CPD and I meant to look this up. So with the current zoning, what can be built now? So not expecting an exhaustive list, but just kind of generally.'",
        "'speaker_5': 'Right. So it's ESU docs and that is single unit. The D, the X signifies the building forms. You have the suburban house form and the urban house form. Places, places of worship are also allowed under the code.'",
        "'speaker_1': 'The one unit or places of worship.'",
        "'speaker_5': 'Things like that.'",
        "'speaker_1': 'Yeah. Okay. They must.'",
        "'speaker_0': 'Thank you. Councilman Herndon, Councilwoman Kinnick.'",
        "'speaker_5': 'Thank you, Mr. President. I wanted to ask CPD about the protest petition. I'm pleased that we ended up with a situation where we have majority community support here tonight. But there was earlier protest position and towards the same type of questions Councilman Brooks was asking about how we can do better.'",
        "'speaker_5': 'I think that there seemed to be some confusion about who's eligible to sign when you have an institution that doesn't have the same kind of traditional ownership as a single family home. So I wanted to ask about whether or not CPD has learned anything about how we can, you know, either one better educate folks on institutions and'",
        "'speaker_5': 'how signatures work for them and or do we need to make any changes to our code to make sure that we are not just accounting for single family homes, for example. Right. And the the protest petition, when we hand out that form, we also hand out instructions with protest petitions.'",
        "'speaker_5': 'They're pretty detailed instructions, multiple pages. And it goes through and it says, you know, the name must match exactly as you hold deed to the property. And we also say that we need authorization. If you're an LLC, it says on those instructions, you know, you need to have provided authorization that you're allowed to sign on behalf of'",
        "'speaker_5': 'this organization, and we can look at ways to make those instructions more clear. I think that that would be something that we can work on right away. Yeah, I think that it sounds to me like those are really geared towards businesses and homes, whether they be apartment buildings or, you know, single family homes and churches and nonprofits'",
        "'speaker_5': 'are totally different types of entities. I'm not sure that most churches or nonprofits would know who holds the deed decades and decades into their existence. So I think, one, if you can please take a look at whether or not the rules we have are actually appropriate for institutions like those that the deed holder might be long deceased'",
        "'speaker_5': ', for example. And then secondly, yes, whether or not you can do some improvements, so are those things that you're willing to go back and take a look at? Yeah. And I know that the committee planning development, we have a Process and procedures subcommittee, a team of staff members and we work on, you know, instructions in these type'",
        "'speaker_5': 'of things to make them more clear and just better applicant and customer service type things, not like code related, but little things that we can tweak and then we can take up the chain. So we are working on things like that and I haven't taken a look at those rules and regs, but often things like a frequently'",
        "'speaker_5': 'asked questions or guide by the type of property would be much better than a rule regulation code type language. So thank you for that. Yeah.'",
        "'speaker_0': 'Thank you. Councilwoman, can you seeing no other questions? The public hearing for Council 18 1541 is closed. Comments by members of Council Councilman Herndon. Hey, Mr..'",
        "'speaker_1': 'President, I want to applaud everyone for coming out. And I have to admit, usually when I hear we have three public hearings, I look up at the clock and to say we're at 750 is is really is really good to my colleagues.'",
        "'speaker_1': 'If you've never come out to this area, we throw one heck of a Denver Days event. I know Councilwoman Kennedy has been out there. The mayor has been out there. And so that was always a good time. And I'm glad to see that we have come together on this.'",
        "'speaker_1': 'Our charge here as a body is to make decisions based off of the criteria. And I was going to spend a little bit of time walking through the criteria and why I do think it's appropriate, but with the direction and people members speaking in support, I won't go through that level of debt because I want to take'",
        "'speaker_1': 'the time to applaud the people in this chamber because we saw where we were and you look up to see where we are now. And I think one. We sit down and we hear each other and hear each other's concerns, and you can reach a point of consensus.'",
        "'speaker_1': 'And to the numerous people, we need to support the leadership and members of Northeast Park Hill. Pastor Davis. Imam Ali. We have demonstrated that redevelopment can be successful where the parties can say, hey, we're at a place where we are, are happy and we do have an affordability challenge.'",
        "'speaker_1': 'And one development, one parcel is not going to solve it. And I believe as a city we're taking steps to get there. And so this is one of the steps and thank you for the for the acknowledgment that we need to do better.'",
        "'speaker_1': 'And I think CPD will take that to heart. And we can certainly have conversations as a body how we can make this, because we want this to be an inclusive process where people make sure they're all heard. And so as as Pastor said, this can be a model and I hope that other future opportunities, we can follow'",
        "'speaker_1': 'the model. We can look the Northeast Park Hill and said, hey, this is a way that you can get together and all the parts can get away with a successful conclusion. So I will be in support of this and I would ask my colleagues to do the same thing.'",
        "'speaker_0': 'Thank you. Councilman Herndon. Councilwoman Cannick.'",
        "'speaker_5': 'Thank you so much, Mr. President. I came to find that this rezoning meets the criteria, but I do need to go ahead and just put a couple of things on the record. First of all, I just want to put on the record that I had a number of contacts from the community asking for information about how this'",
        "'speaker_5': 'process worked, particularly when things were beginning to get contentious. We talked about the opportunity for mediation and that the city could offer a mediator if that was needed. I just want to be really clear that each of those communications I shared that I was not able to take an opinion on this zoning, and none of those conversations'",
        "'speaker_5': 'included information that was outside the record. It did not change in any way my opinion on this rezoning, but I think that what it showed me and we've all had every single person, as Dennis said, has had this experience.'",
        "'speaker_5': 'It is so difficult. Our entire job is designed to have this interaction and two way conversation with the people we represent and it drives us crazy as council members. We just had a meeting about this today that we cannot do that two way communication around rezonings.'",
        "'speaker_5': 'We can't, you know, say, here's what we like, here's what's challenging. We can't form an opinion ahead of time because the rules of how we do rezonings prevent us from doing that. And so it is. So I hear, Pastor Davis, your words so clearly about how it feels like there's not enough community input.'",
        "'speaker_5': 'And one of the reasons I think that is, is because the rules don't let us do that. We spent a long time with our lawyers this afternoon asking about Will. Is there any other city that allows for this?'",
        "'speaker_5': 'And the answer is, this is not just because of property rights. It appears that this is the standard practice in cities. And so so that is a challenge that leaves us saying how do we create the type of community input that the community desires?'",
        "'speaker_5': 'I mean, you can't have the normal back and forth that we have around, for example, a policy debate that, you know, where the council members can answer questions and share their views with their constituents. And so I want to just I, too, want to applaud the community because I feel like what you did was you stepped into'",
        "'speaker_5': 'the gap that our system creates, and you didn't let it be a barrier to having your voices heard. And so I really think that the self-organization that you had, the fact that you got access to a mediator and worked to have someone help represent you in that conversation.'",
        "'speaker_5': 'And I think that is, you know, to your credit, that you were able to do it. But I agree with you that I wish the system did not leave you in that boat. So I feel like the conversation I want us as a body to have is if it can't be us, is there an office of neighborhood'",
        "'speaker_5': 'assistance, for example? That can be the place where you can go and get some more of that support and expertize. I mean, I was able to answer process questions. I think any of us can and would answer questions to help folks understand how things work.'",
        "'speaker_5': 'But where you need an advocate, where is it that you find that? So so I'm intrigued by thinking about other ways when we're stuck in parts of this that we can, you know, think about how to create more of that.'",
        "'speaker_5': 'The second thing I just wanted to focus on is just the substance of what you have figured out in terms of your agreement. And so I want to just say a word to Pastor Kingsburg, who I'm not sure if he's still here.'",
        "'speaker_5': 'He may have had to leave. But the fact that that oh, sorry. The fact that I was looking at your old seat there, the fact that your congregation was willing to step up and thinking about making the pricing work, you know, to the developer who is willing to think about changing your your mix of of your product'",
        "'speaker_5': 'and to the community for your creativity. Again, and talking about, for example, the affirmative marketing, that it's not just the price of the unit, but it's it's how the word is spread. And we know from Councilman Brooks is just.'",
        "'speaker_5': 'That a townhome project that did similar marketing did results in a very local group of residents from the area, really getting the chance to buy a home and build wealth, which I think we do actually have a lot of very affordable housing in Northeast Park Hill.'",
        "'speaker_5': 'We don't have a lot of affordable homeownership for African-American and communities from diverse backgrounds to build wealth. And so that is actually a gap that this project is helping to fill. So I'm excited about it. I agree with Councilman Herndon that one project doesn't solve the challenge, but it creates these openings for more conversation.'",
        "'speaker_5': 'So I appreciate the way you've all used the linkage fee as as a launch pad to build those homes on the site. And I want to thank everyone for participating in what is clearly not a perfect process, but one where you managed to find a way to common ground.'",
        "'speaker_5': 'So thank you very much.'",
        "'speaker_0': 'And you can reach Councilman Brooks.'",
        "'speaker_4': 'Yeah. Thank you to my colleagues for for your comments. I just want to just go straight to the the community. I mean, I think we hear a lot this is such a complicated and convoluted process. We know that from a community perspective.'",
        "'speaker_4': 'But I want to recognize you tonight and use yours as an example that actually in this convoluted process, it worked. It worked on your behalf. And so I think there's a lot more to build off of. I think there's a lot of examples that other the other 72 neighborhoods throughout the city can build off of and take'",
        "'speaker_4': 'it to the next level. And there's another thing that we've that I've been doing in the district and it's it's also council initiated rezonings where actually the councilperson is the is the person who takes on the rezoning for two property and maybe the property owner in the community to come to some sort of agreement.'",
        "'speaker_4': 'And so there are ways around that. But it's hard, it's convoluted and there's all those issues. And so I really appreciate all the work. I want to thank the developer, the property owner, the church for being willing to engage in conversation and engage in a solution.'",
        "'speaker_4': 'And once again, thank you all for going through security in the parking meters and sitting in these hard seats. We really appreciate you being here. It's when folks are not here that they're not a part of the of putting their fingerprints in building this city.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Thank you. Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_3': 'Thank you, Mr. President. I won't repeat what my colleagues have already said in just thinking all of the all of the players who came together to come to this consensus in being able to move the project forward. I'm not sure when things changed, but city council members historically have played a role of bringing both sides together.'",
        "'speaker_3': 'I did that on the seven zoning changes that we did down in lower downtown. We had both sides at extreme ends of the spectrum and and we were successful sitting down without saying, I'm on this side or I'm on this side, but being able to bring opposing views to the table and being able to find that middle'",
        "'speaker_3': 'ground and then bring it forward. And I'm not sure, you know, what's changed that would not council allow council members to continue playing that role without prejudicing our vote, because we sit like a judge up here when we deal with zoning matters, we cannot indicate if we're for or against a rezone application, but we can bring two'",
        "'speaker_3': 'sides together to find that middle ground and hope that we continue to have that conversation about how we can play a bigger role in working within our communities. To address that, I appreciate the fact that the agreement is being filed as a.'",
        "'speaker_3': 'Part of the title to the property because that then assures that the agreement is something that will follow through. If, for example, the developer decided to sell the property, it assures the community that that agreement holds true because it applies to the land.'",
        "'speaker_3': 'And it's not just an agreement between the two parties. So I think that was a big part of the decision moving forward. So I just want to commend all of you for your work. And it sounds like we'll see a great project there with some affordable units in the near future.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. See no other comments, Madam Secretary, roll call.'",
        "'speaker_1': 'Brooks High.'",
        "'speaker_2': 'Black Flynn.'",
        "'speaker_1': 'High. Herndon, I.'",
        "'speaker_2': 'Cashman. I can eat. Lopez. I knew Ortega. I. Susman. I. Mr. President.'",
        "'speaker_0': 'I. I'm secretary. Please close voting. Announce the results.'",
        "'speaker_2': '1111.'"
    ]
}