{
    "Second Amendatory Agreement with Colorado Village Collaborative for Safe Outdoor Space Sites.": [
        "'speaker_2': 'I move that council resolution 72 be adopted.'",
        "'speaker_0': 'Second think has been moved and we've got the second by Councilmember Hines comments and questions by members of Council on Resolution 72. Councilmember Sawyer.'",
        "'speaker_2': 'Madam President, we've talked a lot about this. We all want to help people. We just have different opinions on how we should be prioritizing our spending. And so I'm going to be a no tonight.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilmember Swire. Councilmember Ortega.'",
        "'speaker_3': 'Thank you, Madam President. I just wanted to ask a question about a good neighbor agreement and where exactly that is in the process. I know that with the very first one that was created that was in fact established.'",
        "'speaker_3': 'I don't know that they've actually had one at every single site that they've been at, but that is an important part of having that interaction between the community and the operators of the safe open space site so that there is that dialog around issues that may come up and and a way to resolve them quickly so that'",
        "'speaker_3': 'they don't fester. I know this is very much a part of the process. When we changed the zoning to allow for more shelters to exist in our city, and that was very much a clear process outlined in terms of ensuring that there was that interaction with the community and the opportunity to set up a community advisory committee'",
        "'speaker_3': 'or, you know, whatever you want to call it, so that there is that opportunity to have that dialog back and forth. So I wanted to ask if there is anyone from the host office that might be able to speak to that or someone from the.'",
        "'speaker_3': 'The Village Collaborative in charge of the S.O.S. site.'",
        "'speaker_0': 'All right, thank you, Councilwoman Ortega, for the question. And we have Derek Woodbury here. Go ahead, Derek.'",
        "'speaker_1': 'Hello, Councilwoman. Yeah, this is Derek Woodbury from Host. And I believe we have Angie Nelson from our deputy director of Homelessness Resolution on Zoom as well. If she could please be promoted as a panelist.'",
        "'speaker_0': 'All right, wonderful. We've got Angie in the queue now. Go ahead, Andrej.'",
        "'speaker_2': 'I think you are council woman. Take it for that question and not to punt to someone else. But I am going to ask I think that we have Jennifer Faucher from Colorado Village Collaborative on the call. I've participated in several of the community engagement meetings related to this, and so I know they've been having those community engagements'",
        "'speaker_2': '. But as you know, those good neighbor agreements occur between the nonprofit partner and the neighborhood, not between hosts and the neighborhood. So want to have CBC speak specifically to where they're at and process at those different sites. I just saw that Jennifer jumped on to her to speak to that.'",
        "'speaker_0': 'All right. Wonderful. Go ahead, Jennifer. If you wouldn't mind introducing yourself for I.'",
        "'speaker_2': 'Am Jennifer Faucher. I'm the director of development and communications for CBC, The Good Neighbor Agreement. I think the question is, when does that enter into the process of starting an S.O.S. or trying to launch one? Is that correct, or does that.'",
        "'speaker_0': 'Will let Council Square?'",
        "'speaker_3': 'Where is it in the process?'",
        "'speaker_2': 'Okay. So in my limited experience, I've been working for CBC since.'",
        "'speaker_3': 'End of October.'",
        "'speaker_0': 'The process and Jennifer, we've got quicker Montoya in the queue as well.'",
        "'speaker_2': 'So I'll just real quick say that it launches during and in right after it's a community information meeting.'",
        "'speaker_3': 'So I guess what I want to know is, does one exist so that, you know, as part of us making this commitment tonight, we want to know that there is, in fact, an agreement in place between the community and the Colorado Village Collaborative.'",
        "'speaker_2': 'Right. We can have quick to answer that. We have three source sites right now and I believe all.'",
        "'speaker_0': 'Three.'",
        "'speaker_2': 'Have an agreement, but quicker can clarify.'",
        "'speaker_3': 'Okay. I know we've we've heard from people in the Baker neighborhood right where this site is located. And so that's why I'm asking the question, okay, I know that that is in place so that that interaction and addressing issues can happen in a very timely manner and not allow them to fester because we are the ones that'",
        "'speaker_3': 'will get the phone calls when things are not functioning the way everybody anticipates that they're supposed to. Right.'",
        "'speaker_2': 'And we do our best to respond to every email and every call that we receive from our neighbors and especially those near the LRT site.'",
        "'speaker_0': 'But go ahead quick. If you wouldn't mind introducing yourself.'",
        "'speaker_2': 'Unless I click the moratorium, the safe outdoor space program director. You're actually live from an S.O.S. right now. I would like to answer your question, Councilwoman Ortega. We do have a good neighbor and fully executed good neighbor agreement at our Denver house, Native American Inclusive S.O.S., which is our S.O.S., located at 780, a lot of street with'",
        "'speaker_2': 'the lawn and Lincoln Park neighborhood where we had two two good neighbor committee meetings. So what our mediation created in that neighborhood was a good neighbor committee. So we have a representative, a couple of representatives from the neighborhood alone, the Lincoln Park.'",
        "'speaker_2': 'We have Steve Charbonneau, our our mediator and Denver House representative. We have a council council representative from District three, and we also have two CBC representatives. So we meet every three weeks at 780 LRT Street, which is near the Baker neighborhood.'",
        "'speaker_2': 'And then we also have a fully executed good neighbor agreement at our Denver Human Services site with the Clayton R.A. neighborhood. And we did not need one outreach. Just the neighborhood was very welcoming. And so that we didn't enter into any negotiations with that neighborhood.'",
        "'speaker_2': 'And our previous resources had good neighbor agreements. So five out of six S's have a good neighbor agreement. And that's a very.'",
        "'speaker_3': 'Just a quick question about the Baker community, your block away from Baker. Is there a reason somebody from Baker is not part of this process, part of the good neighbor agreement?'",
        "'speaker_2': 'So I was not a part of those negotiations. But the the good neighbor agreement is between Denver Health, Llama, Lincoln Park and CBC.'",
        "'speaker_3': 'Okay. So you're saying Baker is not part of that, even though they're a block away? They're asking to be included. And I guess I'm just asking whether or not you all are open to Baker being part of that good neighbor agreement as well.'",
        "'speaker_2': 'We made a few members of the Baker I.R.A. on Saturday. Members. Some of their leadership came to our site at LRT and we talked about the S.O.S. program, and they didn't voice a desire to be in the genie.'",
        "'speaker_2': 'But we can certainly talk to them about it.'",
        "'speaker_3': 'Okay. Because we're getting communication otherwise. And so that's why I'm asking these questions. Right. So I appreciate that. Thank you. Yeah.'",
        "'speaker_0': 'All right. Thank you. Councilmember Ortega and quicker. And Jennifer, we might just want to keep you in the queue here. We've got Councilmember Hines. You're up next.'",
        "'speaker_1': 'Thank you. Council president and Miss Montoya, I just for what it's worth, before I asked Mr. Montoya the question, there were executed good neighbor agreements at the first two safe outdoor spaces that were in my district. And so as far as I know, that's a pretty standard operating procedure for most states.'",
        "'speaker_1': 'So it's good to know that you haven't actually executed know for the current location and are willing to reach out to Baker. So the question so Miss Montoya, the question that I have is about police interaction. I know a fair amount of the postmortem from the two associates that were in my district.'",
        "'speaker_1': 'What sort of police interaction has occurred at the SARS sites? I think you've had seven now in Denver, as I am. I remember the number six. Six. Okay. And what sort of police interaction have you had with the SARS sites?'",
        "'speaker_2': 'We have not had any crimes against neighborhood property and or people to date. We have made calls for some emergency health services to our sites. But as far as crimes taking place in the neighborhood, we have zero events to report on that.'",
        "'speaker_1': 'I seem to recall that there were actually two calls for that were either property or victim crime related as opposed to calls for services. But both of those calls were actually external parties attempting to, you know, interact with with the residents as I am.'",
        "'speaker_1': 'I my remembering that correctly.'",
        "'speaker_2': 'Are you speaking on the first couple?'",
        "'speaker_1': 'Councilman Hines? Yes, ma'am.'",
        "'speaker_2': 'So much has taken place since then. I don't have that that particular data in front of me. But yes, we had to make a couple of calls for crises that happened outside of the fence. So the police did make those calls, but they weren't for residents inside the fence.'",
        "'speaker_1': 'So is it reasonable to say that actually the crime in the West Side is lower than than the crime for, you know, just the city as a whole?'",
        "'speaker_2': 'I believe in our first two sites in District six. We actually showed a reduction in crime during the time we were there.'",
        "'speaker_1': 'And by District six, you mean different police department districts, not.'",
        "'speaker_2': 'Only Denver Police Department. District six. Sorry, I always forget their. They're not there. They don't go inside.'",
        "'speaker_1': 'Yeah. Okay. And another question that I have received, I think probably the same email that Councilmember take us talking about is what about registered sex offenders? If there is a resident that that comes on to the site who is a registered sex offender, are they there legally required to register their location?'",
        "'speaker_1': 'Correct.'",
        "'speaker_2': 'Correct.'",
        "'speaker_1': 'And so what.'",
        "'speaker_2': 'We yes, we encourage all of our residents to take active participation and any of their legal requirements or commitments.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_2': 'And I'd I'd also like to follow that up with the Denver Police Department to tell us that anybody experiencing homelessness can register on any random particular corner in Denver. If they hang out there themselves, they don't have a permanent address.'",
        "'speaker_2': 'Folks registered to corners and different blocks along Denver.'",
        "'speaker_1': 'Yeah. And that's actually that's on the secretary of state's website as well. Like as far as voter registration that they're allowed to use the street corner or, you know, some sort of have to have a physical address. It can be a P.O. box, but.'",
        "'speaker_1': 'Yeah, so that's. Thank you, Colorado and our secretary of state for a very liberal and reasonable voter registration list. So the last question that I have is, is about the number of folks who have been residents of a safe outdoor space that have been moved upward in the spectrum of homelessness or into housing.'",
        "'speaker_1': 'I think I recall the number at something like 47 or so. So that's correct. Okay. And that number on its own is not wholly meaningful. What about relative to the number of guests that have have been in a safe outdoor space in the six iterations that have been in Denver?'",
        "'speaker_1': 'Do you do you know the full the number of residents and safe spaces?'",
        "'speaker_2': 'Yes, I believe we have the total on 42 over the last some 40 sat longer term jumps in options. And currently, we have 20 people connected to housing vouchers that are moving along that continuum as well. And I'd just like to add that it's an affordable housing crisis where some waitlists can be up to 2 to 3'",
        "'speaker_2': 'years. So we have been seeing pretty significant progress through timing.'",
        "'speaker_1': 'Okay. And you said what was the total number, 140? What was the number.'",
        "'speaker_2': '242 to.'",
        "'speaker_1': '42? Okay. So I'm just breaking out Excel. So 20% of the total population has already moved above somewhere else and higher in the spectrum of homelessness. And then you have another 20 in the queue. So that means a total of 28% are moving upward in the spectrum of homelessness.'",
        "'speaker_1': 'I'm not going to taper. I'm just going make that a statement because I just did the math. And math is math, so. Okay. Thank you. Thank you. Council president.'",
        "'speaker_0': 'Thank you. Thank you, Councilmember Hines. We've got Councilmember Cashman.'",
        "'speaker_1': 'Yeah. Thank you, Madam President. I'm not thrilled to death with safe outdoor spaces. I wish we didn't need them. People deserve dignified housing with a door that shuts and a place to store their stuff. And we all know we don't have enough of that in the city and county of Denver right now.'",
        "'speaker_1': 'I'm not thrilled to death that there might be drug use in our safe outdoor spaces. And I'm also not thrilled to death that there's a whole lot of drug use going on behind closed doors with our residents that do have permanent places to call home.'",
        "'speaker_1': 'We don't have enough drug treatment facilities in the city and county of Denver, and we need to put the pedal to the metal and change that. What I did want to ask quicker if we could start putting on my hat as chair of our safety committee, I think as the safe outdoor space program continues and may grow'",
        "'speaker_1': ', I'd like to set up perhaps quarterly presentations from the CBC before the safety committee, and I'll ask our staff, Pamela Lapel, to be in touch with you to begin setting that up, if that works for for you folks.'",
        "'speaker_1': 'I think it's appropriate as we start talking the dollars that we're talking and the scope that we're talking. I think it would be a great venue in which to be able to have a continuing full discussion of the use.'",
        "'speaker_2': 'We would be happy to participate in that council. Councilman Cashman.'",
        "'speaker_1': 'Thank you very much. And I want to thank you for the tour you gave me and my staff members a month or so ago. And it is. From everything I've seen, the S.O.S. site. Well, they're not, you know, my wildest dream.'",
        "'speaker_1': 'They're well managed. And I think they're an alternative that need to be part of our toolkit. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Cashman. We're going to go to Councilmember Koinange.'",
        "'speaker_2': 'Thank you. Council President. I wanted to first ask Quick or Jennifer to tell us the people you have served to date. What does the data show about where they were before they came to the safe outdoor space? If you if you have that handy.'",
        "'speaker_2': 'Yes. So we we really are focused on people who are not accessing shelter systems. So they're all coming from a place not meant for habitation. And if you're if you're looking for a drop down, even more than that, we don't track that.'",
        "'speaker_2': 'We just if they've slept outside and are not accessing shelter, that's what we track. Does it I think that in committee we might have heard the figure 98% of people who are served in the S.O.S. spent their last night outside in a place not fit for humans or in a place not fit for human habitation, i.e. not'",
        "'speaker_2': 'in a shelter. Does that sound like the right figure? Yes, it does. Okay. So if 98% of people were sleeping somewhere not fit for human habitation, i.e. the streets or their car, my guest is is what that really is.'",
        "'speaker_2': 'It's it's government code for what regular people would be calling the street or a car. Angie, I'd like to ask you, do we have any shelters in the city that serve male female couples? Sum up our COVID response shelter in non congregate settings, but that's pretty limited current.'",
        "'speaker_2': 'You have to meet the COVID criteria by age. Yes. So we have no general shelter that a couple could go into if they did not have COVID risk. Under the federal guidelines for children in their custody. Okay. Okay.'",
        "'speaker_2': 'And then do we have any shelters that serve individuals with their pet being able to stay with their pet while they're in the facility? Again, outside the COVID, the standard shelters that we have for people who are not experiencing COVID right are our congregate shelters are for service animals, not pets currently.'",
        "'speaker_2': 'Okay. And so I just want to ask you, Angie, if this contract and quickly, you can chime in, too, but if this contract were not approved tonight, what would the results be in terms of individuals sleeping unsheltered in our city?'",
        "'speaker_2': 'It would increase the number of folks sleeping unsheltered in terms of the folks who are currently in safe outdoor space have a safer place to be. Couples are able to stay together, foster, able to be sheltered with their pets.'",
        "'speaker_2': 'And so we've we've really found this to be a valuable tool to add to to the the spectrum of shelter services to help meet people where they're at and meet those practical needs and help folks to come inside to something that's safer and and keeps them where they're at.'",
        "'speaker_2': 'So. So I just want to share I'm going to make a comment then before we move on to the voting, which is that, you know, we have some financial analysis. There has been questions about that. But, you know, I will just share some numbers.'",
        "'speaker_2': 'I wish that everybody in our city who is experiencing homelessness could be placed immediately into housing, a supportive housing environment where you have a physical apartment and services. The cost for construction just for construction, no services, is about $20 million.'",
        "'speaker_2': 'It's about a three year process to serve about 50 people. Let me be clear. It's a really good investment. That building will last for 60, 70, 90, 100 years. It will serve many people during those years. And it will be cheaper than them being in emergency shelter or in hospitals or in jails.'",
        "'speaker_2': 'So just to be really clear, it's a really good investment, but it's a long time coming. So the cost per night or per year to shelter an individual in our congregate shelters in that congregate fancy word for everybody sleeps in the same room.'",
        "'speaker_2': 'That's a fancy word for sharing, breathing, changing of clothes and all of your space with hundreds of other individuals who, before the pandemic, might have been almost touching your shoulder since this pandemic are six feet apart. But that's that's what congregate shelter means.'",
        "'speaker_2': 'That's our most common kind of emergency shelter. The cost per year at $25,000 per year. Now it's immediate. People can go in. Right now, we don't have the delays we have with housing, but most folks will return to homelessness, stay in homelessness.'",
        "'speaker_2': 'It is not necessarily a solution. They do provide more services today thanks to city investments and some of the emergency changes we made during COVID. But $25,000 a year for shelter cannot serve. The people with pets cannot serve the male female couples without children cannot serve people who are unable to sleep in a room with hundreds of'",
        "'speaker_2': 'people near them for their own personal privacy needs or for their own mental health condition. That might be too overwhelming for them. So this model, you know, between 1214 hundred dollars a person a year are significantly less expensive than the shelter option.'",
        "'speaker_2': 'Significantly less expensive than the supportive housing option. Doesn't mean, like Councilman Cashman said, it's the best option, but it is immediate and it reduces street homelessness. Now, I will just ask if every Denver resident watching this debate tonight asks themselves, would they rather have people sleeping in parks, sidewalks, alleys near their home, or would they rather have'",
        "'speaker_2': 'folks in a organized environment, a sanitary environment with supervision 24 hours a day from staff and with services to help them on a journey to stability? That's the choice we face today, with probably between one and 2000 people sleeping outside in Denver.'",
        "'speaker_2': 'That's the choice we have. Where do we want people? I believe that the people of Denver overwhelmingly think that it's better for people to be in a supportive sanitary environment with some services to get on the road to stability than they do having people in unregulated encampments.'",
        "'speaker_2': 'And so I've heard that from many neighborhood organizations, some of whom testified before public comment tonight, some of whom have written us and joined together. This is a choice about taking immediate action while we continue to invest in those really long term solutions that we know work.'",
        "'speaker_2': 'But they do not happen overnight, not like these spaces do. And so I will be supporting this tonight enthusiastically. And I encourage all the people of Denver to reflect on why supporting these sites and growing them to meet more of the demand to get more people off the streets is important for our city to get through this'",
        "'speaker_2': 'crisis. So I thank everybody for the questions and answers, and I look forward to voting yes on this tonight. Thanks.'",
        "'speaker_0': 'Thank you. Councilmember Kinney and Angie, would you please introduce yourself for the public record?'",
        "'speaker_2': 'Yes. Sorry about that. My name is Angie Nelson. I'm the deputy director of Housing Stability and Homelessness Resolution for the Department of Housing Stability.'",
        "'speaker_1': 'With the city.'",
        "'speaker_0': 'Wonderful. Thank you. We're going to go ahead and move to Council Pro-Tem Torres.'",
        "'speaker_2': 'Thank you, Madam President. So one of the things I heard a couple of times tonight and over the past several months was this request for a a universal good neighbor agreement for all SARS sites. And one thing I want to point out is that Colorado Village Collaborative hasn't operated all of the West sites.'",
        "'speaker_2': 'There are other organizations involved, which may be one of the reasons why a single good neighbor agreement doesn't exist. So far, there have been three providers Colorado Village Collaborative, Earth Links and Saint Francis Center. So I imagine an organization that's party to a good neighbor agreement would want to develop or devise their own and in neighborhoods want'",
        "'speaker_2': 'different things as well. So there are all of those kind of dynamics at play. I would be very opposed to realizing that wealthy communities with this Southwest site got some protection, that other communities did not what we do, but we don't find that.'",
        "'speaker_2': 'What we do find is that in the Good Neighbor agreement that was ultimately achieved for Lincoln Park, some residents wanted a five year ban for Colorado Village Collaborative not to open up another southwest site in the eastern half of the neighborhood.'",
        "'speaker_2': 'So a selective protection for half of the neighborhood for five years, which for me came across as incredibly unreasonable. So there has to be some collaboration and realistic terms that come into play when establishing these good neighbor agreements, but they really are for the benefit of the neighborhood, to stay informed, to hear on a regular basis what's'",
        "'speaker_2': 'going on, and to get to know who's operating in their neighborhood, on their block, and even who's residing within within the southwest site. I have another R.A. in Lincoln Park who do monthly dinners at at the LRAD site.'",
        "'speaker_2': 'So it is not a purely contested. So West Side. There have been some incredibly welcoming neighborhood neighbors for that site. I will say that some standards do need to be considered. This isn't a purely a private transaction at a permit level it is.'",
        "'speaker_2': 'But the city funds this work. And I think there there could be some standard and greater engagement requirements for stakeholders for solution building, whether that's other city departments, council members, neighborhood groups, whatever it might be. I do think there could be some some.'",
        "'speaker_1': 'Some.'",
        "'speaker_2': 'A higher bar for some of that. I would point out that the city is daily demanding a solution to homelessness and suicides are.'",
        "'speaker_1': 'One crucial response to.'",
        "'speaker_2': 'That. So I for 1 a.m. grateful quicker for Colorado Village Collaborative Earthlings and Saint Francis Center for stepping into the space that nobody else has another solution for Berlin. Like any other vendor, I wouldn't expect them to be socially responsible.'",
        "'speaker_2': 'Culturally responsible. I expect them to be judicious. And I found them to be exactly that. Like Councilman Kennedy, I can wish all day for everyone to have a home, but we exist in reality. And the reality is that people need emergency housing right now.'",
        "'speaker_2': 'And it's hard to connect to somebody who doesn't know where they're sleeping tomorrow night and if they're going to be safe. I will also be supporting this tonight and they will also be at the table to help craft those those greater solutions.'",
        "'speaker_2': 'So thank you. And I look forward to voting yes.'",
        "'speaker_0': 'Thank you, counsel. Pro Tem Torres. Councilman Herndon.'",
        "'speaker_1': 'Thank you, Madam President. I will reiterate all that says, and I won't bury the lead either. I am in support of this contract moving forward and like most of the people who wrote us originally, I was skeptical at first to abide about what I did and I would encourage people to do is do their homework by doing'",
        "'speaker_1': 'the research and speaking to because I went to I went to the one site in District ten and actually spoke to the pastor of the other side of the Baptist Church. And I remember his words as I'm paraphrasing.'",
        "'speaker_1': 'He says, there's going to be a big hoopla before it opens and then it's going to open and you're going to forget about it. And I remember when there was go site coming to South Park Hill and neighbors were up in arms because they were unaware of what the site actually was and what it was going to'",
        "'speaker_1': 'do. We went to our worst thoughts about what could possibly happen and then the site opened and there were zero calls for service by Police District two. And I had neighbors who reached out to my office previously about before it opened, who respond afterward and said, I am sorry.'",
        "'speaker_1': 'This was not what I thought it was and this is really good for the neighborhood. And I'm sorry that that's the way that I behaved. And that happened on numerous occasions. I'm in I'm in support of CBC. I've had conversations.'",
        "'speaker_1': 'I'm looking for another site in District eight because I believe we all have a responsibility to serve those. And just as Councilwoman Kenney's talked about, yes, we are building where we can, but as timely and as costly, we're doing things such as taking old hotels and converting them into housing like we did in Fusion Studios off of'",
        "'speaker_1': 'Quebec Street. This is, again, another tool to support those and it has been successful. Thank you, Councilman Hines, for the numbers of the percent that demonstrate that. And I trust that if there is an issue, CBC will be responsive, because they certainly were for District eight not to have any issues with policing.'",
        "'speaker_1': 'But whenever I had a question, they are very responsive there and I am thankful for that and I wish them well continuing moving forward. So I will be in support. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Herndon. Councilmember Sandoval.'",
        "'speaker_2': 'Thank you, Madam President. Thank you, Mr. Monterrey, for all your work. I have one question for you. It. Did you say that Regis is the only state that doesn't have a good neighbor agreement? One of our current sites that don't have one, correct?'",
        "'speaker_2': 'We had very limited engagement. The neighborhood people broke up there. Oh, yes. It's one of our current sites that we do not have a DNA on. The neighborhood was very welcoming and it didn't it just didn't ever come to fruition.'",
        "'speaker_2': 'Okay. Thank you. That's what I thought. And I represent the area in Regis neighborhood that welcome this safe outdoor site. And I will go on record saying that we have not had any calls about it. We have not had any emails about it.'",
        "'speaker_2': 'What we have had is a registered neighborhood organization who takes food to that site. My council office has taken food. My staff has dropped that food off. I know other people, the sisters of Loretto, who have taken food to other sites, and as my other colleagues have talked about, we there was a fear that this might bring'",
        "'speaker_2': 'crime in the council district one, especially on a university campus, where there are people walking around at night going to different places and nothing has happened. And so to Councilman Herndon's talk and eloquently said that residents do go to the worst fear.'",
        "'speaker_2': 'And we have a hotel on the corner of I-70 and federal not far from this site, probably about six blocks maybe as a highway that also was very that people had concerns about. And we have not heard any any issues with that hotel either.'",
        "'speaker_2': 'And so I fully support this. And I, too, will work with Colorado Village Collaborative to look for another one in Council District one, because I, too, wish we did not have people sleeping outside. I wish we had people sleeping indoors.'",
        "'speaker_2': 'And I wish we had more social impact on initiatives throughout the city where people were living in apartments and having wraparound services. And until we build those apartment units. I believe that this is the next best step in the process.'",
        "'speaker_2': 'Thank you, Miss Montague, for all the work that you do. And it it's one job where I do really believe you. Take your work home with you. There are some of us who don't take our work home with us.'",
        "'speaker_2': 'I bet there's not a night when you don't go home and you don't worry about all of the people that you are representing. And when it was freezing cold last Wednesday, when the rest of the city got to shut down, I don't believe you got to shut down.'",
        "'speaker_2': 'I believe that you were there making sure that the residents were not cold and that they had what they need. So thank you for your service. Here comes a number of them.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sandoval. And we have Councilmember Sawyer. You're back in the queue.'",
        "'speaker_2': 'He's not a president. Just a quick question for the host. Did you pass up an opportunity to invest $500,000 in a motel on East Colfax that would have housed at a minimum of 60 people permanently? Spoiler alert, the answer to that is yes.'",
        "'speaker_2': 'So I just want to reiterate, I heard a lot of conversation tonight about accounts from council members saying, you know, that there aren't other options, but there are. There have been we've seen it in District five and we've seen hosts pass on those for significantly less money or permanent options.'",
        "'speaker_2': 'So I again have to say, we all want to help people. There's absolutely no question about that. However, we have different choices in the priorities of how we want to do that and how we want to spend our tax dollars.'",
        "'speaker_2': 'Again, I'll be a no tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. And I know, Angie, you seemed like you were looking for your unmute so you could answer. Do you want to to provide any further clarification?'",
        "'speaker_2': 'I think just to say that we're not passing up opportunities, viable opportunities for housing as we have the resources, as we have the opportunities that come together. We're we're tracking every viable option down. I'm not familiar with what exactly you're speaking to.'",
        "'speaker_2': 'Councilman Sawyer, maybe we do a briefing offline here. I don't know that this is the space for a back and forth on it, but I, I think we should definitely follow up because we are aggressively tracking every opportunity we can find to help folks get to housing.'",
        "'speaker_0': 'And we can. Thank you, Angie. Councilmember Sawyer. Or are we just not in agreement.'",
        "'speaker_2': 'And he's been a president? Yeah, no, I appreciate the opportunity to just chime back in because I don't want it to be I want it to be very clear. For the record, host is aware of this situation. Host knows about the situation.'",
        "'speaker_2': 'Host has acknowledged that they did not pursue this opportunity for this investment. I want to make it very clear that this happened in District five and that it is not acceptable and that it is not acceptable to. Deflect from the truth for the public.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. And I'm not seeing anybody else in the queue. I'll go ahead and round out the comments and we'll call the vote. I'm very much in support of these sites. We have been looking in District 11 to try to figure out if we had some properties that we could start to explore this and that'",
        "'speaker_0': 'the need is immediate and that we're all working on different options. But this is one of those options that we have before us and appreciate the work of the Colorado Village Collaborative. And I will be voting in favor tonight.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Resolution 22, dash 007 to please.'",
        "'speaker_3': 'Sawyer.'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'Torres. I. Black. I see tobacco. I. Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I think i. Cashner i.'",
        "'speaker_2': 'Can each I.'",
        "'speaker_3': 'Ortega. I. Sandoval. I. Madam President.'"
    ],
    "Air Quality Monitoring Services Agreement with Montrose Air Quality Services, LLC.": [
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results. 1st May 1111 I's Council Resolution 20 2-007 to has been adopted. Council Member Sandoval, will you please put Council Resolution 83 on the floor for adoption? Oh, I think you're muted.'",
        "'speaker_2': 'Council Resolution 83 be adopted.'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Comments and questions by members of Council on Council Resolution 83. Council Member Sawyer.'",
        "'speaker_2': 'Things that our president this is another airport on call contract that we've talked about before. And I actually am a little confused because I think that it got maybe it's messed up in our script, but we want to double check on that.'",
        "'speaker_0': 'Okay. Had you called out Council Resolution 83? It's the Montrose Air Quality Services.'",
        "'speaker_2': 'No, the one that I called out for a vote. The second one I called out for a vote was the was the airport. Oh, I'm sorry. Yes. The mantra, it's Montrose air quality on call, correct? Yes. Okay.'",
        "'speaker_0': 'That's what Resolution 83 is.'",
        "'speaker_2': 'Got it. Okay, good. I'm glad that is what I called out. I was just making sure because I know council members had some questions and I got a little confused in our script here. Yes. So it's just it's another airport on call contract which talked about reporting and on call contracts repeatedly.'",
        "'speaker_2': 'So I'm just going to be a know for consistency. Say thank you.'",
        "'speaker_0': 'All right. Thank you. Councilmember Sawyer, Councilmember CdeBaca.'",
        "'speaker_2': 'I have quite a list here. I have about ten questions on it. So my first question, the million dollar amount is a maximum spend level over the next five years to ensure that any future air monitoring, air monitoring projects could be funded under the contract.'",
        "'speaker_2': 'My first question is what future air monitoring projects are anticipated to be funded with this contract?'",
        "'speaker_0': 'Okay. Thank you, Councilmember CdeBaca. And we have Will Fenton here and then Bill Oberman.'",
        "'speaker_1': 'Thank you, counselor. President Gilmore. And for the questions, Councilwoman Celia Barker. Yes, I am joined by our air policy program manager, Bill O'Brien. Go ahead, Bill. And thank you for the question, Councilwoman CdeBaca. This this is an contract that will fund.'",
        "'speaker_1': 'At the most $1,000,000 over a five year period. The the amount of funding maximum that we are actually allocated in our program is around 100,000 a year. That would be the very maximum that we could fund. The other room that we've built into that million dollar limit is should we get any grants because we do competitively apply'",
        "'speaker_1': 'for grants. We have one right now from the Bloomberg Philanthropies Organization. And part of this contract could perhaps hire contractors and other services need it should we win a grant in the next five years?'",
        "'speaker_2': 'And how does the department determine what the future projects are that are needed? And how does community weigh in?'",
        "'speaker_1': 'We we go through the normal city process. If there's a grant opportunity of reviewing all the different departments in the city that are potentially also applying to that grant or may be interested in that grant. A lot of times, depending on the type of grant source and the objective of the grant will will really involve the community'",
        "'speaker_1': '. An example is our last grant opportunity that we went for was in partnership with the City of Commerce City and tri county health department, and it was to do additional monitoring of air toxics. We were not successful in that grant.'",
        "'speaker_1': 'That was two years ago. However, there, as you know, is a new bill that's now been put into to law to actually do the same types of air toxics monitoring in North Denver and around Southport, particularly.'",
        "'speaker_2': 'How, if at all, are the various air monitoring programs that are being done by us, by DPS, by see? How are they all being coordinated and reported back to the public?'",
        "'speaker_1': 'So that's a great question. Right now, they're really not coordinated and being reported back to the public in one avenue. And that's a second phase, you could say, of the Love My Air Program, which is a Denver program.'",
        "'speaker_1': 'That's that program that's funded by Bloomberg Philanthropies. One part of that program that we are hoping to launch in the spring, maybe early summer, is an app you could use on any device, iPhone or Android device with all of that information in one place in a smartphone setting where somebody, you know, can rapidly see all of that'",
        "'speaker_1': 'information as it comes online. So we are working with other entities in the region to incorporate their data in like those who will be monitoring some more cultivars know. Areas from Apache or yeah. Sites that seepage is monitoring near that area as well as well as other communities as they bring on more air monitoring in their communities'",
        "'speaker_2': '. And given our office is probably home to where we're monitoring the most error. I would love to have more regular contact. We have a stakeholder group working on this. I'm curious about if this if there's a plan to monitor new chemicals or sizes of particles with this contract.'",
        "'speaker_2': 'Right now.'",
        "'speaker_1': 'There are no plans right now to monitor different chemicals or particles that we're than we're currently monitoring. But that science is always evolving. There are smaller and smaller particles that we're more and more concerned about, like particles less than 2.5 micron in diameter of particulate matter specifically.'",
        "'speaker_1': 'And so monitors are coming out that even measure all the way down to one micron and less. So as those technologies become affordable and reliable, I think that could absolutely be part of what this contract would cover over the next five years.'",
        "'speaker_3': 'But what are we currently monitoring?'",
        "'speaker_1': 'So currently in our Denver network, this is specific to what the city of Denver pays for and what this contract will cover is particulate matter 2.5. We also and that's just roughly 40 schools through Denver public schools that we have engaged in the love of my air program.'",
        "'speaker_1': 'What that program does is use that that data of the particulate matter concentrations right on school property and real time puts it onto a TV monitor inside the school. And then there's a lot of curriculum and education and outreach around that information, but it's literally broadcast in the school 24 seven So that's that's a big part of'",
        "'speaker_1': 'our air monitoring network. A second significant part of our air monitoring network is a a whole shed at Swansea Elementary, right adjacent to I-70. This is a partnership with CDOT and a federal highway to monitor the impacts of construction and so of the C site, the Central 70 construction project.'",
        "'speaker_1': 'So we're monitoring their other pollutants than just GM. We're also monitoring nitrogen dioxide, carbon monoxide, black carbon and V and an array of what they call volatile organic compounds, a number of different hydrocarbons, but things like benzene, toluene and other air toxics like that.'",
        "'speaker_0': 'Thanks, Bill, for that. And Councilwoman CdeBaca, I wanted to we've got three public hearings tonight, and I know we have members of the public here. I don't believe we're going to have committee work here on the council floor.'",
        "'speaker_0': 'I know you referenced that you had ten questions to ask and I got you up. Is this your final question? Okay. Very good. Thank you.'",
        "'speaker_2': 'What what are the policy changes that we're considering based on this air monitoring data? And if we don't have any specific policy changes, do we plan to develop some in the near future?'",
        "'speaker_1': 'So there's specific policies from just our air monitoring network. There are no policies under consideration in either our public health board or that we're planning at this time to bring to city council. The purpose of that program was to be an educational outreach tool to the schools through that Love My Air program.'",
        "'speaker_1': 'The benefit, though a secondary benefit for sure, is that we have now a wealth of data over at least the last two years. Three years, really, what, 19, 20 and 22 million of of data. We can start to analyze and look at policies.'",
        "'speaker_1': 'What kinds of things are driving our PM 2.5 concentrations and I'm managing a project right now to look at that data overall. And I also wanted to mention, you know, I've been talking with bring your your aide and I'm happy to to talk with your committee more.'",
        "'speaker_1': 'In March, we are scheduled to to talk in more detail. So hopefully we can get into more of your questions then as well.'",
        "'speaker_2': 'Thank you. That's it for my questions.'",
        "'speaker_0': 'Okay. Thank you. Thanks, Bill. Thank you. Councilwoman CdeBaca, we've got Councilmember Ortega. You're up next.'",
        "'speaker_3': 'Thank you. I just have one quick question for Mr. Oberman. Will this include any new sites or is this just to monitor data from existing locations?'",
        "'speaker_1': 'No, it will include new sites over time. We will help.'",
        "'speaker_3': 'Those be determined.'",
        "'speaker_1': 'Those are partly if it's school sites those sites were selected by. And I don't administer the Love Mayor program, so I may not give you all of.'",
        "'speaker_3': 'This site back to that program.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_3': 'Okay. Okay. I remember when all that came through. So this is to expound on the schools that were identified originally as part of that program, correct?'",
        "'speaker_1': 'That's correct. Okay. But it also could serve as a contract. I want to be transparent that it's not just that school contract. If there are one reason for calling it an on call contract is on occasion, like during the demolition of the I-70 Viaduct, we had community concerns about the dust that was caused by that action.'",
        "'speaker_1': 'And we set up temporary sensors, same types of sensors that we use at the schools. But these were six different sensors, additional sensors, I should say. They're not different models. We set them up. We monitor for about four months during that that dusty event, particularly in the Globeville Ilia Swansea area.'",
        "'speaker_1': 'And we did respond to events when the peaks went up. We had more conversations with Key West and and required them to perform more dust mitigation practices.'",
        "'speaker_3': 'So if we're going to have this in place for a period of time and we start seeing some work on the I-25 corridor during dirt. Throughout the area from Alameda to 20th Street, where they've been doing the Pell study.'",
        "'speaker_3': 'And it may be this contract exhaust before they actually start any work there. But if this were in place and there were to be some demolition or whatever, it potentially could set up some sites at that location as well, correct?'",
        "'speaker_1': 'Exactly. And with this contract in place, we can rapidly mobilize and respond to that need.'",
        "'speaker_3': 'Okay. Thank you. You answered my questions. I appreciate it.'",
        "'speaker_1': 'Sure.'",
        "'speaker_0': 'Thank you, Councilmember Ortega.'",
        "'speaker_2': 'Councilmember Sawyer in Spanish, president just wanted to point out that, you know, all of these questions sort of indicate why I continue to vote no on these contracts. The answer to these questions is really important and totally normal.'",
        "'speaker_2': 'And we should have on call contracts. It's the reporting to council piece, the piece where we don't know that kind of information because it's not it doesn't have the same kind of oversight as direct dollars and direct contracts.'",
        "'speaker_2': 'That is concerning to me. And I think I just wanted to point that out because I think this is a you know, this conversation that just occurred was a great example of exactly why it is that I continue to vote no until the reporting mechanisms get better.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. And we don't have anybody in the queue. And so, Madam Secretary, roll call on Council Resolution 22, Dash 0083, please.'",
        "'speaker_3': 'So you.'",
        "'speaker_2': 'Know.'",
        "'speaker_3': 'Torres I.'",
        "'speaker_2': 'Black I.'",
        "'speaker_3': 'CdeBaca and Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I i.'",
        "'speaker_2': 'I Cashman.'",
        "'speaker_3': 'I can each.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Ortega I see in the hall i. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': 'One Nay 11 nice.'",
        "'speaker_0': '11 Eyes Council Resolution 20 2-0083 has been adopted. Thank you, Bill and Will for being here this evening. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Sandoval, would you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_2': 'Yes. Give me 1/2, please. The agenda. Okay.'",
        "'speaker_3': 'Thank you for your patience. Mm hmm.'",
        "'speaker_2': 'I move? Oh. I move that? Okay. I move that resolutions be adopted in bills on final consideration. Based upon final consideration and do pass in the past block. Do pass in a block for the following items. Resolution three only recognizes the.'",
        "'speaker_3': 'Resolutions being. Okay.'",
        "'speaker_2': 'Zero 72. 73. 79. 83. 95. 98, 99. Okay. Correct.'",
        "'speaker_0': 'Let me think. I we're I'm going to I'm going to go ahead and run through the numbers here just so you have the motion on the floor. Thank you so much. We got it. We've got 75, 48, 94, 96, 97, one, ten, 73, 79, 95, 98, 99, 85 and 81.'",
        "'speaker_0': 'Did I get them all council secretary again?'",
        "'speaker_3': 'Yes, ma'am. Thank you.'",
        "'speaker_0': 'Okay. All right. Wonderful. Thank you. We've got the second by Councilman Herndon. And, Madam Secretary, roll call, please.'",
        "'speaker_3': 'Black eye CdeBaca. I, Clark. I earned it. I high. I cashmere.'",
        "'speaker_2': 'I can eat. I.'",
        "'speaker_3': 'Ortega. I. Sandoval. I. Sawyer. I. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results. 12 eyes, 12 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Thank you, Councilmember Sandoval. No worries. Worrying that the script sometimes will move on its own and so totally understand.'",
        "'speaker_0': 'So thank you. Our pre recess announcement tonight there will be a required public hearing on Council Bill 21, Dash 1437, changing the zoning classification for 901 North Kearny Street in Montclair, a required public hearing on Council Bill 21, Dash 1526 designating 555 East Eighth Avenue as a structure for preservation and a required public hearing on Council Bill'"
    ],
    "Zoning Change for 901 North Kearney Street in Montclair.": [
        "'speaker_0': 'So we can see council members. Oh, there we go. Thank you. Please accept the promotion. Once you accept the promotion, your screen will flash and say, reconnecting to meeting. Please do not leave the meeting. You will be reconnected and will need to turn on your camera if you have one.'",
        "'speaker_0': 'And your microphone. You will see your time counting down at the bottom of your screen. Once you have finished speaking, you will change back to participant mode and see your screen flash one more time. All speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their'",
        "'speaker_0': 'home address. If you have signed up to answer questions, only state your name and note that you are available for questions of council. Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted.'",
        "'speaker_0': 'Speakers must stay on the topic at the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilmember Sandoval, will you please put Council Bill 21, Dash 1437 on the floor for final passage?'",
        "'speaker_2': 'And will that council vote 21 1437 be placed upon final consideration and do pass?'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 21 Dash 1437 is open and I see we have Libbey here with us for the staff report.'",
        "'speaker_2': 'Thank you. Okay. Can you see that?'",
        "'speaker_0': 'Yes, I say so.'",
        "'speaker_2': 'Thank you. Council members. My name is Libby Adams with Community Planning and Development, and I'll be presenting the MAP Amendment at 901 North Carney Street. This is located in Council District five in the Montclair neighborhood. The applicant is requesting to rezone from urban edge single unit D X to Urban Edge Single Unit d1x to allow for an'",
        "'speaker_2': 'accessory dwelling unit. As stated previously, this property is zoned ESU d x, which allows the urban and suburban house forms on a minimum zone. Lot size of 6000 square feet. The site is currently occupied by a single unit home.'",
        "'speaker_2': 'There's mostly other single unit uses in this area with more commercial multi-unit directly west of the site. Then this slide shows the existing building form and scale with the subject property on the upper right hand side. A postcard notifying neighboring property owners within 200 feet of the site was sent out on September 21st.'",
        "'speaker_2': 'And then this went to planning board in early December, where they unanimously recommended approval. And to date, we have not received any any public comments regarding this rezoning. So the Denver zoning code has five review criteria that must be met in order for zoning to be approved.'",
        "'speaker_2': 'The first criterion is consistency with adopted plans, and there are three plans that are applicable to the site. This rezoning will further the strategies in the comprehensive plan by creating a greater mix of housing options in every neighborhood and promoting infill development where infrastructure and services are already in place.'",
        "'speaker_2': 'And then in Blueprint Denver, the future neighborhood context is urban edge. These predominantly residential areas are a mix of suburban and urban with regular block patterns. And then Blue Print identifies this property as a low residential place type where it says ads are appropriate.'",
        "'speaker_2': 'And then both Kearny and Ninth Avenue are local streets consistent with residential uses, the growth area strategy and blueprint, Denver and all all other areas of the city. This is where we anticipate to see 10% of new jobs and 20% of new housing by 2040.'",
        "'speaker_2': 'And then Blueprint also includes specific policy recommendations. So in land use and built form housing policy for strategy states that individual rezonings to allow ads are appropriate and should be small. An area which is what's proposed today. So then moving to the East Area plan, so similar to Blueprint, the East Area plan designates the future neighborhood context'",
        "'speaker_2': 'as urban edge, and the place type is low residential. But the area plan also further describes this low residential area as specifically single unit where 80 use are appropriate. And then the maximum height in the east area plan is two and a half storeys, consistent with the maximum height permitted in the proposed district.'",
        "'speaker_2': 'And then the area plan also includes specific guidance to integrate ADAS and missing middle housing in the in the Montclair neighborhood. So staff finds that the proposed rezoning is consistent with both citywide and neighborhood plans. Staff also finds the requested zoning meets the next two criteria.'",
        "'speaker_2': 'The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare by allowing gentle density in the Montclair neighborhood. And then staff finds there's a justifying circumstance for this MAP amendment with the newly adopted East Area Plan and blueprint Denver guidance to allow to use in the Montclair neighborhood.'",
        "'speaker_2': 'And lastly, the proposed zoning is consistent with the urban edge neighborhood context, the residential districts purpose and the specific intent of the ESU, D1 zoned district. So based on the review criteria, staff recommends approval of the proposed rezoning.'",
        "'speaker_2': 'And that concludes my presentation.'",
        "'speaker_0': 'All right. Thank you for the presentation. Libby and counsel has not received any written testimony on Council Bill 21, Dash 1437. And we have four individuals signed up to speak this evening. Our first speaker is Jeff Baker. Jeff, you're going to have to unmute yourself and you can go ahead, please.'",
        "'speaker_1': 'I'm just here for questions. If you guys have questions.'",
        "'speaker_0': 'Would you introduce yourself for the public?'",
        "'speaker_1': 'This is Jeff Baker, and I'm working with the clients at 901 Kearney along with Bruce O'Donnell. And we are the design build firm working with them.'",
        "'speaker_0': 'All right. Thank you, Jeff. Our next speaker this evening is Bruce O'Donnell.'",
        "'speaker_1': 'Hello, Madam President. A member of the council. Bruce O'Donnell, 386 Emmerson Street, Denver. And I want to agree with the staff report and the consistency with plans and especially the appropriateness cited in the neighborhood plan for integrating the use into this part of Denver.'",
        "'speaker_1': 'And I ask that council approve this this evening, and I'm available to answer your questions. You have. And thank you for your time.'",
        "'speaker_0': 'All right. Thank you, Bruce. Our next speaker this evening is Patrick Walsh. And I believe we have Pat Walsh and the attendees. Go ahead, Pat, please. And you're going to have to unmute yourself.'",
        "'speaker_1': 'Can you hear me?'",
        "'speaker_0': 'Yes, go ahead.'",
        "'speaker_1': 'Good evening, council members. My name is Patrick Welch. My wife and I purchased this home at 901 North Kearny Street back in 2003. About 18 and a half years ago. My wife's mother's just turned 79 years old and lives by herself.'",
        "'speaker_1': 'My father lives in Littleton and is 81 years old. And given the extremely high cost of assisted living facilities in and around Denver over the years, my wife and I have been thinking about better cost alternatives potentially for them.'",
        "'speaker_1': 'And building an ADU on our property, we felt, is the best way to go. Not only that, and as my wife and I age, we would probably be looking into moving that Ada Adu ourselves and at some point in the future as well, a bit easier on our legs from having to do stairs, etc..'",
        "'speaker_1': 'I request that council vote to approve build 21 Dash 1437 Rezoning 901 North Kearny Street. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jesse Paris.'",
        "'speaker_3': 'And I'm.'",
        "'speaker_0': 'Not. Seeing Jesse in the queue in attendees. So I'll let our producers look one more time. Oh, there we go. We had him moving over. Go ahead, please, Jesse.'",
        "'speaker_1': 'But even then, the city council might be hurt.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Yes. My name is just past the member present for Blackstone at the moment for self-defense, powers of execution, for social change, as well as the Unity Party of Colorado, the East Denver Residents Council and Frontline Black Knows. And I'll be the next mayor in 2023.'",
        "'speaker_1': 'Remember, this is on its mind, as you already know. And if you didn't know, I supported any deals when I ran for city council at large in 2019 and I will continue to support them in 2023. So I'm in favor of this rezoning tonight.'",
        "'speaker_1': 'I had a few questions, but to answer some, so I yield the rest of my time. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening. Questions for members of Council on Council Bill 21, Dash 1437. All right. Not seeing any. I'll give it one more time. Okay. The public hearing is closed. Comments by members of Council on Council Bill 21, Dash 1437.'",
        "'speaker_0': 'Council Member Sawyer.'",
        "'speaker_2': 'Thanks, Madam President. I agree that this is consistent with all adopted plans and given the amount of time and discussion we put into the Syria plan. I think the residents surrounding the area are also supportive or at the very least comfortable with the the plan as it stands right now.'",
        "'speaker_2': 'So I'm in support and I hope my council members will agree with me that this is consistent with all of the criteria. Thanks.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer and I agree as well that has met all of the criteria. And so we'll be happy to support this this evening as well. Madam Secretary, roll call on Council Bill 21. Gosh, 1437, please.'",
        "'speaker_3': 'Sawyer, I. Torres. I black. I see tobacco. Clark.'",
        "'speaker_1': 'I. Herndon.'",
        "'speaker_2': 'I haven't.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Cashmere high.'",
        "'speaker_2': 'Can each I.'",
        "'speaker_3': 'Ortega, i. Sandoval, i. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'"
    ],
    "Landmark Designation for 555 East 8th Avenue.": [
        "'speaker_3': '12 Hours.'",
        "'speaker_0': '12 Eyes Council Bill 21 Dash 1437 has passed. Thank you for the members of the community for joining us this evening. We're going to move on to our next hearing. Councilmember Sandoval. Will you please put Council Bill 21, dash 1526 on the floor for final passage.'",
        "'speaker_2': 'And move that council bill 21 1526 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 21, Dash 1526 is open and we're going to have the staff report here. And I believe we have Kara on joining us. Or it might be Jenny and Borg.'",
        "'speaker_0': 'I'll let you introduce yourselves.'",
        "'speaker_2': 'I can you hear me and see the screen?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Okay, good. My name is Karen. I work with Landmark Preservation in Community Planning and Development, and I am petitioning for my colleague Jenny, who was unable to make it tonight due to an emergency. So we are here for the designation application of 555 East Eighth Avenue.'",
        "'speaker_2': 'The application is running concurrently with a rezoning application that you will hear after this presentation, and the designation is considered a community benefit to the rezoning application. As you know, the designation process for landmark designation is a community driven.'",
        "'speaker_2': 'Home and applications can be submitted by a variety of persons. For this property owner submitted the designation application. The owner and applicant is Kara Christiansen. Karen Christiansen The property is in the Capitol Hill neighborhood in Council District three, a ten, I think, Councilman Hines district.'",
        "'speaker_2': 'It is zoned as a PWD 34, which also includes the Porter Coors Mansion, which is across eighth Avenue and is a Denver landmark and an empty parking lot to the Southeast. This current pod allows for office space in the buildings and new construction on the empty parking lot.'",
        "'speaker_2': 'Proposed rezoning is for 555 East Eighth Avenue, going from PD 34 to GM three with the use overlay. Three. The rezoning will allow for more varied uses on the site, including multi residential buildings, commercial uses, art studios, bed and breakfast, things that are allowed under use overlay three when a property is designated, but Brandon can give you'",
        "'speaker_2': 'more. So more details on the rezoning proposal. As you know, in order for a property to be designated, it must meet the following criteria be more than 30 years of age or of exceptional importance. As the structure was built in 1898, it is 123 years old.'",
        "'speaker_2': 'It meets that criteria. It needs to meet at least three out of ten significance criteria, maintain integrity and be considered by the Landmark Preservation Commission for its relation to a historic context. This application meets all of the designation criteria and it also meets three significant significance criteria that you see highlighted on the screen criteria B, C and'",
        "'speaker_2': 'F, which will go over now. So the property has direct and substantial association with two prominent families. First, with multiple generations of the heart family. And second, in the court family, both of whom are recognized persons who had influence on Denver and Colorado society.'",
        "'speaker_2': 'These earliest residents lived in the house from its construction in 1898 until 1915. The Hart family built the home and three generations resided there from 1898 to 1909. Charles and Elizabeth Hart and their son Richard, along with his family, Elizabeth and their children, John and Stefan.'",
        "'speaker_2': 'Together, they influenced society through professional fields of medicine and law, as well as philanthropic contributions. The most well-known Hart family member was Steven Hart, who was born while the family lived at the house. Steven would go on to co-found one of Colorado's largest and most influential law firms, Holland and Hart, and he served in the state legislature'",
        "'speaker_2': '. He also became Colorado's first state historic preservation office and his dedication to historic preservation. He was honored by the naming of the Steven H. Hart Research Center at History, Colorado, and the Steven H. Hart Awards, which are typically actually given tonight but were postponed due to Comic-Con and which are given to honor historic preservation accomplishments throughout the'",
        "'speaker_2': 'state. I'm on the court. Purchased the property from the Harts in 1909 and lived there with this with her husband, Peter McCourt, until her death in 1920 1912. Peter continued to live there until 1915 when the property was sold and then the court was known as an excellent businesswoman and well-respected socialite who aided many impoverished individuals and'",
        "'speaker_2': 'families. She is also acknowledged for her leadership and entrepreneurial spirit that drove her interest and significant involvement in the management of Denver's Broadway and Tabor Grand Opera House theaters, which her second husband, Peter McCourt, was also involved in.'",
        "'speaker_2': 'He was the brother of the infamous Baby Doe, Taylor Tabor, and the second who was the second wife of Silver King Horace Tabor. Peter McCourt was best known as the prominent theater manager of the world famous Tabor Grand Opera House and the Broadway Theater in Denver.'",
        "'speaker_2': 'He became one of the most successful theater managers in the country and grew the performing arts in Denver at the turn of the 20th century. He devised the well-known and long lasting silver circuit that booked performing acts across the city cities in Denver, in Colorado, as well as the West and the Northwest.'",
        "'speaker_2': 'And during the time when the McCourts reside and owned in the property, Peter was expanding the circuit. Due to its association with multiple recognized persons who had influence on society. The property meets criterion be. Both the primary and the accessory structures embody the distinctive visible characteristics of the classical revival or neoclassical architectural style, which was popular in'",
        "'speaker_2': 'the US from 1895 through the 1950s. The primary structure was constructed in 1898, designed by Denver architects Varian and Sterner. The classical revival style is distinguished from other contemporary revival styles of the time by its use of symmetrical facades, with central entries for height porches supported by classical columns and the use of classical details such as broken'",
        "'speaker_2': 'pediment, dental cornices and balustrades. The primary structure exemplifies the classical revival style with its dramatic front porch, which dominates the front facade. These are supported by a period iconic columns, along with a decorative balustrade on the second level.'",
        "'speaker_2': 'The overhanging eaves feature dental courses and frieze bend underneath the cornice. A site edition carries many of these character defining features, including the balance, strike corners and dental courses. The 1911 Carriage House was designed by Denver firm Stirner and Williamson, Stringer's subsequent architectural firm, and also exemplifies the classical revival style and its design elements.'",
        "'speaker_2': 'And finally, the property is also significant as an established and familiar feature of the Capitol Hill neighborhood due to its prominent location and physical characteristics. It represents over 120 years of Capitol Hill, Capitol Hill history and evolution. Additionally, its prominent location facing onto and elevated above East Eighth Avenue, coupled with its sizable massing scale and architectural features'",
        "'speaker_2': ', makes it a familiar and orienting feature of the neighborhood. It is the oldest surviving structure on the block between eighth and ninth Avenues and Pearl on Pennsylvania streets. Over time, most single unit structures and properties were replaced by tall multi-unit structures, which primarily now surround 55 East Eighth Avenue.'",
        "'speaker_2': 'The exception is the property directly to the north and south on East Avenue and across from the Hartford courthouse, which are also known for landmarks. In addition to meeting the three criteria, the property retains integrity. It remains in its original location.'",
        "'speaker_2': 'There have been some exterior alterations, but they are sensitive to the original design materials and workmanship as well as the feeling and association of the property. The west and north are rear additions in the porch and closure to the primary structure, which was made in 1929, are compatible with the building's character and do not negatively impact the'",
        "'speaker_2': 'building's integrity. The addition of the retaining wall and parking lot to impact the setting and feeling, but do not detract from the essential features of the primary structure and carriage house. Overall, the property retains good integrity. The period of significance for this is 1898, the year of construction to 1950.'",
        "'speaker_2': 'It is it involves the construction of the house, the addition of the carriage house and the years of the heart and the court families resided at the address. The property relates to the context of Denver's recovery and expansion.'",
        "'speaker_2': 'Following the panic of 1893. Due to the silver crash, Denver experienced an immediate economic downturn that lasted several years and never negatively impacted the city. While many of Capitol Hill's wealthy families were left penniless after the silver panic, this was not the case for the Hart family, whose financial and social status survived due to their careers in'",
        "'speaker_2': 'medicine and law. And and Peter McCourt, who owned the property next after the city had recovered from the economic downturn. Their six years of ownership fell during a time of continued growth through Denver's economic diversification. And so it is relates to the economic growth of Denver in the early 1900s.'",
        "'speaker_2': 'And the ABC found that it related to a historic context. In summary, the property meets all the criteria for designation. It's more than 30 years old, meets three designation criteria b, c, an F maintains its integrity and the LPC found that it related to historic context.'",
        "'speaker_2': 'Two individuals submitted emails in support of the designation and none in opposition. And so the Preservation Commission unanimously recommended approval of the designation application on December seven. Therefore, staff recommends approval for the designation of five, five, five East Eighth Avenue as a structure for preservation.'",
        "'speaker_2': 'I'm happy to answer any questions you might have.'",
        "'speaker_0': 'All right. Thank you very much, Kara. And council this evening has not received any written testimony on Council Bill 21 1526. We have four individuals signed up to speak this evening, and our first speaker is M Karen Christiansen.'",
        "'speaker_0': 'You might have to unmute yourself. And Mr. Christiansen, you can go ahead, please. I thought you had unmuted. Go ahead. I'm going to ask you to Amu. There you go.'",
        "'speaker_3': 'Okay. My name is Karen Christianson. I'm a native of Denver. And I that I live at one, three, three Evergreen Road in Gilpin County. I'm the owner of 555 East Eighth Avenue. I'm also 76 years old, and I love this building.'",
        "'speaker_3': 'It's a beautiful building of I hope to care for for many years, and it.'",
        "'speaker_2': 'Certainly deserves.'",
        "'speaker_3': 'A landmark designation. I request the Council vote for approval bill. 20 1-1526 for landmark designation for 555 East Eighth Avenue. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker this evening is Bruce O'Donnell.'",
        "'speaker_1': 'Hello, Madam President, and members of the council. This is Bruce O'Donnell at 386 Emmerson Street in Denver. And Karen Christianson, who just spoke, who's the owner of Phi Phi Phi, the State Avenue. And I started on this project a couple of years ago, and I'm involved primarily in the rezoning of the property, which is, as Cara from'",
        "'speaker_1': 'Landmark's put it, is kind of a companion piece of legislation. And it's necessary that the rezoning and the landmark designation be considered in unison. And so I'm requesting that City Council vote to approve the landmark designation for Phi Phi Phi V State Avenue this evening.'",
        "'speaker_1': 'And I'm available to answer questions. Should you have any? Thank you.'",
        "'speaker_0': 'Thank you, Bruce. Our next speaker is Annie Levinsky.'",
        "'speaker_2': 'Good evening, members of City Council. I'm Annie Levinsky. I'm the executive director of Historic Denver, located at 1420 Ogden Street in Denver. And we're here to offer our support for this designation. And I particularly want to start with our expression of gratitude to Mr. Christiansen for taking this on.'",
        "'speaker_2': 'We met with her first a couple of years ago when she was just thinking about this and wanting to make sure that the house had or that the structure had expanded uses continue to serve the community. And she's gone on to work with Mr. O'Donnell and others to prepare the application.'",
        "'speaker_2': 'So we really appreciate those efforts. Obviously, the home has significant ties to people in Colorado history and great architecture. And Karen went through all of those details. So I'll just add the other comment around how this is a great example of how our structures can be adapted to meet contemporary current community needs.'",
        "'speaker_2': 'So we see this home now positioned to be a multifamily dwelling complex and have the flexibility to change again over time. So we just are really pleased to see that happening and appreciate your support for this designation as well as the rezoning.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Annie. And I have to say, I think you're the first speaker that we've had tilted in our Zoom platform, so congratulations. You're the first one that way. Our final speaker on this hearing is Jesse Paris this evening.'",
        "'speaker_0': 'Go ahead, please, Jesse.'",
        "'speaker_1': 'Counsel. May I be heard?'",
        "'speaker_0': 'Yes, go ahead.'",
        "'speaker_1': 'The pairs represent for Blackstone Maximo for self-defense as the Mexican man for social change, as well as the Unity Party of Colorado and for a long black nose along with the East Denver Residence Council. And I'll be the next mayor of Denver in 2023.'",
        "'speaker_1': 'I'm in favor of this preservation tonight. For all the reasons that have already been discussed, it meets all the criteria. It's a historical site. It needs to be preserved. And I support preservation of many of Denver Oracle sites.'",
        "'speaker_1': 'So I support this one as well. I'm very thrilled and happy to hear that this might be a more time family dwelling. Let's hope that it's an affordable reasonably. We do have a housing crisis. So I'm in full support of this.'",
        "'speaker_1': 'My thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of Council on Council Bill 21, Dash 1526. The public hearing is closed. Comments by members of Council on Council Bill 21, Dash 1526 Council Member Hines Thank you.'",
        "'speaker_1': 'Council President I am really excited to see this be up for consideration as a historic for historic designation. I've been I've gone by this, this home lots of times in my trips down to Trader Joe's and and some of the restaurants, the banana restaurants that have also been considered for historic work.'",
        "'speaker_1': 'Some people have suggested they should be considered for historic preservation. This this is a this is a gem. It's a really it's it's such a beautiful place. And I just want to mention one other thing. So I would encourage my colleagues support of the historic designation.'",
        "'speaker_1': 'And we'll talk about the rezoning here in a second. But but there are letters of support from neighboring neighboring establishments. There are letters of support from registered neighborhood organizations. And in fact, the neighborhood organizations were strongly encouraging this historic designation just because it's such a gem.'",
        "'speaker_1': 'So I want to thank the applicant for being willing to to consider historic designation and and for also specifically for moving these two public hearings together, because I think that really helped the surrounding community feel at ease that that it would be designated as well as as have the rezoning.'",
        "'speaker_1': 'So I encourage support from my colleagues, support from my colleagues. And I will certainly be voting. Yes. Thank you. Council President.'",
        "'speaker_0': 'Thank you, Councilmember Hines, and I am happy to support this tonight. I think Kara and team did a great job. No opposition to something of this matter. And so I appreciate the work and happy to support it. Madam Secretary, roll call on Council Bill 21 1526.'",
        "'speaker_3': 'Hynes.'",
        "'speaker_2': 'I Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Can each.'",
        "'speaker_3': 'I. Ortega a. Sandoval. I swear.'",
        "'speaker_2': 'I. Torres. I. Black.'",
        "'speaker_3': 'I see tobacco. I.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Madam President.'"
    ],
    "Rezoning of 555 East 8th Avenue in Capitol Hill.": [
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_3': 'Two of us.'",
        "'speaker_0': '12 Eyes. Council Bill 21 Dash 1526 has passed. Thank you to the member of the public who joined us on that one. And we're going to move to our third and final hearing. Councilmember Sandoval, will you please put Council Bill 21, Dash 1536 on the floor for final passage?'",
        "'speaker_2': 'I move that council bill 21 1536 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Ticket and queue has been moved and we've got the second there as well. The required public hearing for Council Bill 21 1536 is open. May we please have the staff report? And I see we've got Brandon Schaefer joining us.'",
        "'speaker_1': 'Certainly. Thank you, Madam President. And good evening, members of the Council. I'm here to present the rezoning component for five, five, five East Eighth Avenue, requesting to resume from PVD 34 to GMU 303. Again, this request is in District ten in Capitol Hill at the northwest corner of East Eighth Avenue and North Pearl Street.'",
        "'speaker_1': 'The site is just under 12,000 square feet in land area and proposing three zone to GMI 303, which would allow for residential uses as well as some limited commercial uses if landmarked as a historic structure, which it just was.'",
        "'speaker_1': 'These uses include office, not including dental or medical clinic, art studio and bed and breakfast lodging. Detailed the existing zoning in the next slide. But you can see here and largely this part of the neighborhood is generally zoned gmu of some variety, some height, at least five stories, 12 stories, three stories, most of which include the historic'",
        "'speaker_1': 'structure use overlay. The current zoning was approved in 1980 and was intended for development a low rise office kind of cluster. You can see the subject property outlined in red on the top left. That dirt is personal to this was to be renovated and converted to office, which it was the maximum height for all three of these'",
        "'speaker_1': 'structures or anticipated structures was to be 55 feet. And most of the requirements were largely focused on the future development of personal three, which is to the Southeast and is still currently used as a parking lot. As this part of the PD would be taken out of this part of the this party would be taken out of'",
        "'speaker_1': 'the former Chapter nine code. And in the new code, staff did analysis and determine that there would be no adverse impact on the remaining properties. This is also within that she's been Park Botanic Gardens view plan which at this part would allow for maximum height of 130 to 134 feet.'",
        "'speaker_1': 'However, the requested zoning has a maximum height at much lower at 40 feet. I'm Karen noted a number of adjacent landmarks and historic districts which you can see here. And existing land use as currently office as anticipated by the current beauty and surrounding land users include single unit, residential, multi-unit, residential, additional office and some parking users.'",
        "'speaker_1': 'Here you can see the subject site on the bottom left and the remaining property to be left in the pad on the bottom right. Recent sent information notice of this application and mid lease September and moved to planning board in mid December where this was moved forward unanimously and to today.'",
        "'speaker_1': 'We have received two letters of support from the nearby RINO's as well as a letter of support from the property owner that's remaining empty. Three four. Moving to the review criteria, we have three plans to look at. This request is consistent with a number of strategies organized by vision element that include creating a greater mix of housing'",
        "'speaker_1': 'options, ensuring neighborhoods offer a mixture of housing types and services, and promoting infill development where infrastructure and services are already in place. The request is also consistent with the general urban neighborhood context map and Blueprint Denver and with the High Residential Future Place, which talks about predominantly multi-unit residential uses with some compatible commercial uses and buildings generally'",
        "'speaker_1': 'being the tallest of all residential places in the general urban neighborhood. Context. Additionally, this request is consistent with the future street types in this area, with East Eighth Avenue mapped as a residential arterial. And this fits into all other areas of the city growth area strategy where we expect 10% of jobs and 20% of housing by 2040'",
        "'speaker_1': '. And this also is consistent with a number of other strategies and Blueprint Denver that speak to preservation of structures, rezoning properties out of the former zoning code and limiting the site, limiting the use of custom zoning. This is also in the East Central Area plan.'",
        "'speaker_1': 'These strategies also speak to preservation of historic structures and facilitating adaptive reuse of those structures. And the East Central Area Plan maps. You can see again mapped to future neighborhood context as general urban and a high residential future place.'",
        "'speaker_1': 'However, the neighborhood plan does give us a little bit more guidance on height with the subject. Property in this plan mapped is up to three stories. Steph also finds the request to be consistent with the next two criteria, resulting in lead informing of regulations and furthering the public health, safety and welfare through facilitating residential use of the'",
        "'speaker_1': 'property and allowing those limited commercial uses. I spoke to earlier staff friends to justifying circumstances for this rezoning. The first being changed or changed conditions. I. Capitol Hill has seen a lot of reinvestment and redevelopment since the property was last resolved in 1980, and alongside that, the property retained the former Chapter 39 zoning after the city adopted'",
        "'speaker_1': 'the Denver Zoning Code in 2010. Lastly, this request is consistent with the general urban neighborhood context, the residential zoned district purpose and intent statements. Therefore, CPD recommends approval based on finding all review criteria at the Met. Thank you.'",
        "'speaker_0': 'Thank you, Brandon, for the staff report. And this evening counsel has not received any written testimony on Council Bill 21 1536. And we have four individuals signed up to speak this evening and I have the first speaker as Brandon Shaver.'",
        "'speaker_0': 'And so I'm imagining that's a mistake or I wanted to give you the opportunity. Brandon, if you did sign up for public comment.'",
        "'speaker_1': 'I think I said my, my, my piece, but happy to answer any questions. Thank you.'",
        "'speaker_0': 'All right. Very good. Thank you. Our next speaker this evening is Bruce O'Donnell.'",
        "'speaker_1': 'Hello again. Members of Council Bruce O'Donnell, 386 Emmerson Street in Denver, District ten. And as I said earlier, I've been working with the owner, Mr. Christensen, for a couple of years now on this rezoning. And when we started out, we met with the community and immediate neighbors and RINO's and also with CPD, and we got very clear'",
        "'speaker_1': 'signals that the only path forward or an important component of a path forward on a rezoning was that the building be protected. It was obviously not designated in any way. And so Karen Christensen embarked on that effort. And thank you for earlier this evening, approving the landmark designation as a companion piece to the rezoning.'",
        "'speaker_1': 'It's very important to the neighbors of the community. And we also have two letters of support from the Rose Capitol Hill, United Neighbors and also Neighbors for greater Capitol Hill are both in support of the rezoning, largely in part because of the landmark designation.'",
        "'speaker_1': 'This property has been zoned in a real goofy, old 1980s PD that was very restrictive and bound this property to unrelated properties on the east side of eighth Avenue and it only allowed office uses where in fact this is a house and so getting it resounded.'",
        "'speaker_1': 'The G three, as Brandon explained, is consistent with every plan we have. We in addition to the two and all letters of support, the third letter of support is from the Denver Employees Retirement Plan, or derp, which is the direct neighbor across eighth Avenue and remains in the old pub.'",
        "'speaker_1': 'They are unaffected. And with all that I ask that City Council please vote to approve the rezoning of five five, five. The State Avenue this evening is a companion legislation to the landmark designation, and I'm available to answer questions.'",
        "'speaker_1': 'Should you have any? Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Karen Christianson. And you'll have to unmute yourself. There you go. Oh, it looks like you are muted again. Oh, there you go. We can hear you. Go ahead.'",
        "'speaker_3': 'Okay. I'm not getting video, though. That's all right. My name is Karen Christianson. I'm the owner of five, five, five East Eighth Avenue. I currently live in the mountains, but I would like to make this place my primary residence because it's getting harder and harder at my age to live in the mountains.'",
        "'speaker_3': 'It is a lovely old home and I want to live here. So I request the council vote to approve build 20 1-1536. Rezoning 555 you state avenue to g dash m. You dash three with a u. Oh. Dash three overlay.'",
        "'speaker_3': 'Thank you for your time.'",
        "'speaker_0': 'Thank you. And our next speaker is Jesse Paris. And we'll have our producers go ahead and move Jesse over into the queue. There we go. Go ahead, please. Jesse.'",
        "'speaker_1': 'But. Yes. My name is just the opposite for Black Star maximum for self defense, positive action for Social Change as well as the East Denver Residents Council, the Unity Party of Colorado and frontline black males. And I'll be the next mayor of Denver in 2023.'",
        "'speaker_1': 'I'm in favor of this rezoning, just like I was in favor of the landmark preservation of five, five, five East Eighth Avenue. So I am still in support of the rezoning as well. Like I stated earlier, it's going to be a multi-family dwelling though it says awesome as opposed to an affordable housing crisis and the occupant wants'",
        "'speaker_1': 'to move back into the Pueblo. And we saw from their consistency with adopted plans, uniformity in supply relations for this public health, safety and welfare means justifying circumstances, inconsistency with neighborhood context zone this intent. So it meets all five of the criteria for a rezoning and I'm in favor of it.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening. Questions from members of Council on Council Bill 21, Dash 1536. Give it a moment for any questions. All right. The public hearing is closed. Comments by members of Council on Council Bill 21, Dash 1536.'",
        "'speaker_0': 'Councilman Hines.'",
        "'speaker_1': 'Council President, I. I want to urge support from my colleagues for this as well. I want to, um, I want to thank Ms.. Christiansen for for her hard work. I want to thank her also for reaching out. Two years ago, I we had we had these conversations right at the very beginning of the pandemic.'",
        "'speaker_1': 'Mr. O'Donnell even reached out before the pandemic started. But but unfortunately, by the time we were able to get our our meeting underway, that pandemic had started. So I hope some day that I get to meet Mr. Christiansen in person in three dimensions.'",
        "'speaker_1': 'But this is just such a great story. And I want to thank my colleagues for for designating this as a historic landmark, because as as Mr. Shaver mentioned, this is a growing, vibrant, new you know, there are a lot of historic buildings, but but there are a lot of them are going away in favor of some of'",
        "'speaker_1': 'the new development. So we can have development in our city while remembering where we came from. And this is just such an amazing example of where Denver came from. So I urge a yes vote and certainly I will be voting yes.'",
        "'speaker_1': 'Thank you. Council President.'",
        "'speaker_0': 'Thank you, Councilmember Hines, and happy to support this this evening. It's all of the rezoning criteria. And Madam Secretary, roll call on Council Bill 21 desk 1536, please.'",
        "'speaker_1': 'Ain't I?'",
        "'speaker_2': 'Cashmere. I can eat. I.'",
        "'speaker_3': 'Ortega. I. Sandoval. I swear. I. Torres. I am black. I see tobacco. I collect.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results.'"
    ]
}