{
    "Proclamation for Stella Madrid's Retirement.": [
        "'speaker_1': 'Thank you, Councilmember Flynn. We echo those accolades for Angela and wish her best of luck in this new chapter of her life. And so thank you. All right. Seeing no other hands raised for announcements, we will move on.'",
        "'speaker_1': 'There are no presentations this evening and there are no communications. There is one proclamation being read this evening. Councilmember Ortega, would you please read Proclamation 20 1-0531 for us, please.'",
        "'speaker_3': 'Happy to do so, Madam President. Proclamation number 20 10531 in honor of Stella Madrid on the occasion of her retirement from Denver Housing Authority. Whereas, Stella Madrid has been a proven leader for 30 years of success in areas of affordable housing, community development, sustainability, community involvement, resident civic engagement, communications and leadership.'",
        "'speaker_3': 'And she has retired as intergovernmental and Community Affairs Officer from Denver Housing Authority of the City and County of Denver. Whereas Stella has worked on many of the A's in Denver housing and community initiatives that provided safe, affordable housing and community engagement.'",
        "'speaker_3': 'And. Whereas, Stella led changes including staffing, all of DHS, U.S. Department of Housing and Urban Development, oh six and HUD Choice, Community Revitalization and Transformation Efforts from Newton Homes in 1994 to 95 and Curtis Park Homes in 1998 to Benedict Park Place in 2002.'",
        "'speaker_3': 'And. Whereas, Stella helped lead the successful team that was awarded a $22 million oh six grant from the Department of Housing and Urban Development, leading to the transformation of the former South Lincoln Homes in West Denver and into the award winning mixed income Mariposa District, preserving 250 units of public housing and addressing over 300 workforce and market'",
        "'speaker_3': 'rate units in 2010. And. WHEREAS, Stella worked on a team that was awarded a $34 million choice neighborhood implementation grant from the Department of Housing and Urban Development to transform the Sun Valley neighborhood as a transit oriented development, preserving 333 units of public housing and creating over 800 units of workforce and market rate units in 2016 and'",
        "'speaker_3': '2017. And. Whereas, Stella has been a community and civic leader in the city and county of Denver, serving on numerous community boards, working with the Colorado congressional offices and state and local elected officials. And she was active in community campaigns for the complete count U.S. Census and voter registration and outreach.'",
        "'speaker_3': 'And. Whereas, Stella was lead staff for COVID 19, funds for onsite testing and vaccinations to reach the most vulnerable residents in partnership with Denver Public Health and Environment and Denver Health and Hospitals Authority. And. Whereas, Stella's colleagues, DHS residents, the Board of Commissioners and her city friends and associates will miss her compassion, empathy, dedication, tireless work and'",
        "'speaker_3': 'leadership on behalf of the Denver Housing Authority. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council hereby recognizes Stella Madrid's years of service to Denver citizens and her professional and personal dedication to the housing authority of the city and county of Denver and thanks her'",
        "'speaker_3': 'on this occasion of her retirement on April 30th, 2021, that the clerk of the city and county of Denver shall affixed the seal of the city and county of Denver to this proclamation and a copy be transmitted to Stella Madrid.'",
        "'speaker_1': 'Thank you. Councilmember Ortega, your motion to adopt.'",
        "'speaker_3': 'Thank you, Madam President. I move for the adoption of proclamation number 20 10531 second titled.'",
        "'speaker_1': 'All right. We've got the second there by Councilman Hines. I heard him first. Their comments by members of council.'",
        "'speaker_3': 'Councilmember Ortega Thank you, Madam President. I also want to thank Council President Pro Tem Torres for co-sponsoring this proclamation with me. I've known Stella for all these years that she has worked for the Denver Housing Authority and had the opportunity to interface with her on many of the projects that were just read aloud.'",
        "'speaker_3': 'Stella is an amazing individual who has been just an incredible champion for the residents of Denver Housing Authority. She has done that with the utmost professionalism and advocacy on their behalf, many times interfacing with all of us, but also her work with the congressional delegation and with the state in in her work of trying to speak out'",
        "'speaker_3': 'on behalf of the residents. There was an event held on Friday for Stella. I was unfortunately not able to be there. I had a plumbing problem at my house and the plumber was here and they just had things kind of torn apart.'",
        "'speaker_3': 'But. So, Stella, I texted you expressing why I couldn't be there, but I'm really sorry. I know it was a great event. I talked to people who were there. You're going to be missed. And I know you and I will have a date on the golf course where we'll get a chance to go out and play some'",
        "'speaker_3': 'golf. And to the comment that was made earlier about individuals in our city who dressed to the nines. Stella is one of those individuals and she doesn't really do that in her professional life. You could best assure she's the best dressed person on the golf course as well of Stella.'",
        "'speaker_3': 'You're going to be missed. Thank you for your many, many years of service to the citizens of the city and county of Denver. And I know this isn't goodbye. You and I will continue to be friends for many years past.'",
        "'speaker_3': 'You're leaving the city, but I wish you all the best. And God bless. And your retirement. Thank you, Madam President.'",
        "'speaker_1': 'Luke, you council member Ortega. Next up, we have Council President Pro Tem Torres.'",
        "'speaker_2': 'Thank you, Madam President.'",
        "'speaker_3': 'Thank you so much. I think the ordinance gave just such a great synopsis of your influence.'",
        "'speaker_1': 'You have.'",
        "'speaker_3': 'Been such a a commodity for me as I'm kind of coming up in the city and getting used to the way things work and challenging things and just really appreciate your guidance and leadership and getting to know you even better.'",
        "'speaker_1': 'Through the DOJ board.'",
        "'speaker_3': 'I want to just quickly thank you for the work that you do and probably will continue to do for the River Sisters Organization in connecting Denver's River Network.'",
        "'speaker_1': 'To that of.'",
        "'speaker_3': 'Our community and our ancestry in Mexico. And so it's just really appreciate that and giving that it's not in the Sun Valley Park planning and really looking forward to that coming to fruition. So just thank you so much, Stella, and you will be missed.'",
        "'speaker_1': 'Thank you. Up next, we have Councilman Flynn.'",
        "'speaker_0': 'Thank you, Madam President. I want to second what Councilwoman Ortega and Torres have just said. Stella has the Stella and I actually met many, many, many years ago when I was at the newspaper and many, many executive directors of DHS ago as well as well, most likely.'",
        "'speaker_0': 'And it was a pleasure to work with you all that time. And now, especially even before I got on council working with you here. Stella and I were chair and co-chair respectively of our House District one Democrats, and we worked well together.'",
        "'speaker_0': 'We were a great team. Ben and I and Councilwoman Ortega. I was able to get up to the to the reception up in that up in northwest Denver on Friday and say my personal thanks to her and my and my wife as well.'",
        "'speaker_0': 'And I think, Stella, you told me and you can confirm publicly here that your intention in retirement, when a lot of people say, you know, what are you going to do now that you're retired and and you're going to follow my wife's footprints and say, I'm going to do nothing?'",
        "'speaker_0': 'That's what retirement is. You know, go play golf, just enjoy yourself. But if you choose to re involve yourself in any social or civic activities, you're most welcome back. And as a constituent of Council District two, especially, we would we would love to hear your voice continuing.'",
        "'speaker_0': 'Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Councilmember Flynn. Councilmember Kenny.'",
        "'speaker_2': 'Thank you so much, council president. Thank you to Councilwoman Ortega for sponsoring this. And Stellar. I'll just be brief and say thank you. You know, I was saying to someone else who is departing the city today that their legacy that sometimes public servants leave behind is the impact they have on lives who may never know their name'",
        "'speaker_2': 'and may never know the impact. And so but but we here can bear witness. And I actually do wish for you that you get to have fun and continue to stay engaged right in your retirement. I think you deserve both.'",
        "'speaker_2': 'And we're you know, just I was blessed as I learned about housing and the world of affordable housing before I was elected. You were in that world already someone that I met in that pre council life. And so I just want to thank you in particular for the dedication you've had to housing for our residents from so'",
        "'speaker_2': 'many different walks of life. So thank you and good luck to you and congratulations.'",
        "'speaker_1': 'Thank you, Councilmember. Up next, we have Councilmember Sandoval.'",
        "'speaker_2': 'Thank you, Madam President. And Stella, you'll be greatly missed. So our families go long back in northwest Denver. And as I was learning to navigate being a council aide and figure out this city and not long right after I had started working, my dad had just passed.'",
        "'speaker_2': 'And you always just allowed me that grace and consideration because I think you probably saw it on my face during those first couple of years of how much I missed him. And you missed his guidance and you were just so kind and loving and always just reminded me that he was watching.'",
        "'speaker_2': 'And so that I always think of that when I think of you and I always talking about my mom and the work that you did. I'm sorry I wasn't able to be there on Friday, but I know that it was a great year, said Northwest Denver.'",
        "'speaker_2': 'And as everyone else said, Please don't be a stranger. I know that you're not going now. I'm going to call you and we'll catch up and I'll see you around because our paths crossed prior to council and the do it after that.'",
        "'speaker_2': 'Just you've left a legacy on me and my family and all of us. And so thank you for always considering everyone else in my family. When you talk to me and what was going on, it was so helpful and enjoy your retirement.'",
        "'speaker_2': 'It's well-deserved. Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Sandoval. And see no other hands raised. I'll go ahead and chime in. Congratulations, Stella, on a job well done. And it's been an honor to get to know you and work with you. And it all works out in the end.'",
        "'speaker_1': 'It's such an honor to have you celebrating your retirement through this proclamation. And you also helped craft some of the exemptions for the rental license policy that we're also hearing tonight. And so I appreciate your partnership and your legacy.'",
        "'speaker_1': 'Your legacy will definitely live on and hopefully we will be able to see you around, if not in a housing capacity, in some other community capacity. And so sincere congratulations to you as well. Madam Secretary, roll call, please.'",
        "'speaker_3': 'Ortega, I. Torres. I stand all.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Sawyer.'",
        "'speaker_2': 'I. Black. Hi.'",
        "'speaker_3': 'CdeBaca. I, Clark.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Hi.'",
        "'speaker_5': 'Hi.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_0': 'Hey.'",
        "'speaker_2': 'Can I?'",
        "'speaker_3': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_3': '12 days.'",
        "'speaker_1': '12 eyes proclamation 20 1-0531 has been adopted. We have 5 minutes for an acceptance speech or proclamation acceptance. Councilmember Ortega We'll go ahead and start that timer if you'd like to call up who you would like to accept this proclamation.'",
        "'speaker_3': 'Absolutely. So as you can see, we've got Stella Madrid with us. And so she got a chance to hear all of your comments. So stellar. Now your turn to make some comments. So thank you for being here with us tonight.'",
        "'speaker_3': 'Oh, well, thank you. I'm honored to have this proclamation tonight and certainly honored to hear all the words and kindness that you've all expressed. As was mentioned, I.'",
        "'speaker_2': 'Joined that housing authority in 91.'",
        "'speaker_3': 'And I have worked with every single city council office through those years. And each of your office does. And I want to thank you, all of you personally, council, council, as well as your staff. They have always been accessible and responsive.'",
        "'speaker_3': 'You know, I know Councilman Flynn mentioned his work through all the past executive directors, but I also want to acknowledge my work with with them specifically Kevin Markman, who was our former HUD assistant secretary for public housing. In addition to the DHS director and our wonderful dear friend Salvador Carpio, former Denver city councilman, oh, God bless his'",
        "'speaker_3': 'soul and his smile. Get a little who all of those executive directors believed in community and the residents. So there was a natural match for us to move down the path of.'",
        "'speaker_2': 'Serving our community.'",
        "'speaker_3': 'And meeting the needs of our residents. And I will say, you know, working for DHS was one of my most.'",
        "'speaker_2': 'Rewarding and enriching work.'",
        "'speaker_3': 'Since the eighties that I've been in public service with the state, with the city, the Mayor's Office of Employment and Training, DHS, and all my work in the community. And in closing, because I know it's a short it's a short night tonight on your agenda, and I don't want to lengthen it.'",
        "'speaker_3': 'But in closing, I really want to thank my family, all of you and all of us in public service. We know what a sacrifice our families make. I want to thank my sons for all their support, all their understanding and their encouragement.'",
        "'speaker_3': 'They shared me with my work. Right. And they share, you know, just like your families. My sons shared me with all my work in all these years, the many nights, the early mornings, the many, many, many community meetings during the week and on the weekends.'",
        "'speaker_3': 'We all know what we do, and we all do it because we do it from our corazon and we do it because we believe in what we're doing and who we're serving. Not for the accolades. But again, I'm humbled and I thank you all so very much.'",
        "'speaker_3': 'I will be around. And like many of us say, it's not goodbye. It's just we'll see you down the road. So thank you.'",
        "'speaker_1': 'Thank you again, Stella, and congratulations. And enjoy that retirement. It's well-deserved.'"
    ],
    "Licensing and Inspection System for Residential Rental Properties.": [
        "'speaker_1': 'All right. Thank you, Councilwoman CdeBaca. And thank you, Jessica, for the answers. And we are going to go ahead and move along then. The next item up is Council Bill 420 Council Member Clark, will you please put Council Bill 420 on the floor for final consideration.'",
        "'speaker_0': 'As Council President and move that Council Bill 420 be placed on final consideration and do pass.'",
        "'speaker_5': 'Second.'",
        "'speaker_1': 'Thank you. It has been moved and seconded, council members say, to pocket your motion to amend.'",
        "'speaker_2': 'A move that council bill 20 1-0 420 be amended in the following particulars on page two. Line five strike January 1st, 2023, and replace it with July 31st, 2022 and on line 14. Strike January 1st, 2024 and replace it with July 31st, 2022.'",
        "'speaker_1': 'All right. We have a move. We have it moved. And I think I heard the second there is that Councilman Hines second. Okay. All right. We've got the second from Councilman Hines questions or comments by members of council on this amendment.'",
        "'speaker_1': 'Councilmember CdeBaca.'",
        "'speaker_2': 'Thank you. This change is to basically bring the compliance requirement date a little sooner, a little closer to us for the rental registry. We have it bumped out in in two phases one for our multi-unit, one for our single family units.'",
        "'speaker_2': 'And I think we should just be creating some parity there and making them both required compliance by 2022. I think that would meet the needs of our residents in the city a little bit better. And this is something that's been raised along with my upcoming amendment by our constituents, especially having spent a lot of time talking to'",
        "'speaker_2': 'mom and pops, mom and pop landlords for our Right to counsel initiative. While the sooner they might be a challenge for everybody, folks really want to see parity across what we're asking of all landlords. And so this is to achieve that.'",
        "'speaker_1': 'All right. Thank you, Councilmember Hines.'",
        "'speaker_5': 'I think you're council president. Do you know if this was the implementation date was discussed in the stakeholder process?'",
        "'speaker_1': 'Are you asking me or Councilmember CdeBaca?'",
        "'speaker_5': 'Well, ideally, I would ask you, but I don't know if there's someone else that that that has knowledge of the stakeholder process or I mean, ideally, I would ask someone who is part of the stakeholder process as opposed to having you play dual role of sponsor and council president.'",
        "'speaker_5': 'But if you're willing to answer it, I don't I don't want to put you on the spot.'",
        "'speaker_1': 'Oh, I'm perfectly happy to answer that question. Yes, we discussed the phasing in depth because this will be the largest license that we have within the city and county of Denver. And so, as you might imagine, excise and licensing would like to see the phasing because they need to get this program stood up.'",
        "'speaker_1': 'And it really is best practices across the nation that you don't just all of a sudden open up a license, but that you actually have an incentive period, you have a phasing in period. And it was specifically discussed among the stakeholders around what that phasing in would look like.'",
        "'speaker_1': 'And we based on their feedback, that is the phasing that you see in the original ordinance language because they specifically wanted to see multifamily go in first, followed by single dwelling units. So essentially with the phasing, it would allow all of 2022 and 2023 for those single family dwelling units to come into compliance and be able to'",
        "'speaker_1': 'pass an inspection to successfully secure their license.'",
        "'speaker_5': 'So is it reasonable to say that the that there are a couple of challenges here that the phasing is meant to address? The first is we're going to have time to plan and prepare and do some rulemaking, too, I'm guessing.'",
        "'speaker_5': 'And and then the second is for institutional property owners probably have a bit more discipline or bandwidth to consider a rental registry. And mom and pop landlords need a little more time to catch up. Am I? Mm hmm.'",
        "'speaker_5': 'I don't want to put words in your mouth. I'm also trying to be as expeditious since we are here and in the full council.'",
        "'speaker_1': 'Yup. You paraphrased it. Perfect. The other thing I think that folks should consider is that by having one start date, it creates a huge bottleneck of licenses that are going to licenses that are going to come in. And then upon that four year renewal, you're also going to have that bottleneck.'",
        "'speaker_1': 'And so I am not in support of this amendment. And I would ask my colleagues to vote the amendment down.'",
        "'speaker_5': 'So I'm sorry we're doing maybe this kind of work on the floor. Councilmember CdeBaca, do you have any thoughts as to what?'",
        "'speaker_2': 'Yeah. I mean, I hear what the concern is, and I disagree that we're setting a bottleneck date. We're giving a whole year for people to come into compliance. And I don't think that. A phasing has to be annual phasing.'",
        "'speaker_2': 'I think that there could be a six month phasing for one, a six month phasing for the other. We know where the multi-family units are. It's much easier for us to reach out to them and gain compliance. We also have property tax, property assessments, wastewater fees.'",
        "'speaker_2': 'All of those things go out directly to owners. And so we have plenty of touch points to communicate directly with landlords. And I think that 2022 is a reasonable amount of time to give them the runway we need for them to get into compliance.'",
        "'speaker_5': 'All right. Thank you both, Councilmember CdeBaca and President Gilmore. No further questions.'",
        "'speaker_1': 'Right. Thank you, Councilman. Councilman Cashman.'",
        "'speaker_0': 'I thank the council president. Yeah. I guess my concern about moving the data is besides adding, I like the extra time for the mom and pop landlords to figure out how to address the situation. As I wonder, at the capacity of the the inspection industry and with the tens of thousands of rental units that will be meeting'",
        "'speaker_0': 'their initial inspection. As you know, Madam President, I, I asked you to consider on the second when when the license comes up for renewal four years down the road to consider allowing landlords to self attest. And you responded that you would certainly consider that based on whatever data we assemble from the first go round with inspections.'",
        "'speaker_0': 'And I accept that as a reasonable approach to the matter. But I do like the added time, not just for for the landlords, but for the inspection industry to get a rather large job done. So thank you, Madam President.'",
        "'speaker_1': 'All right. Thank you, Councilman Cashman. And seen in the queue. There are no other hands raised. Madam Secretary, roll call on the First Amendment, please.'",
        "'speaker_3': 'CDEBACA All right.'",
        "'speaker_0': 'CLARK No.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_0': 'Now.'",
        "'speaker_5': 'You know.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'Can each. No.'",
        "'speaker_3': 'Ortega. Oh. Sandoval. No. Sawyer. No. Torres. Oh. Black? No. Madam President?'",
        "'speaker_1': 'No, Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': 'One I 11 nis.'",
        "'speaker_1': 'One i 11 nis. The amendment to the First Amendment to 20 1-0420 has failed. Council Member Sayed Ibaka Your second motion to amend, please.'",
        "'speaker_2': 'I move that council bill 20 1-4 28 be amended in the following particulars on page seven, strike lines six through ten and replace with each unit on a parcel is $50.'",
        "'speaker_1': 'All right, we have it moved. Is there a second?'",
        "'speaker_2': 'So again.'",
        "'speaker_1': 'All right. We have a second questions or comments by members of Council on this amendment. Council member State Abarca.'",
        "'speaker_2': 'Thank you. This amendment levies the same fee for every rental unit rather than giving large discounts to corporate landlords who have multiple units on a single parcel.'",
        "'speaker_1': 'Right. Thank you. We've got council member Sawyer.'",
        "'speaker_2': 'You're a thinks, not a president. I'm wondering whether you considered the cost that it would be that this change would be passing along in your original determination. Were you when you came up with the plan that you came up with, could you.'",
        "'speaker_2': 'Would you mind just walking me through that again? I think you mentioned it last last week a little bit. Or maybe, councilman, can you do but just and just curious.'",
        "'speaker_3': 'About.'",
        "'speaker_2': 'Why the two different treatments for the large property owners on the.'",
        "'speaker_3': 'Smaller ones? Thanks.'",
        "'speaker_1': 'Sure. Happy to. Thank you for the question. You know, when we started this work with our stakeholder group that we purposely seeded with affordable housing providers and affordable housing property owners, we knew that whatever fees we assess were going to be passed on to the renters.'",
        "'speaker_1': 'And so we needed to craft the original policy with that intent in mind that it was going to be passed on to the renters. And so that's why we kept the fees low to, one, mitigate the amount that would be passed on to the renters, knowing that renters in multi-unit apartment buildings are sometimes some of our most'",
        "'speaker_1': 'vulnerable renters, and that we also kept the fees low to encourage compliance. And really, when you're looking at the property owners are also responsible for arranging their own inspections that are heavily discounts that for smaller property owners because they only have one unit that they would have to get inspected versus the multifamily.'",
        "'speaker_1': 'They're required to have 10% of their units inspected. And so we know that that's an added cost in the thousands of dollars for the large multifamily apartment buildings. If you have 350 units, you're required to get 35 of those units inspected.'",
        "'speaker_1': 'And we knew that that was going to get passed on to the renters as well. And then lastly, the fees must be reasonable. This isn't a tax that we're assessing on property owners. It's a fee. And so those fees must be reasonable and they have to be supported by real costs.'",
        "'speaker_1': 'And the city, whatever the cost is going to be of the license program, the fees have to cover that cost, but only that cost. And so the amendment, it will generate close to $10 million. And I can tell you right now that those are not real costs that that that the program would incur.'",
        "'speaker_1': 'And so I don't believe that this increase meets the level of having a fee versus it really being perhaps a tax.'",
        "'speaker_2': 'Okay. Great. Thank you. Really appreciate that clarification. Thanks, my cousin.'",
        "'speaker_1': 'All right. Thank you. Council member Slayer. Council member Hines.'",
        "'speaker_5': 'Take your council president.'",
        "'speaker_3': 'Did you consider.'",
        "'speaker_5': 'Hi. This $50 fee and then excusing mom and pop property owners from paying a fee at all for the parcels just to, you know, so that didn't end up being $10 million collected or whatever and more equitable to the small landlords.'",
        "'speaker_1': 'I think I'm understanding your question. We considered a lot of different scenarios because we've been working on this for two years, and so we knew that we needed to start somewhere and that in having the fees low, you know, the application fee is $50, it aligns with the short term rentals.'",
        "'speaker_1': 'And then the license fee was is $50 for a single dwelling unit owner. We kept them very low and we didn't want to exempt them other than the affordable housing providers that we have in the city. Because really this is a business and they are running a business.'",
        "'speaker_1': 'And so we wanted them to also have to comply with the application and license fee. But again, we needed to start somewhere and we needed to make sure that the cost was low. And I believe that we've accomplished that.'",
        "'speaker_5': 'And if the fee is out of balance with the cost and it is considered a tax, does that mean that the entire program would be in jeopardy?'",
        "'speaker_1': 'I believe that there would be serious questions about the program. And I'm happy to have Jonathan Griffin, who's in the queue. He can perhaps answer that question for you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Jonathan Griffin, deputy legislative counsel. Can you repeat the question, Councilman?'",
        "'speaker_5': 'Yes, sir, absolutely. The question is, the statement was that if every person was charged $50, then the amount of fees collected would be $10 million, which is well above the cost of implementing the program and could be therefore considered a tax instead of a fee.'",
        "'speaker_5': 'So if that is the case, if the collections are well above the the cost of implementing the program, does could that potentially jeopardize the entire program?'",
        "'speaker_0': 'Yes, that is correct. I mean, the program would be opened up to legal challenges. Then under the Aspen case that came out back in 2018, which spoke to reasonable fees as part of their paper bag bill. It said that the charge had to bear a reasonable relationship to direct or indirect costs of the government providing service to'",
        "'speaker_0': 'regulating the activity. And so if there was not a reasonable relationship within the two costs, that could be challenged.'",
        "'speaker_5': 'Thank you, Mr. Griffin. Thank you, Mr. President. No further questions.'",
        "'speaker_1': 'Thank you. Councilman Hines. Councilman Cashman.'",
        "'speaker_0': 'Yeah. Thank you again. Council President. Yeah, I'm struggling with this little bit. While I recognize that someone has 300 apartments and. And that the amount that they're end up paying, if I were units inspected, would would be challenging.'",
        "'speaker_0': 'But I'm I'm trying to I'm guessing that if that would be the case, that they would end up working a deal with with whomever is doing the inspections for a lesser, lesser fee per inspection. And and even if they were paying the same amount, the amount passed on to the renter would be the same per unit as'",
        "'speaker_0': 'a single family or a single unit landlord. So I'm struggling a little bit with this. While I understand the legal necessity for keeping this as a fee and not going past the cost of the program. I'm wondering if there isn't perhaps another way to to balance this.'",
        "'speaker_0': 'And should this pass, as you've proposed? That's another thing I would hope we would look at moving down the road. Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Councilman Cashman, I'm happy to answer here. You need to have some sort of application and license fee to encourage compliance. If we had, you know, $10 or $1, would we have the compliance that we're looking for?'",
        "'speaker_1': 'And I would also ask that, you know, we don't make perfect the enemy of good policy, because we've got to start on this program and get, you know, a few years of data to understand where we're at with it.'",
        "'speaker_1': 'And then we're going to evaluate it on a yearly basis in July and happy to dig into that more. But we need to start somewhere. And I believe that we have kept the fees low enough that this is a good place for us to start.'",
        "'speaker_1': 'It's less than $5 a month that would be potentially passed on to the renters, from the property owners as we have the policy right now. All right. Next up, we've got Councilman Flynn.'",
        "'speaker_0': 'Thank you, Madam President, I. I, too, like Councilman Cashman. And I'm intrigued by this. I see the intent of the amendment that Councilwoman CdeBaca has proposed is basically looking at the corporate gift of a volume discount. Essentially, I would rather, though, see the converse of this.'",
        "'speaker_0': 'And Council president, we have I think we chatted about this early on in the process that perhaps a single license fee for a mom and pop landlord who a family might have three or four rentals scattered around the city.'",
        "'speaker_0': 'I would much rather see a singular license fee for that situation than than charging the operators of 300 unit complex for each unit. And but I know that we didn't have votes to do that. And I understood the reasoning behind it that Megan had emailed to me.'",
        "'speaker_0': 'So but I would with this amendment, I think I would rather see the converse of it to give her the same kind of consideration to a mom and pop it that just managed, you know, a handful of rentals around the city.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Flynn, Councilmember CdeBaca, we have you back up.'",
        "'speaker_2': 'Yeah, I echo a lot of what Councilman Cashman and Flynn have said. I proposed early on the converse or a fee based on rent and what am I bracket? The landlord was catering to so that we can incentivize low rent and disincentivise predatory rents.'",
        "'speaker_2': 'I think that while sometimes our multifamily units are providing affordable rates, we also have many of the multifamily units providing our luxury rates as well. And so my my issue here is that. It's not about the the $50.'",
        "'speaker_2': 'I think the $50 is a reasonable fee. I if we're not trying to generate that much money, we could go lower. My issue here is treating landlords equitably. We're not. We're not we don't actually have a fee that's tied to something rational, like square footage, like parcel, like rent.'",
        "'speaker_2': 'It's very arbitrary. If you look at the fee brackets and while Jonathan mentioned that we could be sued if we raised over the a couple hundred thousand dollars that we're trying to generate and we used it on something other than administration of the database, we could be sued because that could be perceived as a tax.'",
        "'speaker_2': 'I wonder, Jonathan, if you would be willing to speak to the potential of a lawsuit by small landlords who feel that their fee is not rational in their being and there a fee is being imposed on them that it is not being fairly imposed on other landlords by unit.'",
        "'speaker_0': 'Yeah. My understanding is that there was a study done on this. So again, that was why it's not considered a tax is that there is a reasonable relationship to the costs and that there was a study done to make sure of that.'",
        "'speaker_0': 'It does not appear in the method you're prescribing that there would be a study done.'",
        "'speaker_2': 'Can you explain how the fee is reasonable for the single unit provider versus the multi-unit provider when in reality a multi unit provider would be able to take advantage of economies of scale and would be able to absorb the $250 easily and pay for the, what, 30% of the inspections.'",
        "'speaker_2': 'Whereas you have an individual owner who is less able, less likely to be able to absorb that that fee, but also less likely to be able to absorb 100% of their inspections. Because even though we're giving the multifamily units 30% of their inspections, the single family unit is still required to pay for 100% of their inspections.'",
        "'speaker_0': 'I mean, I can always kind of speak generally to what's defined as reasonable on the law. Both, you know, there's a long line of cases of, you know, from the US Supreme Court under the 14th Amendment as well as Colorado Analog in our Constitution.'",
        "'speaker_0': 'And there's heavy deference granted to the legislature and the lawmakers when they're setting their fees. So if there is something so I mean, in my mind, this fee would be found as reasonable. But yeah.'",
        "'speaker_2': 'But what is the definition of reasonable?'",
        "'speaker_0': 'The I mean, the kind of the major definition when we're talking about excessive fines is that the fine has to be grossly dis support, just proportional to the gravity of the offense or of the charge. So this would need to be that's kind of the general standard for reasonableness under the Supreme Court.'",
        "'speaker_0': 'Is that grossly disproportionate?'",
        "'speaker_2': 'And is there anything in there about equal application? Of the fee.'",
        "'speaker_0': 'Is there anything? I'm sorry. I'm not following your question.'",
        "'speaker_2': 'So $50 is reasonable. And I say that as a landlord and somebody who's rented $50 is reasonable. The issue is not the fee. The amount of the fee. It is the application to others in the same business. It's like killing me.'",
        "'speaker_2': 'It's like telling me I have to pay $4 for a gallon of gas. But somebody who is filling up a tanker gets to pay $0.25 for that same gallon of gas.'",
        "'speaker_0': 'I'm not aware of anything that's looked at the tier structure and made that type of determination. And again, the basic standard of grossly disproportionate, you know, is what's looked at. So, no, I'm not aware of any anything that's ever looked at a tiered system and said that one tier was was unfair to another tier.'",
        "'speaker_2': 'Got it. And Councilwoman Gilmore, can you explain what the Fed ties back to in the tiered system? Because I I've gone through it and tried to see, you know, could it is it attached to square footage? Is it attached to the the single parcel?'",
        "'speaker_2': 'Is it attached to rent? I'm not finding the thing that the fee is attached to. Can you help me understand that?'",
        "'speaker_1': 'Sure happy to. The and I and I would love to also remind folks that the increased requirement of unit inspections and so we're only talking right now about the license fee. We're not talking anything about the cost that we know, again, will be passed on to the renters.'",
        "'speaker_1': 'It's the inspection fees. And so through the stakeholder process, it was a non-negotiable for the stakeholders to waive any sort of inspection requirements. And so we have the inspections across the board, but it is tied to the cost of the program and to administer it.'",
        "'speaker_1': 'And we knew that we needed to start low. And so we started with $50 for one unit and went up from there, basing the criteria on the number of parcels that we had that were in the 2 to 10 scenario, the 11 to 50 and the 51 2 to 50 scenario, because we wanted to have a good'",
        "'speaker_1': 'overview of what it would take to administer this license program based only on fees, and then also take into consideration the cost of the inspections that we knew were going to be required and that would be passed on to the renters.'",
        "'speaker_1': 'And so that was the criteria that we looked at for the program. The application fee is in alignment with the short term rental program. It's $50, and that covers the administrative costs. And so and the application fee is a one time fee.'",
        "'speaker_1': 'It is not needed to be paid upon renewal. And so that is the rationale. And we have worked very, very closely with excise and licensing and our partners to ensure that this we weren't gouging anybody on this, that we were really taking this into consideration and across the board being able to implement this and pay for the'",
        "'speaker_1': 'program as well.'",
        "'speaker_2': 'It's still not explaining how it connects to the landlord. I hear that there was a overall amount that was determined and then we backtracked to figure out how we would raise that. And I don't think I'm going to get the answer I'm looking for anyhow.'",
        "'speaker_2': 'But I've also been asked several times through our right to counsel proposal, how our proposal would interface with citizen led ballot initiative that's out there that proposes essentially the right to counsel the rental registry and the fee. Can you talk to us a little bit about how if the citizen led ballot initiative passes, this will interface?'",
        "'speaker_1': 'I don't have a crystal ball. So there will be limited interface, at least initially because, you know, we're standing up this program and we need to get it. We need to get it implemented. The citizen led ballot initiative, those funds raised will truly be a tax.'",
        "'speaker_1': 'And through that ballot initiative, you would need to identify where those dollars went to and how they're collected because of the tax for any fees for this proposal, anything that is revenue generated will go directly into the general fund and then it will be reallocated through the annual budget process.'",
        "'speaker_2': 'Got it. Thank you for that. That's it from my questions.'",
        "'speaker_1': 'All right. Thank you. Up next, we have Councilwoman Connie.'",
        "'speaker_2': 'Thank you. Council President I really appreciate the dialog. I just wanted to share two sets of observations and in terms of how I'm going to vote on this amendment. The first is that I frankly do a lot, as you all know, of housing stuff.'",
        "'speaker_2': 'And I get to spend time with economists and and I think a lot about housing prices and what impacts them and what doesn't. And I will just say there's a pretty large body of research that demonstrates that program costs like these do not get passed on a dollar to dollar to tenants.'",
        "'speaker_2': 'And we have this discussion a lot in the inclusionary housing realm. But the reason is that, generally speaking, in a marketplace, the seller is selling at the highest possible price the buyer can pay or will pay. And so generally speaking, you know, if your fridge breaks in your rental unit in the middle of a of a year'",
        "'speaker_2': ', you don't get to raise the rent to replace the fridge because one, you have a lease. Two, you have your tenant may be at the top of what they can afford because if you could be charging more for that unit, you probably would be already.'",
        "'speaker_2': 'Right. And we've seen this in this market, right. That landlords will just continually raise the rent to the most that they can get for the quality of that unit, the location of that unit, etc.. So there's a lot of economic research that that will say that the cost of this program may not get passed on dollar for'",
        "'speaker_2': 'dollar. They may end up getting absorbed partially through, you know, reduced profits, partially through reduced other things that, you know, maybe landlords spend a little less than something else, landscaping, whatever. But the short story is that that these costs get spread over over a range of things.'",
        "'speaker_2': 'But the good news is, if I'm wrong, if the economists are wrong and the landlords are right when they say dollar for dollar, every dollar is getting passed on. That's why these fees are low. So that's why this is a prudent approach, right, to entering the marketplace with a new cost.'",
        "'speaker_2': 'So. So but I just I will just say I personally do not I side with the economists that generally speaking, dollar for dollar, not every cost does get passed on because generally the rents already at the top. So be that what it may, that's just more for your academic stimulation tonight.'",
        "'speaker_2': 'The second thing I wanted to mention in terms of what councilman would say to back is asking what's the basis? And the basis is the parcel. And I'll I'll share two reasons why I think that is appropriate for a starting point here.'",
        "'speaker_2': 'Number one is there are many things we do by parcel. So, for example, I send one property tax bill to an apartment owner. I don't send 300, but I do send one property tax bill to every single family home, regardless of who owns them.'",
        "'speaker_2': 'If they own 200, I don't send one bill to 200 different single family homes. I send one bill to each parcel. So there are a number of things we do in the city that we regulate by parcel. So this is consistent with some other ways that we do things as a city.'",
        "'speaker_2': 'Secondly, even though it would look it would be more like a tax if we were doing it based on value, which is why, as much as I might value wise, like the idea of charging by the price, that's just it looks and feels a lot more like a tax than a fee, especially if the unit doesn't cost'",
        "'speaker_2': 'the government more to regulate. So the but but you will I will say that the average value of a single family home or a townhome is going to be greater than the average value of an apartment. So if your concern is that you want folks who are owning, I mean, the value, if you were to evaluate a'",
        "'speaker_2': 'medium single family priced home or a duplex or even the ones that are being rented, you know, might be in the 3 to $500000 range, whereas the average value of an apartment might be in the 200000 to $400000 range.'",
        "'speaker_2': 'So they are just they are qualitatively value wise. Unit four, unit not the same. And the single family unit is worth more. So that's just a fact. It's not the basis why it was chosen, but it is a piece of why it may be more equitable than you think.'",
        "'speaker_2': 'You know that we think not you, any one person, but just that we might think off the top of our heads. The last thing I want to share is I do want to caution us from this assumption that every single family home out there is owned by a mom and pop.'",
        "'speaker_2': 'In fact, it is a massive business of equity funds to purchase, particularly during the foreclosure crisis, massive quantities of single family homes that were packaged on a resale market. There is an entire campaign to get the Federal Reserve and the folks who are engaged in this selling of, you know, bad mortgages to offer them first to community'",
        "'speaker_2': 'organizations. But that's a slow campaign. And the truth is big capital owns many single family homes. So I just want us to be cautious about any assumption that a single family home is necessarily owned by a neighbor. It's not to say that that's not.'",
        "'speaker_2': 'The case, right. There are definitely some some individuals who owned single family homes. But I would guess that when the data comes in, we'll learn more about how many are owned. Even the LLC can be confusing, right? It might look like 12 different LLC, but they all have the exact same partners in them.'",
        "'speaker_2': 'So it'll be very interesting to see what we can glean from the data. But so, so I respect the concerns, but for the reasons I've identified, I will be supporting the bill as is and not voting for the amendments.'",
        "'speaker_2': 'Thank you, Madam President.'",
        "'speaker_1': 'Q Council member. KOINANGE And I will go ahead and make my final comment. Thank you for the for the questions of my colleagues. And I respectfully ask that my colleagues vote down or vote no on this amendment. Madam Secretary, roll call on the Second Amendment.'",
        "'speaker_2': 'CdeBaca I.'",
        "'speaker_0': 'Clark No.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_0': 'Now.'",
        "'speaker_3': 'HINES.'",
        "'speaker_5': 'Oh.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'I believe you're muted, Councilman.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'Can each now.'",
        "'speaker_3': 'Ortega? No. Sandoval.'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'Sawyer. No. Torres.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'Black? No.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_1': 'No. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': 'One 811 days.'",
        "'speaker_1': 'When I 11 nays the second amendment to 20 1-0420 has failed. Council Bill 20 1-0420 is on the floor for final passage. Questions by members of Council on Council Bill 420. Give it a moment here. All right. Councilmember Flynn.'",
        "'speaker_1': 'And just for folks, we will have questions first and then we'll follow by comment. So wanted to split those up. So if anybody has questions, now is the time. All right. I'm not seeing any questions. And so we will go ahead and move on to comments by members of Council on 420 and Council member Flynn.'",
        "'speaker_1': 'Did you want to get up first in the queue? Go ahead.'",
        "'speaker_0': 'Sure. Thank you, Madam President. Yeah, I didn't have questions. I just had a comment. I wanted to amplify the same remarks that I made last week that I want to request that when rulemaking occurs on this, particularly with the the guardrails on inspections, that we'd be careful not to that this registry and the inspection process not turn'",
        "'speaker_0': 'into an accelerant for displacement, particularly when some of our older housing stock in our very vulnerable neighborhoods are vulnerable to displacement. That is, that we not end up incentivizing the owners to sell and have redeveloped into unaffordable, particularly unaffordable duplex or or McMansion type of a development that we keep these affordable rentals in the pool with inspections'",
        "'speaker_0': 'that truly look at the standards for habitation safety, life safety and that sort of thing. And not with an eye toward older houses that don't meet current building codes and never can if we required them to upgrade would would simply be taken off the rental market.'",
        "'speaker_0': 'And so that's that's my that's my direct not to I can't give direction to the department, but that's my request of the licensing folks and the inspection folks that we truly make it targeted toward habitability and life safety.'",
        "'speaker_0': 'Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Councilmember Flynn. Councilmember Sandoval.'",
        "'speaker_2': 'Thank you, Madam President. I just wanted to echo what Councilman Flynn said. I have received a lot of feedback from constituents in Council.'",
        "'speaker_3': 'District One who.'",
        "'speaker_2': 'Owned smaller or not even smaller, but older homes and a lot of older homes in historic districts, too. And so they have a lot of concerns that their hallways won't make, won't meet the inspection standard. They have concerns that just a lot of concerns with older homes.'",
        "'speaker_2': 'So I had mentioned to you when we spoke about this, about having historic Denver as part of a partner, because if you are a member with historic Denver, you get a group, a list of contractors who've been vetted through historic Denver who know how to work on older homes because, say, for instance, if somebody has to add'",
        "'speaker_2': 'an egress window into their older home, you cut into the foundation. It's a little bit different type of building stock. And there's there there's programs out there's people out there who know how to do it. And one thing I do want to comment on is that you don't have to wait until the very end.'",
        "'speaker_2': 'If you own single family homes to get the $50 permit, you can rent, you can get it earlier, which is a $25 permit. And as I mentioned to you, council president about having an inspection preemptively, that's something I'm a rent.'",
        "'speaker_2': 'I own a rental property. I've been thinking about doing and I've been telling my constituents if they could get an inspection preemptively. So preemptive so that they know what to fix and they have a couple of years to fix it.'",
        "'speaker_2': 'So there's don't the the cost don't get passed down to the small mom and pop owners, because that's mostly all I've heard from in Council District one are people who.'",
        "'speaker_3': 'Own several different.'",
        "'speaker_2': 'Single family rental properties, and that's their concern. I haven't heard much concern about the actual need for the rental registry. Most of the concerns that my council office has heard from is the inspection. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Sandoval. Councilmember Sawyer.'",
        "'speaker_2': 'He's not a president and they appreciate what Councilman Sandoval just said. I hear the same thing in my office, and I think that's spot on. And I think the determining factor in really making the decision here is the costs that are passed along to the renters as it stands now.'",
        "'speaker_2': 'I think the financial estimates that we were provided indicate the average cost of the proposal is $4 per unit. And so to me, that balances the city's interests in protecting our most vulnerable citizens and maintaining safe housing stock with the recognition that our residents simply cannot bear that many more costs given COVID and market conditions and all'",
        "'speaker_2': 'of those things. So the intent of the proposal is to make housing safer and more accessible to all. And I think that adding too many costs to that will dilute the proposal by significantly raising the rents in our city, increasing the barriers to housing affordability.'",
        "'speaker_2': 'So I'm in support of the rental registry this evening as a whole and will be in voting in favor of it. Thanks, Madam President.'",
        "'speaker_1': 'Thank you. Council member soya. Council member. Each.'",
        "'speaker_2': 'Thank you. Council President I first just want to say thank you to you and your staff as well as to the agencies. This was no easy feat to get a set of city agencies willing to take on a task this large.'",
        "'speaker_2': 'And I think it's critical. So I want to thank them for their willingness to move and grow and and think about meeting the new needs that we've identified in our policymaking work here in the council because we rely on them to implement.'",
        "'speaker_2': 'And so so thank you to everyone who participated. For me, I think about this policy as a piece of a trajectory that we in Denver have been on as we have grown up as a city. And I don't just mean up in size.'",
        "'speaker_2': 'I mean up in complexity, up in being a major destination for businesses to relocate with workers. You know, I don't know if the Cowtown reputation was ever really deserved by the city of Denver. I think it was always dynamic and it always had things.'",
        "'speaker_2': 'But to the extent that we are unquestionably a modern city, that's a world class destination, it is natural that we have to grow our systems to manage that city in ways that we didn't have before. Right. And that meant banning forms of discrimination like use of source of income.'",
        "'speaker_2': 'That was the first renter protection that was passed four years ago by the city council. And since then, we've continued to look at ways that we can address evictions with eviction defense programs. We try to add the first rental assistance program that was available beyond those that were the deepest, lowest income.'",
        "'speaker_2': 'We used to have a human services program only. But each of these pieces is part of a trajectory, along with the requirements that we've been able to negotiate with developers. And we may be considering requiring in the future that when you have a city of this size and this complexity and frankly, with the exacerbated inequality that has'",
        "'speaker_2': 'come, then these are the mitigations that are needed for us to manage that city. And so I do just want to share one perspective. I know that we've heard about the landlords who shared concerns, and that's understandable given the change.'",
        "'speaker_2': 'But I want folks to know that I'm also hearing from landlords who are supportive. One of them is an elder African-American woman who owns several properties in the city, who reached out to our office to say that she was very supportive of this.'",
        "'speaker_2': 'And Ms.. Davis, this is what she said to me. She said, I pay these fees in other places. It's no big deal and it's really good because I want landlords to be responsible. I don't think it's fair to have people in this city who are not doing what they should be because they don't have anyone checking on'",
        "'speaker_2': 'them, whereas everywhere else they do business. I have to pay these fees and you know, and I know that at least it's a level playing field. So I think that's really important for the landlord who invests in their life and safety systems and make sure their unit is safe.'",
        "'speaker_2': 'They shouldn't be competing with someone who's not investing in those things. So I just wanted to share a different landlord perspective that we haven't heard as much about, but certainly is out there. And that is someone who supports this ordinance tonight.'",
        "'speaker_2': 'So I want to thank Ms.. Davis for reaching out to my office, and I want to thank my colleagues. And I'm excited to vote yes on the evolution of our city into a more equitable and more managed place.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Council member can each council member. Tories.'",
        "'speaker_3': 'Thank you so much, Madam President. Appreciate the work that's gone into this in responding to a number of emails from District three landlords. You know, we were emphasizing that this is a basic responsibility of a city, the size and depth of Denver, that we know what our rental stock is and that it meets basic capitation rules.'",
        "'speaker_3': 'Even when we looked at vacancy rates in the past in Denver. The number was misleading because it only calculated vacant units that had been previously occupied, not newly built vacant units that have never been rented. We should know what our stock is and who's responsible for them.'",
        "'speaker_3': 'My district was, when described by Councilman Kasich earlier, about single family homes that have turned over to investors, and we know very little about them or how many they own. One of our partners wrote this in their letter of support.'",
        "'speaker_3': 'As with so many things, COVID 19 has brought to light the importance and benefits of maintaining a central record of our community's rental housing stock. Various federal, state and local level renter protections and resources came online in an effort to keep people housed through this public health crisis.'",
        "'speaker_3': 'It would have been incredibly helpful to have current contact information for rental property owners and operators sort of enabled clear and efficient communication of still evolving policy changes and affordable rental assistance funds to the benefit of landlords and tenants alike throughout the pandemic.'",
        "'speaker_3': 'That was from enterprise community partners. I look forward to voting in favor of this tonight. I thank you for all of your hard work as President Gilmore and Kimmage even before I came into office on this. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Torres. Councilmember Cashman.'",
        "'speaker_0': 'Thank you. Council President First of all, I want to thank you very much for considering the the tsunami of questions that I have sent your way. And thanks to you and your staff. And I am absolutely convinced that you've been as thoughtful as is humanly possible in creation of this policy.'",
        "'speaker_0': 'I still have some questions that I'm you know, I'm concerned about, you know, the that we still may be putting too much burden on some of our smaller landlords. And I'm thinking maybe it's in the those that have like 2 to 10 different parcels of single family homes.'",
        "'speaker_0': 'And so I'll be looking at that. But, you know, I want to be sure and I appreciate Councilman CdeBaca bringing up this question to be sure, where we're spreading the burden fairly. So I'll be looking at that. I think I'm 100% convinced of the importance of creating this rental registry.'",
        "'speaker_0': 'And I think as as Council Pro-Tem Torres just said, being able to contact our renters and our landlords with important policy changes coming down the road and I think having an as accurate a number as we can put together of rental properties to help us in, in a crafting policy down the road, I think is is critically'",
        "'speaker_0': 'important. You know, I we can't leave that complaint based. I've heard from a number of people that we've got the state warrant of habitability. We've already got things on the books, but they all require a renter to file a complaint, which puts one way or another puts their welcome mat in in their residence at risk.'",
        "'speaker_0': 'And so I support the inspection, the preemptive attempt to create safe housing. I do, again, have concerns about that. The the inspect, the inspection list, the checklist that every every landlord I've spoken to, I would say easily 80% of the landlords I've spoken to, that's their concern.'",
        "'speaker_0': 'And I've tried to put their mind to rest as best I can. But I have concerns myself. I'll be at rest when I see that final list along with my landlord. So I hope to, you know, keep keep an eye on that, be as involved in that as as I'm welcomed to be.'",
        "'speaker_0': 'So with that, I will be supporting this. I think you're exactly right. You know, not only is it not wanting to ruin the good by striving for perfection, but I think the way it's set up, the phased approach gives us a lot of time to arm wrestle over some details that I think are important in this.'",
        "'speaker_0': 'And again, thank you and thanks to you to your co-sponsor for the effort to put this together. Councilwoman Kenny just. I think it's fair to say, been our our council champion, at least in my time on council for affordable housing and safe housing.'",
        "'speaker_0': 'And I appreciate her efforts as well. Thank you. Council President.'",
        "'speaker_1': 'Thank you, Councilmember Cashman. Councilmember Ortega.'",
        "'speaker_3': 'Thank you, Madam President. I, too, want to express my appreciation for the two year process that you've been through by engaging multiple stakeholders to get input. And that reflected change along the way, including during the time that you brought this to before council.'",
        "'speaker_3': 'And that means you were listening and really took into account all of that input into this final bill that's before us tonight. I also want to just express that during the rulemaking process, when that comes up, that will be really important to keep us informed about when that comes up so that we will probably hear from people'",
        "'speaker_3': 'during that time frame as well. And I want to just extend my appreciation to all of the constituents that we've heard from on both sides of this issue. I think the fees are something we're going to have to monitor to ensure that it's not something that continues to grow over time.'",
        "'speaker_3': 'As we all know, when the Platform Park Hill project came forward, those wastewater fees were originally created to identify impervious surface that people had on their properties, and that was expanded to include the cost of the plaque to Park Hill Drainage Project, which, you know, taxpayers across the city ended up helping bear that cost as opposed to'",
        "'speaker_3': 'it being placed on each individual property. So it's why getting those annual reports to city council will be really important to monitor. And like with any ordinance, if we find that there are things that need to be tweaked over time, it gives us the ability to see what the reports are showing us and to make whatever necessary'",
        "'speaker_3': 'changes going to have to be made in the future to the ordinance. Obviously this is targeted to focus on habitability and life safety issues. And I think one of the challenges we're going to have is making sure that there are enough inspectors that can handle the volume of the inspections that will need to occur.'",
        "'speaker_3': 'And you and I have talked about the fact that there are organizations out there that provide the certification for those inspectors. And this is a great opportunity for people who are unemployed that can go out and get a license to be I think it's a license or a certification to become an inspector so that anybody who is'",
        "'speaker_3': 'unemployed can can have a new profession. This is going to be an ongoing process and a great opportunity for them to tap into this. So overall, I appreciate the work that you and Megan and folks from the city attorney's office and Dottie and Councilwoman Leach and others have have put into bringing this forward.'",
        "'speaker_3': 'I think in general, having that registry is going to be extremely helpful and it will be helpful as we continue to look at any policy changes that allow us to figure out how we continue to create that affordable stock that has varying price points for people in our housing market that are below what is considered market rate'",
        "'speaker_3': 'housing. Thank you very much.'",
        "'speaker_1': 'Thank you. Council member Ortega. I was thinking about Stella Madrid. We've got to get Stella in the the home inspections gig. As you were talking. Thank you. Councilmember Ortega. Councilmember Hines.'",
        "'speaker_5': 'Thank you. Council President. I thank you for the bill and for all the hard work you, your staff, and your stakeholder process and all the stakeholder members have put into this topic. I'm just a council member. Cashman. I agree with you.'",
        "'speaker_5': 'I'm concerned that we're, uh. I just want to make sure that we're continuing to use our equity lens as we move into rulemaking, assuming this passes. And I look forward to having a list of our property owners. After all, the city's relationship is with the property owner, not the renter.'",
        "'speaker_5': 'And I want to make sure we have someone other than a registered agent in some out-of-state LLC. When a renter has concerns or when we need to discuss health, safety and welfare issues like snow abatement or a navigable right of way, including our sidewalk, which is the adjacent property owners responsibility.'",
        "'speaker_5': 'And to councilmember, can you just point we are an increasingly, increasingly complex city downtown or not? We're now one of the largest, 25 largest cities in the nation. I like that. We're getting more information about our housing stock, including long term rentals.'",
        "'speaker_5': 'Frankly, we should probably get more information about our short term rentals, too. The data collection helps us understand what we have in Denver so we can better shape policy for our future. Thank you. Council President.'",
        "'speaker_1': 'Thank you. Councilmember Hines, Councilmember CdeBaca.'",
        "'speaker_2': 'Thank you. I thought I was never going to get calls on my head, kept getting put down for some reason. I just wanted to share that. While I do not believe that the fee is being applied equitably or even equally, I do wholeheartedly support a registry.'",
        "'speaker_2': 'I think it's critical that we're able to track our landlords and our rental dwelling units within the city. I do want to echo what my colleagues have mentioned about wanting to be informed about the rulemaking process. I think it's going to be really important for the long term for us to create a data system that in the'",
        "'speaker_2': 'long term can be useful to the average citizen in Denver. There are other cities who have had nonprofit organizations who are in the process of creating their own usable databases for citizens. And so what I hope can happen with this database is that, one, we can infer, integrate, violation and complaint data in a in a map that'",
        "'speaker_2': 'can be interacted with in real time. I also hope that this can become a resource for landlords. Not all landlords are looking to exploit their renters. And I think that when there are good resources available for a landlord like we've experienced throughout COVID, with rental assistance, with property tax rebates, those kinds of pieces of information struggle to'",
        "'speaker_2': 'find landlords. And I think that this eventually can be a very helpful tool if we make it that. And so I hope that we're very intentional on creating something that's usable for everybody and not just a system for us to hoard information internally at the city.'",
        "'speaker_2': 'And very excited to support this and see what comes next. I hope that any landlords who feel like we've crossed some line here or have work to do, I hope you all will get engaged and help us shape the 2.0 version of this legislation.'",
        "'speaker_2': 'Because always remember anything that we pass here can be undone by us or by the citizens. And I encourage all of you to take government into your hands and make sure that it's working for all of us. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember CdeBaca. All right. I see no other hands raised. I'll go ahead here and want to thank all of my colleagues for all of your questions and your comments. You, my council office and I, along with affordable housing experts, providers and owners, we have been working for the past two years to address tenants rights and'",
        "'speaker_1': 'protections. And for the first time in Denver's history, we will have significant renter protections through the healthy residential rentals for all license. We have thoroughly researched and crafted this policy to mitigate concerns of unintended consequences to tenants, such as fees being passed on to renters or displacement.'",
        "'speaker_1': 'I'm proud of this policy and it is well researched, fair and equitable. I'd like to acknowledge and sincerely thank my two council co-sponsors. Council President Pro Tem Torres and Councilwoman Robin Kinney. Megan Allen's my chief of staff. Thank you for all of your hard work on this.'",
        "'speaker_1': 'You were tirelessly you you were tirelessly in your persistence in making sure that we could get good answers to the great questions posed. And also Melissa Sotelo in my council office and Emily Lapel, our legislative analysts who did our early research.'",
        "'speaker_1': 'I'd like to also personally thank Tiana Patterson from Elevation Community Land Trust, Kate Steen Stig Berg excuse me, Stig Berg and Michael Reddick from Healthier Colorado. Aubrey has filed from Colorado Coalition for the Homeless Kenzie Halstead and Katie McKenna from Enterprise Community Partners and Tonya Pringle from the city of Boulder and our amazing city agencies and staff'",
        "'speaker_1': 'who are truly experts and collaborated on this policy. Reggie Ngubane, who wrote this ordinance. And so blogger Kirsten Crawford and John Griffin from our city attorney's office. Molly Duplass. Shane and Erica Rogers from Excise and Licensing. Melissa Totty and Nick M Heiser from our Department of Housing Stability.'",
        "'speaker_1': 'And Julie Sapp. And John Keeler from the Climate Action Sustainable Resources Office. Tara Olsen. And Will Fenton from the Denver Department of Public Health and Environment. And all of the additional agency staff members who joined our stakeholder group to share their expertize and knowledge.'",
        "'speaker_1': 'We had a lot of help in crafting this policy, I must say. Denver has been in a housing crisis for decades, and the pandemic has put even more uncertainties on our residents who rent. For the first time, we will have a license that will ensure our rental properties are safe and meet Denver's housing standards.'",
        "'speaker_1': 'We'll collect that basic property owner information as well as important rental data to enable us to broadly share resources with tenants and strengthen our tenant, landlord education and outreach. The phased in proactive rental license program, where inspections are required and done routinely every four years, will help identify issues and protect the health and safety of tenants more'",
        "'speaker_1': 'efficiently. This shifts the burden of code enforcement from relying solely on a tenant complaint to a more prevention based, equitable approach to improve housing quality. In partnership with Councilwoman Connie. Additional renter protections include a requirement starting on January 1st, 2022, that renters have a written lease for all new tenancies exceeding 30 days.'",
        "'speaker_1': 'That rental owners and operators provide a notice of tenant's rights and resources and provide them again if there's any demand for rent. The Colorado Center on Law and Policy, a nonprofit that advocates on behalf of Coloradans experiencing poverty excuse me, are in support of this policy from Jack Regan Brogan, their senior attorney.'",
        "'speaker_1': 'This proposed ordinance would establish a meaningful process for ensuring a minimum degree of health and safety in residential rental properties by allowing for regular inspections of rental units. The proposed license program would more equitably standardize health and safety protections for residential tenants.'",
        "'speaker_1': 'In short, it is no exaggeration to say that this program would quite literally save lives. Many times during this process, people have asked me, why is this so important to you? Well, it's important to me because if it's happening in my community to renters, for example, that Green Valley Ranch property that we've used as one of the'",
        "'speaker_1': 'most egregious violators with black mold, exposed electrical wires, etc., then it's happening in all of our communities. It's personal as well. We will, for the first time be able to collect data on how many rental units are ADA accessible.'",
        "'speaker_1': 'You see, my dad is an incomplete quadriplegic. He had a car accident when he when I was 22 years old. And he uses an electric motorized wheelchair for everything that he does. Parking accommodations and more data are important to make sure that we're supporting those in our community.'",
        "'speaker_1': 'And also because for a short time, my husband and I lived in a rented mobile home. Every time it got down below freezing, the pipes would freeze. We didn't have water. We had a brand new baby. But I couldn't make formula.'",
        "'speaker_1': 'We couldn't wash our hands. We couldn't wash our dishes. We couldn't even flush the toilet. Hearing renters voices and their stories. Their experiences have all supported the need for this rental license, with required inspections to ensure that property owners understand clearly their obligations if they are going to rent a property in Denver.'",
        "'speaker_1': 'Last I asked you to think about how important your home was to you and your loved ones over the past year. How important was it for your children who when they were learning remotely? Or if you're a caregiver for a vulnerable family member.'",
        "'speaker_1': 'Our homes became our sanctuaries. Every renter in Denver should be afforded the right to know that their rental unit meets the minimum housing standards, along with the requirement of a written lease and access to tenants rights and resources.'",
        "'speaker_1': 'Thank you to my colleagues for your support and I respectfully ask for your vote this evening. Madam Secretary, roll call on Council Bill 21, Dash 0420, please.'",
        "'speaker_3': 'Black.'",
        "'speaker_2': 'Hi.'",
        "'speaker_3': 'CdeBaca.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Clark.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Hines.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Can each I.'",
        "'speaker_3': 'Ortega, I. Sandoval, I swear. I. Torres, I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': '12 Eyes.'",
        "'speaker_1': '12 Eyes Council Bill 20 1-0420 has passed. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote I.'",
        "'speaker_1': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Clerk, Will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_0': 'Yes. Council President. I move that resolutions be adopted and bills on final consideration be placed upon final consideration and do pass in a block for the following items. Four 4426 For 14 or 15 for 16 or 17 for 18.'",
        "'speaker_0': '388. 389. 436. 438. 279. And 151.'",
        "'speaker_5': 'Second.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_3': 'Black.'",
        "'speaker_2': 'Hi, CdeBaca. I.'",
        "'speaker_3': 'Clark.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Hi. Hi.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'He needs. Hi.'",
        "'speaker_3': 'Ortega. I. Sandoval. I. Sawyer. I. Torres. Hi, Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '12 eyes.'",
        "'speaker_1': '12 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 21, Dash 0309 changing the zoning classification for 1450 South Humboldt Street in Washington Park.'"
    ],
    "Rezoning for 1450 South Humboldt Street in Washington Park.": [
        "'speaker_1': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members as a whole. Please refrain from profane or obscene speech and please refrain from individual or personal attacks. Councilmember Clark, will you please put Council Bill 309 on the floor for final passage?'",
        "'speaker_0': 'Yes. Council President I move the council bill 309 to be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved. We've got a second by Councilmember Hines. The required public hearing for Council Bill 309 is open. And before we get your staff report, Fran, I was just told that apparently the presentation isn't loaded into our system.'",
        "'speaker_1': 'And so I have asked our. Staff or legislative staff to send it out to all council members. And so you should be receiving that in your inbox here momentarily. But in the meantime, Fran will go ahead go ahead and have you share the presentation.'",
        "'speaker_1': 'Here via your screen.'",
        "'speaker_3': 'And you see there, is that working?'",
        "'speaker_1': 'Yeah. We've got it.'",
        "'speaker_3': 'Good afternoon, Member City Council, Madam President, and from beneficial associate city planner with Planning Services. And I'm here today. To present an overview of the Map Amendment four 1450 South Humboldt Street and also in some technical issues. That's probably why Sex and the Road.'",
        "'speaker_3': 'But it's all good now. See. One. Subject property is located in the in District six with Councilman Paul Cashman. In the Washington Park neighborhood. The property owner is proposing to rezone to a district that allows for accessory dwelling units.'",
        "'speaker_3': 'If approved, all other forms and standards would remain the same. The property is currently in the Urban Single Unit C Stone District, which allows for a minimum stone load of 5500 square feet. And it is completely surrounded by other properties that are also shown us, you see.'",
        "'speaker_3': 'The site is currently occupied by a single unit home and it is completely surrounded by other single unit uses as well as a public quasi public use, including a school one block to the west. Here. I'm going to back up a little bit and give you some background information.'",
        "'speaker_3': 'In 2013, the applicant hired contractor to build an accessory dwelling unit in the back of the property. When she tried to permit the structure to allow for the accessory dwelling use, accessory dwelling unit use, she realized that her USAC district didn't allow for the touch accessory dwelling units.'",
        "'speaker_3': 'She then tried to get a variance that denied, but the adjustments allowed her to keep the area for three years. After that, in 2016, she went ahead and removed the gas stove, plumbing and closets to be able to pair with the EU as an accessory structure without the EU use.'",
        "'speaker_3': 'So now the applicant is looking again at being able to have the access we use and that's why she's looking at rezoning. So now she's gone from asking if she can resign from us. You seem to you, as you see one, to be able to allow for the accessory dwelling unit use in the existing structure.'",
        "'speaker_3': 'And I'm expanding on these because we received a letter from an R.A. So I just wanted to explain where that letter came from. This slide shows the existing area with the site of the proposed rezoning on the top, left and right and bottom left.'",
        "'speaker_3': 'Some images to show the residential character of the neighborhood. Now, speaking of the process, information on notice of the application was sent on December 17, 2020. Planning Board recommended approval on March 17 and if present one letter of opposition has been received from the Washington Park East Neighborhood Association.'",
        "'speaker_3': 'The main reason for the opposition is because the applicant got denied a variance back in 2060. The owner is not aware that in 2019 the applicant permitted the access restricted without the use. As you will know, the Denver zoning code has five review criteria, the first one being consistency with adopted plans.'",
        "'speaker_3': 'There are two plans applicable to this rezoning. The first one is comprehensive plan 2040. The second one is Blueprint Denver. The rezoning is consistent with several of this tragedies and comprehensive plan 2040. For example, this MAP amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead to an environmentally'",
        "'speaker_3': 'resilient Denver by promoting infill development where infrastructure and services already in place. Now looking at Denver, the subject property is mapped as part of the urban neighborhood context. The future places map designates the subject property as low residential place type.'",
        "'speaker_3': 'This place type have predominantly single and two unit uses and accessory dwelling units are appropriate on both. Street is designated as local streets street, which is mostly characterized by residential uses. The growth area in Denver is all other areas of the city.'",
        "'speaker_3': 'These areas are anticipated to see a 10% employment growth and 20% housing growth by 2040. Blueprint also includes specific policy recommendations. Housing Policy four focuses on diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_3': 'Staff also finds that the requested sorting meets the next two criteria. The rezoning will result in uniformity of district relations and will further the public health, safety and welfare primarily through the implement the implementation of adopted plans. The justifying circumstance for the rezoning is a clear of the plan since the approval of the existing U.S. district.'",
        "'speaker_3': 'The city has adopted the Comprehensive Plan 2040 and blueprint, Denver stated throughout this presentation. The proposed rezoning meets the intent of these plans. Lastly, the proposed zoning is consistent with the area of a neighborhood context residential district on the new as you see one zone district.'",
        "'speaker_3': 'Stock does recommend approval based on finding or review criteria has been met.'",
        "'speaker_1': 'All right. Thank you, friend, for the presentation. And I believe council members, you should have the presentation also in your inbox. Council tonight has not has not received any written testimony on Council Bill 21, Dash 0309. We have one individual signed up to speak this evening.'",
        "'speaker_1': 'Jesse Paris is our speaker. Go ahead, Jesse.'",
        "'speaker_5': 'That's good, he remembers. Members count for those watching at home. My name is Jessica Shaw. I'm Paris and I'm representing four black stars Exxon Mobil for self defense, positive action for Social Change, as well as the Unity Party of Colorado and Frontline Black News.'",
        "'speaker_5': 'And I will be the next mayor of Denver in 2023. I'm in favor of this 82 dwelling units for District six and Councilman Cashman's district. I just had a question about how this process works, because several times last week we heard from a gentleman who kept telling us that he was not able to get approved for his'",
        "'speaker_5': 'application in, I believe, was either Sunnyside or Chaffee Park in Amanda Sandoval's district. So if somebody from CPB could explain that process of how that works, I would greatly appreciate it. This may all of criteria. So I'm going to be in favor of this rezoning tonight.'",
        "'speaker_5': 'Uh, good. Good job, Casserly. Thank you.'",
        "'speaker_1': 'All right. Thank you, Jesse. That concludes our speakers questions from members of Council on Council Bill 309. Council Member Cashman.'",
        "'speaker_0': 'Thank you. Council President Fran. If if this bill passes, it allows for an ad you use on the property. But before this particular structure might be used for an idea, it would need to meet all other building code requirements, as was said.'",
        "'speaker_0': 'The stove was removed, so on and so forth. But it would need to meet any quality qualification imposed by our existing ordinances, correct?'",
        "'speaker_3': 'That is correct.'",
        "'speaker_0': 'All right. Thank you very much. That's all council present.'",
        "'speaker_1': 'All right. Thank you. Councilmember Cashman. Councilmember Flynn.'",
        "'speaker_0': 'How about I'm president? Fran, could you tell me if you're aware? Does the existing structure that was erected without permits and and operated as an aid to you without the zoning, I guess, for a couple of years? The owner then was turned down at zoning board, but given until 2019.'",
        "'speaker_0': 'Could you tell me if the building form complies with all of the rules for setbacks and height and whatnot for an ADU in this particular zone district?'",
        "'speaker_3': 'Yes, that's correct. It complies with everything. And anyway, when she goes to get to get it permanent now, because she's going to like once she gets the rezoning, she's going to have to get a permit again. So they're going to check on that again.'",
        "'speaker_3': 'So they're going to have to check again. But she complies with all but but it does the current it does comply with the said but of building form and everything.'",
        "'speaker_0': 'Okay. Thank you very much. That's. That's all I needed to know. Thank you.'",
        "'speaker_1': 'All right. Thank you, Councilmember Flynn, and thanks for answering those questions, Fran. The public hearing is closed. Comments by members of Council on Council Bill 309 Council Councilmember Cashman.'",
        "'speaker_0': 'Yeah, thank you. Council President I certainly have great respect for the neighborhood group and understand the concerns. But in my looking at the history of this property, first of all, the building as as Fran tells us, does meet the requirements imposed on an ADU in this setting as it is an existing building, it certainly doesn't change the'",
        "'speaker_0': 'landscape of the community. And I see no evidence that the property owner had evil intent when this structure was built. And I think it was a case of a lack of understanding of the zoning code, which is certainly understandable.'",
        "'speaker_0': 'I still have work to do myself to become fully conversant with with our code. So that being said, I will support this ADA application this evening, as I do believe that it's clear that the criteria as presented in our code had been met, and I would ask my colleagues to support that.'",
        "'speaker_1': 'All right. Thank you, Councilmember Cashman. And I concur. It does meet all of the required criteria and I will be supporting it as well tonight. Madam Secretary, roll call on Council Bill 309, please.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Can each. I. Ortega.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Sandoval. I.'",
        "'speaker_3': 'Sawyer, I. Torres. Black.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'CdeBaca, I. Clark.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Hi. I.'",
        "'speaker_3': 'Council president.'"
    ],
    "Rezoning for Accessory Dwelling Unit at 1590 South Emerson Street.": [
        "'speaker_1': 'I. Madam Secretary closed the voting and announced results. 11 811 Eyes Council Bill 20 1-0309 has passed. Council Member Clerk Will you please put Council Bill 310 on the floor for final passage?'",
        "'speaker_0': 'As Council President, I move the Council Bill 310 to be placed on final consideration and do per second.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. The required public hearing for Council Bill 310 is open. May we have the staff report, Fran?'",
        "'speaker_4': 'Sure.'",
        "'speaker_3': 'Okay. Can you see that one?'",
        "'speaker_1': 'Mm hmm. Go ahead.'",
        "'speaker_3': 'Perfect. So, you know, it's use my specialty, so. Here. We're going to be looking at the Map Amendment overview for 1590 South Emerson Street. Subject property is located in Council District seven with Councilman John Clark. In the flood park neighborhood.'",
        "'speaker_3': 'The property owner is proposing to rezone to a district that allows greater use. If approved, all forms and use standards should remain the same. The property is currently in the urban single unit thesun on the street, which allows for a minimum lot size of 4500 square feet.'",
        "'speaker_3': 'And as you can see on the map, most of the surrounding properties are also on us and U.S. You'll be one to a south. The site is currently occupied by a single unit home and it is mostly surrounded by other single unit and two unit uses as well as a public quasi public use, including a fire station'",
        "'speaker_3': 'just south southeast from the site. Here. You can see the area with the side of the proposed rezoning on the bottom left and the top right and left. Some images to show the residential character of the neighborhood. Speaking of the process, informational notice of the application was sent on January 5th, 2021.'",
        "'speaker_3': 'Planning Board recommended approval on March 17 and have received no letters of support or opposition have been received from the public or are in place. You know, the Denver zoning code has five review criteria. The first one is consistency.'",
        "'speaker_3': 'We adopted plans. There's two plans applicable to his rezoning Comprehensive Plan 2040 and Blueprint Denver. The rezoning is consistent with several of this prejudicing comprehensive plan 2040. This MAP amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead to an environmentally resilient Denver by promoting infill development where infrastructure'",
        "'speaker_3': 'and services are already in place. Now looking at in Denver, there's subject property is mapped as part of the urban neighborhood context. The future places map designates the subject property as low residential place type. These Plains states have predominantly single and two unit uses, and accessory dwelling units are appropriate.'",
        "'speaker_3': 'Emmerson Street is designated as a local strip, which is mostly characterized by residential uses. The growth area in Denver is all the areas of the city. These areas are anticipated to see 10% employment growth and 20% housing growth by 2040.'",
        "'speaker_3': 'Luke Bryan also includes specific policy recommendations. Housing Policy Ford focuses on diverse diversifying housing choice through expansion of accessory dwelling units throughout all residential areas. Stuff was fine, so they requested Sony meets the next two criteria. The rezoning will result in uniformity of district regulations, and we will further the public health, safety and welfare primarily through its'",
        "'speaker_3': 'implementation of adopted plans. Just defining circumstance for the rezoning is a caveat of this plan sees the approval of the existing use you based on district. The city has adopted the Comprehensive Plan 2040 and blueprint. Denver stated throughout this presentation.'",
        "'speaker_3': 'The proposed rezoning meets the intent of this plan's. Lastly, the proposed zoning is consistent with the urban neighborhood context residential district and the U.S. once owned district. Stuff does recommend approval based on finding or review criteria has been met.'",
        "'speaker_1': 'All right. Thank you, Fran. Tonight, council has not received any written testimony on Council Bill 21, Dash 031 ten. And we have one individual signed up to speak. Jesse Paris. We'll go ahead and get. Jesse, back into the queue here.'",
        "'speaker_5': 'Yes. Good evening. Members of council watching their crew. My name is definitely imperative. And still for black stars and symbol for self-defense of of social change as well as the unity party of Colorado and frontline black males. And I will be the next mayor of Denver in 2023.'",
        "'speaker_5': 'I'm in favor of this new zoning request tonight. As I have stated numerous times, I supported accessory dwelling units when I ran for city council at large in 2019, and I plan to support them in 2023 when I run for mayor.'",
        "'speaker_5': 'So with that being said, this meets all five of the criteria. So I'm in favor of this tonight. The job, a council man, Dylan Clark. You got this. Thank you.'",
        "'speaker_1': 'All right. Thank you. That concludes our speakers questions from members of Council on Council Bill 310. Seen no.'",
        "'speaker_3': 'Questions.'",
        "'speaker_1': 'The public hearing is closed. Comments by members of Council on Council Bill 310. Councilman Clark.'",
        "'speaker_0': 'Thank you. Council President I think as was articulated in the staff report, this clearly meets the criteria and I will be supporting it tonight and encourage my colleagues to do so as well. Thank you.'",
        "'speaker_1': 'All right. Thank you. And I also agree that it does meet all of the criteria and will be supporting it as well. Madam Secretary, roll call on Council Bill 310, please.'",
        "'speaker_0': 'Like I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_5': 'I. And I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Can each I.'",
        "'speaker_3': 'Ortega, I. Sandoval. I. Sawyer, I. I don't believe I see Tories.'",
        "'speaker_2': 'Black sheep.'",
        "'speaker_3': 'I see tobacco. I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '11 days.'"
    ],
    "Map Amendment for 3431 North Columbine Street in Clayton.": [
        "'speaker_1': '11 I's Council Bill 20 1-031 ten has passed. Councilmember Clark, would you please put Council Bill 317 on the floor for final passage?'",
        "'speaker_0': 'Yes, Council President. I move that council bill 317 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. I think I heard that second from council member Ortega. The required public hearing on Council Bill 317 is open. May we have the staff report? And I see we have Val here.'",
        "'speaker_2': 'Thank you, Madam President. 1/2. All right. Can you all hear and see that screen? Full screen?'",
        "'speaker_1': 'Yep. You got it, Val.'",
        "'speaker_2': 'Wonderful. Thank you. Good evening, City Council. And, Madam President, my name is Valerie Arara, associate city planner with Community Planning and Development. I will be presenting a rezoning case for the subject property located at 3431 North Columbine Street.'",
        "'speaker_2': 'I'd like to acknowledge Elyse Stevie, who has been my mentor throughout the process of this case. This is my first rezoning case, that city council. The request is for urban single unit, a one for 3000 square foot lot minimum size, and it is in Council District nine under Councilman CdeBaca.'",
        "'speaker_2': 'The subject property is currently 6250 square feet with a zone lot width of 50 feet. The proposed rezoning is to go from USC to be one which is a minimum lot size of 4500 square feet, allowing urban houses and detached adu use.'",
        "'speaker_2': 'There are a selection of parcels that have some two story main streets and mixed use zoning. Sorry. It was on the wrong. A block to the south and two blocks to the west. Zoning transitions to USA A1, which is the smaller size that the applicant is requesting.'",
        "'speaker_2': 'The existing land use is single unit residential with a mix of two unit and multi-unit existing uses in the neighborhood as well as some commercial and public public. Quasi public. The subject property is mid-block with alley access. The existing structure is nestled toward the rear of the lot and nearby properties are shown at the top in the'",
        "'speaker_2': 'bottom of this three. I should note that the bottom right picture is a an existing multi unit residential building form as well. For the process. The MAP Amendment did go to Planning Board on Wednesday, March 17. Planning Board voted 9 to 0 to recommend approval.'",
        "'speaker_2': 'The rezoning was moved forward to a final hearing of city council by the Land Use Transportation and Infrastructure Committee and is being heard today. The Clayton R.A. is in support of this request, and the application includes three letters of support from nearby Clayton Neighbors.'",
        "'speaker_2': 'Sapp also received one email throughout the process that is outside of the scope of the rezoning regarding trash in the alley or dumpster pickup. But that's been forwarded to the applicant and acknowledged. As you know, the Denver zoning code has five review criteria.'",
        "'speaker_2': 'The first is consistency with adopted plan, starting with comprehensive plan 2040. Staff found this rezoning to be consistent with several strategies shown here from the Comprehensive Science Plan 2040. With regards to ensuring equity affordability and inclusivity from the planned 2040 vision element, Sapp found that this rezoning is consistent with the goals listed here that encourage increased development'",
        "'speaker_2': 'of housing units close to transit, a greater mix of housing options in every neighborhood for all individuals and families, and ensuring that every neighborhood provide a complete range of housing options. In speaking to climate and environmental resiliency, this vision elements staff found this rezoning to be consistent with the goal listed here that encourages promotion of infill development'",
        "'speaker_2': 'where infrastructure and services are already available. For Blueprint Denver's Map for urban context. The context is mapped as the urban context is urban in this location and residential low, which consists of predominantly single and two unit uses on smaller lots.'",
        "'speaker_2': 'This is where we'll spend a little bit more time in terms of the lots split in the analysis. Specifically, when seeking a rezoning to a smaller minimum block size in a residential low area, it is only appropriate to allow smaller loft sizes than the existing zoned districts.'",
        "'speaker_2': 'If there is an established pattern in the surrounding blocks of smaller lots that similar uses that would be consistent with.'",
        "'speaker_3': 'The zoning district.'",
        "'speaker_2': 'Request, that language can be found on page 231 of the blueprint Denver Land Use and Transportation. In this area, 36% of the lots are between 3000 and 4499 square feet, which does align with the proposed U.S. one zone district.'",
        "'speaker_2': 'While there does not appear to be a dominant lot size in this area, this analysis does show that the size of the proposed U.S. A1 is even slightly more prevalent in the surrounding blocks, with similar uses than the existing U.S. one ones.'",
        "'speaker_2': 'Therefore, the rezoning is the proposed rezoning is consistent with diverse guidance for rezoning to a smaller minimum lot size for the Bruce Randolph Avenue plan. This plan was adopted in 1986 and does include this area. Staff found that the request is consistent with this plan, including recommendations such as the one shown here that speaks to diversity of'",
        "'speaker_2': 'in-fill housing located on page 39. Four criteria. Number two and number three, staff found that the rezoning is consistent with adopted plans. The proposed rezoning will result in uniform application of zoned district building form, use and design regulations, and it will further public health, safety and welfare through implementing adoptive parents and facilitating increased housing density.'",
        "'speaker_2': 'Staff also found that the proposed rezoning is justified through changed and changing conditions in this neighborhood. The adoption of Blueprint Denver includes policies that specifically support this rezoning to a smaller lot size on this site. Additionally, staff report lists recent redevelopment in the area that is similar to this lot size split request.'",
        "'speaker_2': 'And finally, the context zone, district purpose and intent of urban single unit A1 are all appropriate for this particular location given the surrounding area and the adopted plans guidance. Given the finding that our review criteria have been met.'",
        "'speaker_2': 'Staff recommends approval of this rezoning. And just to note that approval of a rezoning is not approval of a proposed specific, specific development project. And I will go ahead and share my screen and open for questions.'",
        "'speaker_1': 'All right. Well, thank you, Val. Great. First job presenting a council night. You're welcome. Good job. Council has not received any written testimony on Council Bill 21, Dash 0317. And we have one individual signed up to speak this evening.'",
        "'speaker_1': 'Jesse Paris. Go ahead.'",
        "'speaker_5': 'Yes, good evening. Members of Council of Watching at home. My name is just in the shop Harris and I'm representing for Black Star, similar for self defense positive African-American social change as well as the Unity Party of Colorado in front line black nose.'",
        "'speaker_5': 'And I will be there next November and 2023. I'm in favor of this rezoning tonight, especially in an area of town which I'm very familiar with, pretty much a native of East Denver, northeast Denver, in a rapidly gentrified area of town.'",
        "'speaker_5': 'So I welcome any opportunities that the city puts forward to deal with our affordability and our housing crisis that we've had for decades now, as previously stated. So I'm in favor of this rezoning. Um, I would love to know what the demographics of that are and who is going to be residing at this property.'",
        "'speaker_5': 'Because as I stated already, this area has been rapidly gentrified. Um, so, so I would take the time out to answer those questions. I will greatly appreciate it. Thank you.'",
        "'speaker_1': 'All right. Thank you, Jesse. That concludes our speakers this evening. Questions from members of Council on Council Bill 317. Councilmember CdeBaca.'",
        "'speaker_2': 'Thank you. Is the applicant here to speak to what.'",
        "'speaker_3': 'The proposed plan is.'",
        "'speaker_2': 'For the lots.'",
        "'speaker_3': 'And if there's a.'",
        "'speaker_2': 'Plan to do something yet? Yes. Councilwoman Whitney Parcell should be available if someone can bring your two panelists.'",
        "'speaker_1': 'Perfect. All right. Yep. All right, Whitney, you want to go ahead, make council member repose your question, because we were moving Whitney into the panelists.'",
        "'speaker_2': 'Hi, Whitney. I am just wondering, what's the plan with the with the parcel? Are you guys. Do you have something in mind already? We do. We would like to do two new homes on the property. One may be a rental one.'",
        "'speaker_2': 'Perhaps we move into. Perhaps will be for sale. We're not entirely sure yet, but the plan is that it will be two new homes built on the property instead of the one small house that currently is on the property now.'",
        "'speaker_2': 'Is there going to be a target affordability rate for the rent or do you are you guys thinking that far ahead yet? It's of course, it's you know, something we're considering?'",
        "'speaker_3': 'We would like to be able to.'",
        "'speaker_1': 'Do that for sure.'",
        "'speaker_2': 'That neighborhood definitely deserves some areas of affordable rent. Are you guys currently in the unit or. No. It is a 475 square foot unit. This is my husband, Darren, and we have our son as well. So we just do not fit in that home.'",
        "'speaker_2': 'It is currently a rental. Got it. Thank you. That's for my questions.'",
        "'speaker_1': 'All right. Thank you. Up next, we have council member Hines.'",
        "'speaker_5': 'Thank you. Council President Mazara, this is your first presentation to city council.'",
        "'speaker_2': 'Yes, Councilman, please take it easy.'",
        "'speaker_5': 'I was just going to ask, should I ask you the hard questions?'",
        "'speaker_2': 'Go ahead. Why not?'",
        "'speaker_5': 'I was just telling. Thank you for your great presentation. Thank you for all you do. Thank you. Council president.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'All right. Next up, we have council member Hines or excuse me, council member Flint.'",
        "'speaker_0': 'Thank you, Madam President. Valerie. And as long as Whitney is here, too, maybe she could offer an answer as well. I'm a little confused about how this lot could be split for two single units. Can you explain how that what that would look like?'",
        "'speaker_0': 'And then each of them would also have an ADU available. Correct. Under this rezoning.'",
        "'speaker_2': 'Yes. Council. Yes, Councilman. The current law does already have the right of an aide to you. Right. That is something that's existing. So this is the lot split to downsize the lot from the one 4500 minimum zone, lot size to one, which is 3000 square feet of a minimum zone, lot size.'",
        "'speaker_2': 'And that would bring the width down from 50 to 25 for those that lot split.'",
        "'speaker_0': 'So would they be side by side or would they be front and rear? What would that look like?'",
        "'speaker_2': 'Whitney, would you like to add to that? Yes, of course they would be side by side.'",
        "'speaker_0': 'Okay. So 25 foot front width. Correct?'",
        "'speaker_2': 'Yes. Yes.'",
        "'speaker_0': 'And you potential in the in the rear of each. Are you planning to do a to use as well or just are you going to demo the rental that's on there and build two new structures.'",
        "'speaker_2': 'Yeah. So we would demo the current home, build two new structures. The we, we want to, you know, go by zoning laws. We may or may not be able to do an 80 you that's I'm sure uncertain at this time but it's a possibility.'",
        "'speaker_0': 'Okay. Valerie would be if the lot were split and were these two very narrow parcels. Would it meet the requirements to add an edu on each of the on each of the split lots as far as setbacks and depth and everything else.'",
        "'speaker_2': 'That's a great question, Councilman. We actually, during the rezoning process, connects the applicant with our development services side of things so that they can go through perhaps this pre concept review and sort of get more into the nuances of the building form and standards.'",
        "'speaker_2': 'So not to not answered the question, but we are going through that process right now of trying to get that free concept going and getting what you do, the development services side of things.'",
        "'speaker_0': 'Okay. Thank you. Madam President, I think for Whitney, I would just add that you said your intention was perhaps to live in one and rent the other one out or sell the other one and live in one. And I think just a reminder and Valerie, you might be able to verify this, that if you had an edu'",
        "'speaker_0': 'on there, that the owner would have to. My recollection is the owner of the parcel would have to live in the in one of the residences, either the primary or the Adobe before one of them could be rented out.'",
        "'speaker_0': 'And that would be true on both lots of them, correct?'",
        "'speaker_2': 'That's correct, Councilman Flynn. Yes. And something that was also brought up and talked through that land use Transportation Infrastructure Committee.'",
        "'speaker_0': 'Excellent. Thank you. Thank you, Madam President. As as someone who grew up in a small little house of three bedrooms with seven people, all five, five sons, one bathroom. And my mother always said, thank God I never had a daughter because we only had one bathroom and a 25 foot frontage.'",
        "'speaker_0': 'I can relate to this. Thank you very much.'",
        "'speaker_1': 'All right. Thank you, Councilmember Flynn. All right. Seeing no other hands raised for questions. The public hearing is closed. Comments by members of Council on Council Bill 317. Council members, State Abarca.'",
        "'speaker_2': 'I do not have any comments on this.'",
        "'speaker_1': 'All right. Sounds good. And not seen any other hands raised. Madam Secretary, roll call on Council Bill 317, please.'",
        "'speaker_3': 'See the burka. I. Clark.'",
        "'speaker_0': 'I. When I.'",
        "'speaker_5': 'Hines, I.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_2': 'I can. I.'",
        "'speaker_3': 'Ortega by Sandoval. I swear. I.'",
        "'speaker_2': 'Black eye.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_3': '11 Eyes.'",
        "'speaker_1': '11 Eyes Council Bill 20 1-0317 has passed our pre adjournment announcement on Monday, May 10th Council will hold a required public hearing on Council Bill 21, Dash 035 to approving a proposed Loreto Heights rezoning and App Development Agreement between the City and County of Denver and ACM Loretto Six LLC.'"
    ]
}