{
    "Proclamation for the Metropolitan Denver Scientific and Cultural Facilities District.": [
        "'speaker_0': 'However, since no written protests of assessment were filed with the manager of public works by November nine, 2018, Council will not sit as the Board of Equalization for the proposed Skyline Park Local Maintenance District. Next up, we have proclamations.'",
        "'speaker_0': 'We do have one proclamation this evening. Councilwoman Black, will you please read Proclamation 1383?'",
        "'speaker_2': 'Yes. Thank you, Mr. President. Proclamation number 18 1383, recognizing the 30th anniversary year of the Metropolitan Denver Scientific and Cultural Facilities District. Whereas, arts, culture and science play a unique role in the lives of our families, our communities, our state in our country, and enrich our lives by embodying the accumulated wisdom, intellect, knowledge and imagination of humankind'",
        "'speaker_2': '. And. Whereas, in 1988, voters in Adams, Arapahoe, Boulder, Denver, Douglas and Jefferson Counties voted to create the Scientific and Cultural Facilities District, a special district collecting a 1/10 of 1% sales and use tax for distribution to arts, culture and science organization.'",
        "'speaker_2': 'And. Whereas, CFT was reauthorized in 1994, 24 and 2016 by the voters across seven counties, including Adams, Arapahoe, Boulder, Broomfield, Denver, Douglas and Jefferson Counties, securing a place for art, biology, music, zoology, dance, history, nature and botany in the fabric of our lives, ensuring nothing less than culture for all.'",
        "'speaker_2': 'And. Whereas, in the 30 years of CFD existence, the landscape of arts, culture and science in the metropolitan region has expanded greatly, with nearly 300 organizations spend IT funding from distributed distributed funds in 2017. And. WHEREAS, organizations benefiting from funds from CFD create an unparalleled level of access for Colorado residents, offering thousands of free and discounted activities'",
        "'speaker_2': 'each year. And. Whereas, nonprofit arts, culture and science organizations drive the Colorado economy by generating $1.9 billion in total economic activity and supporting 11,820 jobs in 2017. And. Whereas, CFD continues to thrive as a national model for cultural funding now, therefore, be it proclaimed by the Council of the City and County of Denver's Section one that the'",
        "'speaker_2': 'Council of the City and County of Denver State of Colorado does hereby proclaim 2018 as the 30th anniversary of CFD. Section two that the Clerk of the city and county of Denver shall affix the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the scientific and cultural facilities.'",
        "'speaker_2': 'District Executive Director Deborah Jordi.'",
        "'speaker_0': 'Thank you, Councilman Black. Your motion to.'",
        "'speaker_5': 'Adopt.'",
        "'speaker_2': 'Thank you, Mr. President. I move the proclamation 18 dash 1383 be adopted.'",
        "'speaker_0': 'It has been moved and seconded. Comments from members of Council. Councilman Black.'",
        "'speaker_2': 'Thank you, Mr. President. I'm honored to serve on the board of CFD. The 30th anniversary is quite a milestone. It collects close to $60 million a year for the metro region, for our arts, culture and science. Thousands of organizations have benefited, benefited in those 30 years.'",
        "'speaker_2': 'With that tax, we're able to have a world class arts and culture scene that you wouldn't have in other cities of our size. So it's been a great, great benefit to the city and county of Denver and all of the other counties surrounding us.'",
        "'speaker_2': 'Additionally, it was mentioned in the proclamation there are hundreds of free events and free days for all of the cultural organizations. And it's not just our big organizations, the art museum and the museum, nature and science and the performing arts complex.'",
        "'speaker_2': 'But it's also small arts organizations across all of those counties. So it's just an incredible benefit that we have living here in the metro region. And I think the voters of 1988 who voted for it and everyone who has reauthorized it since then.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. And Councilwoman Black, thank you for bringing this forward. This is. An incredible asset to our community. And I know cities across the country have tried to figure out how Denver and the metro area was able to accomplish this.'",
        "'speaker_6': 'You travel to other cities that may have a little bit arts and culture. I know Austin claims they have the biggest music scene, but our music scene is way bigger than Austin's. We just don't quite promote ourselves the way they do.'",
        "'speaker_6': 'Right. But, you know, it's not just music. It's our performing arts. It's our crafters. We have such a robust creative sector in this city and this metro area that we really have something to be proud of. And there are lots of people who work full time in this industry, but there are many who work part time and'",
        "'speaker_6': 'do other jobs. And if we could continue to grow this industry, then we could have more people that would be able to do this full time as opposed to part time. But, you know, almost any night of the week, you can go and listen to live music at any number of venues.'",
        "'speaker_6': 'We have many street festivals where we have music and crafters. So I'm I'm really excited. And for those of you who are not aware, the National Restaurant Stock Show is looking at doing a public market that sort of takes a lot of the work that's already happening to that next level where we have a year round go'",
        "'speaker_6': 'to place, where we could have a lot of these different kinds of things happening on a regular basis. So great work for everybody who has been part of this. I know this was under mayor pinions days. I remember Susan Barton scout worked for him when this was brought forward.'",
        "'speaker_6': 'But it was a metro wide effort and continues to be. And it's not just venues in Denver that get to benefit from this. There are venues across the metro area. And so we're we're really a very blessed community to have these incredible assets, not just the physical structures, but the people who make all of this happen.'",
        "'speaker_6': 'So congratulations for 30 years of some incredible stuff happening in our metro area.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. So, you know their comments. I'll just add a second to everything that was said. We are very lucky to have CFD and to have voters who are forward thinking enough to see what that could be.'",
        "'speaker_0': 'Awesome organization. And thank you, Councilman Black, for bringing this forward. Madam Secretary, Raquel.'",
        "'speaker_2': 'Black Eye.'",
        "'speaker_4': 'Brooks Espinosa, i Flynn I.'",
        "'speaker_6': 'Gilmore, i.'",
        "'speaker_5': 'Herndon, i.'",
        "'speaker_4': 'Cashman can each i.'",
        "'speaker_5': 'Lopez Hi.'",
        "'speaker_2': 'Ortega. Hi, Susman.'",
        "'speaker_4': 'Hi, Mr. President.'",
        "'speaker_0': 'I am. I'm secretary. Please close voting announced the results. 12 hours 12 hours proclamation 1383 has been adopted. Councilman Black, is there someone you'd like to bring up to accept?'",
        "'speaker_2': 'Yes, we have two people from CFD here today, Deborah, today, who is our executive director, along with our board chair, Rob Johnson. Rob, please come give Deborah some support. It's an incredible board and an incredible organization. And thank you both for working so hard.'",
        "'speaker_6': 'Thank you. Thank you, Councilman Black, President, members of council. We are truly happy to be here and really appreciate your ongoing support. You know, I remember the days when Susan Vargo, Gail was on council. It really working hard through to every council since.'",
        "'speaker_6': 'But what's unique is not only the the depth and breadth of what the organizations do, but the reach of collaboration. We have so much collaboration between Denver organizations in Boulder and Douglas County that come together just like we see in other parts of our community and the business sector and others.'",
        "'speaker_6': 'It's amazing to think that in 1989, the first year of distribution, there were 124 organizations. Today there are almost 300. At that time, the first year of distributing the funds, it was $14 million. And as Councilman Black said, we're on the road to $60 million.'",
        "'speaker_6': 'The National Endowment for the Arts total budget for the country is around 150 million for the entire country. Our distribution is in the seven county the size of Delaware and Rhode Island put together. So it's pretty remarkable. Remarkable.'",
        "'speaker_6': 'It's also what the organizations do to create wonder and joy for the children. When you think last year that 4.3 million children attended cultural performances or run outs at their school. So thank you for having us and supporting us.'",
        "'speaker_6': 'CFT.'",
        "'speaker_0': 'Thank you. Thank you very much. Was our only proclamation before we move on. Unfortunately, due to fire code and the signs on the back. We can't have anybody standing in that back aisle. That is the ingress egress. So I would ask if everybody can get real cozy and make room so that we can fit everybody in.'"
    ],
    "Amendment of the Denver City Council Rules of Procedure.": [
        "'speaker_0': 'You want to do that 1/1, since it's the resolution. All right. So anything else other than 1292 and 1300?'",
        "'speaker_5': 'All right.'",
        "'speaker_0': 'We'll do 1300 first resolution. So, Madam Secretary, if you could put that on our screens. And Councilman Cashman, will you please put council resolution 1300 on the floor?'",
        "'speaker_5': 'Yes, Mr. President. I put a council bill 1300 forward to be published. Adopted? I think that the adoption news me. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Cashman.'",
        "'speaker_3': 'It.'",
        "'speaker_0': 'Can we get the motion on? And it's been moved and seconded questions or comments by members of council. Councilman Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. I know that this council looked over our rules and and regulations. Our rules are rules of procedure and our retreat. And we discussed these we discussed these proposals as ideas and some of the things we actually just did just as as as a courtesy to be more efficient for us to be able to'",
        "'speaker_5': 'respect people's time. And we're going to be doing better. I mean, we've all committed to doing that to be to remind our own decorum. Right. And be an example, especially nowadays. But some of the so some of the things in here, a lot of the majority of the things in here, I actually would support and do support'",
        "'speaker_5': '. However, there are two things that I just I just cannot bring myself to support, and that is limiting ourselves and limiting the proclamations that we hear in council. This is the second time, as a sitting council member that I'm part of a council that chose to limit the proclamations and take them down.'",
        "'speaker_5': 'We've done it in the past and we are proposing to do it tonight. And the second is not reading those resolutions into the record. It may seem mundane, but for me, as somebody who has grown up, born and raised in this city in my previous life, as a as an organizer, and just somebody who cares a lot'",
        "'speaker_5': 'about my city and how it operates. I didn't mind the resolutions. I didn't mind being in city hall and sitting in these council chambers and watching the council conduct its business. Our business, our collective business as a city, I do think that there's importance in reading those resolutions into the record.'",
        "'speaker_5': 'I understand that our meetings goalie and as a council member for 11 years, I know that on Monday night I'm here. And sometimes those Monday nights have gone into Tuesday mornings. But that's just the business of the city.'",
        "'speaker_5': 'That's our job. I really believe that that's what we sign up for. Monday nights are so precious. I wouldn't have ran for city council. And I have a family. I have a little girl. She. She knows. She knows.'",
        "'speaker_5': 'She knows the game. She knows the procedure. She knows the protocol all her life. I could get a lot of those Monday nights back, but I she knows that there is a shared sacrifice. Right. And so for me, I.'",
        "'speaker_5': 'I just. I just. And not to take away from anybody who feels otherwise. I just myself, I just see I honor and respect. And sometimes I maybe the little mundane things like that. But I honor and respect the procedures of this council over time.'",
        "'speaker_5': 'I know that I'm here temporarily as a city councilman. I'm a term limited city councilman. All of us have term limits. All of us are up for reelection every four years. So this this doesn't belong to us. We belong to it.'",
        "'speaker_5': 'And having said that, I know that council's in the past this is what they did. And yes, they wanted to run efficient meetings. And we can do better than that. We can run efficient meetings, but not at the end.'",
        "'speaker_5': 'We can go home earlier on Monday nights, if that's the case. But. I don't mind it when it's what I chose to do. And so I know it may seem like I'm making a big deal about this, but I am because I respect this institution.'",
        "'speaker_5': 'I respect the city council. I respect the legislative branch and the powers that divvy up in this city. And you're hearing this from something from a term limited city council person who shot clock ends on in July. I could easily say, Oh, no, it's okay.'",
        "'speaker_5': 'I'm not going to be a part of that council anymore, which I won't be on in July. But I care about it, I care about this, what we do. So I will not be voting yes on this, I think.'",
        "'speaker_5': 'I mean, my, my, my, my reasons known at the retreat, I made my reason known in one on one. And I will do it here tonight. So. Mr. President, thank you for that. For for the time. And I'm a no vote on Resolution 1300 of 2018.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. President. I want to thank Councilman Lopez for bringing us out for a vote. And I know that the votes are here to pass this. And I also intend to vote no because of the one item doing away with reading the resolutions.'",
        "'speaker_7': 'And it's not for ceremony and it's not for ritual and it's not for tradition. It's because to a large degree, the council prior to this one, the prior term, decided to move a lot of very significant business from to reading council bills to a one reading resolution.'",
        "'speaker_7': 'And a couple of weeks ago, we passed a $48 million contract out of Denver International Airport on a one reading resolution. And had that been scheduled for a week or so from now, you would no longer get to hear that.'",
        "'speaker_7': 'Yes, I understand it's printed on the agenda. You can see it online. But I think in today's climate, it's the wrong time to draw a curtain on on transparency. If if we can do away with reading a $48 million contract across the desk, then why not propose a charter amendment to all to do away with reading council'",
        "'speaker_7': 'bills on first reading as well to shorten it even more? We do too much important business by resolution, in my view, to not have the council secretary read at least the title of it. Not everybody's online, not everybody has a computer, not everybody pays attention, not everybody watches this meeting.'",
        "'speaker_7': 'But for those who do, and just for the transparency's sake, I think it's a wrong thing to do away with reading that part of our business we read. Every other item that comes across the agenda is read or acknowledged in some fashion.'",
        "'speaker_7': 'And so I'll vote no for that sole reason. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Flynn. Councilman Lopez, are you back up?'",
        "'speaker_5': 'I forgot to mention one thing. If you just indulge me, the. I spent a lot on the resolutions. But the other reason is our proclamations. Proclamations is how we honor people in our city. It's how we take collective positions.'",
        "'speaker_5': 'It's how we honor our workers that have gave their whole careers and lives in front of us. That's how we honor the folks that have passed. It's how we honor people who have lived in our living and doing a tremendous job in our city and especially in these times when there's when decorum is at its lowest in'",
        "'speaker_5': 'in in politics in this city. And we we flip on the tube. And no offense to the folks that do this, but you hear all this this this terrible stuff about government and about the citizens in our democracy.'",
        "'speaker_5': 'And a lot of it is being I mean, a lot of it's true, but we don't hear enough of those folks that are actually doing right and and being recognized in our city. And sometimes this is the only opportunity to do it.'",
        "'speaker_5': 'So I believe in that. And that's also how we take positions. We have a state senator, a state senator here. We have somebody from our state capitol. Sometimes we send positions that we care about collectively in a proclamation across the park.'",
        "'speaker_5': 'So they know where we're at and they have it there. And they can say Denver supports things like needle exchange, Denver supports the DREAM Act, Denver supports comprehensive immigration reform and these proclamations of travel to the White House.'",
        "'speaker_5': 'I don't think they're being read write it. But they do. Right. And so so why limit ourselves? It's not eliminating proclamations altogether, but it's only narrowing it down to two. And I think it's important that we continue to do this.'",
        "'speaker_5': 'Thank you, Mr. President. I'm sorry for taking a little bit more time.'",
        "'speaker_0': 'That's right. Thank you. Thank you, Councilman Lopez. All right. Seeing no other comments, Madam Secretary, roll call Lopez.'",
        "'speaker_4': 'No black.'",
        "'speaker_2': 'Brooks.'",
        "'speaker_4': 'Espinosa. Flynn, no Gilmore.'",
        "'speaker_5': 'I Herndon I.'",
        "'speaker_4': 'Cashman. I can reach Ortega. No assessment by Mr. President.'",
        "'speaker_0': 'I I'm secretary. Please close voting on those results.'",
        "'speaker_4': 'Nine eyes. Three knees.'"
    ],
    "Supervised Use Site Pilot Program Authorization.": [
        "'speaker_0': 'No, no, it's three names. Council Resolution 1300 has been abducted. All right. That brings us to 1292. Madam Secretary, if you could put that up on our screens. And Councilman Cashman, will you please? What? Counsel Bill 1292 on the floor.'",
        "'speaker_5': 'Yes, I moved the council bill 18, Dash 1290 to be ordered published.'",
        "'speaker_0': 'Thank you, Councilman Cashman. It has been moved and seconded questions or comments by members of Council Councilman Flynn. You called this one up?'",
        "'speaker_7': 'Yes, Mr. President, I did. In the three years that I've been sitting up here and indeed looking back on the probably 30 years I used to sit over there, I can't recall an issue on which I have struggled.'",
        "'speaker_7': 'As much as I struggled trying to come to terms with this one, because this is literally life and death. And I recognize that and I respect that. There are just so many moving parts. To the issue of supervised use facilities.'",
        "'speaker_7': 'And I haven't been able to settle yet on whether I believe I truly believe that this approach will be effective. Or the best way to proceed, as opposed to some other methods I've seen elsewhere. And as I did more research, I came to believe that it would be really good for this city to provide.'",
        "'speaker_7': 'To its citizens, not just to its first responders, but to family members and to citizens and to volunteers. Naloxone kits or Narcan kits. And to have them volunteer or even in their own family, to go out into the community where we are finding.'",
        "'speaker_7': 'Overdose deaths. I had one right around the corner from my office in the Bear Valley Shopping Center. A woman in it was found in a car after three weeks in an abandoned car. So this is this hits real close to home to me.'",
        "'speaker_7': 'I've also had a heroin bust of a dealer right outside my office in Bear Valley. This hits real close to me as well. And while I was considering whether this other approach might be more effective as I'm watching television last night after the news, 60 Minutes came on and detailed the this very program in Salt Lake City'",
        "'speaker_7': ', this program of distributing naloxone kits to the general population and the effect it's having on saving lives there, as opposed to establishing a single site here where the government will then sponsor you in in safely injecting your opioids or your meth or whatever substance.'",
        "'speaker_7': 'And so I'm still so unsettled, not just on the matters of law, the state law, which still doesn't allow that may change in the next session. And I understand that this bill is contingent on that passing, but also the issue of federal federal law and whether this runs afoul of federal law.'",
        "'speaker_7': 'We know that the Justice Department believes that it does. And so, Mr. President, at this point, I know that there are votes here to pass this, but I intend to be probably the sole no vote on this, because I'm not convinced that this is the best approach for this city.'",
        "'speaker_7': 'The deciding factor for me was a recent article in Vancouver where they've run a site like this for 15 years, and in the year 2017, Vancouver set a record for overdose deaths after 15 years of having such a facility.'",
        "'speaker_7': 'The problem in Vancouver was I think it was 48% more deaths in 2017 than in 2016. And this is after 15 years of this approach. So I'm not persuaded that a government sanctioned injection facility is a better approach than having a community full of volunteers who go where the problem is, who go to the Cherry Creek bike'",
        "'speaker_7': 'path or the central library. In the Central Library, they've had.'",
        "'speaker_5': '21.'",
        "'speaker_7': 'Overdoses reversed by the security teams down there since about the last year and a half. And I think that would be a much better approach than to set up a facility like this. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Councilwoman Sussman.'",
        "'speaker_2': 'Thank you, Mr. President. I am in support of this bill, and I just think that it's really important for us to take a real realized reality. People are going to be doing this and people are going to be doing this on our streets.'",
        "'speaker_2': 'If we pretend that it's not happening, it's not going to go away. And we we are known.'",
        "'speaker_6': 'In Denver for doing some very bold.'",
        "'speaker_2': 'Things. And even though it I don't really want to compare them, we win against federal government for marijuana. Again, sort of looking at reality. What is the reality here? And I think with the safe injections, we can at least prevent some deaths.'",
        "'speaker_2': 'I actually want to sort of like Councilman Flynn was talking about. I'd like to also think about the deaths that that we might prevent that aren't about public injection, but the deaths of people inside their homes, the sort of the invisible addicts, the ones that are taking the pills.'",
        "'speaker_2': 'And certainly the 60 Minutes article last night talked a great deal about that. Here I am already. We haven't passed this one and I'm piling on. What can we what can we do next to to understand the reality of the situation?'",
        "'speaker_2': 'We have to be grown up about this and what can we do? And I feel like this is a really important step. If it doesn't work, I suppose we'll learn how to make it work. And we wouldn't never learn how to make it work if we didn't try this this particular path to helping folks who are struggling'",
        "'speaker_2': 'with this disease. This is a disease. Thank you very much, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Councilman Brooks.'",
        "'speaker_3': 'Yeah, thank you, Mr. President. And thank you, everybody, that's here. And thank you for being a part of this journey and teaching this entire city what's going on in the dark. Councilman Flynn mentioned some issues. This is a hard decision for him.'",
        "'speaker_3': 'If this is an easy decision for you and you are supportive of this, please stand up. Thank you. All of these individuals here are in our community and they have personally witnessed the hard stuff that we've been thinking about for the last.'",
        "'speaker_3': 'Well, that I've been thinking of for the last year and a half, but that we've been contemplating for the last four weeks. And this is a public health crisis that we're in and we're bringing it to the light.'",
        "'speaker_3': 'And I am supportive of this. I do feel like we've waited long enough and it's time that we address this issue. Councilman Flynn, let me just address two things that you said that are a little bit inaccurate. One, the government is not sponsoring this.'",
        "'speaker_3': 'This actually is going to be privately run. A nonprofit will run this. That's in the bill. Number two, Vancouver is one, but 60 cities internationally that have data in context. And so to just look at that and not look at the other cities like a Barcelona, which I've mentioned this many times, the day one that they've opened'",
        "'speaker_3': 'up a supervised use site. Dramatically. They saw a drop in deaths and they're continuing to see a drop in deaths. And so it's important that you look at the data per the context that you're in. Last thing I'll say is we have no good American data.'",
        "'speaker_3': 'That's why we're asking for this pilot. And here tonight, we do have a state senator who will help us take this to the next level. And I'd love. Mr.. Mr. President, if you indulge me for about 3 minutes, to have State Senator elect Brittany Patterson come and just share a little bit, because I believe she's for the'",
        "'speaker_3': 'title for this bill at the state. And I think we need to hear about that at the city. Is that okay, Mr. President?'",
        "'speaker_0': 'Yup. Go ahead.'",
        "'speaker_2': 'Hello, everybody. It's great to be here. I've never actually testified, so I apologize if I didn't go. Don't actually do the right rules and I call you by the right title. I am currently state representative. I was just elected to enter the state senate.'",
        "'speaker_2': 'I have pulled a bill and I just wanted to come here to thank you for taking this initiative because Denver, actually showing that they want to move forward with a pilot program is going to be an essential step in us actually taking action at the state level.'",
        "'speaker_2': 'I feel very confident with the change in leadership that will actually get a fair hearing this time and that this will be a bipartisan bill. I know that this is an uncomfortable issue to talk about. It is something that we don't want to recognize is happening.'",
        "'speaker_2': 'But I can tell you that whether or not we pass this pilot program and whether or not we pass this at the state level, people are going to continue to use and inject drugs and they are going to continue to die.'",
        "'speaker_2': 'In fact, we saw the highest overdose rates last year in the highest death toll that we've had here in Colorado. And we expect it to continue to rise here and nationally. We've been told by experts that it's going to get worse before it gets better.'",
        "'speaker_2': 'And to Councilman Flynn, what happened in Vancouver is actually because it wasn't because of the safe you cite, it was because right now they're actually having a surge of fentanyl. And so we've met with with professionals. I had the opportunity to visit Vancouver and the the police officers that we were in contact with said that heroin doesn't'",
        "'speaker_2': 'even exist there anymore because they get such a a greater high from fentanyl. So that's actually where the skyrocket of deaths is happening. So what we have the opportunity to do right now is to make history in making sure that we are treating people with an addiction, with the care that they need, that we're bringing them out'",
        "'speaker_2': 'of the shadows for people that are injecting drugs. This has been a long journey. You don't just start using heroin. I know my mom was overprescribed. Opioids, like so many people here in Colorado and across the United States, she was a soccer mom.'",
        "'speaker_2': 'We were in the middle class. She is an amazing person. This is this affects everybody. I mean, I'm telling her story because the greatest barrier that I have found to actually getting people the help that they need is the stigma that exists.'",
        "'speaker_2': 'And when we talk about even this site, it is it is uncomfortable for people to talk about. So I want to tell you about my mom. She was overprescribed opioids. Like so many people, she had a back problem.'",
        "'speaker_2': 'We've seen a system that has incentivized overprescribing. That's why right now we are facing a public health crisis. We are facing the greatest public health crisis of our time. And you happened to be elected during this time. And it is incumbent upon all of us to act.'",
        "'speaker_2': 'And this is one measure in ensuring that we're actually keeping people alive that have gone down the path. 80% of people who use and inject drugs started off with prescription opioids like my mom. So when you think about that journey that has led them to the point where they became wildly addicted, like my mom, so many people'",
        "'speaker_2': 'are getting cut off of their prescription without access to treatment because right now we're trying to ramp up actually getting them the help that they need. But we need to make sure that we're keeping them alive today. I when you are injecting drug injecting drugs, it's very isolating.'",
        "'speaker_2': 'So a lot of these people, the point of having a pilot program to have these super supervised sites is actually bring them out of the shadows in front of health professionals that are not only going to ensure that when they're using drugs, they're not overdosing, but also building those relationships, having a room where they can sit, get'",
        "'speaker_2': 'they're making sure that we are testing them for hepatitis C, for HIV, making sure that when they're ready to get help, that we actually give them the prescription that they need for medication assisted treatment. And then ultimately, when they're ready to move towards our.'",
        "'speaker_2': 'Recovery, that they have those relationships intact and that we're actually building capacity there to get them the treatment that they need. So my mom has been addicted to drugs for 30 years. She was cut off when her doctor recognized she had a problem.'",
        "'speaker_2': 'And she, like so many people, was just trying to stay well. It wasn't about getting high. It was about making sure that she was not going through withdrawal. People who are addicted say that withdrawal is they fear withdrawal more than death.'",
        "'speaker_2': 'So when you think about the physical pain that that must be that you fear going through that more than death. So they will do anything to stay well. And that's why so so many people have moved to injecting drugs, to buying cheap heroin on the street.'",
        "'speaker_2': 'And we've seen an increase in fentanyl here as well. So you have an incredible opportunity to move forward to show Colorado that we are not going to increase the amount of crime in this area. In fact, it's been proven to do the opposite, that we are going to save lives and that we are going to actually get'",
        "'speaker_2': 'people to help that they need. This is going to really change. Be an example for Colorado. And I just want to thank thank you for the opportunity to speak to you. Thank you for taking this up. This is this is critical for the United States and for Colorado.'",
        "'speaker_0': 'Thank you. Councilman Brooks, was that all you.'",
        "'speaker_3': 'Had a follow up at the end? Okay.'",
        "'speaker_0': 'Thank you very much, Councilman Cashman.'",
        "'speaker_5': 'Thank you, Mr. President. I agree with Councilman Flynn on a couple of areas. I'd like to see Naloxone much more readily available in the community. I think that makes great sense. And I also agree that I don't know that this is the right solution for Denver.'",
        "'speaker_5': 'What I do know is that we have no drug treatment beds available in the Denver area. I know that we don't have a functioning mental health system in the Denver area outside our jail system. We have like 98 or 90 beds at Denver Health for both mental health and drug treatment.'",
        "'speaker_5': 'For a city of 700,000 and a metro area, somewhere around 3 million are allowing people to die in restaurant bathrooms and in our parks and on the street has not slowed the the opioid epidemic. And as Mr. Patterson said, you know, the landscape changes continually.'",
        "'speaker_5': 'Now it's fentanyl. Who knows what else is going to be appearing for me? And I totally understand the difficulty that many people are have having wrapping their minds around providing a facility for people to inject. Illegal drugs. I get that it's difficult for me to wrap my mind around it, but we need to try something to stem'",
        "'speaker_5': 'the tide. As as my friend Lisa Revell says all the time, we can't get someone into treatment when they're dead. You know. While while the country is getting off its lazy behind to take care of the mentally ill and to take care of people suffering from the disease of addiction, we owe it to to our community to'",
        "'speaker_5': 'do something to keep keep things going until we can give them the care that they need. So I'll be voting to move this forward. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Cashman. Councilman Espinosa.'",
        "'speaker_3': 'I watched I watched the 60 minute piece and what was happening there were an 80 $80 drug was being put to market at $4,000 is appalling. And I hope that companies commitment to bringing that drug price back down is fall through.'",
        "'speaker_3': 'And I hope that people maybe all of you will write in Visio and make sure that that drug, which there's their mechanism for delivery, is far simpler than anything else on the market and could be readily administered by people, the layperson.'",
        "'speaker_3': 'There's no reason why in America that isn't the standard protocol for how we deliver this drug. That said, the life saving ability of naloxone is proven. And I can tell you, if one life is saved in the supervised use facility, the facility is paid for.'",
        "'speaker_3': 'And so that as tangible as that is, the only reason I mean, that isn't the only reason I supported supervised use facilities. From the moment Councilman Brooks approached me on this and I've never wavered on that is because it's not just the life saved in the facility.'",
        "'speaker_3': 'When you're present and able to address that, it's the other aspects that are tangible from this side of the dais in delivering services to this community is you will get fewer overdose deaths because those lives are saved, you will get fewer ambulance calls for overdoses.'",
        "'speaker_3': 'When I went on my one ride along with with the FDA and I'm sort of maybe violating hip rules, we went on one of those calls. I've never experienced that. And it was it was eye opening. And and that's midday on a on a on a Friday.'",
        "'speaker_3': 'That's not the hot spot for when those things are. But it happens on a routine basis in this city. The decrease in transmitted diseases that are transmitted by by dirty needles and things like that, all of those have major consequences to our our ability as a city to deliver services to populations that need them.'",
        "'speaker_3': 'And so this is actually the step in the right direction. And and so thank you, Councilman Brooks. Thank you all for supporting council in in doing what is is is a bit a bit too progressive for some, but it's the right thing for this city.'",
        "'speaker_3': 'And and I'm happy to be supporting it. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. I am a yes vote. This is this is very easy to me when the question was asked me about it. And this was absolute. Yes. And for a couple of reasons. And one is in this country, we are absolutely backwards.'",
        "'speaker_5': 'We are backwards when it comes to drug treatment. We are backwards when it comes to medicine. We are backwards when it comes to health care. We are an industrialized nation and we are an incredibly powerful nation and a wealthy nation.'",
        "'speaker_5': 'Yet we do not. You have more access to illicit and pharmaceutical drugs than you do to medicine to treat it. And when it comes to when it comes to treating it, we create all these barriers. We don't we don't believe it's a function of government to treat it.'",
        "'speaker_5': 'We don't believe I mean, we believe it's a it's a privilege and not a right. Collectively, there is something wrong with that. And so we are in we of course, we're going to be afraid of it. Of course we're going to be fearful and nervous about it if we haven't been exposed to how to actually treated.'",
        "'speaker_5': 'And in order to do that, you have to leave stateside and go across the world to see how they're treating it. And we have to learn from other countries. We have to learn from other, you know, other governments that are doing this right.'",
        "'speaker_5': 'I do believe this is absolutely worth it. I don't want to see somebody overdose pass away anywhere in a park or in a bathroom, anywhere or even in a facility. And this you know, this is an opportunity to go in that right direction.'",
        "'speaker_5': 'It's more than just a test. We know that this is proven. And when when we put our our resources and we behind it, and we do believe it is our function. Right. And so finally, I think I would imagine that.'",
        "'speaker_5': 'If you are in one of these sites, you have access to not just sterile, sterile needles and people there who are supervising you and know what to do just in case, but also because you have someone to talk to.'",
        "'speaker_5': 'And that person, that interaction could be that interaction that gets them on that right path. So you know what? Maybe I shouldn't do this. You think I should do this? It's up to you. It's a survival rate. I mean, you have those conversations.'",
        "'speaker_5': 'Think about those conversations. And how those in and of themselves are life saving. And that's what we want. Access to care. Access. That is so easy. Yes. On this one. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Thank you. Guzman-Lopez Councilwoman Black.'",
        "'speaker_2': 'Thank you, Mr. President. I wasn't going to say anything tonight because this is just first reading and it will be back up next week. But since everybody is talking, I thought I should put in my $0.02 worth. I agree with all of the things that have been said for the reasons why we should have this and it'",
        "'speaker_2': 'is a crisis and there are no solutions. And so for those reasons, I am in favor of it. However, I do agree with Councilman Flynn's concerns. So there are two things that are really important to me. One is that there is treatment available and that it will connect people to treatment.'",
        "'speaker_2': 'And I said that in committee, someone Cashman said it tonight, we don't have enough treatment, so we've got to work on that. The other thing is the fact that it's a pilot and we need data and we need real data.'",
        "'speaker_2': 'And I think it will be hard to collect because it's a changing landscape if there's more fentanyl coming in. I don't know how you collect that data, but we need to have real data so that we can look back and see how successful it was or it wasn't.'",
        "'speaker_2': 'So without those two features, I would not be supporting it. But as of now I am in support of it. And thank you for your work, Councilman Brooks, and everyone, for being here tonight.'",
        "'speaker_0': 'Thank you, Councilwoman Black, Councilwoman Cannick.'",
        "'speaker_2': 'Thank you. I, too, want to thank Councilman Brooks for his not just sponsorship, but leadership on this issue and to the community. That also is leading example of code governing, where you work together to challenge and take on a challenge.'",
        "'speaker_2': 'I guess for me, I just was thinking about the comments about this being a disease and I think about what if it was kidney disease and people were trying to treat themselves with their own dialysis and they were dying in the alley because they'd done it wrong?'",
        "'speaker_2': 'Or what if it was cancer and they were, you know, self administering in no other disease model do we leave folks to fend for themselves. And so the difference between this and the other diseases is the stigma, right?'",
        "'speaker_2': 'That's the stigma and the misunderstanding that the point at which addiction occurs, it becomes medical. It's it's a physical dependency. It's not a weak moral character. And in this particular set it well in some of the drugs, not all the introduction drugs, but in the case of heroin, what we know is that people actually need medicine in'",
        "'speaker_2': 'many cases because they can die from quitting or they can die from the process of trying to wean themselves off in their tolerance changing. And so I agree, we need more treatment. We also need, you know, medically assisted treatment in the form of replacement methadone or the other the other types of replacements that are available to make'",
        "'speaker_2': 'this a safer transition, because in this case, the transition off can be can be dangerous as well. So thank you to my colleague for pointing out the medical nature of this situation. And I think the second thing that resonates with me is Councilman Espinoza's point about one life.'",
        "'speaker_2': 'And so I think that there's, you know, several ways to think about data. And I think that a simple comparison of whether or not deaths are dropping or not is not an accurate scientific model. The way that you have to do this is you have to ask the question of bending the curve so it's not did fewer'",
        "'speaker_2': 'or more people die since supervised injection, but did fewer people die than would have died without it? And so you will know that from from the the potential reversals or from the community that's being served compared to a control group, for example, that's not being served.'",
        "'speaker_2': 'So there's a couple of different ways that I believe good, good professors and good researchers could could structure this, but it will never be a more or less situation because, again, it's one site. We can't put the expectation of eliminating addiction in a community on one site.'",
        "'speaker_2': 'So we have to have realistic evaluation methods. And so if we have those, I think we'll have a really informed discussion. So so with that, I feel like this is the right next step. I appreciate having our state leaders here and I imagine this will be an ongoing dialog with them.'",
        "'speaker_2': 'The one other thing I will say is the federal government, the appointees who serve in the federal government are not always right in the law. That has been proven numerous times, including cases that this very city has been engaged in regarding their interpretations of federal law where cities have prevailed.'",
        "'speaker_2': 'So while it's important for us to consider the federal legal landscape, it is not beyond this administration to overread or under read the law. And they have been corrected on numerous occasions. And so I think that it's important for us to do what is right to legally research and evaluate it and then to be bold enough to'",
        "'speaker_2': 'understand that we won't be threatened by our beds. Beds are not legal opinions from judges. They are the opinions of one individual in a newspaper. And so it's important that we be strong, thoughtful and not shy away from a good, important debate, even if it involves some legal questions down the road.'",
        "'speaker_2': 'So with that, I will strongly be supporting this tonight, and I wish our community luck with the process of considering this. Should we have the legislation we need at the state to move forward? Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I, too, will be. This tonight is, as you all heard, once the state takes action. Then our Board of Environmental Health will engage in this process to figure out, you know, are we looking at one or are we looking at more than one?'",
        "'speaker_6': 'What are the criteria? All of that stuff that would need to be put into place. And I know that will be a public that will include a very public process. So I'm very comfortable with with that sort of next step phase of where it goes.'",
        "'speaker_6': 'The one thing I do want to mention, having received a letter from an adjacent property owner to the existing site, there have been concerns expressed about some of the issues around the current site that are related to just safety is one of the things that is being expressed.'",
        "'speaker_6': 'They have an apartment building that has the highest vacancy rate because of its close proximity to this site. Now, he does mention that there is a homeless shelter close by as well and is indicating that it's just I don't know if it's the individuals that are hanging out outside of the facility and in this alley that they're'",
        "'speaker_6': 'concerned about. But how we do the operations at any location that is selected is going to be really important to being a good neighbor to the adjacent community, because with any of our operations, whether it's a liquor store or a marijuana facility, these are issues our neighborhoods scream at all of us about and want to make sure'",
        "'speaker_6': 'that we're helping ensure that we have a safe community for everybody. So we want it safe for the people who are utilizing the facility, for sure. But we also want to make sure it's a safe facility for the adjacent community, and that will all be part of that environmental health process when after the state legislature takes action'",
        "'speaker_6': 'and we are able to then move forward with the first ever safe injection site in the city of Denver. So I will be supporting this. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega, Councilman Gilmore.'",
        "'speaker_6': 'Thank you, President Clark. You know, the stigma that's associated with addiction treatment and recovery is really is very real. And by us taking a first step to start normalizing the conversation, I think is very important. And we need to make sure that we're protecting the safety of those who are struggling with addiction, their families, and also residents'",
        "'speaker_6': 'and business owners. And so my ask is, if this does pass tonight, that we have a plan in place to have a robust community engagement, education and dialog with our constituents and with the Denver community. So we make sure that any rulemaking that is undertaken by the Board of Public Health and Environment is informed by the community'",
        "'speaker_6': 'as well. And so that's my main ask, but also thank you to Councilman Brooks for including in the bill, language distribution of fentanyl testing strips as well. The only other piece that is a little concerning to me, but but I think we can get beyond it is that there won't be any report back or evaluation until after'",
        "'speaker_6': 'the 24 months that period. And I would ask that if the state legislature does act and pass into law some version that would allow this that we come back because we probably will then need to have bend amend this bill language that we include something that would update it that would have at least an annual report back'",
        "'speaker_6': 'to City Council Committee just so that we can continue the conversation so that it's not a one and done, but that where are we going and where are those additional treatment options that we're going to need in the city to address this?'",
        "'speaker_6': 'And I know that this is. It's a difficult barrier, honestly, for some community residents to get beyond. But when I look out at all of you and I look at my community, we're talking about sons, daughters, mothers, fathers, grandparents.'",
        "'speaker_6': 'We're we're talking about our Denver community. And so right now, we need to make that our first priority, their safety and reducing the harm that they're doing. And so with that, I will be supportive of this, wanting to make sure that we have a robust community engagement and education going forward.'",
        "'speaker_6': 'Thank you, President Clark.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. Councilman Brooks, you want to.'",
        "'speaker_3': 'Say, you know what, Mr. President, I just wanted to just wrap up. I want to thank everybody for their comments. And clearly, you know, their engagement. I think a lot of the council members have been emailing me, emailing Lisa Revelle, emailing the administer the administration, Kirsten, who's helped us draft this.'",
        "'speaker_3': 'And I just really appreciate that you guys have gotten in there and you've educated yourself on this issue. Let me just bring up one more point that no one really talked about. And we 100% agree with the opioid plan that the mayor proposed.'",
        "'speaker_3': 'It talks about prevention, treatment and harm reduction. This is a clear piece that needs to be a part of it, of harm reduction. There are many people who don't understand the full scope of what we're talking about, so they would just focus on this small portion of a pilot.'",
        "'speaker_3': 'We believe in the entire scope of what we need to do in the city of Denver prevention, treatment and harm reduction. There are tremendous problems in treatment. There are tremendous barriers that we need to remove. But if when we're talking about this, please talk about it in the totality of the vision of what we're trying to accomplish'",
        "'speaker_3': 'in our city. The other thing, and I know Lisa Ravel from Harm Reduction will love that I'm mentioning this, that their organization received a Good Neighbor Award from the chair neighborhood. So I know that Councilman. Councilwoman Ortega. You heard that.'",
        "'speaker_3': 'But, John, neighborhood does not give those things out lightly. And so these folks with Lisa's group have been in the community connecting with neighbors, picking up needles, really a great neighborhood partner. And so I just want to give you that little shout out with that.'",
        "'speaker_3': 'Mr. President, this is the first reading. We're going to come back next week for the second reading. But it sounds like we have a good super majority of our council folks support. And I'll also say I have added all of your suggestions into the bill, added the mayors suggestions into the Bears.'",
        "'speaker_3': 'So we will be receiving his support and signing this bill. And so if there are other conversations that you guys need to have, please let me know this week. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Brooks, thank you for taking the lead on this. Madam Secretary. Raquel.'",
        "'speaker_7': 'Flynn now.'",
        "'speaker_2': 'Black guy.'",
        "'speaker_4': 'CLARKE I'm sorry.'",
        "'speaker_3': 'BROOKS Hell, yeah.'",
        "'speaker_4': 'Aspirin. Espinosa.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Gilmore. I Herndon.'",
        "'speaker_2': 'I Cashman.'",
        "'speaker_4': 'I can h.'",
        "'speaker_5': 'Lopez All right.'",
        "'speaker_6': 'Ortega Hi.'",
        "'speaker_4': 'Assessment. Hi. Mr. President.'",
        "'speaker_0': 'Hi. I'm secretary. Please close voting. Announce the results.'",
        "'speaker_4': 'Of a nice one day.'",
        "'speaker_0': '11 I as one nay council 1292 has passed. Just to clarify, has been ordered published next week will be passage. I do have a big favor to ask. There are a lot of you in here. If you all stand up right now and go for the exit and start talking to each other, we're not going be able'",
        "'speaker_0': 'to get to recess. We have about 2 minutes worth of possibly very boring things to do, but just 2 minutes if possible. If you could just hang tight and then at recess I'll get up and go. If you absolutely have to go, please hold your conversations.'",
        "'speaker_0': 'Even when you're in the hall, we can hear you and we just need to get through a few more things before we can get to recess so that we can get set up for the public hearings and the folks who are here for that today.'"
    ],
    "RiNo Denver General Improvement District 2019 and 2018 Operating Plan and Budget.": [
        "'speaker_0': 'Please refrain from profane or obscene speech structure comments to the Council as a whole and please refrain from individual or personal attacks. Council is not convened as the Board of Directors of the Rhino General Improvement District District. Councilman Cashman, will you please put Resolution 1242 on the floor?'",
        "'speaker_5': 'Thank you. Thank you, Mr. President. I move that resolution 18 dash 1240 to be adopted.'",
        "'speaker_0': 'The motion and a second. It has been moved and seconded. The public hearing for Resolution 1242 is open. May we have the staff report?'",
        "'speaker_8': 'Oh, good evening, board members. I am Michael Kerrigan with the Department of Finance, Capital Planning and Programing Programing Division. I am before you tonight to give a staff report and request approval for the Reno Denver General Improvement District 2019 Annual workPlan and Budget and a 2018 Budget Amendment.'",
        "'speaker_8': 'The district is located in Northwest and is located northwest of downtown, includes residentially and commercially assessed properties around the Brighton Boulevard corridor. Generally, the Ideas Center is centered on Brighton Boulevard, stretching from I-70 in the north to 29th Street on the south and bounded east by the Union Pacific Railroad and west by the Burlington Northern Railroad Line'",
        "'speaker_8': '. The G80 supports infrastructure enhancements and maintenance in the Reno area, including streetscape enhancements to Brighton Boulevard. City approved formation of the Reno Denver by ordinance number 309 Series 2015 and established the City Council as the ex-officio board of Directors for the District.'",
        "'speaker_8': 'The ordinance also created the District Advisory Board comprised of property owners within the district. The ordinance specify that the that the Advisory Board should subject to the approval of the Board of Directors conduct and manage all affairs of the District as authorized agent for the Board of Directors.'",
        "'speaker_8': 'The Reno 2018 Budget Amendment reflects total expenditures and funds fund transfers of 364,631. Budget Amendment is due to savings due to Denver, due to lower debt repayments, lower reserve transfers and lower capital improvements. The District Advisory Board has created the 2019 budget before you tonight.'",
        "'speaker_8': 'The Budget proposes overall expenditures and fund transfers of $1,001,811 and overall revenues of $849,070. Of these revenues, the district will generate approximately 648,700 through the levy of four mills on real property for general operating purposes. And it will generate approximately $175,000 from the imposition of capital charge assessed on a lineal foot basis on properties adjacent to the'",
        "'speaker_8': 'Brighton Boulevard for the repayment of debt and for the repayment of debt used to fund the capital enhancements along Brighton Boulevard. Ali Sharpe with Centro Ink is here is also here tonight and available to answer questions. You may have city staff has reviewed the 2019 budget work plan and recommended work paint and budget and recommends it for'",
        "'speaker_8': 'approval. Thank you.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening, so if we could make room in this front bench for our speakers, that would be fantastic. If you are one of the three people who signed up, please come up to the front bench because I will call your name and then your time will'",
        "'speaker_0': 'start. So that ensures that you get all of your time stepping right up to the microphone. First up, Ali Sharpe.'",
        "'speaker_2': 'Hi, I'm Ali Sharp. I'm here representing the Rhino Denver Guide. And I'm here to answer any questions you may have on the work plan and budget.'",
        "'speaker_0': 'Thank you very much. Next up, Jesse Paris.'",
        "'speaker_9': 'Good evening. Members of Council. Mr. President, my name is Jesse Paris. I'm here representing for Denver Homicide Low Black Star Action Moment for Self-defense and Community Community Action, Commitment for Change. And I am also an at large candidate for 2019 City Council member.'",
        "'speaker_9': 'I am against this proposal today. Rhino is. A cancer to this community, to the city. It should not be in existence. It's not even a neighborhood bias. Natives. We do not even recognize it as such. But this is to go through with the promenade that is planned to be downtown in 2020 or and what they're calling our'",
        "'speaker_9': 'Toronto district. This is in response to that. Yeah, I'm definitely against this. You keep you're going to continue to sweep the people all in this district. This is not affordable by any means. Who is this really going to benefit?'",
        "'speaker_9': 'And yeah, it's just another another tourist attraction, which you have no care or regard for the natives that have been here for 20 plus years, when this was known as the East Side, an abandoned warehouse during the crack epidemic, when there was no safe crack houses.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_10': 'Yes. My name is Chairman Sekou Found organized the Black Star Action Movement for Self-defense candidate for mayor in 2019. Representing poor, working poor homeless people. This. Resolution. It's already going to be approved by all your alter teeth because it satisfies all the conditions that were set up in order for to get this thing approved.'",
        "'speaker_10': 'Now, a lot of people think I'm Jimmy the Greek, but I haven't been down in 15 years operating and watching this process go down. So I know this is already a dog and pony show. The decision has already been made so we can start playing the game.'",
        "'speaker_10': 'That's number one. Number two, there is no transparency on this because what you have been doing consistently over the 8 to 10 years I've been down here is to proven an apartheid system of white supremacy right here in this town.'",
        "'speaker_10': 'Right here in this town. Look in the audience. And what do you see? What do you see? White people with only fires and buttermilk up here consistently for the last 15 years. And yet we've been saying the same thing over and over and over again.'",
        "'speaker_10': 'You still don't listen. You don't listen. And so you want to do what you do. But I'll guarantee I'll guarantee you, as the mayor of the city to Denver, all of this comes to a halt, all of it.'",
        "'speaker_10': 'And then for those who have the courage, you have to worry about it. You know how to hide. You're not to vote for things that you don't approve. You cannot stand on your dime and represent this city the way you did from a position of consciousness.'",
        "'speaker_10': 'If this ain't white supremacy, I don't know what it is. And it's been that way from day one, and you know that. So what do we do with this? What do we do with this? With all the people that are listening and looking at this mess, do the research.'",
        "'speaker_10': 'Do the research, do the research on the Rhino district and what a compromise. It has no diversity whatsoever inside the organization and never has been, never will and has been the model of success for every R.A. in this town that is opposed to the participation of diversity in this town, where it is totally exclusive for white people'",
        "'speaker_10': 'only. So I'm going to close this. Will. Because my family told me not to come down here that night. Yeah. Who's down to pass the too serious about this, miss. You know what? I can't quit. I'm addicted to this to be body got one of them overdose things we need an overdose serum but folks to come down'",
        "'speaker_10': 'here. I'm sorry.'",
        "'speaker_0': 'I'm sorry about your time. Your time is up. Thank you very much. That concludes our speakers. Are there any questions from members of Council? Councilwoman Ortega.'",
        "'speaker_6': 'I just wanted to ask Michael a question, if you wouldn't mind, coming up. Just to add clarification for the listening audience, does the city have any funding that they put aside for this, or is this primarily assessment against all the property owners who are contributing towards the the cost of the maintenance of the district?'",
        "'speaker_6': 'Can you talk about that?'",
        "'speaker_8': 'Yeah, it's so the budget is funded exclusively from the property owner assessments and the additional property taxes on the property owners within the district.'",
        "'speaker_6': 'And what was the total amount of the budget for this year?'",
        "'speaker_8': 'Let's see. Did you do 801 $1,001,811? That's the total expenditures and fund transfers.'",
        "'speaker_6': 'Okay. Thank you. I have no further questions.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Seeing no other questions. The public hearing for Council 1242 is closed. Are there any comments by members of Council? Councilman Brooks. Councilman Flint.'",
        "'speaker_7': 'Thank you, Mr. President. Just a point of order. On the screen, it shows that's item 1242. But I believe on the agenda it says 1241. I just wanted to ask if that discrepancy is something that is meaningful and does it need to be corrected?'",
        "'speaker_0': 'You, as usual, are correct.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': '1241 I see. 1241 on the agenda. Madam Secretary, are we? 1241 or 12 4242?'",
        "'speaker_5': '1242 1242. Okay. All right.'",
        "'speaker_0': 'So we're all good with 1242, so our emotions.'",
        "'speaker_5': 'Are.'",
        "'speaker_0': 'Good to go. Councilman Flynn, you. You satisfied?'",
        "'speaker_7': 'I don't know if I am. I guess I'll find out tomorrow morning if. If the lawyers come back to us and say you didn't pass it.'",
        "'speaker_5': 'Well, we've got lawyers right here, so we're still.'",
        "'speaker_6': 'Trying to talk.'",
        "'speaker_2': 'Well, excuse me. I did not hear the question.'",
        "'speaker_0': 'There's some debate about this showing up as 1241 on some documents, and we have it pulled up as 1242 in our system. Just double checking that we have the rate bill number on the floor for this hearing.'",
        "'speaker_2': 'Okay. I will look at that while you are moving through the agenda.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. It's.'",
        "'speaker_2': 'The agenda that central staff is looking at has it listed as 1242.'",
        "'speaker_5': 'Okay.'",
        "'speaker_7': 'And we have 1241. Interesting.'",
        "'speaker_5': 'Okay. 42. All right.'",
        "'speaker_0': 'Well, well, well. You're taking a deeper dove. Councilman Espinosa, did you have something not related to the number of the bill? Right.'",
        "'speaker_3': 'I do.'",
        "'speaker_5': 'Go ahead.'",
        "'speaker_3': 'Yeah. Just. Maybe I'm not reading the budget summary. So can you walk me through it a little bit on how that number that you just quoted in, I mean, you cited is in response to previous question is represented on here.'",
        "'speaker_5': 'Yeah. Thank you. Comment.'",
        "'speaker_8': 'And I'm not I'm not certain what you were referring to on here.'",
        "'speaker_3': 'You said it was 1.8 1,001,811. Okay, that's different. All right. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Espinosa. Are we all good, Councilman, for this?'",
        "'speaker_7': 'Thank you. I was looking at the bid and not the JID.'",
        "'speaker_0': 'Thank you. All right. So seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_6': 'Black. All right. BROOKS Hi.'",
        "'speaker_4': 'Espinosa.'",
        "'speaker_6': 'Flynn Hi.'",
        "'speaker_4': 'Gilmore, i herndon. I Cashman. I can h.'",
        "'speaker_6': 'Lopez. Ortega. I Susman.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'Hi. I'm Secretary. Please close voting and notes.'",
        "'speaker_4': 'Results 12 US.'"
    ],
    "Approval of 2019 and Amended 2018 Operating Plan and Budget for the Gateway Village General Improvement District.": [
        "'speaker_0': 'Provides Resolution 1242 has passed. Council is now convened as the board of Directors of the Gateway Village General Improvement District. Councilman Cashman, will you please put Resolution 1 to 4 or five on the floor?'",
        "'speaker_5': 'Yes. Thank you, Mr. President. I move that resolution 18 dash one, two, four, five, be adopted.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for resolution one, two, four or five is open. May we have the staff report?'",
        "'speaker_8': 'Good evening, board members. I'm Michael Kerrigan with the Department of Finance, Capital Planning and Programing Division. I am before you tonight to give the staff report and request approval for the Gateway Village General Improvement District 2019 Annual Work Plan and Budget and a 2018 Budget Amendment.'",
        "'speaker_8': 'The district is located in the northeastern section of the city, northwest of I-70 and Chambers intersection. It consists of approximately 243 acres on the eastern border of Montebello. It is completely developed and primarily consists of residential property. Responsibilities include maintaining the landscaping of parks within the district.'",
        "'speaker_8': 'City Council approved the formation of the Gateway Village General Improvement District by ordinance and number 551 through 1994 and establish City Council as the ex-officio board of Directors of the District. The Creation Ordinance also created a district advisory board made up of property owners.'",
        "'speaker_8': 'Within the guide, the ordinance specified that such advisory board should conduct and manage all affairs of the district as the authorized agent for the Board of Directors, including its financial and legal affairs pursuant to Resolution Number 32 Series 1995.'",
        "'speaker_8': 'Denver City Council authorized the District Advisory Board to create a work plan and budget for approval by the Board of Directors annually. The Gateway Village 2018 Budget Amendment reflects total expenditures and fund transfers of $1,000,036.30 $6,913. This change reflects the reduction reflects the reduction in expenditures from the 2019 budget due to delay in the Joey's planned landscape'",
        "'speaker_8': 'improvement project. The funds allocated for the landscape project in 2018 rolled into the 2019 budget. The Gateway Village 2019 budget proposes overall expenditures of $1,491,803, with total revenues of $619,914. The district will also transfer $500,000 into its Capital Project Fund.'",
        "'speaker_8': 'The district will assess 20 mils of property on real property within the district. During 2019, the district plans to undertake a major landscape and major landscaping fence improvement project. Landscape improvements are anticipated to include tree lines, entry monuments and improvements to the retention ponds and drainage channels.'",
        "'speaker_8': 'The district expects to spend approximately 1.37 million on these improvements. City staff has reviewed the 2019 Budget Work and Work Plan and recommends it for approval. Jeffrey Erb of Center and Vandewalle, legal counsel for the District, is also here and available to answer questions you may have.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening. Again, I would ask that you come to the front row as your time will start when I call your name. First up, Jeffrey.'",
        "'speaker_7': 'Good evening, Jeffrey Erb.'",
        "'speaker_5': 'I'm general counsel for the GID, and I'm here to answer any questions.'",
        "'speaker_0': 'Thank you very much. Next up, Jesse Pierce.'",
        "'speaker_9': 'Good evening again, members of council. My name is Jesse Pierce. I'm representing for Denver Homicide, a loud black star action moment for self-defense and community commitment for change. Community action and commitment for change. I am against this. But again, like Sekou already said, we are just going to go through with this anyway.'",
        "'speaker_9': 'I don't even know we have a public comment. Gateway Village. This is close to the airport so I'm just is going to make make way for all the new transplants that we're expecting to come to this city more unaffordable house.'",
        "'speaker_9': 'And this is going to be very expensive for you to live in this neighborhood. Gateway Village. So, yeah, it's just business as usual. Well, like I said, I'm running for office. City Council at large 2019 sweep. Council. Like they sweep in the homeless.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_10': 'Chairman SIEGEL. Next. It's a movement for self-defense. Positive Action. Commitment for social change. May 2019, city and county of Denver represent the interests of poor working poor. The oppressed. They exploit it. The abused. The disrespected. Just so we're perfectly clear.'",
        "'speaker_10': 'These general improvement districts. Inherently. Were intended to improve the neighborhood where. Folks came together, pulled the resources together to do projects that were of mutual interest and benefit. For those who lived in that area. When the decision was made consciously.'",
        "'speaker_10': 'But the business community. The political community. And folks who were pretty much lap dog lackeys of capitalism decided to come in and seize these neighborhood for the economic interests of the few at the expense of the many, and then surreptitiously bang your tax receipt where you didn't even know you was getting charged.'",
        "'speaker_10': 'But you moved into neighbor and you bought a house or you started renting. But part of your rent was to pay this tax, this mill levy that came from the people who are paying the rent that was too high.'",
        "'speaker_10': 'So here goes the pimping. Legalized pimping by political.'",
        "'speaker_5': 'Pimps and streetwalkers.'",
        "'speaker_10': 'Who have no shame whatsoever. But it's all game because you're hoping they never find out what you're doing down here. But there's a problem. Somebody showed up and somebody told it to. And in the process, a whole lot of folks didn't really like this guy.'",
        "'speaker_10': 'But the one thing they can never say is that, chairman, say, who ever came down here for 15 years and lied to the people about the liars and conned and manipulation and the slide, the slick and the wickedness that's happening in this body.'",
        "'speaker_0': '13. Are your time is up. That concludes our speakers. Are there any questions from members of council? Seeing no questions. The public hearing for Resolution 1245 is closed. Are there any comments from members of council? Council, I'm going to do anything on this one.'",
        "'speaker_0': 'No. All right. Sing. No comments. Madam Secretary. Oracle.'",
        "'speaker_2': 'Black eye.'",
        "'speaker_4': 'Brooks Espinosa, my friend.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Gillmor.'",
        "'speaker_5': 'I Herndon High.'",
        "'speaker_4': 'Cashman. I can h.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Lopez I knew sorry.'",
        "'speaker_6': 'Ortega, i.'",
        "'speaker_2': 'Susman, i.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting in notes results.'",
        "'speaker_4': 'Twice.'"
    ],
    "2019 Operating Plan and Budget for the 14th Street General Improvement District.": [
        "'speaker_0': '12 eyes Resolution 1 to 4 or five has passed. Council is now convening as the board of directors of Denver's 14th Street General Improvement District. Councilman Cashman, will you please put a resolution one, two, four, six on the floor?'",
        "'speaker_5': 'Yes, Mr. President. I move the resolution 18 dash 1246.'",
        "'speaker_7': 'Be.'",
        "'speaker_5': 'Adopted.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Resolution 1246 is open. May we have the staff report?'",
        "'speaker_8': 'Meeting Board Members Michael Carrigan again from the Department of Finance, Capital Planning and Programing Division. I'm here to provide the staff report for the 14th and request approval for the 14th Street General Improvement District for the for the 14th Street General Approving District's 2019 budget and work plan.'",
        "'speaker_8': 'The district is 22.66 acres located along 14th Street from market to Colfax, and generally includes all parcels along both sides of 14th Street. It was created by council and approved by electors in response to the 14th Street initiative to create Denver's downtown ambassadors.'",
        "'speaker_8': 'The initiative began in 2005 and visualize 14th Street as a promenade and a major gateway to the downtown area. The plan contemplated streetscape improvements, streetscape enhancements and related public infrastructure improvements. Stakeholders, including private property owners, public officials and business organizations, participated to establish the conceptual design for the 14th Street.'",
        "'speaker_8': 'In 2009, City Council approved the formation of the 14th Street Guide and the creation of the District Advisory Board. The district was established to acquire finance, operate and maintain street improvements. The district's creation ordinance calls for the ADA to at least annually pass a work plan and budget.'",
        "'speaker_8': 'The District Advisory Board, after a notice and hearing, recommends to the Board of directors the proposed work plan and budget, including maintenance charges and capital charges. Before you tonight in 2019, the district plans to continue maintaining district amenities, including, but not limited to tree planter and flower beds, pots to flower pots, landscape maintenance, signage, repairs, trash removal'",
        "'speaker_8': 'and sidewalk lighting maintenance. The work plan, budget and charges include total revenues of $575,953, which is comprised of $264,145 in maintenance charges and banner rental revenue, plus $311,808 in capital charges for the repayment of debt used to fund the capital enhancements along 14th Street.'",
        "'speaker_8': 'Beth Moisi is here representing the district this evening and can answer questions you may have regarding the budget and work plan. Thank you.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening. If you could make your way to the front, your time will start when I call your name. First up, Beth Whiskey.'",
        "'speaker_2': 'Good evening. Council president and members of the city council. I'm Beth Gorski and I'm the executive director for the 14th Street General Permit District, and I'm here to answer any questions.'",
        "'speaker_0': 'Thank you very much. Next up, Jesse Pierce.'",
        "'speaker_9': 'Good evening. Members of Council Council President Clark. My name is Jesse Paris. Represented for Black Star Action Movies for Self-defense. Denver Homicide, Loud and Community Action Commitment for Change. And I am also an at large candidate for 2019 Denver County.'",
        "'speaker_9': 'Once again, this is business as usual. You want to improve the streets all while sweeping people off of these streets that are undesirable and do not fit into your plan. Picture for the city to beautify the city and think out of sight, out of mind when it comes to those that are suffering the most in the city'",
        "'speaker_9': '. Again, I am against this, but already know you're going to approve it. There's a lot of big money involved with this. These improvement districts have historically destroyed communities, lower neighborhoods, allowing for people to be policed that do not fit the desire to make or view of patients, patrons that need to reside in a space, a public space'",
        "'speaker_9': '. But you need to have big money to reside in this space. 14th Street, this is where the Four Seasons Hotel is, where the Landmark Cafe is right next to the very a campus. This is just a whole another tourist ploy to beautify the city and make it seem like there is no crisis.'",
        "'speaker_9': 'This homeless people that will not be able to sit or lie on any of the streets without being ticketed, harassed or arrested. So I hope you take all that in consideration. Already know you're going to approve this. But once again, like I said, I'm against it.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_10': 'Okay. I'm so cool, I'm sure, but nobody knows me. So we won't postpone or delay the same president. I was sitting here thinking, you know what? When I was growing up, there was a show on TV. I've used this analogy before.'",
        "'speaker_10': 'Down here years ago. Well, there was a television show series called The Little Rascals. And what it was about was kids emulating and acting like they were adults. So you had a judge, you had.'",
        "'speaker_0': 'Chairman say, I just want to make sure that you're you're getting to a point on this particular action item and you're not questioning the motives of some of the council members for our decorum rules.'",
        "'speaker_10': 'That you don't endorse because it's almost over. Cause I'm working on my senator here because I think I'm taking this a little bit too serious, which. And serious business. But it. It's not worth me dying over, I'm told.'",
        "'speaker_10': 'For real. So I'm preserving my health here and say. Thank you very much for everything that you guys do down here. And it gives me an opportunity right now to remind myself of why I've come here. And that is to.'",
        "'speaker_10': 'Eliminate suffering of the mass of the people by giving voice to that which is not given. So tonight I'm winning. I got to. Twelves votes for y'all. Vote it. And I want to be I think I'm Jimmy the Greek.'",
        "'speaker_10': 'And then I also go to Vegas on this. But once you understand the process. And you understand how they do what they do. This is real simple to solve this. You just stop doing what you're doing now and it'll be different.'",
        "'speaker_10': 'And that's all we really need. We just need a different way of doing things that will work for the masses of the people, not just for the rich, not just for the middle class, not just for the poor.'",
        "'speaker_10': 'Because it takes teamwork to make the city work. If we always just focus in on those that it works for and push on the bridge, those that are don't sweep the dirt under the rug. Like The Little Rascals.'",
        "'speaker_10': 'More shall be revealed. See you next week. Thank you very much.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council on this item? Councilman Espinosa.'",
        "'speaker_3': 'Michael, just one quick clarification. Can guide dollars be used for security?'",
        "'speaker_8': 'But it can be used for security. So Jdw can be used for items that are that are called out for in in their work plan and budget as approved by council.'",
        "'speaker_3': 'Does this guide include any dollars in any $2 in their workplan for security?'",
        "'speaker_8': 'Was the last part of the question.'",
        "'speaker_3': 'Does this budget include any dollars that are in their workplan for security?'",
        "'speaker_8': 'This one does not. No.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'Councilman Espinosa seeing no other questions. The public hearing for Council Bill 1246 is closed. Are there any comments by members of council? Jasmine Espinosa.'",
        "'speaker_3': 'Yes. I'm hoping this will help you relax. Chairman. I think it's because I feel like if anybody was watching it, I sort of want to address gids, you know, because there is this idea. I mean, so one of the functions we do as a government is we take in revenue from the masses and we apply them to'",
        "'speaker_3': 'our public safety, public infrastructure, a whole host of things. Mental health services, you know, wraparound services for homeless, a whole plethora of things that you see us conduct business on a daily basis. I mean, on a weekly basis here.'",
        "'speaker_3': 'General whom districts do that. Do you know? They're very limited. Geo guides are allowed to construct, install and inquire any public improvement except solid waste disposal improvements and services. So they do essentially the same thing we do as a government, but in a sort of hyper local setting.'",
        "'speaker_3': 'And in, in like in the case of the previous one, in the gateway one, that's a, you know, a brownfield, I mean, a greenfield development. They didn't have any of those facilities. And if we wanted to put them in the city, we would be taxing everybody, the masses, to then put infrastructure in in a very local situation'",
        "'speaker_3': '. And so we we've created these you know, we have this mechanism whereby people can assess themselves additional dollars to bring that infrastructure in. And yes, it has ramifications, but city building has ramifications and this has gone on. Since we've been assembling cities.'",
        "'speaker_3': 'I mean, is Googling the Trevi Fountain going, who built that? You know, and it's a series of popes, right? People with the means build these things that have a public function. And I don't think anyone wants to tear out the Trevi Fountain.'",
        "'speaker_3': 'In fact, maybe we should build one because it brings in $1,000,000 in coins every year, and maybe we should have one of those instead. So I just want the general public to understand that this is not this is not this.'",
        "'speaker_3': 'This these tools do serve a particular area, but it is by burdening that particular area with an additional assessment and relieving the rest of us from having to pay for that infrastructure, thereby extending the dollars that we do put into the general revenue fund, I mean, general fund for the whole host of other things.'",
        "'speaker_3': 'And so I just wanted to sort of get that base understanding out there because it's a good thing, despite what you may think, the motives are behind these things. It's the same function that the government has in providing all infrastructure and providing all, you know, all of the sort of public realm investments, except for it's now being'",
        "'speaker_3': 'concentrated and paid for by the people that are directly accessing those facilities. And maybe I'm wrong and I'm happy to entertain questions and comments afterwards, you know, because maybe you have a different understanding. But that is mine. And that's why you continually see me supporting these things, because it is the appropriate tool in appropriate circumstances time and'",
        "'speaker_3': 'time again. Thanks.'",
        "'speaker_0': 'Thank you. Councilman Espinosa, seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_2': 'Black eye.'",
        "'speaker_4': 'Brooks Espinosa.'",
        "'speaker_5': 'Hi.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Gillmor, i.'",
        "'speaker_5': 'Herndon, i.'",
        "'speaker_4': 'Cashman. I can each i. Lopez. Ortega.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Sussman. All right, Mr. President.'"
    ],
    "Rezoning of 1901 Wazee Street in Union Station.": [
        "'speaker_0': 'Hi, Madam Secretary. Please. Because the voting announced the results 12 hours, 12 hours. Resolution one, two, four, six has passed. Council is now reconvene. Council will resume its regular session. Councilman Cashman, will you please put Council Bill 1006 on the floor?'",
        "'speaker_5': 'I'm working overtime here, Mr. President. I move the council bill 18, dash 1006 be placed upon final consideration and do pass.'",
        "'speaker_0': 'We appreciate your hard work. It has been moved and seconded. The public hearing for Council Bill 1006 is open. May we have the staff report?'",
        "'speaker_2': 'Good evening, council president and members of council. I'm Liz Weigel with Community Planning and Development and I will provide the staff report. This is an official map amendment for 1901 wasI Swasey Street from IMX 802 to Pdg 19.'",
        "'speaker_2': 'It is located in Council District nine in the Union Station neighborhood. The the subject site is bounded by 19th Street wasI Street and 20th Street. It's currently occupied by a surface parking lot and a walkway that we will be referring to as Wynkoop Promenade.'",
        "'speaker_2': 'The rezoning from I am x eight, which is an industrial mixed use district with a billboard use overlay to plan unit development 19 would facilitate development of the site with mixed uses. As I mentioned, it's currently zoned I am x eight to surrounding properties include the downtown lower downtown district.'",
        "'speaker_2': 'Light industrial zoning over Coors Field and adjacent pods. As I mentioned, the subject site currently has surface parking on it. Surrounding properties include the baseball stadium office, commercial mixed use and multi-unit residential uses. This is an image of the site looking southwest towards downtown.'",
        "'speaker_2': 'The site is outlined in yellow and these images show the site itself in the center at the top and the mix of buildings and building forms around the site. The purpose of a planned unit development or APD, is to provide an alternative set of regulations to a standard zoning district and unique and extraordinary circumstances.'",
        "'speaker_2': 'It allows for more flexible zoning than what would be achievable in a standard zoned district without putting in place multiple variances, waivers and conditions. In this case, the Pdg 19 is proposed to address several unique circumstances, including the site's location.'",
        "'speaker_2': 'In the downtown context, its adjacency is to lower downtown and to the baseball stadium. The site configuration, including the lack of a street connection along Wynkoop Street, the lack of an alley, and the grade change along 20th Street.'",
        "'speaker_2': 'Given the site's unique conditions, the PD uses the downtown Arapahoe Square 12 plus district as a base district with tailoring and incorporation of Cemex 12, which is our urban center context regulations as appropriate. Key elements include tailoring of the primary building form standards, alternatives and exceptions, including a height transition from 19th to 20th streets.'",
        "'speaker_2': 'The provision of wynkoop promenade as a pedestrian access through the site. The establishment of primary and side streets on lot lines, including the treatment of Wynkoop Promenade as a primary street. The provision of 20% private open space. Administrative design standards and guidelines, which are largely based on downtown Arapahoe Square and maximum vehicle parking.'",
        "'speaker_2': 'The public process is listed here on the site on the slide. The planning board heard this application on September 5th and recommended approval. We also have letters of support from the Downtown Neighborhood Association, the Downtown Denver Partnership and the one Wynkoop Plaza Condominium Homeowners Association, which is included in your in the staff report and also in speaking'",
        "'speaker_2': 'in support at the planning board. The Rocky Mountain Warehouse Lofts Homeowner's Association also submitted a copy of a memorandum of understanding that they have come to with the developer. In addition, the applicant also hosted a number of community meetings both before and during the application process, which is outlined in the application for the in terms of the'",
        "'speaker_2': 'rezoning criteria and the Denver zoning code, there are standard review criteria for all non legislator on legislative rezonings and additional criteria that I will walk through for a Pudi district. So first, the standard rezoning criteria of which we have five.'",
        "'speaker_2': 'The first is consistency with adopted plans, of which we have four in this area. First, staff finds that the application is consistent with a number of comprehensive plan 2000 strategies, and most of which deal with promoting infill development, mixed use and transit oriented development in Blueprint, Denver 22 The land use concept here is downtown and an area'",
        "'speaker_2': 'of change downtown is described as the centerpiece of the city where we want to direct growth and mix of uses. Also, we're looking for high quality urban design and to have special design standards in place. Blueprint Denver also speaks to the use of a planned unit to.'",
        "'speaker_2': 'It's generally discouraging them because they complicate administration over time and they are not very flexible over time. But it does say that they should only be used in extraordinary circumstances and in this case. Would you feel that this Pudi meets the requirement of these being extraordinary circumstances of the downtown area plan from 2007 includes this site in'",
        "'speaker_2': 'the lower downtown district. Most of the guidance in the plan for this area speaks to the historic district itself, but it does call out this site as an opportunity, say it recommends a priority, pedestrian connection through it, and encourages neighborhood serving retail.'",
        "'speaker_2': 'There are also a number of general recommendations in the downtown area plan of which this application is consistent, including prioritizing pedestrian, strengthening connections, encouraging active ground forces, expanding housing opportunities, improving our design guidelines and zoning to realize the desired character of downtown, and enhancing the public realm to provide venues for outdoor activity.'",
        "'speaker_2': 'The Central Platte Valley Comprehensive Plan Amendment from 1991 also applies to this site, and this plan gave guidance around the redevelopment of the valley itself. This area is called our is general mixed use and specifically called out as an area where light industrial usage should not be allowed.'",
        "'speaker_2': 'It's also identifies it as part of what's called the mid-rise heights in the plan. There are not specific heights called out in this plan, but it points you to an appendix that talks about a height of about 140 feet that was discussed during steering committee meetings.'",
        "'speaker_2': 'This plan also calls out a priority pedestrian access point along the wine coop alignment, which is consistent with the proposed pedestrian access in the PD. And then lastly, this area is within what's called the upland area of this plan amendment, which said that new buildings should respect the scale and character of the downtown and provide or improve'",
        "'speaker_2': 'pedestrian and bicycle access and provide open space. So staff does find that the proposed idea is consistent with adopted plans will also result in uniform application of zone, district, building, form, use and design regulations. It will further public health, safety and welfare through implementing our adaptive plans and also encouraging a pedestrian friendly environment.'",
        "'speaker_2': 'Open space amenities in an appropriate use list of the application identifies and staff agrees that there has been significant development in around Union Station neighborhood that are justifying circumstances for the rezoning. And also the PD is consistent with the downtown neighborhood context as it uses the downtown Arapahoe Square 12 plus as a base with tailoring to ensure'",
        "'speaker_2': 'neighborhood compatibility. So now I will walk through the specific rezoning criteria of which there are five. The first is that the Pudi is consistent with the intent and purposes of Pdes, which are stated in Article nine of the zoning code.'",
        "'speaker_2': 'I'll walk through these. As I mentioned, unique and extraordinary circumstances is one of those criteria. We do feel that that given that the plan guidance for this area recommends the downtown context, but we do not have an appropriate downtown zone district at this pudi is appropriate.'",
        "'speaker_2': 'Our closest fit would be Cmax, which is the Urban Center District, but this would not address the lack of a public right of way or as an extension of Lincoln Promenade. It would not address the downtown location and regulations that we have in place for other downtown districts.'",
        "'speaker_2': 'And it also does not address the immediate context of the lower downtown historic district. So the Pudi uses our most recent downtown district, which is D as 12 plus as a as a base, together with urban center regulations as appropriate to address the site's unique features.'",
        "'speaker_2': 'The next criteria is that it should not be as few do. You should not is not intended to so solely as a veto vehicle to develop a site inconsistent with the applicable neighborhood context or to enhance economic feasibility and staff finds that, as I mentioned, the Pudi G 19 is consistent with the downtown neighbor could context and'",
        "'speaker_2': 'character and it is actually intended as a mechanism to ensure that development is consistent with our adopted plans. The beauty criteria also speaks speaks to the fact that in exchange for flexibility, there should be significant public benefit, which we do find that the beauty does provide, that first being the provision of one who.'",
        "'speaker_2': 'Promina and again, that would be a pedestrian public access way through the site. Along that the alignment of Wynkoop Street, the transition from 19th to 20th Street that addresses that LoDo adjacency, pedestrian friendly design and building forms. A provision of 20% of the site is private, open space and maximum vehicle parking requirements.'",
        "'speaker_2': 'We also find that the PD complies with all standards and criteria stated in Division 9.6 and that the beauty is necessary because there is no standard zone district available that applies downtown appropriate standards to this unique location and addresses the site's unique configuration with regard to Wynkoop, Promenade and 20th Street and not lastly to Moore.'",
        "'speaker_2': 'The PD establishes permitted uses that are compatible with existing land uses adjacent to the subject property. There are no use related changes proposed, so we'll use the D as 12 plus zone district use list. And then lastly, the PD establishes permitting building forms that are compatible with adjacent existing building forms.'",
        "'speaker_2': 'And again, we, the PD, will be using the DS 12 plus general with height, incentive building form and the CRM X12 General Building form with tailoring to vary heights from 19 to 20 20th Street and apply standards to the Wynkoop promenade to treat it as basically as a primary street in terms of its build to its transparency'",
        "'speaker_2': 'and its active uses. And the PD incorporates administrative design standards and guidelines that will ensure that it's tailored and addresses the LODO adjacency. So with that finding that all review criteria have been met, CPD recommends approval of the Map Amendment application.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you so much. We have eight individuals signed up to speak this evening, so if you wouldn't mind coming up to this front bench so we can get through everyone quickly and efficiently. As soon as I call your name, step up to the podium as your time will start to elapse.'",
        "'speaker_0': 'First up, we have Hal Roth.'",
        "'speaker_5': 'Good evening, Mr. President, members of the council. My name is Hal Roth and the chief financial officer of the Colorado Rockies Baseball Club 2001 Blake Street, Denver. I'd tonight I'd like to explain to you why we are undertaking this project.'",
        "'speaker_5': 'When we were negotiating with the Denver Metropolitan Major League Baseball Stadium District here and after Stadium District on a new lease for Coors Field, the biggest issue was the capital needs of the stadium going forward. We had two separate engineering studies done, both of which came back that we would need $200 million over the next 30 years'",
        "'speaker_5': 'to keep the stadium in the shape that it is now. This is such things as replacement of steel, concrete seats, a lot of infrastructure, equipment, similar things that you deal with on city business buildings. The issue is that the tax that established Coors Field had expired.'",
        "'speaker_5': 'So there's still public money left. So one of the ideas of the stadium district was to go out with a request for proposal to developers, got back five proposals from the developers. They offered a 99 year lease from the stadium district and the problem with their proposals were in the first year they'd pay, as I recall, about'",
        "'speaker_5': 'two and a half million dollars. In year 99, it was 18.6 million. And we said, Well, gee, that's all good and great, except we need it in the first 30 years. So we came back with the proposals, the Rockies.'",
        "'speaker_5': 'What happens if we pay an amount over the first 30 years that exceeds the present value of what the developers offered? So we have agreed to pay 125 million for this ground lease, which we will then sublease to develop an entity.'",
        "'speaker_5': 'Many of the members of the development entity will be similar to the owners of the Rockies. So that's how we were going to proceed to provide the capital funding for the stadium. And I would like to thank the city, the city planning department, and particularly to Liz Weigel for all our hard work on the pad.'",
        "'speaker_5': 'I'd like to thank our neighbors and the neighborhood groups that have worked with us in planning this project. And finally, I'd like to thank City Council for your consideration tonight.'",
        "'speaker_0': 'Thank you. Next up, John and Shuki.'",
        "'speaker_5': 'Good evening. My name is Johnny on a shoe ski. I'm with Stantec Architecture, the architects for the project and we are at 1050 17th Street, Denver. When we started working with the Rockies in the neighborhood group we always start our project was trying to define a vision.'",
        "'speaker_5': 'Where does everybody want to be when we're done? And this was fairly unique vision that the Rockies had because they wanted to know what the neighbors thought and what the neighbors believe was the next best thing for Denver.'",
        "'speaker_5': 'And we kind of identified four big areas. Denver's next great, next, great place is where the biggest bang for our buck was no different than Union Station in Larimer Square that we wanted this area to be relevant year round.'",
        "'speaker_5': 'Right now it's relevant 81 days of the year. And every time you go down there, especially now, there's nothing going on. So we wanted it for family friendly and safe, and we want it to be a neighborhood gathering spot.'",
        "'speaker_5': 'So with all those criteria, we looked at the current zoning, which is IMX eight, 750,000 square feet. You could build within that envelope, but that envelope didn't accommodate the forms that we were looking for to really take action on those relevant goals.'",
        "'speaker_5': 'So we went the pod pulled out with the city and we kind of set up certain goals within the city that work not only with our design but within the city envelope of what we can create with the PD.'",
        "'speaker_5': 'One of those goals was to created something that fit into the downtown context but related to lower downtown. And how did we do that and how do you step up from lower downtown to the stadium side? And we did that within the PD with limiting at a setback that happens at eight storeys, which is typical for lower'",
        "'speaker_5': 'downtown, limiting everything along 19th street to 11 storeys and then working our way up to 20th Street where we can do 13 stories for the hotel and a residential. The project is currently said the way it works now with the neighborhood at about 660,000 square feet, so 90,000 square feet below the use by Wright that we had'",
        "'speaker_5': 'originally. So all we're doing here is looking for a massing change to accommodate all the goals that we're trying to get. The other goal we wanted to do is activation along line coupe. Right now, there's no activation on wine coop.'",
        "'speaker_5': 'It's a dead zone in the city. Anything that goes in there usually fails. And so the idea is to activate that no different than a public street. And we've accomplished that within this new duty. We also wanted to create a content plaza no different than Rockefeller Center in the center of this plaza.'",
        "'speaker_5': 'In order to do that, we looked at open space requirements within the zoning and none existed. This will have open space of over 20% and over 50,000 square feet. When you combine the two plazas, which will be a certain placemaking effort within the city, that it doesn't really exist within that neighborhood.'",
        "'speaker_5': 'And last but not least, relating back to the ball park and the LoDo context with site specific design guidelines, heavy articulation and masonry. Thank you very.'",
        "'speaker_0': 'Much. Thank you. Next up, Sean Reilly.'",
        "'speaker_5': 'Good evening, Mr. President. Members City Council. My name's Shaun Maley, CRL Associates 1660 Lincoln, Denver. We've been working with the Rockies and the architect on the West Lot PD and wanted to just briefly go over a few items from our public outreach process and work with the community.'",
        "'speaker_5': 'So starting in August of 2017, we started working with the neighborhood and community and having meetings with the RINO's and Archways was in the area. We held a span of neighborhood meetings, six in total where we talked about the project, its relationship to the ballpark, as Hal explained, and some of our initial goals and visions for the'",
        "'speaker_5': 'sites, we also presented a number of different public venues, including boards, ah, snowboards, Urban Design Committees, Public Realm Committees and quite a few others. We're honored to have support from the surrounding community here tonight, including the Lower Downtown Neighborhood Association, Downtown Denver Partnership, One Wine Coop Lofts and the Rocky Mountain Warehouse Lofts.'",
        "'speaker_5': 'Some members of the community are here tonight, and I want to thank them for taking time out of their personal schedules to attend this hearing. The process has been iterative and fortunately occurred at a time when we could make significant changes and include certain items within the party.'",
        "'speaker_5': 'That's before you. I want to thank all the neighbors for their time they've spent with us and meeting. And their openness to this site's redevelopment in a positive and transformative matter is critical to us being here tonight. Lastly, I also want to thank community planning development staff, in particular Liz Weigel, who spent a lot of time and'",
        "'speaker_5': 'helped us with guidance on the PD lessons, is an exceptional planner and want to thank her and all her colleagues at CPD. Thank you so much. And we're here to answer any questions.'",
        "'speaker_0': 'Thank you. Next up, Jerry, aka.'",
        "'speaker_5': 'And good evening. My name is Gerry aka. I live at 1863 Swazi Street and I'm the president of the Rocky Mountain Warehouse Lofts Homeowner's Association. Our building is directly across the street from this project on the 19th Street frontage, and I am here in support of the project and the proposed rezoning.'",
        "'speaker_5': 'We have had numerous meetings with representatives of the Colorado Rockies for more than a year now. They have consistently sought our input and have responded favorably to the majority of our issues. We have signed with the Rockies a memorandum of understanding which declares that there will be no outdoor speakers on any part of the building or on'",
        "'speaker_5': 'any of the businesses in the project that front on either 19th Street or Swasey Street. This document, along with the continued good faith efforts of the Rockies to work collaborative with the Neighborhood Lead us to conclude that this project will be of high quality, will be an asset to the neighborhood, and will be well received by those'",
        "'speaker_5': 'living around it. Therefore, as I said earlier, the Rocky Mountain Warehouse Lofts Homeowner's Association is pleased to support this project and the proposed rezoning. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Andy Davis.'",
        "'speaker_3': 'Hi there. My name is Andy Davis. I live at 1801 chestnut place here in Denver. I'm the president of the Lower Downtown Neighborhood Association. Or LaDonna, as many of you know, I'm here on behalf of our organization to lend our strong support both to the rezoning as well as the project as a whole.'",
        "'speaker_3': 'And a big reason for our.'",
        "'speaker_5': 'Enthusiastic support is, is.'",
        "'speaker_3': 'Because of the process that we've been engaged in. As Sean mentioned, starting back in September of 2017, the Rockies reached out to La Dona, to the surrounding archways and other LoDo stakeholders for more than a year to engage us in an ongoing discussion about their plans.'",
        "'speaker_3': 'They weren't required to seek our feedback, but they did. They actively engaged all of our organizations, regularly start our feedback and integrated it in meaningful ways. So just to kind of elucidate that a little bit, we would get together.'",
        "'speaker_3': 'They kind of laid out their original plans. We provided some feedback. We get together maybe a month or two later. They demonstrate how they integrated, integrated that feedback from Here's what we heard, here's how we integrated it and then saw our reactions reacted to that next version.'",
        "'speaker_3': 'And then two months later we met again. That went on for several months. As Sean mentioned, we met over six times that that collaborative process produced some really important outcomes at the publicly accessible plaza. The cut through that goes from 19th and Wynkoop to 20th.'",
        "'speaker_3': 'And while C, which better connects the pedestrian traffic from Wynkoop to the stadium and now better addresses the service and delivery truck traffic in and out of the building, which was a concern of our our neighbors, takes into account the 50 to 80 loop and integrates it into its plans and again maintains the context and materiality of'",
        "'speaker_3': 'LoDo and the surrounding area. As Jerry mentioned, it's important to us too, because we were a cosigner to the memorandum of understanding which addresses the neighborhood noise concerns and requires that any commercial tenants or businesses applying for liquor license that they abide by the same.'",
        "'speaker_3': 'The Rockies could have pursued a very different project if they wanted to, but it was important to them to seek the feedback of local stakeholders and create a project that all of us could support. They made good on that that commitment with a thoughtful and deliberative process, and the project is better because of it.'",
        "'speaker_3': 'Not all projects work this way, and not all organizations engage our community in a way that the Rockies did. And frankly, what they did was is a model for community engagement, and they deserve to be commended for it.'",
        "'speaker_3': 'That active communication hasn't stopped the Rockies committed to maintain consistent communication throughout the construction process, and we've already met once since the construction started and they've put us in direct contact with Hensel Phelps, the general contractor. And we're actually they're providing us monthly updates that we're including in our lower downtown neighborhood newsletters.'",
        "'speaker_3': 'So given all of that, we lind our enthusiastic support to the project, to the rezoning and the project as a whole. Thanks so much.'",
        "'speaker_0': 'Thank you. Next up, Rick Newman.'",
        "'speaker_7': 'Good evening. My name is Rick Penniman. I live at 1735 19th Street. I am here representing the One Wynkoop Plaza Homeowner's Association. I'm the president of that association and wanted to speak on behalf of the individuals who reside in our building and will be directly affected by this project.'",
        "'speaker_7': 'If you're not aware, our front door is directly next to Hollow at the moon, which is an auspicious occasion on its own periodically. But as we step out this front door, we are looking forward to seeing the project that is being proposed this evening.'",
        "'speaker_7': 'We are here. I am here along with the others representing our building and showing our support for the project and specifically for the process. It's been incredibly collaborative, as has already been stated. I think that the organizations involved have gone above and beyond what is normally required to engage in a project like this.'",
        "'speaker_7': 'The changes we recommended were taken to heart and considered, and if they weren't able to be put into process as part of the project, there was a great explanation as to why this is going to have a tremendously positive effect on our lower downtown community.'",
        "'speaker_7': 'In listening to the the dreams that the Rockies have for this site, they want it to be the first place that people come when they step off the train from the plains and come to our cities. They want to come to this project and be part of the lower downtown facilities on a year round basis.'",
        "'speaker_7': 'It's going to maintain, if not improve, the esthetics of lower downtown. They've gone out of their way to make sure that it looks like many of the other buildings in the area. And it's going to be drawing more families to lower downtown.'",
        "'speaker_7': 'This is going to be a family friendly environment. One of the things that we noticed as after we moved to lower downtown is there's just not as many strollers as there are other neighborhoods. And I think this project will change that.'",
        "'speaker_7': 'The Rockies in this project.'",
        "'speaker_5': 'Wanted to enhance the value of the stadium and.'",
        "'speaker_7': 'Which has been the cornerstone. And we.'",
        "'speaker_5': 'Believe.'",
        "'speaker_7': 'That this project.'",
        "'speaker_5': 'Will not only enhance.'",
        "'speaker_7': 'But actually propel the lower downtown area to be the number one draw in Denver. And so with that, we give our support to this project and look forward to seeing it develop. Although the dust might get to us for the next three years or so, but otherwise it's going to be a great event in our city.'",
        "'speaker_7': 'Thank you for your time. Thank you for your service.'",
        "'speaker_0': 'Thank you. Next up, Chairman A.'",
        "'speaker_5': 'Slapstick.'",
        "'speaker_10': 'I was Chairman Sekou the extraction movement for self-defense. Mayor. Candidate. City County of Denver, 2019. First of all, we want to congratulate the Rockies organization for bringing vibrancy and. Economic viability and also jobs. Two poor people in this town.'",
        "'speaker_10': 'So we support this because they're one of the few organizations that actually do outreach to help poor people in terms of being a part of the concessions in the town. Also, we're getting vendor space also helps high school teams to raise money for their teams in our neighborhood so that they can buy uniforms and shoes and stuff'",
        "'speaker_10': 'like that. And so they've been a good neighbor. They've been a very good neighbor. And. I am. I hated that I got gentrified out my neighbor. I live on 25th and Chavis Street and. I'd leave my neighborhood because the rent was too high, went from $600 to 1800 dollars overnight, and my Section eight wouldn't cover.'",
        "'speaker_10': 'And they told me that I wasn't wanted. And it was a 12 step program brought in by a Christian organization about building who said it wasn't going to do that, but they did it anyway. So it's okay. So I was born and raised here five points, six, seven years.'",
        "'speaker_10': 'We'll celebrate my birthday on Friday and I would be remiss to say that I forgot. I want to apologize for my tone and manner. My family want me to come down here because I just buried my wife on Saturday.'",
        "'speaker_10': 'And they think it was a good idea for me to come down here. And I told him that the only thing that helps me deal with my grieving is I get to get back to work. You know, because she's good to go.'",
        "'speaker_10': 'You know, I'm the one is in trouble. So thank you for putting this on the agenda at this time because I really need a break from the nine. I really did. And this one is really a no brainer.'",
        "'speaker_10': 'We're all in for it. And I love the city. I love the Rockies. And. Good luck.'",
        "'speaker_0': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_9': 'Jesse Paris. Black Star Action Moment for Self-defense. Denver Homicide Law and Community Action Committee for Change. And also At-Large candidate for Denver and 2019. We are against this. This is just more planned gentrification in an already rapidly gentrified city.'",
        "'speaker_9': 'All parts of the city are being gentrified and there seems to be no stop in sight. By allowing this ordinance change, you are just filling the problem and not addressing the crisis at hand, which is homelessness and affordability in the city and county of Denver.'",
        "'speaker_9': 'This neighborhood in question is no no where by any means affordable. My question is, what is the army level going to be for this plan development? And who is going to occupy this plan and development. Because I've been in a movement profession for the past three years and I've moved several gentrifiers into these properties and into these'",
        "'speaker_9': 'areas. So I know firsthand this has become an all white enclave with no end in sight. You have to have big dollars to live, play and occupy this space. This public plaza is not public, especially if you are homeless.'",
        "'speaker_9': 'I would like to see a study done on how many tickets, how many harassments and how many arrests occur in this plaza. Denver. We have a crisis at hand. It's even bigger than the opioid crisis. It's the fact that people cannot afford to live in this once affordable town abode city.'",
        "'speaker_9': 'You want to turn this into a New Amsterdam? That's really what it boils down to. In the cities in these studies. Are all predominantly white. You want to keep this an all white enclave? There's nothing has changed except a year.'",
        "'speaker_9': 'This is a modern day Jim Crow. The people are support of this are part of the problem. They have funded and fueled the urban camping ban, which was passed in 2012 that members of this council approved on. So, yeah, this is not helping anybody except to openly rich and those that can afford to live and LoDo around'",
        "'speaker_9': 'the stadium, around Coors Field. Yes, I am a Rocky fan, but I am not a supporter of this. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of Council Councilwoman Ortega?'",
        "'speaker_6': 'Thank you, Mr. President. I first wanted to ask about the open space, and I'm not sure, Mr. Young, to see if you're the best person to address that. What what that looks like, how that will feel to the.'",
        "'speaker_6': 'Not just the. Development itself, but for the public. Can you just speak to that?'",
        "'speaker_5': 'So again, part of the idea was to have a content plaza. Again, as I said, similar to Rockefeller Center, where it's not a really about the buildings in this project, it's about what's between the buildings. And so in order to get an area of about 25,000 square feet in the center of this block, we carved out an'",
        "'speaker_5': 'area for this content plaza. And within doing so, we had to reallocate some of that square footage. And the idea for the Content Plaza is to be a counterpoint to what's happening on the plaza at Wynkoop. So we have all this activity.'",
        "'speaker_5': 'Think of the activity in one as a stream and the Content Plaza ad is eddy off the stream and this eddy is there for neighborhood gatherings. It's there for performances. It's just another way to showcase what Denver has, but do it in a relevant year round format.'",
        "'speaker_5': 'That'll be a benefit to the city.'",
        "'speaker_6': 'Thank you. I'm not sure. Maybe, Mr. Roth, you might be the next best person to address whether or not there is any proposed city resources expected to go into the development. Is there a look at tax increment financing or any other public financing tools to help make this project become a reality?'",
        "'speaker_5': 'We've established a metro district actually to I am plan to use the bonds that will be issued under that Metro District districts to improve the Wynkoop walkway and also the improvements to the sidewalks on 19th NYC.'",
        "'speaker_6': 'Okay. Thank you. I have no other question.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega. Councilman Brooks.'",
        "'speaker_3': 'Yeah, thank you, Mr. President. Liz, quick question. There was a one lone one no vote opposed. Can you explain their planning board?'",
        "'speaker_2': 'Yep. The concern there was with the height that's allowed in the powder and whether that was consistent enough with the LoDo adjacency. So the PD allows from 110 at 19th street it goes up to 150 and then 165.'",
        "'speaker_2': 'So one planning board member had concern about that.'",
        "'speaker_3': 'But that's it's consistent with the Arapahoe Square.'",
        "'speaker_2': 'It's so the only high guidance that we have is from the CPV Amendment Plan, which is from 1991, that talks about mid-rise heights that didn't have a specific allotment for that. But we do feel that that is consistent in terms of making that transition together with the design standards and guidelines that come along with the pad of'",
        "'speaker_2': 'making sure that it's addressing LoDo appropriately.'",
        "'speaker_3': 'Interesting. All right. Can you can you talk about parking demand again? This says this is a parking demand site. What is the do you have the ratio for retail in the.'",
        "'speaker_2': 'So there are no minimum parking requirements. So that's consistent with our downtown standards. But you have.'",
        "'speaker_3': 'Maximum.'",
        "'speaker_2': 'There's a maximum. What we did was establish a maximum number overall for the site, for the ease of administration. You don't have administering that. We do have ratios that are I can pull them up that we use to get to that number.'",
        "'speaker_2': 'But we felt that for administration over time it would be complicated to put the ratios into the paddy itself and that we established.'",
        "'speaker_3': 'Okay. I'm going to ask a couple of other questions for you just to look at those real quick and then tell me and then Sean, may I just have a quick question for you? Obviously, it sounds like a lot of the neighbors concerns were met.'",
        "'speaker_3': 'There is one around, you know, affordability in the neighborhood. You this is under under the linkage fee. So what is the amount that the linkage fee will contribute to our housing fund?'",
        "'speaker_5': 'Yeah, I just checked with how we're off on that and it's approximately 1.13 million. Okay, great.'",
        "'speaker_3': 'Does that give you enough time list.'",
        "'speaker_2': 'So that the ratio that we use to get to the maximum was one space per thousand for commercial uses?'",
        "'speaker_3': 'Okay. And there's 107 condos. I believe so.'",
        "'speaker_2': 'And it's we use 2.8 per residential unit for that. And this maximum though in the PUTU can be used for any of the uses and it's a number overall that they can get to.'",
        "'speaker_3': 'Wow. Okay. That's a good number. All right. Mr. President, I. I just have one more question, Liz. I just want to make sure. Last one. You didn't get any letters of opposition from any neighbors?'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Brooks. Councilman Flynn.'",
        "'speaker_7': 'And famous for president. Mr. Roth, maybe you be the best person to address this in capturing the amount of value that you are over the 99 years and your capturing it in the first 30. The stadium, I'm assuming, will need some attention in years 31 through 16.'",
        "'speaker_7': 'Have has the team or the district thought ahead as to how to capture any value afterward?'",
        "'speaker_5': 'No, councilman. The the main issue is to solve for 30 years. The question is then the stadium will be 52 years old. Will will still be viable, you know, hopefully. So we can point to a couple stadiums. And I know you're a fan that have like Fenway and Wrigley in Chicago that have lasted that long, but those'",
        "'speaker_5': 'are the only two out of 30. So I hope my successors can keep that going. And but we'll need a new funding source at that point in time.'",
        "'speaker_7': 'Okay. Thank you. Because it does seem like we're going ahead to your 99 and capturing that value and bringing it into the first 30 years.'",
        "'speaker_5': 'Yes. Just for the West slide. Yes, it's the 99 years. And then after 30 years, you know, obviously the stadium district, I should say, the taxpayers will still own the land and the stadium.'",
        "'speaker_7': 'Of course. And then you also have the lots to the east and it.'",
        "'speaker_5': 'Right? Yes, sir.'",
        "'speaker_7': 'And one other question that John, maybe you could address this, Mr. Jankowski. What is the what is the plan? And forgive me if I missed it since the last time you're in committee, what is the plan for relocating the artwork, the evolution of the ball?'",
        "'speaker_7': 'Where is that going to end up?'",
        "'speaker_5': 'Sure. It was complicated. The we have dismantled the arch right now currently and it's stored in at the Rockies lot. What we're going to do next is in order to kind of solve a lot of problems for a lot of people, we had to move it because of the fire access issues that we had around the building'",
        "'speaker_5': 'and to keep fire all access all the way around the new complex. Since it's just a parking lot now, it's not an issue with buildings there become an issue with the fire department. And then the next thing we wanted to do was put it in the entrance way to the bridge.'",
        "'speaker_5': 'And so that's where it's going to locate. It's going to move about 20 feet towards the field and be the archway that would be over the bridge. And in order to accomplish that and keep the Rockies mass from coming through the bridge and not necking down too much, we're going to stretch the arch slightly.'",
        "'speaker_5': 'So it's the same width of the bridge.'",
        "'speaker_7': 'Okay. It's because it was kind of at the threshold of the bridge already, but it was in the it was on your on your property.'",
        "'speaker_5': 'Correct. This is actually going to be in the right of way because it's right right now it's on the property and it's right on the edge of the property. In order to get it out of the fire zone, we have to move it into the right of way.'",
        "'speaker_5': 'That'll be the right at the entrance to the pedestrian bridge as it goes over 20th.'",
        "'speaker_7': 'I'm looking at it here. Okay. Thank you very much. That's all this president.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Seeing no other questions. The public hearing for Council Bill 1006 is closed. Are there comments by members of Council Councilman Brooks Yeah.'",
        "'speaker_3': 'I would love to make a comment, Mr. President, if that's okay.'",
        "'speaker_0': 'You go right ahead.'",
        "'speaker_3': 'Thank you so much. You look you look good today, by the way, I am excited about this because I feel like this is this is textbook of how you bring a community together and do it right. I think at a time when we are at a height in growth, in activity and people getting really concerned about construction'",
        "'speaker_3': 'activity all over my district, but especially in the center of it right here. You know, the Rockies had a plan and decided to spend the time necessary to do it right. And I just really want to thank you all for doing that.'",
        "'speaker_3': 'And I think the neighborhood for engaging and, you know, I think, you know, going to some of these meetings when you're not getting paid to do it is really tough and it's very complicated. And this is not just a, oh, we're going to put some condos up.'",
        "'speaker_3': 'This is an entertainment development and it's very complex. But talking to the neighbors, talking to the Rockies team, all the suggestions were taken in and really changed. I mean, from the ingress egress of the trucks, which is really important, this the speakers, the lights, all of these folks who've invested a lot of money in their lives right'",
        "'speaker_3': 'there are all supporting this. And at a time when there's a lot of controversy over Larimer Square with the same neighborhood, this neighborhood is getting behind it and supporting it. And so I'll just let you know that it was a good move and great relationships.'",
        "'speaker_3': 'I I'm always concerned about affordability in this city, you know, not just not just folks who are low income or or poor, but folks who are working and actually making $90,000 a year. They can't afford to buy a house anywhere around this area.'",
        "'speaker_3': 'And so it's a real challenge to address this issue. And I'm grateful that in 2016, we passed an ordinance to make sure that developments like this invest into the future of our city. And and a $1.1 million is a lot of money to invest in this area.'",
        "'speaker_3': 'And so I'm I'm excited about that. And I'm you know, you see the Rockies have presented what this would look like. And I just can't wait to see it, because if you all have not seen the design, you have to, you know, and the other thing I would say is take money for being a part of this'",
        "'speaker_3': 'whole process. He's not here tonight, but I think that's big. To have the owner at the meetings sitting down with neighbors is really big in his vision. He gets a lot of respect for me because sometimes the vision, the visionary doesn't want to do the hard work to get in the rooms with the people who actually live'",
        "'speaker_3': 'in the neighborhood. And he did it all. So hats off to everybody involved. This is a successful project.'",
        "'speaker_0': 'Thank you, Councilman Brooks. Seeing no other comments. I'll just add quickly. I think you do staff for the great presentation. I think this clearly meets the legal criteria for rezoning. And happy to support tonight. Madam Secretary, roll call.'",
        "'speaker_2': 'Black. Hi, folks.'",
        "'speaker_4': 'Hi.'",
        "'speaker_5': 'Espinosa Hi. Flynn Hi.'",
        "'speaker_6': 'Gilmore. I Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Cashman can h.'",
        "'speaker_6': 'Lopez All right. Ortega, I.'",
        "'speaker_2': 'Susman All right.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting, announce the results.'",
        "'speaker_4': '12 hours, 12 hours.'",
        "'speaker_0': 'Total Bill 1006 has passed. On Monday, November 26, the Council will hold a required public hearing on Council Bill 1208, designating 2600 Milwaukee Street, the Henderson House, as a structure for preservation. On Monday, December 17, Council will hold a required public hearing on Council Bill 122, two to create a new zone districts in the downtown context and'"
    ]
}