{
    "Proclamation for National Alzheimers and Caregiver Month.": [
        "'speaker_5': 'If someone in your own family suffers from Alzheimer's, please use the resources of the Alzheimer's Association and other groups for support. No one person or family should have to go through this alone. There is no cure and you can help find one by supporting the Alzheimer's Association and other groups.'",
        "'speaker_2': 'Thank you, Councilwoman Black. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. I want to ask first that my name be added to the proclamation. I want to thank Councilwoman Black for bringing this forward. My mother also suffers with Alzheimer's, and I actually served on the board of the Alzheimer's Association.'",
        "'speaker_9': 'And it was during that time that we noticed some of my mother's behaviors that were just not quite right. And I remember she took a trip. She lives in Grand Junction, and she had taken a trip down here to Denver.'",
        "'speaker_9': 'And she was driving back with my stepdad. And she had left my sister's home and my stepdad was waiting for her to come to pick him up. And my sister called and she said, I just got a phone call from Dad.'",
        "'speaker_9': 'Where is Mom? She'd been missing for 2 hours. She got in her car and thought she was driving over to pick up my stepdad and she drove to Colorado Springs. So that was kind of the first real clue that something, something more serious was going on.'",
        "'speaker_9': 'And in the time that I was on the board, I was like totally in denial that this is what my mother was experiencing. And since then, she was absolutely diagnosed and takes the the medication. She's now living in a nursing home in Grand Junction.'",
        "'speaker_9': 'And so I know all too well the the trials and tribulations that families have to go through. So I think this is really important to continue to draw awareness to this serious and costly disease. Linda, I hope you'll tell us whether Alzheimer's is whether.'",
        "'speaker_9': 'Medicine and science is any closer to finding any cures to this horrific disease. But it is, as the proclamation indicated, very, very costly to our our systems and to the lives of the people that it affects. And so I again, just want to say thank you for bringing this forward.'",
        "'speaker_9': 'And my hope is that one day we can see a cure, too, where we no longer have to keep drawing attention to this issue. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilwoman Canete.'",
        "'speaker_8': 'Thank you. Mr. President, I would just wanted to share. I, too, have a loved one suffering from dementia and unsure yet if it's exactly Alzheimer's or never form. But I appreciate you bringing this forward and I'd like to add my name as a co-sponsor.'",
        "'speaker_8': 'Thank you for raising this awareness.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilman Espinosa.'",
        "'speaker_3': 'Yeah, I would like to also add my name. Sorry I didn't do it earlier. And because my family is also one that's not immune to Alzheimer's affliction. Thank you.'",
        "'speaker_2': 'Thank you. Any other comments? Proclamation 826. Seen Unmanned Secretary Roll Call.'",
        "'speaker_7': 'Black Eye Brooks. Hi, Claire. Hi, Espinosa. Hi, Flynn. I gillmor. I Cashman. I can eat Lopez. I knew Ortega. Hi, Mr. President.'",
        "'speaker_2': 'Hi.'",
        "'speaker_7': 'Brooks.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Please cast a vote in the results. 1212 I's Proclamation 826 has been adopted. Councilwoman Black, there's someone you'd like to bring to the podium to receive the proclamation.'",
        "'speaker_5': 'Thank you, Mr. President. I'd like to introduce President and CEO of the Alzheimer's Association of Colorado, Linda mitchell.'",
        "'speaker_10': 'Thank you so much, Mr. President, and thank you for bringing this proclamation forward. The awareness that you're creating tonight is extremely important to the Alzheimer's cause and the Alzheimer's Association. There's probably very few people in this room who have not been touched by Alzheimer's disease.'",
        "'speaker_10': 'And for those of you who haven't, it will definitely impact your family at some point in the future. There's no question about that. With the aging of the baby boomers, one in three families is already impacted. You've heard the numbers, the cost of Alzheimer's disease and some of the human toll that this disease takes on our families'",
        "'speaker_10': 'throughout Colorado and throughout the country. In fact, globally, there is probably more than 30,000 individuals living with Alzheimer's disease in the Denver metro area today. And for every one of them, there's at least three families members whose lives have been impacted forever.'",
        "'speaker_10': 'They're the caregivers, the unpaid caregivers, for the most part that you heard about 234,000 in Colorado already today. So we have a huge public health condition here. We have an enormously burdensome disease on families. This disease has no cure at this point.'",
        "'speaker_10': 'It's the only one in the top ten causes of death that can't be effectively treated, slowed or certainly cured at this point. But there is good news. Research is moving very rapidly right now. There's a new focus globally on Alzheimer's disease prevention research.'",
        "'speaker_10': 'And I think some of the most promising research that we are supporting is the identification of biomarkers to identify people who are at the greatest risk for developing this disease and targeting treatments at them at the very earliest stages or even before symptoms occur.'",
        "'speaker_10': 'So that one day, hopefully not too far in the future, Alzheimer's disease will be like cancer. If you get a diagnosis of a stage one cancer, for the most part, that's quite treatable. Well, we want stage one Alzheimer's disease versus it being diagnosed when it's progressed for ten, 15 years or more and the symptoms are quite prominent'",
        "'speaker_10': '. So that's some of the most encouraging research right now. We do have medications that are available if the disease is diagnosed early. And that's another one of our challenges is that raising the awareness in the community, that early diagnosis does make a difference.'",
        "'speaker_10': 'Medications can be tried. Families can come in to the Alzheimer's Association for services at a very early stage in the disease so that we can help them plan and gather their resources for the years ahead. For the most part, this disease will last 8 to 12 years.'",
        "'speaker_10': 'And again, that toll on the family increases year by year. The Alzheimer's Association is here in Denver and throughout Colorado to provide services for families at every point in the disease from very early stage through the end of life.'",
        "'speaker_10': 'We offer a helpline, support groups, family counseling, care planning, education classes, art and music, opportunities for individuals living with the disease and a host of other services. And what's really important for the community to know is that those services are offered at no charge to families.'",
        "'speaker_10': 'And all of the crazy fundraising that we do year around is to be able to provide those services to all of our citizens in Colorado at no charge. So you can all help us spread that word to. So if you know someone that's in your circle of friends, your neighbors, your church, your community, who is struggling with'",
        "'speaker_10': 'this disease in the in their family today, please make them aware that the Alzheimer's Association of Colorado is here to serve them, and we want them to come and contact us. We have our headquarters here in Denver near Fifth and Sherman, and then we have six other regional offices across the state.'",
        "'speaker_10': 'So thank you again for the awareness tonight and the opportunity to speak with all of you. It helps our cause enormously, and we have a very special reason for being proud of the Broncos great football, but also a great organization that is now standing behind the Alzheimer's Association.'",
        "'speaker_10': 'The Denver Broncos have made the Alzheimer's Association of Colorado one of their community partners, and the ball and family has stepped forward to help increase awareness. And bring attention to this disease. So we're very grateful for that as well.'",
        "'speaker_10': 'So thank you very much.'",
        "'speaker_2': 'Thank you. And thank you, Councilwoman Black. All right. That is all for the proclamation. So next we have the mayor's proposed 2016 budget. Councilmembers this year last night to offer any amendment to the mayor's proposed 2016 budget. Do any council members have any amendments to offer?'"
    ],
    "Rezoning of 3268 West 32nd Avenue in Council District 1.": [
        "'speaker_2': 'Thank you. It has. Madam Secretary, please announce the results. 1212 by 625 has been taken out of order. All right, so 625 is up. Councilman Cashman, will you please put Council Bill 625 on the floor?'",
        "'speaker_1': 'Thank you, Mr. President. I move the council bill 625 be placed upon final consideration and do pass.'",
        "'speaker_2': 'All right. We're going to wait for the technology to. It has been moved and seconded. I have an amendment. The purpose of this amendment is to acknowledge that the applicant requested the City Council to modify the original zoning request to reduce the size of the proposed you must to X rezoning area.'",
        "'speaker_2': 'The request was made after the mediation process did not reach a resolution. A modification request after hearing has been scheduled is allowed under section 12 .3.3. ten of the Denver zoning code and requires a vote by council to take effect.'",
        "'speaker_2': 'So I move that Councilor Bill 625 be amended in the following particulars on page one, strike lines 25 through 27 and insert quotations on page one. Strike the language stated in lines 25, 26 and 27, and replace with the following language.'",
        "'speaker_2': 'Lot seven and eight. Lot six, except the E 16 feet thereof, said exceptions conveyed to the city and county of Denver for alley purposes. BLOCK 30. Highland Park. City and County of Denver. State of Colorado. It has been moved in second hand, starting with comments.'",
        "'speaker_2': 'I will just say I'm first Councilwoman Sussman, the committee chair of the Neighborhood and Planning Committee was unable to be here and asked that I make this motion for her just so that we can get the conversation first about the modification.'",
        "'speaker_2': 'If there was someone from community planning, Bauman can just give a brief overview of what this modification does so that for those that didn't understand all the language that I just said, could a just briefly overview and then we'll go into other comments.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Certainly. Good evening, Tim Watkins, community planning Development Case Manager for this rezoning application 2014 833 This is if we could get this visual up on the monitors for council members as well as the public, please. Okay. So this.'",
        "'speaker_11': 'Is a visual.'",
        "'speaker_3': 'Of the current application and you can see light six, seven.'",
        "'speaker_1': 'Eight and nine. And the proposal.'",
        "'speaker_3': 'The requested modification is to reduce that area, which shows that 31,000 164 square feet. Two lots, six, seven and eight. To the adjusted area of 2026. 70 square feet.'",
        "'speaker_2': 'Perfect. Thank you. That's all the questions I have. Comments. Questions. Members of Council Councilman Espinosa Earp.'",
        "'speaker_3': 'I don't know if this is a question for Tim or we should get the actual applicant, but I would like to know, does this actually change? So there's been a lot of discussion about an actual proposed building for an urgent care facility.'",
        "'speaker_3': 'Does this actually change anything at all about the struct, the size of the structure that that they're proposing to put there? I would defer to the applicant if you'd like to call me. Yeah, sure.'",
        "'speaker_10': 'Thank you. Council President Herndon and members of council. My name is Cindy Kraft. I do the communications and community engagement for the mayor's team. I'm joined tonight by Dave Hagan, our developer partner, and Keith Bushtucker, who is a longtime time church member, as well as the volunteer property board manager for the church and the All New North'",
        "'speaker_10': 'who was acting as the volunteer church president at the time. We submitted our application.'",
        "'speaker_3': 'Ask the question, does it change the size of the structure proposed?'",
        "'speaker_10': 'Well, what I'm going to say to that, Councilman Espinosa, is that we, based on feedback that we heard, including from you. Yes. Or decided decided to shrink the lot size. We invested initially in this in this process. We really went above and beyond in trying to provide a lot of information about what we were hoping to build'",
        "'speaker_10': '. Things that aren't part of the rezoning process, like the size of the building is actually not part of the criteria for rezoning. But we an effort to try to provide as much information as possible put a lot of thought into what we hoped to do and provided a lot of information about things like the size of the'",
        "'speaker_10': 'building. We were thinking of building, the hours of operation, what the building would look like, etc., etc. And all of that information was helpful to many members of the community who supported the project and who have sent you letters.'",
        "'speaker_10': 'But of course, for a core group of opponents, providing that information was not helpful. So now that we've made the decision to shrink the lot significantly, we've decided that we're just going to kind of keep things simple, which is to keep things focused on the criteria for rezoning, which is the size of the lot, and the UMC'",
        "'speaker_10': 'two X designation that we're going for, which is the most restrictive commercial designation in the code. The building size is something that's determined in a process following rezoning, and we're committed to working with a site engineer as well as development services to design a building that is appropriate for this new, smaller lot and want to go through'",
        "'speaker_10': 'it with all of the same approvals and permitting and all those things that have to do. But since the size of the building is not a criteria for rezoning, we're just going to keep it simple and talk about the lot.'",
        "'speaker_3': 'Tim So the proposal at some point, it's been varied from 23 to 28000 square feet. Could you build a 23,000 square foot structure on the on the remaining parcel on the remaining zone lot in the you too you 2xumx2x that would be subject to site plan review.'",
        "'speaker_1': 'And administrative.'",
        "'speaker_3': 'Review and whatever the proposed uses are in the building, the parking requirements and whether or not the on site parking parking required. So is there a configuration that you can build actually in excess of 23,000 square feet? I don't know.'",
        "'speaker_3': 'Wow. Okay. All right. Site plan to be determined what the size of the building would be based on the proposed uses. So we just are developing for three and a half block parcels with no proposed use. One zone lot comprised of three surveyor.'",
        "'speaker_1': 'Lots six, seven and eight.'",
        "'speaker_3': 'And there could be an variety of uses as allowed under UMC to X part of nine or not. It looks like 16 feet of there was a part of lot six would be reduced by 16 feet to dedicate to the alley.'",
        "'speaker_3': 'All right. Thank you.'",
        "'speaker_2': 'All right. Colleagues, my screen went out, so I had to log in. Was there anyone else that had chimed in for a question or comment? I apologize for that. No. No. Right. Any other comments or questions on Councilwoman Ortega?'",
        "'speaker_9': 'So I guess I'm trying to understand the reason for. The. The proposed amendment. And the reasoning for proposing to shrink the size of the application. I mean, typically this stuff is not done on the floor. Typically it's done where, you know, it gets worked out before it comes to city council or it's sent back to be worked'",
        "'speaker_9': 'out. Correct. So I don't I don't understand the the rationale for why this has been brought forward as an amendment. So, Councilman Herndon, you're doing this on behalf of Councilwoman Sussman. I know this is not her district, but I just didn't understand that.'",
        "'speaker_2': 'Well, who the applicant is the one that requested. So we can certainly allow them the opportunity.'",
        "'speaker_10': 'Thank you so much for your question, Councilman Ortega. So as Councilman Herndon had mentioned, we were in mediation and of course, we can't discuss anything that happened in mediation. However, the mediation officially terminated Friday at noon on October 23rd.'",
        "'speaker_10': 'And at that point, the mayor's team kind of regrouped. And we we did feel that we had a good application. I mean, it was supported by CPD. It was passed through planning board. But following the close of mediation, we got together and said, you know, is there anything more we can do?'"
    ]
}