{
    "Junior Lien Obligation for the Great Hall Project at the Airport.": [
        "'speaker_6': 'And I look forward to more partnerships like that.'",
        "'speaker_1': 'Great. All right. Let's bring the next item up, which is 973. And I believe we're going to put that on the floor. Councilwoman Canete, will you please put on the floor?'",
        "'speaker_2': 'Yes, Mr. President. I move that council bill 973 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right, it's been moved. I need a second. In a second. All right. It's been moved and seconded. Comments for members of Council Council Gilmore.'",
        "'speaker_2': 'Thank you, President Brooks. I will be abstaining from the vote on this due to my brother in law having an interest in the Great Hall Project.'",
        "'speaker_1': 'All right. Thank you. Seen no other comments by members of council. Madam Secretary, roll call.'",
        "'speaker_3': 'Gilmore.'",
        "'speaker_2': 'Abstain.'",
        "'speaker_3': 'Cashman. Kinney. Lopez. Nu Ortega. Sussman. High Black Clerk. Espinosa. I. Flynn.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_1': 'I. Police close voting. Announce the results.'",
        "'speaker_3': '11 eyes. One Abstention.'"
    ],
    "Framework Agreement for the National Western Center Redevelopment and Naming Exemption.": [
        "'speaker_1': '11 I. One abstention. 973 passes. Okay, please bring up 939. Great Councilwoman. 99 is up. Councilman Ortega.'",
        "'speaker_2': 'This is just for comment. Yup. So, first of all, I want to thank Krystal de Herrera, deputy city attorney, for getting over an updated letter. It's actually a memo that was written by Mayor Hancock and addressed to the National Western Center Authority.'",
        "'speaker_2': 'Chairperson So this will go to the board when they are seated. But what it does is spell out the mayor's expectations of the board. And initially, when this was shared with the members of the Community Advisory Committee, it had the verbiage the authority should, and it was changed to will in several of these bullet points.'",
        "'speaker_2': 'And so I just wanted to thank her for this change that has been made. I'm talking about you as you walk in the door. And I think this is really important because it's it's not leaving it up to chance.'",
        "'speaker_2': 'It's it's pretty definitive that these things will be done. And that's an expectation from the mayor of the advisory board. The last thing I mean, advisory board, but the authority board members, I so when we had this discussion last week and we had the public hearing on this, we didn't know that the executive director of the National'",
        "'speaker_2': 'Western Center, Kelly Lead, was going to be stepping down and moving on to other things. So I just want to reiterate my appreciation to you, Kelly, for the work you've done moving not only this project, but all the projects that you've started with the DCC.'",
        "'speaker_2': 'So, you know, you've got big shoes to fill. And Gretchen, you've been there every step of the way as well. So you'll be stepping into Kelly's role and the fact that you've been there means that you won't miss a beat.'",
        "'speaker_2': 'And so I wish you well and looking forward to the next meeting on the 28th and just appreciate all of the efforts. So thank you, Kelly, and Godspeed with you in your next chapter of your life.'",
        "'speaker_1': 'That. Thank you, Councilwoman. Or your client for his. Thank you. Councilwoman Ortega, I think I think those words are just right in. And I want to say a couple words as well. That one, this isn't the end of the conversation, I think for the community piece that there's ongoing conversations.'",
        "'speaker_1': 'I've offered up my time as president to continue letting the mayor hear the feedback from the community. Specify criteria of the chosen selections on this board. So I still stand by that and look forward to meeting with the community on that.'",
        "'speaker_1': 'And thank you, Councilwoman, for for being there and walking with us through this whole issue. And then, Kelly is it's been a fun ride. Many of us came in with Kelly Councilwoman to take in each council, Councilwoman Sussman and also oh yeah, earned it.'",
        "'speaker_1': 'We all came in 2011 when you were the development services director, then on to NBCC and now you know, the National Western Center and on to what you're gonna be doing privately. And so thank you for your service.'",
        "'speaker_1': 'Thank you for always improving systems, for being factual, for being consistent, for being transparent. I think you've done a great job. And so we we, you know, excited for the next step. We bitterly say bye, but thank you for all your hard work.'",
        "'speaker_1': 'And Gretchen, you're going to do a great job. Excited for you to take over the reins here. So with with no further questions, no one call the software vote. So we're going to we're going to fold this into the package.'",
        "'speaker_1': 'This concludes all of the items that need to be called out. All other bills for introductions are not or to publish. We're now ready for the black vote on resolutions and bills in front of consideration. Council members remember that this is a consent or block vote and you will need to vote I.'",
        "'speaker_1': 'Otherwise, this is your last chance to call on on our supper vote count someone Khamenei can each where you please put a resolution for adoption on and the bills on final consideration for final passage on the floor.'",
        "'speaker_2': 'I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in a block for the following items. 348 986 987 988 989 979 nine 8983 985 344 1038 938 972 nine 3931 937 960.'",
        "'speaker_2': 'All series of 2017.'",
        "'speaker_1': 'Great. You've got them all. It's been moved and seconded. My secretary, Raquel Flynn.'",
        "'speaker_3': 'I Gillmor I Cashman Kinney I Lopez High New Ortega Sussman, I Black Clerk. Espinosa Hi, Mr. President.'",
        "'speaker_1': 'I police was very nice. Results. 1212 eyes. The resolutions have been adopted in the bills have been placed on final consideration and do pass. Tonight there will be a required public hearing on Council Bill 841 changes on the classification for 385395405 and 415 South Cherokee and Baker.'"
    ],
    "Zoning Change for South Cherokee Street Properties in Baker.": [
        "'speaker_1': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech and direct your comments to council as a whole and refrain from individual or personal attacks.'",
        "'speaker_1': 'Council woman can each just in the nick of time, will you please put council bill 841 on the floor.'",
        "'speaker_2': 'Yes. Council President I move that council 841 council bill 841 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. The public hearing for Council Bill 8 to 41 is open. May we have the staff report? Scott Robinson, how are you?'",
        "'speaker_7': 'Thank you. Scott Robinson with community planning and Development. So this is a request to rezone a3853954 or five and 415 South Cherokee Street from ib02 to C Annex 16. As you might notice in the staff report, the City Committee Planning Department is the applicant in this case.'",
        "'speaker_7': 'If you're familiar with this property, it is in Council District seven in the Baker neighborhood at the Alameda Light Rail Station. It's a portion of the Dennison development near the Alameda and Broadway intersection. This property was recently completed and we recently realized that a portion of the property was still zoned IPU Hotel, which is an industrial zoning'",
        "'speaker_7': 'instead of the C 16 that the rest of the property was developed as. As far as we can tell, the when RTD sold the property to the developer, they included a sliver of what used to be the rail right of way.'",
        "'speaker_7': 'And so that carried the industrial zoning. And it wasn't caught until earlier this year after the violent permit had been approved and the building had been completed in the city and occupancy had been issued. And so we realized the issue.'",
        "'speaker_7': 'The Iby zoning does not allow the residential uses that are currently on the site. So in an effort to clean up the zoning and get it all under the same zone district and his own district, it allows the existing uses.'",
        "'speaker_7': 'Brad Buchanan, the executive director of Community Planning and Development, decided to sponsor the application. So this is sponsored by the city. The property that's being re zoned is a little less than half of an acre. As I mentioned, it's the west portion of the existing Denison development.'",
        "'speaker_7': 'Going from the industrial idea you go to to see an X 16 the you go to is the billboard you overlay see an x 16 is urban center neighborhood context mixed use with a 16 storey maximum height request is along with the rezoning to remove the euro to overlay.'",
        "'speaker_7': 'There is a view plane in the area from Washington Park that limits the height to 160 feet. That'll come up again later. There is also an existing general development plan and urban design standards and guidelines for the area under the Denver Design District.'",
        "'speaker_7': 'This is in some areas too of the GDP, which calls for high intensity development around these station. Current use is mixed use site is mostly residential. There's one small retail portion of the denizen development. Surrounding it is the rail right of way to the west industrial uses to the north and the Broadway marketplace shopping center to the'",
        "'speaker_7': 'east. As you can see in the pictures in the middle one, there is basically the area that's being reserved, the sliver between the west side of the development adjacent to the station and the railroad tracks. The top is the property to the north and the bottom is the property immediately to the east.'",
        "'speaker_7': 'This went to the planning board in July with a unanimous recommendation of approval and then the Land Use Transportation Infrastructure Committee in August. There's been no public comment at any of the public hearings or received in written form.'",
        "'speaker_7': 'In order to approve a rezoning, the city must find that these five criteria have been met. First criterion is consistency with adopted plans, and there are four plans that apply to the area. First is comprehensive plan 2000 as described in the staff report.'",
        "'speaker_7': 'Staff has found that the proposed rezoning complies with these five strategies from camp planning 2000 mostly have to do with development, your transit and mixed use development and redevelopment. Blueprint Denver from 2000 to designates this area as right of way, which isn't actually further defined in the plan.'",
        "'speaker_7': 'The plan does say that the boundaries are fluid and not always specific because this was a citywide plan. And so if we look at what this really should be, it's most likely to be the adjacent designation, which is transit oriented development, which calls for compact mid to high density development and a balance mixed abuses, which is what'",
        "'speaker_7': 'these next 16 zoning would allow. This is also designated as an area of change. Both Cherokee and Alaska are on designated local streets, intended to provide connections to bigger streets both Alameda and Broadway or mixed use arterials, which call for a variety of travel options and more intense development.'",
        "'speaker_7': 'The bigger neighborhood plan from 2003 designated this as part of the transit oriented development sub area calls for a mix of uses, walkable neighborhood and a gateway development around the station area, and also calls for maximum building heights of 4 to 12 stories.'",
        "'speaker_7': 'And that was updated in a later plan, the Alameda Station Area Plan of 29, which calls for a plaza around the station area which has been constructed and. Office or the office uses at the station, which would be allowed under the sea.'",
        "'speaker_7': '16 Zoning. And this plan calls for building heights of 5 to 14 stories, which is slightly less than the 16 stories that would be allowed under the sea and 16 zoning. But as I mentioned earlier, there's the View plan, which limits development to a maximum height of about 160 feet, which will limit it to about 14 stories'",
        "'speaker_7': '. So with the new plan, you can't develop the full 16 stories that would otherwise be allowed under the zoning. So if that staff finds that the proposed rezoning is consistent with the adopted plans. The second criterion is uniformity of district regulations.'",
        "'speaker_7': 'Staff finds that the proposed rezoning would result in the uniform application of the C annexed 16 zone district. The third criterion is to further the public health, safety and welfare of city. Staff finds that the proposed rezoning would do so by implementing the city's adopted plans and by allowing for the continued use of the existing development under'",
        "'speaker_7': 'appropriate zoning. The fourth criterion is justifying circumstances. Staff finds that the proposed rezoning is justified by the changed conditions of the property. The property has been redeveloped and the proposed rezoning would update the zoning to match the existing development.'",
        "'speaker_7': 'And the final criterion is consistency with the neighborhood context, zone, district purpose and intent of the urban center. Neighborhood context is intended for higher intensity mixed use areas around like transit stations and the scenic 16 zone district is appropriate around transit station.'",
        "'speaker_7': 'So staff finds that the fifth criterion is met with that. Staff recommends approval. I'll be happy to answer any questions.'",
        "'speaker_1': 'All right. Thank you, Scott. Appreciate it. We have two speakers this evening and representing CPD, Evelyn Baker and Chairman Sekou. Ms.. Baker, you're up first. And if you're just available for questions, you can let us know that, too.'",
        "'speaker_2': 'That's basically what I'm here for this evening. Good evening. Members of the city council. My name is Evan Baker. I'm the deputy director of Community Planning and development here on behalf of the applicant. In this instance, Brad Buchanan, who is the executive director of Community Planning and Development.'",
        "'speaker_2': 'I'm here basically to answer any questions that you may have. It is slightly unusual for this agency to be the applicant in in a rezoning request such as this one. But as Scott has described in his staff report and his presentation to you this evening, really this is an administrative sort of cleanup that we're doing after the'",
        "'speaker_2': 'fact to get the zoning in line with the the development that is occurred on site. If you have any questions, I'm happy to answer. Otherwise I will watch the proceedings.'",
        "'speaker_1': 'Great. Thank you, Miss Baker. Chairman Sekou.'",
        "'speaker_4': 'Good evening.'",
        "'speaker_0': 'My name is Chairman Sekou and the founder.'",
        "'speaker_1': 'Organizer.'",
        "'speaker_7': 'For the Black.'",
        "'speaker_0': 'Star Action Movement. Whose constituency are poor, working, poor.'",
        "'speaker_7': 'Homeless people and senior citizens.'",
        "'speaker_0': 'For the city and county of Denver. I would be remiss if not to mention very briefly. Our absolute.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'For participating.'",
        "'speaker_0': 'In the.'",
        "'speaker_7': 'Dias Square Center thing and to.'",
        "'speaker_0': 'Thank the staff members of Way News and your staff and deputy staff and Robin your staff for putting up with old man.'",
        "'speaker_1': 'I'm not a out of my German sexual.'",
        "'speaker_7': 'Urgency so we're going to get right.'",
        "'speaker_1': 'Here. Yeah we've got to get get right to.'",
        "'speaker_7': 'It and.'",
        "'speaker_1': 'Keep watch on the clock because I want.'",
        "'speaker_7': 'To be.'",
        "'speaker_1': 'With the process. We can see it. We support.'",
        "'speaker_7': 'This.'",
        "'speaker_0': 'Ordinance zoning change for a couple of reasons. One, jobs. Poor, poor, working, poor, homeless people.'",
        "'speaker_4': 'And we are.'",
        "'speaker_7': 'Hopefully.'",
        "'speaker_1': 'Enthusiastic.'",
        "'speaker_0': 'About this project being that it presents an opportunity.'",
        "'speaker_4': 'For us to uplift.'",
        "'speaker_1': 'The bottom of the.'",
        "'speaker_7': 'Socioeconomic.'",
        "'speaker_0': 'Barrier.'",
        "'speaker_7': 'And to get folks into a position where they.'",
        "'speaker_0': 'Can be self-sustaining and productive.'",
        "'speaker_7': 'Members of City.'",
        "'speaker_0': 'County and Denver.'",
        "'speaker_7': 'Our war is against poverty. It has nothing to do with race or class. It's about poverty. And we feel that each and every member of humanity should have a gainfully employed so that they can take care of their families and have a.'",
        "'speaker_1': 'Lifestyle worth living.'",
        "'speaker_0': 'That's number one. Number two. Is. I agree.'",
        "'speaker_7': 'With the C CPD.'",
        "'speaker_0': 'Report that we need to do something about the zone and it seems like it is coming up piecemeal where the projects coming up, we change them.'",
        "'speaker_7': 'But if we take a thorough examination.'",
        "'speaker_4': 'Of what exists, we can.'",
        "'speaker_0': 'Stop all of.'",
        "'speaker_7': 'This and actually be proactive.'",
        "'speaker_0': 'In changing the zoning.'",
        "'speaker_7': 'And being done with it.'",
        "'speaker_0': 'So folks don't have to.'",
        "'speaker_7': 'Spend all this time, money and resources waiting for this thing to happen when it should.'",
        "'speaker_0': 'Already be done. And we're talking about plans. It's been in effect for.'",
        "'speaker_7': 'What, 2005.'",
        "'speaker_0': '2017, 12 years?'",
        "'speaker_4': 'I know we can do better than this.'",
        "'speaker_7': 'And we have that responsibility for the consistency to make this.'",
        "'speaker_1': 'Process flow so.'",
        "'speaker_0': 'That.'",
        "'speaker_7': 'We are a government truly of the people, by the people and for the people.'",
        "'speaker_0': 'And it's not about.'",
        "'speaker_5': 'Us.'",
        "'speaker_7': 'Particular in terms of our positions and whatnot. Here are districts and whatnot. It's about really us doing the due diligence and be.'",
        "'speaker_0': 'Proactive and helping move.'",
        "'speaker_7': 'This process of government along so that the citizens feel as if.'",
        "'speaker_4': 'They matter.'",
        "'speaker_0': 'And. Oh, that's it. Time out.'",
        "'speaker_1': 'Thank you. Thank you, Chairman. Thank you. This concludes our speakers questions for members of council. Councilman Espinosa.'",
        "'speaker_5': 'Couple of questions. Who is the developer that this city is doing this on behalf of?'",
        "'speaker_7': 'The developer's name is D for development.'",
        "'speaker_5': 'For the property owner. And why wasn't this done? I mean, why wasn't this picked up on the verification, the physical verification that goes on at the site.'",
        "'speaker_7': 'That I'm not sure about? I know the development services side of the department has taken a look at it and tried to improve their processes so that this won't happen again. So but I don't have the details of that with me tonight.'",
        "'speaker_5': 'Okay. Can somebody elaborate on what changes have been made? Because when we. Create when we have other problems in other departments, we actually it does very good result in some either disciplinary action or corrective training or whatnot. What have we done to actually mitigate this level of the De Silva error in the future?'",
        "'speaker_2': 'I would be happy to follow up with further discussion in terms of what process improvements we put in place to safeguard against these kinds of oversights in the future. I don't have that information for you this evening, and I'm but as I said, I'm happy to provide a follow up following this this matter.'",
        "'speaker_5': 'Okay. Okay. Because it's related. It might be part of the response there, so I'll be prepared to hear it. It's sort of a word there. Drawings incorrectly showing this is is is part of their within their bound I mean part of their zone lot and property.'",
        "'speaker_5': 'You know, so maybe that would be part of your response later on. I can take that later as well.'",
        "'speaker_2': 'Yeah, I would be happy to follow up on the specifics of how this oversight happened for this particular this particular development review matter. Certainly after after this hearing.'",
        "'speaker_5': 'In the reason why I'm even asking these questions and look forward to that response is because we do get complaints about building placement, you know, I mean, discrepancies between what we sort of know, what we can sort of document and then what gets built.'",
        "'speaker_5': 'Sure. Clearly not to this degree of of of error, but still it ends up being an error. And then our inspectors, I found, are sort of ill equipped right now to address these things in real time, at a time when they could be addressed and have resulted in civil litigation in District one.'",
        "'speaker_5': 'In my time in office. So I would love to see what you guys have come up with as far as resolution.'",
        "'speaker_2': 'Absolutely. I'd be happy to follow up with you directly on that matter.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'All right. Thank you. Councilman Espinosa, Councilwoman Ortega.'",
        "'speaker_2': 'Thank you, Mr. President. Evelyn, if you wouldn't mind coming back for just a second. So I know the site is right next to the railroad tracks and the development already exists. But I just want to take advantage of the opportunity to ask, as we have been seeing applications come forward that are adjacent to railroads.'",
        "'speaker_2': 'Are we seeing cooperation with the new checkoff box on the form that they have to fill out that's come through? Right. That's a great question. Thank you, Councilwoman Ortega. I've been working with we do. In fact, we have, in fact, modified the application for any site development plan that's under review to ask the applicant to indicate whether'",
        "'speaker_2': 'or not it's you know, there's some proximity to the railroad. And I've been working with Jack from your office to identify the referral, the correct individuals within the specific rail lines to refer those projects to. So I don't know that we've had any of those checkboxes checked since we changed that application, but Jack and I have been'",
        "'speaker_2': 'coordinating and trying to find the right the right individuals within each each rail line to refer those projects to. And why that's important is because when the applications come to us. They basically have not been approached about their proximity to railroads.'",
        "'speaker_2': 'It's not typically part of the reason process is more normally the design review and development review process. And so we don't see whether that compliance or that cooperation with that new check off boxes is happening. And I know in this case that doesn't apply.'",
        "'speaker_2': 'But as we have others, I continue to raise this issue just to make sure that we are, in fact, addressing health, life and safety issues as part of these developments. And you've done a great job of reinforcing the importance of checking on that.'",
        "'speaker_2': 'So it is front of mind for the development review staff. They are aware that it is something that they need to incorporate as part of their referral process, and that was part of the training that you all did with them as well, correct.'",
        "'speaker_2': 'You know, in terms of training, what we've done instead of having a focused training on this is we have provided resources as the matter comes up. There are resources that are available for the appropriate staff members to refer to and to provide to the applicant as well.'",
        "'speaker_2': 'Okay. Thank you very much. Thank you.'",
        "'speaker_1': 'Yeah, thank you, Councilwoman Ortega. All right. Seeing no other questions. Public hearing for Council Bill 841 is now closed. Comments by members of Council. Councilman Clark.'",
        "'speaker_4': 'Thank you, Mr. President. I just want to thank CBD for finding this, for bringing this word to clean this up. Obviously, this is a building that was built. It's already people have been living in it for over a year, I believe.'",
        "'speaker_4': 'In fact, on Thursday evenings, you can now catch an all electric e took took to five destinations on Broadway from this plaza that was built. And so this one obviously slipped through the cracks. But thank you for bringing it forward.'",
        "'speaker_4': 'I'm going to go ahead and support this, and I would urge my colleagues to do the same. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Clark. Seeing no other comments. I'm going to go ahead and vote on this thing has been moved in. Second, about Secretary Raquel Clark.'",
        "'speaker_3': 'All right, Espinosa Flynn hi. Gilmore I Cashman can eat. Lopez I knew Ortega. Ortega. Sussman Hi Black. Mr. President.'",
        "'speaker_1': 'I please close to voting and announce the results. 1212 I's Council A41 has passed. All right. On Monday. This is just a pre German announcement because we're we're done. On Monday, September 25th, 2017. Council will hold a required public hearing on Council Bill 903 designated the Packard Park Hills Historic District, located generally between Lowell Boulevard on the'"
    ]
}