{
    "Appointment of Members to the Harborview Leadership Group.": [
        "'speaker_0': 'Minutes are very good. All in favor say I I any oppose those are approved and our consent agenda item five, six, seven, eight, nine and ten. Would you put that before us?'",
        "'speaker_1': 'Yes. Thank you, Mr. Chair. I move I adoption of our consent agenda proposed motion number 2018 0545. Proposed ordinance number 2018 0546. Proposed Ordinance number 2018 0554. And Proposed Motion number 20 20564. Proposed Ordinance number 2018 0575 and proposed ordinance number 2018 0574.'",
        "'speaker_0': 'All right. Those are before us. All the roll on passage.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Baldwin, Councilmember Dunn, Councilmember Gossett.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Cole. Well, I. Councilmember Lambert. Councilmember McDermott, Councilmember of the Grove. Councilmember phone right there. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is five advised.'",
        "'speaker_0': 'No nos that carries will expedite those to Monday and put them on the consent agenda. Turning now to item 11. Item 11 is a motion to confirm the county executive's appointment of Leonardo Flor as a director of the Department of Community and Human Services.'"
    ],
    "Memorandum of Agreement on Insured Benefits for King County Corrections Guild.": [
        "'speaker_0': 'Is Leo here yet? He is here. There he is. Okay. Thank you for being here. Leo, we've got a brief introductory staff report from Miranda Luskin. And when we invite you to come forward at any time.'",
        "'speaker_1': 'Thank you, Mr. Chair. For the record, Miranda Luskin to the Council Central staff. The materials for this item begin on page 113 of your packet. The proposed motion before you would confirm the executive's appointment of Leo Flor as director of the Department of Community and Human Services.'",
        "'speaker_1': 'By way of very brief background, the King County Department of Community and Human Services manages a wide range of programs and services to assist the county's most vulnerable residents and strengthen its communities. The Department is also responsible for providing leadership and coordination to the regional efforts to address homelessness through all home, as well as oversight and management'",
        "'speaker_1': 'of the revenues from the Veterans, Seniors and Human Services. Levy the best rates for kids levy and the mental illness and drug dependency sales tax. Moreover, as a primary Regional Services Department, teachers plays a strong role in the coordination of the region's human services infrastructure.'",
        "'speaker_1': 'The DCH DCH has director oversees the Department's operations, planning and budgeting. As members are aware, executive appointment of the DCH as director is subject to council confirmation per county code. So approval of the proposed motion before you would fulfill this code requirement.'",
        "'speaker_1': 'Of note as described in the executive transmittal letter, Mr. Floor was the successful candidate from a nationwide recruitment for the new director of DHS. His work experience, which is described in further detail in his resum, includes serving as the DCH, US Veterans and Human Services Levee Renewal Manager and then as director of the DC Jazz Community Services'",
        "'speaker_1': 'Division. Additionally, Mr. Floor served in Iraq and Afghanistan as an officer in the U.S. Army. As a late breaking update. The background check has been completed and that paperwork will be transmitted shortly. A copy of Mr. Flores resume and completed questionnaire are included in your pocket materials, starting on page 119.'",
        "'speaker_1': 'Mr. Chair, that concludes my staff report.'",
        "'speaker_0': 'Thank you very much, Miranda. Leo, would you like to say a few words? And I will ask members who have questions.'",
        "'speaker_2': 'Thank you, Mr. Chair.'",
        "'speaker_0': 'Look for the red light there, and it's sometimes hidden. There you go.'",
        "'speaker_3': 'All right. Thank you, Mr. Chair. For the record, Leo Flor from the Department of Community and Human Services. And first, just to acknowledge and thank the Executive and the Council for the honor of consideration to perform a role on a team that does some of, I think, our region's most critical work, serving some of the residents in'",
        "'speaker_3': 'our region that have the least access to opportunity. And so it's just an honor and a privilege to be able to work with the team that I know does fantastic work within the Department of Community and Human Services and in a region that has really strong support for this type of work to support our residents.'",
        "'speaker_0': 'Excellent. Thank you very much for your willingness to serve council members on the panel. Do you have questions? Comments? Councilmember Lambert, then Councilmember Gossett and Councilmember Cole Wells.'",
        "'speaker_1': 'Thank you. I just want to say that I am very excited to have this opportunity to vote for Leo today, and I'm very thankful for the leadership he's already shown during his previous position, but also during the transition time.'",
        "'speaker_1': 'I have seen him in his previous position and do community participation meetings and did a fabulous job on that. And there are many, many people with many ideas at these community participation meetings and he was able to make sure everybody was heard and then recapped so that people knew that they were heard.'",
        "'speaker_1': 'And that was great. Seeing him have the ability to keep lots of items, programs, systems in his mind. As you said, this is a very large agency with lots and lots of things happening. But in addition to those things, he's innovative.'",
        "'speaker_1': 'And when ideas come up and ways to serve people, they are different because we have to look at more innovative ways of getting to people in various different parts of this county and with different needs. He's open to innovation.'",
        "'speaker_1': 'He motivates his employees and encourages them. He's well-organized, and for all those reasons and more, he's a pleasure to work with. So I'm looking forward to having you permanently in this position. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you. Councilmember Lambert, Councilmember Gossett, good morning.'",
        "'speaker_2': 'Good morning, Mr. Chair. Good morning, Leo. What specifically was your job at the Northwest Justice Project during the nearly two and a half year period you worked there. I can't hear you.'",
        "'speaker_3': 'Thank you, Councilmember. It was not at my job at Northwest Justice Project. After nine years, I was a staff attorney and Equal Justice Works fellow. So I represented incarcerated or justice involved veterans providing free civil legal assistance either in place within a jail or prison or for folks who were actually defendants within our local treatment courts here'",
        "'speaker_3': '. So the King County Mental Health Court has a veterans court component and also the Seattle Veterans Treatment Court. And the substance of that work primarily was going to veterans who did not have access in their criminal process to civil assistance.'",
        "'speaker_3': 'The actual types of cases tended to be public benefits, debt relief, and then housing stability cases. And the idea that animated all of that, which is something that I look forward to carrying forward into this work, is that the systems that we often operate as silos actually work better for the people within them when we figure out'",
        "'speaker_3': 'ways to connect and combine them. And so in that case, it was the ability to go into a prison, for example, and help with benefits access so that as a veteran was going to be released into the community, they didn't have this 30 day or in some cases 30 month lapse where their benefits were not on and'",
        "'speaker_3': 'they weren't able to fully reintegrate into their communities.'",
        "'speaker_2': 'So advocate legal advocacy as well as broader kinds of access and advocacy for veterans that are incarcerated or face an incarceration.'",
        "'speaker_3': 'And the primary duty certainly was representation of individual clients. Northwest Justice Project as a Legal Services Corporation funded entity actually has limitations against advocacy, in particular word, but certainly an ability to help, educate and help the broader system understand the role of legal aid for those particular clients.'",
        "'speaker_2': 'Okay. The number of programs. Ours and your department are very broad. Many of them are complex, and it's hundreds of millions of dollars. So I would like to ask you, what is your perspective on evaluations, particularly performance evaluations, where your aim is to ascertain how effective a program is and how well people were served and whether or'",
        "'speaker_2': 'not people are better off. In terms of your prioritization of your duties, where does that leave in terms of importance?'",
        "'speaker_3': 'Thank you, Councilmember. So first, my brief response. Evaluation is critical, and performance management and management are critical. We do distinguish between the two, but both of those have a role to play in the way that we design, implement and then refine, importantly, the programs.'",
        "'speaker_3': 'As you mention, Councilmember, there is both a large amount in terms of the amount of resources for which DHS is responsible. There's also a tremendous variety, and a lot of those sources are actually sources that are subject either to regular approval by some sort of other government or granting entity or the public itself.'",
        "'speaker_3': 'And so to answer the question in another way, Councilmember, I think our ability to understand where we are succeeding, to understand where we need to do better, and then to actually demonstrate how we are doing better is critical to making sure that both other entities that might provide funding and then the public continues to have confidence in'",
        "'speaker_3': 'that. Confidence grows in our ability to handle what is what is objectively a large amount of resource. And really all of that goes to what I think is a sort of core principle of a government, which is that we must be credible when we say that we are doing something well, I think that we must be credible'",
        "'speaker_3': 'when we say that we need to fix something. I think we must be credible when we say, you know, that this is why we believe a particular resource is warranted for a particular project of the faith of the public, I think is important.'",
        "'speaker_3': 'The third part that I would add in terms of evaluation and performance measurement, this is a place where I think we can move further towards is that we have very often evaluated in the context of how we, the government, might see ourselves.'",
        "'speaker_3': 'But I think embedded within your question, Councilmember, is the idea that the government often is not even the primary audience for the services that a department like DHS provides. In fact, I think that's the residents that we serve.'",
        "'speaker_3': 'And so one of the exciting things that has taken hold within the department and I look forward to moving further towards is this idea that we can ask the people we serve very directly how they think we are doing.'",
        "'speaker_3': 'We have some guidance within the recently passed budget that will allow us a formal opportunity to do that. But this idea of engaging the community, not just as we plan, but as we evaluate and then refine our programs, I think is something that is an important sort of state of the art approach within Human Services, and I'",
        "'speaker_3': 'look forward to implementing that.'",
        "'speaker_2': 'And then the chair my last question, at this time, at least earlier and 2018, I think the beginning of the year, we had the our audit staff do an audit of the evaluation activities of be ask that starts for kids.'",
        "'speaker_2': 'And that's one concern that we have is that the audit findings, whether they be internal or external audits, go to the person in your position and the person at the head of public health rather than directly to the executive and the legislative branch.'",
        "'speaker_2': 'I don't know if that has changed or not, but I would like to know what your position is in terms of where either internal final reports or external final reports for audit, who are the first to be submitted to?'",
        "'speaker_3': 'Thank you, Councilmember. I'm not familiar with the protocols of the auditor in terms of who has entitlement. The first notice, what I can say from the department's perspective is that any audit finding is one public information into a really clearly articulated opportunity for us to do something better.'",
        "'speaker_3': 'And I don't think that there's any profit in in hiding or concealing that. And this gets to the idea of credibility, again, I think, for DHS to continuing to grow into further credibility as a as a government entity, folks need to know and have confidence in the fact that we share the good news and the bad news'",
        "'speaker_3': 'and then a plan to do so. Something about the bad news. That's our duty as public servants. I don't know the answer to your specific question, council member Ed. The auditors protocol. That's certainly how I would approach it, though, is that we share these opportunities to improve and that we do something about them.'",
        "'speaker_2': 'All right. Thank you, Mr. Chair.'",
        "'speaker_1': 'Thank you, Mr. Chair. Leo, first of all, congratulations on the appointment. Reviewing your background materials. You really are a superb candidate for this position. And I echo what Councilmember Lambert said in her remarks, which I thought were very poignant and very well stated.'",
        "'speaker_1': 'Some might say that you were only having been working with Department of Community Human Services for two shy of three years, that it's really been a meteoric rise for you in the department. That in looking back at your background and I believe you might, you've always struck me as being very modest in what you present for yourself'",
        "'speaker_1': '. But I note that when you completed your military service, which was in combat, it's where a platoon leader second and first lieutenant ending an eight year career, I believe, as the captain in the U.S. Army. Much of that in the combat zones, I'm sure taught you a lot about leadership.'",
        "'speaker_1': 'But then when you came back, really left the military, you went on to get a law degree at the University of Washington, where Gates public service law scholar, a trained mediator and commencement speaker, which I think says a lot.'",
        "'speaker_1': 'But then you went on and two years later received a master's through the Department of Urban Planning and Design. So it seems like you're able to accomplish a lot in a short amount of time. And then as Councilmember Gossett brought out work for the Northwest Justice Project for three years, two and a half years, and now it's'",
        "'speaker_1': 'Department of Community and Human Services. I think you have an exceptional background and my experience and working with you for almost three years is she really take on the challenges and you perform them in exemplary ways and I think you again would make an outstanding director of the department.'",
        "'speaker_1': 'My question though is what motivated you to go into working with DC H.S.? I think you had a whole lot of opportunities most likely to take on many different challenges. But what led you to this public service now different from what you had done in the military?'",
        "'speaker_3': 'Thank you. Councilmember One is. We have a lot of work to do for people in our community, and I think that that's all of our responsibility. And that is just an ethos of of service, frankly, that I take no credit for myself.'",
        "'speaker_3': 'I you know, I derive that from my my parents. I'm lucky to have a spouse who shares my value of public service. But King County is a special place. In particular, we have the scope in terms of population and resources.'",
        "'speaker_3': 'We have the size to make a difference. We have the values as a community to invest in this type of support for our residents and continue to do better. And that's not a confluence of opportunity, frankly, to do good work that exists in most parts of this country or this world, I think.'",
        "'speaker_3': 'And so there's very much a sense of the unique opportunity within King County to net to knit all of those factors together and I think really lead in our ability to do better. I have a fundamental belief that government has a role to play in improving the lives of residents, and this is just a special place to'",
        "'speaker_3': 'do that. So I had some exposure as a legal aid attorney to the levy, as a levy funded organization at Northwest Justice Project, and began to saw the potential to see the potential there. And then when the opportunity to work with the better institution, Human Services Levy, which I think is a perfect embodiment of this combination of'",
        "'speaker_3': 'scale, public buy in and sort of focused assistance for residents who really do merit it. That was an opportunity in that and that worked out and I couldn't be happier with the choice.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Belushi.'",
        "'speaker_1': 'Thank you, Mr. Chair. You just said something that made me think of one of the things that I found to be outstanding about your service on that Seniors and Human Service. And the interactions we've had is this concept of continually striving to do better and to do more.'",
        "'speaker_1': 'It's something, you know, just this past weekend, we were celebrating the service of deputy executive Fred Jarrett on his retirement. And it's something that he really beat the drum for throughout King County. When I was in the executive branch about the idea that we want to strive for excellence, we want to provide excellent service, I think we'",
        "'speaker_1': 'do in many ways provide excellent service. But you also have to be willing to be open to self-criticism and critique and to continually improve and not feel that that's a problem, that that's actually an opportunity and something that we and I think that you've been body bad in a lot of ways in what you do.'",
        "'speaker_1': 'So I wonder if you would talk a little bit about your theory of change or excellence or how do you how do you how do you take what you have seemingly kind of naturally and imbue it in an organization that you're going to now be charged with bringing along with you?'",
        "'speaker_3': 'Thank you, Councilmember. I do think just leadership generally. I mean, the most potent tool any leader has is example. And so the first thing, if you want an organization that's willing to hear honestly and critically how it can be better, you have to do that yourself.'",
        "'speaker_3': 'And a thing that I think is not always the stereotype of the military, but you learn very quickly in the military is that the stakes and the relationships are such that there's no time for pretense of self-importance. You really do have to open yourself up and be vulnerable in a way to not only saying, yes, I'm in'",
        "'speaker_3': 'charge in a formal way, but also we're going to do this together because we can only do this together. And your faith in me is actually dependent upon my ability to show you that I'm going to listen to what you have to say.'",
        "'speaker_3': 'So so I think example is the most powerful tool that that I have as a member of the DHS team in in sort of cultivating that ethos that you described. The other piece is when we do actually receive as an organization criticism, we have this critical moment where we either do what we said we would do in'",
        "'speaker_3': 'terms of receiving that and then converting it into a plan to do better or we fail to do that. And one of my jobs is to really be on alert and to seek out those opportunities to receive frank and candid criticism and not go directly into self defense mode, but to really say, you know, thank you, we'",
        "'speaker_3': 'are going to take that and identify from what you just said, what we can do better, and then come back to you with a plan. And I think the difference between those two reactions not that we don't also accentuate where we have succeeded and make sure that our employees understand that we we have faith in what they'",
        "'speaker_3': 'do. But the sequence of the message is really important. And I think that the first reaction for public servants should always be, I'm hearing you to understand what you're saying. I'm not hearing to respond to you. And even if that means it's going to take a little bit of time for me to come back to you with'",
        "'speaker_3': 'what I intend or what we intend to do to do differently and do better. I just need to make sure that you feel heard and so that it's a little squishy in some ways. But I think it's sort of fundamentally important.'",
        "'speaker_1': 'I think it's I think it's one of the most important things that the leader brings. I mean, knowledge of your subject matter is important. And the ability to manage people and be diligent and be responsive is all critical.'",
        "'speaker_1': 'But that fundamental orientation towards the job, I think, is you can't substitute for it. And and I want to just echo your point. Sometimes criticism is founded in a misunderstanding of the facts, right? Sometimes people are complaining because they don't understand or they have wrong information.'",
        "'speaker_1': 'But that's still something that you have to respond to. That's still something that that still tells you that there's a challenge in the organization that needs to be responded to, which is that there's wrong information out there and how do you deal with that?'",
        "'speaker_1': 'And so I think that orientation of I'm taking this on board in sincerity and then finding out what's happening and doing what what's indicated to address it is, is it's really it's a great success factor. And I think you have it.'",
        "'speaker_1': 'And I appreciate the way you have always approached us as council members with your work in the past, and I know that you'll bring that to this job. So congratulations. I'm really pleased to see this kind of forward thinking.'",
        "'speaker_3': 'Council Member Thank you, Mr. Chair. Mr. Floor, I want to underscore some of the conversation that Councilmember Balducci just had with you about leadership and. Use this as examples. My work with you. Your work with me that I have seen you respond to my questions and those of my colleagues hearing the question and the intent behind it'",
        "'speaker_3': 'and not responding with defensiveness for you personally for the department in ways that. And I'm projects that had a lot of attention a lot of emotion at the time. And I've seen you respond coolly and to the question that either was asked or was intended and clarify the intent and give really strong answers and have appreciated that'",
        "'speaker_3': 'ability and leadership. And leadership by example. And you and I spoke up in my office last week when we had the chance to visit. I look forward to working with you in some instances when the department is maybe hamstrung or confined by the council or by other forces in or outside of the county to be able to'",
        "'speaker_3': 'provide the service that we need to people, vulnerable people in our communities without obstruction. And to the degree that I and the Council can work with you to remove those obstructions and be more effective. Please give us every opportunity to do so.'",
        "'speaker_3': 'I passionately want to work with you to do that. Like a council member.'",
        "'speaker_0': 'Hey. Anybody else? Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you. Thank you, Mr. Chair. They are a proud, pragmatic business here. What do you see as the major challenges for the department in the coming year?'",
        "'speaker_3': 'Thank you, Councilmember. I do think that one of the the large scale challenges, opportunities that that DHS has before it. I think a good metaphor to borrow from transit is this last mile issue. Particularly in King County, we do have robust human services systems.'",
        "'speaker_3': 'We have, you know, certainly not enough, but also large investments in many systems, including affordable housing, homelessness, crisis, behavioral health services for veterans, services for seniors, services for youth. But the way that those large systems connect and combine for particular people, I think in some ways is the art of management that DHS really has an opportunity to'",
        "'speaker_3': 'continue to get better at. And so what I mean by that is a specific example to have somebody within shelter, but then to be able in a way that is responsive to them as a customer, make a vet to make available behavioral health services, employment services opportunities to move into permanent supportive housing and to combine those in'",
        "'speaker_3': 'a way that the person can actually realistically and meaningfully encounter those services. That is a last mile challenge or opportunity that we have before us and sort of a responsibility, I think, that we really have in making these large systems and investments with which we've been entrusted work for specific people.'",
        "'speaker_3': 'And embedded within that is that the access that different folks inside of our community have differs. And so there is certainly a equity in social justice. And I think important to be very clear about this, a race and ethnicity component to those abilities to access services that we should just be very clear eyed about, because I think'",
        "'speaker_3': 'that's going to understand the problem is the first step in being able to formulate a good solution. So I think those are two intertwined challenges that we have. And then the third, which also entwines, and that is that we do have considerable resources in King County and many of the resources are specific to particular purposes.'",
        "'speaker_3': 'So we do have special purpose revenue through the mid BSC, Veterans, Seniors and Human Services Levy, federal funds document, recording fees and all of those very appropriately are specified in purpose, either just to purpose, to time or to population or to combinations of those.'",
        "'speaker_3': 'And so our challenge is to take those diverse resources, but then knit them together in a way that is still meaningfully accessible. So again, it's this last mile issue for the particular people that we need to serve and then to be again clear eyed about who those particular people are.'",
        "'speaker_0': 'Councilmember Coe Wells And thank you, Leo, for your detailed answers to the committee's general questionnaire. Maybe by way of conclusion, I noticed on your curriculum vitae that you have your basic parachutist badge, meaning you jumped out of airplanes.'",
        "'speaker_0': 'And I wondered if there were any lessons learned in that training that you expect to apply for this job.'",
        "'speaker_3': 'It's. That's a good question. And, Mr. Chair, I think the one perhaps obvious, but when you get it wrong, you really get it wrong. Lesson that you learn with parachutes is that you better be ready before you jump out of the plane.'",
        "'speaker_3': 'If your parachute or your alternate chute are not secured, if you have not correctly hooked up to your static line, if you are not moving in concert with the person in front of you or behind you, the minute you put your knees in the breeze, as they say, and jet wash, it's bad things happen.'",
        "'speaker_3': 'And I think there is a completely applicable principle to that. One thing that might not be immediately clear to airborne operation that we're getting into something interesting about airborne operations in the Army is that that is not one parachutist leaving the plane.'",
        "'speaker_3': 'That is a plane full of people who have rehearsed and planned in intricate detail the way that they must all move together as an organism in order to successfully get everybody out of the plane to land on a DC and then accomplish the mission.'",
        "'speaker_3': 'And I think that's a perfect analogy for the level of preparation, but also the level of teamwork that we within DHS but then with our partners across the community, must strive for in order to be successful on some pretty difficult missions.'",
        "'speaker_1': 'Mr. Chair, I think we think if we did, I think we have the title of Leo's memoir, Knees in the Breeze.'",
        "'speaker_0': 'We did not practice that. It was spontaneous. I see. A new department director's award in the form of a little parachute, perhaps so little. Thank you for your great questions and service to the community in the county. Councilmember COLAs, would you be willing to put up?'",
        "'speaker_1': 'Yes. Thank you, Mr. Chair. I move the confirmation of the appointment of Will Floor as director of the King County Department of Community and Human Services.'",
        "'speaker_0': 'It's been moved and seconded that we move proposed motion 2018 0538 to confirm the appointment. Any final comments or questions? See any last market to call the role on that?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Bell City. Councilmember Dunn. Councilmember Gossett. Councilmember Colwell. Councilmember Lambert. Councilmember McDermott. Councilmember of the Grove. Councilmember one right there. Mr. Chair. Mr. Chair, the vote is ADA is no nos.'",
        "'speaker_0': 'Okay. We've given a unanimous do pass recommendation, will expedite that to Monday. And should we put that on consent or do folks. I think we put on consent. If someone wants to say a few more nice things about it, we can pull it off.'"
    ],
    "Confirmation of John Taylor as Director of Local Services.": [
        "'speaker_0': 'Thank you very much. I look forward to working with you. Thank you. Congratulations. Okay. We'll turn now to item 12, which is the second appointment on today's agenda with respect to department directors. And that is the appointment of John Taylor as the first ever director of the Department of Local Services.'",
        "'speaker_0': 'And we're joined by Aaron Osnes from our central staff to give a brief overview of this new department and position and by the nominee to face a similar grilling. Thanks for being here, John.'",
        "'speaker_1': 'Good morning. Aaron Osnos, council staff. The staff report for this item begins on page 127 of your packet. John Taylor's appointment to the Department of Vocal Services is the subject of this proposed motion. As the Chair mentioned, the Department Local Services will be a brand new department starting January 1st, 2019.'",
        "'speaker_1': 'It will be comprised of the former Department of Permitting and Environmental Review as the Permitting Division as well as the Roads Division and the Community Service Area Program. Mr. Taylor's resume and the questionnaire is in the packet, and that's all I'm going to say.'",
        "'speaker_0': 'All right. Terrific. Thank you very much, Aaron. John, would you like to say a few opening words?'",
        "'speaker_4': 'Yeah, but first I should turn that on. First off, I just like to thank the council and the executive for the opportunity to be here to be considered. I'd really like to just take a minute to acknowledge the work of Fred Jarrett, Deputy County executive Fred Jarrett and Harold Taniguchi, who did an enormous amount of work over'",
        "'speaker_4': 'a year to sort of frame out what this department would look like. I think they deserve an enormous amount of credit for getting us to this point. I'm very excited to take over. And then as a final point of privilege, I would just like to say it's kind of difficult to follow the floor.'",
        "'speaker_0': 'Yes. All right. Thank you very much, John. Let's turn to members questions and comments and start with one of our key leaders on this issue, Councilmember Lambert.'",
        "'speaker_1': 'Mr. Chair, well, this is a day that I am very excited about that we were at a point person and department for the local services of this county. And I know our executive has worked really hard the last couple of years to make our regional government follow in the line of his theme, the best run regional government'",
        "'speaker_1': '. And we've won awards nationally and now we have the opportunity to be launching the second half of our responsibilities to be also the best run local government. And the executive. And I have spoken about the idea that the same theme is one he wants here, and that is that to be the best friend, local government.'",
        "'speaker_1': 'And as Mr. Taylor just said, this is not an easy thing to have come. We've been talking about it for a decade and a half. And so I appreciate the work that Fred Jarrett did in laying out what are the services that we provide to the local government and how are they delivered and work quality?'",
        "'speaker_1': 'And we will continue to do that work. And then once Fred was finished with that work, although as you said earlier, Fred will be retiring, but hopefully not to too far away because of the expertize that he can help us with from his buying and lean experience.'",
        "'speaker_1': 'And also Harold Taniguchi, who has done an amazing job getting us through and doing some transitioning from the Department of Transportation, which will be one of the main components of this new unit. And Harold did a wonderful job, and I thank him very much for that work and our dinners where we discussed many, many, many topics.'",
        "'speaker_1': 'And then now we have done and I am very excited, John, I think with his background and his experience will be perfect for this job is known to the community. He has done good work and a lot. Part of what goes on in the anti-corporate area does deal with some of the work that he has done in'",
        "'speaker_1': 'the past. So he's already developed relationships. And, you know, it's no surprise that the local people are not very trusting of the government and they've already developed a relationship. So when we talked about the fact that it could be John early on, they were very excited because they knew him and they have developed trust.'",
        "'speaker_1': 'And yesterday there was a meeting talking about what are the goals of this unit and developing trust from our citizens and building the relationship is really important and I think John has a great running start with that is very thorough.'",
        "'speaker_1': 'When he says he's going to get something done, he gets it done and you can rely upon that is great teamwork. Did a great job last week on a radio show we did together. So he's out in the community, being out in the community and I think knows what it is because he has developed these relationships, what'",
        "'speaker_1': 'is lacking and what can we do better as a government? And his goals for helping to lead us into being the best run local government, I think are actually going to get us there. And he is wonderful and working with his team and motivating them.'",
        "'speaker_1': 'And there was a meeting yesterday and one of the things that I noted was everybody had a smile during the meeting. They were excited about what they were doing and participating and having excited employees to serve our people is really important.'",
        "'speaker_1': 'So I am overjoyed that we are here today, that this will launch January one and that I think he's ready with knees in the breeze to jump off into making this happen. And I'm very thankful to all the support from the executive branch and making this come together.'",
        "'speaker_1': 'And I think we've got the right person for the job.'",
        "'speaker_0': 'Thank you. Councilmember Lambert, co-sponsor of the motion and Councilmember Dutton.'",
        "'speaker_3': 'Thanks, Mr. Chair. Appreciate you bringing this forward. John, thanks for your willingness to serve. Appreciate it very much. I spent much of yesterday out in the field, out in my district. And as you know, I've got about 70,000 residents who live in unincorporated King County.'",
        "'speaker_3': 'And so they don't have a city council or mayor to represent them. They've got me and they've got the executive in terms of the legislative and executive functions. So it really does require an awful lot of work from the county to make sure that their services and there are two are properly attended to.'",
        "'speaker_3': 'I just wanted to say a couple words. First, to thank the executive for initiating this department. When I first ran back in the day for this office, I talked about a Department of Unincorporated Area Affairs is what I called it at the time, and I'm really glad to see it come to fruition.'",
        "'speaker_3': 'It was something that, you know, was based on the premise that, you know, we could be a more efficient the better would be better customer service if we were to unify a variety of functions. And I'm really glad to see that it got done.'",
        "'speaker_3': 'And so I want to thank Fred Jarrett for his involvement in this and moving it forward and then Harold taking that on and shepherding it over the last year. And it hasn't it hasn't been easy as he thought about how to bring all these functions, some of them unrelated together into one agency.'",
        "'speaker_3': 'And I guess that's the challenge, right? I mean, you know, when I was I worked in the legislative executive judicial branches of government and local, state and federal governments and various levels. And you always have this challenge of sort of I like to call it bureaucratic pushback.'",
        "'speaker_3': 'And that is, you know, sort of getting the agency more or less in line with the priorities of the civilian government, that is, the elected officials. And while, you know, clearly these all of these organizations that are within your department, you know, have statutory roles to play and have to follow, for example, the county code and in'",
        "'speaker_3': 'some cases enforce it. It's easy to forget. When you're in those departments that this government is paid for by the taxpayers and it is here to assist the taxpayers. And so the basic idea that all of us, when we go out to represent folks and help them, we are a customer service agency first, not a dictatorial group'",
        "'speaker_3': '. And and I think one of the challenges, you know, you're going to have is just to continue to remind folks that that is what our role and responsibilities are. That's what the public expects. That's what the elected leadership expect.'",
        "'speaker_3': 'And so I'm really glad that you're doing this job, and I'm really eager to support you. I love your your combination of both private sector and public sector experience, because I think that it's really important to see that.'",
        "'speaker_3': 'And it brings a different approach that not not all folks bring who have who are serving government roles. So just remember that even a strong supporter of the creation of this department, I'm cautiously optimistic in terms of whether it's going to work well and really, I think will come down to personalities and your ability to sort of'",
        "'speaker_3': 'manage the bureaucracy and relate and remember that, you know, there's a whole bunch of different government functions out there working to try and accomplish the same goal and that we're not communicating very well. And there's need to just hyper communicate.'",
        "'speaker_3': 'All the things that are going on are important too. So but I'm committed to helping you succeed in helping your department succeed. So whatever you can do to call on myself or my office, please let us know. Hey, John.'",
        "'speaker_3': 'Feel free to respond if you want. Or you can just take the vote and your call.'",
        "'speaker_4': 'You got the.'",
        "'speaker_0': 'Vote. You don't need to speak.'",
        "'speaker_4': 'If I. If I might, I wouldn't mind responding to that for 1/2. I think you put your finger on probably the biggest challenge of standing up this department, of getting this department to be up and running and be meaningful.'",
        "'speaker_4': 'And and it needs to be meaningful going both ways. It needs to be meaningful to the people who are partnering with us from within King County's government. As a director, I will have direct line control if I'm confirmed over the Road Services Division and the Department of Planning Environmental Review, which will become the permitting division.'",
        "'speaker_4': 'We will have what are called service partnership agreements with a bunch of other parts of the county that will draft with them for have been developed and will be finalized probably within the next week or two. And then we'll move forward with many, many more with many, many other parts of the county.'",
        "'speaker_4': 'The conversation I've been having with the folks who are within the Dallas director's office is there needs to be a value proposition for those departments to enter into these agreements and remain in these agreements over the long haul.'",
        "'speaker_4': 'What's in it for them? I think there's a lot of it in it for them. If we do a good job of engaging with the community and helping them navigate the community because the community isn't monolithic, just like government isn't monolithic, the community isn't monolithic.'",
        "'speaker_4': 'Fall city is very different from White Center is very different from Skyway is very different from his federal way. And each of those different communities have different needs and we can be a conduit to help departments understand what those different needs are.'",
        "'speaker_4': 'If we structure ourselves properly, if we craft the right agreements. I was remiss in my interview introductory remarks not to introduce my new deputy who started yesterday. Her name is Danielle de Klerk. She's right there. And Danielle comes to this position with an enormous amount of private sector experience working on lean and metrics and performance management, and'",
        "'speaker_4': 'is also just a wonderful person who will be really, I believe, adept at working with departments to craft agreements that help them do a better job and are measuring the right things in terms of performance. Because that's a lot of what this department is about is measuring performance and how we're serving the community.'",
        "'speaker_4': 'Not only so it's transparent to the community, but I think if you look at my questionnaire, the other big challenge we face as a department and as a unit of government in unincorporated King County is there is a structural financial problem that exists out there that we need to develop data to solve.'",
        "'speaker_4': 'We need to be able to make a case to decision makers that there is a structural inequity that needs to be addressed over the long haul, or else we will not be able to maintain our road system in seven years.'",
        "'speaker_4': 'So I'm I'm acutely aware of it and I really, really appreciate the offer of assistance. Councilmember.'",
        "'speaker_3': 'Thanks for that. And by the way, welcome. Look forward to working with you. I'm sure officers will interface all at the future. Yeah, I mean, on that point, thanks for your response. I totally agree. Like, for example, the unincorporated Area Roads Fund, right.'",
        "'speaker_3': 'We have through Annexations reduced the overall population of unincorporated King County, the group that pays into that unincorporated roads levy and only the group. And we've also matched the maximized our statutory ability under state law so that now with annexations and incorporations that far just goes down.'",
        "'speaker_3': 'And unless the state gives us additional tools to fix the problem, the roads are going to become. Further in disrepair over time. And this is one of the great challenges. I think I put it on the top five lifts along with the structural budget gap that faces county government.'",
        "'speaker_3': 'We will have to really, I think.'",
        "'speaker_4': 'Engage.'",
        "'speaker_3': 'In partnership with your office in some legislative acrobatics, so to speak, to get to a place where the legislature will give us the tools we need locally to try and solve that problem. And I will tell you, my friend, if you can help us solve that problem, you will put a monument on a park somewhere.'",
        "'speaker_3': 'John Taylor, look good. Look really good. But year.'",
        "'speaker_4': 'I took this.'",
        "'speaker_3': 'Job here, and that's it. But that's that's a huge one. And that is a huge one. And let's, let's, let's work on that together. And hopefully with the work of my colleagues, find some solutions to that problem because it isn't a Republican or Democrat issue, it's a mobility issue, an economy issue, jobs issue, family, family welfare issue'",
        "'speaker_3': '. So let's let's work for it. I'm excited for you, John. I look forward to working with you.'",
        "'speaker_4': 'I'm excited as well. But I would say that Leo's metaphor of jumping out of a plane spoke to me as I waited. My turn up here.'",
        "'speaker_3': 'Was a jump out of.'",
        "'speaker_1': 'Oh. Okay. Thank you, Mr. Chair. Sorry, I'm struggling with the microphone this morning. Yeah. I want to echo a few things first and say thank you to the executive and to Deputy County executive Jared and to Harold, who was also retiring at the end of an era here at King County, because this was a pretty bold vision'",
        "'speaker_1': '. I mean, this is a there's no guarantees here that this approach would be a success and it's going to set up expectations in the community, but it's the right thing to do. I really appreciated the deliberate approach of building out the plan, doing a lot of detailed inquiry and research before making a proposal, and then but yet'",
        "'speaker_1': 'sticking with the commitment to deliver this department by the beginning of 2019, which is exactly what we're doing. So congratulations and thank you to the executive branch for that's a promise made, a promise kept. So that's I'm really pleased with that.'",
        "'speaker_1': 'You know, your challenge, you've outlined it. It's you know, I come I look at what you're doing from the eyes of somebody who's been a city elected official. So we provide all the basic services in the city. We respond to constituents needs and requests.'",
        "'speaker_1': 'We have got all four prongs of the funding structure in place, you know, with multiple tax sources and fee sources and utility taxes and many of the things that you won't have. And it's still a pretty compact thing, although there are distinct neighborhoods and distinct needs and has tends to have some geographical, you know, coherence to it'",
        "'speaker_1': '. And so yeah, following up on the airborne metaphor may be hard to go after. Leo, but you're the profile and courage sitting right there because you're starting with something completely new that's never been done before. And with this incredibly diverse set of constituent constituent interests that you have to model and the, you know, sort of routine tension'",
        "'speaker_1': 'in government between being a service provider first and foremost, but also a regulatory body. And that's that's a line that has to be walked as well. So I want to give you a little bit more of an opportunity to talk about as you enter into this, what are the sort of like leadership principles that you bring that'",
        "'speaker_1': 'you are going to try to view your agency with to try to meet these very significant challenges, but but also make the best of the opportunity to maybe do something really special here.'",
        "'speaker_4': 'Thanks for that and thanks for the opportunity. I mean, I think the your metaphor is the metaphor I've been using a lot. When I go out and talk about this, what we really want to do is create a city government for the 250,000 people who live in unincorporated King County.'",
        "'speaker_4': 'That is not what they have right now. And in fact, in many cases, I was at a meeting last night talking about an issue and it engaged King County and engaged Washington State Department of Fish and Wildlife and engage the sheriff's office and engaged one other federal agency.'",
        "'speaker_4': 'And it engaged Water and Lands Resources Division. So it we have a diffuse set of services that we're delivering out there and that we somehow need to knit into a whole that's coherent for the people who live out there.'",
        "'speaker_4': 'Because just as I said before, the community isn't monolithic to the public, to the community, government is monolithic. The people who live in the unincorporated, during my experience, don't make distinctions between those units of government. So I think that one of the things we're trying to build is a really robust coordination shop within the director's office that'",
        "'speaker_4': 'is going to be flexible, is going to be listening to the community, but is also going to be talking to all of these different government agencies. And the way that we're talking to the people within the King County Executive Branch and some of the separately elected who will have to enter into service partnership agreements with is trying'",
        "'speaker_4': 'to approach that in a really thoughtful and open way. As I said, the Service Partnership Agreements won't work if there isn't a value proposition for the people who are entering. And if they just view them as something that is an annoyance and that we're gathering data that we then go out to the community with and sort of'",
        "'speaker_4': 'use to make them feel uncomfortable and that they're not serving the community well. That isn't going to work very well. So there needs to be a value proposition for the people who are entering into those agreements, and we need to be communicating with them in a really clear and coherent way and be viewed as a partner.'",
        "'speaker_4': 'That's kind of why I took this job. That's what I want to bring to it, sort of just generally, I take a moment to talk about my approach to leadership leading an organization that's a large organization, not by by no means the largest organization within this county, no by no means the largest department.'",
        "'speaker_4': 'But about 485 people. All told, the first thing I would just like to say is I'm really lucky. I'm taking over two great departments and we have amazing employees and I've been lucky to have worked in the private sector quite a bit, and I've worked in government at a number of different levels of government from state government'",
        "'speaker_4': 'down to cities. And I would say that. King. The county has some of the best employees I have ever worked with. That was true in water and lands. That's true for the road services division. If really dedicated employees, there were people out last night in the middle of the night putting down salt on highways and roads in'",
        "'speaker_4': 'this county because we had fog and really cold temperatures. So you've got a 24 seven roads division that is out there working for people all the time. No one ever even sees them because most of the time they're working in the middle of the night.'",
        "'speaker_4': 'So people don't get into accidents. They just say, you know, one of the biggest assets we have is our employees and we have great employees and King County, in terms of how I approach running this department. There's sort of three things you need to create a vision.'",
        "'speaker_4': 'You need to give people the tools to do the work. And then you need to hold people accountable and you hold people accountable through metrics in terms of the vision. We're right now building, I think, a really strong vision for what we want to do.'",
        "'speaker_4': 'Councilmember Lambert sat in on a meeting yesterday with communication staff from across the county, some government relations and community relations staff. Some of your staff were there. We invited all of the staff from all of the unincorporated area council offices because we want to partner with you as we move forward on this and are trying to lay'",
        "'speaker_4': 'out a really ambitious vision for what this department means. And I think we're we're we're being successful in doing that. We'll be rolling it out after the first of the year. In terms of the resources, I want to thank the council because you funded pretty much everything that was in the executive's proposed budget to stand up this'",
        "'speaker_4': 'department. And if you hadn't done that, it would have made this much more challenging. And so I just want to I want to thank you and I want to thank the executive for being very thoughtful about and and Fred and Harold and how they framed out the budget and in terms of holding people accountable.'",
        "'speaker_4': 'That's why Danielle is here. Danielle is going to be the person who builds the metric systems that we're going to be using for the service partnership agreements and for the two departments, the two divisions that are part of this department.'",
        "'speaker_4': 'And we'll be coming back to you and will be reporting out on how we're making progress on the targets that we've set for delivering services in the unincorporated area and how we're doing in teasing apart some of those big regional services where it's not clear what's in the unincorporated area and what's in the rest of the county'",
        "'speaker_1': '. Thank you. And just a closing comment I was noting on the website the other day, the District three, Councilmember Lambert's district and District nine Councilmember Megan Dunn's district take up two pages on the website to look at a map of the entire district.'",
        "'speaker_1': 'And so I don't want to compare in any way, but in my district, I've got two precincts that are unincorporated King County. They happen to both be on the floor of the sammamish agricultural valley population in the low three digits, if that.'",
        "'speaker_1': 'But those people deserve a local government as well and deserve to have access to all the services that anybody who lives inside the city, which is the rest of my constituents do. So I'm really supportive of your of your mission.'",
        "'speaker_1': 'And I want to add my voice to my colleagues that we're going to work to be supportive of making this a success as well. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Belushi, over Councilmember Gossett, Councilmember Coles and Councilor McDermott.'",
        "'speaker_2': 'Thank you, Mr. Chair. When you mentioned that there are 250,000 people in unincorporated King County, were you including those that live and how they urbanize areas like Skyway and White Center?'",
        "'speaker_4': 'Yes. Yeah, absolutely.'",
        "'speaker_2': 'Okay. The there's well, I've been told that there is a historic challenge between serving those who live in urban King County versus a rural, unincorporated King County, urban, unincorporated or unincorporated. And I think for 15 or 20 years, I've been telling you and I'm the sole member to represent Skyway now.'",
        "'speaker_2': 'I said, Well, our policy is that there is no way that King County could possibly, given our resource base, provide all the urban services that you all in this highly urbanized community need fire, police, roads, economic development. So we encourage you to vote to either an accent to Seattle, Renton or somewhere else.'",
        "'speaker_2': 'So I kind of see a disconnect and telling all the people in unincorporated area that you deserve a high level of services and we're going to provide it because we're not able to provide it. My question to you is, do you see that dichotomy or have you thought about it?'",
        "'speaker_2': 'Or do you think we as the new director of a department that we have in our city now today are just with those who live in unincorporated King County, said we review our attitude and perspective and policy relates to the urban unincorporated folks.'",
        "'speaker_2': 'What are your thoughts?'",
        "'speaker_4': 'I think that we do a an equally not great job of serving everyone who's in unincorporated King County. I think that we serve people, but we serve them in a very diffuse and not well coordinated way. And I think the goal of this is to serve everybody, both urban and rural, in a more coordinated way.'",
        "'speaker_4': 'Just generally to your question, there absolutely is a dichotomy between the rural area and the urban unincorporated area, and the needs are very, very different. And I think that your point is a good one, which is it would be disingenuous if we go out to the community and say that the creation of the Department of Local Services'",
        "'speaker_4': 'is going to solve all of your problems, and suddenly there's going to be sheriff's deputies and all kinds of services for people in the urban, unincorporated area. And I think that's the intent. But the intent is to do a much better job of identifying the needs and trying to match whatever resources we have with the needs in'",
        "'speaker_4': 'the community. A big part of the conversation yesterday and your staff participated in that meeting was to talk about how we conduct outreach to the urban unincorporated area. Because being candid, I don't think we have done a very good job through the community service area program of really reaching the larger community.'",
        "'speaker_4': 'We get very comfortable talking to a couple of groups and that's who we talk to. And I think we need to broaden that net and we need to be listening to a lot more of the community and identifying needs in a much more thoughtful way.'",
        "'speaker_4': 'The Department of Local Services isn't really a service provider. We don't have sheriffs, we don't have firetrucks, we don't have EMS. We're really a conduit for information to people who do have those things. And my hope is that if we do a really good job of acting as that conduit, we can help the sheriff's office or other'",
        "'speaker_4': 'separately elected to think about how they serve that community and hopefully bring more resources to the table. The other thing that I would point out to your council councilmember is you funded an economic development position in this budget, and that economic development position is going to be focused really on the urban unincorporated areas, which are primarily Skyway'",
        "'speaker_4': 'and West Hill, I mean, Skyway and Wade Center, but also falsity, because we can really change the fortunes of those areas if we have a cohesive plan for how we're going to approach them. So if you marry the sub area planners that you authorized in this budget and we develop community plans that reflect what the community wants'",
        "'speaker_4': 'and we. Bringing economic development resources to bear. In a thoughtful way, we can change what those communities look like and we can increase the tax base. And those won't deliver services in and of themselves. But economic development changes how communities feel and they make them better for the people that live there.'",
        "'speaker_4': 'Absolutely. I've seen that play out in the number of different positions I've held in my career.'",
        "'speaker_2': 'And finally, Mr. Chair, I have one other question that kind of related to economic development. When you were introduced earlier, it said that Mr. Taylor also has private sector policy experience. And I want to do you to articulate what that experience is or half bad.'",
        "'speaker_2': 'And then you, during the course of your presentation, introduce to us Danielle, your deputy. And you said that she has a lot of private sector experience. So I'm trying to figure out what it's going to be, their relationship.'",
        "'speaker_2': 'And you just mentioned economic development. What is the relationship between the private sector and what you're going to be trying to do and the Department of Local Services? What's the intersectionality between those two?'",
        "'speaker_4': 'Let me just start answering that question by making a quick observation, which is, I don't think that private sector experience in government gives you magical powers or is somehow, you know, a panacea for all problems. The private sector is the private sector.'",
        "'speaker_4': 'Government is government. There are very different entities. There are skill sets that you pick up when you work in the private sector that are transferable to government and can actually improve service. But it isn't you know, they have very different missions.'",
        "'speaker_4': 'I mean, businesses exist to make profit. Government exists to provide services to people. So very, very different missions. But there are skill sets that people bring over that can actually help us do a better job of delivering services to residents.'",
        "'speaker_4': 'So my private sector background is I spent about four years working for a start up solid waste company called Clean Scapes. It's kind of a unique animal in the solid waste industry. It was started by a guy named Chris Martin who had a little graffiti removal operation in Pioneer Square, and he did not like how Pioneer Square'",
        "'speaker_4': 'looked. So he championed something called dumpster free alleys, where he would pick up all the garbage in plastic bags and aggregate them in a dumpster. And in doing that, he got a little bit of solid waste experience. And the city of Seattle was unhappy with their solid waste collection contractor for half of the city, and they put'",
        "'speaker_4': 'the entire city out for bid. And Chris assembled a team of people, of which I was one of them. And I was at that time a consultant, a public affairs consultant, and did a lot of work with the Seattle City Council and the city government while we were working on that bid to figure out what kind of'",
        "'speaker_4': 'services the city wanted to see. And Clean Ships was successful in winning the solid waste contract for half of the city of Seattle, which is a fairly huge accomplishment when you're considering it. Before that, they had zero solid waste experience anyway.'",
        "'speaker_4': 'Also worked for Thanks Councilmember just also worked for as a private consultant and finally I had was my own consultant hung out a shingle for a little while and did an economic development strategy on Internet startups for the city of Seattle.'",
        "'speaker_4': 'Danielle's background I don't know it verbatim. She worked with me clean skates. She also worked for Boston Consulting, which is one of the premier sort of business efficiency consulting enterprises in the world. And and I think the skill sets we both bring are sort of very rigorous thought around metrics and how you measure performance.'",
        "'speaker_2': 'Thank you. Thank you, Mr. Taylor. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you. Councilmember Coles. And then Councilmember Lambert to wrap up.'",
        "'speaker_1': 'Thank you, Mr. Chair. First of all, congratulations, John, on your appointment. Although I do not have any unincorporated land in my district, I do recognize the compelling need for establishing this new department and think it very likely could be very helpful to our residents across the county who are living in unincorporated areas.'",
        "'speaker_1': 'And I also in listening to your testimony today, I am very impressed with you and also with your background. You bring to this new position. And I'm very eager to go home and tell my husband about you. I'm sure he will think you are extraordinary as he also was a graduate of Hobart College.'",
        "'speaker_4': 'And give him my number.'",
        "'speaker_0': 'All right. Councilmember Lambert, to conclude.'",
        "'speaker_1': 'Thank you, Mr. Chair. So a couple of comments I want to make. First of all, this is a bold vision, but it's the right vision. And in your comments, you said that it would be like sitting at the city hall.'",
        "'speaker_1': 'Imagine any of your cities and your citizens not having a city hall where they know they can go to get help. Government's big and it's hard to navigate. And if you didn't have a city hall, you wouldn't really know how to make the services happen for you.'",
        "'speaker_1': 'And so it's really important. And I think I think it's vital to keeping this county unified and people feeling like they are treated fairly like everybody else. The Service Partnership Agreements are going to be really important that in each of the CSA zones there's seven, right?'",
        "'speaker_1': 'And in each of the zones across the county, that's a very large county, people have different needs. And being able to say to the people, what are your needs? And then trying to tailor the services that we offer.'",
        "'speaker_1': 'It's sort of like going in to a group and saying, okay, you're all going to get a new outfit and it's all going to be size 16. Well, for some people, that'll be great. For other people, that won't be great.'",
        "'speaker_1': 'So looking to see, you know, what is the size of the services and what is the different services that people need in each area is going to be very important. And then for the providers in our different agencies to know that they really are making what people want.'",
        "'speaker_1': 'And you know, the intent is for the basic services to be covered. And currently the CSA is meet only once a year. So. The rural areas have some unique problems in that. Some are urban and some are below the urban areas.'",
        "'speaker_1': 'We have tried to annex now for more than a decade, actually probably closer to 20 years. The ones that remain are ones that the cities either don't want or that there are aspects about those areas that aren't in good enough condition for the cities to take on because there are costs.'",
        "'speaker_1': 'And so we need to know what those are so we can prepare the 5% of the unincorporated area that could be annexed so that the cities will take them. There is about 6% of the land in King County that can never by law be annexed.'",
        "'speaker_1': 'There will always be our local government and I think they like everybody else. But 5 to 6%. And right now, the county unincorporated area, both urban and rural, is 11.25% of this county. So when over one in ten people, one in 11 people in this county have no city hall, and yet they, like everybody else, have to'",
        "'speaker_1': 'navigate government. And for those that will always be part of us, we need to make sure that the 3% of the revenue that is generated in the unincorporated area is not enough. So the challenge before us is, as Councilmember Dunn said earlier and Dwight Daley said two weeks ago, in year seven, there will be $0 for road'",
        "'speaker_1': 'capital budget. That cannot happen. No city can function with $0 in any category that is important, like road capital construction. So looking at what are we going to do? And we don't have a whole lot of time anymore because we know the cliff is coming in seven years.'",
        "'speaker_1': 'So we have to figure out how are we going to be sustainable. And that is why the economic development person is going to be so important. And then we as accounts are going to have to make really hard decisions and how we're going to deal with that.'",
        "'speaker_1': 'And so I'm really excited that we're going to have a team of experts who are going to help us with that. And I'm very excited that we were we are launching the new government unit. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you. Councilmember Lambert is the prime sponsor. Would you like to put the motion before us?'",
        "'speaker_1': 'I would love to do that. Thank you, Mr. Chair. I like to move proposed ordinance and some of the papers in front of me. What is the ordinance? Number six?'",
        "'speaker_0': 'It's a motion, and it's.'",
        "'speaker_1': 'Right here at the bottom. I'd like to be a proponent of the ordinance number. No, no, I don't have anything to be sorry. Yes, it is preferment. I'm sorry. Proposed motion 2018 0558 with a do pass recommendation.'",
        "'speaker_0': 'All right, call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Bell, Dutchie. Councilmember Dunn, Councilmember Gossett. Hi. Councilmember Colwell. Hi. Councilmember Lambert. Councilmember McDermott. Councilmember of the Grove. Councilmember one right there. Mr. Chair. Right, Mr. Chair, the vote is eight A's, no no's.'",
        "'speaker_0': 'All right. We've given you the items to pass. Recommendation will expedite that, put it on consent. Congratulations, John. Thank you for your willingness to serve. Looking forward to working with you and Harold. You know, boy, thank you for being here.'",
        "'speaker_0': 'And we'll look forward to celebrating your long service with King County. And I know you've got a party coming up. What's the date of that Thursday and what time? 430. So if you're able to join Harold at his party at 430.'",
        "'speaker_0': 'So we appreciate your your service and thanks for your. Our last item on the agenda today is our legislative agenda for the 2019 state legislature. We're joined by Mac Nicholson to give us an overview. April Putney is also here, our partner on these issues.'"
    ]
}