{
    "Appointment of Vivian Phillips to 4Culture Board.": [
        "'speaker_0': 'Thank you. The March 4th minutes would be for a C, no discussion. All those in favor, please say I opposed. Nay, the ayes have it. The minutes are approved. Takes takes us to items five and six, two appointments to the for culture board.'",
        "'speaker_0': 'Last year, the Council adopted an ordinance that made changes to the oversight for culture, the county's cultural development authority. One of those changes was to have the have Kane County Council members directly point nine of the 15 board members with the council confirming those appointments.'",
        "'speaker_0': 'Two of the council members nominated for culture board members are here today for consideration of their confirmations. The first is Vivian Phillips, who was nominated by Councilmember Larry Gossett. Leah Cockles, up from our central staff, provided a brief staff report on the appointment, and then I'll ask Councilmember Goss if he'd like to introduce the item.'",
        "'speaker_0': 'And I'm here from as Phillips.'",
        "'speaker_1': 'Good afternoon, Council members. The materials begin on page one of your packet and just a little background for culture is King County's Cultural Development Authority, created in 2002 to administer King County's arts and heritage programs. And the For Culture Board is governed for culture is governed by a 15 member board of directors.'",
        "'speaker_1': 'Directors, according to their culture charter, are to have a demonstrated commitment to and knowledge of cultural resources, be active and experienced in community and civic issues and concerns, and have the ability to evaluate the needs of the cultural constituent constituencies of the region as a whole, directors are to represent a range of talents, experiences, backgrounds and viewpoints'",
        "'speaker_1': 'related to cultural development. And directors must be residents of King County and are chosen to reflect the geographic and cultural diversity of the county. Last year, the Council made some changes to the board culture board appointment process, and nine of the 15 positions are now directly appointed by Council County Council members.'",
        "'speaker_1': 'Appointments must be confirmed by the Council by Motion Board members as four Culture Board members serve four terms of three years and may serve up to two consecutive full terms and now move on to board appointee Vivian Phillips.'",
        "'speaker_1': 'She lives in Seattle in Council District two and was appointed by Councilmember Larry Gossett. Mr. Phillips is a strategic advisor and consultant serving clients in arts, culture and communications fields. Additionally, she has served as director of marketing and communications for Seattle's largest performing arts organization, the Seattle Theater Group.'",
        "'speaker_1': 'She has co-founded an African-American theater lab, served as an adjunct professor for Seattle University's MFA Arts Leadership Program, independently produced theater productions and served on the Seattle Arts Commission. Mr. Phillips appointment appears to be consistent with the requirements of county code, the Fort Culture Charter and the bylaws.'",
        "'speaker_0': 'Thank you. Then invite Ms.. Phelps to join us.'",
        "'speaker_3': 'And Mr. Bryant.'",
        "'speaker_0': 'Carter and Mr. Carter, if you want to join us at the presentation table, welcome. I didn't realize Mr. Carter was coming to. I know Mr. Phillips well enough to know she could fend for herself.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'But I can't remember. Gosset, would you like to introduce?'",
        "'speaker_3': 'Yes, thank you, Mr. Chair. It gives me a great deal of pleasure and privilege to introduce to all of you who don't yet know her. Vivian Phillips has been more active in the cultural arena than just about anybody I know.'",
        "'speaker_3': 'She goes all the way back to the black arts west and central area where she was dynamic and a person who was involved as well as very supportive of black theater. I thought that our staff persons met in other big titles that she currently owns was good, but she is very rooted in the grassroots movement for our'",
        "'speaker_3': 'culture, involvement of African-Americans and other people of color, and just anybody who thinks they have the talents to be more active in a culture of various cultural arenas that are called to represent than just about anybody I know.'",
        "'speaker_3': 'And because of this training and experience, she's someone that will even challenge Councilmember Gossett when she thinks it's appropriate. So I kind of dig that. So what I want to do, what I want to do not turn to Brian, who I know knows Mr. Phillips.'",
        "'speaker_3': 'And he is currently the executive director of the for Culture Organization and its its board that I am recommending Vivian serve. So I'd like to give you an opportunity to mention briefly about the board and then what he thinks Vivian will bring to it.'",
        "'speaker_0': 'Thank you, Mr. Curry. Welcome. If you have any framing remarks for both the board in general and for culture, and Ms.. Phelps would welcome them.'",
        "'speaker_2': 'Just want to say hello to all the council members. Thank you for having me here today. And thank you specifically to Councilmember Gossett for nominating Vivian Phillips. I've known Vivian since it's been a while now. She was the emcee for the opening ceremony of the Northwest African-American Museum back in 2008, which is when I first became acquainted'",
        "'speaker_2': 'with her and was able to celebrate that momentous occasion together. And since then, I've seen her and her prolific career and, as you said, those large titles. But beyond that, I'm excited about her. Coming on the board for culture at this pivotal moment is we're an organization that's evolving, that's changing.'",
        "'speaker_2': 'It's really looking critically at where funds go and how they best support the culture and helping the entire county. And I think she has an experience across just myriad disciplines, different size organizations with such roots in community that it's somebody that I plan to rely on for their counsel, for their advice.'",
        "'speaker_2': 'And like you, I'm sure she'll call me out when need be as well. So I look forward to the talents, I think, and the experiences and perspectives that she brings to the Fore Culture Board. I think she'll be a valuable asset and I look forward to working with her.'",
        "'speaker_2': 'So thank you for that.'",
        "'speaker_0': 'Thank you. Good afternoon. Ms.. Phelps, some words in your own defense.'",
        "'speaker_1': 'Well, it.'",
        "'speaker_2': 'Seems everybody knows me.'",
        "'speaker_1': 'Pretty well.'",
        "'speaker_2': 'And I do.'",
        "'speaker_1': 'Want to say that the last time I was here, I.'",
        "'speaker_2': 'Think it was when I was working with Pete von Bauer back in the.'",
        "'speaker_1': 'Nineties to secure.'",
        "'speaker_2': 'Funding for the restoration of the Paramount Theater. So yeah.'",
        "'speaker_1': 'My career goes.'",
        "'speaker_2': 'Back quite a long.'",
        "'speaker_1': 'Ways. It is quite an.'",
        "'speaker_2': 'Exciting opportunity, I think, to be serving on the Fort Culture Board at this particular juncture, given the changes that are taking place across the region, both in the demographics of our region and in the arts and cultural complexion of our region and under the leadership of Brian.'",
        "'speaker_2': 'So I'm really excited.'",
        "'speaker_1': 'To have.'",
        "'speaker_2': 'An opportunity to be a part.'",
        "'speaker_1': 'Of.'",
        "'speaker_2': 'Not only uplifting the arts, but uplifting the arts as a part of our civic conversation, as it relates to the growth of the region, the changes of the region, and how arts and culture really is an important part, just like infrastructure and everything else.'",
        "'speaker_2': 'Without arts and culture, our region does not survive or succeed.'",
        "'speaker_1': 'So I'm excited and.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Questions from his Films Council. Councilmember Lambert.'",
        "'speaker_1': 'Thank you very much. It's good to see you and thank you. Thank you. Glad to hear that. Your involvement with theater labs and that we definitely need some of those out in the unincorporated areas to further east. I just wanted to say that we had a listening center of succession with the entire board.'",
        "'speaker_1': 'So that last week the task.'",
        "'speaker_2': 'The ordinance task force. Right. Yeah. Last weekend.'",
        "'speaker_1': 'Yeah. So I was really, really impressed with the broad array of people on the board with their ability to listen and actually their excitement about being out in the area of my district. Some of them hadn't been there in a very long time.'",
        "'speaker_1': 'And one of them told me afterwards that they felt so warm and comfortable there that they may move there. So it was an interesting opportunity to talk about the idea that we are all united and that the unincorporated area also needs to have more art.'",
        "'speaker_1': 'And so I really appreciated that. And thank you for spending the time that night. Thank you. Can I just. In response to that, you say that for probably the last 13 years, I've had.'",
        "'speaker_2': 'The opportunity to work with or culture on bringing.'",
        "'speaker_1': 'Stories.'",
        "'speaker_2': 'About arts and culture throughout the region of King.'",
        "'speaker_1': 'County to a viewing public through KTTV. And it has been the best thing.'",
        "'speaker_2': 'That's happened to me to get out to Carnation, to get to Snoqualmie.'",
        "'speaker_1': 'To get to these other areas.'",
        "'speaker_2': 'And really see the kind of work that's going on there, as opposed to just being in a bubble here in Seattle. So it's really exciting to have another opportunity to get back out into the county.'",
        "'speaker_0': 'To Councilmember Yvonne Rick Bower.'",
        "'speaker_2': 'Thank you, Mr. Chair. I want to thank Casper Gossett for his leadership in appointing someone who has been truly a leader in this community. We had a chance to work long hours on a project that many thought would never get done.'",
        "'speaker_2': 'And thanks to her leadership, she not only talked about it, but she helped put together the mechanisms. And with some outside help, we were very successful and today is a credit to you and your leadership. I also want to thank her for her acknowledgment of the regional responsibility for culture, because when she and I were working together'",
        "'speaker_2': 'in the nineties, that county was a little different and they different and the county has changed dramatically. Yeah, populations have moved throughout this community and so important to make sure that we follow the people because the people are moving throughout this county now and make sure that the cultural opportunities that are not just limited to those lucky'",
        "'speaker_2': 'enough to live in Seattle, but are lucky enough to live in Federal Way and Bothell and Auburn and other parts of our region because they need to have that access. And she understands access. And I want to thank again Councilmember Gossett for having the foresight again to appoint someone who I think is a true leader in our'",
        "'speaker_2': 'region.'",
        "'speaker_1': 'Thank you. Appreciate it.'",
        "'speaker_0': 'Senior Council Member Coles.'",
        "'speaker_1': 'Thank you, Mr. Chair, and also like to thank Councilmember Gossett for his foresight and wisdom here. And Mr. Phillips, I think what's so wonderful about you two is your breadth of experience, breadth and depth of communications working, of course, in live theater.'",
        "'speaker_1': 'And I also really appreciate that in substantive areas you've brought to the public the keen awareness of of the transatlantic slave trade. And that's very important that we look to not just at the position, but what it is one is doing in one's position.'",
        "'speaker_1': 'So thank you. Thank you.'",
        "'speaker_2': 'So much.'",
        "'speaker_0': 'With that, Councilmember Goss added, Entertain a motion.'",
        "'speaker_3': 'Thank you very much, Mr. Chair. It gives me a great deal of pride to put forward the name of one of my own girls, Vivienne. I both grew up in the center area, so therefore I like to move that with the proposed motion.'",
        "'speaker_0': '2019 0067 Council member Garcia just moved. We give it due due passed recommendation to motion 20 1967.'",
        "'speaker_2': 'I second.'",
        "'speaker_0': 'Thank you. It has been moved and second to see no further discussion. Madam Clerk, would you call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Bell Duchin. Councilmember DEMBOSKY, Councilmember Dunn. Councilmember Garcia. Hi. Councilmember Colwell Councilmember Lambert, Councilmember of the Grove. Councilmember one. Mr. Chair. Hi, Mr. Chair. The vote is nine eyes, no no's.'",
        "'speaker_0': 'Thank you. By your vote, we've given a unanimous recommendation. Do pass recommendation to approve Ms.. Phelps appointment to the Culture Board. We will advance that to our two full council and we'll put that on the consent agenda. So it will be taken up as part of the consent agenda.'",
        "'speaker_0': 'And you won't need to reappear unless you certainly want to.'",
        "'speaker_2': 'Great.'",
        "'speaker_0': 'Great.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you so much.'"
    ],
    "Appointment of Frank Martin to the 4Culture Board.": [
        "'speaker_0': 'Our pleasure. And with that will move to proposed motion 2019 112 MESABI five. Crackles IP. Excuse me.'",
        "'speaker_1': 'Yeah, see for that. I don't get.'",
        "'speaker_2': 'It, Mike.'",
        "'speaker_3': 'Michael.'",
        "'speaker_1': 'Again on page 17 of your packet, this is the appointment for for culture board appointment for Frank Martin and he was appointed by Councilmember Lambert. Mr. Martin lives in Skycom ish in Council District three. He was or he is the founder and project manager of I hope I pronounce this right.'",
        "'speaker_1': 'One one Amish Lodge, an adaptive reuse of a historical building in downtown Squamish. He is also a senior project manager and business consultant for a construction company and he is a councilmember for the town of Squamish. And this motion also has an amendment for your consideration.'",
        "'speaker_1': 'Amendment one would make Mr. Barton's appointment a three year term and to conform with the advice of council's legal counsel for filling four culture board vacancies. And with that amendment, Mr. Martin's appointment appears to be consistent with the requirements of the County Code and the culture charter and bylaws.'",
        "'speaker_0': 'Thank you, Mr. Martin, and invite you to join us to the presentation table. Good afternoon and welcome. Councilmember Lambert, would you like to make a few remarks?'",
        "'speaker_1': 'I would love to make some remarks. First of all, it is a pleasure to endorse him for this position. I met him under circumstances. He purchased a piece of property up in Sky Comet that I had my eye on for us to build as a community center and town.'",
        "'speaker_1': 'People said Councilmember Lambert may not be happy with you buying that piece of the property. And so we talked about it and he turned it into a amazing place that I couldn't be happier about. He took something that now was close to almost falling down and turned it into a beautiful place.'",
        "'speaker_1': 'And not only did he do that, but the workmanship in there, it was the two common arrows bridge that you took the lights from at an auction and put those lights in. He used crates from another business to redo the stairways.'",
        "'speaker_1': 'He left in the back of the building the marks on the ground where it used to be an old ice house. And so the marks from cutting up the ice were left on as part of the historical history of that building.'",
        "'speaker_1': 'There were so many pieces that showed absolute intricacies and devotion and love to the art of keeping this building alive. But he has done an awful lot or that building and for the town and that creativity that I saw as I went to the grand opening was spellbinding.'",
        "'speaker_1': 'And even the side of the building is now the back slat backsplash for the stove in the kitchen. And so the reuse was amazing. So I just really appreciate what you've done and I look forward to working with you even more.'",
        "'speaker_1': 'And thank you for being on the committee. Town committee.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Mr. Carter, any framing comments?'",
        "'speaker_2': 'I'll just say that Mr. and I had a chance to talk last week, which is the first time we had met. And I think what he brings to the foreclosure board at this point, which is really important, is this focus on preservation and I think an understanding of the built environment and what it takes to protect it'",
        "'speaker_2': 'for the utility that it provides community and also the beauty that you keep, the artistry that goes into the act of preservation of historic places. So I just look forward to him bringing that perspective. And then also it's just you guys know, there's been I do.'",
        "'speaker_0': 'It's a big county court.'",
        "'speaker_2': 'It's a gigantic county. And having somebody with deep roots as far out as Skycom, which will help bring that perspective that I think can that can work elsewhere as well outside of Seattle to be able to bring that frame to it.'",
        "'speaker_2': 'So I look forward to those two perspectives and also just enjoyed our conversation we have and look forward to him being on the board. So welcome.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you, sir.'",
        "'speaker_0': 'Mr. Martin. Good afternoon.'",
        "'speaker_2': 'Sir. Humbled by following Yvonne's appointment in front of all of you. I'm. I'm. I'm a 15 year vet here in the city. I moved here from the East Coast, from Maine. And, you know, I was in Seattle for most of that time up until I bought an old another home that was about ready to end up in'",
        "'speaker_2': 'Skycom ish, just because Skycom was this town that, as you know, was heavy in mineral extraction and timber and the railroad, and it sort of died when it was cleaned up. And now it's coming back to life again.'",
        "'speaker_2': 'And I'm a huge ski and snowboard enthusiast who spent a lot of time up at Stevens. I run a nonprofit up there as well, and I just invested my time and effort and energy into this little town that's trying to reestablish itself again.'",
        "'speaker_2': 'And I had the pleasure of working with Councilmember Lambert and mayor of the town, a lot of other for Tara and different groups. And we were able to kind of pull something together for this building and not to mention start to build a new vision for that town.'",
        "'speaker_2': 'I am though not relegated only to skate commerce. I do have a home on Queen in, so I'm back and forth. But Skate Commission is my primary residence where I spend the majority of my time just because it reminds me a lot of where I grew up in Maine, where I'm 45 minutes from a city and, you'",
        "'speaker_2': 'know, 5 minutes from the outdoors, which is what really lured me to be be up there. So I'm again humbled by by the folks, the sport, everything of our culture of don't have gone through their grant program already.'",
        "'speaker_2': 'They gave me a grant for this for the lodge and it's called one mesh. One is in a group of people that are coming together under one roof. And mesh is the Native American suffix, meaning people. So. One people underneath this lodge that are using it as a base camp to access this recreational paradise that we have'",
        "'speaker_2': 'in our backyard in the great northern corridor. So, again, happy to be here and just honored and humbled by the folks here just to to take part and to do what I can to get back to. Thank you.'",
        "'speaker_0': 'Thank you. Questions for Mr. Martin. Councilmember Dombroski.'",
        "'speaker_4': 'CHAIR Thank you very much for willingness to serve. And when I came here in 2013, Councilmember Lambert and I worked on a joint piece of legislation called the Sky Commerce Initiative. If you're familiar with it, but was really to encourage our county departments to work together on a recreation, economic opportunity, historic preservation, those three kind of pieces'",
        "'speaker_4': 'of the three legged stool. And so it's not that we're necessarily leading on that, but we want to be a supportive partner and call your attention. Councilmember Lambert, if she hasn't already, I'll get you a copy of that motion so you can wave it around to various county folks when you need some help.'",
        "'speaker_4': 'For Terra was a great partner in that as well. And and we've been supporting through our conservation futures work efforts to protect the Moloney forests there and acquire some of the last original old growth timber remaining in King County, which is just north of Skate Coalition fighting the Scoop Jackson National Forest.'",
        "'speaker_4': 'So thanks very much for your willingness to serve your work in Sky Commons.'",
        "'speaker_2': 'Absolutely. Certainly invite anyone to come up there too and sit in the whistling post and talk to some of the old loggers about the trees. These the and you know, back in the day, it's it's a pretty impressive community, very small, but very welcoming warming.'",
        "'speaker_1': 'To.'",
        "'speaker_0': 'Councilmember Lambert.'",
        "'speaker_1': 'I don't know I don't know if all of our listening audience knows, but the town guy commish had a railroad leak from the early 1900s. And when it was discovered, there was like 36 inches of oil underneath the town.'",
        "'speaker_1': 'So they had to dig up the entire town down about 30 feet, suck out all that oil, and they put the houses on big logs and rolled them to the other side of town. And then after the oil was all taken out and many, many things happened, then new dirt was put back.'",
        "'speaker_1': 'They regraded, brought the houses back, reset them, new sidewalks, new streets. And then they took the next block and did that until the town block by block until last year. Oh, my gosh. 15 years ago, maybe something like that.'",
        "'speaker_2': 'Yeah. I think the first lake was discovered in 98 and the clean up for 80 to 90% of it was finished in 2006 27. And they just recently finished the old school that was up there was a is an art deco school, but it was a concrete they couldn't move it.'",
        "'speaker_2': 'So they installed a bunch of steam pipes underneath and have been working on pouring that sort of contaminated slurries and.'",
        "'speaker_1': 'They didn't know how they were going to do those steam pipes. So it took time to design how they would be done. And it was an amazing issue with local governments together and and state and federal, they had a whistle that would blow.'",
        "'speaker_1': 'And then there was a yellow house in the end. And when the whistle blew, everybody came to the house and they would say whatever problem they had had at that moment, and then they would whiteboard it and then everybody would agree when they finally agreed.'",
        "'speaker_1': 'And then it was signed off by everybody. And so that everybody that was there in that room had the authority to sign off on this because there were so many decisions that had to be made that it was truly an example of government at all levels at its best.'",
        "'speaker_1': 'And the railroad was there also. And once we got started and the railroad was very helpful and and and it was made to have happen, but it the history has been written on it. It's an amazing story how the town of Skye Komische was actually moved and reconstructed.'",
        "'speaker_1': 'And so it's the little town that could and now it will. And we're excited about what's going to be ahead.'",
        "'speaker_0': 'Very good. Councilmember Lambert, we'd like to put a motion before us.'",
        "'speaker_1': 'I would indeed. I would like to move proposed motion 2019 0102 with the do pass recommendation.'",
        "'speaker_0': 'We have motion 2000 amendment. We have a motion 2019 102 before us. Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. I'd like to move amendment number one.'",
        "'speaker_0': 'And Councilmember Lambert has moved Amendment One, which is the one that is was that are places when we got to the dais today.'",
        "'speaker_1': 'Could make the three year term to conform to the advice of the council legal staff.'",
        "'speaker_0': 'And I will pursue a question with legal staff is not in committee today but just to make sure I understand the or origin of this amendment making sure that we are all in line, but we have a recommended amendment making the term a three year term instead of the originally proposed two year term.'",
        "'speaker_0': 'All this in favor of an amendment. Simply say I opposed any human. Kerry's further discussion. Madam Quirke, would you please could call the roll in motion 2019 102.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Belushi. Councilmember Tim Buskirk. Councilmember Dunn. Hi. Councilmember Garzon.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Councilmember Colwell. Councilmember Lambert. Councilmember at the Grove. Councilmember Yvonne Ricardo. Mr. Chair. Mr. Chan. The vote is nine is no nos.'",
        "'speaker_0': 'Thank you. By your vote, we've given a unanimous to pass recommendation to our motion 2019 102. And like Ms.. Phelps, we will we will put this on the consent agenda for a full council. So there should be no need for you to come to the full council.'",
        "'speaker_0': 'We look forward to full, full approval. Thank you.'",
        "'speaker_2': 'Thank you, Chairman.'"
    ],
    "Confirmation of Rick Brater as Roads Division Director.": [
        "'speaker_0': 'And with that, we move to agenda item seven. This is this item is a motion to confirm the executive's appointment of Rick Brady as our new director of the Road Service Road Services Division of the Department of Local Services.'",
        "'speaker_0': 'Mr. Brady has been with the county for a number of years and is currently serving as the interim director of Roads Services Division. I'm Pat Hamacher from our central staff will brief us on the motion and then Mr. Brady is here.'",
        "'speaker_0': 'His questionnaire is in our packets and he's here to speak to us in person about the appointment. Mr. HAMACHER Thank.'",
        "'speaker_2': 'You, Mr. Chair. For the record, Patrick Hamacher from council staff and the staff report begins on page 25 in your packets. And I'll just note that I'm pinch hitting for Nick Bowman today. He prepared the work he actually included in the staff report, a relatively extensive history around how we got to having a roads division, road services'",
        "'speaker_2': 'division within the Department of Local Services. But since you're all aware of that, having just stood up the department in January, I think I'm going to skip that background piece and focus on the appointment that's before the council.'",
        "'speaker_2': 'Mr. Brady has been a King County employee for 17 years. He began his career as the County Engineering Services Section manager and became the county road engineer in 2013. Most recently, Mr. Braider was appointed as the interim director of the Roads Division on October 1st of 2018.'",
        "'speaker_2': 'This is back when I would have still been in the Department of Transportation and transitioned to the Department of Local Services when it became a stood up as its own department on January 1st of this year. Before joining the county, he worked as in a number of engineering roles for Washington State Ferry Ferries and his full appointment'",
        "'speaker_2': 'packet, including the questionnaire, as you mentioned, Mr. Chair, is included in in the packets in your packets on the dais. He has been transmitted by the county executive and all of the transmittal, documents and materials that we would expect for a division director have have been transmitted are included in your packets as well.'",
        "'speaker_2': 'And with that, I would be happy to answer any questions that you're as you noticed, Mr. Brady has joined us at the table. So he's here as well.'",
        "'speaker_0': 'Any hard questions for Mr. Hamacher? CNN will turn it over. Mr. Rader, good afternoon.'",
        "'speaker_2': 'Thank you, Mr. Chair. First, good afternoon. On a beautiful, sunny, warm day with no snow. It's an honor to be here and to be considered for the position and role as the division director. I think the road services division is one of those divisions that maybe on a daily basis touches almost every person living in unincorporated King'",
        "'speaker_2': 'County on a daily basis. So again, it's an honor and a privilege to be here and be considered for this position.'",
        "'speaker_0': 'Thank you very much, very much. I might start with the first question, and that is, is reading through your materials submitted to the council, I was pleased to see an emphasis on stakeholder engagement and constituent services. Can you share some ways that the Remote Services Division might improve customer service and communication with residents and users in unincorporated'",
        "'speaker_0': 'King County?'",
        "'speaker_2': 'Thank you, Mr. Chair. So I think one of the key things that's happening and is exciting is that with the standing up as the Department of Local Services and the new emphasis on the unincorporated area and the outreach that's going to occur within that and as part of that department, the division is going to be fully engaged'",
        "'speaker_2': 'in in a broad spectrum of the communities around King County, across King County. And I think that's going to be very helpful in making sure that we, as a division, are delivering the services that the residents want and that we're really encompassing all of the residents and all of their needs throughout the whole broad range of unincorporated'",
        "'speaker_2': 'King County.'",
        "'speaker_0': 'Thank you, Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. First of all, as you know that I serve on the statewide crab or the muni community Roads and Administration Board, and I knew we had a great county engineer. But then when I heard the other engineers talk about him, I was even more impressed.'",
        "'speaker_1': 'Because when your peers say good things about you, that is pretty impressive. I was worried they try to steal him away when they needed a new engineer for the state. So I am very impressed with the work that he's done and the long hours that he's put in for years and that we've worked very closely for many'",
        "'speaker_1': ', many years and. Underfunded formula that he has to work with, with roads and bridges, and the very difficult decisions that he has to make on a daily basis because his department is grossly underfunded because of the state formula where only the people living in the unincorporated area pay into the county roads.'",
        "'speaker_1': 'And at this point, we're paying $1.88 per thousand dollars of assessed value as opposed to the 225, which is allowed under law with 100,000 less people paying into this account and expect to do the same things that we were doing before with so much less money.'",
        "'speaker_1': 'So with his hands tied behind, his back is still able to do amazing work. And so there's lots and lots of challenges that he faces. And so far, he hasn't pulled his hair out, which is good. The other thing is we just came through a very big emergency.'",
        "'speaker_1': 'And as I left my house this morning, there's still four inches of my snowman that has not melted. And it's been quite some time that we've been past the snow, but there's still remnants, including on my front lawn.'",
        "'speaker_1': 'So this snowstorm was the worst in 70 years. And I just want to say to roads, all the employees, roads to Rick and to John and to all the team and also Casey and our executive down there were a lot of people that put in long, hard hours and some as many as 20 hours a day during'",
        "'speaker_1': 'that time, many on 12 hour shifts for three weeks, 28 days.'",
        "'speaker_2': '17.'",
        "'speaker_1': 'Days, 17 days only seem like 28. And that's a long time when you're working 12 hour shifts out in the cold with pretty much crazy conditions, ice being so heavy that we had to bring in graders to cut it up before we could plow things that you wouldn't normally expect.'",
        "'speaker_1': 'And they did it and really helped the citizens. And we discovered a lot of things that you always learn during an emergency that they're going to be sharing with us. But we got through it as well as we did because of the great work.'",
        "'speaker_1': 'So I want to thank you and your team for the great work that you did and the dedication to work 17 days on 12 hour shifts. So thank you.'",
        "'speaker_2': 'Thank you, Councilmember.'",
        "'speaker_0': 'Councilmember Dunn, I.'",
        "'speaker_2': 'Want to echo Councilmember Lambert's words here today. Appreciate all the hard work, especially through the snow circumstances. And in echo, also that state law probably is the biggest hurdle, I think, that I see in you doing your job effectively.'",
        "'speaker_2': 'And boy, I'll tell you, it's never good when a law stands in the way of trying to get a basic government function done. And that is the we reached our statutory maximum in terms of what we can levy for the unincorporated roads levy, largely because this councilmember never mentioned annexations and and corporations have brought the population in'",
        "'speaker_2': 'a different direction than an increasing tax base. So I just want to let you know that I stand firmly behind you and your efforts and the department's efforts and the new divisions efforts and the executive's efforts to try and get that antiquated tax system restructured in a way that allows us to continue to repair our infrastructure out'",
        "'speaker_2': 'there so folks can get around to their jobs, to their families, to emergency services and hospitals and many other things that I think are basic service. So thanks for your leadership and look forward to working with you. Thank you.'",
        "'speaker_0': 'I also wanted to ask about working with your staff. We ask a lot of road services division, not only in ingenuity and the work before them, but in particularly challenging circumstances when they don't have the full resources to do everything we'd like to do to protect our assets and maintain the assets that your division is tasked with'",
        "'speaker_0': 'maintaining and growing when possible. Can you speak to how we can best support staff morale with within the division and support them in the innovative thinking and creativity that we so strongly need?'",
        "'speaker_2': 'Sure, Mr. Chair. So first off, there's quite a bit of road staff right here. So so we're very, very fortunate to have such great and talented people working for Rhodes and for the county. I think like any organization, you kind of get into your groove and you don't really understand that other people know what you're doing and'",
        "'speaker_2': 'what you're struggling with and what the real problems of every day trying to maintain a system that's underfunded and overused and anything that you can do to just recognize that you understand the situation that they're in and what they're dealing with and the good work that they're doing goes a very long ways, very long ways and obviously'",
        "'speaker_2': 'good communication as we're dealing with issues in your district or anybody's other district. It's super helpful to know that there's a good understanding and a good partnership and a good relationship with council member. And it's just goes a long, long ways for people wanting to put in the extra time and the extra effort to to try and'",
        "'speaker_2': 'resolve a problem.'",
        "'speaker_0': 'Thank you. My office has appreciated working with you very much in some of the work we're doing with our constituents in unincorporated King County. And, you know and know that that very work is done by your staff within the division and making sure that we can be as creative as we can and also support them.'",
        "'speaker_0': 'Knowing what situation we are in resources is very important to me and I think to the entire council.'",
        "'speaker_2': 'Well, thank you. I look forward to working with you in the future indeed if confirmed.'",
        "'speaker_0': 'Other questions. Council Member Dombrovskis Thank you.'",
        "'speaker_4': 'It's a very particularized and local concern, but the north half of 145th Street is a county owned half of an arterial. What is your vision for that in terms of eventual municipal control? It's important because we're trying to connect Bothell and Lake City way to I-5 for light rail coming in a couple of years.'",
        "'speaker_4': 'And we've got multiple jurisdictions, Seattle Shoreline, the state of Washington because it's Route 53, King County, Seattle Public Utilities is in the right away. How would you take a complex situation like that and maybe use that as an example?'",
        "'speaker_4': 'And what do you see happening in that corridor?'",
        "'speaker_2': 'Thank you. So that particular section, there's a section of that street that's state highway and that actually trumps the county right away. So that's a majority of the portion of that particular roadway. So I get a little bit of an out on some of that.'",
        "'speaker_2': 'So there's the two ends of that corridor that are part of the county road right away. And it's mainly the intersections where there's a lot of overlap. And and in those areas, as we have in other situations, there's a great effort to partner with all of those interested parties, interested agencies, jurisdictions.'",
        "'speaker_2': 'I think that there's a strong will to make some of these regional systems function and work and acted in good, good partnership with all of the different interested parties and vested interests. And so I think we have a long history of being a willing partner to work through those issues and accommodate something that's for the greater good'",
        "'speaker_2': 'of the region.'",
        "'speaker_4': 'Would you agree with me that we really don't even need to be in that space? I mean, that is absolutely.'",
        "'speaker_2': 'So what's the path out? Well, unfortunately, the county has a history of what we call our orphan roads. So we have these little segments of roadways all over King County that through annexation and incorporations have been left behind.'",
        "'speaker_2': 'And there are little islands of roadways that are basically in limbo. And in in that end, we've been trying to work with the state legislature, with the jurisdiction that's on the other side to try and see if we can get them incorporated into their.'",
        "'speaker_2': 'Respective jurisdiction. However, it's not been an easy task and we would certainly look forward to any support and help we could get in helping those other jurisdictions be willing to take them in. They're not large sections of road, but they do task our maintenance efforts in terms of being outside of our main service area.'",
        "'speaker_2': 'So it's something that we've been working on. We've had a few successes, but not a lot of them. And so it's something we're going to be working on throughout the future.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I mean, actually, three very quick questions. Okay. Number one, how many orphan roads are there in the county?'",
        "'speaker_2': 'It's roughly 60, I.'",
        "'speaker_1': 'Think that is the number ahead. Thank you. So there's 60 of them in the county and we went to the state, I think it was three years ago, asking for them to take the orphan roads and to say it was an unpleasant debate would be the understatement of the week.'",
        "'speaker_1': 'And the cities were not helpful. And so we came away with a bill that was completely gutted, that did absolutely nothing. So we're still in the same place, virtually, that we were before we went to the state. And they have done nothing to change the formula, which is the problem.'",
        "'speaker_1': 'But so that's that's it. And then the next thing is, seven years from now or six years from now, how much money will be in the roads, capital budget?'",
        "'speaker_2': 'So you're talking about the decline of our funding and what we can actually provide for our capital program. So in that period of time, the capital program will decline down to zero and we will have no funding available for our capital program.'",
        "'speaker_1': 'So I think that when you get to that budget of zero, it's a pretty good indication that there's a crisis and we don't have time to mess around with this. This has got to be change and the state needs to know that they can no longer continue this deprivation.'",
        "'speaker_1': 'And it means that 70 miles of road and 35 bridges. Tell me if that's correct. Will be substantially impacted. 35 bridges having their weight bearing changed or closed, some with bad detours, routes as far as length and 35 roads that will not be in good condition.'",
        "'speaker_1': '35 miles of roads will not be in good condition. This is not how we preserve a $40 billion asset. So I appreciative of the fact that we have people who are willing to work with us and try to get the state to do what needs to happen.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'With that, Councilmember Lambert, would you put a motion before it?'",
        "'speaker_1': 'I would be happy to do that. Thank you. I would like to move a proposed motion 2019 0048 with a do pass recommendation.'",
        "'speaker_0': 'Councilmember Lambert has moved adoption of Motion 20 1948 for the discussion. Madam Clerk, will you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Belushi. Councilmember Dombrowski. Councilmember Dunn. Councilmember Garcia. Hi. Councilmember Colwell. Councilmember Lambert. Councilmember of the Grove. Councilmember one right there. Mr. Chair. All right. Mr. Chair, the vote is nine no nos.'",
        "'speaker_0': 'Thank you. You've given unanimous to pass recommendation to most in 2000 1948, and we will put that on the consent agenda in full council on March 27th.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'It's not it's not often you have the interim general director showing up in your support. The next agenda item is Motion 2000, 1930. And last September, the Council adopted a motion to formalize the establishment of the Legislative, Branch, Equity and Social Justice team.'"
    ]
}