{
    "Charter Amendment to Move County Elections to Even-Numbered Years.": [
        "'speaker_0': 'So unless certainly burning questions, I'd like to move on now and we will look forward to having another presentation on the bond and at a later date. Okay. With that, we will now move to agenda item number seven.'",
        "'speaker_0': 'The staff report begins on page 38, and this is a proposed ordinance on a King County charter change to move elections for certain county offices from odd number two, even number years. We did have a briefing on this already at our June 1st meeting, and we have Sherri Su from our central staff to provide the second briefing'",
        "'speaker_0': ', an abbreviated briefing. And I was glad to see you with us today, Sherri. We also have from the county Department of Elections Julie Wise and Kendall Hudson, who were with us at our last briefing. And they will be available to answer questions as well with that.'",
        "'speaker_0': 'Go right ahead, please.'",
        "'speaker_1': 'Thank you, Chair Colwell and good morning, council members. Sherri, through a council staff and the materials begin on page 38 of your packet proposed ordinance 2020 20180 would place on the November 2022 ballot a charter amendment proposal to move elections for county executive, county assessor, county elections director and county council members from odd to even years.'",
        "'speaker_1': 'This proposed ordinance was briefed in committee on June 1st, so in the interest of time, I will skip the background and just focus on those areas where there were questions in the previous meeting and present the new information.'",
        "'speaker_1': 'I'm also happy to answer any questions on the staff report. I'll just begin with a quick reminder of the proposed changes, and this is on page 42 and table two. For the county executive and council members from districts one, three, five, seven and nine.'",
        "'speaker_1': 'These are most recently elected in 2021 for a four year term, ending 2025 under the proposed charter amendment. The next term would change to a three year term, and after that terms would be four years for the county assessor, elections director and council members from districts two, four, six and eight.'",
        "'speaker_1': 'These are most recently elected in 2019 for a four year term ending 2023 under the proposed charter amendment. The next term would be a three year term, and after that terms would again be four years. Moving on to the cost considerations on page 43.'",
        "'speaker_1': 'From an operational perspective, election staff indicate that moving county officer elections from odd to even years would not directly result in operational changes or cost to the department. And moving on now to the the discussion of the allocation of election costs among the county, state and local jurisdictions at a high level elections department administers elections and then'",
        "'speaker_1': 'divides up that cost proportionally to the state, the county and local jurisdictions that appear on a given ballot. We looked at the potential fiscal impact if past county officer elections had been held in even years instead of odd years.'",
        "'speaker_1': 'This is shown in table four on page 45. The summary of this whole table is that since 29, since 2009, there are three instances where the county cost would have decreased. Two instances where the county cost would have increased, and in most cases there would be no impact.'",
        "'speaker_1': 'We did go through this in detail at the last briefing, so I'll skip that. But if there are any questions, I'm happy to walk through it again. I'm jumping now to the potential policy considerations on page 46. The first one listed here is voter turnout.'",
        "'speaker_1': 'The chart on page 46 summarizes voter turnout for general elections in the county over the last 20 years. Since 2010, the county's average voter turnout rate is 77% and even years and 47% in odd years. If past trends hold moving county officer elections from odd to even.'",
        "'speaker_1': 'Errors will likely result in higher voter turnout for these elections. Whether council wants to increase voter turnout for the election of these county officers is a policy decision for the council. There was a question in the previous briefing about how this change might impact turnout for local jurisdictions in odd years based on turnout in other counties.'",
        "'speaker_1': 'Data does not suggest that holding county officer elections in even years instead of odd years would impact on year turnout. On page 48, Table five compares the voter turnout in the seven home rural charter counties during 2021. So three of these counties elected county officers that year.'",
        "'speaker_1': 'Four of these counties did not elect county officers that year. And based on this data, there is no clear trend distinguishing voter turnout between these two groups. The second path exaggeration is the number of races on the ballot.'",
        "'speaker_1': 'Moving these county officer elections to even years would increase the number of races on even your ballots and reduce the number on odd year ballots. In terms of the specific number of races that would be moved, the number of ballot items could increase or decrease by two or three.'",
        "'speaker_1': 'In the previous briefing, there was a request for some sample ballots, and election staff have put together some sample ballots that show possibilities of what past ballots would have looked like with county officer elections held in even years instead of odd years.'",
        "'speaker_1': 'So there are four years of ballots 2018, 20, 19, 2020 and 2021. Just to orient you to those materials for each year there. There are original and revised ballots, and there are both primary and general elections. These sample ballots assume that the 2019 county officer elections were instead held the year before in 2018, and they assume that'",
        "'speaker_1': 'the 2021 county officer elections were instead held in 2020. There are multiple versions of each ballot and just to show different examples and the sample ballots also show the order of ballot races. There is also a question about what response rates for county officer races might look like in even years.'",
        "'speaker_1': 'So the staff report now includes Pierce County's response rate during a recent even year elections. This is on page 49. Pierce County is the home rule Charter County and Neighbor County that holds county officer elections in even years.'",
        "'speaker_1': 'If King County moved county officer elections to even years, then Pierce and King County would have similar ballot sequences. So Pierce County offers one example of how response rates are at the top of the ballot and may compare with response rates for a county officer.'",
        "'speaker_1': 'Elections in 2020. The first county item was a referendum with a response rate of 82%. The turnout for a county officer positions was 82% for county executive, 82% for a county assessor, and 85, 80, 81 and 76% for a county council position in 2018, which is a non-presidential election year.'",
        "'speaker_1': 'The first county wide item was an initiative with a turnout of 66%, and turnout for county council positions was 67, 60 and 77%. The third party consideration listed on the staff report is alignment with federal and state elections.'",
        "'speaker_1': 'Moving county officer elections to even years would align the election schedule of these county officers with federal and state elections. And whether council desires to do this is a policy decision for the Council just to close timing. This is our second briefing in this committee to place this potential charter amendment on the November ballot.'",
        "'speaker_1': 'The last regular council meeting to adopt as a non-emergency would be July 19th. I'm happy to take your questions at this time. And we. We have election staff joining us as well.'",
        "'speaker_0': 'Thank you very much. I really appreciate the very thorough presentation. And I'm wondering if there are any questions of our staff here or of Julie Wise, Director, Wise of Department of Elections or Chief of Staff? Hudson from the Department of Elections.'",
        "'speaker_3': 'But I have a quick question.'",
        "'speaker_0': 'Go right ahead. Councilmember Dan.'",
        "'speaker_3': 'Quick. So the way the election sequence is lined up, will you, the county executive, be up on presidential years or in the mid term you.'",
        "'speaker_1': 'Thank you for the question. Let me just double check that really quick. The county executive, is there current and term ends in 2025? The next term under the proposed election cycle, under the proposed amendment that would end in 2028 and would be aligned with the presidential election.'",
        "'speaker_3': 'Actually, the county executive would be aligned with the presidential election and the four council seats with a presidential election, and then the odd year boundaries would be midterms. So. Right.'",
        "'speaker_1': 'Yes, that's correct.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And I actually would like to turn to Councilmember Bell duty at this point. And we again, we still have our elections officials with us. But I'd like to give Councilmember Bell, did she, the lead sponsor, an opportunity to speak on this?'",
        "'speaker_2': 'Thank you, Chair Carl Wells. I'd be happy to make a motion since this is our second briefing. If you think that is timely.'",
        "'speaker_0': 'That's fine.'",
        "'speaker_2': 'I would move that. We move proposed ordinance 2020 20810 to the full council with a DE Pass recommendation.'",
        "'speaker_0': 'Thank you. So that motion has been made. And would you like to speak to at this time, or do you have any questions of election staff?'",
        "'speaker_2': 'I'd be happy to speak to it. I'll try to make it really brief. I'm encouraging your support today to move this item forward so that we can stick to the timelines, to put this on the ballot and ask the voters to have their say about whether they want to move our county elected officials to even year elections'",
        "'speaker_2': '. Colleagues, you know, we have been a leader in making elections accurate, fair and accessible to as many voters as possible. We are rightly proud here of our county's leadership on making voting accessible to all with successful vote by mail elections for many years before it became statewide, widely available ballot boxes which we funded in communities throughout King'",
        "'speaker_2': 'County so people can drop off their ballots easily. We've funded initiatives to educate and involve many more new voters, and we led the way on prepaid postage for ballots, which, again, all of these initiatives were supported by this council and have expanded access to voting.'",
        "'speaker_2': 'We understand that access to voting is critically important. Our government is the most representative and is to say the most democratic. When the people elected to represent the voters are sent by as many of the people as we represent as possible.'",
        "'speaker_2': 'And as we've heard, the.'",
        "'speaker_1': 'Data shows that voter turnout during even.'",
        "'speaker_2': 'Year elections is dramatically higher than outyear elections, meaning many more voters will have a voice in who represents them in these key offices that we that we occupy.'",
        "'speaker_1': 'You heard some of the numbers.'",
        "'speaker_2': 'I won't repeat them, but I will say that by moving to even year elections, I just want to stress what we heard from some of this really compelling testimony earlier today. Not just a higher number of voters would participate, but an electorate that is far more representative of our public at large, including more people of color, more'",
        "'speaker_2': 'and younger voters, more renters, more people of lower income and with less wealth. The flip side of that is currently these positions are elected very disproportionately by, you know, a very.'",
        "'speaker_1': 'Limited demographic that is.'",
        "'speaker_2': 'Dominated by wealthy, older voters. Those voters get to have a say, but everybody should have a say. We should have all of our voters, as many of them as possible, engaged in selecting their representatives. I think I'll just close by saying we've been briefed, we've had an opportunity to have questions answered.'",
        "'speaker_2': 'There's still more time today and a final council if there are further questions. But let's send this to the voters this year so that they can have their say. And if they agree that this is a very important and simple fix that will really expand access to voting, then we can be moving towards those years when it'",
        "'speaker_2': 'will actually be implemented. Because as you heard, the proposal is we get our first even year elections like three years out from next year. So let's get this going. I urge your support. Thank you, Chairman Wilson.'",
        "'speaker_0': 'Thank you. Council Member Baldacci. At this point, we still have our election officials with us. We are short on time. But I would like to hear if any of our council members have further questions or comments.'",
        "'speaker_3': 'At the Grove.'",
        "'speaker_0': 'Councilmember at the Grove.'",
        "'speaker_3': 'Thank you, Madam Chair. And this was probably explained, and I just just missed it. But could staff explain one more time how we transition to that odd year? What does it mean? This is a selfish question, perhaps as someone who's in office.'",
        "'speaker_3': 'The next time, for example, I'm up on the ballot. Using just me as an example is an odd numbered year. I assume nothing changes about the current term in District five. Is the next person elected for three years or for five years?'",
        "'speaker_3': 'Is it three? Three? Okay.'",
        "'speaker_1': 'Sir, I'm I'm happy to clarify that. So nothing changes with the current term and then the next term would be three years instead of four. And that would move every move to the even schedule.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Thank you. Are there any other questions? Councilmember Campbell.'",
        "'speaker_4': 'Thanks. The corollary to that is for seats that are up in 2023. Are they going to be three year terms?'",
        "'speaker_1': 'Yes. So this change would be happening to all the positions. Some of those would happen in 2023. Some would happen in 2025, depending on when that position is up. The next term would be three for all of these, and then after that, they would all be four years again.'",
        "'speaker_4': 'Got you. And in the last briefing we had, which was the first briefing, I had asked about the impact of the costs to run these campaigns. Was staff able to make any estimates because of the the need to talk to more voters, which is a good thing, what the cost might be to run for county executive elections'",
        "'speaker_4': 'director, assessor County Council.'",
        "'speaker_1': 'We did not look into the question of campaign costs. That would be more of a political question. I think.'",
        "'speaker_3': 'We.'",
        "'speaker_0': 'Would, director wise, like to comment on that. I don't know if she or others would know that in terms of projection in the future. Go right ahead. Thank you for joining us.'",
        "'speaker_2': 'Good morning. Councilmembers. I think Councilmember Dombroski for the question. I, too, would pretend to know the answer to that question. I know that in talking about this initiative.'",
        "'speaker_1': 'That there's been conversations around the impacts to running campaigns.'",
        "'speaker_2': 'But I think that's a little bit outside of my purview, to be honest with you.'",
        "'speaker_0': 'Thank you. I think.'",
        "'speaker_3': 'Know.'",
        "'speaker_4': 'Just I this is my biggest. I really love the increased turnout and the greater diversity of the electorate. It's more representative of the county, so more people are participating. But having done some work in this space, the the ability to run with I'm looking at a colleague here I think in the race are indeed three.'",
        "'speaker_4': 'It may have cost over $350,000 on one side or another. And it's just over $650,000 spent just by the campaigns alone, independent expenditures. And I don't think that's purely political. I think that's the policy there, particularly when we look at public financing, which is county used to have.'",
        "'speaker_4': 'And so who gets to reasonably be on the ballot, which is one of the goals of this, to have a more have a representative council. So often politics, sadly, in America is driven by money. And when we are and I think elections and even yours, it's fair to say, because where we would be or people running would'",
        "'speaker_4': 'be talking to more voters, it would cost more. And that can be a barrier. So I'm I've been interested in kind of a package of explaining a package of reforms, democracy reforms, including public financing, the interest in ranked choice voting shift to even year elections would be part of that.'",
        "'speaker_4': 'I, i, I really appreciate where this proposal is coming from and the goal that it would have, which is an important one of having more people participate. But I do think there are collateral issues that are that arise, the big one being the dollars.'",
        "'speaker_4': 'And I mean what I county executives raised cost $3 million $4 million that could in a presidential year when you're trying to buy TV, that's a real issue that I think we haven't talked about and I have asked and and dialog on.'",
        "'speaker_4': 'But that's a concern for me.'",
        "'speaker_0': 'Thank you, Councilmember DEMBOSKY. And I could look at it from another perspective that there's only so much money out there, and it may be that it would not cause more, given that there are a lot more, there would be a lot more campaigns going on, but we don't know.'",
        "'speaker_0': 'That, of course, could come out during the campaign for on this ballot measure very quickly. Council Member Perry. And then I'd like to turn to a councilmember done. And then Councilmember Bell, did she do close?'",
        "'speaker_1': 'Thank you. I really love competition and want to be the best district. I believe steel sharpens steel. And I believe competing for space in imaginative, innovative and interesting ways to have a vote is is what we're based on.'",
        "'speaker_1': 'And if that results in more people participating, then that to me is a win all the way around. And it's a huge and important and very positive challenge to each of us.'",
        "'speaker_0': 'Thank you. Councilmember Dunn.'",
        "'speaker_3': 'Thank you, Madam Chair. I appreciate the bill being brought up for consideration. I just want to let folks, I really strongly oppose this particular piece of legislation. Just because there's a higher percentage of people filling in the oval, does it mean that there's a more informed electorate?'",
        "'speaker_3': 'When you buried King County Council and Council executive races, the second largest government, the state of Washington, underneath the presidential race, the United States Senate race, ten congressional races, seven statewide races and others. What you do is you lose sight of the local issues that impact people the most instead of the federal issues.'",
        "'speaker_3': 'And the passion for the federal elections. Gobble up all the time. People need to be talking about Seattle. What is the highest homeless population per capita of any city in the United States, or the dramatic, historic rise in murders and shootings in and around King County and transportation and traffic and land use problems?'",
        "'speaker_3': 'That's not the kind of thing they are focused on. When presidents are running and US senators are running and congresspeople and governors are, these issues will be buried and seldom talked about unless federal candidates decide to talk about it.'",
        "'speaker_3': 'And so just because more bubbles are being filled in doesn't mean you have a more educated electorate on local issues. The odd year elections historically have always given us a chance to focus on local issues, given a chance for the editorial boards to focus on local issues, to talk about the things that matter, most of them very'",
        "'speaker_3': 'well. And so varying these in under these major federal races is a mistake. Also, those of you I ran for attorney general back in 2012 against our good friend Bob Ferguson. And I will tell you, the media is incredibly expensive when you've got a presidential race buying up all the time, even a Senate race buying up all'",
        "'speaker_3': 'the time, and congressional races, seven statewide risks, including the governor and the attorney general. And so there will be in the literally the price of getting ads out is far more expensive because there are less time slots available for that.'",
        "'speaker_3': 'And so what this will mean is it is an incumbent protection policy for incumbent members of the King County Council and an incumbent county executive. Nobody who has limited name ideas that get known in any significant way. If if we have a situation where these races are buried underneath the federal races.'",
        "'speaker_3': 'And so I would strongly encourage people to understand the cost factor. It will be impossible for some local town council members to go after a well-known community councilmember or county executive. So that's a big it's an incumbent protection plan.'",
        "'speaker_3': 'It's an education plan on local issues. And there are a lot of other reasons why this is bad. I guess I would say if it isn't broken, don't fix it. You might say, well, we get more of increased participation.'",
        "'speaker_3': 'Remember, we spent a lot of money the taxpayers have on putting ballot boxes all throughout the community. But you have a voter education program printing a ballot. And just about every language we can, we now pay for the ballots sent.'",
        "'speaker_3': 'We even now pay for the return postage. It's not fair to put those individuals who are trying to study local issues at a disadvantage themselves, because all these issues are now buried under the presidential presence. So I think it's a significant mistake in this county to go in the direction of having your elections buried under these big'",
        "'speaker_3': 'federal issues. I also think you're going to dramatically hurt the media, the media around here as a small business, those local publications, those local papers, those local TV and radio stations, the bigger newspapers, they all receive substantial revenue in those off years.'",
        "'speaker_3': 'For candidates running for office by county council, race alone is over $800,000. You know, a lot of that went to local media. They want they want the street drought those off years that I also think is insensitive to that small business said I'm going to oppose this.'",
        "'speaker_3': 'I hope we can do something different. I appreciate the intense spirit which you brought up, but I think it's a mistake to totally hide local issues and protect incumbents.'",
        "'speaker_0': 'Thank you. Thank you very much, Councilman. Every time I would like to turn this over to Councilmember Bell, do try to close, but I would like to say one thing. Just make sure everybody knows. Not every voter at all has to follow ten congressional races, either it would be one and so forth.'",
        "'speaker_0': 'And so anyway. And I think that the county races would be above the judicial races, at least we heard that last week. Jenny is shaking her head. Yes. With that. Councilmember Bell, do try to close.'",
        "'speaker_2': 'Thank you so much.'",
        "'speaker_1': 'Chair Caldwell's I will say that since.'",
        "'speaker_2': 'Since surfacing this proposal, the the case for doing it has been extraordinarily compelling. It's based on data, it's based on research. It's based on what we know about what. Works to get more voters participating in selecting their elected representatives.'",
        "'speaker_2': 'The opposing arguments have been almost entirely based on partizanship, based on the idea that one side or the other would be disadvantaged by more people voting. And I have to say, if more people voting is bad for your for your candidacy, then, you know, the voters should have a say.'",
        "'speaker_2': 'The voters the voters should get to pick who they want to represent them. And suppression is never the right approach to winning to winning an election. The other group of opposition arguments have come from campaign insiders, people who are concerned about what does this mean for me running a campaign or people who in other ways make their'",
        "'speaker_2': 'money or or get their offices out of running campaigns? Campaigns will adjust. We will figure it out. We will figure out how to get our message out to voters. I sit here as somebody who was elected having been outspent.'",
        "'speaker_2': 'When you count independent expenditures and direct candidate funding by almost 3 to 1, and I was able to win because I did what campaigns do. I adjusted. I campaigned as will others with a lot of other with a lot of volunteers, with phone calling, with the old fashioned methods.'",
        "'speaker_2': 'And we still were able, with the money that we raised, to do a fair amount of media. I am not concerned that campaigns will not get their votes out when I get their messages out. I'm sorry, and I'll say what I said before.'",
        "'speaker_2': 'I think that we overestimate what most voters do in an odd number of years in order to learn about the issues. I think people read their newspapers, look at their voters guides. They might collect some of those mailers that pile up on the kitchen table.'",
        "'speaker_2': 'And when the time comes, they pull out whatever their favorite information sources are. And they look at the ballot and they ask friends and family and they fill in the ballots and they fill in the boxes, the little the little bubbles, as you said.'",
        "'speaker_2': 'And they do it based on the information that is available to them from their their preferred sources of information. And people will still do that in even numbered years. I don't think you will see a tremendous drop off in the level of education or knowledge of the voters from odd years to even years.'",
        "'speaker_2': 'So. I haven't heard any compelling arguments not to do this. I don't know why we didn't do it before. And I just want to end by saying we are by far not going to be like on the cutting edge as counties go.'",
        "'speaker_2': 'Most counties in Washington state.'",
        "'speaker_1': 'Elect their elect their.'",
        "'speaker_2': 'County council members, executives and other county officers in even years. Pierce County does it to the south and they're just fine and we're just fine. And so I really encourage us to move this forward to the council and then at council to move it forward to the voters to make the appointments.'",
        "'speaker_2': 'Thank you, colleagues.'",
        "'speaker_0': 'Thank you very much. Council member Dale, did she with the clerk? Please call the roll.'",
        "'speaker_1': 'Thank you. Chair Powell's Council Member Bell Duty II. Council Member DEMBOSKY, I. Council Member Dunn.'",
        "'speaker_3': 'No.'",
        "'speaker_1': 'Council Member.'",
        "'speaker_2': 'McDermott.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Councilmember Perry, i. Council member of the grove.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilmember upon Jack Bauer. Council members only.'",
        "'speaker_3': 'I. No.'",
        "'speaker_1': 'Thank you. Charcoals. I The boat is seven eyes, two nose. Those being council members. Dunn and Von Right Bower.'",
        "'speaker_0': 'Thank you. And with our vote, we have approved proposed ordinance 2022 zero one's eight zero. And we will send this ordinance with the due pass recommendation for the consent agenda. No, we cannot send it to the consent agenda to the regular agenda for the June 28th Council meeting.'",
        "'speaker_0': 'Our next item is proposed motion 2020 20174 approving the executive's reappointment of Anita Khandelwal as county public defender in the staff report begins on page 23, Jenny Champion G. Battista will be providing a very short, abbreviated report because this is the second time that she will be doing so.'"
    ]
}