{
    "Appointment of Sheryl Whitney to the Harborview Medical Center Board.": [
        "'speaker_0': 'It has been enthusiastically moved and is before us. Any comments or changes? All those in favor of approving the minutes please signify by saying i, i any opposed? All right, so this brings us to motion number 2017 0507, a motion to appoint Cheryl Whitney, who I think we all know from our time here at King County to'",
        "'speaker_0': 'the Harborview Medical Center Board of Trustees to fill the remainder of a four year term. Cheryl's from District six, my district. I'm delighted she's agreed to serve on the Harborview board. She's here with us today, along with Patrick Gallagher of our council staff, who will present the item.'",
        "'speaker_0': 'Please go ahead.'",
        "'speaker_2': 'Thank you, Madam Chair. Council members, for the record, Patrick Homemaker Council staff. As you noted in your introduction, Ms.. Whitney has been appointed to the Harborview Medical Center Board of Trustees by the county executive. She will be serving out the remainder of a four year term that runs through the middle of July 2020.'",
        "'speaker_2': 'So it's got about three and a half years, about three years left in the Harborview Medical Center board is comprised of 13 members, nine of them appointed by districts, and four at large by the county, the county executive, the board as the representatives of King County at Harborview Medical Center and oversees its operations, including the selection of'",
        "'speaker_2': 'the executive director. The since 2011, Ms.. Whitney has been co-owner of Whitney Jennings, a Mercer Island based full service management consultancy. And prior to that, Ms.. JENNINGS Ah, excuse me. Mr. Whitney served as a consultant to the US Department of Housing and Urban Development.'",
        "'speaker_2': 'Those are her more recent positions. And as you noted in your introduction, Madam Chair, she has a long history of almost 20 years with King County, and her final position at King County was as deputy county executive, so that I would conclude my remarks.'",
        "'speaker_2': 'Madam Chair, and I'd be happy to answer any questions. Also with us today is Jennifer Yu, who serves as a staff at Harborview and is the staffer who's coordinates the board appointments.'",
        "'speaker_0': 'Very good. Thank you. Mr. Hamacher, I want to ask a question. Then I'll call on Councilmember Gossett. I just want to ask Miss Whitney if you would take a moment just to tell us about yourself and your interest in serving on the board.'",
        "'speaker_0': 'Thank you. Thank you, Madam Chair. Members of the council I sat in, probably not this chair, but one like it. And for my confirmation as a department head here and a King County. And I'll be honest with you that I think I feel as nervous now as I did as I did on that day.'",
        "'speaker_0': 'There's something about public service. It never fails to be weighty, and I think that's as it should be. So I cannot tell you what an honor it is to be sitting here and to be considered for this position.'",
        "'speaker_0': 'I fully understand that a board position with Harborview is big and this institution is a jewel in this region and means so, so much so. I I'm I'm I'm honored throughout my career at the county, as Pat mentioned, I spent almost 20 years here at King County.'",
        "'speaker_0': 'Throughout my career, I had the opportunity to be up at Harbor View on many, many, many occasions. And I have watched the staff there perform at. Miracles. But as impressive as the life saving work that I have watched them do is the grace and the dignity that they treat each individual that is in front of them.'",
        "'speaker_0': 'And the grace that they show is so incredible and so powerful that the opportunity to have the opportunity to be a part of that culture is an incredible opportunity and honor and one that I really look forward to.'",
        "'speaker_0': 'I was asked to say a little bit about myself in terms of my history and how that might be of use to the board. And I would say that I a number of things, but what I hope is that my understanding of the leadership here at King County, of the systems here at King County, that so many'",
        "'speaker_0': 'of the faces have changed, those systems remain. And whether it's jail health or public health, human services and their daily interactions with Harborview, I hope that my my understanding of those organizations and those agencies is useful. I will say that I, I got my beginnings at King County in the Budget Office.'",
        "'speaker_0': 'So I know a great deal about the difficulty of balancing a budget for this institution. I hope my understanding of that work is useful here. I at one point served as the deputy director of what used to be executive administration, the general government department that housed the facilities management function.'",
        "'speaker_0': 'So I hope that that role will also be useful as the board is looking at potential facilities issues on into the future. And the very last thing I would say is that I was honored to be a part of the original work, King County's original work on equity and social justice.'",
        "'speaker_0': 'I'm incredibly proud of where that work has has gone. But that is a lens that I know from speaking with the staff at Harborview is critical to them. So I hope that I bring that perspective to the work each day.'",
        "'speaker_0': 'So thank you so, so very much and thank you for being willing to serve. Councilmember Gossett And then Councilmember one right there.'",
        "'speaker_1': 'Thank you. My first question, Madam Chair, is for Patrick. And I wanted to know, is she a District Six appointee or one of four at large?'",
        "'speaker_2': 'She's a she is an appointee representing District six.'",
        "'speaker_1': 'Okay. Thank you. I know.'",
        "'speaker_2': 'I can.'",
        "'speaker_1': 'Help her. She she sat on somebody's knee when she was three and she was already impressively articulate person, even as a little girl. I went to college with her uncle, so I'm really looking forward to this. But I have now I have a question for you.'",
        "'speaker_1': 'I put my professional hat back on. It was nice to hear what you said about the staff in general at Harborview, from your observations. But what if it were brought to your attention as a new board member that some low income patients of one of Harvey's clinics came to?'",
        "'speaker_1': 'The board or the board found out that there are allegations that they're being abused or misused are not treated adequately. I want to know how you would handle that kind of situation.'",
        "'speaker_0': 'And thank you for the for the question for the important question. And you will note in my comments that because I have I have seen firsthand and under very difficult circumstances the incredible grace of the staff at Harborview that I would find it I would find it shocking.'",
        "'speaker_0': 'But as someone who has been a part of the management structure of this organization with 13,000 employees, and knowing that there isn't perfection that that takes place every day, you do have to step in and you do have to step in seriously and raise issues.'",
        "'speaker_0': 'And when you when you hear them and you have to do it immediately. So I would have no I would have no hesitation about raising it with Paul and with the staff. And in fact, I would see that as my obligation.'",
        "'speaker_2': 'I'm sorry that Paul Hayes is the executive director at the hospital.'",
        "'speaker_0': 'My apologies.'",
        "'speaker_2': 'To.'",
        "'speaker_0': 'Councilmember Gordon right there.'",
        "'speaker_2': 'Well, thank you, Madam Chair. First of all, I want to thank Councilmember Garcia for clarifying where he began his remarks. In this era of getting nervous, everybody is is a long term relationship and friendship. Cheryl, first of all, congratulations and thank you for your willingness to serve.'",
        "'speaker_2': 'Those of us who have worked with you in the past and know the skills you're bringing. And I want to thank Councilmember Claudia Baldacci for recommending you for this confirmation. I share with you my belief that our review is one of the one of the gems of King County, who truly has produced a service that across the'",
        "'speaker_2': 'board, blue collar, white collar, no car is happening. A hospital that has received and served so many people, and those of us who have had relatives or friends who have gone there, have always, in my case, received nothing but positive feedback by the people who work there, because a hospital alone is not what makes it work.'",
        "'speaker_2': 'It's the people who work there and the service they provide and the quality of service and care. And I agree with you, I've heard nothing but positive feedback as you look at the budget, which something that you've had a keen background with with Executive Sims, as you look at the problems, the financial problems, what are some of'",
        "'speaker_2': 'your personal and professional concerns about the place of medicine and general and specifically as it relates to Harborview?'",
        "'speaker_0': 'So thank you. I have as because I haven't yet attended a board meeting. I'm not I'm not deeply ensconced in the the on the details of of harbor of his budget. But certainly as as a resident of this county, of this state, as a citizen of the U.S., when you look at the overall issues that frame and'",
        "'speaker_0': 'Medicaid and the health care structure in general, we're in a period of flux and it's it's unknown what's going to happen with that. So I'm I go in with a very clear eye as to the importance of and of health insurance and whether or not the fragile population that Harborview serves will continue to have access to health'",
        "'speaker_0': 'care and what that means in terms of reimbursements and just the bottom line for the hospital. So that is one of the things that I will be I'd been watching it before and having this honor to be sitting on this board.'",
        "'speaker_0': 'It's something that I've been extremely passionate about. And so I am I'm deeply, deeply concerned and interested in that you might see in my. Resum that I'm also a board member at DSC Downtown Emergency Services Center and at DSC.'",
        "'speaker_0': 'We are on we are working on issues of behavioral health, particularly on that and how that interfaces with primary care and the funding and of of both of those systems. So I have a very a very keen eye for that and will be we'll be watching and to see how how I can be useful and where we'",
        "'speaker_0': 'proceed as a country in addition to to what's happening here in the region.'",
        "'speaker_2': 'Well, again, I think the only constant in this world is change. And we see the change every hour and day and the needs by which health care. I sat on our board for 12 years. The Franciscan Health System, which is a nonprofit, takes in St George, St Clair, St Francis, St Anthony's.'",
        "'speaker_2': 'I wish I was looking for fire insurance, but at the end of the day, we looked at change. And and my concern again is about mergers and how we try to figure out ways to make the hospital financially secure it.'",
        "'speaker_2': 'We're we were a nonprofit, obviously a Franciscan health system, but you're a nonprofit. And again, unfortunately, nonprofits can end up in debt and then collapse. And right now, I look at the some of the challenges facing UW medicine in general.'",
        "'speaker_2': 'And our review in particular. And I'm worried. So I think it's really important that someone with your background understands as much as we may want to serve as many and as often and as much, we may collapse the system in the process.'",
        "'speaker_2': 'So it's very important to bring your judicial and balanced view to understand there is a price to be paid and a financial accountability in the long run.'",
        "'speaker_0': 'So I agree. Thank you, sir.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'I can't remember Up the Grove, followed by Councilmember Lambert and Councilmember Dan Belsky.'",
        "'speaker_2': 'Thank you, Madam Chair, and thanks for your willingness to serve. As you well know, Harborview has a unique mission, at least in this state, in terms of that public mission. And there's a special relationship between the county and medicine, and we value them as a partner.'",
        "'speaker_2': 'But there are times where the values and priorities may differ between the senior staff at UGA Medicine and the Board of Regents versus the County Council and the county executive. And we've tried to spell out in our agreement certain values and sometimes we interpret those differently and we see it most notably around employee relations sometimes.'",
        "'speaker_2': 'And I think often a majority of this body and the county executive view part of that public mission as setting the example for how we treat employees. And often we've seen you dub medicine in the in the desire to save costs really kind of do that hard nosed business model.'",
        "'speaker_2': 'Bottom line, how do you navigate that? Where do you see your responsibility as a board member when there is sort of a little bit of a difference in approach and values between You Dove Medicine and King County over issues like particular employee relations or compensation and contracts and things like that.'",
        "'speaker_0': 'And it's a challenge, right? I mean, it's a it's a big deal. It's a challenge. But this is in my mind, this is public service. And the the the varying points of view, the bottom line and the care that we want everyone to receive.'",
        "'speaker_0': 'All of these things require a balance. And I have and after the 20 years of battle scars here, I, I just I don't have fear about this issue of I'm trying to because because I believe that that everyone is trying to get to the best possible place as it relates to providing excuse me, providing services to the'",
        "'speaker_0': 'community. So knowing that we have our eyes on the prize of how we're trying to move forward and trying to then be able to reconcile and and work through tough issues. And I, I think that's I think that's the job of the board.'",
        "'speaker_0': 'Right? I think that's I think that that's our responsibility to hear where all the concerns are and then to set to set to set a course. So I'm in the end on the hypothetical of, you know, what may come about.'",
        "'speaker_0': 'And I'm I'm I'm not afraid of that and have spent 20 years of my county government career doing precisely that, listening to to the various concerns, understanding the financial impacts. And but I'll say about the employees that they are the miracle.'",
        "'speaker_0': 'I mean, they they are what is what is making that that place move. And so their their concerns and their ability to do a good job has to be a North Star for for the organization. And I and I hope I hope that to be the case because, in fact, they're the ones when you when you talk'",
        "'speaker_0': 'to anyone who has had an interaction up at Harborview, it's how they were treated, the expertize that was brought to their room and that and the dignity that they were shown. All of that is critical so that the employees as far as I felt this way when I worked at King County, I'll bring that attitude to to'",
        "'speaker_0': 'this board that the that the Louisa are central to this as a Lambert thank you to you and your expertize and it gets to the adage if you want something done, ask a busy person. So thank you for being able to do that.'",
        "'speaker_0': 'And everybody said what I wanted to say, so I'll just say ditto. On the idea of interfacing the DC population with the Harborview population and also 1811 House and. Now those facilities have one another mutually to make sure that people are treated with respect and also on a path to changing their lives.'",
        "'speaker_0': 'And also the the contract that we have that's wonderful with your job and making sure that their financial viability going forward doesn't negatively impact us. And having that really clear conversations, that may not be easy. And I know for your experiences here and sitting in conversations I watched, I know you can have those conversations quite well.'",
        "'speaker_0': 'So thank you for being willing to say, Hey, customer.'",
        "'speaker_3': 'TOMASKY Thank you, Madam Chair, and thank you for bringing this nominee forward. She touched on her experience in the Budget Office, which at the time was done on the fourth floor of this building.'",
        "'speaker_0': 'If I ask you, you're dating me. But yes. Oh, I'm dating myself.'",
        "'speaker_3': 'I'm dating myself. I worked across the hall. I mean.'",
        "'speaker_0': 'Yes, in executive.'",
        "'speaker_2': 'Walks, the executive.'",
        "'speaker_3': 'Office because it was there, too.'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_3': 'But Cheryl, I think you touched on this in the response that comes up, the gross inquiry. I think one of the most powerful tools you will have as a board member, an independent board member representing the best interest of the hospital.'",
        "'speaker_3': 'Its mission is its budget approval for the hospital. Right. And your budget experience and your expertize there, I think will be a very powerful and that plays into, I think, a lot of the issues that we care about with respect to how we look to Harborview to serve its mission population.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_3': 'And in the course of our negotiations with the updated contract with the University of Washington, which I encourage you to read and a motion surrounding it, we updated that mission, keeping it central tenants, but emphasizing them to make sure we reminded the hospital that we're there to serve that mission population is those who are uninsured, immigrant and'",
        "'speaker_3': 'refugee communities, you know, traditionally underserved populations. And even with the Affordable Care Act, I think, as you know, there's still five or so percent, maybe more of the population who are not covered by insurance because of the exclusions in that.'",
        "'speaker_3': 'And I'm I'm hopeful that we as a community working in partnership with Harvey and you that medicine can look at filling that gap which would be consistent with our reviews mission and would be interested in working with you on that.'",
        "'speaker_3': 'Great. With respect to the budget, I'm not sure I have some questions here. We just want to get well dialog. Now, one of the things that we did with the Harborview Agreement with University of Washington was for the first time ever, strike a deal where you don't mess and pays about.'",
        "'speaker_3': 'I think that we're only $5 million a year into our public health fund now. They can do that in cash or trade. So far it's been cash, but those dollars have been life saving for our public health department that's been cut there.'",
        "'speaker_3': 'And I want to call that provision to your attention. There's there's a that's a challenge is the budget is tight in the medicine world and, you know, medicine and and I ask that you watch that and be continue to be supportive of that because it's you talked about keeping our eye on the north star of serving the'",
        "'speaker_3': 'population it well it's two different entities public health and you're missing they are serving that same part.'",
        "'speaker_0': 'Of the country.'",
        "'speaker_3': 'Because we were up the grove talked a little bit about employee relations and labor and there are some provisions in the contract new that address labor relations. And unfortunately, from my perspective, it's continued to be an ongoing struggle.'",
        "'speaker_3': 'And I was very pleased to hear your response to concern about the groans about your commitment to the workers, because they are the health care is not the building. That's right. It's not the machines necessarily. But but it's them.'",
        "'speaker_3': 'And I hope that you'll carry that philosophy forward.'",
        "'speaker_0': 'And absolutely.'",
        "'speaker_3': 'And remember that as a trustee, you're, of course, there for the for the community. Like my question getting to it is I noticed in your publications that you've got extensive experience and work on issues surrounding equity and social justice and leveling the playing field.'",
        "'speaker_3': 'Yes. And you are no doubt aware of the major demographic shifts where our review at one time was in the epicenter of probably the community that was least served in terms of access to quality health care. But geographically, now, many of those patients live far away right now, you know, is a terrific partner and maybe helping solve'",
        "'speaker_3': 'the challenges that creates because of their clinic footprint throughout the county. And I wondered if you've got thinking or ideas about how we could take Harborview and its wonderful partnership with you, that medicine to it to address disparities countywide, particularly as they become more geographically spread and.'",
        "'speaker_0': 'Great. Great question. Great issue. And I so I'll be honest with you, that that my. My uninformed kind of knee jerk reaction to that would be to talk about that footprint of clinics that are that are spread throughout the region, that that's absolutely critical and you're absolutely spot on that the how the population and that we see'",
        "'speaker_0': 'the. They call it the in academia the suburbanization of poverty that it is that that we need to think so differently about these issues. I talked about my work at DSC, where we're working with this chronic homeless, mentally ill population and its work has been centered in in Seattle, but that we have been talking as a board'",
        "'speaker_0': 'about how are we supportive to those communities that are that are seeing the same issues that are taking place around around the county. So this is on top of mind and deep and heart for me as an issue.'",
        "'speaker_0': 'And very, very I'm very clear that that the city of Seattle itself is not the sole epicenter and that that these issues are are around the region. So I, I carry that issue with me in my lens about service provision.'",
        "'speaker_0': 'And I hope to, to understand this more thoroughly and what is actually happening on the ground, because I know a couple docs that work out in the surrounding the surrounding communities. I know that those services are taking place, but I would but it's something they need to know a lot more about and what access looks like for'",
        "'speaker_0': 'people.'",
        "'speaker_2': 'Who are at the heart of.'",
        "'speaker_0': 'Of harbor views, service population. I want to give Councilmember Gossett the last word here.'",
        "'speaker_1': 'I thank you. One final question. I appreciate that, Madam Chair. And this is I kind of follow up on what Councilmember Dombroski was asking, you know, about staff relations. While you were one or Ansell's top deputies, he was successful in getting a couple of policy changes through the King County Council, one of which had to do with'",
        "'speaker_1': 'contracting out. So we actually passed some policies and that for these workforces, King County has a policy of not allowing those services to be contracted out. So hypothetically speaking, if a situation arose where the University of Washington has day to day managers at the hospital say, well, we need to save money.'",
        "'speaker_1': 'So these workers at Harborview or that are served by Harborview, we don't have to, you know, contract that out because we've got to save money. Just I mean, you can vote the way you want to vote for. What would you take into consideration and taking that kind of vote should you be confirmed today?'",
        "'speaker_0': 'And I would be I would be thinking about precisely the issues that we thought about here when we were talking about not wanting to degrade our service level for for a bottom line. What we one of the things that I feel very proud of King County government for is working with employees, working with labor in order to'",
        "'speaker_0': 'solve heart problems and the the unions and what we you know, we have many here at King County are not and are not naive about what about the financial position. So I don't come at this thinking it's an it's an us versus them or it's that black and white.'",
        "'speaker_0': 'I my tendency because my experience is that working with employees and working with labor, that you actually get to some good, you get to some good answers. And that translates into a bottom line as it did here when we worked on health care issues.'",
        "'speaker_0': 'And that actually worked and in pocket actual real life savings, not glossy and not just happy talk, but real life savings. So my my inclination is to try to be working in partnership and to see where we can actually achieve that, you know, what's real, that you need to balance the budget.'",
        "'speaker_0': 'But at the same time, being able to work with the people who know that work in order to be able to come up with solutions. I've seen it. We've all seen it. We we have done that here.'",
        "'speaker_1': 'Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. And I really. Appreciate your being here and answering all our questions. I think we're all i, i although this is one of the longer interviews we've done, I think everybody's very excited to, to have your expertize and deep experience and obviously carrying on on the board.'",
        "'speaker_0': 'So at this point, I would entertain a motion to approve proposed motion number 2017 0507 appointing Cheryl Whitney to the Harborview Medical Center Board of Trustees with a do pass recommendation. Thank you, Madam Chair. I would like to make that motion.'",
        "'speaker_0': 'I'd like to propose motion. 2017 0507 the do pass recommendation. Thank you. And moved and seconded. Any comments or questions? All right, all those in favor please signify by saying I. I opposed.'",
        "'speaker_2': 'All right. I thought we had broken.'",
        "'speaker_0': 'Oh, I'm sorry. Is that a roll call vote? Let's call the roll. Thank you. Thank you. Council member and Staff Council Member. Dombrowski Council Member. Dunn Council Member. Gossett I Council Member. Commonwealth Council Member. Lambert High Council Member.'",
        "'speaker_0': 'McDermott High Council Member of the Grove. Council Member. Von Richter.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Madam Chair, I. Madam Chair, the vote is seven is no nos. Council members Dunn and Caldwell's excused. Thank you. By your vote. You have passed the motion and thank you again for your service. This can go on concerns and most people want to revisit and invite Miss Whitney back again.'",
        "'speaker_0': 'All right. Well, let's put it on consent and on regular order. And this will come before the council in two weeks. Thank you so much. I know it's a it's going to be very exciting to work with you.'"
    ],
    "Establishment of a King County Immigrant and Refugee Commission.": [
        "'speaker_0': 'All right. Our next item is ordinance number 2017 0481, which would establish a King County Immigrant and Refugee Commission. This was a follow up to a recommendation by the King County Immigrant and Refugee Task Force. And today we're just receiving a briefing.'",
        "'speaker_0': 'And here to brief us are council staff members Andrew Kim and Mike Reid. Welcome.'",
        "'speaker_2': 'Thank you, Madam Chair. Mike reads as deputy counsel. I'm here, as you indicated, with Andrew Kim, and we will provide a brief bit of background on this. This ordinance actually starts on page 17 of your packets. So as you've indicated, Madam Chair, that the discussions on this this topic began in 2015 when the council was presented with'",
        "'speaker_2': 'information about the increasing numbers of new arrivals from throughout the world that were settling in King County. Demographic and sensitive information confirmed that there had been a significant increase in the immigrant refugee population. Council discussions at that time centered on means to address the challenges faced by these populations, as well as means of assuring access to county'",
        "'speaker_2': 'services for these populations. The concept of a commission had been suggested as a means to address these concerns. The parameters, however, of such a commission were uncertain, particularly regarding representation on a such a commission. So the the council at that time in 2015 established a task force on immigrant refugees to make recommendations about the shape and character'",
        "'speaker_2': 'of such a commission. Again, addressing representation and addressing structure, addressing its purpose and the duties of such a commission. That task force began meeting in October of 2015 and continued this meeting through through June of 2016. I'd held meetings throughout the county and it hosted input from a significant number of members of the immigrant Mexican community to'",
        "'speaker_2': 'get their their ideas about the shape and character of such a commission. A final report was developed and issued in July of 2016. That report actually is in your packets, I believe, on page 39 of the packet. That became the basis for the development of the measures before you today and which resulted from discussions between the executive'",
        "'speaker_2': 'and the and council staff for its formulation. Andrew will take it from here. Thank you, Mike. Good morning, Madam Chair. And Council Members, Andrew Kim, a council central staff. I'll continue the briefing by summarizing key provisions of the proposed ordinance.'",
        "'speaker_2': 'This can be found on page 19 of your staff report. Section three outlines the purpose of the Commission. The two primary responsibility of the Commission are one to act as a central point of contact, communication and coordination of all stakeholders serving and engaging immigrant and refugee residents.'",
        "'speaker_2': 'The the task force states that this responsibility would fill a significant gap, since no organization or group plays a central role. The task force also states that this will help to take a regional approach to complex issues that stretch across multiple municipalities.'",
        "'speaker_2': 'And the second responsibility, primary responsibility, is focus on. Focusing on understanding and addressing challenges faced by immigrant and refugee communities living in suburban cities and unincorporated areas of the county. The task force states that this responsibility would help alleviate the lack of county resources invested in suburban and incorporated communities, which disproportionately impact the immigrant and refugee communities'",
        "'speaker_2': '. Going to page 20, Section four outlines the criteria of the 17 member board where 13 are voting members and four are non-voting members. I won't list each criteria here, but you can find the criteria of the voting members on page 20.'",
        "'speaker_2': 'The four non-voting members are to be community leaders that are actively engaged with local government, business or philanthropy, philanthropic organizations to raise the visibility and capacity of the Commission. Section five outlines the joint effort between the Council and executive in conducting outreach to solicit candidates.'",
        "'speaker_2': 'It also directs that the list of candidates for appointment would be finalized by a Joint Committee of Executive and council representatives and past commissioners. Section six requires the Commission to produce an annual report to the Council and to make the annual report.'",
        "'speaker_2': 'Related briefly and related briefings available to the community. Section seven requires the Commission to convene at least monthly with four Commission meetings to be held in suburban cities or unincorporated areas and to hold at least one large community briefing each year.'",
        "'speaker_2': 'Section eight requires that an employee from the Office of Equity and Social Justice and one Council employee staff the work of the Commission. And lastly, Section nine requires the executive to reimburse Commission members for travel expenses and or parking fees for attending meetings, starting on the bottom of page 21 Staff Writer.'",
        "'speaker_2': 'Some additional analysis the proposed ordinance incorporates, as Mike said, most of the recommendations from the Immigrant and Refugee Task Force report. However, it does not incorporate all the recommendations. Some of the key differences include. Number one, the task force recommended providing an honorarium or stipend to commissioners.'",
        "'speaker_2': 'However, this is not included in the proposed ordinance. Another difference is that the task force recommended three staffing options where they strongly recommended an option to establish an office of Immigrant and Refugee Affairs. The proposed ordinance shows the lowest cost staffing option of of providing one FTE to support the work of the Commission.'",
        "'speaker_2': 'And lastly, the task force provided no recommendation on age as a factor for Commission membership. But the proposed ordinance includes a requirement that members should represent a range of age groups, including persons representing youth issues. Lastly, the annual cost to support the work of the Commission is estimated to be approximately $147,000.'",
        "'speaker_2': 'The breakdown of that cost is listed on page 23. Madam Chair, that concludes our staff report. And and we have several members of the Immigrant and Refugee Task Force joining us today and as well as executive staff from the Office of Equity and Social Justice.'",
        "'speaker_0': 'Okay. Thank you for that briefing. I understand, Councilmember Garcia, your office has been working on this. Would you like to say a few words or begin the discussion?'",
        "'speaker_1': 'Yes. Thank you very much, Madam Chair. I have some questions for our staff, but I'm also going to have some questions for the folks that he mentioned that are present. First of its staff, why does it say that this commission will only deal with issues relative to immigrant and refugee folks who reside in unincorporated Kane County or'",
        "'speaker_1': 'the suburbs? The reason I ask that is that I represent a district that's 90% okay in Seattle, and I've had bukele meetings. I mean, I've had many meetings in South Asia with Eritreans, Ethiopian Somalis, Thai Vietnamese and on the recent killing and and not dealing with refugee problems in the city of Seattle.'",
        "'speaker_1': 'What's the thinking?'",
        "'speaker_2': 'Yes, Councilmember, let me clarify that. So the work of the commission doesn't exclude the work that they would do for the entire county, but it does and includes the city of Seattle and other areas of King County. But what it does do is that it calls out the commission to focus on issues concerning immigrant refugees that live'",
        "'speaker_2': 'in the suburban and unincorporated areas. So rather than is not limiting their work to those communities, but it's asking them to make that a focus of their work. And I might I might briefly add that you may recall that that over the course of the work, the task force, there was input from members of the community, noting'",
        "'speaker_2': 'that historically the focus had been on immigrant refugee communities within within urban areas or within the cities themselves or within the city, Seattle in particular. But that there was an increasing concern about the limited access and limited resources that were available to immigrants and refugees who lived in suburban cities or in the unincorporated area, which tended not'",
        "'speaker_2': 'to receive the same degree of attention. So this was an attempt to highlight and focus on the the that concern.'",
        "'speaker_1': 'Okay. And Andrew or Mike, originally somebody said that they thought the commissioners should get paid 20 that idea come from.'",
        "'speaker_2': 'So the concept of the honorarium or stipend was recommended by the task force. So in the task force report which is attached to to your staff report, they they recommended that that the the commission members be compensated for their work because many of the commissioners are often overworked and asked to serve on many other committees.'",
        "'speaker_2': 'So that was the task force's recommendation. But it's not included as as part of this proposed ordinance.'",
        "'speaker_1': 'It's not a part of it. See, because I've been involved in I think I've been a county council member for 24 years and we've set up a lot of I mean, I was the sponsor of the Civil Rights Commission back in 96, and my co-sponsor was Kent Pullen.'",
        "'speaker_1': 'So we wanted bipartisan support. And then I've been involved in sort of a lot of task force and advisory groups and never have we had as part of the mandate to pay people for the advice that they give us.'",
        "'speaker_1': 'So my fear was that if we set a precedent here, we'd have them all coming back, say, we're overworked and we're giving our service like watch all because that wasn't paid time. So I'm kind of happy that wasn't included in the final document.'",
        "'speaker_1': 'Thank you, Manager.'",
        "'speaker_0': 'Thank you, Mr. Bassett. Any other councilmember up the grove?'",
        "'speaker_2': 'Thank you, Madam Chair. And this may be a question for the sponsor, unless staff has some context. Well, one one super quick, easy question. And then the one I was saying, one is the assumption and I didn't look at the fiscal note.'",
        "'speaker_2': 'Are there funding sources other than general fund available? Were that 147 likely come out of general fund? It would most likely be coming out of the general fund. A majority of that cost is its personnel cost. And the executive staff have noted that that 0.5 FTE that was staff that commission is that there's an existing employee in'",
        "'speaker_2': 'the Office of Equity Social Justice. So we wouldn't be adding additional funds, but it would be kind of existing expenses, right. At least from the executive side on the council side, that that has yet to be determined. But yeah, which was my question.'",
        "'speaker_2': 'And this I don't know if it's more appropriate for the sponsor or to see if you to take a stab at it. In terms of the rationale for having part of the staffing come from the county council staff, it's a little bit different.'",
        "'speaker_2': 'We the Women's Commission, the Civil Rights Commission, or many of our other county task forces. Art. We have staff here that will support our work on those, but we don't have dedicated staff, that is, to staff the commission and wondering what the thinking was in terms of why.'",
        "'speaker_2': 'Why for this particular commission, we would have the legislative branch provide part of the staff support. And so against I just kind of want to understand it. Yeah. So when, when, when, when we were drafting the proposed ordinance with members of the different council offices because the immigrant and refugee work was more of a collaborative approach, even'",
        "'speaker_2': 'the task force, I think, I believe, was staffed by a council staff member and an executive staff member. I believe they wanted to take that collaborative approach to the commission as well. So which is the reason for that?'",
        "'speaker_1': 'I I'm going to add to that because you said maybe the sponsor might want to say something about this. I support the idea of the commission having on staff and that would be half from the executive and a half from us.'",
        "'speaker_1': 'But my rationale is more political than anything else. With half the staff, the half time staff person being a part of our staff, the I think that the accountability of that person to the priority issues relative to immigrant and refugee populations in King County that are now almost 19% of the total, we'd have more of a say'",
        "'speaker_1': 'compared to where they are leaving the staff support and the staff are all in the executive. That was my thinking. Thank you.'",
        "'speaker_0': 'Any other comments or questions. This is not actually a we can take action today if we're prepared to, but it was on for a first briefing today. So it's the looking around to see the will of the body.'",
        "'speaker_0': 'Then we will want to just do it. I'm seeing some desire to do it. Councilmember Garcia, would you be willing to put proposed ordinance number 2017 0.1 before us?'",
        "'speaker_1': 'But of course, I don't care.'",
        "'speaker_0': 'I refuse. Yasmin, it is commendable.'",
        "'speaker_1': 'I would like to propose that the King County Council adopt ordinance number 2017. That's 0481, establishing an immigrant and refugee commission here in King County.'",
        "'speaker_0': 'It's been moved by the do pass recommendation. Any other comments or discussion before we move to a vote? I will say just one thing. I want to appreciate the members of the commission who worked so hard and on a volunteer basis to to make these recommendations that were now starting to move forward with, thank you for your'",
        "'speaker_0': 'work. I see a lot of friendly faces out there and thank you Martires also for being along with us. I look forward to seeing this body come together and I'm excited about the work that we'll be able to do with this kind of support from the community.'",
        "'speaker_0': 'All right. Councilmember Tomasky, the.'",
        "'speaker_3': 'Thing that I'm sure just very briefly, I appreciate the action here by the committee today. I want to also thank the members of the task force. A couple of years ago, when my office was working with Councilmember Gossage to kick start this initiative, I said, why don't we just form the commission?'",
        "'speaker_3': 'Let's just let's just cut to the chase. Why don't we just have one? And my staffer, Christina Logsdon, who's put a lot of work into this, said, well, you'll get a better product if you work with the community.'",
        "'speaker_3': 'And I think that today's legislation bears that out, that the task force process and the deliberative approach that they've taken in conjunction with the executive's office has led to a thoughtful proposal, I think, before us today that will stand the test of time.'",
        "'speaker_3': 'And so I just want to take a moment to thank the task force for their thoughtful work and thank my staffer, Christina Logsdon, for her work on this and commitment to these issues. And just one final thought on the compensation experience that you had.'",
        "'speaker_3': 'Some some words on. My understanding of this issue is, frankly, it's again and again we go and we turn to leaders in the community for their expertize and advice, who often face additional challenges and hurdles in just kind of getting through the day, to put it bluntly.'",
        "'speaker_3': 'And this notion of of kind of going to the well for free, I think, to some degree comes from a real privilege, the attitude that some of us have more time and resources to be able to do that.'",
        "'speaker_3': 'And I think we should think about in the future whether or not we are taking that privileged viewpoint and not reflecting on what we're asking folks to do for free. And it can be a burden and a barrier to service and therefore impede the work that we want and the results we want from organizing from groups like'",
        "'speaker_3': 'this. So I'm open on that question and I don't think it has to apply universally, but in a particular case, particularly on immigrant refugee community commission, immigrant Refugee Commission, that might be staffed by folks who faced more challenges in our community and we're service without compensation is a higher barrier, but something I think we should look at'",
        "'speaker_3': '. So I'm I'm.'",
        "'speaker_1': 'Okay. I don't have any problem with looking at it. I think that those who advise on juvenile and adult criminal justice issues could make a case that they're providing invaluable services that or they aren't getting paid. I also think that people who are advising us on, you know, any emergency setting up an effective emergency services strategy in'",
        "'speaker_1': 'King County could make a case and they would bring up Katrina in not having adequate means of reaching out to the poor and disadvantaged. And they're often invisible. So so many groups that we have set up advisory boards and commissions for over the years that would make the case for that.'",
        "'speaker_1': 'But I definitely do not mind having that discussion with you and other members of the county council and the community as we move forward.'",
        "'speaker_3': 'Again, thank you. Thank you.'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'My sense is that the. Decision is not made by this action today. It's just not in it. It's a silent as to this issue. And so it remains sort of an open issue, I believe. That's correct. Okay. I will add my $0.02 that I think it's important that we, at a minimum, give people food when they come'",
        "'speaker_0': 'to these meetings. It just everything goes better when you feed people a second. Yeah. As a member of the group.'",
        "'speaker_2': 'Thank you, Madam Chair. The discussion made me want to weigh in as well. I think as a matter of philosophy, I agree wholeheartedly. The challenges, as Councilmember Gossett mentioned, this is an are only condition. And are we in a position to be able to afford to do that?'",
        "'speaker_2': 'And how do we do it equitably among our different volunteer agencies and do it? And which leads me into my my budget grump comment on budget terrorism. I love this work. I'm excited to support it. Obviously, I think we need to watch moving forward for bureaucratic creep and make sure that this is lean, mean and focused on'",
        "'speaker_2': 'delivering the services. You know, there are some staffing models proposed that were significantly more costly and more robust than other task forces. There's a recommendation to look at opening a new office. I think we need to recognize that we're taking this progressive and exciting step forward in a budget landscape where we continue to have our ability of'",
        "'speaker_2': 'revenue to grow beyond 1% plus new construction and have other pressures, you know, whether it's underfunded public defense system, a 500 felony case backlog in the courts, you name it. So I think one of our challenges will be to make this as effective and deliver the results that we need for this community while also being able to'",
        "'speaker_2': 'fund the direct services that benefit immigrants and refugees as well. So that's my my budget grump were a word of caution about some of it. But that being said, this is a long time coming and it's, I think is going to be an important tool, particularly for the folks I represent in South King County.'",
        "'speaker_2': 'In our discussion with the Harborview appointee, we talked a little bit about the suburbanization of poverty and the shifting demographics. And in these small suburban communities down south, you don't have the centralized government like you have in Seattle.'",
        "'speaker_2': 'You don't have cities that have the professional staff and expertize to do the kinds of community engagement and service delivery that's needed. At the same time, we have probably the most diverse population and in particular the largest concentrations of immigrant and refugee populations.'",
        "'speaker_2': 'So having the county take a step forward to centralize and streamline and improve our work to serve that population, particularly with the you know, I obviously don't object to the line that Councilmember Gossett was exploring serving the whole county, but having a little bit of a focus on those suburban and unincorporated areas, I think isn't necessarily a'",
        "'speaker_2': 'bad thing. And so I'm really excited about this and appreciate Councilmember Gossett, bring it.'",
        "'speaker_1': 'Forward.'",
        "'speaker_0': 'Okay. Any other questions? Comments? I'll ask the court to please Calderon. Thank you, Madam Chair. Councilmember Dombrowski. Councilmember Dunn. Hi. Councilmember Garcia. Hi. Councilmember Cornwell's Councilmember Lambert. Councilmember McDermott. Hi. Councilmember of the Grove. Councilmember Yvonne Ricardo. Madam Chair.'",
        "'speaker_0': 'Hi, Madam Chair. The voters are nice. No noes. Councilmember Caldwell's excused. Thank you very much. By your vote, proposed ordinance number 2017 0481 will move to the full council with a do pass recommendation. I think we will not put this one on consent.'"
    ],
    "Memoranda of Agreement on Health Networks and Benefits Plan Designs for King County Employees.": [
        "'speaker_0': 'Councilmember Gossett So this is an opportunity to speak to it. Okay, very good. All right. Thank you very much. Staff. We will move on to proposed ordinance number 2017 0475. This item would approve and adopt two memoranda of agreement with the Joint Labor Management Insurance Committee, which represents benefits eligible employees represented by labor organizations except transit operators'",
        "'speaker_0': 'and sheriff's deputies. Understand, we have an updated fiscal note that will be passed around, hopefully from what was included in the packet. Is that correct? That is correct. Thank you. And here to welcome our guests and give us a briefing is council staff Heidi.'",
        "'speaker_0': 'Papa Chuck. Thank you. Thank you, Madam Chair. How do you provide our council staff? And also to my right is Bob Railton of the King County Office of Labor Relations. To his right is Denise Cobden from Professional and Technical Employees Local 17 Union.'",
        "'speaker_0': 'And to her right is Kari Schaefer from the King County's Human Resources Division. The staff report begins on page 99 of your packet. Madam Chair, as you mentioned, proposed ordinance 2017 0475 would approve to joint labor management insurance.'",
        "'speaker_0': 'Or JL am I c memorandum of Agreement or. Emojis. The first emoji would adopt an accountable health network or a H, and there's going to be a lot of acronyms in this presentation benefit plan designed for 2018 and 2019.'",
        "'speaker_0': 'The second emoji would adopt the Health Maintenance Organization or HMO and preferred provider organization or PPO plan designs for 2019, and replace the Health Incentives Program with a health and well-being program tomorrow. To provide some background on the J.L. and Missy.'",
        "'speaker_0': 'It consists of labor and county management representatives that collectively bargain ensure benefits for county employees except those that are part of the Amalgamated Transit Union, the Kane County Police Officers Guild, the Puget Sound Police Managers Association representing captains and the Technical Employees Association representing employees in the transit division.'",
        "'speaker_0': 'They share benefits in most union contracts and for now represented employees are negotiated by this committee. In November 2016, Council adopted Ordinance 18405, which approved the employee regarding insured benefits. And this meeting I recall that the benefits agreement between king county and the I c unions that prescribed medical, dental vision and life insurance benefits for del amici'",
        "'speaker_0': 'eligible employees for 2017 and 2018. There are three benefit agreement conditions described on page 100 of your packet that relates to proposed ordinance 2017 0475. The first condition describes the health and welfare plans the insured benefits plan provisions for JL Mis-C eligible employees during the term of the benefits agreement are described in tables one and two on'",
        "'speaker_0': 'pages 100 and 101. The plan provisions in these two tables are tied to the county's Healthy Incentives program, which requires county employees to complete a wellness assessment and an individual action plan such as like Weightwatchers or to work out for six weeks prior to July 31st each year in order to achieve the goal level of the benefit'",
        "'speaker_0': 'plan for the following year. The goal level benefit plan has the lowest out-of-pocket costs to achieve the silver or silver level benefit plan. Employees are required to complete the wellness assessment or the Individual Action Plan prior to July 31st each year.'",
        "'speaker_0': 'If an employee does not complete the wellness assessment in the Individual Action Plan by the deadline, they would maintain the bronze level benefit plan, which has the highest out-of-pocket costs. All county employees start at the bronze level benefit plan.'",
        "'speaker_0': 'The employee's spouse or domestic partner would also have to complete the same requirements in order to achieve the gold, silver or bronze level benefit plan. The second condition describes the G, the J.L. and Mike's ability to negotiate and implement modifications to ensure benefits for JL am i c eligible employees during the term of the benefits agreement?'",
        "'speaker_0': 'The third condition describes that the deal and MRE will add supplemental plan options beyond the HMO plan and that PPO plan for the 2018 benefit year in 2017. Council approved motion 14877, which acknowledged the receipt of the executive's budget proviso response report on accountable health networks or in the report can be found on page 119 of your'",
        "'speaker_0': 'packet. In addition, the third condition describes that the JL and Massie agrees to negotiate changes to the Healthy Incentives Program to be effective for the 2018 benefit year. In accordance with the Benefits Agreement, the first proposed J.L. and Missy Millard would adopt an eight, eight and a plan for the 2018 benefit year, according to executive staff.'",
        "'speaker_0': 'And an 18 is a form of value based purchasing. It brings together physicians, hospitals and other partners into focus networks for the amount of money the network receives for treating a population of patients is based in part on the quality of care that they deliver and the patient satisfaction satisfaction with the care they experience.'",
        "'speaker_0': 'Executive staff offer the age and plan in the open enrollment period for benefits in 2018. The proposed ordering, which was transmitted to the Council on November 1st, 2017, would approve the HRA and plan designs for 2018 and 2019.'",
        "'speaker_0': 'Table three on page 103 illustrates the 2018 and 2019 King Cares. Select a H and plan design that was agreed to by the JL and Missy. According to Executive staff, eligible employees will be able to select one of the four eight.'",
        "'speaker_0': 'Available in the Puget Sound region, Eastside Health Network, the Everett Clinic, Multi Care Connected Care and University of Washington Medicine. The proposed ordinance would also authorize the following provisions as an incentive to the select HMO plan option. The annual deductible for 2018 and 2019 will be $0 for per single, only with a maximum of $400 per family'",
        "'speaker_0': '. Beginning in 2020, the annual deductible rates will be $200 per single, only with a maximum of $600 per family. And also in the event that at least 15% of eligible employees elect the plan option during the fall 2018 open enrollment.'",
        "'speaker_0': 'The LMC will negotiate additional short term and or long term disability plans to be implemented no earlier than 2020. Should the JL and Missy reach an agreement on one end or both? Disability plan options? The county did not offer an HMO plan benefit plan option for its employees in the past.'",
        "'speaker_0': 'Attachment three on page 135 of your packet illustrates the 2018 benefit plan designs offer to eligible employees, which includes the term plan design, according to executive staff over 500 JL and may see eligible employees enrolled in the new Plan Kane Care Select for the 2018 benefit year.'",
        "'speaker_0': 'It was assumed by the county's benefit benefits consultant Mercer, that the shift in enrollment from Kane Care Taking Care Select will be approximately 5%, which equated to $110,000 in cost savings for 2018 and 2019 combined, according to the executive's fiscal new executive staff state that the and Missy achieved a 6% shift enrollment for 2018 cost savings could'",
        "'speaker_0': 'reach as high as 1.8 million if 25% of employees move from Comcare to Comcare select, which is the HMO plan. Executive staff also indicate that there were no Smart Care Connect, which is the HMO enrollees that shifted to Comcare select during the open enrollment period.'",
        "'speaker_0': 'Also in accordance with the JL and Missy Benefits Agreement, the second proposed JL and Missy Molly would replace the Healthy Incentives Program with a health and well-being program. The proposed ordinance would also adopt the 2019 benefit plan designs for the HMO in the PPO plans to reflect the alarm to reflect the elimination of the Healthy Incentives Program'",
        "'speaker_0': '. According to Executive staff, under the Health and Well-Being Program, starting in 2018, eligible employees and their spouse or domestic partner will no longer be required to complete the process steps of the Healthy Incentives Program to determine their benefit color level.'",
        "'speaker_3': 'Can you can you say that again, as I think that's some new magic there?'",
        "'speaker_0': 'Yeah. Yeah. So under the Health and Wellbeing Health and Wellbeing program, starting in 2018, eligible employees and their spouse or domestic partner will no longer be required to complete the process steps of the Healthy Incentives Program that in order to determine your benefit level by color, the gold, silver and bronze.'",
        "'speaker_3': 'That's a below forms with all of the tax, all of that, the business about how we're climbing stairs and running blocks, correct?'",
        "'speaker_2': 'You mean the way the ridiculously arduous and paperwork and necessary paperwork that everyone that's an employee can create, as I was referring to.'",
        "'speaker_0': 'So that is correct.'",
        "'speaker_3': 'All right. That was to the negotiators on that.'",
        "'speaker_0': 'Thank you to the gentleman.'",
        "'speaker_3': 'So we're going to tell us how it is determined.'",
        "'speaker_0': 'Yeah, okay. Okay, good. Can I ask people to please ask to be recognized? Thank you.'",
        "'speaker_2': 'We're just so excited about that. And then chair, I.'",
        "'speaker_0': 'I try to bring it in written. Thank you. So table for on page 104 of your packet illustrates the proposed plan designs for 2019. The plan designs are the same as the goal level plan designs for the HMO and PPO plans and 2018 shown in Attachment three on page 135 of your packet.'",
        "'speaker_0': 'According to executive staff, no significant cost savings are expected to be realized due to the discontinuation of the Healthy Incentives Program. Executive staff also indicate that the cost savings will be utilized to implement the Health and Well-Being Program.'",
        "'speaker_0': 'Council staff requested additional information on the count, the costs associated with the shift of employees to the goal plan who would have been in the silver and bronze plans and 2019 executive staff has provided council staff with a revised fiscal note, which is on the dice.'",
        "'speaker_0': 'I believe you have that to reflect this impact. The costs would increase approximately $600,000 to implement this proposed deal, and I am aware that concludes my staff report. Madam Chair, we are happy. To answer questions at the start.'",
        "'speaker_0': 'There will be some questions. Councilmember Gossett.'",
        "'speaker_1': 'Thank you, Madam Chair. Is there any way that all 13,000 of our staff are going to learn about or have already begun to learn about all this alphabet soup you just shared with us? And will there be anybody that I can check with to see if they have a sense that the staff understood all this?'",
        "'speaker_1': 'So the union's who?'",
        "'speaker_0': 'So as far as what they eat and benefit plan that was offered in the open enrollment process for 2017 and offered it will be available for the 2018 benefit year, in my understanding. Executive staff did provide some outreach and marketing materials for employees to kind of advise them of the new the additional plan.'",
        "'speaker_0': 'And as far as the 2019 changes for the healthy incentives, I will defer to executive staff on to to discuss the kind of outreach and educational steps to inform employees.'",
        "'speaker_1': 'Okay. So I'm going to offer an opinion and have before I have one more question for her.'",
        "'speaker_2': 'And Councilmember Gossett. Bob Railton, Labor Relations Manager. Office of Labor Relations. Kerry Schaefer actually is very much part of the communication process where we educate employees about the various planning choices that's available to them coming into open enrollment, as well as when employees first begin their employment with King County and they have an opportunity to select the'",
        "'speaker_2': 'plans. We do have a very, very extensive outreach and communication plan designed to help educate employees, both in terms of the plan options that are available to them, but the various sort of decisions that they'll need to consider as they determine which plan option is best for them and their family.'",
        "'speaker_2': 'Any more additional information term specifics? I'd have to turn to Carrie Schaefer.'",
        "'speaker_1': 'Carrie, do you think that we have a system where staff will generally become relatively educated on this new system or at least read health care reforms?'",
        "'speaker_0': 'Yes, Councilman.'",
        "'speaker_1': 'Again.'",
        "'speaker_0': 'I don't know if it's on. Okay. It's okay. Yes. Councilmember Garza, we have actually been educating employees over the past year. And you are hearing everything all at once. They've been hearing the story as it unrolls. So before open enrollment, we explained to employees what the new accountable health care, the King Care Select option was and what'",
        "'speaker_0': 'kinds of how they could make a decision whether or not that was a good plan for them, because it's not the best plan for everybody. It's a it's a good plan for some people, but not necessarily everyone. So there was a lot of education before open enrollment that showed people how to think about their plans.'",
        "'speaker_0': 'So that was the first piece. Then after open enrollment was done, we explained that that people in 2018 will no longer have to do the wellness assessment in individual action plan because in 19 it's sort of gold for all.'",
        "'speaker_0': 'Everybody will be at the gold level. So that's the second part of the communication. And that happened in December. And there was a video and it's it's been widely watched. And so people people have that part. And then starting this in February and going forward, we will explain the new kinds of activities people can do to be'",
        "'speaker_0': 'healthy. It's not tied to the level of plan you have, but it's a whole different way of doing wellness activities. So it's spread out over, over many months without trying to tell everybody all this and all of these things with all these acronyms all at the same time.'",
        "'speaker_1': 'So how would our health care and health advisory staff know whether or not this new direction that we're going is going to bear fruit? Like, how am I going to how are you going to know whether that says cancel out?'",
        "'speaker_1': 'The girl doesn't have to fill out the forms if he's still running and walking and exercising like he had been doing. How would.'",
        "'speaker_0': 'It work? We're not trying to keep track of what every single person does. We're looking at things that we can offer in the workplace that help people be healthy. And so. They too, have different ways that people can participate.'",
        "'speaker_0': 'But it doesn't. You're not going to have to fill out forms. It's not going to be tracking each person. It's going to be looking at what happens in larger workgroups and and measuring things like people's confidence that they understand the health plan, their confidence that they know, that they know things that they can do.'",
        "'speaker_0': 'You know, just in the more of a survey, not not a whole lot of individual tracking.'",
        "'speaker_1': 'Okay. So, Chuck, I never knew that I was there to start off, historically speaking and have started off with Ron's coverage, because I know.'",
        "'speaker_0': 'You did when you do those actions in order to get to the higher levels, easier to complete those actions.'",
        "'speaker_1': 'Yeah, but I know some people have been I go from day one, I'm not supposed to know that.'",
        "'speaker_0': 'Oh.'",
        "'speaker_1': 'Is it possible offensively or no.'",
        "'speaker_0': 'Well, when we put the the healthy incentives program in place, depending on how you wanted to view it, you were either going to stay at the gold by doing those things, which is what the unions were explaining to their members.'",
        "'speaker_0': 'Or technically it was a bronze plan and you earned your way up. The result was the same. If you did the individual action plan and you did the wellness assessment, then you got gold. So you could either say you stayed at that level because you did those things or you worked your way up from bronze because you'",
        "'speaker_0': 'did those things.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Thank you. So I wouldn't have been here. Is it fair to say that the rationale here is that the executive branch believes that the use of the Affordable Care Network will provide better health outcomes at a lower cost than the use of the incentives program.'",
        "'speaker_0': 'Is that am I hearing that, Cory? Because I didn't get a real rationale for why to essentially back away from incentives and not use incentives anymore. Council Member Baldacci That is correct. The the cost of health care, of not getting the right health care at the right time, either getting too much or too little or going to'",
        "'speaker_0': 'a place that's more expensive without delivering better quality is a much bigger impact on our cost and actually our health outcomes. We certainly want to support people to do healthy things, to do what they can to control the the health situation that they have.'",
        "'speaker_0': 'And we want to continue to support that. But the real truth is that the cost of services and the quality of services has a much bigger impact on on our budget and on how healthy our people are than than the lifestyle activities.'",
        "'speaker_0': 'Thank you. And I guess if I may, I'm just going to follow up in Oakland Councilmember Lambert, the fiscal note that was handed out was pretty. It seems to show slight savings in 2018 and then a $500,000 approximate increase in 2019.'",
        "'speaker_0': 'Can somebody put that in some context for me compared to what our costs have been and how much of a percentage increase that is and what's driving that?'",
        "'speaker_2': 'Councilmember Bell Michelle, I'll try to answer those questions for you. The cost savings were as a result of the shift of employees from the PPO to the Select Plan and the anticipated costs. And it was based upon a projection of a 5% shift.'",
        "'speaker_2': 'We actually had a 6% shift, but we wouldn't have known that at the time we were preparing the fiscal note. And with respect to gold for all in 2019, Mercer, who is a supports the county in its in its benefits administration had estimated that it would result in an additional cost of $600,000 to the overall benefits budget'",
        "'speaker_2': ', which is about $240 million per year. So the offset is obviously enjoyed by the region. And again, when I say the $600,000 increase in terms of the cost of the benefits, that is a projection that is really subject to really what the plan utilization will be by all members of the jail am.'",
        "'speaker_2': 'I said so. So that number is just the best that Mercer can put on it, just anticipating the utilization of those that had been at the silver and bronze level previously.'",
        "'speaker_0': 'So I'm doing some quick math up here. Never a good idea, but going with the numbers that you just shared, 240 million total health care costs to the county.'",
        "'speaker_2': 'That's our budget. For health care. That isn't necessarily our costs to health care, that is our funding.'",
        "'speaker_0': 'What has our costs been most recent number that we have?'",
        "'speaker_2': 'I do not have the most recent number of the costs for you. Councilmember We can get that for you.'",
        "'speaker_0': 'I'm trying to get at the curve. And so in the past, we've seen year over year health care increases in the double digits, 10% plus percent increases in health care. And and the county's been actively working to bend that curve downward while encouraging better health for employees for a while now.'",
        "'speaker_0': 'And this seems to me to be the next evolution of that, but I'm just trying to get at how we're doing. So that would be really good to know coming forward.'",
        "'speaker_2': 'We have we.'",
        "'speaker_0': 'Can give you detailed numbers on that. We've actually gone from double digits to an average of around four and a half percent per year, which is which is doing better than the national average. Very good. So that that's all I really need.'",
        "'speaker_0': 'I mean, that sort of basic information is helpful.'",
        "'speaker_2': 'And then in our projections for the protected fund reserve, which is the bucket and where the money goes into or comes out of, depend upon whether or not our costs are higher or lower. But then, then our budget is looking pretty good now.'",
        "'speaker_0': 'And I understand that one employee or one employee is dependent with a really particularly nasty form of cancer, can change the picture in, you know, in one year all by themselves because it can get very expensive. And that's expected that we will cover those sorts of, you know, situation.'",
        "'speaker_0': 'So final question, is this a process and approvals? So this comes to us now here we are in January, but these plans were offered for open enrollment last year. What happens if we don't approve this?'",
        "'speaker_2': 'Councilmember Bell Duchin that's a very fair question. And in terms of of that, I think when I sit here now, you know, in terms of having this discussion in January, one would have perhaps had two different agreements for each of the two changes, one in terms of age and the other one in terms of the health incentives'",
        "'speaker_2': 'and the plan design. Because the gym I see as as you know, is authorized to bargain and implement plans for 2008. And with respect to these but at the time we were bargaining that we were hopeful that we would have gotten everything in front of you before open enrollment.'",
        "'speaker_2': 'And we signed off on this in August or left my office in September and in a blink of time. Here it is in January. So so really what's here is in terms of looking at the continuation of these benefits in the 2019 benefit plan year.'",
        "'speaker_2': 'Keeping in mind to Councilmember Bell duty that the GMAC as well as Total COB are continuing to be empowered to bargain changes the plan design. So in April we'll be looking at, you know, our projections for 2009 ten and beyond and making decisions of whether or not the plan designs that are before you now should be modified'",
        "'speaker_2': '. In addition, we're in total comp bargaining this year for successor benefits plan, which also may modify these as well. So the one thing about looking at this is looking at the continuation of these particular plans beyond 2008 ten and recognizing that logistics being what they are.'",
        "'speaker_2': 'It wasn't a ideal situation.'",
        "'speaker_0': 'Yeah, and I get that it's complicated and not neat. And the end of the year is challenging for a number of reasons. But I would just ask that we take the Council's approval of these things as something other than just a rubber stamp.'",
        "'speaker_0': 'I would appreciate that is. Ed Yeah, because I still.'",
        "'speaker_1': 'Didn't hear answer you as to what would happen if we're not okay yet today.'",
        "'speaker_0': 'I think they would have to go back to the bargaining table and who knows what it would be a mess, I think, is what it would be.'",
        "'speaker_2': 'Certainly, Madam Chair, I would I would think that for 2018, based upon the benefits agreement, we'd be fine. But we certainly would have to take a look at 2019.'",
        "'speaker_0': 'That's the part that I'm not getting. So there's a benefits of like, did we and you'll have to forgive me for not knowing this, but did we pre-approve pre authorize the job of my C to decide within certain parameters or decide period and therefore whatever you guys come up with is okay, council approval notwithstanding.'",
        "'speaker_2': 'Madam Chair, under the benefits agreement, it does talk about the fact that we are empowered to negotiate the modifications to insured benefits and implement those agreements, and that these for the age and any third plan option for 2018 and to be implemented on January 1st of 2018.'",
        "'speaker_0': 'That was an agreement that previously was approved by the council that authorized what's happening here today.'",
        "'speaker_2': 'Yes, ma'am. Answer for 2018 2019. Like I said, had we thought about this in terms of the timing of how long it take to get before you, it would have probably logistically been better for the executive branch as well as to generally say union says.'",
        "'speaker_2': 'Well else to have had four agreements before you to recognize in the decisions we made for 2018 and to recognize in the negotiated agreements for 2019 as it was, we have them combined in 18 and 19 under single agreements for each of the provisions.'",
        "'speaker_0': 'So I think the answer to my question, Councilmember Gossett, would be that it would be a bit logistically and administratively challenging to pull the two apart and do whatever we do for 2019. But let's hope that that's not necessary.'",
        "'speaker_0': 'Okay. Councilmember Lamberts in waiting. Thank you. Just a couple of quick things. So you mentioned a minute ago that you were going to have healthy outcomes by work groups. And I think health is kind of an individualized thing.'",
        "'speaker_0': 'So I am concerned about that. I don't want to let up on the idea that we all need to be doing things to take good care of ourselves. And I know that I'm that I think it was like five or six years ago when we first started the plan where you had information on how to do exercises'",
        "'speaker_0': 'properly. I thought that was really good information. It's been years since people really were that specific with me on that. And I think, you know, I think that's a really good thing that we could share with our employees to encourage them to exercise, but also to do it correctly.'",
        "'speaker_0': 'So I hope that we don't give away completely. I agree with the other council members I hate and making those forms that all the time. But it did I did learn a lot on some of the years, but not all of them.'",
        "'speaker_0': 'I'm really thankful that you have other plans besides the PPO and the HMO so that people have an option if they choose not to have that particular kind of plan. We did a couple of years ago, and I think it was the group you just mentioned that Mercer, that they were looking at each of the hospitals and'",
        "'speaker_0': 'a surgery in each hospital cost and made comparisons across the different hospitals and just have some numbers. This hospital has this survival rate and this hospital has that. And will we be seeing any more of that information? Because I think it's important for consumers to know how the hospitals are rating.'",
        "'speaker_0': 'Councilmember Lambert, that work was actually done by the Washington Health Alliance. That's right. Which which was an organization that the county helped start on. They do have public reports and we can certainly give you information about where to find it.'",
        "'speaker_0': 'It is public. It's public a by provider groups, individual, you know, clinics. So there's the community checkup report that shows the quality and outcomes for four clinics. There's a hospital report that shows variation and quality and cost. There's a new report that's going to be coming out that shows common things that the medical societies have agreed don't'",
        "'speaker_0': 'need to be done and how much cost they add. So it's things like giving antibiotics for for bacterial infections and certain kinds of knee surgeries that don't don't really help people. And that report will be coming out soon.'",
        "'speaker_0': 'And those are publicly posted on the Washington Health Alliance website. And we can certainly give you the the the website information for that. I think it also we should talk to public health about having a link from their website because when people go to look for health information, they might go to public health and be able to'",
        "'speaker_0': 'see that their work. One of the things I mean one of the things I'm concerned about and it's happened several times in the last seven years, but as we change the pharmaceuticals, that they will say this is the formularies that we will pay for and these are the ones we want.'",
        "'speaker_0': 'And then the next year it's different. And so if somebody is on a drug that's working for them and having to change and then change back, it's not good. And I think I've talked to somebody in your office about this.'",
        "'speaker_0': 'So I think we need to be aware of that. And, you know, maybe having I think there's appeal process or something that your doctor can write and say, no, they don't want them changing to this drug. But I think trying to keep it a little bit more stable would be helpful.'",
        "'speaker_0': 'And then in this plan, you know, we were supposed to be one of the early providers for the Affordable Care Act and all that. Is this connected to that at all, even tangentially? Councilmember Lambert Yes. This is one of the kind of health care innovations that was supported by the Affordable Care Act, because that the Affordable Care'",
        "'speaker_0': 'Act comes with what's called the triple aim, which is to get better population health at lower cost with better patients. Satisfaction. And so the Accountable Health Network idea is very specifically designed to achieve those three things, so that that is very much in line with the Affordable Care Act.'",
        "'speaker_0': 'So I know the employer that was in charge of getting us on that early adopters is no longer with us. So are we going to we're not going to be an early adopter. Are we still going to be a mid adopter?'",
        "'speaker_0': 'Or when are we going to be adopting? And is this part of that or is this something separate? I'm not certain I understand your question because we certainly. It's mental health and physical health being combined. Yes, yes. Yes.'",
        "'speaker_0': 'And so it's happening at two levels. We're doing it in the employee plan. But far more important, that's what's happening in the health department and community health, where they're working with the accountable, you know, accountable communities of health.'",
        "'speaker_0': 'There's so many acronyms now. But yes, we are we are a mirror doctor in that there were two two counties that have a different kind of structure that were the the the test cases. And then we're in the next the the next wave and right on where we thought we were going to be.'",
        "'speaker_0': 'Health Department can speak more eloquently to that piece. Sure. I think that would be good for us to know because other counties, because we were going to be an early adopter. Other counties were saying things like King County figured out first because they're bigger than us and we'll just go in the tailwind behind them.'",
        "'speaker_0': 'And so other counties are calling me and saying, how far are you? And I don't really know. I mean, the affordable and the accountable communities of health. Yes. And when we're going to be fully adopted and and what have we learned along the way, which I went to one symposium from a county, and their lessons learned were'",
        "'speaker_0': 'pretty interesting. So it might be good for us to know those things and maybe a briefing at some point on that would be interesting. Okay. I mean, it would be interesting to know what our experiences anyway. Right, for our own purposes.'",
        "'speaker_0': 'So that'll be great. Before we close this out, I just want to make sure, Ms.. KOPPLIN, that you have an opportunity to say something if you choose. Don't feel pressured. But if you've done as the the the courtesy.'",
        "'speaker_0': 'Thank you. Of of coming in being here this morning. So anything you'd like to add to what we've talked about today? Well, I would like to thank the council for their consideration on this. I'm really proud of our Joint Labor Management Insurance Committee.'",
        "'speaker_0': 'I feel like this is an example of where labor and management can come together, sit down, work through problems, and come up with some really good outcomes. I'm also very proud of our employees because I will note that this year they did not increase the employer contribution for the insurance contributions.'",
        "'speaker_0': 'They they took basically a 0% increase. And our our PSR is still doing very well, which I think speaks well to our employees and how well versed they are in health care and how this process has basically been a success in an arena where health care costs are often rising significantly.'",
        "'speaker_0': 'So I wanted to acknowledge that and acknowledge my colleagues and, you know, encourage the council to really take the recommendations of the Joint Labor Management Insurance Committee seriously, because we work really hard together on this. And all of our decisions are very.'",
        "'speaker_0': 'Well-thought out and discussed at length. So. All right. Well, thank you. Thank you all for for coming in, working us through this. This is before us for potential action today if we're prepared to move forward. It is proposed.'",
        "'speaker_0': 'Audience Member 2017 2047572. That please come from a member. Madam Chair, I'm happy to put before you propose ordinance 2017 zero four I'm sorry 0475 with a do pass recommendation and the other comments or questions, Council Member McDermott, followed by Councilmember Dombroski.'",
        "'speaker_2': 'Thank you, Ms. Palaszczuk. Your staff report analysis section ends with staff analysis is ongoing. Can you speak to what work is continuing?'",
        "'speaker_0': 'Absolutely. Councilmember McDermott, that was based on the fiscal note that was provided to you today. There was addition information that council staff requested and that information has been provided.'",
        "'speaker_2': 'Great.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Tomasky, thank you.'",
        "'speaker_3': 'Just right above it and returning to our opening colloquy here. The staff report notes that the human resource vision doesn't believe that there will be significant cost savings. Did there's a discontinuous discontinuation? Just I can't even speak of the healthy incentives program, the ending of the paperwork.'",
        "'speaker_3': 'I just want to note that it may be hard to capture, but with 13,000 plus employees and their family members having to fill out those forms, that takes them away from their work. It takes them away from their families.'",
        "'speaker_3': 'It's a small thing, but but it adds up. And I think there is an undocumented savings, but savings there. And so I just want to commend you. You articulated it so well when you said, you know, if you're stuck down on that gold or bronze or silver level, the costs are higher to get in to see a'",
        "'speaker_3': 'professional. It's a barrier there. People may not go. So I think your shift in thinking on that is great. I really want to endorse it from a practicality perspective, from a reasonable perspective, and from a health care perspective, I think you're headed in the right direction.'",
        "'speaker_3': 'So thank you for your work on that. And Denise, thank you for our work working so hard on behalf of our representative employees. I really agree with everything you said that we have great partners there.'",
        "'speaker_0': 'Councilmember Dunn, followed by Councilmember Jamaica.'",
        "'speaker_2': 'Anyone from the insurance carrier here today? No, sir. Okay. So just labor and staff. Okay. I appreciate it and I appreciate all your work. So I'm not going to wrap you into this. But I called the local or the government direct relations director four times last year.'",
        "'speaker_2': 'Four times they were going to call back. Yeah. Which is kind of reflective of the level of service I think we get from this insurance carrier. So on my desk is a ordinance which I've shown to several members up here that would go in a different direction with our insurance carrier as a county.'",
        "'speaker_2': 'So at some point I'd sure like to have a conversation with somebody from some regions. They want to give me a call back. I'd be grateful. If not, then I'll just move the legislation. Council Member Doug, we'll follow up with your office to get more information on that so we can take your time and I'd be grateful'",
        "'speaker_2': '. Thank you. I think it's important that people are responsive and especially the tens of millions of dollars. And I also have other concerns which I can get into later. But thank you. I'm grateful. Thanks for being here.'",
        "'speaker_0': 'Councilmember Lambert would like to comment on that topic as he goes is going to say that are on the phone with me and and they were answering my calls but yeah they are so anyway. Okay, maybe you got the wrong phone number.'",
        "'speaker_0': 'Councilmember McDermott.'",
        "'speaker_2': 'Thank you, Madam Chair. You've certainly heard some clearly interest, frustration, maybe even on occasion disillusionment with the health incentives program. And I'm not I think there is some value in the concept, but as I expressed to several people in the executive branch over the last year, I have some grave concerns about the current implementation of that program'",
        "'speaker_2': 'in mind was much more specific to record keeping and whether we were seen if somebody could enter data in the right timeframe versus if they're actually engaging in activities to improve their health. In my conversations with the executive branch, I learned that a bigger concern driving some of their work to reform it is that healthy incentives had'",
        "'speaker_2': 'those who were reaching gold didn't reflect our in our workforce in its entirety, that there were ESG implications in who was reaching gold and who wasn't in that concert. That concerns me even more so than the frustration of filling out forms.'",
        "'speaker_2': 'I think there's actually value, as frustrated as it may be in taking that health and assessment. But I want one that. Helps our employees achieve their health goals and have better outcomes. So I'm not looking to chuck such a program, but I need one that actually is helping our entire workforce achieve better outcomes, not just segments of'",
        "'speaker_2': 'our workforce. I also need one that is outcome driven, not input driven. Do you check the rate box to input the data on the right time frame? Thank you.'",
        "'speaker_0': 'Well, just to wrap it up and then we'll we'll be ready to take action. I think that's what I heard is the direction and the idea of looking at the outcomes and looking at them in a population level as opposed to an individual level.'",
        "'speaker_0': 'I heard that pretty clearly from the presentation is the hope for this new direction? And Councilmember Lambert reminded me, but I think it's fair to point out, as much as we've all come to hate the poor, unloved incentives program, it won awards back in the day when it was first put in place.'",
        "'speaker_0': 'And it did a lot of good, I have to tell you. It did. It was not a bad thing for me to have personally to have a reminder at the beginning of each year to be thinking about my health.'",
        "'speaker_0': 'It made me go get my checkups. It made it made me do things that, while they are indeed a hassle, are probably important to to health. And look at me here. I'm dripping. I'm a drippy, feverish mess. And I you know, if we had had our incentives program in place this year, maybe I wouldn't be.'",
        "'speaker_0': 'So let's just put it that way anyway. Okay. Yeah, I think we're done with comments and we're ready to move to a vote rolls marker to call the roll. Please repeat before you do. Do we not have a motion?'",
        "'speaker_0': 'I might know people in motion. We do? Yes. You need one? Yes. Another? Not that out of it. I recall the motion. Okay. Please go ahead and call the wrong. Thank you, Madam Chair. Councilmember Dombrowski. Councilmember Dunn, I.'",
        "'speaker_0': 'Councilmember Gossett.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council member. Coles. Council member lambert, I. Councilmember McDermott All right. Councilmember up the grove. Councilmember one right there. Madam Chair. Madam Chair. On the vote, a seminar is no nos. Council members. Cole Wilson one mike there excused by your vote you have moved proposed ordinance number 2017 0475 with a do pass recommendation.'",
        "'speaker_0': 'I think we really. No not at this one quite a bit. So we'll put it on consent if I don't see any objections. Not seeing any objections, it will be on consent. Thank you very much, everyone. All right.'"
    ],
    "Report on Garbage Collection in Unincorporated Areas by the Solid Waste Division.": [
        "'speaker_0': 'We have two final items. Maybe we can get through them relatively expeditiously. Both are about solid waste. So I'm not I'm going to skip my introduction and just call on our staff. Mary and John and Terre Rose to walk us through both of these items, and we'll take them up one at a time.'",
        "'speaker_0': 'Thank you. Thank you, Madam Chair, and members of the committee. For the record, I'm here, Rose. And with me is Mary Bergeron of Council Staff Proposed Motion 2018 0062 would acknowledge receipt of a report on garbage collection in unincorporated areas in response to a budget proviso requirement.'",
        "'speaker_0': 'The materials for this item begin on page 141 of your packet. The Council adopted a budget proviso as a part of the 2017 2018 biennial budget requiring the executive to conduct a public outreach process, prepare additional analysis on recycling rates, and provide a report to council prior to advancing any proposal to reduce garbage collection frequency from every'",
        "'speaker_0': 'week to every other week in the unincorporated area, the proviso is written such that if garbage collection frequency was not planned to be reduced, the report to council could say this and no further analysis or reporting was required.'",
        "'speaker_0': 'On November 15th, 2017, the executive transmitted a letter to the Council stating that reduced garbage collection will not be pursued from every week to every other week in unincorporated areas of the county, from the state through the end of 2018.'",
        "'speaker_0': 'And the executive's letter, as transmitted, satisfies the terms of the proviso the Council will have the opportunity to set longer term policy direction regarding garbage collection and recycling rates within the context of the Comprehensive Solid Waste Management Plan, which is anticipated to be transmitted later this year.'",
        "'speaker_0': 'That concludes my staff report, and I'm happy to take any questions. Okay. I'm sorry. Could you say your last sentence again? There's a little. Sure, sure. I was just mentioning that the Council will have a property opportunity to set longer term policy direction concerning garbage collection and recycling rates within the context of the comprehensive Solid Waste Management'",
        "'speaker_0': 'Plan, which is anticipated this year. Okay. So this is just I need to get up to where we're at. We are item eight Web page area of 141 141.'",
        "'speaker_4': 'And the motion is on page 147.'",
        "'speaker_0': 'That's what I'm looking for. It's a so the motion is to acknowledge receipt of the report. That's what we are being asked to do today. Is there comments or questions about this item? Councilmember two.'",
        "'speaker_2': 'Thanks. So the report that has come back to us that we are accepting now says that it won't we won't go to every other week garbage collection for the duration of what period.'",
        "'speaker_0': 'The letter filed with the clerk is from the date. So November 15, 2017 through the end of 2018.'",
        "'speaker_2': 'Through the end of the year. Okay. But after that, and there hasn't been any commitment one way or the other in terms of from solid waste on the issue. Correct. Okay. Just want to make sure we have all the facts.'",
        "'speaker_2': 'I have some comments. We're just accepting report and I know some comments.'",
        "'speaker_0': 'Are just or something you report. So if you have comments, now would be the time.'",
        "'speaker_2': 'Okay. So just real quick. So again, this accepts the proviso I sponsored and it essentially requires the division to either do significant outreach if they are going to go from one week to two weeks or to delay the policy until after the current by any.'",
        "'speaker_2': 'And so the division is acknowledged and I think it's great that they're not pursuing every other week garbage collection policy through the current year. But I just want my colleagues to know that when I was first elected to the council, illegal dumping was a huge issue in my district and it continues to be a huge issue in'",
        "'speaker_2': 'my district. Rates at the transfer stations, combined with growth, have just created a situation where all the people are going out to the unincorporated areas and dumping their trash or washers and dryers or even cars in some extreme situations.'",
        "'speaker_2': 'So as part of that response, I sponsored legislation that created a voucher program to help low income residents clear dumping grounds. And in the first year, over half the vouchers had been awarded, which just goes to show the extent of the problem.'",
        "'speaker_2': 'Also, I represent a lot of neighborhoods that are, you know, very unhappy with frequent odors coming from the facilities that we have out there. Of course, in my district, the landfill material composting is out there. There's a lot of odors coming from those facilities as well.'",
        "'speaker_2': 'And so switching every other we garbage collection is probably going to drive up the collection of work organics which are sent to my district for processing and increase the smell. And with the current rate that the folks have been contacting my office about odors, I'm not comfortable with a every other week policy change going forward until there's'",
        "'speaker_2': 'a plan to really address the odor concerns. You have no idea how many thousands of emails I get because of the odor related problems down there in that quadrant of the county. So I had a chance to survey my constituents with my newsletter here just last year, and I wanted to get a sense of how they felt'",
        "'speaker_2': 'about this issue. And and well over half of the residents surveyed said they would be unsatisfied or very unsatisfied with this policy change. And you can understand why. I mean, it's you know, that, you know, you've got situations like, for example, you've got all kinds of critters out there in the unincorporated areas, especially rural King County.'",
        "'speaker_2': 'And if you're leaving your garbage out for two weeks as opposed to one week, there's a greater opportunity for critters to get in there. There's smell issue, there's rodents and sanitation related issues. And and it's just it's just one of these things that and it's also, you know, even if the containers increased slightly, you still got an'",
        "'speaker_2': 'issue. You know, we're going to charge them the same amount for the same, but we can charge them the same amount for half the volume being reduced from their house for or from their home. Right, if they're only coming every other week.'",
        "'speaker_2': 'So those problems that I really have and so I just don't think this is a place to experiment and we'll be very dogged in pursuing that. Continuing on beyond the by any means. I know all the waste understands and appreciates.'",
        "'speaker_2': 'I just wanted to get that information out. Thank you.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'And I would urge we accept the report. Okay.'",
        "'speaker_0': 'You can simply thank you. Well, I just want to say I agree completely with the previous speaker that we are per capita. We have lots and lots of families out there. And because there's more families with more people in the house that you are going to have more garbage than.'",
        "'speaker_0': 'You know, averaging a, you know, one or two person household. And as he said, garbage shows up elsewhere. And it has gotten, in some cases, so extreme that we've had to hire a helicopter to come in and bring large items out that have shown up in all kinds of crazy places, which is not safe for other people'",
        "'speaker_0': 'and just makes it an eyesore. So I think, Councilmember, one of the things that your people need to know that the current garbage plan would take the at the height of garbage piled councilmember, the height of garbage piled up now can go up to 780 feet above sea level.'",
        "'speaker_0': 'But the proposal is it would go to 800 and I think 20 feet above sea level. So that they're complaining now just wait unless we change our plan. But the plans before us, we'll have an opportunity to talk about that.'",
        "'speaker_0': 'The other thing is that because of the garbage issues, we do have beer cans available and I think it's $4.99 more a month if you want a beer, garbage can. So for those people out there that are having problems with the bears, you can under our contract ask for a beer, garbage can.'",
        "'speaker_0': 'Thank you. Thank you. All right. If there's no additional commentary, I would accept a motion to approve motion number 2018 0062 of the do pass recommendation.'",
        "'speaker_2': 'Gladly. Madam Chair, would we propose motion number 20180062 with a do pass recommendation? But we would also ask that it be removed from the consent agenda very well.'",
        "'speaker_0': 'Any other comments or questions? I'll ask her to please call the roll. Thank you, Madam Chair. Councilmember Dombrowski. Councilmember Dunn.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilmember Gossett.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council Member Cole Wells. Councilmember Lambert. Councilmember McDermott. All right. Councilmember Staff members. Councilmember one right there. Madam Chair, I. Madam Chair, the vote of Seven Eyes, No No's, council members Cole Wilson and one. Right. They were excused. All right.'"
    ],
    "Solid Waste System Tonnage Report for 2017.": [
        "'speaker_0': 'By your vote. You have. We have passed proposed motion number 2018 0062 of the do pass recommendation. That is to accept the report and it will not be able to consent calendar. So I'll move on to the last item on our agenda today, which is proposed motion number 2017 0505.'",
        "'speaker_0': 'It's another solid waste motion, this one accepting a report regarding system tonnage because the county Cedar Hills Land Regional Landfill is nearing its capacity. As we all have discussed here many times, it's important to carefully monitor the tonnage that we're disposing and study options for long term waste disposal.'",
        "'speaker_0': 'As part of that effort, the Council adopted a proviso, you will recall, in the 2017 2018 budget that required two reports from the Solid Waste Division. The first, which we will hear about today, is on 2017 system tonnage.'",
        "'speaker_0': 'The second is due in June on long term options for the landfill. So once again, we have with us Mary Bergeron and Tara Rose to help us with a briefing.'",
        "'speaker_4': 'Thank you, Madam Chair. Mary Bergen on from the council staff, for the record, and you have introduced the council's rationale for this proviso. As you noted, this system tonnage report from 2017 is the first of two reports that will be required on this topic.'",
        "'speaker_4': 'And if you will move ahead to page 155 in your packet, I will share the results of the analysis that the division did to prepare this report. What they did because this report was due on December 1st of last year, this report provides actual tonnage figures from January through August and then estimates for the remainder of the'",
        "'speaker_4': 'year. And when you see the second report, which is coming in June, you'll see actuals for the entire year. I will note first that in preparing to do this report, the Solid Waste Division had prepared tonnage estimates through the year 2036 and they had presented those to you back.'",
        "'speaker_4': 'At the same time, you adopted these provisos when you were adopting the solid waste rate. These and if you look on page 156, you can see a table that outlines what the projections were for each year. And if you look at the shaded row 2017, you'll see that the division was estimating about 851,000 tons last year.'",
        "'speaker_4': 'They had estimated, if you look, a little bit of a decrease from the year before because of the reopening of the city of Seattle's North Transfer Station and Recycling Center, which they estimated would take some of the load off the county stations.'",
        "'speaker_4': 'If you then jump to the bottom of page 157 and look at the actual results that the solid waste division has transmitted, you will note that tonnage, in fact increased 10% above those projections. So 932,000 tons rather than the 851,000 that were projected.'",
        "'speaker_4': 'This has implications for the landfill capacity estimates that this additional 81,000 tons will shorten the landfill life by about a month. And moving on to the next page. Also has operational impacts because this additional tonnage was about 230 more tonnes of waste per day that were transported to the landfill than had been estimated.'",
        "'speaker_4': 'That resulted in about 3700 additional roundtrips between the transfer stations and the landfills last year. The division has noted that they have been addressing these operational impacts through overtime to date, but may be coming back to the Council for additional appropriation or possibly even FTE authority.'",
        "'speaker_4': 'And finally, I'll note that this additional tonnage resulted in about $11 million in additional revenue above and beyond what had been forecasted for last year. And the division notes in that case that they recognized they don't have appropriation authority to use that additional revenue and expect they may be coming to the Council through one of the supplemental'",
        "'speaker_4': 'budget ordinances. I will close by noting that the additional unanticipated tonnage for last year will be addressed in more detail. In the second of the two provides a report to the one that will be coming to in June that will also include more information about the landfill.'",
        "'speaker_4': 'And I think this does provide a good segue way for the Council to your upcoming discussions and deliberations on the Comprehensive Solid Waste Management Plan, a draft plan of which was released last week. And the executive's recommended plan is anticipated to come to the council probably mid this year.'",
        "'speaker_4': 'So this kind of sets, I think, the ground for what you will be looking at. And with that, Madam Chair, that concludes my staff report.'",
        "'speaker_0': 'Okay. Thank you very much. Councilmember Lambert has a question. Thank you. So help me on these charts. So special waste is going to go from 1500 to 2500 in approximately 20 years. What is changing that? That is going to be so substantially the same that that's going to happen because it increased population.'",
        "'speaker_4': 'So I think we've got staff from the division here and I think they might be best to answer that question. I had been focusing mostly on the total column and focusing mostly on 2017 things. That was the topic of this report.'",
        "'speaker_0': 'And talk about that when we meet next. And the same thing in the next column, going from 1300 and 13,500 in yard waste down to 16. But, you know, lots of people are doing rock gardens and other kinds of gardens so that there aren't as many yard ways.'",
        "'speaker_0': 'So we'll add that to our list next time we talk. All right. Thank you. Okay. So one of thing, please. Anything is I. I just saw and something that was written that that a clean wood is no longer going to be accepted at the house and transfer station.'",
        "'speaker_0': 'And I didn't know that was happening until it apparently happened. So I'd like to talk about how that happened, and I'm not really happy about it. So thank you. Okay. I don't know if we do have executive staff here.'",
        "'speaker_0': 'I don't know if they want to come forward and say a few words before we go ahead and accept the report. But yeah, only if you want to get in and you're not required.'",
        "'speaker_2': 'If you have a question that we'd like to.'",
        "'speaker_0': 'Hear enough. I do have one question, and that is when this projection comes in a significant marginal but significant amount higher, this actual annual tonnage comes in at this level higher. And it says that that would that would mean the capacity of the Cedar Hills landfill be reached about one month sooner.'",
        "'speaker_0': 'Does that assume that the rest of the projection comes in as previously projected, or do we now reset the rest of the projection and say even if things increase at a rate similar to what we assumed before, but now we're up to 932, we're starting with a different base.'",
        "'speaker_0': 'Is that how you get to one month? I mean, I know that this is we're prejudging the question of the next report, but it seems to me that that seems odd that that much of a change to the curve would result in such a small impact to the life of the landfill.'",
        "'speaker_0': 'The Please Make Morehead King County Solid Waste Strategy Communications and Performance Manager. This provider was very specifically focused on 2017.'",
        "'speaker_4': 'And so the one month change in the landfill.'",
        "'speaker_0': 'Life is based on the change in tonnage for 719 2017 only. And it's the second proviso that speaks to the broader change in the overall projection. Manage and so forth. Okay. Once again before us, today is just the motion to accept the report, and that's motion number 2017 0505.'",
        "'speaker_0': 'If there's no further discussion, I would entertain a motion. Thank you, Madam Chair. I'd like to propose a proposed motion 2017 0505 with a do pass recommendation. All right, it's been moved. Any comments or questions saying nonetheless the clerk to please call the roll.'",
        "'speaker_0': 'Thank you, Madam Chair. Councilmember Dombrowski. Councilmember Dunn. Councilmember Gossett. Council Member. Cole Wells. Council Member. Member. High Council Member McDermott. High Council member of the Grove Council. Member of one right bar. Madam Chair. Hi, Madam Chair. The vote is six eyes.'",
        "'speaker_0': 'No nos. All right, by your vote, we have approved proposed motion number 2017, dash 0505 with a do pass recommendation. This one also, I think should be on the regular course along with the other one. And that brings us to the end of our agenda today.'",
        "'speaker_0': 'Our next meeting will be Wednesday, February 7th, when we anticipate continuing our work on the King County Code, changes to make it before gender neutral, and receiving a briefing about the Hearst Supreme Court decision and for cultures budget and.'"
    ]
}