{
    "King County Access for All Program and Sales and Use Tax Proposition.": [
        "'speaker_0': 'Thank you all very much. By your vote we will move that along and I am very confident we will be ready for our flight on Tuesday. So this brings us to item number five, which is the proposed ordinance motion propose ordinance 2017 0178 regarding King County access for all.'",
        "'speaker_0': 'This ordinance council will recall is a revised version of the executives transmitted access for all program to improve public access to arts, science and heritage programs. On Monday, this ordinance was introduced and it was duly referred to this committee and to the Budget and Fiscal Management Committee.'",
        "'speaker_0': 'Part of the purpose of that dual referral was because the Budget and Fiscal Management Committee does not have a meeting scheduled until May 10th. And if we are to. Take up any action on this as proposed for the April August ballot.'",
        "'speaker_0': 'It would need to be done before May 10th. So we have this meeting to have discussion and proposed changes to the new and updated ordinance, if we choose. And then we'd have to figure out a path forward procedurally because one is not really apparent at the moment.'",
        "'speaker_0': 'But this enables us to at least have discussion of the substance today. So with that, I'm going to turn to our. Okay. Before I turn to our lead staff, I'm going to call on Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Madam Chair. And if the chair permits, I'd like to just give a little introduction.'",
        "'speaker_0': 'I think that would be very welcome.'",
        "'speaker_1': 'Thank you. Thank you. As my colleagues know, I introduced on behalf of the executive the proposed ordinance that was transmitted to us. And I did that along with Council Chair McDermott and council member of the Belle Duchy. And I have to say this has been quite an experience, and what the three of us did I can guarantee'",
        "'speaker_1': 'is to listen to our colleagues, listen to the concerns that have been expressed and those mainly focused on not enough geographic fairness, equity, that the regional organizations, which are the large ones, get too much funding and the community based organizations get too little of the funding, and there's inadequate attention to social and economic equity.'",
        "'speaker_1': 'Another concern was that there was inadequate oversight of fort culture, which would become the agency to oversee access for all. And there was concern that not all school districts in our county would benefit. And another major one is that the implementation plan should be approved by the Council.'",
        "'speaker_1': 'There were other ones, but those are the main categories that I heard anyway need to be addressed. So as it was not possible to continue the discussion in the Budget Finance Fiscal Management Committee, I worked with my colleagues to develop a new proposal.'",
        "'speaker_1': 'So this is a new one. This is a new ordinance. And I believe that it really does address these issues that I mentioned, including a $1 million per district floor requirement, equity and inclusion being enhanced seed money so that new organizations could emerge, could develop, especially in those council districts where there are very few opportunities for organizations'",
        "'speaker_1': 'to develop currently strong reporting and accountability language in this new measure. And then there are some miscellaneous technical changes, but I commend this to you, and I am very appreciative that we are able to have a discussion on it today.'",
        "'speaker_1': 'Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Councilmember Caldwell's for that overview. I think it's really helpful to set the stage and continuing. I am going to call on our council staff here today, Lia Zoghbi and Andrew Kim, to walk us through the new ordinance and make sure that everybody understands what is in it, that we have an opportunity to ask questions.'",
        "'speaker_0': 'And then when I think when we've established a base level of understanding of where we are, then we can turn to discussion about where we ought to go.'",
        "'speaker_5': 'So good morning for being here. Thank you. Good morning. Council members. I'm Lee Zoghbi and with the council staff and with me is Andrew Kim. Council staff. The materials for this item begin on page nine of your packet.'",
        "'speaker_5': 'This proposed ordinance is a revised version of the Access for All program, and to briefly recap the program, it would provide public access to arts, science and heritage programs and experiences in King County, and the program would be funded by a 1/10 of a percent sales tax for seven years, proposed for voter consideration at a special election'",
        "'speaker_5': 'on August 1st of this year. And because members are familiar with the executive transmitted from a proposal, I would have us skip to the analysis section on page 13 of your packet for a comparison of how this version compares with the executive proposed ordinance.'",
        "'speaker_5': 'So there's a table on page 13 that compares the major program elements, the Public School Access Program, the Regional Cultural Organization Access Program, and the Community Based Cultural Organization Access Program. And so the major change you've. C is that there's a shift of funding from the regional cultural organizations to the community based to community based programing, and'",
        "'speaker_5': 'the requirement that includes mandatory requirements for regional cultural organizations to provide equity and inclusion benefits and a geographic distribution public benefit. So those benefits would be aimed at providing cultural programs for people with economic and geographic barriers to access.'",
        "'speaker_5': 'The regional cultural organizations would be required to spend at least 30% of their award annually on equity and inclusion benefits. And then of that, at least 10% of that would or at least 10% of their total award would have to be spent on programing that it's occurring outside of the cities where regional cultural organizations are not primarily'",
        "'speaker_5': 'located.'",
        "'speaker_2': 'Are.'",
        "'speaker_5': 'Occurring in those cities. If I said that right, regional cultural organizations would also have the option of meeting that geographic geographic distribution requirement by contributing their 10% of their award to for culture to distribute to community based cultural organizations.'",
        "'speaker_5': 'So overall, you see that requirement reflected on the chart with the $3.8 million shift from regional choral cultural organizations to the community based cultural organizations. The requirement for regional cultural organizations to contribute at least 20% of their wards to the public school access program, and at least 30% to equity inclusion benefits means that at least 50% of'",
        "'speaker_5': 'their award is restricted to specific uses. So you see that reflected in the chart with the $19 million that is now unrestricted, unrestricted for regional cultural organizations.'",
        "'speaker_4': 'What page you are?'",
        "'speaker_5': 'I'm on page 13. So the first column of numbers is the new proposal, and the second column of numbers is the executive transmitted proposal. And.'",
        "'speaker_0': 'I'm sorry. Anytime. It might make sense, but it's related. Please go ahead. Councilmember, tell Americans where you finished asking your question.'",
        "'speaker_4': 'No, but I'm glad I'm okay.'",
        "'speaker_0': 'Councilmember, I have to go, but go ahead.'",
        "'speaker_3': 'Thank you, Madam Chair. Lia, did you say 3.8 million is moving from the regional organizations now that 3.8 million will go to the community based organizations.'",
        "'speaker_5': 'So the way it would actually work is that 3.8% of the total awards that would go to 8 million are yes, 3.8 million would be required to be spent in communities that don't have a regional cultural organization. Or there is the option of providing it directly back to for culture to distribute to community based organizations.'",
        "'speaker_5': 'So how I would look is there's a few different options. Organization, regional organizations could provide programing in a, you know, somewhere other than where they're located.'",
        "'speaker_3': 'They could do that already. And it was.'",
        "'speaker_5': 'Correct. Now they're required. What percentage? That that's at least 10%. Okay. But the 30% has to be used for equity and inclusion benefits, and that would be also considered an equity and inclusion benefit.'",
        "'speaker_3': 'If I might have a follow up. Can we legally do that? Say, I mean, I'm intrigued by this idea that we can have 70% go to the regionals, but then ask that a percentage be given back to for culture.'",
        "'speaker_3': 'So has that been through legal review, the ability to say you can meet, we can comply with state law? And still direct the regionals, know if the regionals are giving a piece of it back, could we direct 50% or 90% to go to for culture and then distribute?'",
        "'speaker_5': 'You couldn't direct it specifically what you what how it structured is they can either they have choices for how to meet the 10% requirement. We can legally require. So they can do that by providing the programing, by partnering with a community based cultural organization, or they are given the option if they want to, to give the money'",
        "'speaker_5': 'back. So that is what we can do under state law.'",
        "'speaker_3': 'Okay. So there's not necessarily any I'm not trying to be facetious here, but there's no guarantee there will be money going to poor culture, to the regional organizations. It's just an option there.'",
        "'speaker_5': 'Correct. But there is a guarantee that that 10% has to be spent in communities. It can't just be spent where.'",
        "'speaker_3': 'That 90% could still be spent in Seattle, or if it were a Seattle based organization, 90% could be spent community benefit Seattle and 10% could be in the busses out to the other.'",
        "'speaker_5': 'Technically, not really that either because 20% have to go to the public school program, which has to go countywide. And then also, well, it's kind of technically difficult, but it doesn't have to go countywide. But there's there's very specific requirements what what the public school access funds have to go to.'",
        "'speaker_5': 'And it you know, it has to be spent at, you know, at the public school level for all districts within King County, all public schools, the 30%. Again, it is a requirement that of at least 30%, the award has to be spent on equity and inclusion benefits.'",
        "'speaker_5': 'And those could be in the form of providing discounted, you know, admission to an organization, or it could be in the form of taking programing out to the community. But at least 10% of their overall award would have to go out to the community.'",
        "'speaker_3': 'Thanks. Thank you.'",
        "'speaker_0': 'Councilmember Gossett.'",
        "'speaker_4': 'And thank you, Madam Chair. Leah, I have a question on the last comment that council member of the would just throw that I can understand that equity and inclusion means the regional, cultural and scientific entities are providing public transit or bus access and that taking some of their programs into the schools and perhaps the neighborhoods.'",
        "'speaker_4': 'But is that the same as what you said earlier, about 3.8 million being transferred to their communities to set up regional culture.'",
        "'speaker_5': 'As I understand your question, it's that two different things. So that.'",
        "'speaker_4': 'To be honest, I'm.'",
        "'speaker_5': 'Not sure the 20%, 20% of a regional cultural organization award would be going to the public school program, the Public School Cultural Access Program. And that program involves transportation to students, to cultural organizations. It also involves cultural organizations taking programs to cap classrooms so that the 20% then there's an additional additional and and that was always required'",
        "'speaker_5': 'in this ordinance. There's an additional 30% requirements. And of that for equity and inclusion. And many of those benefits, you know, the defined benefits involve either providing overcoming barriers to access for people who have economic barriers or people who have geographic barriers.'",
        "'speaker_5': 'And so the additional requirement would be that 30%, you know, a third of it, 10% of the overall award had to be spent towards mitigating those or has to be spent in communities that don't have regional.'",
        "'speaker_3': 'Cultural or.'",
        "'speaker_4': 'Economic. That's meant by whom, as spent by the regional organizations or for culture or given to our community groups, for them to define what cultural aspirations and programs they like to see develop.'",
        "'speaker_5': 'So that that would actually get worked out at the contract and implementation plan level those details. And so it could look different for each cultural organization. But when they are entering into contract with for culture to receive their awards, the specific benefits, they would come forward with a proposal of how they would meet this requirement culture.'",
        "'speaker_4': 'I would define what culturally legitimate for these organizations.'",
        "'speaker_5': 'Not for the community organizations. For the regional organization.'",
        "'speaker_4': 'I know, but I'm talking about the 30% that you said now that would be made available for creative, cultural and scientific activities that take place in the communities. Are you, senator for culture would be the determiner of what groups get that money?'",
        "'speaker_4': 'Can I find a figure?'",
        "'speaker_0': 'I want to step in for a quick second. One of the items we discussed wanting to see in this proposal for the sponsors was the idea that there would be involvement of the council members in helping to shape the implementation plan, which would include a plan for geographic areas and specific geographic areas.'",
        "'speaker_0': 'I should say plans plural for specific geographic areas and how those would be met by the cascading flow of money, but also countywide equity plan and how that would be developed. And that then after having had that upfront input into what those plans should say as part of the implementation plan, then we would as a council have'",
        "'speaker_0': 'to approve the implementation plan so that we would see it back and be have an ability to make sure it reflected what we wanted to see it say. And then my further understanding is that the implementation plan will be used to flow down to the contracts with individual agencies so that when for culture creates the requirements that'",
        "'speaker_0': 'each agency has to meet in exchange for the support through this policy, that that those contracts would collectively have to meet the vision in the implementation plan. Am I saying that about right?'",
        "'speaker_5': 'That's correct.'",
        "'speaker_0': 'I don't see it really clearly in the language, I guess, of at least of the staff report. And I haven't, I'll be honest with you, looked at this closely this far down into the ordinance, yet this is happening like in real time.'",
        "'speaker_0': 'But I want to make sure that that language says exactly what I just said in the ordinance. But by the time we get to doing anything with it. You. Yeah, 1/2. I want to make sure that she got it.'",
        "'speaker_4': 'She write it down yet?'",
        "'speaker_0': 'Okay. Yeah. Councilmember and I would be much happier if we saw your pen actually write something. Marc Andrews. Okay. Thank you. Andrews Pen is right in council. That works. Okay. So Councilmember Lambert and then Councilmember Caldwell's.'",
        "'speaker_2': 'But we trust you. You know where to find the tape. I'm sure you're listening to the tape. It makes for excitement on page 14 on some area, the equity and start up plan on the first bullet says Cultural Opportunity Act six is expansion plans for the east, west and south sub areas of the county.'",
        "'speaker_2': 'So yeah, there's no north. But mostly when we talk about east, we're talking about maybe close to two thirds of the county is in east, which means that it ends up closer to Seattle than, say, North Bend or Snoqualmie.'",
        "'speaker_2': 'And in a meeting yesterday with people, they said, you know, we're really tired of things never getting out beyond the halfway mark of this county. So I think we're going to need to add another category there. At least one.'",
        "'speaker_2': 'I'm not going to speak to that. When somebody wants to speak to North, that's another issue. But I don't know how he said.'",
        "'speaker_3': 'Whether I'm next.'",
        "'speaker_2': 'Okay. 92, that for you, sir. The people yesterday to me say we don't want to be called the Far East anymore because that's not where we want to be called. So I don't know what we want to be called, whether we want to be called outside the rural areas or around the rural areas or unincorporated areas.'",
        "'speaker_2': 'But we need to have another thing in there so that it isn't just and not that I don't love Bellevue. I do love Bellevue, but what's in Bellevue doesn't necessarily help the people out in sky comas or in in Oklahoma.'",
        "'speaker_2': 'So I think we need to be looking at that 1007 square miles to make sure that they aren't left out again. Thank you.'",
        "'speaker_0': 'Councilmember Carl Wells.'",
        "'speaker_1': 'Thank you, Madam Chair. Just and I agree, I believe there should be another category I thought that was being put in. But I do think another point is very important here that is added to this new proposed ordinance, and that is that the equity advisory committee that would be established by foreign culture would have at least nine'",
        "'speaker_1': 'members on it, appointed by or confirmed by the Council. That means that every council member of the nine districts is able to determine who would be a good representative of her or his district, and the council would confirm those appointees.'",
        "'speaker_1': 'I think this would go a long way toward the council. The council excuse me, the council would confirm those members appointed. So that would go a long way to address what I believe a council member will do. She brought up and council member.'",
        "'speaker_1': 'Council.'",
        "'speaker_0': 'Okay. Any other questions, comments at this point? Councilmember DEMBOSKY.'",
        "'speaker_3': 'Thank you. And I'm trying to get orange. I just came from the Shoreline Rotary, my annual presentation there and their annual one of their annual inquiries is with respect to sound transit. And it's been, I don't know, 20 years since they've had a supposed North End or an actual North End representative on the board.'",
        "'speaker_3': 'And so this is fresh on my mind because having a meeting at the table, make sure you're at the table and not being eaten. So why isn't there in this new proposal? Why was the North End left out?'",
        "'speaker_3': 'I mean, we have strong cultural organization as a shoreline historical society, the Kenmore Historical Society. We have a void, if you will, a gap in in in capacity up there. Why was it left out?'",
        "'speaker_0': 'I know. I will I will dove right in there and say we had we have had a number of discussions among us who were working on this. We've invited others to join us in working on it. And we're inviting now for people to join us in working on it and perfecting it.'",
        "'speaker_0': 'So I think that regardless of why it is the way it is today, this is the point of a discussion with all nine of us is now we are all nine here. We were all nine talking about it and that we can perfect things that are missing.'",
        "'speaker_0': 'And I think that that's an important thing to do. But the I will tell you, the way the discussion went was, should we have a plan that each council member engages in advising for culture what it should say by district?'",
        "'speaker_0': 'That was the initial idea. And if you look at a map of our districts in some places, that makes a whole lot of sense. In other places, it doesn't make as much sense to do it by district. That's just because the district lines me.'",
        "'speaker_0': 'You know, they were written for a purpose, which is to basically get us all as somewhat equal amount of population to represent. They weren't necessarily drawn based on, if you will, watersheds of arts and culture and heritage.'",
        "'speaker_3': 'Well, as someone who drew those lines and knows the law, one of the factors you look at our communities of interest. Right. So that's in the state statute on redistricting. And so.'",
        "'speaker_0': 'I understand that obviously.'",
        "'speaker_3': 'You have northeast, south and West together. And so it seems like a choice was made here to leave the north end out. And I'm just wondering why.'",
        "'speaker_0': 'No, no, no. We we what we talked about in our meeting was having sub areas. And the sub areas in this county have typically been represented by north east and south north is, you know, think about transportation, you've got skateboard, you've got seashore, you've got ETP.'",
        "'speaker_0': 'I don't think those are perfect. And I'm perfectly open to talking about smaller and different segregation, but that was the discussion. There was no discussion of let's leave the north end out. Nobody said that. And in fact, we put the north end in.'",
        "'speaker_0': 'But like I say, if there's a different and a better way of doing it in, you know, your district, as I know my district, as we all know our districts better than anyone else.'",
        "'speaker_3': 'Well, maybe maybe I'm just misunderstanding, maybe the communities in there, but it's not in their name.'",
        "'speaker_0': 'Councilmember Cole. Well, I thank you.'",
        "'speaker_5': 'It was intended to be part of West, but if it if I can certainly reword.'",
        "'speaker_1': 'And Madam Chair. Go ahead, Councilor. I did get a text from a staff that yeah, it was I thought it was going in there. That was the intent, just there was never any intention to leave it out and it was an error that it did not get included.'",
        "'speaker_1': 'So I think we should go along with what the chair has indicated that we're here to get this perfect, and that includes making technical adjustments as needed. Thank you.'",
        "'speaker_0': 'And I. I meant what I said. If north, south and east aren't the right words, clearly west isn't the right word. But if north, south and east aren't the right words, or if that's not enough words, then we should add more words or change the words.'",
        "'speaker_0': 'That's fine.'",
        "'speaker_3': 'And thank you. Thank you for the information. I think it may be less about the labels and more about logical communities of interest that are based on a history of investment or not investment, or any communities of common interest and how they might work together or not.'",
        "'speaker_3': 'And so I'm not sure if those are further defined in the ordinance somewhere, but that's really my kind of thinking on it. You just, you know, if you're going to go with this approach of having these regional plans, what what should those regions look like?'",
        "'speaker_0': 'There's a great discussion to have. And I that's what I meant, actually, is if if the words north, south and east don't capture the logical communities of interest because they're too broad or because they're not in the right places, then I think it's a great discussion to have about what are the right categories, how small, how focused'",
        "'speaker_0': '. That's a good conversation to have.'",
        "'speaker_5': 'But I would I. It also add that that requirement is within the implementation plan, with the intention that it would be further defined within the implementation plan that the Council would be approving.'",
        "'speaker_0': 'And I'm sorry, I don't mean to make this into too much of an informal discussion here, but but it's also very important that the ordinance say clearly what we expect to be in the implementation plan, because if it doesn't say that clearly and the implementation plan then doesn't include what we assumed would be in it, we don't'",
        "'speaker_0': 'have the authority to require that to be in it. So, I mean, the ordinance language is very important for that reason. Did I see Councilmember Garces hand a few minutes ago? Councilmember Garza, were you waiting? No. No. Okay.'",
        "'speaker_0': 'You were in the middle of your presentation. Why don't we let you continue?'",
        "'speaker_5': 'So that was the explanation of the chart and the first change from the underlying ordinance. If there aren't any more questions about the the chart, the next requirement is that I did.'",
        "'speaker_3': 'Madam Chair, I think clarify back to the numbers, if I might, a very brief one.'",
        "'speaker_0': 'Go ahead, Councilman, before.'",
        "'speaker_3': 'We get too far ahead on it, because I think this is important, this question of whether or not the new measure. Shifts money from regional organizations to community based organizations. And I'll say my read first, it's partly a comment I want to just make.'",
        "'speaker_3': 'I want to make sure I'm understanding this accurately. I think I am. Regional organizations would receive the same amount of money under this proposal as the original one. This just says 10% of it has to be spent in communities outside, you know, whether it's intentional.'",
        "'speaker_3': 'And the classic example we use is the science center vans. It's an easy one to understand. Or if they volunteer, they could voluntarily give some money back to for culture. So one scenario, if they chose to do things like Vans, is that the community based organizations would get not one dime more in dollars under this, but those'",
        "'speaker_3': 'communities would have. It just kind of locks in what we've been talking about, which was that organizations could come into your community. I just want to because I it's at the core of one of my concerns is that distinction between investing in a community versus investing in a different community and having them come into yours.'",
        "'speaker_3': 'And I just wanted to the way it appears the money flows here is that the money is proportional money to regional and communities the same under both versions. We just say the regionals need to spend 10% on certain things that benefit communities other than the one they're located in.'",
        "'speaker_3': 'I just want to make sure that I'm following that correctly.'",
        "'speaker_5': 'That's correct.'",
        "'speaker_3': 'Okay. And some of that, how we communicate is a matter of.'",
        "'speaker_5': 'Correct and made data.'",
        "'speaker_3': 'Differently.'",
        "'speaker_5': 'But I if the chart dynasties, say organizations, probably we'd be at this point better to categorize this total amount as spend on communities, most of it going to community based organizations. But we can't tell you exactly what that would be at this point until those contracts are are signed, because.'",
        "'speaker_3': 'It kind of that throws me because then we put it in categories and we say it's kind of another example. The schools, if I understand it, 10% of the money goes to school districts. Other money goes to regional organizations that they spend on school programs.'",
        "'speaker_3': 'And so sometimes we conflate the terms. School access program with money for the schools. And when we do that, it makes it appear as if the regional organizations are getting much less money than they are. If we pull out the portion that they're spending on the schools, pull out the portion that they're spending on community organizations, and'",
        "'speaker_3': 'we say, look, they're only getting 40% of the money. The reality they're getting a much larger percentage, but they have some strings attached on how they spend that. And that's good or bad. It's a matter how to communicate.'",
        "'speaker_3': 'I just want to make sure we're transparent about where the dollars are, who's getting to make them make those decisions about the dollar. So that's as more of a comment than a question. But I think it I think it's a fair one to correct.'",
        "'speaker_5': 'And and really, in terms of who's making the decisions, even with the the public school access program restricted funds, it really is down to that contract level. So it it's it's a proposal by the regional organizations, but it's a process to determine if if the proposal meets the eligibility requirements and the eligibility requirements will be based on'",
        "'speaker_5': 'what is in the ordinance.'",
        "'speaker_2': 'Councilmember Coles.'",
        "'speaker_1': 'Thank you, Madam Chair. Leah, I would I think we're getting ahead of ourselves a little bit. Lia has not gone over the whole proposal yet, but there are a couple of provisions I think do need to have attention.'",
        "'speaker_1': 'One is that unlike the original proposed ordinance, this one includes language that each council district will be receiving of a minimum of $1 million to be directed toward community based organizations. That is something very different. Yes. And secondly, we did include language.'",
        "'speaker_1': 'And I cannot tell you where it is right now, but you can go over it as a path forward for council districts to add a path for community based organizations to be come or have created centers. Big centers could become regional centers themselves so that people from Seattle, from my district, could go to another area of the'",
        "'speaker_1': 'county to attend an event, to go to a museum that would be a new regional organization. So money is spent in that district as well for hotels, restaurants, shops and so forth. So we are trying very hard to address the need, legitimate need, I believe, to get an equitable distribution around the whole county in every district.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Madam Chair.'",
        "'speaker_2': 'That the member for the.'",
        "'speaker_3': 'Question on point Councilmember Caldwell's that's a really interesting idea, an appealing idea for a district like mine and I think other members on the council and I could see that really bringing value. You know, Councilmember One has been a good supporter of the new federal waste center and you can see the enthusiasm around from the community surrounding'",
        "'speaker_3': 'that and what that will mean at the federal way. And I could see something in the kind of redeveloping North End, you know, Kenmore Mall area. In this proposal, how would that be funded? Are there dollars in the funding allocation method that could bring that to life?'",
        "'speaker_3': 'And if so, how much? It sounds like an expensive undertaking, but there's a lot of money here. So is that is that in here to fund that?'",
        "'speaker_5': 'So what Councilmember Caldwell's is referring to would be within those those Sabrina plans that would be developed. And so those those plans would be intended to look at the funding available within the different categories, and it would be different in different areas and how, you know, direct how that it should be developed or how it should be'",
        "'speaker_5': 'used over time to develop such things as a regional center for specific purposes. And that then would be used by more culture in working with their organize the organizations that they're providing grants to and looking at how distributions should be made protected, particularly within the competitive pool to achieve that vision.'",
        "'speaker_3': 'Okay. And maybe this may be an offline explanation, but I'm not seeing on your helpful chart on page 13, which seems to allocate the dollars where that money would come from. I mean, one of these centers would 10 to $20 million.'",
        "'speaker_3': 'I would assume.'",
        "'speaker_5': 'It could come from any of the categories. It would be. A matter of the organizations that the money has to go to, organizations other than the public school access, the 10% part of the public school access program. So everything else has to be achieved through awards to to cultural organizations, either regional ones or community based ones.'",
        "'speaker_3': 'So in theory, could a regional one say the zoo or the Seattle Art Museum? Would they somehow in their bucket of money, be funding a North King County Regional Cultural Center?'",
        "'speaker_5': 'Is that possible that that wouldn't that? I don't think that's the way that it's written currently. It would be borders that money.'",
        "'speaker_3': 'Well, I'm honestly, I'm trying to understand where the where the money is to do this. It's I guess it's a I love the concept and it seems to have a lot of value. I mean, it's very appealing. I mean, next.'",
        "'speaker_0': 'Councilmember Lambert's been meeting him and Councilmember Gossett.'",
        "'speaker_2': 'So I really like the idea of some regional planning like this, both what Councilmember Caldwell says, and then the other day, Work Council member of the Grove said, When we bring people into Seattle, there's a multiplier effect and it be interesting to know what the multiplier effect is.'",
        "'speaker_2': 'You know, for every dollar spent in the arts, does the surrounding community get $15 because people are getting dinner there and they've spent the night at the hotel or pay for parking, whatever? Because, you know, a lot of our districts could use some economic development.'",
        "'speaker_2': 'So how do we get something in other districts, too, out of this money so that we would have some economic development going on? Because this is a wonderful thing and it should be available to other places. The other thing is that as I'm listening to this, there are districts in this county that don't really have the wherewithal'",
        "'speaker_2': ', as I'm wondering, much like with our best starts for kids, if we could have a navigator, a listener, an expert, whatever we want to call this person.'",
        "'speaker_1': 'Who.'",
        "'speaker_2': 'Was on tap that anybody could say, I need you to help me get an X in my district and help with the expertize of that. Is there somebody like that in here or there?'",
        "'speaker_5': 'There is actually there within the community based cultural organizations. That 1.8 million you see for admin administration of the community based cultural organization program. The vision is to have technical assistance, to have some, you know, to to provide technical assistance for organizations, to help them learn about the program, to help them apply for a grant funds to'",
        "'speaker_5': 'learn about what they may be eligible for. And the vision would be actually to have some of those technical support people co-located out in communities, not Seattle, where our culture is currently located. So one in the north, one in the east, one in the south.'",
        "'speaker_5': 'And then beyond that, there's some planning towards using money for communications, using money to develop initiatives, basically.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Councilmember Gossett, followed by Councilmember Caldwell's.'",
        "'speaker_4': 'Thank you, Madam Chair. Yeah, this is in response to a response that you made to Councilman Dombroski. I thought that at the beginning of this process and peak my interest when you said we're going to have $3.8 million available for community based cultural activities, even possibly a couple of regional centers.'",
        "'speaker_4': 'But then later, when he asked about who makes the decisions about this money or this kind of money, it wasn't clear on who that would be. I'm trying to figure out, is this 3.8 million and for Culture Bank and we have to go to them and make a case.'",
        "'speaker_4': 'Or is this part of the council's strategic plan where the King County Council will have some say and determining who gets this money is just it's not clear.'",
        "'speaker_5': 'The 3.8 would be part of the Regional Cultural Organizations Award. So the state law provides a formula where the regional organizations get their award. You know, we talked about they don't just get a blank check that it's actually an eligibility.'",
        "'speaker_4': 'Says how much each one of them get. Correct.'",
        "'speaker_5': 'And I know we've done that, but the 3.8 million would be is a restriction on those funds to be spent in communities.'",
        "'speaker_4': 'That's what DEMBOSKY was asking. Like if the zoo get 4.7 million and the Pacific Science Center gets 4.2 million. Are you saying that in order to come up this 3.8 million, each of them are giving up 800,000 and putting it in a pot that smaller regions can apply to.'",
        "'speaker_4': 'It's true that our culture or some other entity that's going to make the decision on who gets this money, how much and what they can use it for.'",
        "'speaker_5': 'Yes. Okay. So there are three basic options of what those regionals could do with that restricted portion of their award. They could spend it directly on programing in communities. They could partner with a community based in. In that case, that would be a joint decision between Fort Culture and the regional organization on how to spend that money'",
        "'speaker_5': '. They could partner with a community based cultural organization in a community, so that would be a joint decision with the cultural, the regional and the community based cultural organization. And then again with for culture, because it would be a contract for the award.'",
        "'speaker_5': 'The last option would be and it could be somebody first. I don't there's no particular order, but it could be to return the funds to for culture and then it would be a part of that community based cultural organization, competitive pool that.'",
        "'speaker_4': 'Would apply.'",
        "'speaker_5': 'Health care would administer.'",
        "'speaker_4': 'And people would apply for.'",
        "'speaker_5': 'Cultural organizations would apply for money. Correct.'",
        "'speaker_4': 'And then the decision makers would be for culture and the people that they put together to help them make these decisions.'",
        "'speaker_3': 'Correct. All right.'",
        "'speaker_0': 'Councilmember Caldwell's followed by Councilmember Dunn.'",
        "'speaker_1': 'Thank you, Mr. Chair. Miss Madam Chair, thank you. Thank you, Madam Chair. A couple of points and I'll wait until Councilmember Garcia returns to address what he brought up. But with regard to the comments or questions made by council members up to Grove and DEMBOSKY, which I thought were there are very important ones I would like I'",
        "'speaker_1': 'would invite you to turn to a couple of pages in our briefing, page 14, again on the fifth bullet sub area equity and start up plans. And you may see on the third one it refers to a cultural organization's start up plan for fostering the development of new cultural organizations.'",
        "'speaker_1': 'And the overlying part of this one requires that for culture develop plans with. In consultation with County Council members. We also have been created the Equity Advisory Committee, which we would confirm the appointments to that representing our district.'",
        "'speaker_1': 'But more pointedly, if you will, turn to page 53 in our briefing, this is the actual redlined version of the proposed ordinance for us. And on that, which is page five and insert 53, page 53 in our materials, page five of the redlined ordinance and on the statement of facts, number 11 and 12, all added, all in'",
        "'speaker_1': 'red line refer to this access for all funding would foster the creation and development of new cultural organizations throughout King County, reduce geographical barriers and ensure that all residents have easy access to arts, science and heritage resources. And very poignantly, number 12, access for all funding would support the growth and development of arts, science and heritage centers'",
        "'speaker_1': 'throughout King County to promote healthy and vibrant communities. I wanted that those two in there to make sure that our intent is included, to be able to have that path forward, to create the centers that have been mentioned.'",
        "'speaker_1': 'It's integral to this proposed ordinance.'",
        "'speaker_0': 'I think you can smell Councilmember Dunn followed by councilmember.'",
        "'speaker_3': 'Of the girl. At first. Let me say you're doing a good job up there right now.'",
        "'speaker_5': 'I'm going to tell you when you're ready.'",
        "'speaker_3': 'Yeah. Doing a good job. I guess my interest is there or, you know, not a lot of arts district things in my district. I want to be able to create something out of whole cloth that doesn't exist there because there's nothing there right now.'",
        "'speaker_3': 'And so the flexibility is important to do just that. And I just want to make sure that we can build that in.'",
        "'speaker_5': 'Yes, it is. It's built into the state statute that funds can be used, community based cultural organization funds can be used to fund startup costs for new organizations.'",
        "'speaker_3': 'What about capital, though?'",
        "'speaker_5': 'Yes, capital. Regional culture organizations cannot fund capital, but community based ones can.'",
        "'speaker_3': 'Very good. Thank you. Yes.'",
        "'speaker_0': 'And Councilmember Dunn, if I may, you're being a little unfair. You have three excellent community based organizations on our list here, and we just we'd like to see more.'",
        "'speaker_3': 'Yeah, I wish we had more. The way my district is sort of balkanized, there just isn't that urban core that traditionally carries the arts organizations. Thank you.'",
        "'speaker_0': 'Very good. Councilmember at the.'",
        "'speaker_3': 'Grove. Madam Chair, I'm worried I'm wading into beginning a discussion back and forth that we want to wait on.'",
        "'speaker_0': 'I think that I think we're there. I myself. But thank you for asking. I appreciate that.'",
        "'speaker_3': 'I have I I love the language in here that calls for development of plans for how we get geographic equity, how we address that. But we're spending the money and then we're going to go have a plan. I one, I think we should have done that before we created how we drive all the dollars out.'",
        "'speaker_3': 'And I also think there's an important distinction between non legally binding and, you know, findings language that we want to do this or language that calls for the creation of a plan is very different than putting money aside to do that.'",
        "'speaker_3': 'And there's no guarantee that there will be any money to do that. There is the the pot of money for community based organizations. We could tap into that. Maybe that could happen. Maybe in some areas. That means it comes out of the other community based organizations.'",
        "'speaker_3': 'You know, I. I wish that's what our plan did. I wish whoever wrote the state law had done that kind of planning and create a system that allowed us to invest those dollars in ways that created that. But if we make a decision to put something on the ballot, the buy formula drives a huge chunk of the'",
        "'speaker_3': 'money into the large regional organizations that are geographically centered largely and then say, we'll have a plan and we'll that might try to achieve some other things. It doesn't provide certainty and it it appears almost like window dressing on something.'",
        "'speaker_3': 'It's a good faith. I think it's a listening and response to concerns. But, you know, if you know, there's only 7 million a year for capital in there and if we're going to spend 7 million a year on developing this, this means there won't be capital for small organizations.'",
        "'speaker_3': 'There's all trade offs in those decisions we make and we punt on those decisions, which is okay. I mean, it's an implementation plan and contracts for how people spend the money. But I just think there's a difference in point.'",
        "'speaker_3': 'I think it goes to the question Councilor Dombrowski was asking. Around. Where will the dollars come from? And also, is there is there any level of certainty at all other than it's eligible? There'll be a plan. Maybe we'll do it, because I believe you can.'",
        "'speaker_3': 'I think the up my soapbox squirrel. I actually believe in that vision that if we had a part of, you know, this is a $500 billion plan, let's say you put a 50 million into something up north to develop a string of historical museums up there and then developed a plan on how to we'd settle for 40'",
        "'speaker_3': '. Yeah, well, 50 million is only 10% of this whole thing.'",
        "'speaker_1': 'Are these two.'",
        "'speaker_3': 'And you know if the dollars went, if we had certainty that those dollars would be there to implement the plan, whether it's 100 million, 50 million, 40 million in a community, then you know, you're getting that. But to say, well, the plan and they can compete within that existing community, part of money I don't think provides a'",
        "'speaker_3': 'level certainty that gets me comfortable. I think that's a to comment and a I guess a debate on that on that point.'",
        "'speaker_0': 'Okay. Councilmember Cole. Well.'",
        "'speaker_1': 'Thank you, Madam Chair. Well, as council member at the Grove pointed out, there is a requirement for a plan for the funding, but no funding takes place before an implementation plan is approved by the Council. So I think that if we can keep that framework in mind, then we can see that the Council will not approve any'",
        "'speaker_1': 'plans. No money will be provided until the plans are approved and the Council will be having a lot more involvement in that implementation plan itself, especially through this equity committee with a representative from each council. The ordinance proposed ordinance also includes a provision that the board culture board will have to hold meetings out in the communities to'",
        "'speaker_1': 'get the community input what they want. And the last thing I'd like to say here is this is a process. The money is not going to be there instantly. It will be gradually increased as the revenue comes in.'",
        "'speaker_1': 'And that's why I said that we included a path forward. So there could be these large regional centers in sub areas and individual districts have to work toward that. And that's what we will be doing with our involvement with the implementation plan.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilmember Gossett.'",
        "'speaker_4': 'Thank you, Madam Chair. I think that Councilmember Antigulov articulated my vision and analysis really quite well. And then let me give you an example of why I say that. And let's add that we're going to get $3.8 billion moved from the big organizations, big regional organizations that could be flexible and used and all over the county first'",
        "'speaker_4': 'roll out first. Then in response to Councilmember Dunn, who articulated the possibility of building a big community based cultural center in his district. She said that he said that would we have to use the community based funds? And she said yes.'",
        "'speaker_4': 'And I had earlier thought that the big extra money was coming from the big organization. So when I come out of the ground and said that whoever set this up, they really put us in a bind because they put in the legislation for any county over 1.5 million we want is a prescription problem.'",
        "'speaker_4': 'All the big organizations get a lot of money based on their traditional attendance rates and the amount of money that people are already putting in these cultural institutions that have been here a while. And and then when there was a lot of funds coming from the community, they said, let's see what we could do to try to'",
        "'speaker_4': 'get a more equitable process established. But it would have been much better to have a lot more flexibility and $500 million coming for control and scientific development or county if one. We, the legislative body, have a lot more flexibility from the get and setting something that we collectively thought would be democratic and real responsive to our people'",
        "'speaker_4': '. And I think that's the reason we're having so many struggles now. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. I feel a little compelled to just kind of put a little historical context on this, though, that this legislation was worked through Olympia for eight years, quite a number of years. And my understanding is it was supported by a legislative agenda and lobbying each step of the way by county council members.'",
        "'speaker_0': 'So it has been here a number of times over the years. I know my predecessor was very active in advocating for this bill, both at the County Council and at the state. So I there's a big difference between a bill that we're not trying to implement and a big tax ask that we're not like imminently about to'",
        "'speaker_0': 'do. But and today, when we're being asked to imminently do it, but it's the structure is not something that is or should be news to this council. Okay. Were you done, Leo? And we got into discussion or did you have more?'",
        "'speaker_5': 'I hadn't finished providing the comparisons. A lot of them have come out. So it's up to you if you want to make sure that I get them all in or if you feel, you know.'",
        "'speaker_0': 'I'm going to ask for you to finish, please. And if there are things that we've already sort of talked to, maybe you just hit them quickly and carry on.'",
        "'speaker_5': 'Thank you. Okay. So. So first, there would be a requirement for for culture to distribute a total of at least $1 million in each community based or in each year to community based cultural organizations in each county council district.'",
        "'speaker_5': 'So that's a change from the original ordinance and next requirements for Four Cultures annual report on the program to the Executive and Council would include specific provisions, including a report on the distribution of funds and numbers served broken down by council districts.'",
        "'speaker_5': 'So members would be able to track that over time. The first report would be transmitted in 2019 rather than 2018 because that's when the money would be coming in. Next, the proposed ordinance would require the council require council approval by ordinance of the implementation plan, and it allows for amendments to the implementation plan, which could be initiated'",
        "'speaker_5': 'by the executive or the Council. But the Council would approve any amendment by ordinance. The proposed ordinance also restricts proceeds of the tax exempt start up funding from being spent until the implementation plan is improved approved by the Council.'",
        "'speaker_5': 'Next it in group includes require requirements for for for culture to develop three plans and those have been discussed somewhat. But let me lay them out what they are and they each plan would be developed with community input and also includes council can't even talk anymore in consultation with county council members.'",
        "'speaker_5': 'So the first one would be a cultural opportunity and access expansion plan for the sub areas of the county and we will correct those. And the next one would be a county wide cultural access equity plan for achieving equity and inclusion outcomes.'",
        "'speaker_5': 'And the equity inclusion outcomes are listed in the ordinance, and this would be a plan for how to specifically achieve them. And last would be a cultural organization start up plan for fostering the development of new cultural organizations.'",
        "'speaker_5': 'A next requirement would be that it would require at least nine of the members of the Equity Advisory Committee that for culture would be creating to be recommended one each by each county council member and confirmed by the King County Council.'",
        "'speaker_5': 'And finally, it makes a number of technical changes to clarify the ordinance and comply with state law, including amending four cultures charter to make it clear that they have the authority to administer this program.'",
        "'speaker_0': 'Okay. That brings us to the end of the presentation. Is there any other questions or discussion at this time, Councilman Domanski.'",
        "'speaker_3': 'Thank you very much. I was looking at this red line version, which is helpful. And in section ten, on page 78 of our materials 30 of the ordinance, there's some new language here around the Charter of the Cultural Development Authority.'",
        "'speaker_3': 'It says it's approved. It says it references an attachment A which isn't here. Help us understand what's going on in this section.'",
        "'speaker_5': 'I'm sorry. That's my mistake. The attachment age should have been in your packet.'",
        "'speaker_3': 'So is the legal question, you know? Feel free to toss it to our legal beagle over there, Jim.'",
        "'speaker_5': 'It was a legal recommendation just to make it explicitly clear that for culture has the authority to to administer the act this for all program. I mean, they have broad authority, but one of the things they don't have explicit authority is to provide funding for, for example, science organizations.'",
        "'speaker_5': 'So this just cleans that up, make sure that they have that that actual change in the attachment. A if you saw is, is pretty small, but I will make sure it's distributed. It's like a one liner.'",
        "'speaker_3': 'We are we by this ordinance changing the charter of our culture to give it new powers.'",
        "'speaker_5': 'Yes. Just narrowly focused to administering this program.'",
        "'speaker_3': 'Okay. And if we're doing that by this ordinance, can we make other changes to the For Culture Charter in terms of its.'",
        "'speaker_5': 'You could if they were related to the access for all program and fit that one one subject role. Well, I probably shouldn't be giving legal advice, but that's what I've been told.'",
        "'speaker_0': 'We want to invite him is.'",
        "'speaker_3': 'Nodding. I think they got it right. Okay. At least for today's purposes. I want to echo Councilmember Dunn's comments. This is a complicated ordinance and it's very clear you're prepared and know it well. It's been helpful to hear your answers to the questions.'",
        "'speaker_3': 'Good job. Thank you.'",
        "'speaker_0': 'Any comments or questions. Okay. So I've heard a number, by the way. I think there's been a really good discussion. I echo the thanks to the staff and especially Lee. I know I have a sense of just a sense of how many hours you have spent to get to the level of mastery that you have today.'",
        "'speaker_0': 'But it's been very, very helpful to us. So thank you so much. A lot.'",
        "'speaker_5': 'But could I just also say poor Andrew.'",
        "'speaker_1': 'Doesn't say anything, but.'",
        "'speaker_5': 'He is doing a lot of work.'",
        "'speaker_0': 'There. Looks really good, you know, just he looks like he he gives a lot of confidence just because of his demeanor. You have.'",
        "'speaker_2': 'You know, from.'",
        "'speaker_5': 'Your work with him behind the scenes, but.'",
        "'speaker_0': 'He thank you as well, Andrew. I mean, I know that there have been a large number of people, I mean, district staff as well, who have been working, just working very, very hard to get this to a place where we could have just the type of discussion that we had today, which I think was very, very helpful'",
        "'speaker_0': 'and productive. I appreciate everybody is engaging with it where we are right now, if I may, was sort of wrap us up here over this agenda item is, as I said at the beginning, this ordinance does has been duly referred to budget in fiscal management and to this committee.'",
        "'speaker_0': 'I am not going to unless somebody waves their hand frantically to me and asked me to ask for a vote to move this out of committee because it wouldn't really accomplish anything. If we want to move forward and discuss this further and potentially take up an action that will have to happen at an upcoming meeting of the'",
        "'speaker_0': 'full council, because, as I said, the Budget and Fiscal Management Committee doesn't meet until after our timeline has run out to do what was proposed in the initial ordinance. And so that decision will have to be made by the body at council whether and what they want to do and I don't think we're going to do that'",
        "'speaker_0': 'here today. So I think I'll just leave it there for now. Councilman Domanski.'",
        "'speaker_3': 'Think that chair and.'",
        "'speaker_0': 'Your Councilmember Dombroski is up and then you're next.'",
        "'speaker_3': 'Sorry, Councilmember Garcia, thanks for having this again, this working session today and for bringing forward this new ordinance. Just procedurally following on that, can we get reoriented or refreshed or reminded about the timeline that the council is facing?'",
        "'speaker_3': 'Assuming that we were shooting for that August 1st, 2017, ballot measure, I know there's some different vote requirements being on when you do it and let us know what what we're what our time. Sure.'",
        "'speaker_5': 'So the last and the last council meeting to do it as a regular action, it would be with minimal processing, meaning the chair and the executive would need to sign it right away and that it would be May 1st.'",
        "'speaker_5': 'And then after that you'd have until May 12th to pass it as an emergency. But the last council meeting would be May 8th unless there were a special customers.'",
        "'speaker_0': 'Thank you. Councilmember Gossett.'",
        "'speaker_4': 'I had a question of first of all, thank you, Madam Chair, and a question on something you said and and I need, Councilman, I think about the way and and here it is. And I understand why the council as a whole decided to refer it is to committees.'",
        "'speaker_4': 'It was originally in the budget and now it's a budget. And Kyle, if. But it is not going to or nor has any intention of and had before our deadline of May 1st, what was the value, what was the necessity of referring it back to budget?'",
        "'speaker_4': 'If there's a likelihood that we're going to make the decision on that before it could even get the budget. And I don't understand that. And it was a redland budget.'",
        "'speaker_0': 'I believe councilman of the Grove might have a word or two on that topic.'",
        "'speaker_3': 'Well, thank you, Madam Chair, and thanks, Councilmember Gossett. And I can only speak for my personal perspective and understanding, and I'll be candid with folks as it was, we have some divisions on this council as to whether or not this is the right plan and the right time at the last council meeting.'",
        "'speaker_3': 'Some members were you know, there were there were different paths forward. And it was unclear whether or not there was the support at the time to pull this forward. And the the two committee chairs talked and it appeared there was support to refer it back to the Budget Committee.'",
        "'speaker_3': 'But there also is a shared desire to support the public interest of having greater debate and discussion in order to facilitate trying to find a solution before the clock runs out. That would have been harder if it had been referred to the Budget Committee because we didn't have a meeting to have this kind of discussion and input'",
        "'speaker_3': '. So even though. There wasn't necessarily support for it to go around the Budget Committee. There was support to keep trying to keep trying to find solutions to that that meet a majority of the council. And by having by doing the dual referral, it allows it to essentially, if we were to vote it out today, it would go'",
        "'speaker_3': 'to the Budget Committee. But if it had just gone to the Budget Committee, we would not have had the opportunity to listen to each other and listen to the public and keep exploring solutions the same way we could.'",
        "'speaker_3': 'So it was a way to keep the discussion moving without, quite frankly, the budget chair feeling like it had been pulled out of the jurisdiction of the Budget Committee. So that's my best attempt to explain why I thought a dual referral made sense.'",
        "'speaker_4': 'So the Budget Committee would possibly never will hear this.'",
        "'speaker_3': 'That's a scenario I think I can. I think that if this were to pass, the likely scenario would be a majority of the council feels strongly that it needs to come up and would vote at full council regardless of what committee it was were referred to.'",
        "'speaker_3': 'I would hope that that, you know, anytime committee chairs don't want that to happen to themselves, but. Procedurally, if the decision today is not to advance it out of this committee, then that would be the procedural path forward, as I understand it, if it were to advance and I don't know, let maybe the chair.'",
        "'speaker_0': 'You know, add a word in. First of all, I agree with everything that our budget chair, councilmember of the group, just said. That was an accurate rendering of my understanding of how this came about. It was a compromise.'",
        "'speaker_0': 'And the compromise was to for the purpose of allowing discussion and an opportunity to try to. I've been using the word perfect, the ordinance, but I guess I should say to amend the ordinance to a place where perhaps there could be stronger support for it going to the ballot on on the council.'",
        "'speaker_0': 'If we succeed in that, then I think you might see that there's a path to vote at full council because it would be by agreement and without objection. However, if we can't get to the point where people were council members feel that they want to advance this, then we would be back, in my opinion, in the same'",
        "'speaker_0': 'place we were out before today, which is that there's no agreement to move forward at the Budget Committee and therefore it does not move forward. So this is just give us one more opportunity publicly to discuss the specifics, to discuss particularly the new proposals.'",
        "'speaker_0': 'One of the challenges in all of this has been, although some of us have been working on amendments, they weren't widely shared because they were very slow in coming along. There was a lot of work to do here.'",
        "'speaker_0': 'And and council members rightly said that they would need to see and understand exactly what was being proposed before they could have a position on it. I mean, that's eminently reasonable. And so today was that opportunity. And we're going to see after today where we are, whether we can get close enough to have a vote at council'",
        "'speaker_0': ', at full council, or whether we can't. But it's going to be the will of the body either way. I mean. Right. We we vote as as nine and you need a you need a majority on something like this.'",
        "'speaker_0': 'I'd like to see more than just a bare majority anyway. So I think we're trying to get to a place where more of us feel that it's something that they can support. Councilmember Gossett, thank you.'",
        "'speaker_4': 'Earlier you had said that one of the amendments is that $1,000,000 go to each council district. But then when I made an inquiry about that, they say, oh, Councilman Garcia, it doesn't mean you're district because there are different entities located in district that are already cumulatively receiving more than $1,000,000.'",
        "'speaker_4': 'Well, that's not every district getting $1,000,000.'",
        "'speaker_5': 'That may have been an earlier concept, but the concept that is in the ordinance your district, every district would be guaranteed to receive at least one.'",
        "'speaker_4': 'Additional million.'",
        "'speaker_5': 'Dollar community. The community based cultural organizations within your district would be guaranteed to receive a total of at least $1 million.'",
        "'speaker_4': 'Why did the chair say no?'",
        "'speaker_0': 'I said, it's not you. As she was speaking and you asked an additional million dollars and I don't know if she heard you say that. So she was not saying every district gets an additional million dollars.'",
        "'speaker_4': 'Well, so was I correct originally that if there are organizations in District two that are cumulatively are getting $1,000,000 or more, then I would not get $1,000,000 for community based cultural entities. So an additional yeah, that's my question.'",
        "'speaker_5': 'I'm not sure if I understand your question. So there's there's the regional culture organizations that are distributed by formula, the community based cultural organizations by state law. Their process is a competitive process. So there's not really a guarantee necessarily of who gets what.'",
        "'speaker_5': 'I know there's numbers that have been circulated.'",
        "'speaker_4': 'The numbers.'",
        "'speaker_5': 'Correct. That's based on the previous grant awards that have that that occurred in 2015. So each council district would be guaranteed to have their community based cultural organizations receive a total of 1 million each year at least. So if if you looked at, you know, a chart that showed that you already were that District two was already'",
        "'speaker_5': 'receiving that to your culture, then it wouldn't add any to.'",
        "'speaker_4': 'It wouldn't be another million added.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'The specific purpose, if I may, Councilmember Gossett, of proposing this type of law was because in the original proposal, there were some districts that got I mean, almost literally nothing in community based. Okay. Yeah. Because as Councilmember Dunn pointed out, if you didn't have cultural organizations in your district, there was nowhere for the money to go to'",
        "'speaker_0': '. And so the idea here was to set a floor of some reasonable amount that could be used to develop and grow cultural organizations in places where they don't exist already. That that was sort of the concept. Yeah. All right.'",
        "'speaker_0': 'And remember.'",
        "'speaker_2': 'And just adding on to that, there was one in my district that got $583 and I got people to do 83,000. You know, no. 500, 3000 might have been wonderful. There were those zeros further down. So not having a floor made that really not as good as it could have been.'",
        "'speaker_2': 'I think we'll figure this out.'",
        "'speaker_0': 'Councilmember Graham.'",
        "'speaker_3': 'Just want to clarify, we're talking $1,000,000 annualized every year now. Okay. Just want to correct. All right.'",
        "'speaker_0': 'Thanks for good clarification. Okay. Councilmember up the group.'",
        "'speaker_3': 'Thank you. And I'll try to be brief. Since we didn't, we kind of we're in the middle of questions that we the comment kind of went quickly. And I, I just want to make one point because this may be one of the last chances, may or may not be what the last chance is to talk about it'",
        "'speaker_3': ', kind of that why the geographic distribution matters in my mind. One of the tremendous benefits of arts and cultural investments is the economic return to a community. These are important and worthwhile public investments. And I was looking at the American Planning Association website.'",
        "'speaker_3': 'These aren't my words. I want to be used to plagiarizing. They actually, as a planning association, acknowledge the value of arts and cultural investments in a community. They point out it improves a community's competitive edge, creates a foundation for defining a sense of place.'",
        "'speaker_3': 'It attracts new and visiting populations. It integrates the visions of community and business leaders and contributes to the development of a skilled workforce. Simply put, they provide direct economic and community benefit to the communities in which they're located.'",
        "'speaker_3': 'I've often heard the county executive and others talk about the differences in equality between one zip code and another in this county. Now, some people live shorter, lives in the poorer areas. And I think that if we want to have an arts and cultural funding plan that serves the purposes and the mission of this one, then it'",
        "'speaker_3': 'would have. We can, I believe we can. I have optimism that we can find a way to provide direct dollar investments into the lowest income, most ethnically diverse portions of the county so that those types of benefits are shared.'",
        "'speaker_3': 'There are benefits from people coming into your community. There are tremendous and I said it before, I really value and appreciate it. When Seattle Theater Group runs a camp for low income kids in South King County, or when the Pacific Science Center brings bands to schools.'",
        "'speaker_3': 'And overall, this plan will increase the amount of that. And that's good. But the idea of a very significant sales tax increase that burdens working class people the most without a significant investment into the lowest income parts of the county, is at the core of my concerns.'",
        "'speaker_3': 'I just wanted to make sure I had a chance to get that on the record as to why I feel the way I do. And I appreciate the million dollars per district, but at the end of the day, it's sort of I don't mean to say this in a negative way, but it's kind of fiddling around the'",
        "'speaker_3': 'edges while the main thrust and strategy of the plan remains, um, rather problematic. So it's because I value these and because I want to see these benefits shared, but I'm hopeful that we can keep moving in that direction of of ensuring that kind of direct investment in every community.'",
        "'speaker_3': 'I just wanted the opportunity to get that on the record and appreciate it.'",
        "'speaker_0': 'Thank you. Councilmember at Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Madam Chair. And I appreciate what Councilmember up the Grove said very much. That's been the fabric of what I've worked on as a public policy maker for a long time. It's spread across the policy areas to a and when the Prosperity Partnership came up with one of its recommendations for creating such a plan like we'",
        "'speaker_1': 'had before us, and I think that was in 2005, somewhere in there, if they looked at what was happening in Denver in particular, they had created something very similar to what we have here. And I believe the voters in the greater metropolitan Denver area have twice now three times voted on continuing that plan.'",
        "'speaker_1': 'And I don't recall all the other cities and counties, the metropolitan areas and the in the country that have since done the same. I know there are quite a few of them. And the point behind this was to do what the title of this act indicates access for all and.'",
        "'speaker_1': 'As such, the work in the legislature for eight plus years was focus. That has been the focus not to get money to the big boys, so to speak, the regionals, but how we can not only spread the opportunities throughout the county for especially for under in underrepresented areas, for access to arts, culture and science heritage, but also'",
        "'speaker_1': 'to create those economic opportunities in throughout the entire county. Madam Chair. Would it be all right if we had Jim Kraft come up for a moment? Because because he represents Cultural Access Washington, which worked on this for so many years, and I would appreciate him in just a couple of moments from him.'",
        "'speaker_0': 'Councilmember Ordinarily, I would be very, very flexible with that sort of thing. But we had a panel at the last call me that when we discussed this where we had a number of people who had a full opportunity to present the perspective of the proponents.'",
        "'speaker_0': 'And today is really meant to be about debate among the council members in our opportunity to have discussion. And we've gone well over the amount of time that was allotted for this. So I would just as soon move on to the next agenda item.'",
        "'speaker_0': 'And I apologize for that, but I don't think that that is going to advance our discussion any more today than we already have been able to advance it. So I would prefer.'",
        "'speaker_1': 'To add not appreciate that, but we do have a new ordinance before us.'",
        "'speaker_0': 'I understand. Thank you. Thank you for understanding. I appreciate that. Councilmember Councilmember run right where you've been waiting.'",
        "'speaker_3': 'Thank you, Madam Chair. First of all, I make sure everyone understands that this afternoon at 1:00, the Regional Policy Committee will also have this before it. And it's an opportunity for the gentleman who is just referenced to speak before us.'",
        "'speaker_3': 'We have a substantial list of people who are going to speak before the RTC on this very issue.'",
        "'speaker_0': 'Thank you, Councilmember. I appreciate that. I think that would be a good opportunity.'",
        "'speaker_3': 'You know, and I can speak to why I wanted to speak. I was just really.'",
        "'speaker_0': 'Oh, please go ahead. Councilmember Yes.'",
        "'speaker_3': 'You know, when I was a member of the state Senate, I took a very strong regional view, even though I represented at that time South King County in North Pierce County, because I looked upon some of the major players in our arts and related communities that reside in downtown Seattle, as you know, regional assets.'",
        "'speaker_3': 'And we needed to protect them, particularly as it nurtured. So I'm going back 30 years, 40 years. Well, they've had a good protection and they've got a lot of nurturing by us at the state level, by the state.'",
        "'speaker_3': 'Those of us who in the suburban areas are very happy to also nurture our burgeoning in growth industry of arts and sciences. And it's time, you know, again, as a state senator, I bucked a lot of criticism in my community to support taxes and plans and programs to support, whether it's a civic science center, Seattle Art Museum'",
        "'speaker_3': ', other major projects, because I saw them as major assets that benefited my community. My community is looking back now to Seattle saying help us. You know, I think it's very interesting. We use the word access to arts. Well, access to arts is very difficult for a lot of us because of transportation problems.'",
        "'speaker_3': 'You know, it's very difficult for people in Councilmember Lambert's district to drive down to Seattle. It's very difficult for people in councilmember up the groves to drive down to Seattle or even public transportation. We don't have light rail in federal way.'",
        "'speaker_3': 'And I just want to ask you, let's focus on that word access. There's not a lot access in Maple Valley to downtown Seattle. So we need to focus on trying to put some arts back in those communities. I would also talk about there's this body has taken a very strong position on recognizing that we've got to even'",
        "'speaker_3': 'the field. Well, it's interesting. The field has changed dramatically. If you look at the demographics of my district in 2017, it looks more like councilman regardless district in 27. So when you look at the demographic changes that taking place in King County and you want to talk about access to the arts and you care about the issues'",
        "'speaker_3': 'I've been raised here, I think we better take a long look and make sure there's more equitable, equitable access to the arts. Thank you.'",
        "'speaker_0': 'Okay. I think we have had a really good, robust conversation. We could do this all day. I would like to take the the final 15 or so minutes and and get to the the scintillating and very important topic of solid waste.'"
    ],
    "Demand Management Pilot Program Implementation Plan.": [
        "'speaker_0': 'So perhaps we could have one of my SO yeah, if we could move on to the next agenda item. Thank you very much, everybody, for that discussion, for that presentation. And we will now take up our final agenda item for today, and that's item six, where we have staff from the Solid Waste Division to speak to us'",
        "'speaker_0': 'regarding a demand management pilot program. Council will recall that during the budget process we spent some time reviewing the issue of how to complete the solid waste transfer network. And I think that you all are keenly aware that we have a long awaited, solid waste, comprehensive plan that needs to be adopted.'",
        "'speaker_0': 'And some of the issues have to do with the how our transfer network builds out and whether or not to proceed to build a new Northeast transfer station. The executive budget recommended a demand management pilot project to test whether the service needs of that area could be addressed through strategies partially to address, through strategies to control demand'",
        "'speaker_0': '. It's an issue we've been hearing quite a bit about, including at the regional that regional water quality, but Regional Policy Committee and in particular, there's been interest on the part of the council on how the pilot would deal with places like the Holden Transfer Station in Kirkland, which serves Northeast King County.'",
        "'speaker_0': 'So we had a proviso which the executive transmitted a response to. We're going to ask our staff, Mike Reed, to provide an introduction. Are you prepared? Yes. Okay. And and then I understand that the division will be presenting a PowerPoint.'",
        "'speaker_0': 'And so I want to ask Mike, would you please proceed with the report, understanding that we have given a little bit of short term, short change this discussion a little bit, so maybe we can just do a high flyover and come back to it at a future meeting.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'I'll do this very high level again. You've noted, Madam Chair, that that that the council did approve a $2 Million increment for a pilot project for demand management in the 2017 2018 budget. And the context, of course, is, is that the the region is working to complete its upgrade of the transfer network because of a decline in'",
        "'speaker_3': 'tonnage that occurred over the course of the Great Recession 2720 ten. There were questions raised as to whether the full buildout was was needed. And what you indicated in the years 2013 to 2015, you you called for a review of that buildout process and the results came back, said in certain some two things.'",
        "'speaker_3': 'First up, that you need not build the full transport network. And in particular, the northeast sector could be served through a demand management strategy. And I'll talk in just a minute about what that what that constitutes. But secondly, that if you were going to do a demand management strategy, you needed to test that on the ground.'",
        "'speaker_3': 'You needed to have a pilot project to, in essence, test whether it would work in real time. Demand management is basically a tool to push transfer demand up from those hours of the day. And those are locations that have limited capacity or no capacity to those locations and hours of the day when there is greater capacity.'",
        "'speaker_3': 'So the executive proposed in the 2017 2018 budget a $2 million pilot project for demand management. The council approved that that funding, but also added a proviso. And that proviso said, in sum, we there are some remaining questions.'",
        "'speaker_3': 'One has to do with the Houlton transfer station. Does that station remain open or is it closed during this demand management process? And secondly, does recognizing that that there's a compromise, a planning process that's going on and that is expected to be concluded prior to the end of this demand management process, how do you incorporate the results'",
        "'speaker_3': 'of that process into that comp plan? That was the sum of the of the proviso you did provide for withholding $1 million until a report was provided back to the council addressing those those questions. That's the substance of this morning's presentation that that has been transmitted to counsel.'",
        "'speaker_3': 'And I should again note that there is a motion in your packets that would approve or acknowledge receipt of of that response. With me this morning is Megan Moorhead. She will she's the strategy communications and performance manager for file with the business you present the the proviso response.'",
        "'speaker_3': 'And also Pat McLaughlin, who's the director of the division, is here as well. Madam Chair.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Good morning. Thank you. Welcome. And please go ahead.'",
        "'speaker_1': 'Loved it. Here talking solid waste with you. And let's go pretty quickly through this presentation. You've already heard about the budget proviso and its history. So we were asked to submit a implementation plan that says what we're going to do as part of this pilot.'",
        "'speaker_1': 'So why don't I just get into the recommendations for that? Demand management basically asks whether we can serve users of our regional system without a transfer station in the northeast area. Now, where's the northeast? Well, it's that kind of green upper right hand side of our service area.'",
        "'speaker_1': 'You can see the Houlton station. And Kirkland is the one station that's currently serving that area. We're recommending a 12 month pilot program starting in mid 2018. That's a little bit later than what you had heard when you approved this pilot during budget, because we found through our interaction with our stakeholders and partner cities that we needed'",
        "'speaker_1': 'more time to set up for a successful pilot and work out host city concerns. So what's going to happen? We're recommending that we suspend services at Houlton to best simulate the absence of a northeast station. That means about 135,000 transactions during our yearlong pilot will be redirected to what we think will be the Victoria Station and also'",
        "'speaker_1': 'to shoreline, about 90% to Victoria in the Eastgate neighborhood of of Bellevue and then the rest to Shoreline. Let's go back. We're recommending that we retain the self service recycling that's there on the the OTN site as a convenience for northeast area customers.'",
        "'speaker_1': 'So what does that mean? That means we're going to more than double the tons that are going into the Victoria Station and more than double the transactions. That's the number of people kind of coming across the scales. How are we going to accommodate all those extra people at the station?'",
        "'speaker_1': 'At Victoria, we're going to do that by extending the hours on weekdays, taking it from 4 p.m., closer to 10 p.m. and on weekends, extending a little bit in the morning and taking the evening closer to 8 p.m..'",
        "'speaker_1': 'We're also trying to get people to use the station outside of the peak hours of use, and those peak hours of use are from 11 to 3 p.m.. And so the study that was conducted said we needed to double the price during peak hours to get people to choose to visit at different hours.'",
        "'speaker_1': 'And so a doubling of the minimum fee for self-help customers would occur during the peak periods at Victoria. They would pay the same if they used hours outside of the the peak periods. We're going to as part of the budget, you approved temporary staff to accommodate these changes in hours and the increased use at Shoreline.'",
        "'speaker_1': 'Our first strategy, though, would be to use the regular full time staff that would be taken from the suspension of service in it at Houlton and redirect them first to this pilot project and then use temporary staff to fill in the gaps.'",
        "'speaker_1': 'So part of this is measuring beforehand and then during the pilot what some of the effects are. And our regional partners have had a lot of questions about what's this going to mean in terms of the amount of time it's going to take for customers to go through our stations.'",
        "'speaker_1': 'Will there be queuing out of the stations, sites and onto local streets? Will there be noise? Can we actually put the amount of waste that we think we're going to see through our stations without having it pile up?'",
        "'speaker_1': 'What's going to happen to local intersections as well as regional highway and and road systems? The Proviso asked us to look at other options that were not recommended. Those included increasing rates at home and curtailing hours at home and or changing the mix of services at home.'",
        "'speaker_1': 'We felt that leaving open open except in a minimal way for recycling, would not replicate the absence of a North-East station and so would undermine the credibility of the pilot. So what's going to happen? Right now, we're talking with the host cities about what permit issues need to be resolved and the associated environmental review with that for'",
        "'speaker_1': 'us to actually proceed with the pilot. We'll need your authorization of the suspension of hope services as well as the peak prices at Victoria, and that would be coming at the end of this year. The haulers would need to plan new routes because now all the collection, curbside collection that's currently going to Houlton would now be going'",
        "'speaker_1': 'to either Victoria or Shoreline. The haulers would need to plan that route and if they needed to recover some of the costs of those new routes, either through their city contracts or by going to the Washington Utilities and Transportation Commission, they would need it next year to open up those contract discussions or go down to the state'",
        "'speaker_1': 'and talk to them about rates. Clearly, this is going to have a big impact on customers and we need to do a very solid communication plan and rollout of that plan as we move into the implementation of the pilot and during its implementation.'",
        "'speaker_1': 'So we plan on doing that next year and then through the end of the pilot. And currently this isn't a precise date, but mid 2018 start date is our estimated beginning of the pilot. So the final you. You were so interested in this pilot that there were two provisos related to it, the one with the implementation plan'",
        "'speaker_1': 'requirement we're talking about today. But there's a second proviso that requests a status report after a seven months of pilot project implementation. And so we expect to be coming back and talking to you again about the lessons learned and recommendations around around how to proceed with the pilot.'",
        "'speaker_1': 'And so that's the pilot project. There was a question in the proviso about how could we proceed with a pilot project on this schedule? Well, we're still trying to update our comprehensive, solid waste plan according to a schedule that would have the solid waste comprehensive plan going out to the public in October of this year.'",
        "'speaker_1': 'So here we've got a 2017 public review draft comp plan, but we won't have results from the demand management plan until mid 2019. So just to remind you, the comprehensive Solid Waste Plan Act is required by state law.'",
        "'speaker_1': 'It sets the long term goals and capital program for the regional system. It goes to action not just by the county, but also by our city partners and identifies cost impacts and funding sources. And it helps implement regional goals such as climate protection.'",
        "'speaker_1': 'And here are just the categories of policies that are adopted as part of the plan. You can see that transfer is one of the categories that we have to address as a regional system. And it does seek to to answer questions about what's the best combination of facilities and practices to serve to serve the transfer needs of'",
        "'speaker_1': 'the system. And that includes either new stations like the Northeast or approaches like demand management. So here's the comprehensive plan adoption timeline. We're working with our two advisory committees, our city oriented and our stakeholder oriented advisory committee to evaluate policy options that would go through September of this year.'",
        "'speaker_1': 'At that point, we would have three months of public review at the end of the year, at the end of the year, and then we go through a very prescribed state process for review and approval. Our state regulators, Washington Public Health and and ecology review the plan.'",
        "'speaker_1': 'After we finish public comment, then it comes back to the Regional Policy Committee and to the County Council and then on to the cities for their endorsement, and then finally back to the state. And they get a period of time where they can do the final approval.'",
        "'speaker_1': 'So there was a question, what kind of policy would could we put in the plan that would allow any outcome of the pilot project to be to be accommodated, either continuing demand management in the long haul or doing a new northeast station.'",
        "'speaker_1': 'So we gave you an example in your implementation plan of a policy that might do that using level of service standards from the Council adopted 2007 transfer plan. Other service standards could be used instead. Basically, the policy might say to to meet the future transfer needs.'",
        "'speaker_1': 'We would want to if we're using the 27 standards, have 90% of self haulers within 30 minutes of a transfer station have cell Paul customers make it through their transfer stations in 16 minutes or less, that sort of thing.'",
        "'speaker_1': 'And then if if the pilot can't reach those service level standards, then it would might give direction on moving forward on a northeast station or an equivalent alternative.'",
        "'speaker_0': 'I'm done. Excellent. That was less than a minute. So thank you for observing the queue. No, I gave her a one minute cue about 30 seconds ago and she she nodded at me and meant it beautifully. So Councilmember Lambert has a question.'",
        "'speaker_2': 'Thank you. Well, first of all, I am very concerned about this. This is where my neighbors take their garbage and I take mine when I need to. So the idea of it being 30 minutes away, I think is too long.'",
        "'speaker_2': 'I think too many more than enough. I am concerned about people. I know everybody's supposed to cover their loads, but not everybody covers their roads well and putting more debris on the freeways, which is also dangerous. That is a concern to me.'",
        "'speaker_2': 'Doubling the price and doubling the distance is also of a concern to me. And then if we decide that the community that knew when they bought their homes that there was a transfer station, there has a whole year of not having this in their neighborhood, then getting it back going again is going to cause conflict.'",
        "'speaker_2': 'And then if we decide that we're not going to put the new station there and the new community that didn't know when they bought their house that was going to be there is going to be up in arms.'",
        "'speaker_2': 'So I think we're doing a lot of things to ultimately come to some problems, and I am very concerned about those. Won't put that on the record.'",
        "'speaker_0': 'Thank you, Councilor, for Councilmember McDermott.'",
        "'speaker_3': 'Thank you, Madam Chair. Page 14 of your slide deck. How is council approval of the peak pricing ordinance in November of this year? And I'm wondering if today's motion in any way sets the stage by means or hands, builds an expectation that we are accepting the pricing numbers that were in your presentation today.'",
        "'speaker_2': 'My understanding is the motion.'",
        "'speaker_0': 'Just acknowledges it's.'",
        "'speaker_1': 'Not on. Sorry. The motion acknowledges receipt of the implementation plan and says that by that receipt the proviso is met. It doesn't say we endorse the content of the plan.'",
        "'speaker_3': 'And so you were not you wouldn't feel that we were locked in any way and argue at a later date that we had to approve or needed to approve the peak protein or the timeline. The routes.'",
        "'speaker_1': 'Will come back in November with the peak pricing ordinance, where you'll have the opportunity to get into the.'",
        "'speaker_3': 'Details. Thank you.'",
        "'speaker_0': 'So I will just add. Oh, we're we've reached the end here. There's no money associated with this proviso as my understanding. Correct?'",
        "'speaker_3': 'Actually, I believe there is a $1 million withholding until the council approves the.'",
        "'speaker_0': 'Just pointing out not noted in the motion language or in any of the staff presentation materials. So in the future, it's really a good idea that the motion should recite. He might have said it. But I you know, there's things going on here.'",
        "'speaker_0': 'It's not written. And I wish in the motions that it should be written. So with that, are we before I ask for emotion, I want to also say on the record that this is a appreciate the report. The information's helpful.'",
        "'speaker_0': 'And in fact, it's going to be necessary for us to engage with future requests for decisions. As as you all are aware, and I think my colleagues are aware, the Salaries Advisory Committee and the Municipal Solid Waste Advisory Committee both have expressed serious reservations about this approach.'",
        "'speaker_0': 'I have the I enjoy having the district where it will be hosted. And and there are strong differences of opinion within my district with regard to whether this is a good thing and a necessary thing or a terrible thing.'",
        "'speaker_0': 'And it should never be never be done. And those those differences of opinion are mirrored by differences of opinion about whether we should or should not build a new north east transfer station. And so it's it's a it's going to be a really challenging discussion.'",
        "'speaker_0': 'And I think everybody's aware of that now. The public is also aware of it. So with that, because we have withheld some money from the agency's budget requiring this report and we have, in fact, received the report, I wonder if somebody would be so kind as to move approval of proposed motion 2017 0160 with the do pass'",
        "'speaker_0': 'recommendation.'",
        "'speaker_3': 'So move, Madam Chair.'",
        "'speaker_0': 'Thank you, Mr. Chair. Is there a.'",
        "'speaker_2': 'Comment? Just clarification. So we're approving the report showed up, but not that we like what it says.'",
        "'speaker_0': 'We are acknowledging receipt. We're not even approving the report. We are acknowledging that we received it. And I, I feel very strongly that we did receive it. So I am going to vote in favor of the motion.'",
        "'speaker_3': 'Okay. Adamant about that? Yeah.'",
        "'speaker_0': 'I'm really, really, really.'",
        "'speaker_3': 'Feels we only need for one quick please.'",
        "'speaker_0': 'Go ahead. Councilmember.'",
        "'speaker_3': 'This envisions by closing voting a scenario where voting for the pilot where voting would be closed kind of permanently to see how that works. I did see in here you referenced there'll be some kind of still sample recycling and some special days, right?'",
        "'speaker_3': 'Maybe have a yard holidays or things. Yeah.'",
        "'speaker_1': 'We continue solid waste use on the site, but only for recycling orientation. Right now there's cell Paul a small self. Paul pull through area that would remain open as a convenience for the local customers.'",
        "'speaker_3': 'I guess if we're modeling scenarios long term, it's always been a question in my mind of whether home could be reduced in terms of its type of operation, say from our full MSW facility to maybe a yard waste and recycling facility.'",
        "'speaker_3': 'And I hope that as you develop final plans for the pilot, that maybe that notion might be able to be tested if there if that makes any sense, and that that's not just one council member with an idea.'",
        "'speaker_3': 'So anyway, I just wanted to put that on the record. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. All right. At this point, I would ask for the clerk to call at home.'",
        "'speaker_1': 'Thank you, Madam Chair. Councilmember DEMBOSKY. Councilmember Dunn, Councilmember Gossett I. Councilmember Cole. Well, I. Councilmember Lambert. Councilmember Mr. Stein. Councilmember up the Grove.'",
        "'speaker_2': 'Councilmember gone right now. Madam Chair. I thank you.'",
        "'speaker_1': 'Madam Chair. The vote is ayes, no nos and council. Dunn Excused.'",
        "'speaker_0': 'All right, with that, the motion carries and we will take it up. Council. I don't see any reason to expedite, but it can go on consent. And with that, we are completed with our agenda and we are adjourned.'"
    ]
}