{
    "Fireworks Regulations Ordinance.": [
        "'speaker_0': 'Great. Thank you very much. Thank you. And colleagues. That takes us to item six on our agenda. This is proposed ordinance 2020 157, which would ban the sale and discharge of fireworks in unincorporated King County. We will receive a letter from council staff and we received a full briefing at our February 17th meeting and will receive a'",
        "'speaker_0': 'briefing from Jake Tracy. Just a brief update in a moment, but is the sponsor I wanted to offer some initial comments and then introduce Mr. Tracy in July of 2019. Mr. Roland, Sonny Kennedy, a 70 year old veteran, and his two dogs were killed in a house house fire in White Center.'",
        "'speaker_0': 'It was caused by fireworks. In addition to the tragic loss of life, two homes were destroyed and 12 residents were displaced. While there are plenty of reasons to support an Army full ban on consumer fireworks in unincorporated King County, I'm motivated to do so because of my center's loss.'",
        "'speaker_0': 'We never want this to happen again in any community. The injuries, death and destruction caused by fireworks year after year are preventable. The overwhelming majority of jurisdictions within King County cities, park districts in the national forest understand this and have already banned fireworks.'",
        "'speaker_0': 'It's time for King County to do the same. Residents in unincorporated King County deserve to have the same protections that the majority of their counterparts in incorporated areas already enjoy. We've heard from residents and from first responders across unincorporated King County, overwhelmingly expressing support for banning fireworks.'",
        "'speaker_0': 'They've told us again and again that they're fed up and they want our help. And the King County Fire Commissioners Association has been clear. It expressed their support for a full ban on fireworks. And I know that representatives of the fireworks industry have voiced their opposition and concerns and are trying to tell us that a full ban'",
        "'speaker_0': 'won't work. I'm not surprised they benefit from financially from the sale of these products that don't have to deal with the fallout from fireworks have on our residents and first responders. It makes sense that they try to confuse the issue but urge you to see through those tactics.'",
        "'speaker_0': 'I look forward to our discussion and our work today. Mr. Tracy. Thank you, Mr. Chair. Jake Treacy, council staff. The materials for this item begin on page ten of your packet. Since I gave a D. Can you hear me okay?'",
        "'speaker_0': 'You can. And, Mr. Tracy, if I can also interject, in addition to the package, we have a council amendment package that was emailed out this morning. I would call the members attention to it was sent by Ms.. Stedman at 807 this morning.'",
        "'speaker_0': 'So if members haven't already, I'm hoping that in front of them I would call their attention to that. I'm sorry, Mr. Tracy. No worries. Thank you, Mr. Chair. So, since I gave a detailed briefing last time, I'll keep this short.'",
        "'speaker_0': 'Proposed ordinance 2020 10057 would prohibit the retail sale and discharge of consumer fireworks, as defined in our CW Rule 70, 77 and unincorporated portions of King County. These consumer fireworks are shown in the handout on page 49 of your packet.'",
        "'speaker_0': 'The legislation would raise the fine for fireworks violations from $250 per violation to $1,000 per violation. It would also move standards for public displays of fireworks in unincorporated King County to a new chapter, align definitions in state law, and limit public displays of fireworks to two per property per year with permits from the fire marshal.'",
        "'speaker_0': 'As I mentioned last time, council members previously provided amendment concepts for super review and public notice. The concepts are listed on page 13 of your packet. If this legislation were to move out of committee today, I would need to be informed of any additional amendment concepts by close of business this Friday, March 19th, so they could be'",
        "'speaker_0': 'included in that council hearing notice. I would like to note an error in the staff report. My apologies. The correct date for the deadline of concepts is this Friday, March 19. There are also two amendments for discussion today, but I will pause there for any questions first.'",
        "'speaker_0': 'We also have Jim Chan and Chris Ricketts from permitting here. Questions for Mr. Tracy. Seeing none. Mr. Tracy. Okay. Amendment one starts on page three of that amendment packet that the Chair just mentioned. Amendment one would allow for the sale, possession and use of fireworks that are defined as ground and hand-held sparkling devices in the Washington administrative'",
        "'speaker_0': 'code. These include. And if you go back to that handout that I mentioned, that is on page 13. Those are on page 49 of your packet. You'll see some of these listed there. So the ones that would still be allowed under Amendment One are the wire, sparkler and dipstick.'",
        "'speaker_0': 'Cylindrical fountain.'",
        "'speaker_1': 'Cone, fountain.'",
        "'speaker_0': 'Illuminating Torch wheel. Round Spinner and flitter. Sparkler and toy smoke device. Other consumer fireworks, including aerial devices and multiple tube devices, would be banned for sale and use. The amendment would retain regulations that are proposed to be removed as part of the ordinance that pertain to fireworks stands and would also retain existing code language and limits on'",
        "'speaker_0': 'the dates and times during which fireworks can be sold. So to summarize, this amendment would retain existing quota balance for the sale and use of ground and hand-held sparkling devices, but would ban aerial devices and multiple tube devices.'",
        "'speaker_0': 'If the amendment is adopted, there's a title amendment to one that would go along with it. Would you like me to bring Amendment two or pause there? Let's pause there. We don't have anything. We have no motions before us at this time.'",
        "'speaker_0': 'Are there technical questions on Amendment One that Mr. Tracey has just briefed? See none. Mr. TRACY If you give the a the same level of briefing to Amendment two and then we'll take up the legislation. Sure. So Amendment two would make changes with references to penalties and enforcement.'",
        "'speaker_0': 'It would retain the existing $250 fine for fireworks violations, which is proposed to increase to $1,000 under the underlying proposed ordinance. It would also delay issuance of penalties for violations of the ordinance pertaining to use or discharge of consumer fireworks for one year after the ordinance was effective during that one year period.'",
        "'speaker_0': 'Warnings and education would be given to violators rather than monetary or criminal penalties. Finally, the amendment would request that the executive conduct the study on and make a recommendation for a way to provide an immediate, unarmed non-police response to fireworks violations during the 4th of July season.'",
        "'speaker_0': 'That study and recommendation will be due by June 30th of 2022. Thank you, Mr. Chair. Thank you. Any technical questions on Amendment two? Councilmember Lambert.'",
        "'speaker_1': 'Thank you. We had this discussion years ago when we were talking about not having police due enforcement of handicapped parking places. So this is not a new discussion, but who would we get to do the enforcement? And that that would be the question about who would have the authority to do that and under what code would we'",
        "'speaker_1': 'be able to give them that authority?'",
        "'speaker_0': 'Thank you, Councilmember. So the objective of this amendment, as it is written, would be to have the executive do that study and come back with a recommendation and possibly code amendments that would, if necessary, to allow whoever they recommend to do that work.'",
        "'speaker_0': 'So it's not identified in this amendment. It's just requesting that the executive study that and come back with a recommendation.'",
        "'speaker_1': 'Well, they might want to look at the body of work that was done before because it came back with some very interesting results. Thank you.'",
        "'speaker_0': 'Any other technical questions of amendment to. See none are without a recall on Councilmember Bell duty to for the purposes of making a motion.'",
        "'speaker_1': 'Thank you, Mr. Chair. I move. Adoption of Ordinance 2020 10057 with a do pass recommendation.'",
        "'speaker_0': 'Thank you. Councilmember Bellevue, she's moved adoption of ordinance 2020 157 amendments. Councilmember Yvonne Roukema. I believe Amendment one would be in order. But, Mr. Chair, I'm sure I'm sure this Councilwoman Boesky, a lot of questions asked that wasn't of a technical nature.'",
        "'speaker_0': 'Okay. I understood the opening to be of technical and leave. So it would now be an appropriate time, is it? What I was doing was what I was trying to do is encourage the actual debate and discussion about amendments when they were before us.'",
        "'speaker_0': 'If if you but you're welcome to ask your question now, I would expect both amendments to be offered and fully debated and discussed. Again this is in the regarding the underlying legislation and in the staff report. Just I'll just ask it to my head.'",
        "'speaker_0': 'Mr.. Thank you. And you've been very good about this idea, and I think it's been a trend that we're trying to do here, and that is to include equity in social justice analysis in terms of impacts of legislation in our staff work.'",
        "'speaker_0': 'The legislation here would impose a new criminal penalty. And I'm just I didn't see in the staff report any analysis of the impacts of that from a from a racial and social justice perspective. And I'm wondering if it's there or not.'",
        "'speaker_0': 'There was no ESG analysis done on this legislation. Thank you, Mr. Chairman, for the debate. Thank you. Councilmember Councilmember by Rick. I thank you, Mr. Chair. I move adoption of amendment number one. Amendment one is before us. Council number one right there.'",
        "'speaker_0': 'And thank you, Mr. Chair. First of all, I want to thank you personally and professionally for your work with this issue. I think it's an indication of how sensitive you are to your district and how you responded to the bystander tragedy.'",
        "'speaker_0': 'There's not one of us on this floor or on this podium, which does not feel that what happened there was a tragedy and we never want to see it repeated again. And I thank you for responding so quickly to the center issue time and time again during our discussion this morning.'",
        "'speaker_0': 'Many of the speakers talked about their Community of Rights Center, and they clearly have a great deal of pride. Today, we're not just dealing with White Center, however, we're dealing with Kane County as a county. Ever since this proposal was introduced last year before COVID 19 struck.'",
        "'speaker_0': 'I've been working with concerned parties on both sides of this issue, including constituents, nonprofits, first responders and the fireworks industry. In fact, I was on the phone late last night with a local fire chief as well, who is very much supporting what you're trying to do.'",
        "'speaker_0': 'I feel that this amendment strikes an appropriate compromise that is workable for all parties. As you know, Mr. Chairman, my district has both unincorporated urban and rural areas. I have Auburn and Better Way who have two different directions dealing with fireworks.'",
        "'speaker_0': 'We frankly frequently hear from constituents who complained about fireworks around the 4th of July, as well as during Seahawk games. Let's hope this season is also going to be an opportunity for fireworks on the field. The complaints are almost always directed out loud.'",
        "'speaker_0': 'Aerial fireworks often shut off during the time of year where they are or are not permitted. My amendment would allow for the continued sale and use of only ground based fireworks. Boughton wheels ground spinners in unincorporated Kane County during the current permitted period for sales and use.'",
        "'speaker_0': 'Which sale is June 28? The July 4th use is July 4th. My amendment does not include aerial fireworks such as roman candles, mortar shells or parachute, resulting in those aerial fireworks being banned in unincorporated Kane County. The amendment as drafted is modeled after the city of Auburn in my district.'",
        "'speaker_0': 'After consultation with Mayor Bacchus and others. This proposal currently allows for ground based fireworks during specific times of the year. In addition to the city of Auburn. Leigh Ann Geer in the City of Civic also and my district commit ground based sale during conversations with the community and colleagues alike.'",
        "'speaker_0': 'I've heard a variety of concerns and I feel the same with the concerns raised. But enforceability is important. While still there, there will be enforcement challenges. This proposal clearly distinguishes between what is allowed, ground based and what is not allowed.'",
        "'speaker_0': 'Aerial. Response to community organizations and nonprofits. And if ever there was a time we've needed the help of the nonprofits to provide a safety net for so many good causes in our community, it's been during COVID 19. They rely on fireworks sales to raise money for their organizations by allowing for the continued sale of ground based fireworks'",
        "'speaker_0': 'during that period of time frame. Mr. Chair, again, I want to say to you, you've done yeoman's work in trying to bring this issue to the forefront. I believe this is a positive step forward. We want to do good, not just feel good.'",
        "'speaker_0': 'We want to do good, not just feel good. And I believe this amendment does good. Thank you. Council member of Great Power. I appreciate the work you've done in crafting this, in talking to so many people throughout the community and bringing it to us for discussion today.'",
        "'speaker_0': 'However, I do need to oppose it now. Ask my colleagues to join me in not supporting it. It essentially allows the continued sale and discharge of what the industry might term in some conversations. Safe and sane fireworks. What I might refer to is so-called safe and sound fireworks.'",
        "'speaker_0': 'Many feel that these products might be safe, but there's certainly evidence to the contrary. Smoke bombs with which would be allowed under this amendment, supported the 2017 Eagle Creek Forest Fire in Oregon. It burned nearly 50,000 acres and cost an estimated $40 million.'",
        "'speaker_0': 'The fire destroyed several structures, including homes where residents lost everything. Hikers had to be rescued in the fire, which happened during the peak of the tourism season, negatively impacting businesses in the area in 2000. Just last year on the El Dorado Fire in California was started by a smoke bomb used to the gender reveal party.'",
        "'speaker_0': 'This fire resulted in 23,000 acres burned, multiple homes destroyed and the death of a veteran firefighter. And even some of the products that we think of or people want to believe is the most safe. Sparklers. According to the U.S. Consumer Product Safety Commission, sparklers are typically heralded as safe and sane.'",
        "'speaker_0': 'They make up 12% of firework related injuries. They burn at a temperature of up to 2000 degrees Fahrenheit, which is hot enough to melt some metals and ignite clothing and cause third degree burns in a matter of seconds.'",
        "'speaker_0': 'And a partial ban continues to compromise the safety of our first responders and our residents. I believe it's really essential that we listen to fire commissioners, first responders, medical professionals who deal with this every day. And in fact, we received a letter last month from the South King Fire and Rescue that covers much of unincorporated and urban'",
        "'speaker_0': 'areas in South King County. They say this city they cover said away in Des Moines, among other cities. And in the letter, they say these cities, like many others in King County, have banned the retail sales and use of fireworks.'",
        "'speaker_0': 'The lack of a uniform regional approach to this problem causes confusion in our population and reduces the compliance in areas that are actually banned. So I would ask members to join me in not supporting this amendment. Further discussion.'",
        "'speaker_0': 'Other councilmember closed debate coalition base, please. Yes, unless you want to finish your for me. Thank you, Mr. Chair. And thank you again and again. You've done it. Really. And I hope people in the White Center area understand that, because I was speaking from the heart.'",
        "'speaker_0': 'We both are strong advocates for our communities. We've been in politics because we know that that's our job, is to be an advocate for our community. And you have truly done that on this issue. But time and time again, I heard the folks from White Center talk about their community.'",
        "'speaker_0': 'And I am very sensitive to their committee and I make sure that the commissioner is home on July 4th. That said. This is a county wide proposal, and it works collaboratively with the industry to find a workable solution that does not result in a county government legislating small businesses out of existence.'",
        "'speaker_0': 'Most importantly to me was the addition that one of our colleagues pointed out. It's about the opportunity to educate the public and a full commitment from the industry to partner with King County, to sponsor a safety and education program to better inform the community on the difference between aerial fireworks and the proposed safe and shame ground based'",
        "'speaker_0': 'fireworks and deregulated novelties in closer fields of proposal as a workable solution. It's enforceable because it deals with ground based as opposed to aerial, and it improves community safety but does not result in undue hardship. Itinerary. Nonprofits or small businesses in unincorporated King County.'",
        "'speaker_0': 'Thank you. All those in favor of Amendment One, please signify by saying hi. All right, I. Those opposed nay now in the opinion of the cheering the needs of it provision.'",
        "'speaker_1': 'The provision.'",
        "'speaker_0': 'Madam Quirk, if I. If I could have the clerk, please call the roll on Amendment One.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember WG now. Councilmember Dombrowski, i. Councilmember Dunn.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Coles now. Councilmember Lambert, I. Council member of the ground now. Councilmember Brown right there. I council members online.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Mr. Chair, the vote is for EIS Council members Dombrowski, Dunn, Lambert and Bond mate Bauer and five no council members. She called Wells up the ground for her line. And McDermott.'",
        "'speaker_0': 'Thank you. The amendment fails an amendment to. Council members are alone. All right, that's for me. Thanks, Mr. Chair. I've grappled with this issue a lot ever since we first heard it last year. I've always said repeatedly that the public health aspects of this are super valid and that everything that Councilmember McDermott has been saying has been'",
        "'speaker_0': 'true in my district as well. I hear from countless residents about the pollution, the noise, the impact on pets and veterans. But the other side of this has been the concern, essentially that Councilmember Dombroski brought up, which is the ESG concern, and specifically the increase in law enforcement contacts between law enforcement and communities of color, the high'",
        "'speaker_0': 'fines and fees on a low income community, the interferences with cultural practices, and the revenues that are that our nonprofits and churches would take. My amendment would fix all of these things entirely, but it would be a step in the right direction.'",
        "'speaker_0': 'First of all, it reduces the fee from $1000 to $250 to just make sure that we're not having insurmountable fees for potentially low income people in that area. And also, it requests that the executive create a plan for using non-police, unarmed enforcement.'",
        "'speaker_0': 'And we don't know exactly what that looks like yet. It could be code enforcement officers. It could be something else within the sheriff's department that's unarmed and civilian owned. But I think we have to be really careful, especially in light of the environments we've seen in the past year or more about creating more contacts between police and'",
        "'speaker_0': 'communities of color, especially for something that may not require an armed response. And this, of course, would only apply to the things that we as King County are making illegal. If there are state level things that are illegal, like firecrackers in the eighties, the things that make cars shake, we don't have a say in who enforces that'",
        "'speaker_0': '. So the law enforcement sheriff's department would still be able to enforce that. The other aspect of this is the fact that it would delay enforcement by a year. So in the year where this would otherwise take effect, instead of finding people or giving them criminal penalties, we would request that our sheriff's office do an educational campaign instead'",
        "'speaker_0': '. So instead of imposing penalties, go around with informational information, informational packets, and telling people about this new regulation and the impact of fireworks. I think it's a compromise legislation. I don't think it addresses all of the ESG impacts fully, but I do think it's a step in the right direction.'",
        "'speaker_0': 'And I ask my colleagues to support it. Councilman Rizal. My staff is suggesting that you should formally move adoption of the amendment. Don't move. Mr. Chairman. Sticklers on things like that. Thank you. Council members. Hello. The concerns that you voice and the voice you bring of your constituents is true for people across the county.'",
        "'speaker_0': 'And your amendment does it, I think, does an excellent job in addressing the concerns both of of fireworks in that that we've heard from constituents, but also of fair enforcement and equitable enforcement in grappling with how to do that better than we've done it in the past.'",
        "'speaker_0': 'I appreciate your amendment very much and look forward to joining you in supporting supporting it today. Their Council member, Lambert.'",
        "'speaker_1': 'I will be supporting this amendment. I do believe $1,000 is a very high fine, and I do like the idea of making sure that people have some time to get used to it. 4th of July Fireworks. This is a tradition that people have enjoyed for many, many years, and it will be difficult for everybody to know that'",
        "'speaker_1': 'there's been a change. So I like the but for a year I am concerned though and so I'm okay with it being a study, but it needs to in that study, look at what would be the issues that come up when you are taking something away from somebody.'",
        "'speaker_1': 'And I know that there are people that spend thousands of thousands of dollars on fireworks. And when you tell them you can't do that and you take it away, it has to be somebody that has some authority that is respected.'",
        "'speaker_1': 'So I'll be interested in seeing who that group is. And also in light of the experience we've had before when we tried to do something similar. So I agree this doesn't solve everything. I wish the First Amendment had passed, but I will be supporting this.'",
        "'speaker_0': 'In discussion. Council Member Col Wells.'",
        "'speaker_1': 'Thank you, Mr. Chair. I answer in supporting this amendment. I think it's a smart one that applies the sensible equity lens to enforcement energy commission around the new regulations. But I think even more so. I think it's clickable to people across the unincorporated King County.'",
        "'speaker_1': 'I have had some real concerns about enforcement, and I believe that the way that Councilmember Sol Hawaii has presented the intent of his amendment really satisfies me that we will be able to reach a good solution for this kind of vexing issue on enforcement.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you for the discussion. And Dombroski Councilmember Dombroski. Thank you, Mr. Chair. The increase in interaction between law enforcement and young people who I think are the primary users, I would say, of these fireworks, has been a grave concern of mine with respect to this legislation and the additional criminalization of of contact and increasing young folks connection'",
        "'speaker_0': 'to our criminal legal system. And the adverse consequences that to often follow has been a real concern of mine. And so I think this amendment, which, as I understand it, would decriminalize the offense of violating the ban in terms of discharge, convert it to.'",
        "'speaker_0': 'And I'd like to be correct ma'am wrong is just a civil infraction fine of $250 plus the additional study for non-police response is helpful because my customer one right. Bauer's amendment also did to that and in a little bit of a different way.'",
        "'speaker_0': 'I still think that the response of when folks will call 911, assuming the spangles into effect and the police will come unless we come up with another system from the study. And I think that concerns me in terms of what follows from that, in terms of increased interaction and with our young people.'",
        "'speaker_0': 'So I'm definitely happy to support this amendment. I think it goes a long way, if not all the way in addressing some of those concerns. Thank you, Mr. Chair. Mr. Chair. Councilmember Dombrowski requested that the this amendment would keep the status quo, which is a $250 fine and or a misdemeanor.'",
        "'speaker_0': 'Oh, I see. So it would still be a misdemeanor? It could potentially be charged as a misdemeanor, yes. Okay. That is what is in the existing law today. And that's what would continue with this, with the exception of that one year period in which there would be no fines or criminal penalties.'",
        "'speaker_0': 'All right. Well, I'm going to support the amendment, but I think that continues to be a serious concern of mine. On adopting the ban Is the criminalization of this conduct primarily engaged in by young folks during a limited time of the year?'",
        "'speaker_0': 'Thank you, Mr. Chair. Thank you for the discussion. Council members are allowed to close. I urge your support. Thank you. All those in favor of Amendment Two, please signify by saying hi. I call on those opposed nay. The ayes have it.'",
        "'speaker_0': 'Amendment two is adopted. Discussion on ordinance 2020 157 as amended. Councilmember Banducci.'",
        "'speaker_1': 'Thank you, Mr. Chair. And I, as you know, join Don as a co-sponsor of this measure early on. And this is I know that this is challenging for some, but for me, this is almost a no brainer. Prior to serving on the King County Council, I served as a city councilmember and one of those cities that has'",
        "'speaker_1': 'had a ban for a number of years. In my district, almost all of the cities have bans, and about the only place where there isn't one is the unincorporated Sammamish Valley. And so and there's a reason for the bans.'",
        "'speaker_1': 'We've heard about it a lot. It's and it's about public safety. The statistics have been quoted by our fire commissioners, by you, Mr. Chair, by others. And the anecdotes are tragic and happen every year somewhere. They happen to use or using fireworks.'",
        "'speaker_1': 'Property damage happens every single year. There are dozens of fires in Washington. Thousands of injuries started. And there's an argument to be made that this kind of restriction is even more important in unincorporated King County, which tends to be more forested.'",
        "'speaker_1': 'And this activity happens during a dry time of year when outdoor fires can be very easily sparked. The psychological impacts, quality of life impacts, and just the list goes on and on. And there's a reason why many, many cities in King County and elsewhere have have enacted these bans, except they do not ban public displays.'",
        "'speaker_1': 'They allow for permitted displays, but not the kind of unregulated use that leads to the damages that we've seen and heard about year after year. I've heard the arguments and I've listened carefully. I've read all the emails, all the letters.'",
        "'speaker_1': 'I've listened to everyone who's come to public comment. This has been pending for quite a long time, so we've had very ample time to think through the ramifications. And I will say, the idea that people can still buy fireworks somewhere else is not really the point.'",
        "'speaker_1': 'The point is that we need to try to make sure people don't use fireworks in a way that is dangerous and damaging to themselves and the community. The idea that prohibition doesn't make a difference is just simply not true.'",
        "'speaker_1': 'It's just not true in our experience in cities where there have been bans. The amount of fireworks don't go away. And crime doesn't go away because we have laws, but it goes way down. And I especially like that we're thinking more thoughtfully these days.'",
        "'speaker_1': 'And one of the things I like about this legislation that differs from the one in the city where I used to serve is that we're being more thoughtful about how to address making sure we get the benefits of the law, how to educate people, how to do emphasis and engage with the community to to achieve compliance and'",
        "'speaker_1': 'the benefits of compliance without necessarily making a criminal case out of it. And I really appreciate that that part of the amendment that we just passed and the idea that there's not enough enforcement has been raised. If you do rely on sheriff's deputies or place to enforce and, you know, it's such a targeted activity that happens in'",
        "'speaker_1': 'certain places at certain times, I think it would be very easy to do emphasis regardless of whether you have a whole police force at your disposal or not, if that's the way people choose to go. After we receive back the study that we've now included asking the executive to do to think through other ways of compliance, I've'",
        "'speaker_1': 'heard people talk about jobs and the loss of jobs, and that's real. And I hear that, and that is compelling to me. But at some point you have to take a balance when you have to look at the balance between jobs and the safety of the community at large and say that the safety predominates.'",
        "'speaker_1': 'And in this case, I believe that it does. And then finally and this this really this really was meaningful to me, hearing about nonprofits and the challenges. I mean, we know nonprofits are suffering. Councilmember Yvonne, right. Our speak Ellen spoke eloquently about that.'",
        "'speaker_1': 'I agree with him completely on this point. We now have a fair amount of time between when this would take effect and today to allow for some some real lead time, too, for nonprofits to look for other ways to raise money.'",
        "'speaker_1': 'And we should take that seriously and we should be engaged in our districts if there are organizations that are truly going to suffer to try to do what we can as leaders in our communities, to try to help them.'",
        "'speaker_1': 'But it's not going to happen this 4th of July. So there is quite a bit of time for folks to adopt adapt. Yeah. And for all those reasons, I've been a strong supporter of this legislation from the beginning.'",
        "'speaker_1': 'I remain so and I'm proud to cosponsor and I will be voting yes. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you for the discussion. Dombrowski. Thanks. I didn't want to jump in. This is a closer call for for me on this chair. I've heard and listened carefully to the debate and looked into it pretty deeply as well.'",
        "'speaker_0': 'And the concerns raised by residents like Ms.. Dobkin and others from White Center and North Highline are resonate with me. And the risk is certainly there and there are injuries and and things like that. And so when we have a public policy problem like that, I wonder what is the answer here?'",
        "'speaker_0': 'A proposal is to to ban them. And I agree with Guzman about to achieve that. A ban on say on discharge will likely reduce their use. But I don't think it eliminates that. I mean, I live in a city where they are banned and they go off, you know, all the time.'",
        "'speaker_0': 'I supported Councilmember One right by his amendment because I thought it was aimed at the most egregious of these. You know, the the new fireworks, I call them new. They're relatively new. We didn't have when I was a kid.'",
        "'speaker_0': 'The aerial murders, I think, are what really people are bothered by the PTSD in our veterans, if you will, the harm to pets and the jarring nature of those. That's a relatively modern advent in fireworks compared to when I was a kid using them in the cul de sac in unincorporated King County.'",
        "'speaker_0': 'We didn't have those, you know, we had the little cones, sparklers and things like that. Or if we went down to the reservation, you'd get a bottle rocket, which were which were illegal, of course. So I like councilman one requires precise amendment there to say, let's get rid of the real nasty, dangerous ones and but keep the'",
        "'speaker_0': 'the on the ground ones I don't think because of just observation around for July were as you say a majority of the cities I think in our county but not all have banned them. That that it eliminates that.'",
        "'speaker_0': 'So I'm not sure it's it's a totally effective solution it might help at the margins but got to weigh that against the other impacts and whether it be it was increasing fines and sanctions from our roads division which I opposed to, you know, Councilmember Dutton's zoombombing legislation where we took out the criminal penalties.'",
        "'speaker_0': 'This is an activity where young people primarily do it because we grow out of it. So we get older and the response is going to be 911 calls with police showing up and a new criminal penalty. And I at the end of the day, I think I'm in just a very different place on that.'",
        "'speaker_0': 'And I think that the harm that results from that increased interaction is is something I'm very concerned about. Councilmember Xilai's amendment really helped got us going in the right direction. But I think that maybe this should be decriminalized entirely and maybe I can get to a yes or council if we can continue to work in that direction'",
        "'speaker_0': '. I do think also that this, you know, with respect to bands not working, the Eagle Creek Fire, which has been mentioned a couple of times now started by smoke bombs, was started in September. In Oregon when a ban was in place.'",
        "'speaker_0': 'So, you know, as to that's an example of the efficacy of bands, you know, not solving the problem. I looked at, you know, Snohomish County, where they have a live band and then an urban part where there's denser housing and more concentration.'",
        "'speaker_0': 'I think that that could be something here that might help. In my district in Bothell, it was put to the voters a few years ago. They voted to keep them. They did not vote to ban them. Other jurisdictions have it's kind of a split question.'",
        "'speaker_0': 'So primarily, Mr. Chair, because of the concerns about the efficacy, my concerns that folks, when you can't go by a safe and sane firework and under councilwoman right bars amendment, which would have been limited to ground stuff locally, you will go folks that want them will go to our tribal communities and then they will have the full'",
        "'speaker_0': 'panoply, the aerial rockets and mortars, the stuff we really that are problematic. I think that and really with the criminal penalty, that's that's a deal killer for me on this legislation despite my concerns and sympathy for what is bringing forward the legislation and the motivation for it.'",
        "'speaker_0': 'I understand what you're trying to do. So for today, I'm going to be a no. But maybe if we could decriminalize this, this new conduct that we're outlawing for council, I could be a yes thanks to I'm trying to share my perspective.'",
        "'speaker_1': 'Lambert.'",
        "'speaker_0': 'Thank you, Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I agree with everything the previous speaker said, and I am very concerned about the criminalization. I am concerned about a lot of things here. You know, we just had a horrendous fire in my district, which took out an apartment building, displaced many families.'",
        "'speaker_1': 'And it was because of cigarets. We not too long ago had another tremendous fire that was horrible. That was started because of a candle. So we're not banned. Can't banning candles and cigarets. And it's kind of a personal responsibility to educate yourself and your family members about how to do things in a safe and sane way.'",
        "'speaker_1': 'I appreciated the work that was done by council member by night. Also, prohibitions haven't worked in the past and I don't think it's going to work here. It's a tradition and I'm sorry to see so many American traditions being wiped out.'",
        "'speaker_1': 'So I would like to see us do two things before a final vote at council. One is to decriminalize. And secondly, it is to potentially limit the number of days when you can shoot off the fireworks. I think if it were limited to just the 4th of July and just New Year's Eve, that that would make their'",
        "'speaker_1': 'animals or dogs or horses our safety. And I think that that would really help a lot in reducing the number of days. I'm not that you can sell even some of those days, but the discharge being limited. So I think there's work to be done between now and Tulsa, and I hope that we can consider those ideas'",
        "'speaker_1': '. Thank you.'",
        "'speaker_0': 'Further discussion. I too close. I want to thank my colleagues for their thoughtful work over the more than a year since I first introduced legislation to accomplish this goal. And our work in discussion today. We're here because Mr. Kennedy shouldn't have died.'",
        "'speaker_0': 'His death was a tragic accident and heartbreakingly preventable. After after learning about what happened in North High Line, I was determined to introduce this ordinance banning the sale and discharge of consumer fireworks in unincorporated King County. Fireworks are dangerous.'",
        "'speaker_0': 'That's why 25 jurisdictions across King County have already banned them. And the King County Fire Commissioners Association and others who serve on the front lines during the 4th of July holiday have been clear. Ban all consumer fireworks. That bright line would help with the public's confusion in enforcement and with enforcement itself.'",
        "'speaker_0': 'And I'm not naive. I don't believe that it will stop every firework. I live in a city with a ban. There are fireworks that are ignited around my. In my neighborhood. Few very few laws, if any, have 100% compliance.'",
        "'speaker_0': 'But the risks posed by consumer fireworks are too great for us not to act. And there is a demonstrated reduction in fireworks use in jurisdictions with bans. We actually heard somebody today offer testimony that they live in a jurisdiction with a ban and they travel to another jurisdiction hours without a ban in order to ignite fireworks.'",
        "'speaker_0': 'Further compounding the issue in unincorporated King County. We have a therefore, we have a responsibility to send a clear message to residents that fireworks are banned because they're not safe. And I want to emphasize the risk to family, neighbors and the environment for a minute.'",
        "'speaker_0': 'I've heard some people claim that it's not fair to be told what they can shoot off fireworks in the run on their own property. But it does affect the entire community. The chemicals in the smoke and fireworks may affect people with asthma and other respiratory issues.'",
        "'speaker_0': 'It affects people with post-traumatic stress disorder, veterans, refugees and others. We've heard from someone who is a mental health counselor in today's testimony speaking to that very point. The need to address. This is real and this is the opportunity for us to step up and to be look provide the same level of protection for our constituents for'",
        "'speaker_0': 'whom we are the local government. But so many others have. Throughout King County previously, I think members for their work on this issue and recognize that we'll have more conversations before we bring it up in full council. Just over a month from now without Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member Banducci. I can't remember Dombrowski.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Remember? Done?'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Well, I. Council member Lambert now council member of the group of. Councilmember Yvonne. Mike there were.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Council members on the line.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Mr. Chair, the vote is five eyes, four noes. Those voting no are council members. Dombrowski, Dunn, Lambert and Von. Right there.'",
        "'speaker_0': 'Thank you. By your vote, we have given a do pass recommendation to ordinance 2020 157 as amended, which will be sent to full council on it. If there is a 30 day notice requirement so on, it will not be even recorded, of course, but after a 30 day notice is given.'",
        "'speaker_0': 'And again, I'll remind colleagues what Mr. Treacy has said, that when we take this up in April as part of the advertising, we need to advertise amendment concepts. So please have those amendment concepts to Mr. Treacy by this Friday, March 19th.'",
        "'speaker_0': 'That takes the status of seven inches. Today's agenda motion 2020 131, which would appoint Janice Case as the deputy director of King County Department of Elections. Ms.. Case is here with us today. But first, Randall Randall Askin from the council staff will provide a brief staff report.'",
        "'speaker_0': 'The one is yours.'",
        "'speaker_1': 'Thank you, Mr. Chair, and good morning, Council members. For the record, Randalstown and the council staff and the materials for this item begin on page 51 of your meeting packet. As noted by the Chair, a proposed motion 2020 10031 would confirm the appointment of Janice Case as the deputy director of the King County Department of Elections.'",
        "'speaker_1': 'Ms.. Case has worked for the department for many years, most recently since February of 2020. She has served as the interim deputy director of the department. Prior to that, she has also served the department as an election operations supervisor, a project or a project program manager and an election services manager.'",
        "'speaker_1': 'With regards to professional certifications, Ms.. Case is a Washington State certified election administrator as well as a national certified elections registration administrator. Additionally, she received a bachelor's degree in Business Administration from Oregon State University. I'll wrap up by noting that county code requires the appointment of the Deputy Director of the Department of Elections to be confirmed by'",
        "'speaker_1': 'the County Council as such approval of the proposed motion. Before you would fulfill this requirement and we are joined by Ms.. Keith as well as Julie Wise, the director of the Department of Elections. And, Mr. Chair, that concludes my remarks.'",
        "'speaker_0': 'Thank you. Director Wise, would you like to make any introductory comments?'",
        "'speaker_1': 'And can Mr. Chair and members of the Committee for the Record, Julie Wise, your King County Director of Elections, I am exceedingly happy to come before you today to present Ms.. Janice case for confirmation as our elections deputy director.'",
        "'speaker_1': 'With over 15 years of election administration in both Washington and Alaska State, she brings an incredible amount of depth of knowledge and operational experience to this position. To be frank, she is one of the most talented individuals I have ever met.'",
        "'speaker_1': 'Janice has served us so well this past year, which surely was the busiest, most challenging and strangest election cycle to date. It truly is Janice's leadership and her organizational skills that kept everything together. Her ability to see both big picture and literally millions of details is astonishing.'",
        "'speaker_1': 'She is fiercely driven.'",
        "'speaker_0': 'And always looking.'",
        "'speaker_1': 'For us to improve. Her creativity, knowledge and dedication are unparalleled. Unparalleled. I simply couldn't think of an individual better suited to serve in this role, and I'm truly grateful I get to work with her every day. I hope you'll confirm Ms..'",
        "'speaker_1': 'Janice Case as our King County elections deputy director today. Thank you.'",
        "'speaker_0': 'Thank you, Ms.. Case. Good morning and welcome. Thank you for your patience. And a few words in your defense, perhaps.'",
        "'speaker_1': 'Yes. Good morning. For the record, my name is Janice Case, deputy director, designee for the Department of Elections. I'd like to thank my council member, Councilmember McDermott, for sponsoring this motion. I am excited for this opportunity and honor.'",
        "'speaker_1': 'Director Wise has selected me to fill this role. I discovered my passion for working in elections early in my career, and I'm excited to continue to work with Director Wise and the elections team to continue to remove barriers to voting, increase voter engagement, and ensure our elections are secure, accurate and transparent.'",
        "'speaker_1': 'And I'd be happy to answer any questions.'",
        "'speaker_0': 'Questions in this case. This case, what you think might be some trends or things for policymakers to be aware of and watch in elections in particular will election administration. I'm in the coming years.'",
        "'speaker_1': 'I think one of the biggest things we're looking at right now are signature alternatives, alternative options for validating. You are who you are who voted. Young people are very unfamiliar with signing things, and we've also seen discrepancies in signature challenge rates in communities of color and would like to come up with alternatives for for validating signatures.'",
        "'speaker_1': 'That's more fair and equitable, you think? That's one of the biggest things. And then also, obviously election security and ensuring that people have correct information about how our elections are processed in a secure and accurate manner.'",
        "'speaker_0': 'Thank you, Mr. Chair. That was member done. Thank you. Thanks so much for painting the house today. Thanks so much for your willingness to serve as deputy director and a very fine elections director. We all respect you out here in District nine, partly because she lives here.'",
        "'speaker_0': 'One of the things that I wanted is a serious question. Normally, I would have given you a heads up on this, but I want to hear your thoughts. One of the things that happened as a result of the election of 2020, the presidential race is, you know, one candidate screamed from the rooftops that the election was stolen'",
        "'speaker_0': 'and certain media picked that up and promoted that either message. And and, you know, I have a long history of working with the Department of Elections. I've served on the canvasing board. I've walked through and inspected the cages.'",
        "'speaker_0': 'I've seen a lot of elections there. And I worked closely with your office over the years. I have a lot of confidence in the department. But there are people right now out there who don't. And for right or wrong, there is a significant trust factor that's gone on there that I think that your office needs to be'",
        "'speaker_0': 'sensitive to. For example, if you're talking to a certain political party right now, they don't have faith or confidence in it. I've done my level best to sort of explain, you know, my experiences there, but they're not necessarily believing it.'",
        "'speaker_0': 'And so the question I have for you is how will you reach out to certain groups that don't necessarily trust right now the elections generally and more specifically, King County elections to do what you can to earn their trust back?'",
        "'speaker_0': 'That's my question.'",
        "'speaker_1': 'I think we've done a lot of work over the years and will continue to do so and in building the trust of voters and the integrity of the election that we have. We're always happy to invite people into the elections office to watch the process.'",
        "'speaker_1': 'We have our webcams that are displaying the election process 24/7 so folks can watch from home and watch that we're accurately and transparently processing their ballots. And we also have a fantastic communications team that helps get the word out to everyone about how we do process their ballots.'",
        "'speaker_1': 'So educating them on what our process is and of course, always inviting that feedback and that conversation to have with individuals to help build their trust in our elections process here in King County. Member.'",
        "'speaker_0': 'I can't move Daniel on you. Sorry. Sorry. Thanks. I'm almost done. Thank you for that response, Kathy. You could be next. I just have a suggestion. Kathy Lambert and I were on a call. Was it last night? Night before?'",
        "'speaker_0': 'Anyway, one of the things that I think would make sense is if the election senior elections leadership met with both political parties and. And really get gave them an opportunity to walk through the elections, building in the election processing centers yet again to answer questions, to kick the tires, and for you guys to be responsive.'",
        "'speaker_0': 'I think that would be really good if, for example, we allowed Joshua Freed and the delegation come through there and just begin to build trust again in the process, and it will just help everyone feel more confident in the next series of results.'",
        "'speaker_0': 'And I think it's a positive step and I hope you consider doing it. Thank you. Member Council member LAMBERT Thank you.'",
        "'speaker_1': 'So we have been on numerous calls with people that have concerns, and a lot of it has to do with educating what does happen, what the rules are. When I was on the canvasing board, one of the things that really made me pleased was when there was a vote that should have gone Democrat.'",
        "'speaker_1': 'It was usually the Republicans that were fighting for the Democrat to have the vote and when it should have gone to the Democrat Republican, the Democrats were saying, yes, that's a Republican vote. And it happened so many times that I was so impressed.'",
        "'speaker_1': 'And when I when they commented about it, they said, the people who are on this board are so interested in making sure elections are fair, that that is the prime goal here. And I saw it playing out time after time, and it really gave me a great feeling about that.'",
        "'speaker_1': 'That is not how everybody feels right now. And so I think that that's really important that and I know Julie already does this that she needs on a regular basis. And in our conversation she offered it to happen, to continue to happen with both the chairs of the parties.'",
        "'speaker_1': 'So I thank you for doing that. The one suggestion that I would make is I know you give an annual report and in the annual report, there is no place that I see for a minority opinion. And I know that there was the minority opinion this year, and I think it's important for our voices to be heard'",
        "'speaker_1': '. And so I think there should be a minority opinion section so that it alerts us to where are places where there are concerns and whether they are totally valid or partly valid or invalid. They are still concerns and need to be addressed.'",
        "'speaker_1': 'So I would propose that we have a minority opinion on decisions that would be in the annual report. Thank you.'",
        "'speaker_0': 'In this case that he cut. Any response? Any comment?'",
        "'speaker_1': 'I will add that Director wise and I need monthly with both parties and have for the past few years. And we absolutely value our observers and value those relationships and will continue to have those meetings.'",
        "'speaker_0': 'Colleagues for their questions. I had one, Mr. Chair. Ms.. Director Wise, thank you so much for the great leadership of the Department with respect to the November election. You reconcile every ballot that comes in and we've held in the past 100% reconciliation.'",
        "'speaker_0': 'I mean, we're talking millions of ballots, literally. How did we do last time on your reconciliation percentage?'",
        "'speaker_1': 'Councilmember Tim Bousquet. Do you want me or do you want our damage in this case to answer.'",
        "'speaker_0': 'Whoever whoever wants to high. Janice congratulations the James go for it. It's it's it's.'",
        "'speaker_1': 'Exciting. I we reconciled once again. Our department has an amazing history, as you said, of of reconciling. And we were also really excited to have more than a million ballots tabulated on Election Day, far surpassing our previous records.'",
        "'speaker_1': 'And with that many ballots, so completely reconciling is a huge accomplishment for our team. And they did a fantastic job, as always.'",
        "'speaker_0': '100%. Yeah. Thank you. Thanks, Mr. Chair. You're very welcome. Further questions. I will obtain a motion to approve ordinance 2020 131. We have before US Ordinance 2020 131 appointing Janice Case as Deputy Director of the Department of Elections.'",
        "'speaker_0': 'See no further discussion. Madam Clerk, would you please call the wrong.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember. Did you i. Councilmember DEMBOSKY.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Cox. Hi. Councilmember Lambert. I. Councilmember up the grill, I. From number one right there.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council members are high.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Mr. Chair, the vote is no, not zero nos.'",
        "'speaker_0': 'Thank you. By your vote, we've given a do pass recommendation to ordinance 2020 131, appointing Janice Case as deputy director of the Department of Elections. Thank you very much for joining us today. We will expedite that to full council and barring objection, we'll put it down to consent as well.'"
    ],
    "Appointment of Taylor Atkinson to the Solid Waste Advisory Committee.": [
        "'speaker_0': 'It'll be on consent. The consent agenda for council a week from yesterday. This coming Tuesday. Thank you. Next item is proposed motion 2021 12, which confirmed the executive's appointment of Taylor Atkinson to the Solid Waste Advisory Committee. The application materials were sent out to council members separately.'",
        "'speaker_0': 'Three rows from council staff would provide a brief staff report. Then we'll hear from Ms. Atkinson, who is with us today. Ms. Rose, the call is yours.'",
        "'speaker_1': 'Thank you, Mr. Chair. For the record, Cara Rose, Council staff. As the chair noted, Agenda Item eight concerns the appointment to the King County Solid Waste Advisory Committee, or.'",
        "'speaker_0': 'SWAC.'",
        "'speaker_1': 'Proposed motion 2021 12 would confirm executive's appointment of Taylor Atkinson as a citizen representative to the SWAC and the materials begin on page 80 of your packet. Briefly provide some background on the committee and then briefly introduce the appointee.'",
        "'speaker_1': 'State law requires each county to establish an advisory committee to assist in the development of programs and policies concerning solid waste handling and disposal, and also to review and comment upon.'",
        "'speaker_0': 'Proposed.'",
        "'speaker_1': 'Rules, policies or ordinances prior to adoption. Under King County Code, King County SWAC is composed of at least nine and not more than 20 members representing a balance of interests. And these interests include interested citizens, local elected officials, industry and public interest group representatives, among others.'",
        "'speaker_1': 'Code also requires that the committee shall include one representative from each of the two bargaining units representing the greatest number of solid waste division employees and one representative who resides within a mile of the Cedar Hills Regional Landfill.'",
        "'speaker_1': 'To provide some brief background on the appointee, Taylor Atkinson is the owner and operator of Atwell Design, which is a real estate agent company. Ms. Atkinson's application notes that she is passionate about zero waste, highlighting that she runs a zero waste household and a business with zero waste at the forefront of its vision.'",
        "'speaker_1': 'According to her application, she also.'",
        "'speaker_0': 'Serves on the board of.'",
        "'speaker_1': 'The Real Estate Staging Association and is useful.'",
        "'speaker_0': 'Platform.'",
        "'speaker_1': 'To bring to life waste in the industry. Staff have not identified any issues with the proposed appointment. It appears consistent with the requirements of King County Code. And as you noted, Ms.. Atkinson, the appointee, is here today and we also have Kate McLaughlin, Solid Waste Division Director, available, and that includes my remarks.'",
        "'speaker_0': 'Mr. McLAUGHLAN, any opening, any introductory comments on your part? Well, thank you, Mr. Chair. Just to say that we are on a mission of zero waste, as we've talked about many times before. Most of what goes to the landfill every day doesn't belong there.'",
        "'speaker_0': '70% of the truckloads of material that will go to the landfill today could be and should be recycled instead. So we have huge opportunities to divert those resources, get them back into the economy and truly live a zero waste lifestyle such as Ms. Atkinson is demonstrating both in her personal life and in her businesses.'",
        "'speaker_0': 'And we're excited about the prospects of having Ms. happens join the swag committee and help us really think through the policies and practices and the partnerships that will get us to zero waste. And so I'd be happy to to endorse this candidate and answer any questions that you may have.'",
        "'speaker_0': 'But as you're going to get to know this. ATKINSON She's really a stellar candidate for this purpose. Ms.. Atkinson. Good, good. It's still morning. Good morning and welcome the morning.'",
        "'speaker_1': 'Thank you for having me today.'",
        "'speaker_0': 'You're very welcome. If you'd like to introduce yourself and speak to your your interest in serving in this position.'",
        "'speaker_1': 'Yeah. I mean, Terry's pretty much touched on everything pretty good. But I would just say that I am also passionate about public education because I believe that once you know something, you can't unknow it. And the more informed public will also make better decisions.'",
        "'speaker_1': 'So I am excited to have talked about that kind of a roll out of the zero waste campaign, because that is like my personal passion. That's what I try to teach on our social media for my business. And I also believe that businesses and government entities need to work together and educating the public and making change across'",
        "'speaker_1': 'the board.'",
        "'speaker_0': 'Thank you so much. Taking questions. Ivan. It's good to see I want to see a bottle native coming on board, Mr. Chair, but they can't all be Indians. I would entertain a motion to approve give a depart recommendation to motion 2021 12.'",
        "'speaker_0': 'So moved. The motion is before us. See no further discussion. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Excuse me. Thank you. Chair Council Member Bell DG i council member DEMBOSKY. I Council Member Dunn. I Council Member Chorus. Council Member Lambert. I council member of the group.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council member. Gone right there. I council members are high.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The US is no nice hearing us.'",
        "'speaker_0': 'Thank you. By your vote, we've given a do pass recommendation to Motion 2021 12 appointing Taylor Atkinson to the Solid Waste Advisory Committee. We will expedite that and put it on consent so it will be before a full council this coming Tuesday.'"
    ],
    "Appointment of Patricia Moss to the 4Culture Board.": [
        "'speaker_0': 'That brings us to item nine on today's agenda. The proposed motion 2021 114 which would which would confirm the appointment of Patricia moss to the Forward Culture Board of directors. Application materials for this item were also sent out to council members separately in their crackers up from Council South will provide a brief staff report.'",
        "'speaker_0': 'Then we'll hear from Ms.. Moss, who was with us today. Ms.. Crackles IP, the line is yours.'",
        "'speaker_1': 'Thank you, Mr. Chair. Good morning, council members. I'm the aircraft goes off the council staff. The materials for this item begin on page 85 of your packet and the proposed motion would confirm Patricia moss to the for Culture Board of Directors for the remainder of a three year term expiring on December 31, 2023, and for culture is'",
        "'speaker_1': 'governed by a 15 member board of directors who are to have a demonstrated commitment to and knowledge of cultural resources, be active and experienced in community and civic issues and concerns, and have the ability to evaluate the needs of cultural constituencies in the region as a whole.'",
        "'speaker_1': 'Directors are to represent a range of talents, experience, backgrounds and viewpoints. Ms.. Moss resides in Council District nine and was appointed by Council member Reagan Dunn. She is the founding president of the Black Diamond Arts Alliance. She's an artist, and she's also an educator and counselor working with diverse populations.'",
        "'speaker_1': 'Ms.. Moss's appointment is consistent with the criteria established in the Ford Culture Charter, and staff has not identified any issues with this appointment. That concludes my staff report. And as you indicated, Ms.. Moss is here.'",
        "'speaker_0': 'Thank you so much. Thank you so much. Ms.. Moss, would you like to say a few words and introduce yourself.'",
        "'speaker_1': 'Sir? Hi, everyone. Thank you. My name is Patricia moss. Thank you for your introduction and council member Dunn for your appointment letter. I'm really honored for this. And in addition to the information that was shared. I've worked in the arts for about well, in and around the arts for about 30 years.'",
        "'speaker_1': 'My my first degree that I didn't finish in college was an arts administration degree. And I understand how art can impact economy. And I think that now is the perfect time that we can tie those needs of the artist into the needs of our communities to help build our economies in our areas.'",
        "'speaker_1': 'So I think that we can do that by supporting opportunities for exhibitions, for public displays, cultural events, education and professional development for those small businesses and for artists and in the education sector as well.'",
        "'speaker_0': 'Miss Moss, I don't I don't know how much experience you have in painting, but if you'd care to critique Councilmember Dunn's house painting he was working on today.'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'Let's see. But hold on. Is this awesome.'",
        "'speaker_1': 'Purple, cool green carpet.'",
        "'speaker_0': 'And blue over here. It looks like Miami Vice. And it blew up in the eighties.'",
        "'speaker_1': 'And it definitely has an eighties vibe. I would agree with that.'",
        "'speaker_0': 'I feel so comfortable in it for some reason. Thank you for your interest in doing this work. We appreciate it. I cannot tell you, miss, how happy I am. It is you we are appointing not council member done.'",
        "'speaker_0': 'Councilmember Diane, I would entertain a motion to give a do pass recommendation to motion 2021 144. So move, Mr. Chair. With pleasure. Thank you. We have motion 2021, 114. I may have asked for the wrong number, but for 114.'",
        "'speaker_0': 'Appointing Patricia moss to the Fort Culture Board before us, I see no further discussion.'",
        "'speaker_1': 'Mr. Chair, I neglected to mention there is a small technical amendment for this one. It is a grammar error.'",
        "'speaker_0': 'Can you walk us through that? That's moving them at one, Mr. Chair. Amendment One is before us. Anybody supporting technical corrections, please say i, i, i. People opposing technical corrections. Please say no. The ayes have it. The amendment is adopted.'",
        "'speaker_0': 'We have motion 2021 114 as amended before us. See no further discussion. Madam Cook, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Barghouti. Hi. Councilmember Dombrowski, I council member Dunn. I council member calls. Council member Lander. I can't.'",
        "'speaker_0': 'Like.'",
        "'speaker_1': 'Councilmember of the ground. Council member by night.'",
        "'speaker_0': 'There are high.'",
        "'speaker_1': 'Council members online.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is 880 nos. Member of the graphics cast.'",
        "'speaker_0': 'By your vote. We have given in to pass recommendation two motion 2021 114 as amended, and we will send it to full council expedited and on consent. Madam Clerk, I don't believe we missed any votes due to technical or any other issues today.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_1': 'No, not for Mr.. Mr. Chair. Except for this last one with Councilmember of the Club excuse.'",
        "'speaker_0': 'Very good in. Not seen him here. No. And he can address that through the end of the day. I what if we have no other business to come before the committee to hold today? I want to thank everybody for participating in today's meeting.'"
    ]
}