{
    "Gender-Neutral Language in the King County Code.": [
        "'speaker_0': 'And so we'll take item six, six and seven together through Jim separately.'",
        "'speaker_5': 'I would suggest together.'",
        "'speaker_0': 'Okay. That's what I'm thinking too. Okay, good. So six and seven together. So that is proposed ordinance 2016 0311 and 03181 being an ordinance and one being a motion. So, Mr. Wagner, will you take them away?'",
        "'speaker_5': 'Thank you, Madam Chair. Nick Wagner, council staff. The staff report on these two pieces of legislation begins on page 57 of your materials, both proposed ordinance 2016 0311 and proposed motion 2016 0318 would help make the wording of the King County Charter and the King County Code gender neutral.'",
        "'speaker_5': 'And by gender neutral I mean wording. That does not imply that certain roles are suited exclusively or primarily to a particular gender. For example, the term fireman could be interpreted as implying that firefighters are normally men, whereas the term firefighter is free of that implication.'",
        "'speaker_5': 'The goal of making language gender neutral is not new, as shown by the excerpt from the 2003 edition of the Chicago Manual of Style that is quoted at the top of page 58 of your materials. Three years earlier, this Council had adopted what is now Section 1.03.120. A of the King County Code, which is quoted in the'",
        "'speaker_5': 'middle of page 58 and which requires the use of gender neutral, gender neutral language in the code that excuse me, that provision, however, is prospective only it does not affect the gender specific language that is already in the code or in the charter unless that language happens to be amended for other reasons.'",
        "'speaker_5': 'As a result, the transition to gender or gender neutral language in the code and the charter has been slow, as noted in proposed motion 2016 0318 the proposed ordinance and motion that is before you would address that problem, the ordinance would place on the November ballot a charter amendment making the charter language gender neutral.'",
        "'speaker_5': 'The ordinance, which is attachment one that pages 61 to 76 of your materials, is 16 pages long. There is also a technical amendment, Amendment One, which is attachment to a page 77 of your materials. Since the county code is much longer than the charter, making it gender neutral is a larger project in its original form.'",
        "'speaker_5': 'Proposed Motion 26. 0318. Would direct the Council Clark to develop a plan and timeline for the project. There is a proposed amendment, Amendment One, which is the attachment for page 83. However, that amendment has been superseded by Amendment two, which has been distributed to this morning, I believe, and which directs the Clerk of the Council to develop'",
        "'speaker_5': 'options for the Council to consider and provides guidance for developing those options. And my understanding is that the sponsor that Amendment two is considered a friendly amendment by the original sponsor of proposed Motion 2016 0318. In particular, Amendment two specifies that one of the options must be performing the work within existing staff resources.'",
        "'speaker_5': 'There's also a title amendment T one, which also was distributed this morning, which would conform the title to the motion as amended by Amendment two. And that concludes my staff report. Unless there are any questions.'",
        "'speaker_0': 'I don't have any questions, but I know we have an expert on board on this topic. So is there anybody like to make any comments on this? Councilmember Ko Well, since you're the expert, you want to comment? Thank you, Madam Chair.'",
        "'speaker_0': 'I don't know that I'm an expert on this, but I do. I am experienced. Well, hopefully your experience makes you next expert. Sometimes that goes hand in hand. Not always. However, I'd like to give a little bit of background here in a couple of ways.'",
        "'speaker_0': 'First of all, I think it was in mid-January when other the other new council member, Claudia Balducci and I and our staff were receiving an orientation right here in our chambers on our charter and codes and many other things.'",
        "'speaker_0': 'And both Councilmember Bill Dutchie and I and our staff, both our staff, all of our staff had noticed when we were looking over materials that the charter had contains gender specific language. And what really caught my eye, and I believe the others, was that council members are referred to as councilmen or councilman throughout the charter.'",
        "'speaker_0': 'So we were very interested and we talked about it later and I talked to the various people here and we kind of put on our radar that this would be something that would be worthy of change. But we were just getting used to becoming council members too, so it all got delayed a bit.'",
        "'speaker_0': 'But I would like to back up to the year 2007 and in this year I had an experience that I had in which I had no idea what was going to be happening. As it all played out for many, many years that I had been approached by one of the city and Seattle Councilmember with a female firefighter'",
        "'speaker_0': 'who worked at that time, had worked for ten years as a Seattle firefighter, but she was referred to as the fire man in everything. And she thought after ten years of serving her community in a very, very high risk capacity, that she should not have to be called the council fireman any longer.'",
        "'speaker_0': 'And so they requested that I introduce legislation in the state Senate. And as we started looking into this and found that at the federal level, occupational and professional terms had been changed in the federal codes quite some time before that.'",
        "'speaker_0': 'And we looked into it and ended up I introduced legislation and you have a copy on a peer if you want to take a look. 2007. Which was an Gore's Senate bill eventually 5063. The bill report enacted is very short.'",
        "'speaker_0': 'Might take a look at it, but it specifically says that the code revised are in consultation with the statute. Law Committee must develop and implement a plan to correct gender specific references. Then the code making annual recommendations to the Legislature with completion by June 30th, 2015.'",
        "'speaker_0': 'So that started the whole process. We actually finished two years earlier. Each bill. During every legislative session during that time was like this that I and it was the 1983 that state they required that all statutes be written in gender neutral terms, just as was the case as Nick presented.'",
        "'speaker_0': 'And I think you said, Nick, that was 2000.'",
        "'speaker_5': 'That's right.'",
        "'speaker_0': 'Prospectively, but not retroactively. So a number of us thought that this would be something worthwhile to have completed, both in the charter, which involves a charter amendment. So we'd go before the voters next November. And in our code, having experienced this for so long, I do have one thing that I think is really important to bring out'",
        "'speaker_0': ', and that is that in no way does any change require that our residents and our citizens speak in non gender specific language. They can still call people fire men if they want. There's nothing to do with what our citizens, our residents do.'",
        "'speaker_0': 'It's more what is reflected in our codes and this sense retroactively from before, nothing. Secondly, nothing would change the meaning of the codes, the substance. It's strictly the use of terms that are gender specific, changing to gender neutral.'",
        "'speaker_0': 'I have to say, Nick, I think you did a great job of making the changes in the charter for the proposed ordinance and ballot measure. Really good job on that.'",
        "'speaker_5': 'Thank you. It was a group effort, I should mention.'",
        "'speaker_0': 'And secondly, I if it's all right, I would like to have a code revise or I come by to ask him something specifically. Bruce Ritson if that's all right, Madam Chair. Certainly. Thank you, Bruce. When when you and and Nora.'",
        "'speaker_0': 'So Clare and Nick talked about this initially you contacted Kyle Bass and the legislative code advisor who worked with me all these years and got information from him. And I'm interested in the just you're giving a brief summary of what came out of those conversations for our work ahead if we do adopt it.'",
        "'speaker_1': 'Hi, I'm Bruce Ritson, the code advisor. Yes, I spoke a bit with Kyle Thiessen and some of his staff, specifically the attorneys who worked on the project. I think one of the things that we came up that would be different from us is that they have an interim time when they can work on projects that it's kind'",
        "'speaker_1': 'of a downtime for the legislature in the summer. And they dedicated about ten people to this project, two attorneys, but other staff members to the project. And they came, they had limitations. They had to work with specifically size limitations.'",
        "'speaker_1': 'So they worked up to about a 500 page per year limit. But even within that limit, they were able to complete the project two years earlier. As you mentioned. I think the one thing that comes to mind is that some of the things seem easier than they might be.'",
        "'speaker_1': 'Just on the surface of it, there were some things where they ran into words that either had some kind of limitations on changing them. For instance, something might have a federal term that is close to that that also been applied to them.'",
        "'speaker_1': 'And so they had to work out some things with different interest groups and experts. That was more than they were anticipating. I think the other thing to keep in mind is that they kept it extremely limited to just changing gender neutral terms.'",
        "'speaker_1': 'So it wasn't any other kind of clean up going on there with the language. So that that's the kind of thing I ran into. They were very helpful. They gave me their word list of what they used and other reference materials that they used and found helpful.'",
        "'speaker_1': 'The other thing that they pointed out is that in retrospect, they thought that maybe some other approaches may have been taken. For instance, instead of changing things like him, him to him or her, to actually cite the actor rather than introducing the him or her issue.'",
        "'speaker_1': 'So hopefully we'll be able. Get even a more improved product from that effort. The other thing is there's still some times when something sneaks up on them that they hadn't realized for whatever reason. Very occasionally. But that happens as well.'",
        "'speaker_0': 'Thank you very much, Bruce. And with that, I recommend both of these to you. And I think that it's important to note we do very serious work here at the council and we represent our constituents. This may seem as though it's not as important substantively compared to other work that we do, but I do believe that it'",
        "'speaker_0': 'is important and it's very symbolic, too, in terms of eliminating biases that we have in our code and in our codes and in our charter that I think can be handled. And I think it's the 21st century. I mean, this is something we should do.'",
        "'speaker_0': 'Well, thank you. So I have one question. Council members, this is your history with this. I might ask you to put it, for instance, here, that we use the Chicago Manual of Style. Have we as a council ever approved that or do we know?'",
        "'speaker_5': 'Madam Chair, that is simply a reference work that I cited as an example of a recognized authority that supports the use of gender, gender neutral language.'",
        "'speaker_0': 'Okay. Because I know that we use a style that everybody uses and the state level and there's some parts of that style like making King County the capital. I mean, little C's on county and and some kinds of rivers with little others that.'",
        "'speaker_0': 'As you said not too long ago, forget everything you learn in English, which is tough since I'm a former English teacher. So that bothers me. Why? Why are we doing that? Because I don't think that's what's being taught in college or in elementary schools.'",
        "'speaker_0': 'So it's it's jarring to read it when it's written like that.'",
        "'speaker_1': 'It is based on the approach that was taken by the state of minimal minimizing things like capitalization. It is a rather standard approach to take to writing, though. Mean it's not unusual. And in fact, some of many of the style manuals follow a similar kind of style.'",
        "'speaker_1': 'But we do have some specific rules that we selected. But it's you have to select one way or another. And we have gone in certain directions for making the choices. But it's also the approach is very much like the state took, and it's very similar to other states and other municipalities and how they approach it as well'",
        "'speaker_0': '. Yeah. At some point I think we need to make a decision here. And I understand why there were typecasting days where you had to get the little other tool and, you know, whatever. But since it's all computerized, I don't see any problem with capitalizing words.'",
        "'speaker_0': 'And I'd be interested in knowing, does the University of Washington teach, you know, capitalize anything anymore? You know, when the universities are teaching, you don't capitalize anything that I'd be more comfortable saying. I swallow it. But until then, I really don't like it.'",
        "'speaker_0': 'So I just won't put that on the record that I think we at some point need to be looking to see how we want our charter to look. So people think that we're at least literate and so we don't drive old English teachers crazy, including me.'",
        "'speaker_0': 'Okay, so enough on that. The amendment that is here is for the other one. So let's take them separate for the book as well as an amendment. So Councilmember, were you put 2011 and 1216 03111 before us. Are you referring to me?'",
        "'speaker_0': 'Yes. Yes, I was. Thank you. Thank you, Madam Chair. I moved proposed ordinance 2016 0311. Thank you very much. And I believe we do have one technical amendment.'",
        "'speaker_5': 'Yes, there's a technical amendment. Amendment one on page 77 of your materials.'",
        "'speaker_0': 'Okay.'",
        "'speaker_5': 'It simply supplies a word that was inadvertently omitted.'",
        "'speaker_0': 'Okay. That's a really tough one. Councilmember, you put the amendment number one before us under the adoption of the amendment. All right. I think there's there's a reason for that one, for sure. So all those in favor of adding the word properly, please say I, I as opposed nay.'",
        "'speaker_0': 'All right. So now we go to the underlying motion as a motion or ordinance. This is an it's a motion underlying ordinance.'",
        "'speaker_5': 'This is a motion proposed motion. 2016 0318.'",
        "'speaker_0': 'No, I'm looking at 311131.'",
        "'speaker_5': 'Oh, I'm sorry.'",
        "'speaker_0': 'Excuse. So that's an ordinance, isn't it? Yeah. Yeah. Okay. So the underlying ordinance as amended, is before us. This is the charter amendment. Are those in favor, please?'",
        "'speaker_1': 'Sorry. Going to take comments or debate on this.'",
        "'speaker_0': 'Oh, so I didn't see anybody than I thought I would comment that and the second one. But it's long as I'm speaking, I can say very, very briefly that it was one of those interesting moments at the beginning, you know, of the first week here as a council member to be reading documents that referred to me as'",
        "'speaker_0': 'councilman. I want to I think there's probably but not not a not a coincidence that in the year when you have two new council members, both of us women, that this comes up. But if this trend continues, I want to assure my diminishing number of male council members that we're not proposing to change the council woman.'",
        "'speaker_0': 'We just want to make it, say, council member so you can all be included as well. Thank you. You're more gentle nature. Yeah. Okay. Well, I'm glad to hear that. All right. Well, I'm glad to have two more council members who happen to be women on board.'",
        "'speaker_0': 'So with that, yes. Council member.'",
        "'speaker_1': 'Betty, I first of all, I would have no problem being called council woman. We're in a new era here. But I just wanted to take a moment to thank, actually, both council members, Cole, Wells and Vale duty for taking up this issue.'",
        "'speaker_1': 'And just straight back or just harking back to a little bit of history, it's appropriate that Council member Cole Wells is the prime sponsor of this charter amendment. She represents District four on the Council and District four elected the first woman to the new King County Council, Bernice Stern.'",
        "'speaker_1': 'That was in 1968, after the voters approved the Charter amendment, creating this Council on changing from a three member commissioner form of government. Renee Stern's campaign theme was, quote, We need a woman on the new nine man, King County Council.'",
        "'speaker_1': 'So today, that anachronism and hope is being fixed. And and that's, I think, all for the good. And I think it's very appropriate that the councilmember from District four has taken the lead on it, given the history here.'",
        "'speaker_0': 'Thank you for that bit of history. And I'm sure Bernice is looking down with a smile. Councilmember Robinson. Thank you, Madam Chair, and thank you, Councilmember Dombroski, for that little bit of history lesson for us. I'd also like to thank Councilmember Lambert because she was very involved with this effort as well and very supportive and has made'",
        "'speaker_0': 'really good suggestions as well as on the motion that will come up right after this. And I really appreciate all the support. We have six sponsors on this proposed ordinance, which I very much appreciate. Thank you. Thank you.'",
        "'speaker_0': 'All right. So now we are ready for the clerk to call the vote. Thank you, Madam Chair. Councilmember Belge.'",
        "'speaker_1': 'Councilmember, dumbass.'",
        "'speaker_0': 'Councilmember Done. All right. Councilmember Garcia by Councilmember Carlos I Councilmember McDermott, Councilmember Up The Grove Councilmember by Mike Bauer. Madam Chair, I am chair with seven Eisner notes and council members McDermott and Broderick are excused. Excellent. So on this, the next question will be next week.'",
        "'speaker_0': 'Do we need something that will say who? Right. The pros and the cons statements for this?'",
        "'speaker_5': 'Yes. Assuming the council takes final action in support of the amendment, that would be the next step.'",
        "'speaker_0': 'Okay, that's what I thought. So if you could start preparing that and I'm assuming Councilmember Caldwell's that you would want to be one of the names. So anybody else interested in, you know, being a pro on this, let us know.'",
        "'speaker_0': 'And so we'll be ready to do that or didn't see any calls here, but anybody who's interested can do that. All right. So now we're at the motion sheet, thousand 60318 and this is going into the code and we've been briefed and we've been briefed on the amendment.'",
        "'speaker_0': 'And so amendment number one has been pulled because it was improved in amendment number two.'",
        "'speaker_3': 'So I want to say something to you.'",
        "'speaker_0': 'Yes. Thank you, Mr. Gossett. Madam Chair, we forgot to ask you whether you wanted to expedite this and whether you want it on consent. Well, I don't think so, because I think everybody want to speak to it. So expediting, okay.'",
        "'speaker_0': 'Expedite, but not on consent. Thank you for asking that. Okay, so let's put this before us. Councilmember Caldwell's, will you put 20 60318 before us? Thank you, Madam Chair. Yes, I proposed motion 2016 0318 before us. Thank you.'",
        "'speaker_0': 'And Councilmember Bell, did you would you move your amendment? Amendment two. Thank you. Would you like to speak to it at all? I would think. Okay. And thank you for joining me on this amendment. The motion, it's also asks for a a report or workplan from our county clerk that explains how we're going to go through this'",
        "'speaker_0': 'process of amending the entirety of the King County Code, which has been reported that if it was printed out, which it isn't any longer, about 6000 pages. So it's a it's a body of work. And what the amendment would do is ask that the clerk, when she provides us the draft workplan for approval, include options.'",
        "'speaker_0': 'I wanted us to be mindful of the fact that we're going into a year when we're going to have county functions really pressed for for funding in our budget. We have a budget shortfall coming up. And so as we go forward with this work, I just wanted to be thoughtful about the fact that we should do it'",
        "'speaker_0': 'in a way that is the least impactful to staff workload, both in the council side of the government and in the executive branch and in the other place. We might need to look for help, but also mindful of the costs so that we minimize the cost.'",
        "'speaker_0': 'It's an important thing to do, but it can be done over time and that I think we should do that in a way that both gets it done and is thoughtful and mindful of our budget constraints as a county so that the purpose of the amendment as offered and I can answer any questions if anybody has any'",
        "'speaker_0': '. Thank you. I thank you for that amendment. And I and I agree with everything you said it's important to do, but we need to keep it in balance with everything else that's important to do in the county. So all those in favor of Councilmember Caldwell's.'",
        "'speaker_0': 'Thank you, Madam Chair. And I do support this amendment and I appreciate councilman respected she and Lambert bringing it forward. Everything in here, I believe, was implied, but I think it's really helpful to have it specified. So thank you.'",
        "'speaker_0': 'Thank you for a collaboration on all of this. And so all those in favor of amendment number two, please say those opposed nay, the amendment is approved and now we have the underlying major motion. Yes, there's a title amendment because of the passage of amendment.'",
        "'speaker_0': 'Okay, I may move amendment one. Do we have that someplace? It's in the packet that was handed out with amendment to it. It just changes the title to say Develop Options for how to apply gender neutral references. Okay.'",
        "'speaker_0': 'Great. Okay. Okay. Great. Thank you. Okay. Although I am in favor of the title amendment, please say I. I as opposed name the title amendment and thank you for catching that. All right. Thank you. All right. Now we urge the underlying motion.'",
        "'speaker_0': 'And so any final comment? Okay. Others could please consider that. Thank you, madam chair. Councilmember Chai councilmember number five councilmember Dan all Councilmember Johnson. AAM councilmember for well I Councilmember McDermott councilmember of the world I don't remember fun writer.'",
        "'speaker_0': 'Madam chair I know those councilmembers McDermott and Don are excused. Excellent. So that is let's do the same thing with expedite so the be at the same time but not I'm concerned. Okay. I don't see any other business.'",
        "'speaker_0': 'Is there any other business to come before the body at this time? With that, the meeting is adjourned. Thank you. Don't forget to.'"
    ]
}