{
    "Ordinance to revise the office of law enforcement oversight and its functions.": [
        "'speaker_0': 'this on the ballot this year. Thank you again very, very much. And we're going to move on now to our second item for discussion on possible action today. Proposed ordinance number 2017 0139 relating to the Office of Law Enforcement Oversight.'",
        "'speaker_0': 'And we will have our chief policy officer, John Risha, here to speak to us about this topic. The sponsors are Mr. Gossett. Mr. Dombrowski. And so, John, when you're done introducing, I'm going to call on Councilmember Gossett. Thank you.'",
        "'speaker_0': 'Maybe we could just take a breath for 1/2 while the chamber clears. Okay. Yeah, I think we can hear you now. Please go ahead.'",
        "'speaker_5': 'Thank you, Madam Chair. John Risha stopped King County Council today before you is proposed ordinance 2017 dash 201393.'",
        "'speaker_3': 'Target into the mike.'",
        "'speaker_5': 'Absolutely proposed ordinance 2017 dash 0139. This ordinance would amend King County Code Section 2.75, which is the underlying authorization for the Office of Law Enforcement Oversight in King County Code, as well as amend Section 3.16.060, which is the Department of Public Safety.'",
        "'speaker_5': 'Following initial comments, I'll be happy to go through some of the key points of the legislation, or I can go directly there.'",
        "'speaker_3': 'I wanted to make some comment first.'",
        "'speaker_0': 'Go ahead, Councilmember Garcia.'",
        "'speaker_3': 'Thank you, Madam Chair. And I wanted to indicate to you, Madam Chair, you were correct that the darling of the with the issues surrounding the Office of Law Enforcement Oversight.'",
        "'speaker_0': 'Councilmember Garcia, can you possibly speak into your microphone a little closer? We're having a hard time hearing you. Okay, that's better. Thank you.'",
        "'speaker_3': 'That's better.'",
        "'speaker_0': 'As much. Thank you.'",
        "'speaker_3': 'And Governor, government about due to the earlier remarks about the importance of the issues that currently surround the Office of Law Enforcement Oversight, I believe that the sheriff's department is one of the larger and more complex issues that we are addressing at this time.'",
        "'speaker_3': 'Just like, you know, the call for more contra access for all is important. And I don't think anyone is trying to say that one is more important than the other. But what I want to say is that the answer is in this matter, that the King County Council has been working on establishment of a civilian oversight of'",
        "'speaker_3': 'the sheriff's office for more than ten years now, Madam Chair. And at the end of 2015, we we put an amendment we recommended an amendment to our charter that would amend it be civilian oversight and provide the opportunity for King County government offered of law enforcement oversight to be able to be a little more affected by some'",
        "'speaker_3': 'actively investigating. Some rather controversial complaints that are brought here are by one of our sheriff's deputies. Then a few months later, I believe that last year we had our new director of the Office of Law Enforcement Oversight, Bret Jacobs.'",
        "'speaker_3': 'And we're very excited about her experience and her ability and her insight and her ability to lead this effort. And she has been working to recommend, along with John and our achievements there, how best to implement the will of the people as it relates to the charter change and how our code needs to change in order to'",
        "'speaker_3': 'facilitate the voters desire. This legislation now before Madam Chair, is a result of that work and include the following one oversight of the sheriff's complaint handling process from a person talking to her office or the sheriff's office through the final determinations of that process.'",
        "'speaker_3': 'A We're looking at almost everything. The authority to conduct an investigation. Okay. And among other things, the authority to review and make recommendations regarding their sheriff operations, training policies and procedures. I personally think this is going to be even a more valued part of the work that is offered there.'",
        "'speaker_3': 'And really, that's fair. And they can assist the sheriff. And right now, if we pass this legislation and there's still important bargaining to be done with our partners in labor, specifically the King County Sheriff's Deputies Association, our guild, as well as three or four other girls that represent different sector of the employee that work for the sheriff's'",
        "'speaker_3': 'department. But it's equally important for us that the county council be clear about our desire to have a more effective civilian oversight of this. And that's really been admirable here in Martin Luther King Junior County. Thank you very much, Madam Chair, and colleagues.'",
        "'speaker_0': 'Thank you. So I could use a little guidance here. We are getting ready to move this out of committee today, I understand is the desire. So is there more discussion or Councilmember Garza, would you like to put this before us?'",
        "'speaker_3': 'Well, John John and I John to get John every he.'",
        "'speaker_0': 'Can hear you.'",
        "'speaker_3': 'Was there anything else specifically that he wanted to say and. In relationship to my oversight and talking point.'",
        "'speaker_5': 'I can add a little bit of additional clarity, but very a few brief comments on the specificity of the legislation if the Chair desires.'",
        "'speaker_0': 'If it's helpful to Councilmember Gossett and and the committee.'",
        "'speaker_5': 'Okay. Well, then I'll be very quick, Madam Chair, and you can find this on page 15 of your packet, some of the key pieces that are within this legislation. I think some of the key areas start in section four of the legislation where sections subsections A through C really hone in on that complaint handling process and the'",
        "'speaker_5': 'ability to receive complaints, investigate complaints and review and certify those the process that goes through with them. That section also contains a number of the key elements relative to policies, procedures, operations and training. Section six looks to the Sheriff's Office or the Department of Public Safety side of that equation of access to it.'",
        "'speaker_5': 'I'm sorry. Excuse me. That's the only access to information. Section nine is the core element of that in the sheriff's office. So both officers have access to information and they one has a duty to receive one has a duty to provide.'",
        "'speaker_5': 'And then very key at the very end of the legislation, since there is bargaining with 11 bargaining units within the sheriff's office, there is special specific language added about provisions of this ordinance that require mandatory bargaining would not be effective until the the county completes that bargaining.'",
        "'speaker_5': 'And then further, if there's a conflict, then a bargaining agreement would apply. I am happy to answer any questions. I'm being relatively quick on this just in the interest of time and trying to address your specific questions as needed.'",
        "'speaker_0': 'Thank you, Mr. Issa. I want to open up now for discussion and questions from the council members, and then we'll see if we're ready to take a motion at that point. Councilmember Lambert.'",
        "'speaker_1': 'Thank you. Martin Short There's a section for 2.7504 OBE. Does that mean that if there is, that the OLEO has the ability to look at all of the complaints coming in and decide whether they need to go to IU or to Oleo and make that determination?'",
        "'speaker_2': 'That is correct.'",
        "'speaker_1': 'Excellent. Perfect. Thank you. I think that's great.'",
        "'speaker_0': 'Any other questions? Councilmember Garza, would you like to make the motion?'",
        "'speaker_3': 'But I would need help from you.'",
        "'speaker_0': 'Councilmember. Councilmember Gossett, would you move approval of proposed ordinance number 2017? Dash 0139 with a do pass recommendation 190139.'",
        "'speaker_3': 'Okay, I'm glad. Thank you, Madam Chair. I'd like to move adoption 2017 0139 ordinance at this time.'",
        "'speaker_0': 'Thank you. The ordinance is before us.'",
        "'speaker_1': 'Yes, there's. No, no, no, no. The board.'",
        "'speaker_0': 'Okay. And we do have an amendment. Councilmember Lambert. Thank you, Madam Chair.'",
        "'speaker_1': 'This amendment, number one, and it's the one we talked about that would say that the any report will also be approved by us as the body. And so that's all it changes. Added a motion approving.'",
        "'speaker_0': 'Okay. We have an amendment before us. Any discussion or questions about the amendment? Councilmember McDermott.'",
        "'speaker_2': 'Thing. Thank you, Madam Chair. Do we want to approve or accept this report in your intent?'",
        "'speaker_1': 'Councilmember Lambert. Except. Okay, I'd be happy to change that word. To accept.'",
        "'speaker_0': 'Okay. We have a friendly amendment to change. Approved. To accept. Councilmember Garcia to do. We don't cover.'",
        "'speaker_3': 'I. Oh, I'm sorry.'",
        "'speaker_0': 'Go ahead. Councilmember Garcia, go ahead.'",
        "'speaker_3': 'Okay. Because I can't be my colleague. I think that the protection that Councilmember Lambert just put forth and I've got one, because it gives us another opportunity to review and look at what our progress we have made in this important area.'",
        "'speaker_3': 'Please comment upon it before it moves on for another year.'",
        "'speaker_0': 'Okay, very good.'",
        "'speaker_1': 'Just clarification on the word accepting.'",
        "'speaker_0': 'Accepting. All right. With that, the amendment as a as as friendly amended is before us. All those in favor please signify by saying i, i any opposed? Okay. Is there a title amendment? Not that I say no. That brings us to the main motion.'",
        "'speaker_0': 'Any final comments or questions? Councilmember McDermott.'",
        "'speaker_2': 'Mr. Fisher or Ms.. Jacobs, can you speak to the effect effective date of the ordinance before us? When the provisions within the ordinance become effective.'",
        "'speaker_5': 'So the provision so the ordinance itself would be effective through a normal course, which is ten days after executive signature. However, since there is bargaining that will take place with various guilds in and labor unions over the course of the next, I'm going to assume probably a two year cycle for each of those bargaining units.'",
        "'speaker_5': 'It would not become effective until after completion of bargaining. So on that rolling cycle, it would affect each one differently. And so each one would then become a it would then affect them as a following bargaining.'",
        "'speaker_2': 'And then presumably also only to the degree that the contract that was collectively bargain design measures with in compliance with matches, the ordinance put it up today. Otherwise we might see ourselves with the revised ordinance in front of us.'",
        "'speaker_5': 'Absolutely. That would be a choice for the Council. But it is very possible that the completion of bargaining you may need to or desire to go back and revisit the ordinance and perhaps amend it to reflect the will of the various bargaining units and your own decisions in approving those bargaining agreements.'",
        "'speaker_2': 'You say will and perhaps it will be the could be the will of the council, and perhaps we could do that. What would be the consequences if we the council chose not to.'",
        "'speaker_5': 'Under Section ten, be at the very end of the ordinance? It says that if a bargaining agreement has language which is different than that which is in a bargaining agreement, the bargaining agreement governs. And so the bargaining agreement will always overrule the code under this, which is a it's not a defined it's it is a relatively standard'",
        "'speaker_5': 'concept which your bargaining agreement is going to be the governing document, but this sets your policy in place within code.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Catherine. Councilmember Gardner.'",
        "'speaker_3': 'Madam Chair. Thank you. I'm really pleased that the progress that we've been able to make. But I wanted to share with and remind members that I had the opportunity, particularly last year, to work closely with some of the larger unions or associations that represent the share of power, that basically the captain and the rank and file officers'",
        "'speaker_3': 'who are in their service advocate scale. And I am working with their leaders to be very productive. They put out their idea that I'm hopeful that will come from being acceptable to both parties in a relatively short period.'",
        "'speaker_3': 'And we also did we also plan to and John help helping with this. When do we plan to let them lead of our new effort right away or we're.'",
        "'speaker_5': 'Currently the language is a matter of public domain and is an available is available in your online system. So it is currently available and the amended version will be available probably within a day or so, depending upon processing time.'",
        "'speaker_3': 'All right. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Mr. Gosset. I just want to add a few comments of my own. This has been a piece of work that has been many years in the making, and particularly since 2015, after the voters of King County agreed to amend our charter to include the Office of Law Enforcement Oversight as a required office in the Legislative'",
        "'speaker_0': 'Branch. As you said at the beginning, Mr. ICIA. I want to acknowledge the leadership of Councilmember Gossett and others, my colleagues who were here, I was not at the time. I want to acknowledge our still relatively new director, Deborah Jacobs, for all the hard work she's put in with all of the parties involved to get us to'",
        "'speaker_0': 'this point. I think that the proposal has improved sequentially each time we've looked at it, because that's that's just shows that there's been listening and adapting going on to make sure that this works with everybody who's going to have to work with it and provides really significant and really significant oversight because the whole goal is to build'",
        "'speaker_0': 'public trust and build the relationship between our law enforcement and the public. I also just want to acknowledge Susie Swaniker and Bob Railton who are here. They also have worked with us on this and have the job of making sure that this works with our colleagues in Labor and that will have to go forward from here in'",
        "'speaker_0': 'negotiation. So I'm really pleased that we've gotten to this point, looking forward to taking a vote on it. And I will just ask Councilmember Cassidy of anything to close again.'",
        "'speaker_3': 'You reminded me something is different. Jacob. There she.'",
        "'speaker_0': 'Is.'",
        "'speaker_3': 'I didn't hear the commentary and what she being that I will not hear from her.'",
        "'speaker_1': 'Me speak.'",
        "'speaker_0': 'Ms.. Jacobs, are you. Do you believe we should adopt this motion?'",
        "'speaker_1': 'I do. I'm very enthusiastic about the final product. It's been, you know, literally dozens and dozens of drafts. And because this timing has taken place, where when I'm new, it's, you know, a thing where we've been learning as we work through the systems and figure out, you know, how this can fit with the sheriff's office's existing systems'",
        "'speaker_1': '. And so it's been very valuable in that way. And also, just generally, I'm grateful to every single one of the council members and their staff members who have cared about this.'",
        "'speaker_0': 'Issue, have shown.'",
        "'speaker_1': 'Support, who have respected the will of the voters. And I just really appreciate that. And numerous people have had input and influence over this document. So you all have my gratitude and I can't wait to see what happens next.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'So thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. Without further discussion, if I don't see any, I will call for the vote. All those in favor, please signify by saying I'm sorry. It's a roll call vote. Yes, thank you. Thank you.'",
        "'speaker_1': 'First time council member Dombrowski. Hi, Council member Dunn.'",
        "'speaker_2': 'I remember Gossett II.'",
        "'speaker_1': 'Councilmember Caldwell five Councilmember Lambert. Councilmember McDermott.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Council member of the group. Yvonne. Right.'",
        "'speaker_5': 'All right.'",
        "'speaker_1': 'Madam Chair, I am sure the vote is a nice. No, no. It signal the member up the grove excuse to.'",
        "'speaker_0': 'Get in passes unanimously. Congratulations. And I believe we want to expedite that, but probably not put it on consent.'",
        "'speaker_5': 'Expedite is not necessary. Can go to the regular course to the 410 agenda, and whether you'd like it on consent or not is your call.'",
        "'speaker_0': 'I would anybody like to put it not on consent speak now.'",
        "'speaker_3': 'When is it going to be forwarded? Kind of like.'",
        "'speaker_0': 'Ford. Ford ten. You'd like to speak to it. Okay. So not on consent in the regular course. Thank you. All right. Final item on the agenda today is item six. And this is just an announcement for the for everyone to be aware of.'"
    ]
}