{
    "Judicial Appointment for King County District Court.": [
        "'speaker_0': 'Member of the Grove. Councilmember run right power here. Madam Chair, thank you. Thank you. Okay, so we have a very exciting opportunity to fill three judicial positions on the district court. And I'd like to thank the members of the subcommittee who have worked long hours in interviewing 15 different people.'",
        "'speaker_0': 'And so I'd like to thank Councilmember Balducci, Councilmember Gossett and Councilmember Dombrowski for joining in on that. And as you can see from the binders that are sitting here, there was lots and lots of information. So today we will not be taking actions on the motions themselves.'",
        "'speaker_0': 'What we're going to be doing is reviewing the qualifications of the candidates to select final candidates to be interviewed. So what we're deciding is to decide to decide, okay, so we will look at the name and then we will be able to pick which of those candidates that we would like to interview at our next meeting, which'",
        "'speaker_0': 'will be Wednesday, May the fourth. All of the candidates were told the May 4th date during the interviews because we hope to choose by May the ninth, because on May 17th begins the filing week for those positions. We'll begin this meeting with a brief staff report to provide some background for those in the audience who are unfamiliar'",
        "'speaker_0': 'with the selection process. Then we're going to go into executive session to discuss the individual candidates qualification. Mr. Wagner, would you please begin?'",
        "'speaker_1': 'Thank you, Madam Chair. Nick Wagner, Counsel. Staff It is the council's job under state law to fill judicial vacancies in King County District Court. The procedure for doing so is spelled out in the county code, and it's summarized on pages 3 to 4 of your materials for this council meeting.'",
        "'speaker_1': 'Briefly, the count. The Council clerk publishes a notice of any vacancy, and interested individuals are required to apply either to the clerk or to one of the bar associations that has an established judicial evaluation committee. As defined in the county code to be considered for appointment by the Council, an applicant must be rated by a Bar Association's'",
        "'speaker_1': 'Judicial Evaluation Committee, and the committee must refer the applicant to the council. With the rating, there are three eligible candidates for the vacancy in the Southwest Division of the District Court and ten eligible candidates for the two vacancies in the West Division.'",
        "'speaker_1': 'The committee has received several hundred pages of written materials from the 13 candidates and from the bar and the bar associations. And each committee member has been provided a copy of those materials to review. In addition, some council members, as you mentioned, Madam Chair, have informally interviewed the candidates.'",
        "'speaker_1': 'The county code provides for this committee to review the candidates and select final candidates to be interviewed by the committee. And those interviews are currently scheduled for May 4th. That's when Wednesday of next week. The purpose of today's meeting is to complete the initial review process and to select the candidates to be interviewed.'",
        "'speaker_1': 'That concludes my staff report.'",
        "'speaker_0': 'Thank you very much. And on page 18 of our packet, it gives the criteria that we are looking for in selecting judges. And I think that these criteria excellent. And we're definitely what we had in mind as we were doing the interviews.'",
        "'speaker_0': 'So with that, Councilmember Garcia, do you have a question? Yes, thank you, sir.'",
        "'speaker_2': 'Who are the three candidates for consideration for southwest Marion Courthouse?'",
        "'speaker_0': 'Okay. That is on page four of the packet that they just gave.'",
        "'speaker_2': 'Or that they just gave.'",
        "'speaker_0': 'And are are.'",
        "'speaker_2': 'For today. You don't have it either.'",
        "'speaker_0': 'I know I have it right here in front of me.'",
        "'speaker_2': 'And page for. All right, Mr. Wagner? Yes, sir. I now have the three names that we considered for Miriam. Right. Thank you.'",
        "'speaker_0': 'Okay. Thank you. At this time, the committee will go into executive session to discuss the candidate's qualifications. When we come out of the executive session, I entertain motions to select final candidates to be interviewed by the committee. On May 4th, the grounds for the executive session to evaluate the qualifications of candidates for the appointment of elective office'",
        "'speaker_0': 'as provided in our c w 4230 dash 110 Subsection eight. The committee will be in executive session, I thought for 20 minutes, but I'm thinking that's not going to be right. So I would say 30 minutes, which will take it until five.'",
        "'speaker_0': 'If we need to go beyond that, we can. And I'm asking the clerk now to post the doors to that effect. And we must now ask any member of the public and all county employees who are not directly impacted or necessary for this discussion to please leave the council chambers.'",
        "'speaker_0': 'So thank you very much. Okay. And. Oh. Okay. So the committee is back in open session. I'll now entertain a motion. We're going to have two motions, one for the the Southwest Division. And then after that, we'll have it for the West Division.'",
        "'speaker_0': 'They will be interviewed when we have the final candidates to be interviewed, and they'll be interviewed on May 4th. It will be in the morning and it's looking like we will start at 9 a.m. And I had told some of the candidates it was evening.'",
        "'speaker_0': 'So we'll have to make sure that they know that it is in the morning. So I'd like to call on Councilmember Gossett for a motion for the Southwest Division candidate.'",
        "'speaker_2': 'Thank you. Thank you, Madam Chair. We had an excellent discussion and executive session. I thank all councilmembers will concur that these are some really outstanding and well experienced lawyers and judicial officers that we considered for this judgeship. And I'd like to move now that the following candidates be designated as our final candidates for interview by the Committee'",
        "'speaker_2': 'of the Whole to fill a vacancy in our Southwest Division Court of King County. And the two persons are long Gibson and Brian Todd.'",
        "'speaker_0': 'Thank you. And so do I call for a voice vote or do I call for a roll call vote was possible. Okay. All those in favor of the two names put forward, Laura Gibson and Brian Todd. Please say hi.'"
    ],
    "Appointment of a West Division District Court Judge.": [
        "'speaker_0': 'Those opposed. Nay, those are the two names. Councilmember, would you now put a motion for the candidates for the West Division? And before you start, because there are two positions here we were we'll have more than two names coming forward.'",
        "'speaker_0': 'So with that, please make your motion.'",
        "'speaker_2': 'Okay. Miss Jones, do we have to delineate between the two positions, or can I just put forth five people for those two positions? I think you need to wait.'",
        "'speaker_0': 'Let's just put it together and then we can figure that out later.'",
        "'speaker_2': 'All right, I I'm going to go by what our chair said, and the five names indicate that they are being considered for filling to empty seats in our west division of the King County District Court. Therefore, I move that the following candidates be designated as our final candidates to be interviewed for two positions that are now vacant'",
        "'speaker_2': 'and the West Division of the King County District Court. The five names are as follows. These are Pat, Love, Sadie, Mary Lynch, Andrew Simmons, Samir Singh, Le and Greg Hara Hira Kala.'",
        "'speaker_0': 'Thank you. The motion is before us. Nice job. All those in favor of the five names put forward for the Seattle district. Please say i. I. Those opposed they. Their names are before us. So I want to thank all 13 of the original candidates for participating in the first phase of the process.'",
        "'speaker_0': 'Our county is very fortunate to have so many qualified individuals, many serving already as pro terms and who are willing to continue to serve their communities as district court judges. Those who were not chosen to be interviewed can continue to develop their judicial skills and experience.'",
        "'speaker_0': 'And I am sure that we will see you again at other vacancies in the court.'",
        "'speaker_2': 'Madam Chair, I want to mention to the public that they are also all still qualified to run for these positions. Once they are advertised the following week.'",
        "'speaker_0': 'That is correct. They may still be able to do that. And then after our decisions, they'll know who they are running against and in which position so they can make that choice should they choose to do so that maybe they'll think we did a fabulous job.'",
        "'speaker_0': 'I think that is all of the business before this committee. Is there anything else, Mr. Wagner, that we needed to bring up?'",
        "'speaker_1': 'No, ma'am.'",
        "'speaker_0': 'All right. With that, this meeting is adjourned.'"
    ]
}