{
    "Appointment of Sam Choi to the Gender Identity and Sexual Orientation Inclusion Task Force.": [
        "'speaker_0': 'Okay. So we'd like to now have Sam Choi, who goes by he him and Christina Fogg, who goes by she her to join us. And I welcome you and I congratulate you on the appointments. And it is the council's responsibility to have you come before us and answer some questions.'",
        "'speaker_0': 'And then we will take action today on moving your names, your appointments to the full council for confirmation of your appointment. And let's take that as Mr. Choi first, who serves as the Training and Technical Assistance Coaching Coordinator for Game City.'",
        "'speaker_0': 'And Jeff, where you going to go over each person's background a little bit.'",
        "'speaker_3': 'I think it's probably best for their appointees to do that, but I can do that for the ones.'",
        "'speaker_0': 'Okay. We'll go ahead and let the appointment. I'm just going there. Usually that's how we do it with the staff report. But Mr. Choi, Sam, would you please provide us a little bit about your background and your reasons for wanting to serve on this task force?'",
        "'speaker_0': 'And welcome.'",
        "'speaker_3': 'Hi. Good morning. My name is Sam. I use him pronouns and like you said, I am the training and technical assistance coordinator at Case City. We are going through a rebranding right now, so we will be changing our name to Seattle's Automated Compliance Center.'",
        "'speaker_3': 'Like I said, I graduated with a psychology degree u dub and I am a first generation queer and trans immigrant and a queer person living in Seattle. And through my work I work with acutely bipoc so queer and trans black indigenous people of color, youth, and we center bipoc youth in all of the work that we do'",
        "'speaker_3': '. And through my work I connect with organizations, hospitals, businesses, whoever to meet their needs and becoming queer and trans competent. And I really hope to bring forth more compassion and care for queer and trans individuals and beyond comprehension.'",
        "'speaker_0': 'Okay. Well, thank you very much. Have you attended one of the meetings yet?'",
        "'speaker_3': 'Yes, I have. I have since April, when our previous executive director, Fred, left, I kind of took over his role in the task force. And so I've attended three meetings so far.'",
        "'speaker_0': 'Oh, good. Yeah. Any thoughts about the meetings and what you're getting yourself into?'",
        "'speaker_3': 'Yeah, I am. I think I'm still opening pieces together, but I understand the critical needs of having this task force of meeting to have various queer individuals in their room to understand and assess and make recommendations to ensure that Kent County as a whole can better support queer and trans rights.'",
        "'speaker_0': 'Well, it appears that you're an outstanding new member of the task force, and it appears like you're really enjoying your work on it thus far after attending three main meetings. So I think you'll do great. Do any of my colleagues on the committee have any questions to ask of San.'",
        "'speaker_0': 'The Council members are. Hello. And good morning.'",
        "'speaker_3': 'Good morning. Thanks so much for volunteering to be on this task force. I'm really appreciate your help. Could you just speak to some of your goals with the task force? What are your priorities? Yeah, I think I kind of spoke about it earlier.'",
        "'speaker_3': 'I work primarily with Bipoc youth in the work that I do currently and I feel like, you know, Bipoc youth are often left out of the conversation. Adult ism is a very critical thing and we do not give a lot of agency autonomy to youth.'",
        "'speaker_3': 'And so I really hope, through my experience working with them, to really center their voices and their experiences. So I am I'm healing from COVID and to really bring their voices and their experiences to the table as well.'",
        "'speaker_3': 'Tam, thank you so much. Yeah.'",
        "'speaker_0': 'Thank you. Are there any more questions? Well, thank you very much, Sam. Again, we'll be taking up a vote on your appointment shortly. And really pleased to have you with us today. And again, congratulations on your appointment. All right.'"
    ],
    "Appointment of Christina Fogg to the Gender Identity and Sexual Orientation Inclusion Task Force.": [
        "'speaker_0': 'And we also have with us Christina Fogg, who has been appointed as well and is the new member of the council staff or council member. DEMBOSKY has just joined us. Good morning.'",
        "'speaker_3': 'Good morning.'",
        "'speaker_0': 'Morning. So, Christine, Christina, would you please go ahead and speak on your behalf and then we'll hear from Council member Tomasky, I believe, as well. And if you could let us know what motivated you to be appointed to the task force and what you hope to work on?'",
        "'speaker_4': 'Sure. Thanks for having me this morning. Yeah. I recently joined Council member Dombroski staff in April. Prior to that, I was a lawyer for 16 years, the last nine of which was at the U.S. Attorney's Office here in Seattle representing the Western District of Washington.'",
        "'speaker_4': 'And my role there was as the coordinator for their civil civil rights program. And I mostly dealt with responding to complaints in the community about various forms of discrimination and violations of federal civil rights statutes. So this particular task force appealed to me because a lot of what I saw in my prior work was, you know, what'",
        "'speaker_4': 'happens when organizations don't have an inclusive culture or policies and procedures and norms and all the things that contribute to a culture of making a welcoming, inclusive place. So I was really excited to be part of something that is addressing those issues in a proactive and systemic way.'",
        "'speaker_4': 'And so I jumped at the opportunity to be that council representative.'",
        "'speaker_0': 'Well, I'm so pleased that you did. You have a terrific background and I know will being bring a great amount to the task force council members to be asking, do you have anything you'd like to say?'",
        "'speaker_2': 'Well, I don't want to kill the nomination.'",
        "'speaker_6': 'Here by messing it.'",
        "'speaker_2': 'Up. But thank you for your willingness to serve, Christina. And I think your background, as you've articulated here with your civil rights experience at the United States Justice Department, will be super helpful. But Christina also has a long history of other service charcoal wells, including a board member and mentor with the Joint Minority Bar Association Association Mentorship'",
        "'speaker_2': 'Program Service with the YWCA as a cooperating lawyer with the American Civil Liberties Union of Washington here in Seattle, and also with the King County Housing Justice Project. So I think her significant experience and her expertize in civil rights will do well.'",
        "'speaker_2': 'I wanted to take this moment to thank you and your office, particularly Jonathan Fowler, who was the prior council representative to the task force. And he's gotten busy with commitments and other obligations. And so his service has been exemplary.'",
        "'speaker_2': 'And Christina is going to be, if approved here today, following in his footsteps to have that council rep there. So that's the background on on why we're having this nomination here. But I would appreciate colleagues support for Christina and the other nominees today.'",
        "'speaker_0': 'Terrific. Thank you very much. Councilmember Jim Baskin. It appears that Christina has another virtue of being very modest, but although sometimes one should be very forthright about all of their accomplishments and attributes. Christina, you seem to have a whole lot of them.'",
        "'speaker_0': 'So I think this is an excellent appointment that's been made. I congratulate you on that and I look forward to hearing from you as you report back to the council on what is going on with this task force.'",
        "'speaker_0': 'I do think.'",
        "'speaker_4': 'That.'",
        "'speaker_0': 'You're welcome. Does anybody have any questions of Christina on? I don't see anyone. Okay with that we will go. And we, the other two have not arrived. So we will go ahead and let's let's both take up all four names.'",
        "'speaker_0': 'People are busy and we get very busy too. So I'd like to have a motion. Councilmember Dombroski, would you like to make the motion?'",
        "'speaker_2': 'Yeah, sure. Thank you so much for all.'",
        "'speaker_0': 'There are four motions you're actually.'",
        "'speaker_2': 'I move that we give a do pass recommendation to motions 2020 2010013014. And I think is 012. This note say here to ten so.'",
        "'speaker_3': 'It's 210 and 0 to 1 zero 0 to 1 10213 in 0 to 1 fourth.'",
        "'speaker_2': 'Okay not to 12 to 11. To 10 to 11 to 13 to 14.'",
        "'speaker_3': 'That's weird.'",
        "'speaker_2': 'Or as the agenda reflects. If we've got that wrong.'",
        "'speaker_0': 'Okay. Are there any questions or comments? I think we will find it before us. Councilmember McDermott.'",
        "'speaker_3': 'Thank you, Chair Wells. I didn't have any questions for any for Sam and Kristina, but I want to express my appreciation to both of them and all four of the nominees for considering today and to acknowledge the role of the importance of the task force to represent the LGBTQ, the queer community in King County, and ensure that'",
        "'speaker_3': 'that voice is present within county government that we're aware of impacts that intentional and unintentional that we may be having in the community and how important it is that King County, our agencies benefit from a established resource for us to be informed and benefit from the conversations and information and experiences of the queer community as we legislate'",
        "'speaker_3': 'and do our work.'",
        "'speaker_0': 'Thank you very much, Councilman McDermott, for that very well stated comment. I couldn't agree with you more. And it's it's tremendous when I look over the whole roster, too, of this task force, very, very impressive individuals, the ones I know, and then the ones that I don't know, but that I have read about.'",
        "'speaker_0': 'And of course, we had them all before us earlier. So with that, if there are no checklist. Yes.'",
        "'speaker_4': 'Thank you. Oh, it's Councilmember Perry.'",
        "'speaker_0': 'I can't remember. I'm still getting used to looking off at the wall for Zoom when being in the chamber. And I somehow missed you. Go right ahead.'",
        "'speaker_4': 'Thank you. I just also want to share on Echo what Councilmember McDermott expressed and that how important it is that people are stepping forward and participating and and and keeping everything. Keeping people aware and asking folks to. To pay attention to the civil liberties of all.'",
        "'speaker_4': 'Recently, in the last six months, we have looked at non gendered language and are working hard on council to refrain from Madam Chair, Mr. Chair and Madam Speaker, Mr. Speaker, and things like this, and instead simply refer to people by their title.'",
        "'speaker_4': 'And it creates more of an egalitarian or not egalitarian, but but a respectful space of inclusion is the intention. So I look forward to hearing the task force's assessment of how we're doing on that and any recommendations for how we might improve as the Council.'",
        "'speaker_4': 'Our reflection of inclusion in the language that we choose to to use on the dais and in public view as well as private. So I just really appreciate all the work and potential work and and folks willing to step forward in this task force.'",
        "'speaker_4': 'Thank you.'"
    ],
    "Appointment of Agaiotupu Viena to the Gender Identity and Sexual Orientation Inclusion Task Force.": [
        "'speaker_0': 'Thank you very much, Kay. With that, our Kirk will please call the roll.'",
        "'speaker_1': 'Thank you. Chair calls Councilmember. Excuse me. Councilmember Balducci.'",
        "'speaker_4': 'And.'",
        "'speaker_1': 'Councilmember Dombrowski.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilmember Dunn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilmember McDermott.'",
        "'speaker_3': 'Oh, hi.'",
        "'speaker_4': 'Councilmember Perry. I councilmember up the grove.'",
        "'speaker_1': 'Councilmember up the growth. Council member Von Reich Bauer.'",
        "'speaker_3': 'Hi.'",
        "'speaker_4': 'Councilman Barzagli.'",
        "'speaker_3': 'Hi. Sorry.'",
        "'speaker_1': 'Okay. Thank you. Council member of the group. Council members. Charlie.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilman or charcoal wells. Circle wells. The vote is nine eyes, zero nose key.'",
        "'speaker_0': 'With our vote, we've approved, I believe, proposed motions. 2020 2021002130214. And what is the fourth 100211? The numbers weren't quite right on our script here. And we will send these motions with the do pass recommendation for the consent agenda to the August 16th Council meeting.'",
        "'speaker_0': 'And for those of you who are listening in and those two candidates who are here, there is no reason for you to appear at that council meeting on August 16th. You will be notified, of course, if you would like to be with us here in the chamber or on Zoom.'"
    ],
    "Regional Operational Plan for Extreme Weather Centers and Disaster Sheltering.": [
        "'speaker_0': 'That, of course, is just fine. Okay. Our next item on our agenda is the motion sponsored by Councilmember Sali Reck, requesting that the executive develop an operational plan for sheltering the most vulnerable King County residents in the event of extreme cold heat or wildlife smoke, which is going on right now in central Washington.'",
        "'speaker_0': 'We were briefed on the proposed motion at our last meeting, and as I understand, we have a proposed striking amendment today. We will hear from council members July, but we have, I believe, Jennie Giambattista with our central staff to provide a short briefing on this item since we had one earlier.'",
        "'speaker_0': 'And also on the striking amendment, we also have Mina Hashimi, Brenda McClusky and Caroline Whalen here from the executive branch to answer any questions if they come up and four members. Just a reminder, we are going until noon today.'",
        "'speaker_0': 'We started half an hour early and I expect we will be able to finish all items. Okay, Jennie, please go ahead.'",
        "'speaker_4': 'Thank you. Councilmember Cole Wells. Good morning. Members of the committee, Jennie. John but Keith, the council staff. I will be discussing the proposed motion 2020 20197, which does begin on page 25 of your packet as a recap of the discussion on July six in CAO.'",
        "'speaker_4': 'The proposed motion requested the executive develop an operational plan for sheltering the most vulnerable residents in the event of extreme cold heat or wildfire smoke. I've updated the staff report to respond to questions from the last meeting. The updates are in blue.'",
        "'speaker_4': 'On page 27, you can see an update from executive staff. They provided more information on the current status and their planning efforts. On page 28, the third of the packet, there's additional information on fatalities and EMS calls from the heat dome.'",
        "'speaker_4': 'And on page 35 of the packet, executive staff note that they will need to assess the budget availability for the work, but they anticipate needing at least one dedicated resource to manage the work. If there are no questions on the underlying motion, I can now go over council members striking an amendment which was developed with executive staff'",
        "'speaker_0': '. Thank you, Jennie. Just one moment. Does anybody have any questions on what Jennie has briefed us thus far? I hope you all had the opportunity to to read over the additions to the staff report that reflected the executive branch's comments from the last meeting.'",
        "'speaker_0': 'Okay. And before you start, Jenny, going over the amendment. Councilmembers, I do you have anything you want to say at this point is wait till after Jenny's through.'",
        "'speaker_3': 'After Jenny, please. Thank you.'",
        "'speaker_0': 'Okay. Thank you, Jenny. Go right ahead.'",
        "'speaker_4': 'Okay. Thank you. Councilmember. The striking amendment is on page 43 of the packet. I have also included a version showing changes and that's on page 53 of the packet. There's also a title amendment as well. So starting with the striking amendment on page 43, I'll walk through some of the substantive changes.'",
        "'speaker_4': 'The most substantive change is the body of work is expanded to include planning for disaster shelters, not just extreme weather shelters. Executive staff requested this change because they noted that if they were bringing together all the stakeholders to do this planning work, it made sense to discuss emergency sheltering overall, given that they would be talking about sheltering'",
        "'speaker_4': 'for particular types of emergency. The next substantive change is the striker removes the date by which the executive shall begin to offer expanded sheltering. The next change is the requirement for the executive to conduct community outreach in low income communities and unhoused communities in unincorporated King County, to gather information on the location and features that would result'",
        "'speaker_4': 'in the highest shelter utilization. It's changed, and it's changed such that the outreach to unhoused communities is removed, and instead such outreach is encouraged by the Regional Homelessness Authority. Additionally, the request that such outreach also seek to identify other community needs in responding to extreme weather shelters is also removed.'",
        "'speaker_4': 'The striker adds language to clarify and provide details on the information requested for those King County facilities that are currently serving as disaster and extreme weather shelters and those that could do so with improvements. There is also language added to clarify and provide details on the requested information for non county owned facilities.'",
        "'speaker_4': 'And the information on whether long term care assistance facilities and family care homes have air conditioning is now requested only if it is available from the State Department of Social and Health Services. The request for a plan to offer hotel vouchers that was part of the motion as well as introduced is changed so that it's now a'",
        "'speaker_4': 'request to consider with the Regional Homelessness Authority and City Partners the use of vouchers for accommodations, or they use activities for the most vulnerable residents. And the due date for the operational plan is changed from February 28th, 2023 to June 30th, 2024.'",
        "'speaker_4': 'Councilmember. I would also note that there's a title amendment so that the title conforms to the strike. So those are the major changes in the strike, or I'm happy to answer questions and as you indicated. Councilmember Cole. Well, we also have executive staff here as well.'",
        "'speaker_0': 'Thank you, Jenny, for your outstanding staff report, as always. And we do have a question from Councilmember Bell. Did she.'",
        "'speaker_4': 'Sorry. That was an error. I apologize. I'm good.'",
        "'speaker_0': 'Okay. No question. Are there any questions? Council member Perry.'",
        "'speaker_4': 'Thank you, Chair Coles. I appreciate that. I am wondering, you know, that originally or in our last discussion about this, I had mentioned language specific to providing equipment heating, cooling and air filtering equipment. So the language is outreach.'",
        "'speaker_4': 'Efforts should also seek to identify other community needs in responding to extreme weather events. And after.'",
        "'speaker_0': 'The whole.'",
        "'speaker_4': 'I'm just wondering if there's a place in this to call those specific things out, because part of the issue is people not a big part of the issue with the deaths was people not having access to air conditioning, cooling, heating and air filter filtration areas that are not able to move to different spaces.'",
        "'speaker_4': 'So so people can locate and if they're living outside, that hasn't has a specific focus in in making sure that folks get to appropriate shelter if they're living inside and they don't have heating, cooling or air filtration systems as senior citizens, as of folks living with disabilities, different kinds of experiences who could benefit greatly from those those'",
        "'speaker_4': 'specific kinds of equipment. I'm just wondering if it can be called out more specifically or if there's just if we're wanting to keep it that open and that that that made. Councilmember Perry, if I may, just clarify the language specifically requesting information on other needs that language is and struck.'",
        "'speaker_4': 'So okay. So and so with that clarification, I will turn I think it would be appropriate to ask the executive staff what their plans are in addition to conducting outreach on the location and features that would result in the higher shelter utilization.'",
        "'speaker_4': 'That to ask the executive staff what additional. Information they're going to be querying on in terms of the needs of the community? Well, exactly the question I would like to ask then. There we are. That is a good.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'So we do have Caroline Whalen from a director of the Department of the Executive Services and then we also have OPM director Brendan McCluskey available as well. Sharon Wells If you if you would. I don't know how you would like to address that, but I would that would be great.'",
        "'speaker_0': 'I Council Member Perry. I will leave some room here right now if either Director McCluskey or Director Whalen would like to respond. I would like to remind people we are in a tight time frame, so I appreciate having any questions or remarks being made as brief as possible.'",
        "'speaker_0': 'So anybody from our executive staff would like to respond.'",
        "'speaker_4': 'Thank you. Chair Caldwell. So I will just say briefly that we are interested in doing a needs assessment as we do outreach. We are expecting to get a report from the City of Seattle of some outreach work that they did.'",
        "'speaker_4': 'My understanding is one of the findings is that people will say, yes, they want government to supply.'",
        "'speaker_1': 'Cooling centers are warm, wet, you know, heating centers, but they want it for other people. They really want to stay where they are.'",
        "'speaker_4': 'And I really understand, Councilmember Perry, what you're saying is some people can't move. And so what is it that they need? So we will be doing a needs assessment.'",
        "'speaker_1': 'And doing our best to accommodate, you know, our residents and visitors. And I don't know, Brendan, if you want to add to that, if that would be okay with the chair.'",
        "'speaker_0': 'Okay. Go right ahead.'",
        "'speaker_3': 'Yeah. Thanks. I don't know that I have much to add to that. I think that, you know, we want to take a very comprehensive and complete approach to this so that we want to look at every potential option that's out there.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And I'd again like to say, as I did at our last meeting, there are many long term health care facilities and resident facilities that do not have air conditioning. My mother and rather a friend of mine was in one of those before she died, no air conditioning and it was really, really challenging.'",
        "'speaker_0': 'So I'm hopeful that this issue will also be addressed. Okay. Are there any other questions? K Council member C Yeah, council members. SA Hello, would you like to make a motion?'",
        "'speaker_3': 'So move chair Caldwell's.'",
        "'speaker_0': 'Okay. We have a motion for proposed motion 2020 20197 before us. We do have a striking amendment which has been explained. Would you like to move that? Council members. Hello.'",
        "'speaker_3': 'So move. Check.'",
        "'speaker_0': 'Okay. Thank you. And would you like to speak to that council members?'",
        "'speaker_3': 'Thank you. Absolutely. I think making good policy as council members requires that we work collaboratively with the executive branch. They're the ones who will implement our legislation, and they are also subject matter experts, whereas I'm not. So I fully support the striking amendment and making it more implementable and in the spirit of collaboration.'",
        "'speaker_3': 'I want to thank Director McClusky, Director Whalen, Rena Hashemi, Karen Gill, King County Regional Homelessness Authority, who have been super responsive and collaborative, like I said before. So I, I encourage your support on this striking amendment.'",
        "'speaker_0': 'Thank you. Council Member And does anybody else have anything to say on this or have a question?'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Councilmember Dombroski.'",
        "'speaker_2': 'I just want to take a moment to thank Councilmember Xilai for this thoughtful and forward looking piece of legislation that's going to, I think, become increasingly necessary as our climate extremes present themselves. And it's a longer term project, maybe with some shorter term deliverables, but it's really good and thoughtful work, and I wanted to commend him publicly'",
        "'speaker_2': 'for it.'",
        "'speaker_0': 'Thank you, Councilmember.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Councilmember building to.'",
        "'speaker_4': 'Thank you this time was intentional. I also want to say I think in looking through the staff report and listening to discussion, this fits well in with, I think, a multi-tiered plan because we have to work in the short term and the long term.'",
        "'speaker_4': 'The executive's study appears to look at ways to mitigate heat, which is a very big and long term project. And councilmembers are always not in talks about sheltering people when because we are going to have extreme heat events.'",
        "'speaker_4': 'And I just really wanted to point out that this morning Craig is already in process of activating their response tier network approach to the projected coming here. That looks like we're going to get up into the nineties next week.'",
        "'speaker_4': 'And so we have we have.'",
        "'speaker_3': 'Work going on at.'",
        "'speaker_4': 'All scales. And then now in the short term, in the long term and just for those anyone who might be watching what the message this morning said is that the Tier one response will make funding for cooling supplies available to homeless service providers up to $2,000.'",
        "'speaker_4': 'And if if you are someone who provides emergency shelter, day center or outreach, you should reach out to KCR today because the this this money's available now.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. That's very helpful information, especially given that from what I've heard, the Puget Sound area here has the least amount of air conditioners of any major equivalent American city and and metropolitan areas. So we're going to be expecting we'll have some hard times next week, everybody, but we worry particularly about our most vulnerable and as'",
        "'speaker_0': 'citizens, residents. Okay. Are there any other comments? Okay. All in favor of striking amendment one. Please say I. I hear any polls say now, Kate, the amendment has been adopted. We now have title amendment one, and that is to correspond with the changes made in striking Amendment one.'",
        "'speaker_0': 'Any questions? All in favor of title. Oh, we have to have a motion to move it.'",
        "'speaker_3': 'Kind of move.'",
        "'speaker_0': 'Thank you. Councilmembers. Hello. All in favor of title amendment one. Please say I, I. Any no's? Please say no. Okay. With that, we have a title. Amendment one has been adopted and we now move on for a proposed motion.'",
        "'speaker_0': '2020 20197 as amended. I would like to just say that I as well I'm very appreciative of Councilman Rizal I bringing. Forward. It's, I believe, really improving what the executive had already been working on and brings a lot more public awareness to it when we have this.'",
        "'speaker_0': 'So Councilor Basile, I do have any final comments.'",
        "'speaker_3': 'In addition to the people I already thanked, I want to thank our legislative branch teammates Jenny, Jim Batista, Jake Tracy, Rosa Mai for all their great work on bringing this vision into a reality. Thank you, everyone.'",
        "'speaker_0': 'Okay. And I should have asked if anybody else had any comments. Okay with that. Would the clerk please call the roll?'",
        "'speaker_1': 'Thank you. Chair calls. Councilmember Belushi.'",
        "'speaker_6': 'Hi.'",
        "'speaker_1': 'Councilmember Dombrowski. Councilmember done.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilmember McDermott.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Councilmember Perry. I. Councilmember up the grove i. Councilmember Yvonne Reich Bauer. Councilmember Zala.'",
        "'speaker_0': 'I chair Caldwell's I.'",
        "'speaker_1': 'Turco. Well, as the vote is eight eyes zero nose with Councilmember Yvonne Reich Bauer excused.'",
        "'speaker_0': 'Kay thank you. With our vote we've approved proposed motion 2020 20197 as amended, and we will place this item on consent unless there's concern on that and we will send it with the do pass recommendation for the consent agenda to the August 16th Council meeting.'",
        "'speaker_0': 'Unfortunately, King County TV is having some technical issues, so we will take a brief recess. For how long do you expect? 5 minutes. So we will be on a five minute recess. Thank you. Okay. It appears we are ready to go.'",
        "'speaker_0': 'So I will call the meeting. The results over concluded and we will be back in our meeting. Now the next item on our agenda is the first of two panel briefings we are having today on the topic of preventing gun violence.'"
    ],
    "Feasibility of a Voluntary Safe Firearm and Ammunition Return Program.": [
        "'speaker_0': 'Good Eleuthera excuse me are Luther Eilish and Brandon Shell. Thank you. Thank you. Thank you. Okay. We will now go on to our last agenda item for today is a motion requesting the King County executive assess the feasibility of establishing a year round voluntary safe firearm and ammunition return program within the King County Sheriff's Office.'",
        "'speaker_0': 'This is proposed motion 2020 20221 introduced by Councilmember Dombroski. And we do have Andy McLeod to. Rufus. That will start on page 120. And Jesse Anderson, King County undersheriff, I believe, was joining us. And he is here as well.'",
        "'speaker_0': 'And we were going to take up legislation at our next meeting, August 17th. And I hope that there will be more that will be introduced by then, that I know that Councilmember DEMBOSKY has been so eager to get this going because it is so important.'",
        "'speaker_0': 'And I'm wondering if you want to say a few things before we hear from Andy for a briefing. Council Members.'",
        "'speaker_2': 'Dan Bass Thank you, Chair Caldwell's and thank you, colleagues. I want to start by thanking the panelists for their courage and compelling stories this morning. And I ask for their forgiveness. I had to personally leave the dais and listen from the side room because it was just extremely difficult for at least part of the presentations.'",
        "'speaker_2': 'But I was paying close attention, and one of the things that we heard repeatedly from the guests today was the devastating results that are consistent with the overwhelming statistics that result from having firearms in a home. You know, three quarters of deaths in Washington are suicide.'",
        "'speaker_2': 'And the research shows that when you have a firearm in the home, the risk of death and injury is exponentially off the charts compared to homes that don't have firearms. One recent study in California focusing just on handguns.'",
        "'speaker_2': 'Not long guns, but handguns showed that homes with a handgun were three times more common to have deaths than than those without. And of course, the impacts are disproportionately felt by women who are, frankly, the victims of intimate partner violence and people of color as well.'",
        "'speaker_2': 'So this legislation, Jericho Wells, which you have co-sponsored along with councilmembers Angela and McDermott, is a fairly straightforward motion that as our sheriff's department to establish and promote a year round voluntary firearm and ammunition turnover program. These are done in other departments, including the city of Seattle has one today.'",
        "'speaker_2': 'I think it's a little known, but in discussions with the sheriff's office and I want to thank Undersheriff Anderson for being here and a chief of staff, Ellenbrook. You can turn a firearm over, but out of the sheriff's office or some of them.'",
        "'speaker_2': 'But it's this legislation would make it more systematic, more widespread and more advertised. It's a motion that asked the department to look at the feasibility of developing a program, what it would cost, how it would be promoted and and really provide that easy opportunity.'",
        "'speaker_2': 'The vision here was to use the power of our King County Sheriff's Office with its geographic reach in our unincorporated communities, both rural and urban, as well as our ten or so contract cities where we provide service to see if we can make it easy.'",
        "'speaker_2': 'When somebody determines that, for whatever reason, they no longer wish to have a firearm in the house, or maybe they come into possession of one through inheritance or otherwise. Don't want to have it around. They're aware of the risks.'",
        "'speaker_2': 'You know, we have extreme risk protection orders, which we're studying and have stood up here. That's a fairly challenging program. This is in some ways a simpler way. Bring it when you can bring the gun and turn it in.'",
        "'speaker_2': 'There are some issues that need to be worked through that the sheriff's office would do in this legislation. In terms of the terms of a turnover, do you have to give your name or not? You know what? What would we do with the firearm with respect to obligations to to comply with federal law and and, of course'",
        "'speaker_2': ', disposal and things like that. So this is not and we have an amendment here today that we've worked on with the sheriff's office. It's not directive. It it asked the sheriff's office to come up with a program and gives them the space and flexibility to do that.'",
        "'speaker_2': 'We don't put a timeline on it chair calls, but it would be my hope that the department could work and prepare to come back to us in the budget process to let us know how it could be stood up and and what it would cost in the amendment, which Andy will give us a briefing on.'",
        "'speaker_2': 'We have added a little more flexibility for them and also requested an additional item, and that would be to explore the feasibility of one or more early community buyback slash turn events. They did this a number of years ago here and had some 800 firearms returned.'",
        "'speaker_2': 'The city of Kirkland. Which includes councilmember mildew douches and his council districts, recently did one with their department, and almost 80 firearms were turned over in a day. So there is a, I think, a demonstrated need an interest in the county for this, and we've got that there.'",
        "'speaker_2': 'So there's a little set up for it. Thank you, General Wells.'",
        "'speaker_0': 'Thank you, Councilmember Baskin with that. And the clerk will go ahead and give the briefing.'",
        "'speaker_1': 'Good morning, Andy McLeod. Council central staff at the staff report for this item begins on page 120 of your meeting packet. Proposed Motion 2020 20221 request would request that the executive assess the feasibility of establishing a year round voluntary firearm and ammunition return program within the King County Sheriff's Office.'",
        "'speaker_1': 'Voluntary firearm return programs allow individuals to relinquish their unwanted firearms, ammunition, explosives or other destructive devices to government entities. Usually, law enforcement programs can be one time limited events or ongoing services. Program policies vary widely across jurisdictions, but commonly include anonymous or no questions asked participation, financial or other incentives for IT.'",
        "'speaker_1': 'Participants. Partnerships or community oriented partnerships with community organizations. Delivery of unwanted firearms to a secure location or requested firearm pickup by program employees. And the destruction of all relinquished items. Jurisdictions in King County have both a history of one time firearm buyback events and ongoing firearm return programs.'",
        "'speaker_1': 'And these are summarized on pages 120 and 121 of the. With respect to King County, the King County Sheriff's Office, General Orders Manual includes policies and procedures that allow individuals to drop off unwanted weapons during normal business hours at the King County Sheriff's Office, locations equipped with secure evidence storage or another location upon individual's request and with'",
        "'speaker_1': 'the supervisors approval once relinquished, all firearms are taken for safe storage until they are held and can be condemned, can be destroyed at a facility in Spokane, which, according to the King County Sheriff's Office, generally occurs once or twice a year.'",
        "'speaker_1': 'Unwanted ammunition is also accepted, according to the sheriff's office, though it's not explicitly stated in the general order manual. King County Sheriff's Office does not provide currently any and any incentives, financial or otherwise, to county residents who relinquish unwanted firearms or ammunition to the sheriff's office.'",
        "'speaker_1': 'As I noted earlier, proposed motion 2020 20221 would require that the executive assess the feasibility of establishing a year round voluntary firearm and ammunition return program within the Sheriff's Office. The program, as assessed by the executive, should include a process by which any individual may relinquish any firearm or ammunition to any location at any time.'",
        "'speaker_1': 'Any sheriff's office location. A process by which an individual may request the sheriff's deputy or otherwise employee, other authorized employee to retrieve unwanted firearms or ammunition from a specified location. The destruction or disposable of all unwanted firearms and ammunition voluntarily relinquished, and the provision of monetary or other incentives to encourage participation in the program.'",
        "'speaker_1': 'And finally, the proposed motion further requests that the executive assess whether the voluntary firearm and ammunition return program could be developed and implemented in collaboration with jurisdictions throughout King County. And as Councilmember DEMBOSKY noted, there is an amendment, and we are joined by Undersheriff Anderson in Mark, L.A. Brooke, with the sheriff's office.'",
        "'speaker_1': 'I'm happy to brief the amendment now and four questions.'",
        "'speaker_0': 'First of all, let's hear if any of our council committee members has a question. I'm sure. Yes, Councilmember Dunn.'",
        "'speaker_3': 'Thanks, Andy. Thanks for the briefing there. The question I have is I understand that the motion would give the sheriff's office the option of a perhaps being a buyback program as opposed to a voluntary gun return program. I'm less worried about that because ultimately we would decide here what the buyback program would look like.'",
        "'speaker_3': 'The question I have is, what does it speak to about the lists that the sheriff office might make or keep when somebody comes and returns a gun or ammunition? As you probably remember, there was a voluntary bump stock return program and then later on a list was capped and then the public disclosure request was made of the'",
        "'speaker_3': 'personal information who had done that and became quite, quite the dust up. So I'm just curious what the legislation speaks to on that issue as it is right now.'",
        "'speaker_1': 'Thank you. Council member Dunn, I believe as drafted, the legislation does not speak specifically to that list, but does give some deference to the sheriff's office to, I think, respond to your question.'",
        "'speaker_0': 'Okay. And then we do have King County Undersheriff Jesse Henderson. Would you like to make any comment on that?'",
        "'speaker_3': 'Yes, I would like to thank for being.'",
        "'speaker_0': 'Here, too.'",
        "'speaker_3': 'Thank you. Thank you for having me. Counsel, I appreciate the opportunity to come to you and talk about our support for this program as brought up. We've had policy in place for some time, and I like to emphasize that the overwhelming majority of guns that we bring into our custody under these surrender type programs have been court'",
        "'speaker_3': 'ordered surrenders. So we need to do a better tracking of the times that we voluntarily when community members voluntarily turn over firearms. And so we were going to we're going to build a system in place to be able to track that information as well.'",
        "'speaker_3': 'And I so totally support the need to get out there and market this better. So we so community members know that they have this option and they can go to our designated facilities or occasionally, if they're not able to provide that have that transportation to one of our facilities, that we could go out to the home and'",
        "'speaker_3': 'collect that firearm. And so we want to make sure that we're doing this in the safest way possible. And so we will build into our policy, our existing policy, some additional information that provides guidance to our deputies to be able to take these weapons into custody and put them into our evidence for him for disposal.'",
        "'speaker_0': 'And thank you very much. And we have Mark Labrecque, who is chief of staff for the King County Sheriff's Office. Mark, do you have a comment? Just a.'",
        "'speaker_3': 'Quick comment. Yes. Good morning. And just for the record, Mark Holbrook, chief of staff for the sheriff's office, comes over down. Just to answer your question, we actually had an opportunity to chat with Councilmember Dombrowski about this issue yesterday.'",
        "'speaker_3': 'And I think there obviously, the goal of a program like this is to be able to take in as many firearms as possible and concerns from folks who might be turning those in about the anonymity of that. So I think we absolutely recognize that, and I think we want to make sure that when we come back with'",
        "'speaker_3': 'the report on this, talk about what the options are in that space to ensure that anonymity. I think a question we had talked about, we have not settled it, but came up from one of our captains was, you know, is is there a possibility of wanting to at least understand if a weapon has been used in a'",
        "'speaker_3': 'past crime, not for the purpose of obviously following up with the person who turned it in, but just to recognize that that weapon has been identified and is, you know, our firearm has been identified and taken sort of out of service.'",
        "'speaker_3': 'So we're going to look at that and come back with how we can do that. But I think we're acutely aware of how do you manage names, a process, ensure anonymity, particularly with public records requests. Can I just just just finish real quick on that?'",
        "'speaker_3': 'Thanks, Madam Chair. Mike, I want to support this. I think voluntary gun return programs are good. We can argue about the effectiveness of gun buyback, because I ran President Bush's national effort to fight gun violence. And at that time, there really wasn't any efforts to gun buyback programs work per se.'",
        "'speaker_3': 'But we do need an option for people to voluntarily give away a gun. And there's a bunch of reasons why they might they might inherited a house. They might have somebody in their house has become emotionally unstable and they want to return a gun.'",
        "'speaker_3': 'There's a lot of good reasons why it should happen. The biggest deterrent to involuntary gun returns will be whether or not somebody's name is going to be put on a list somewhere. And so that's a concern I have.'",
        "'speaker_3': 'And, you know, court ordered returns are one universe individuals who are just kind of want to get the house out of their gun, out of grandmother's house or wherever, and just get get rid of it, because that's not their thing.'",
        "'speaker_3': 'That's kind of where I hope I hope you're sensitive to. And I if you are sensitive to that and I think I can support this today, but I just want to I want to put a face on it for for you folks, where you would see this program become less effective moving downstream.'",
        "'speaker_0': 'Any comment on that? Councilmember Domanski.'",
        "'speaker_1': 'Or.'",
        "'speaker_2': 'I'll defer to the expert, Undersheriff Anderson, and then I'll make a statement of legislative intent, as.'",
        "'speaker_0': 'We still do need to hear about the striking amendment. Go right ahead.'",
        "'speaker_3': 'I agree with the anonymity of turning in firearms. So we would have a system in place that you could show up at a worksite or call one of us to come out and obtain that weapon without needing to provide your name.'",
        "'speaker_3': 'Now, one of the scenarios we talked about, or I mentioned briefly during our discussion other day is that if you're a witness to a crime and you want to turn over a weapon that may have been involved in that crime, probably not going to be able to turn that over anonymously.'",
        "'speaker_3': 'We would have to work through some of those. But generally speaking, under the program, you could show up at one of our precincts and turn over that weapon and be able to walk away knowing that you're not your name's not going to end up on a list somewhere.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Councilmember.'",
        "'speaker_2': 'Thank you. Chuckles. And I'll just say, from the legislative intent perspective and the language in the motion, it is consistent with Undersheriff Anderson's views and position to make this effective and preserve folks anonymity, if you will.'",
        "'speaker_0': 'Thank you. Let's go on now and hear from and our clerk to I mean, our policy analyst coordinator to about the striking amendment.'",
        "'speaker_1': 'Thank you, Councilmember. Actually, Councilmember Dombroski did a great summary of it. And what it would do is it will clarify that the request is to evaluate the assessment of the feasibility of a program and the original language. It said it specified which tribes that wants more time.'",
        "'speaker_1': 'The amendment would clarify that the request is to evaluate the feasibility of a voluntary safe firearm ammunition program. The original language specified what could potentially be included in the program in the amendment would say These are things that should be considered during the assessment, and so it changes it from what should be included in the program to'",
        "'speaker_1': 'what they could be conclude included in the assessment. And then, as Councilmember Taberski noted, two additional items as part of that evaluation were added, which is the gun buybacks and potential cost to administer the program. Okay.'",
        "'speaker_0': 'Thank you very much. Councilmember Jim Bass, would you like to move the first of all the legislation and then the striking amendment?'",
        "'speaker_2': 'Sure. Thank you. Chair. Coel's I move adoption or that we give a do pass recommendation that is to motion 2020 20221k and I move adoption of amendment one which has been described.'",
        "'speaker_0': 'Okay. The motion has been made for the proposed motion and also for this break amendment or amendment one. Are there any questions or comments on this striking amendment? Amendment one. Councilmember two I don't see any questions. Councilmember Dombroski, would you like to speak.'",
        "'speaker_2': 'Just briefly on Amendment one? It says and he described, but I want to thank the sheriff's office, including Undersheriff Anderson and Chief of Staff Ellenberg, for working with us to refine this and our staff for getting it into order.'",
        "'speaker_2': 'And just to be clear, it removes kind of the directive language which was in the original motion. Just by way of example shifts that to assess whether these elements should be included in the program. And that's consistent with the original intent of legislation to defer to our experts in developing this more enhanced and robust program by way'",
        "'speaker_2': 'of example. Undersheriff Anderson said, Well, you've got in here include in the program a requirement that we go to somebody, residents or placements to pick up a firearm. There's a lot of danger involved in that. We may or may not want to do that.'",
        "'speaker_2': 'Or if we do it, it may want to be under certain conditions. So the amendment here would say, should that kind of element be included? And then in addition, we added the tell us what you'll need to run it from a budget perspective and look at a couple of jump start, you know, look at some of these'",
        "'speaker_2': 'early buyback events to see if that could help. So that's what it does. And I encourage members support and I should let the sheriff's office say whether or not they support it on the record by themselves without me speaking for them.'",
        "'speaker_3': 'Yes, we support that.'",
        "'speaker_0': 'Excellent. Thank you very much. And thank you both for being with us today. Any other questions or comments before we take a vote on Amendment one? Okay. All in favor of Amendment One, please say.'",
        "'speaker_2': 'I, i.'",
        "'speaker_0': 'I any opposed? Say me could. The amendment has been adopted and we now have before us propose motion 2022 0 to 21 as amended. Anything final that anybody would like to say?'",
        "'speaker_2': 'Councilmember Dombroski Well, I want to thank my colleagues and for their support, hopefully of the motion and thank the co-sponsors. You keep saying it's my legislation turtles, but it really is. Yeah, I've been here now in just over nine years.'",
        "'speaker_2': 'And one of the things that is inspiring, we often have our disagreements, even about things we generally agree about. But on this issue, gun safety and gun violence prevention, this council works extremely well together and is aligned to a great degree.'",
        "'speaker_2': 'And I really appreciate the co-sponsors, council members, ally and yourself corrals and Councilmember McDermott as evidence of that. And others, of course, are welcome. Councilmember Dunn, who has a great deal of expertize from his federal service on this, is correct that these programs aren't a panacea.'",
        "'speaker_2': 'The studies show that they can they can be helpful, but it takes a whole package of things. And so I don't view this Chair Caldwell's and colleagues as something that will solve this issue. But I think it can save lives.'",
        "'speaker_2': 'I think it can save lives by reducing the number of guns that are out there, because we know that, again, guns in homes dramatically increases the risk to folks living in those homes. And so if we give folks the opportunity when they're ready or interested to turn over a firearm, I think it follows logically that we reduce'",
        "'speaker_2': 'the risks associated with having the firearms in the home. That's the basic thrust of it, and I think it's part of a big package of work that we've done for years here, working together and will continue to do.'",
        "'speaker_2': 'And I really appreciate our sheriff's office engagement on it and willingness to help us develop a more robust program for the safety of our community, their core mission. Thank you.'",
        "'speaker_0': 'Thank you. And thank you for introducing us. And of course, guns can be stolen that are out there, too. I'm okay with that. Will we please have the the card called the rule.'",
        "'speaker_4': 'Councilmember Perry. Chair.'",
        "'speaker_0': 'I'm sorry I missed you. I was looking. It's hard to see those hands raised sometimes. Councilmember Perry.'",
        "'speaker_4': 'It is hard to see them. Thank you. Chair COLWELL So I would just like to add my name as as a co-sponsor to this. I think that's a really great movement forward. And I and I agree also with Katzenjammer down on anonymity that it is critical, critical that we have the anonymity to allow guns to be removed'",
        "'speaker_4': 'from the hands of those who intend to do harm to themselves or others. Thank you.'",
        "'speaker_0': 'Thank you. And with that will occur. Kirk, please call the roll.'",
        "'speaker_1': 'Thank you for your calls. Councilmember Bell Dickey, I. Councilmember Dombrowski.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Dunn. All right. Councilmember McDermott. Councilmember mcdermott now. Councilmember Perry, i. Councilmember up the grove. I. Councilmember Yvonne Reich. Power.'",
        "'speaker_4': 'I. Council members. Charlie. I charcoals.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Charcoal was about as eight eyes with Councilmember McDermott. Excused.'",
        "'speaker_0': 'Okay. Thank you. With our vote, we have approved to propose motion 2020 20221 as amended. Hopefully, Councilman McDermott can touch in and be able to record have his vote recorded. He is a co-sponsor. And unless there is opposition, we will send this motion with the do pass recommendation expedited to the July 26 meeting.'",
        "'speaker_0': 'Okay. Thank you. That concludes the items on our agenda. I had said we would be through by noon. We've just missed that by about a minute. And any I don't believe any technical difficulties stop council members from voting.'"
    ]
}