{
    "Feasibility Study for Waste to Energy Facility versus Waste Export by Rail.": [
        "'speaker_0': 'The October 21st meeting minutes are before us, so no discussion. All those in favor, please say I opposed. Nay, the ayes have it. The minutes are approved. That takes us to the first report on today's agenda, which would acknowledge receipt of a feasibility study related to the options for long term disposal of the region's waste.'",
        "'speaker_0': 'Comparing the waste energy facility to waste export by rail. As many of you know, the region's landfills in Sewer Hills is projected to close at some point in the next 20 years. The study in front of us today, conducted by consultant, provides cost and other estimates to help the county plan for the next disposal method after the'",
        "'speaker_0': 'ultimate closure of Cedar Hills and will begin to this discussion with the staff report from Teal Rose. Good afternoon.'",
        "'speaker_4': 'Good afternoon, Mr. Chair, members of the committee. For the record, Tara Rose Council staff the materials for proposed motion 2019 0429 begin on page five of your packet. The proposed motion would acknowledge receipt of a feasibility study, as the Chair mentioned, and I'm going to begin my remarks with a bit of background, but spend most of my'",
        "'speaker_4': 'time focused on the findings of the feasibility study in a few key areas. Turning now to page six of your packet. King County's Solid Waste Division operates a regional solid waste system for the unincorporated area and 37 partner cities who have signed in our local agreements that this system includes one remaining local landfill, the Cedar Hills Regional'",
        "'speaker_4': 'Landfill, a 920 site located in Maple Valley, which is owned and operated by the county and which has served as the final disposal location for the region's mixed municipal solid waste since 1965. This past spring, the Council approved the 2019 Comprehensive Solid Waste Management Plan, and this plan directed further development of the Cedar Hills landfill to maximize'",
        "'speaker_4': 'disposal capacity instead of the other options considered at the time of a waste to energy, facility and waste export by rail. The adopted 2019 2020 biennial budget included funding for landfill development, capital projects and the Solid Waste Division is currently conducting a State Environmental Policy Act process to evaluate three engineering options to develop Cedar Hills for additional'",
        "'speaker_4': 'capacity. Executive staff indicate that based on the three development alternatives being considered and the current tonnage forecast, Cedar Hills is expected to reach capacity sometime between 2035 and 2041, because the current in our local agreements with the partner cities obligate the county to dispose of the region's waste through 2040.'",
        "'speaker_4': 'And it is not yet known the exact year when Cedar Hills will reach capacity. An alternative waste disposal strategy will need to be identified given the lead time associated with implementing the next disposal method. While the adopted Comprehensive Solid Waste Management Plan directed the maximization of Cedar Hills, it did not specify the next disposal method.'",
        "'speaker_4': 'After the ultimate closure of the landfill in the 2019 2020 Biennial budget, the Council directed the Office of Performance Strategy and Budget, or PSB, to issue a request for proposal and managing contractor to conduct a study evaluating the feasibility of either a waste to energy facility or waste export by rail as the county's next disposal method, including'",
        "'speaker_4': 'in that budget, is the proviso that requires the feasibility study to, among other things, review the county's projected waste forecast, as well as provide estimates for the costs and environmental impacts of both options with the study to be transmitted to the Council by October 4th of this year.'",
        "'speaker_4': 'The full text of the related expenditure, restriction and proviso can be found on pages seven and eight. Now moving on to the bottom of page eight to the analysis section of the staff report. And I will just note before I begin for the committee that waste to energy is a specialized technology.'",
        "'speaker_4': 'And so my remarks will focus on the findings and assumptions contained within the study. But for things that are not explicitly mentioned, I will likely have to follow up and confer with the executive staff and the consultant. So with that said, I'll offer a bit of just process information.'",
        "'speaker_4': 'PSP issued an RFP earlier this year and selected Arcadis as the consultant to perform the work requested by Proviso. The resulting feasibility study with the motion in front of the committee would acknowledge the receipt of the feasibility study, and that was transmitted to the Council on October 4th.'",
        "'speaker_4': 'And now I will begin to dove into some of the findings. So the proviso required the consultant to review the factors that may affect the county's future waste tonnage forecast and analyze how different assumptions could affect the forecast as well as include a range of estimates.'",
        "'speaker_4': 'The consultant reviewed the Solid Waste Division forecast that was prepared in February 2019 and developed to waste tonnage forecasts representing a high and low bound over a 50 year planning period. These are based on a combination of the county's forecast data, as well as population projections from the Puget Sound Regional Council and per capita waste generation estimates'",
        "'speaker_4': '. Executive staff indicate that the consultant used population as the major variable because it reduces the number of assumptions to project out over a long period of 50 years. The footnotes at the bottom of page nine describe the two forecasts in more detail, if you are interested.'",
        "'speaker_4': 'Table one on page ten provides the estimated waste generated in a few key areas under each developed forecast. And just for context. Approximately 931,000 tons of waste were disposed at Cedar Hills in 2017. So I'm now moving ahead to pages ten and 11 of your packet, which provide a high level summary of the consultant's findings in a'",
        "'speaker_4': 'few key areas. I know. Earlier. The Feasibility Studies study considers two options for long term disposal a waste to energy facility, where the region's waste would be directed to a facility where combustion would occur, and a controlled furnace system that generates electricity for use either at the facility or where excess electricity may be able to be sold'",
        "'speaker_4': '. Ashes generated at the bipod product, which may be directed towards re-use opportunities or landfill. And then the second option considered is waste, export, and where the region's waste would be exported by rail to an out of landfill. Two landfills were considered under the study, one located in eastern Washington and the other in eastern Oregon.'",
        "'speaker_4': 'The remainder of the staff report identifies each of the proviso requirements and summarizes the consultant's findings for each of the requirements. But as I noted earlier in my remarks, in the interest of time and based on the historical interests of the Council, I'm going to focus my remarks in three areas the estimated implementation timelines, the estimated costs'",
        "'speaker_4': ', and the modeled greenhouse gas emissions for both long term disposal options. So the consultant's conclusions in these areas are summarized on table two on page 11. And I'll begin with the implemented the potential implementation schedule. The feasibility study estimates an implementation schedule of 8 to 11 years for waste energy and 3 to 6 years for waste export'",
        "'speaker_4': 'by rail. Additional detail regarding the potential timelines can be found later in the staff report. However, I am just going to summarize it here since we have the table in front of us. The consultant notes that the citing and permitting process for waste energy largely account for the difference in the estimated implementation time needed.'",
        "'speaker_4': 'According to the study, the 11 year upper estimate allows for up to two years of delay for permitting or siting issues. The lower estimate of eight years assumes no significant regulatory hurdles or public opposition to the project, as well as assumes the availability of long lead time materials with waste expert.'",
        "'speaker_4': 'The schedule assumes that a new intermodal facility to transfer waste from trucks to train would be needed instead of using existing facilities. And both schedules assume that the procurement process would occur concurrently with siting, planning and permitting. Moving on to the next row of the table related to greenhouse gas emissions, the feasibility study provides that the consultant'",
        "'speaker_4': 'use two modeling techniques the Environmental Protection Agency, one tool and the worm tool with line item adjustments based on the consultant's professional judgment. And these are outlined further in the study attachment. According to the study, the modeling tools used do not quantify annual emissions from either disposal option because they don't explicitly model the timing of any emissions'",
        "'speaker_4': '. Therefore, the figures should only be used in a comparative sense and don't themselves represent actual emissions in a specific period of time. Additionally, these modeling tools used by the consultant involve a sort of debit credit system where gross greenhouse gas emissions, for example, the emissions of carbon dioxide from combustion to be offset by avoided emissions, for example'",
        "'speaker_4': ', avoided carbon dioxide emissions from the electricity generated by a waste energy facility. So for net greenhouse gas emissions, the consultant estimates that a waste to energy facility in its modeling would have comparatively lower greenhouse gas emissions than waste export by rail -0.05 metric tons of carbon dioxide equivalent per ton of waste versus a range of 0.8 to'",
        "'speaker_4': '0.33 using the same metric. The negative result for waste to energy indicates that in the consultant's modeling, the estimated offsets or emissions avoided for things like ash and metals. Recycling at a waste energy facility are greater than the estimated generated emissions.'",
        "'speaker_4': 'And for reference, this information is further described in the staff report on pages 17 and 21. For comparison, the greenhouse gas emissions estimates in the 2019 Comprehensive Solid Waste Management Plan, which also used the warm tool but included different assumptions, yielded the opposite conclusion and estimated that greenhouse gas emissions for a waste energy facility would be a'",
        "'speaker_4': 'net positive, meaning emissions are higher than the available offsets. The next rows in the table provide estimates for the total cost and the average cost for that for the proton for the ten, 20 and 50 year time periods.'",
        "'speaker_4': 'The feasibility study notes that total cost includes capital and operating costs as offset by revenues but does not include some departmental cost, though are assumed to be the same for both options. The consultant concludes, based on its final financial modeling, that the total costs offset by revenues for both long term disposal options are similar in the ten'",
        "'speaker_4': 'year near term at over $1 billion, but that a waste energy facility could cost less in the 50 year long term, estimating the total cost of waste energy over 50 years at approximately $7.9 billion and a total cost of approximately 11 and $16 billion for waste.'",
        "'speaker_4': 'Expert by rail. Over the same 50 year period. For comparison, the analysis contained in the 2019 Comprehensive Solid Waste Management Plan. Comparing the to long term disposal options resulted in the opposite conclusion and determined that waste export was the more inexpensive option per tonne.'",
        "'speaker_4': 'Executive staff provided a memo to the council members by email on October 24th. I described the different assumptions that led to this conclusion. This memo is attached as attachment three to the staff report for your reference. I will now describe the waste to energy sizing options developed by the consultant and provide additional detail about the cost estimates'",
        "'speaker_4': '. The bottom of page 11 of your packet discusses the facility size that would be needed to accommodate the county's waste over a 20 to 50 year period beginning in 2025. Based on the high and low bound forecasts described earlier, the consultant developed two facility sizing options, the first with an initial processing capacity of 3000 tons to be'",
        "'speaker_4': 'expanded to 4000 tons per day in 2048. And the second option a facility with initial processing capacity of 4000 tonnes per day, that would be expanded to 5000 tonnes per day in 2040. And the former refers to the low down forecast and the latter refers to the high down forecast.'",
        "'speaker_4': 'These initial facility size estimates are lower than the 5000 tonnes per day facility that the 2019 comprehensive Solid Waste Management Plan assumed that would be needed and which was based on solid waste division and an external consultant analysis.'",
        "'speaker_4': 'And just for some context, the county Salt Lake system averaged roughly 2500 tons per day in 2018. The feasibility study indicates that approximately 43 to 55 acres would be needed for a waste energy facility with the processing capacities that I just described.'",
        "'speaker_4': 'But notes that it's often possible to condense buildings and equipment into a smaller footprint at additional cost, and that the acreage range figure provided represents a slightly larger site requirement than ultimately may be needed. Additional siting needs identified by the consultant are listed on page 12.'",
        "'speaker_4': 'I'm now moving on to more detail about the cost and financing options found on page.'",
        "'speaker_2': '12.'",
        "'speaker_4': 'In response to the proviso requirement or a discussion of estimated cost as well as potential financing options. The consultant developed a model financial model that includes the costs for development, construction operation and expansion of a waste energy facility based on the high and low bound forecast estimates again over the 50 year planning period.'",
        "'speaker_4': 'The feasibility study model assumes a design build operate contract is used, meaning the contracted entity is responsible for design, construction and operation of the county owned facility. Table three summarizes the estimated total cost information for a waste energy facility, including capital costs and operating and maintenance cost.'",
        "'speaker_4': 'And note that these are the same figures as in table two. Moving on to the following page or initial construction cost estimates, the estimated initial construction costs, according to the study, would range between 1.19 and 1.49 billion, depending on the facility size and for expansion cost between 231 million and 289.5 million.'",
        "'speaker_4': 'According to the study, these are based on the most recent facility constructed in the United States located in West Palm Beach, Florida, and are adjusted for regional prices for things such as labor sales tax and land acquisition costs.'",
        "'speaker_4': 'Also included in these estimates is the cost for carbon sequestration, technology and advanced metal recovery equipment, the former of which is anticipated to be required under a new state law concerning electricity sales. And I will discuss that further in a few moments.'",
        "'speaker_4': 'The consultant assumes a long term bond. That long term bond financing would be used, though notes that other options may be available, but at potentially higher cost. Table five summarizes the estimated operating, operating and maintenance costs for each sizing option offset by revenues.'",
        "'speaker_4': 'And I would just like to call your attention to an error on this table. So instead of revenue, the column headers should say costs. So my apologies for that error. The rest of the language in the figure is correct.'",
        "'speaker_4': 'And so the feasibility study provided operating and maintenance costs over a 20 year term, which roughly corresponds to the length of time before the facility would need to be expanded and the remaining 30 year term in the study period.'",
        "'speaker_4': 'The list on page 14 and 15 summarizes some of the costs included and the assumptions used by the consultant. For example, these costs include the value of an operator contract. Recall that the consultant assumes that the county would use a design build operate contract under the financial model the consultants developed and the this value is based on'",
        "'speaker_4': 'the actual operating contract for the West Palm Beach facility, as well as the additional costs for operation and maintenance of the carbon sequestration and advance metal recovery equipment. Information about the potential revenue sources are further discussed on pages 16 and 17 of the staff report.'",
        "'speaker_4': 'However, I'll note that revenue is assumed from electricity sales, sale of recovered metals and from acceptance of out of county waste for a per tonne fee. Executive staff indicate that the available facility capacity for any out-of-county waste was determined by subtracting the projected county waste from the designed capacity of the facility in a given year.'",
        "'speaker_4': 'However, that actual interest on the part of non county jurisdictions was not specifically evaluated as a part of the study. The consultant indicates that the cost estimates provided are influenced by a variety of variables and assumptions, and so they have identified the top five risks or assumptions impacting the financial model, and these are summarized on table six'",
        "'speaker_4': 'on page 15. I'll highlight just two of these. The consultant notes that if the larger facility option is selected and the actual waste processed is significantly lower. For example, if the county is not able to secure out of county waste to process as assumed in the model, the cost per ton of waste may increase.'",
        "'speaker_4': 'Another risk identified by the consultant relates to carbon sequestration. The 2019 Clean Energy Transformation Act, passed by the Legislature this year, imposes new requirements for electricity generation and therefore may influence future electricity revenues should the county decided to move towards waste to energy.'",
        "'speaker_4': 'Under this law, the feasibility study explains that all retail electricity sales must be carbon neutral by 2030 and by 2045, all utilities in the state must obtain electricity from sources classified as renewable or non emitting. According to the consultant, new waste energy facilities would then likely require carbon sequestration or carbon capture technology and or require the purchase'",
        "'speaker_4': 'of renewable energy credits to offset emissions in order to meet the carbon neutral goal. However, the consultant suggests that in their analysis, it will be difficult for a waste energy facility to meet the 2045 requirement for renewable or non emitting electricity generation, even with carbon sequestration or capture absent a modification of the rule.'",
        "'speaker_4': 'The feasibility study also notes some uncertainties related to these technologies at a scale that would be required by the county. The implications of the Clean Energy Transformation Act is further discussed on page 16 of the staff report.'",
        "'speaker_0': 'And we can interrupt for a moment.'",
        "'speaker_3': 'Councilmember Dunn on point the modification of the rule set by the state legislature with respect to carbon sequestration goals by 2045.'",
        "'speaker_4': 'With regard to the implementation of the Clean Energy Transformation.'",
        "'speaker_3': 'Act, any indication that the legislature was considering waste to energy facilities when they were looking at that rule?'",
        "'speaker_4': 'I would have to look into some of the legislative history.'",
        "'speaker_3': 'And I'd be surprised if they were thinking about that, as opposed to things like hydroelectric facilities and other things where we're comfortable with. But we do have our state legislative director here as well as others. It would be something that we can work through.'",
        "'speaker_3': 'But when you're talking globally about the environmental need to deal with waste and then the fact that in order to do that, you've got to incinerate it, creating energy, that might be a little bit different tack they may be willing to take.'",
        "'speaker_3': 'And I'm not going to speculate on exactly what they were thinking, but I think there's room there at least to possibly modify some of the state rules.'",
        "'speaker_4': 'I will note that there is one waste energy facility located in Spokane. So to the extent that the city of Spokane did any lobbying, that it may have been addressed, but I can't speak to.'",
        "'speaker_3': 'That's good to know. Thank you. All right. Thank you.'",
        "'speaker_4': 'Okay. So I'll now turn to the study findings for waste expert by rail, which can be found on page 20 of your packet, skipping right ahead. So as I did for waste energy, I'll provide some additional detail related to the estimated costs for waste export by rail.'",
        "'speaker_4': 'Table nine summarizes the estimated total cost and average cost per ton for both the high and low bound forecasts as before. Total cost includes capital and operating costs, but does not include some departmental costs. The feasibility study notes that a waste expert program would have four major cost components.'",
        "'speaker_4': 'Construction of an intermodal facility is assumed a transport of waste from the transfer stations to the intermodal facility. Transport of waste by rail to the landfill and the disposal fee at the landfill. The study assumes, again, that current intermodal facilities would not offer sufficient capacity to handle the county's volume of waste.'",
        "'speaker_4': 'And so the financial model assumes construction of a new intermodal facility financed and constructed by a rail company. Under the model, the rail company would charge the county for these capital expenses in the proton fee charged for waste export by rail.'",
        "'speaker_4': 'The consultant identified the top five risks or assumptions impacting the financial model, and these are summarized in table ten. I'll highlight three and he lists on page 21. According to the consulting. Interviews with railroad companies. The railroads indicated they're unlikely to grant long term contracts and instead would anticipate offering something in the 5 to 10 year range'",
        "'speaker_4': '. The consultant notes that this may result in some uncertainty relating to hauling and disposal costs over the long term. The second note relates to the rail capacity as part of the proviso the consultant was required to review future rail capacity, and that concluded that there appears to be sufficient capacity now to accommodate the region's waste and that'",
        "'speaker_4': 'there will continue to be some rail capacity in the future. But the availability of that capacity may depend on an entity's willingness to pay. Additionally, the consultant notes that the out of county landfills typically partner with a specific rail hauler, which may make it more difficult to switch landfills and rail hauler at the end of a contract'",
        "'speaker_4': 'period, particularly if an intermodal facility is constructed with a specific railroad. And that all of this would potentially result in less competition. Flipping ahead to page 23 to the summary of consultant recommendations based on its analysis, the consultant recommends that the county consider pursuing additional preliminary evaluation, permitting and fighting considerations in order to move forward with a'",
        "'speaker_4': 'waste to energy facility over waste export by rail. Specifically, the feasibility study states that, quote, due to the long term cost savings, improved recycling rates and potential for net greenhouse gas emissions. With the inclusion of carbon capture technology, waste to energy disposal will provide a significant financial and environmental benefit to the county over waste expert by rail'",
        "'speaker_4': '. Additionally, even with potential hurdles during the permitting and siting process, waste energy represents a more, much more stable long term financial profile underway. Expert by rail to protect the county's solid waste rate structure against future inflation and escalation, end quote.'",
        "'speaker_4': 'I'll close my remarks in noting that the proposed motion in front of the committee would acknowledge receipt of the feasibility study and approval would release the funds encumbered by the proviso. However, it would not provide council approval for the next disposal method.'",
        "'speaker_4': 'The main vehicle for solid waste planning decisions is through updates to the Comprehensive Solid Waste Management Plan the council included in the 2019 plan that was adopted earlier this year, a requirement for the Office of Performance Strategy and Budget to engage with the Solid Waste Division, as well as regional partners to develop a plan for long term'",
        "'speaker_4': 'disposal. With a progress report on that work due to the Council in 2021. That concludes my remarks and I'd be happy to take questions. We also have Dwight Dave Lee from the Office of Performance Strategy and Budget and Pat McLaughlin from Solid Waste available for questions.'",
        "'speaker_0': 'Thank you very much, colleagues. Council up the Grove. Thank you, Madam Chair. Mr. Chair, I'm not sure.'",
        "'speaker_3': 'Who to address the question. I looked over. I thought, Jeanie, there are there.'",
        "'speaker_0': 'Questions.'",
        "'speaker_3': 'That weren't asked in terms of points of comparison? You know, this was pretty specific about comparing certain factors. I wonder if and I'm not sure if you're the right person to address this, too. However, are there other strengths and weaknesses of the proposals that can be measured with other metrics that weren't addressed in this other environmental output'",
        "'speaker_3': '? Those kinds of things.'",
        "'speaker_4': 'I would say that the the consultant's work was driven in large part by the budget proviso, which identified a number of very specific requirements to be contained, whether there could be other things included, I would have to think about that more and get back to you or defer to I could of staff.'",
        "'speaker_3': 'Okay. I'm sorry if there are glaring if either is in feature communication if there's glaring things but what what they didn't look at was X or what.'",
        "'speaker_0': 'They should have looked at was Y, that kind of thing. And but for.'",
        "'speaker_3': 'Both this and the previous study.'",
        "'speaker_0': 'You know the the interesting to me. Council member, Lambert.'",
        "'speaker_2': 'I don't think you're surprised that I want to talk about this. So one of the comparisons is that the underlying says that we're capturing about 95% of the methane of the land, though we don't really have a way of knowing that for sure.'",
        "'speaker_2': 'And so I think that the comparisons are very important to look at. And in Germany, which is one of the 13 ways to energy plants I've seen now in the world, and they do a lot of work. And on the website, it says, since the Hamburg facility represents the world's most environmentally sustainable, commercial, proven solid waste solution'",
        "'speaker_2': 'is not surprising that it serves as the model facility for the European Union and enjoys the exclusive support of the German Green Party as the best available technology for the treatment of solid waste to achieve the Green Party's 2020 concept to avoid landfilling of all degradable solid waste from human activities.'",
        "'speaker_2': 'And when I was in Germany and talked to the ministers of the environment, they were very proud of what their facility has accomplished as one of the finest in the world. So I think this is really an important study.'",
        "'speaker_2': 'The experts were asked questions very as much as possible to be comprehensive because this is an important study. And in the study it says that potentially by the year 2035 that our landfill could be filled. And it also says in the study that on the long range, it could take 11 years to get the next facility up'",
        "'speaker_2': 'and running. So when you think about this being 2020 and you had 11 to that, it's pretty darn close to 2035. So making a decision soon, I think is an important thing that we need to be doing and looking at proven technologies for the size of the volume that we have and also looking at all the byproducts'",
        "'speaker_2': 'that we would get from this. And there is a reason why the European Union requires this to be in all of their member and member countries so the rest of the world is doing this. There's data online, 24 seven out of Hamburg, so that we can see exactly what's happening.'",
        "'speaker_2': 'We do not have that same kind of information available for the landfill because it cannot be gleaned where with the waste energy plant it can be cleaned and it meets and exceeds our federal standards. So after 12 years of talking about this, it's very nice to see the report is here and I look forward to people reading'",
        "'speaker_2': 'it.'",
        "'speaker_0': 'Council member Done.'",
        "'speaker_3': 'Thanks for that very good staff report as outstanding and appreciate your work on this. I want to concur with my colleague, Councilmember Lambert and others that this report is well timed after the comprehensive plan that we move forward on solid waste with a ten year provision for the continuation of using the Cedar Hills landfill, followed by possibly'",
        "'speaker_3': ', and I hope not a ten year option to continue out there if we can possibly fit anything in. And given the report coming back saying, you know, something like an 8 to 10 year time horizon, assuming that is even is inaccurate, the time to discuss the matter is really now if we are going to seamlessly move to'",
        "'speaker_3': 'a different technology and get rid of the landfill. The time for this body us to have the conversation is really in the next 12 months. And so I really hope that folks are willing to at least have a conversation that's either go no go decision or sequence the steps so we can do slowly get our feet wet'",
        "'speaker_3': 'on the matter. Driving towards a point in time which we do have sort of a command decision on what are substantive, solid waste policy is going to be moving forward. So I wanted to flag that we working on this issue.'",
        "'speaker_3': 'It's an important issue with Councilmember Lambert and Dwight Daley in the executive and others and see if we can't go in a different direction, because the the days of huge monolithic landfills, I think, are are slowly coming to an end.'",
        "'speaker_3': 'They have to it's just not sustainable into the future. Thank you for your time.'",
        "'speaker_2': 'Councilmember Lambert. Thank you. I just want to make two extra quick points that we are preparing to put millions of dollars into a new pit. And I think that that's something we need to be looking at and that those dollars could be used in a much better way.'",
        "'speaker_2': 'And I want to thank DSB for all their work on this and for Mr. Dave. Like going to Florida to see it. And I'm hoping his capture the executive to go with us. So thank you. And his manager that oversaw the study did an absolutely fabulous job.'",
        "'speaker_2': 'She didn't have any background in ways to energy, but it didn't take her long to become very well versed. And she was an excellent project manager, so please thank her for her good work. Thank you.'",
        "'speaker_0': 'Thank you. And Morales, we've complimented PSP in the study. I want to also acknowledge your analysis and review of the study. Substantial study with a key question, a key decision point. This coming before the council with the exceptional analysis that you've presented to us.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you, Mr. Chair.'",
        "'speaker_0': 'Colleagues prepared to accept the report in Council Member Vale.'",
        "'speaker_2': 'Did you just make one comment as Richard, please? It's just slightly off topic but related. So I had an opportunity to go visit the landfill last week, which I thank the folks from Solid Waste Division for setting that up.'",
        "'speaker_2': 'It really is something to see it in operation and all the different challenges and things that they do they work with. I mean, it's a very it's a very modern professional landfill. And but I have to say, watching a truck dump up to 18 tons of waste and then the next trip drive down to do it again'",
        "'speaker_2': 'and see that there's going to be over 100 trucks like that that day alone and then every day after that. Our challenge isn't just how to get rid of it. Our challenge is to create a lot less waste.'",
        "'speaker_2': 'We have just got to and this is way bigger than King County, but we have to start to figure out how to produce less waste because our society is going to be drowning in our waste, whether we burn it and bury the ashes and put some of it into the air, whether we bury it in the ground'",
        "'speaker_2': ', whether we shoot it into space. There needs to be less of it. And so I just think that that's something that we should be figuring out how we get into our discussions about future planning for waste as well.'",
        "'speaker_2': 'Thank you, Mr. Chair.'",
        "'speaker_0': 'Councilmember Colwell, would you be willing to put the item before us?'",
        "'speaker_2': 'Definitely would. Mr. Chair, an acknowledgment to Councilmember Lambert. I moved the proposed motion to move 2019 0429. You're given a do pass recommendation.'",
        "'speaker_0': 'Councilmember Caldwell's move that we give a do pass recommendation to motion 2019 429 and again, that's simply accepting the report before us make these decisions about our long range waste disposal that are timely for us to be considering now.'",
        "'speaker_0': 'But the acknowledging that we see the report itself further discussion. Others other than favorably say, But do I need a roll call? I'm sorry. Will you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Duty Councilmember DEMBOSKY. Councilmember Dunn. Hi, Councilmember Gossett. Councilmember Colwell. Councilmember Amber. Hi. Councilmember autograph. All right. Councilmember one right there. Mr. CHAIR. But, Mr. Chair, the.'",
        "'speaker_2': 'Vote is 19 zero no's.'"
    ],
    "King County Organics Market Development Plan.": [
        "'speaker_0': 'Thank you. By your vote, we've given a do pass recommendation in motion 2019 429. And can we put that in consent? We'll put that on the consent agenda for at the regular course. That takes us to our next item, which is about how the county can play a more active role in expanding and enhancing the market for'",
        "'speaker_0': 'compost that is produced using the organic materials generated by the county within the county. This report was required as part of the 2019 2020 budget. And again here Rose is here to brief the item as well as.'",
        "'speaker_4': 'I am still here. Tomorrow's Council staff propose motion 2019 0353 What is the chair noted acknowledge receipt of the King County Organics Market Development Plan in response to a budget proviso. The materials for this item begin on page 335 of your packet, but I'm actually going to start on the following page on 336.'",
        "'speaker_4': 'So as I noted earlier in today's committee's meeting committee meeting, the Solid Waste Division is responsible for the disposal of waste generated in the 337 partner cities and the unincorporated area under the county solid waste system. Partner cities manage curbside collection of garbage, recycling and organics within their jurisdictions and in general contracts with private haulers to provide'",
        "'speaker_4': 'that service. While garbage is transported directly to the Cedar Cedar Hills Regional Landfill for disposal, recyclables and organics are taken directly to processing or compost facilities where materials are prepared for sale to manufacturers and other users. And I will just note that in order for mature materials to be effectively recycled, there must be a market for the'",
        "'speaker_4': 'end product. Approximately 1.03 million tons of organic materials were generated in King County, Snohomish County in Seattle in 2018. And this refers to things such as yard waste, food waste, wood waste, and 55% of that is attributable to King County, according to a consultant report requested by the Solid Waste Division.'",
        "'speaker_4': 'There are three composting facilities that accept and process organic material from residents and businesses in the region Cedar Grove, composting in Maple Valley and in Everett and Lenz Enterprises. So in the 2019 2020 Biennial budget, the council risk restricted $500,000 to be expended, only to develop a plan to expand and enhance the regional market for compost that's'",
        "'speaker_4': 'produced during using the county's organic stream. And to pilot the recommendations in the plan and also included in the budget is a linked proviso that withholds $250,000 until the executive transmits the plan to the council. And it also required Salt Waste Division in the development of the plan to consult with other county agencies and to consider best'",
        "'speaker_4': 'practices, procurement policies use in development and site rehabilitation projects and agricultural subsidies. Moving ahead to the analysis portion of the staff report on page 337. So in response to the budget proviso, the executive transmitted the proposed motion in front of the committee, which would acknowledge receipt of the King County Organics Market Development Plan.'",
        "'speaker_4': 'The plan notes that the division contracted with Cascadia Consulting Group for Market Assessment and Best Practices Research hosted two full day organic summits and consulted with county agencies to inform the recommendations in the plan. The proviso requires the executive to include a set of recommendations, and these are divided into three areas in the plan.'",
        "'speaker_4': 'One Enhance and expand the local market for compost to reduce wasted resources and contamination. And three, expand regional organic material processing. Table one on page 338 provides a description of each of the recommendations in the first area, which seeks to increase the purchase of compost in the region.'",
        "'speaker_4': 'And the plan notes that at this time only recommendation one B, which can be found in that table, would need new budget authority and that all other efforts will be paid using existing appropriations. The transmitted supplemental omnibus under consideration by the Council includes funding.'",
        "'speaker_4': 'Four to support recommendation one B moving ahead to page 340. Unless there are.'",
        "'speaker_2': 'Questions at.'",
        "'speaker_4': 'Table two on page 342 provides a description of the single recommendation and the second area of the plan, which seeks to minimize contamination. When plastic and glass are disposed improperly in organics collection bins, the resulting compost can become contaminated if processors are not able to remove the plastic and glass fragments.'",
        "'speaker_4': 'And the plan notes that contamination reduces compost quality and can hamper market marketability and impact value. The recommendations in Area three seek to aid in the development of additional composting processing infrastructure, and the plan indicates that in 2018, the King County and Snohomish County public health agencies permitted organics facilities to process 530,000 tonnes annually, but that they'",
        "'speaker_4': 'only process an estimated 470,000 tonnes, which represents an 85% which represents 85% of permitted capacity. The current plan notes that in order to reach the county's zero waste goal adopted in the Strategic Climate Action Plan and the 2019 Comprehensive Solid Waste Management Plan, more processing capacity will be needed in the future.'",
        "'speaker_4': 'In addition to divert more organics from disposal at the landfill. Table three on page 341 provides a description of the recommendations in Area three, and I will conclude my remarks in just noting that with the transmittal of this plan, the funds encumbered by the proviso can be released if motion 2019 0353 is approved by the Council.'",
        "'speaker_4': 'That concludes my remarks. I'd be happy to take any questions. We also have executive staff present.'",
        "'speaker_0': 'Questions. Council Member Dombrowski.'",
        "'speaker_5': 'Thank you very much, Mr. Chair, and thank you for the excellent and easily understandable staff report. Tara, I really appreciate it. I wanted to start, Ms.. Chair, by thanking the Solid Waste Division for their strong work in preparing this report.'",
        "'speaker_5': 'It's comprehensive and responsive on this important area of county business, and I think it identifies some really important goals for us, including making sure we have adequate capacity to handle this waste stream and the importance of the waste stream in terms of keeping it out of the landfill or whatever disposal method we end up eventually going to'",
        "'speaker_5': '. Councilmember Lambert I had one question, Mr. Chair, and that was, I think, in the proviso, if memory serves me correctly, in addition to asking for the study to for capacity and uses and there's some great creative uses in here that are very pro-environment and environmentally friendly.'",
        "'speaker_5': 'But we also asked them to actually pilot some work by acquiring a product and putting that to use. And I maybe I missed that, but did they do that and how did that go?'",
        "'speaker_4': 'Yes. So I would refer you to page 338 of your packet. Okay. The first recommendation noted there is to provide technical assistance to King County agencies to increase compost use in county projects. And included in that effort is the intent to have a universal compost purchasing contract that agencies could then pull from.'",
        "'speaker_4': 'So does that answer your question?'",
        "'speaker_5': 'That sounds like a go forward method, but I believe of the of the restricted funds, we wanted some of those to actually be put to use today, you know, currently to acquire product and put it to use in the field.'",
        "'speaker_5': 'And I'm wondering if and I see Pat nodding his head, maybe would he be the guy to ask for more detail on that?'",
        "'speaker_4': 'Or I would just note that many of these are in various stages of sort of planning and implementation and of course specific questions. Executive.'",
        "'speaker_5': 'Yeah. I wonder if. Mr. McLaughlin if the chair permit would have any examples of any early successes for putting this product to use in the field.'",
        "'speaker_0': 'And he's bringing back up. Yeah.'",
        "'speaker_5': 'And I'll have to go there. Probably not. That's that's a softball. I have no idea what the answer is. So I think that's been being I think the project being put to use. But I am truly curious as to how it's going.'",
        "'speaker_3': 'Yes. Thank you again.'",
        "'speaker_0': 'For the record, Pat McLaughlin.'",
        "'speaker_3': 'It's my honor to serve as your director of Solid Waste. And I'm accompanied with Josh Marks, who's really been our project manager on this feat. And we have indeed experimented with some materials that I'll I'll let Josh speak to this to not just to consume more material, but to actually find complementary ways to manage the environmental impacts'",
        "'speaker_3': 'of of managing waste. And I'll let Josh talk a little bit about the materials and the impacts of the pilot testing, which has led to a funding request because we see an opportunity to actually expand it. Thank you, Ben.'",
        "'speaker_3': 'Thank you, Josh Mar, for the record for the Waste Division. Yes, we've been engaged in a number of activities to develop the plan to buy more compost. To date, we haven't actually purchased piles of compost. We've been working to create programs and partnerships, so we've been working with many of the agencies within the county.'",
        "'speaker_3': 'So the Parks Department and. Roads, as well as the permitting agency to develop different approaches so that we can purchase compost. And as was mentioned in the staff report, we had a summit where we sought input from a number of stakeholders from the region.'",
        "'speaker_3': 'And really the two takeaway messages from those summits were that King County government could and should be doing more to purchase compost. And so we need to figure out what does that mean. We don't currently have universal material specifications for compost and there's limited and lack of awareness among project managers about opportunities for compost.'",
        "'speaker_3': 'So we need to build those relationships, develop those opportunities before we actually are on the ground buying compost. And as I mentioned, we do have a project to study the the benefit of using compost in the sense our waste division operations and that's applying compost to closed landfills and attempting to or measuring the GHG benefits of doing'",
        "'speaker_3': 'so so that we are going to be doing. But we as was mentioned in the staff report, we need additional funds that are in the omnibus.'",
        "'speaker_5': 'And so the last sentence of the ER number two says the pilot must include a program whereby the solid waste agent purchases compost for county use. So we haven't done it yet, but we we are doing it. Is that how we're complying with this?'",
        "'speaker_0': 'Yes. So our intention.'",
        "'speaker_3': 'With with.'",
        "'speaker_0': 'Funding provided would be.'",
        "'speaker_3': 'That we would go after we actually, I think a request about $560,000 that would help support the application of some of these materials on some of our closed landfills to model greenhouse gas emission sequestration.'",
        "'speaker_5': 'There is some pretty interesting study and there's a great video on it with respect to greenhouse gas sequestration and working compost into ag lands. And I would encourage you to work with the department, National Resources and Parks Farmland Preservation Program to see if we could pursue that as an area of cooperation.'",
        "'speaker_0': 'Yeah, we've we have actually done some onsite testing. We've in partnership.'",
        "'speaker_3': 'With Cedar Grove.'",
        "'speaker_0': 'Have.'",
        "'speaker_3': 'Applied some of their what they refer to as overshoots, maybe reject material that they don't have a market for. And we've been able to apply that up at Cedar Hills and do measuring and comparative results to other types of cover materials to understand the potential benefits.'",
        "'speaker_3': 'And we'll continue to explore those those options going forward.'",
        "'speaker_5': 'So if I may. Mr.. I'm still a little confused, less concerned about why when we aired 500,000 and said that it should it must include a program whereby the division purchases companies for county use. How is it that we are releasing these funds without them?'",
        "'speaker_5': 'The notion was there use some of the money to buy to test the stuff but that that hasn't yet been done and understand you are going to ask for some money to do that. But I mean, help me understand.'",
        "'speaker_0': 'And we project.'",
        "'speaker_3': 'That we will have that again.'",
        "'speaker_0': 'With funding.'",
        "'speaker_3': 'Appropriated. We'll have that complete by the end of the biennium, consistent with the proviso. Okay.'",
        "'speaker_5': 'So we're on a path.'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_5': 'That okay. And just if I can, I'll be done then. Mr. Chair, the comment was made well, not just to, you know, buy it for buying sake or something like that, but one of our challenges is that the region is producing so much of this compost.'",
        "'speaker_5': 'Folks are really good about not putting it in the garbage bin. One of the thrust of this work was to have some demand created and to actually buy it so we don't have it piling up in Councilmember Dunn's district and the issues that arise from that.'",
        "'speaker_5': 'So we are trying to create a market to increase demand, to keep it out of the landfill and put it put it to use. And that's why I'm excited about some of the work you've done here in the proposals.'",
        "'speaker_5': 'And I just want to give you my encouragement to keep going in that direction, because I think it's a pretty exciting opportunity for the county to expand its role and make this market work thing. This Chair.'",
        "'speaker_0': 'Thank you. Councilmember Lambert.'",
        "'speaker_2': 'Thank you, Mr. Chair. So the compost. Also gives us nothing. So how are you going to capture the methane that's being put off by the compost?'",
        "'speaker_3': 'Well, the private sector manages composting currently, so Cedar Grove manages in a rollback condition. And so there is no methane or very limited methane production in anaerobic condition. So that's anaerobic.'",
        "'speaker_2': 'So why does smell so bad then? Are the neighbors complaining about this now?'",
        "'speaker_3': 'Well, I would just say that the degradation of organic material is has odor.'",
        "'speaker_2': 'That is correct. But most that odor doesn't it come from methane production? The methane isn't that partly what creates the smell?'",
        "'speaker_3': 'I don't have a scientific explanation for that councilmember.'",
        "'speaker_2': 'And then also in number one, A, so there's a lack of uniformity in the specifications. So when you're looking at using these facilities, this compost in different places, having a lack of uniformity will make a difference whether it's going to be used in the roads or the parks or at your top parts of your landfill.'",
        "'speaker_2': 'So how are you going to get a more uniform specification out of this?'",
        "'speaker_3': 'So in partnership with the Sustainable Purchasing Program, we're developing specifications and we're using in the Department of Transport, the Washington State Department transportation specifications as well as others to to develop specifications that are that are used in different kinds of applications.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'For the discussion. Council upthere. Thank you, Mr. Chair.'",
        "'speaker_3': 'And this is following up on Councilmember Dombrowski is kind of getting my head around the the difference between the expenditure restriction and the proviso. But, you know, it's it's been a while. I understand that the expenditure restriction was on the development of a planned 250,000 and there is a separate section in the budget that had the 500,000'",
        "'speaker_3': 'and it said that's for developing recommendations and piloting. Did the development, the recommendations cost 500,000? Did all that five per k get eaten up before actually implementing a pilot? I don't say that like a bad thing necessarily, but is is how much of that 500 K has been spent and I don't have a number of time how'",
        "'speaker_3': 'much was spent. We can provide that to you. We did spend significant dollars working with the consultants to develop the reports. But again, I think to address the question of why or why not. And we purchase complex. We need a place to put compost, right?'",
        "'speaker_3': 'I mean, there's always division isn't hasn't been in the business of of using this amount of compost. So we need to develop those markets. And that's what the initial efforts are all about, is trying to find those markets with our partners.'",
        "'speaker_3': 'And once we've developed that and there's confidence and willingness to use it, then that material can be applied. I mean, it's expressing a little nervousness that if the appropriation said here's half a million dollars to develop some recommendations and go pilot them, and then if it comes back, okay, we spent most of that just on developing the'",
        "'speaker_3': 'recommendations. Please appropriate more money to pilot it than either we got our budget way off or in terms of our estimates in advance of how much to appropriate for that or maybe it hasn't been spent. So I'd be interested in seeing this sort of a rough we can provide some greater clarity over the financials to address that'",
        "'speaker_3': 'concern.'",
        "'speaker_5': 'Are you are these folks back in? Are you at the SA Waste Division because you're shaking your head like you've got some knowledge or are you just commenting that they had check? Oh. Okay.'",
        "'speaker_2': 'All right.'",
        "'speaker_5': 'Yeah. I want to echo, if I can. We're going to go to the notion. The reason that language is there is and we put it in the SA Waste Division because we couldn't put it in another, you know, function.'",
        "'speaker_5': 'But the notion was start, bind some hysteria, deploy it, test your test, test the markets, put it in those stormwater cleaning facilities to save the salmon, get out there and do it. I we would never spend $500,000 to prepare a study, and I know you didn't.'",
        "'speaker_5': 'At least you better tell me then. Okay. I'll look forward to that same information that comes more up to go ask more in terms of the breakdown.'",
        "'speaker_2': 'Councilmember Lambert So how are you going to go about removing the contamination that is in the collected organics? And as you know better than anybody, China said that they won't accept any. Any impurities over 2.5% and our garbage is at 10%.'",
        "'speaker_2': 'So organics that you probably have a lot of, you know, garbage that have been thrown at it because you can put in your pizza things and such. So how are you going to remove the contaminants? And many countries are moving away from composting to an anaerobic digestion.'",
        "'speaker_2': 'So like for instance, Germany, which I happen to think is ahead of us environmentally, I know that some people don't think so, but I happen to think so. So do the contamination. They are not finding people wanting to purchase their compost.'",
        "'speaker_2': 'The report, very well done by our staff does talk about the costs of the equipment on order to do that. And the only way that I know to capture the methane is an enclosed facility, and this is not an enclosed facility.'",
        "'speaker_2': 'So your answer earlier that you don't really have to capture it because it's not there is confusing to me. So anyway, I think I think there's a lot of things that we need to continue to look at. Thank you.'",
        "'speaker_0': 'Colleagues. Are we comfortable moving the subcommittee committee today? Councilmember Caldwell's.'",
        "'speaker_2': 'Thank you, Mr. Chair. I moved a proposed motion of a 2019 0353 be given a do pass recommendation.'",
        "'speaker_0': 'Councilmember Cole was moved to give a DU Pass recommendation to motion 2019 353. See no further discussion. Would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council Member. Belted Chief Council Member. Dan Vasquez. Councilmember Dunn. Councilmember Gossett. Councilmember Nancy. Council member of the Borough Council member Ron, right there. Mr. Chairman. All right, Mr. Chair, the vote is 790 noes to excuse.'",
        "'speaker_0': 'By your vote, we've given a do pass recommendation the motion 2019 353. And we'll put that on the record. Of course, we'll put that on consent on the back of the course of action. That takes us to item seven in today's agenda.'",
        "'speaker_0': 'Our final item is regarding the county's 2020 legislative agenda. The county, as the other three, the state are, is a creature of the state and therefore often issues we wish to address or work on behalf of on behalf of our constituents are impacted or on some occasions even limited by state policy.'"
    ]
}