{
    "Confirmation of Allen Nance as Director of Juvenile Division.": [
        "'speaker_0': 'Thank you. Thank you for your work. I was aware of the community conversation you had on Friday and enjoyed joining the Lunar New Year celebration in Chinatown International District on Saturday. Myself. Thank you. Thank you very much for joining us today and providing this update and look forward to continued conversations.'",
        "'speaker_0': 'Thank you. Thank you. We will move back to item seven on today's agenda. This is a motion confirming the appointment of Alan Nance as the director of the Juvenile Division of the Department of Adults in Juvenile Detention. I'm invited as Mr. Nance.'",
        "'speaker_0': 'The director designee, John Diaz, the director of the Department of Adult Juvenile Detention. And joining them is Rachel Smith, deputy county executive. We have a motion that would confirm Mr. Nance as the new juvenile division director responsible for juvenile detention and alternative to secure detention for our youth.'",
        "'speaker_0': 'Generally, the council only confirms department directors, as we did for Mr. Diaz just late last year. We welcome the three of you here today. And Cliff Cory from central staff is here to present a brief staff report and introduce the appointee.'",
        "'speaker_2': 'Thank you, Mr. Chair. Members, I am clipped a group of council staff. The materials for the staff report begin on page seven of your packet today. As the Chair noted, this is moderately unique and that generally only appointments as department directors come before the council for confirmation.'",
        "'speaker_2': 'However, as the staff report notes, the County Council, in its deliberations almost 20 years ago now for the Juvenile Justice Operational Masterplan, recognized the importance that juvenile detention plays in the overall scheme of developing an appropriate system of response for the needs of juveniles.'",
        "'speaker_2': 'And along with the Superior Court working with the Executive, that time decided it was very important for the both the County Council and the Superior Court, which of course runs the Juvenile Court, to participate in the selection of a juvenile detention manager.'",
        "'speaker_2': 'Recognizing how important this position is in not only the operational aspects of detention and alternatives to secure detention, but also as a participant in the overall continuum of programs in order to keep youth out of the overall criminal legal system.'",
        "'speaker_2': 'And as a consequence, you adopted this. And I should also note this is only the second confirmation you've had to do over the last 20 years. Mr. Nance joins us from the city and county of San Francisco as the former chief probation officer.'",
        "'speaker_2': 'After having significant experience there, both running their overall probation department, which included their juvenile detention program, which had significant alternative programs and so on. In addition, in his time in San Francisco, he was a criminal justice advisor to the mayor, Gavin Newsom, who's now the governor of California.'",
        "'speaker_2': 'And prior to that, going to San Francisco, Mr. Nance had extensive probation experience both in Cook County and DuPage County in Illinois. And with that, Mr. Sheriff, there are no questions for me. I'd like to turn it over to executive staff to both introduce Mr. Nance and then Mr. Nance to give his remarks.'",
        "'speaker_0': 'Miss Smith.'",
        "'speaker_6': 'Thank you so much. For the record, Rachel Smith, Deputy County Executive and thank you for the opportunity to say just a few words. I will just echo what Cliff said in terms of Mr. Nancy's experience. He has a 30 plus year career that did include Cook County Juvenile Court, included the deputy director of the adult services division'",
        "'speaker_6': 'for DuPage. As you stated, San Francisco's Juvenile Probation Department working for Mayor Gavin Newsom, then being promoted to the assistant to chief juvenile probation officer there in San Francisco. And now we are pleased has made it here to King County.'",
        "'speaker_6': 'On behalf of the executive, I just want to say how thrilled we are and how thrilled I am to be sitting here supporting Allen today. I think Allen really is that rare mix of policy chops, operations, knowhow, embracing of innovation and really rooted in community.'",
        "'speaker_6': 'I'll reveal a little bit about his interview process during that. Allen spoke very articulately with the judges, for example, about the differences in the authority in law between San Francisco and King County in Washington state, because he had done his research, he had done his homework and I think impressed a group of people, our judges, who are'",
        "'speaker_6': 'not always easy to impress with his extensive knowledge and research that he had done. He also spoke in great detail about managing various operational issues, including mandatory overtime, which I think everybody knows is a challenge that we face here in King County.'",
        "'speaker_6': 'And then I think his knowledge of public health and taking a therapeutic approach was was so dramatic that we practically had to give Patty his smelling salts after after he spoke. So I just want to say that I think we are really lucky to have an individual of Allen's caliber here joining King County, and I urge you'",
        "'speaker_6': 'to support his confirmation. Thank you for the opportunity to speak.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_3': 'And good afternoon. For the record, my name is John Hughes. I am the.'",
        "'speaker_2': 'Director of the Department of Adult and Juvenile Detention. There's not much more I could say. I was at those interviews. I have never seen anything like it where everybody was speechless. After Allen spoke, at the end of the day, what we really needed, we needed a leader that had the experience to lead a large group.'",
        "'speaker_2': 'And as Allen has to be able to work with some dedicated juvenile detention officers, but also working with the community. Working with the kids. But more. Most importantly, and this is what sold me.'",
        "'speaker_3': 'Completely on Alan. It was.'",
        "'speaker_2': 'His compassion, his intelligence.'",
        "'speaker_3': 'And his empathy for those children and to not be willing.'",
        "'speaker_2': 'To settle for the status quo. He is looking to continue to help and try new approaches to help these kids. We could all talk about about him.'",
        "'speaker_3': 'At length, but I think the most important thing now is.'",
        "'speaker_2': 'If you had a chance to ask some questions and I to as Rachel said, I'm very pleased to have him here at the Q Oval Detention. So I hope you would support his confirmation. Thank you.'",
        "'speaker_0': 'Mr. Nance. Welcome. This is your opportunity to say a few words in your own defense and by way of welcome. I want to tell you how much I've appreciated meeting you in my office, getting to know you a bit, and your work, your work in the past, and what you strive to bring to King County and seen'",
        "'speaker_0': 'you in action last week on a site visit and the work and passion you truly bring.'",
        "'speaker_3': 'Thank you very much, Chair McDermott and members of the Council. First, let me just say how much I appreciate the kind words from my my colleagues here in the county who spoke on my behalf with respect to my my history and my experience as I described to the executive and many of the individuals that I've met since'",
        "'speaker_3': 'arriving here in King County. Part of the reason why I was so eager to join this team is as a result of the many conferences and juvenile justice forums that I've attended over the years, where King County is identified as one of the counties that has demonstrated such progressive commitment to change and juvenile justice.'",
        "'speaker_3': 'It's clear in what I have seen since I've arrived. And it is also clear and the commitment from the very many people that I have spoken with since my arrival. To make it pretty transparent. Part of the reason why I feel so strongly about the importance of our juvenile detention operations and juvenile justice in general has a'",
        "'speaker_3': 'lot to do with my own personal upbringing. Growing up in the city of Chicago, on the west side of the city, predominantly African-American community, where many of the individuals that I grew grew up with are either dead or in prison today.'",
        "'speaker_3': 'It is also remarkable for me as I think about the work that we do in our juvenile justice system, in the way I think about my own 15 year old son. And to be very clear in what drives my passion for the work that I do in our juvenile justice system here in King County and throughout my'",
        "'speaker_3': 'career, I ask a very basic question. What I want for my own son if he were in the juvenile justice system. And I believe that the answer to that question is that we have to treat these young people as if they were our own children.'",
        "'speaker_3': 'In fact, they are. Because they are King County's children. And so it's important to me as a person of color and seeing the number of individuals in our juvenile justice system. That are disproportionately minorities. And it isn't just the King County problem.'",
        "'speaker_3': 'There's a problem in every jurisdiction in which I've worked. It is a national problem. But what is different here, and what I am so pleased and amazed by is the opportunity to embrace the equity and social justice work that King County is committed to.'",
        "'speaker_3': 'As is reflected in the ordinance that you passed for social and equity justice. Is this reflected in the priorities that are set forth both by this body as well as the executive's office in our courts? To do everything we possibly can to change that dynamic.'",
        "'speaker_3': 'And so as I sit here today. Reaffirming my commitment to social equity and justice and working with young people in our juvenile detention system. My vision for our system is that we become the best juvenile detention facility in the state.'",
        "'speaker_3': 'Not because we lock up the most kids, but because we have a brand new facility, but because we are invested in the well-being and the growth and the development of the young people that come into our custody and care.'",
        "'speaker_3': 'And that means that we must be trauma informed, that therapeutic programing must be a part of our strategy to work with our young people, and that we have to partner with the rest of our juvenile justice agencies to make sure that we are doing everything we possibly can to reduce the number of young people that enter our'",
        "'speaker_3': 'juvenile justice system and yet that enter our juvenile detention facility. And that is about prevention. It is about partnership. It is about collaboration. And it is also about about breaking down the silos between our systems. I also recognize that we have to create a broader array of alternatives to detention.'",
        "'speaker_3': 'And yes, we have electronic monitoring as a primary alternative to detention. But there is far more that we can do to create evening reporting centers in the neighborhoods and the parts of the county where young people live in developing stronger partnerships with our community agencies, because at the end of the day, these young people are returning to'",
        "'speaker_3': 'those communities. And they need those strong partnerships within their neighborhoods. And so I'm committed to change. And I know that change is not always easy for folks, but it is necessary. And that means we have to look at innovative strategies.'",
        "'speaker_3': 'We have to be prepared to be uncomfortable in the process and that it is necessary that we work in partnership with our staff. With the community and with the families that we serve. That's why I thank you today for this opportunity to come before you.'",
        "'speaker_3': 'I am humbled and honored at the prospect of continuing to work side by side with this body and the executive's office and all of our juvenile justice partners as we continue the very difficult work to serve our young people here in King County.'",
        "'speaker_3': 'Today was the first day that the new Patricia Clarke Children and Family Justice Center opened its doors to the public. I realize there's been a lot of acrimonious discussion about that facility. But in the short two months that I have been here, as I have walked the halls of the Youth Service Center.'",
        "'speaker_3': 'There are a lot of remarkable differences that this new facility provides in terms of opportunity to our young people. It is a healthy, bright. Well, construct that facility where young people can be safe, where programs can be delivered, and where better outcomes for the future can be cultivated.'",
        "'speaker_3': 'And so I thank you today again for this opportunity to be here at this confirmation hearing. And I'm happy to take any questions that you may have.'",
        "'speaker_0': 'Thank you, Mr. Nance. When you and I had the opportunity to meet my office, we spoke about the New Children and Family Justice Center and spoke specifically about how it may have been state of the art when we designed it and started to build it.'",
        "'speaker_0': 'And that was a number of years ago. I'm giving your experience in other jurisdictions, your arrival here, seeing our old facilities, seeing our new facility, and being in current in how to address rehabilitating juveniles, not just detaining them.'",
        "'speaker_0': 'Are there innovative ideas? Are there new practices that you can already identify that we might want to bring to King County?'",
        "'speaker_3': 'Absolutely. First and foremost, we have to go beyond the brick and mortar. We have to think about the quality of the programs and services that exist within these facilities. We have to think about the philosophical framework from which we operate.'",
        "'speaker_3': 'When a young person comes into our custody, are we doing good assessment? Are we making certain that the right services and and programs are available? Do we have people who have the right that values and attitude about the work that they do with young people in custody?'",
        "'speaker_3': 'Because those are the things that make the difference. At the end of the day. Programmatically, we have already launched a merit center in the new facility. This is essentially a teen rec center, a place and a space where young people will be able to relax, to be with their peers, to earn the opportunity to engage in a'",
        "'speaker_3': 'variety of recreational resources that we have in that space. And that's something that is as innovative and new and different as something that we were able to do in San Francisco when I was there. And I think that the young people here in King County will also appreciate that opportunity as well.'",
        "'speaker_3': 'And one of the things about that merit center is that it incentivizes the positive behavior that we expect from young people and shifts the focus away from simply reacting when they engage in misconduct. We saw a 30% reduction in the number of fights and conditions that were called in San Francisco within five months of implementing a merit'",
        "'speaker_3': 'center. I believe that we can achieve the same thing here. I also think that we have to do a better job of bringing the nonprofit agencies into the facility. And opening the doors to parents and guardians to work in partnership with us while a young person is detained.'",
        "'speaker_3': 'That's a necessary ingredient to making the facility function more effectively. A fundamental question must be asked. At the end of the day, when a young person is released from our detention facility, are they better off when they leave than when they got there?'",
        "'speaker_3': 'And that won't happen unless we are committed to changing our philosophy, our vision and our strategy for engagement with young people while they're in custody. I think there are a lot of very basic things that we can do that really move the needle in terms of improving the quality of care in detention.'",
        "'speaker_3': 'And while we would never want any young person to have to be detained, we recognize for those few who require such detention that it should be for the least amount of time. It should be the strategy that is best designed to keep that young person safe and keep our community safe.'",
        "'speaker_3': 'And so I think that if we bring all of our state stakeholders to the table and partner in a way to achieve those outcomes, that we can improve the quality of detention services here in King County. Thank you.'",
        "'speaker_3': 'You're welcome.'",
        "'speaker_0': 'Ann Summers, hello.'",
        "'speaker_2': 'Thank you so much for being here, all of you. And thank you, Mr. Chair. Mr. Nance, you mentioned earlier that we should think beyond the brick and mortar. But one thing that I wanted to spend time on is the brick and mortar.'",
        "'speaker_2': 'So when we took a tour of the facility, you're absolutely right. The top floors are bright and airy and colorful, and those are generally the spaces where resources are provided. But then you get into an elevator and you go down to the floor where the detention is actually taking place.'",
        "'speaker_2': 'And it feels like a prison. It feels like a jail. And so one question I wanted to ask, do you think spending time in a small, concrete cell is fundamentally damaging for young people?'",
        "'speaker_3': 'I think that if we have young people in a detention facility where our focus is keeping them in their room, then we're making a big mistake because that can be damaging to a young person. So what is important and what is necessary when a young person is in detention is that we are keeping them out of that'",
        "'speaker_3': 'room and engage with the positive adults that are around them, giving them opportunities to engage with their families even while they're in custody. Implementing video visitation for families that can't travel to that facility so that young people actually have face time with their parents.'",
        "'speaker_3': 'Making certain that the academic experience for a young person that is in custody is on par, if not better, than what they were receiving when they were in the community. As you know, council members are really many of our young people have been chronic truants.'",
        "'speaker_3': 'And so spending 250 minutes a day, every school day in class is far better for them than the chronic truancy that they've experienced. And so I agree that sitting in a small cell is is not healthy for a young person.'",
        "'speaker_3': 'And that's why detention should not be about setting young people in small cells, but making sure that they're out of those rooms and that they're engaged in the programing of the services that we offer.'",
        "'speaker_2': 'Thank you. And are you able to provide us a schedule of what a young person does throughout the day at the facility? Absolutely. So we can see how much time they spend in the cell.'",
        "'speaker_3': 'I will send that over.'",
        "'speaker_2': 'Thank you. And it's often been the case that when we ask who is going into the facility, people say only the most serious crimes, murder, rape, things on that scale. But when you see a list of the people who go in every now and then, you do see misdemeanor level.'",
        "'speaker_2': 'People who spend time, albeit a short amount of time, serves some number of days. Do you feel that? Young people who have committed a misdemeanor or a crime that's not on the level of murder and rape should spend any amount of time at all at the facility.'",
        "'speaker_2': 'And I'm asking this question because I believe they shouldn't at all. Do you think the our capacity to divert young people who have committed non crimes that aren't the most serious offenses. Why are they going in there? Is my question.'",
        "'speaker_2': 'Is it because we lack alternatives? Is it because we're still buying into a scared straight approach? What's what's the reason for that?'",
        "'speaker_3': 'Certainly. So even if a young person commits or is charged with committing a misdemeanor offense, if that's the first offense and there is no prior history, I think King County's diversion strategies are robust and respond to that very well.'",
        "'speaker_3': 'Unfortunately, we have young people who have committed prior felonies, may even be actively on probation and then commit a misdemeanor offense that would result in that young person being detained, particularly if the history is such that the prior strategies or approaches to stabilize that youth have been unsuccessful.'",
        "'speaker_3': 'Part of the obligation of our juvenile justice system is to not only respond to the criminal conduct that a young person is accused of committing, but to also look at the overall well-being of that young person. In some instances, we may even have a youth whose parent refuses to take custody of the youth after getting the call'",
        "'speaker_3': 'that they've been arrested. Quite honestly, they're resigning from the parent role because they're just tired of call after call. And in those instances, because these are minors, we do have an obligation to take custody of them under those circumstances.'",
        "'speaker_3': 'With respect to your question about capacity, if there are other options that are non-secure and safe, similar to the family intervention services that exists for domestic violence offenders who can be held in a non-secure setting, I think that perhaps having that array of services could result in fewer of those young people being in secure custody.'",
        "'speaker_3': 'Instead of our choices today. So I would definitely agree that while, yes, there are some young people who have committed a misdemeanor who end up in juvenile detention. But at the same time, absent other non-secure alternatives, we're very limited in the options we have available to us.'",
        "'speaker_2': 'Mr. Nance, would you be an advocate for, in the process of creating a roadmap to zero youth detention, as the county has stated, as its goal, the process of over time divesting away from the jail prison model toward these alternatives.'",
        "'speaker_2': 'Do you see budgeting a budgetary roadmap toward zero youth detention that involves divestment?'",
        "'speaker_3': 'I think that ultimately, with any strategy that is designed to reduce utilization of detention, there is a logical expectation and question as to what do we do with those resources when that need no longer exists. And so just from a very practical standpoint, I think that that's a conversation point that at some point needs to be on'",
        "'speaker_3': 'the table. At the same time, I'm cognizant of the fact that many of the young people that come to us are teenagers by the time they enter our juvenile justice system. And the reality is they have had 14 or 15 years of trauma and struggles that have led them to where they are today.'",
        "'speaker_3': 'And so as I think about zero youth detention and our overall strategy, a large part of that strategy, I would encourage to be about prevention. What are we doing with young people between zero birth and three years old?'",
        "'speaker_3': 'Are we making sure that our kindergartners are not chronic truant? Are we making sure that young people can read by the time they're there in the third grade? Those are. Some of the strategies that by the time that population of young people reach their pre-teen and teenage years, we will be in a much better position to believe'",
        "'speaker_3': 'that they are not on a path to detention yet, on a path toward graduating from high school and ultimately post-secondary education opportunities. And so there are things that we can do today for young people that are in our juvenile justice system that we should continue to focus on.'",
        "'speaker_3': 'More importantly, we have to do a better job on the prevention side if ultimately we want to divest from our juvenile justice system in a meaningful way and reinvest those funds in helping young people to thrive.'",
        "'speaker_2': 'I fully agree with you, Mr. Nance, that prevention is our is the greatest strategy that we have. At the same time, you mentioned to yourself, we're dealing with kids with lots of trauma year after year after year of trauma.'",
        "'speaker_2': 'And then we put them in a small cell. And when I visited the jail, I walked in myself and I closed the door. I think after 2 hours in that setting, I would go crazy myself. And so to have kids who have gone through trauma and then put them in a small cell, concrete cell, especially the ones'",
        "'speaker_2': 'who have committed misdemeanors, I think is a damaging experience for them. So I hope that we will continue to work together to innovate that practice in addition to focusing on the upstream factors that we need to focus on.'",
        "'speaker_3': 'Absolutely. And to be clear, unlike in some other jurisdictions, the detention facility and THAAD does not control the front door to our detention facility. Right. And so to the extent that we want to reduce that number of young people that enter the facility, we have to work in partnership with the rest of the juvenile justice system to'",
        "'speaker_3': 'make sure that we have a comprehensive strategy to not only reduce overreliance on detention, but to also make certain that we have community based alternatives that keep young people out of the juvenile justice system to begin with. I think there is a commitment for that level of partnership.'",
        "'speaker_3': 'I also believe that to the extent that we are effectively partnering with these other juvenile justice agencies, that we're also looking at how we're using those resources. There has to be a commitment to a decision point analysis for every young person that comes through our juvenile justice system so that we know where those pinch points are.'",
        "'speaker_3': 'We know what's driving young people into the system. We know why they're staying for the length of time that they are. And we have more clarity as to what they need in order to keep them out of the system to begin with.'",
        "'speaker_3': 'So, yes, I am committed to doing that work. I know that Director Diaz is committed to that as well. And to the extent that we get the rest of our juvenile justice partners on board, I think that there is great opportunity and great hope that King County can achieve the goals that it has set out.'",
        "'speaker_2': 'And that's one place that I would love to work with you on is that data sharing piece. Because you're right, much of the gatekeeping role is happening before you, law enforcement, courts, state legislation. If you're able to gather that information about where that flow is coming from, that's something we would like to review.'",
        "'speaker_3': 'Great. Thank you. Thank you.'",
        "'speaker_0': 'Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. Good to see you. And look. Hi. So could you tell me how many youth are in detention today?'",
        "'speaker_3': 'So today we are at I believe we're at 34 young people in custody.'",
        "'speaker_1': 'So when I first got here, we were at 198. So now we're at 34. So I think we need to celebrate how far we've come. There's places to go, but how far we've come. And I think you mentioned some things that we really need to be very cognizant of.'",
        "'speaker_1': 'Number one, there are parents who refuse to take their children back. There are children that have threats from gangs that cannot go home. And there's also a broken DSH system of foster care where they won't take these children.'",
        "'speaker_1': 'So I think as we talk about who's in there keeping the categories very clear, these are children that might be misdemeanors, but the parents won't take them just they just won't take them. And the gang would take them, but they have a threat on them so that we aren't saying that we're mistreating misdemeanor children and when in'",
        "'speaker_1': 'fact, the truth is we're keeping them alive by keeping them in a place that unfortunately is the safest place for them to be because other parts of the system are broken. So I think keeping that number so people can be aware of how other things are broken.'",
        "'speaker_1': 'Also keeping the number of the auto decline numbers separate from the under 18, because I think we've done an awesome job at bringing other decline kids back to a place where they have a library, a gym, a clothing shelter, counseling, medical and the things that they may not have had in the same amount, including schooling at an'",
        "'speaker_1': 'adult jail where they were before. So I would like to see that number lower, which is what we've been doing for the last years to get from 198 down to 34. But I think as we have talked about, we need to know who those 34 are and be able to analyze that in such a way that we'",
        "'speaker_1': 'aren't holding and saying that our system isn't a good system. If you look nationally, are we number one in the country for the lowest incarcerate incarceration rate per capita?'",
        "'speaker_3': 'I would say, yes, we are among the best in terms of lowest incarceration.'",
        "'speaker_1': 'I think that's important for people to know that we are the lowest in the entire country because we put all these programs together and have made a difference. And we did open up the best starts for kids to do exactly what you said to stop the pipeline.'",
        "'speaker_1': 'We've worked with the schools, but I'm looking forward to working with you after all this good work to get this far where the next things are. And I would be very interested in knowing because along the way the question was along the way, did we change the design of the building?'",
        "'speaker_1': 'And in fact, as we were going along during the last four and a half years, prior changed their ratios. There were a lot of other federal laws that changed, and we had to be very nimble about making those readjustments.'",
        "'speaker_1': 'So and I know and I think that was one of you did a final check the other day of some upgrades at the very end in the building. Which one of you did that? I can't remember.'",
        "'speaker_3': 'Well, that's a daily activity for me these days.'",
        "'speaker_1': 'So when you brought us the list at the meeting two years ago, I think we voted to take care of all those.'",
        "'speaker_3': 'Thank you for that support. Yes, you did.'",
        "'speaker_1': 'So we have tried very hard to keep this state of the art so that it is a respectful place for people with a variety of needs. And I'm thankful that you're going to be working with us.'",
        "'speaker_3': 'Councilmember Lambert, thank you for your comments. Greatly appreciate it.'",
        "'speaker_0': 'Councilmember Nevsky.'",
        "'speaker_4': 'Thank you, Mr. Chair, and thank you very much for appearing before us today. Mr. Nance, I'm sorry that you and I have not had a chance to meet and talk in person. I know that was promised by Mr. Six Keller, but for whatever reason, it hasn't happened.'",
        "'speaker_4': 'So forgive me if I have a couple of questions here.'",
        "'speaker_3': 'No problem.'",
        "'speaker_4': 'More efficient than a one on one. You know, we all, as legislators, are proud of certain pieces of legislation that we work on. And one of the things that I was able to right here in pass was a ban on solitary confinement of young people in the facility or opening.'",
        "'speaker_4': 'And not that that's anything that should have been difficult. But it's a it's a point of pride for me in this council to have advance that legislation now. We've had some hiccups in implementing a little bit, but I wonder if you've had a chance to read that legislation and whether you have any concerns about being able to'",
        "'speaker_4': 'implement and honor its intent on a go forward consistent basis.'",
        "'speaker_3': 'Thank you for the question, Councilmember Demovsky. First of all, let me say that, yes, I have had an opportunity to read the legislation several times, bisecting it, understanding all the elements, especially as we have looked to achieve compliance with the elements of the ordinance.'",
        "'speaker_3': 'I will also state that I appeared in Olympia to testify in legislation before the representatives with respect to the statewide legislation that would call for the ban on solitary confinement. I testified on behalf of King County in support of that legislation and Representative.'",
        "'speaker_4': 'Frame's bill pardon Representative Noelle Frame's Frames.'",
        "'speaker_3': 'That is correct. And I also spoke and referenced the local ordinance that was passed here in 2017 that you wrote. And so I believe that that we should not ever detain a youth in a room for punitive purposes.'",
        "'speaker_3': 'I think that operationally, there are times when a young person may be in the room at the youth request because of a medical need or a variety of of reasons that are unrelated to their conduct that we need to work through.'",
        "'speaker_4': 'And our legislation allows that flexible.'",
        "'speaker_3': 'Yes. And I did see some of that. In the legislation. I think we believe that that the legislation makes sense. We have been working very hard to comply. I think that documenting that evidence of compliance is challenging without an electronic system to capture each and every one of those safety checks.'",
        "'speaker_3': 'So we're really relying on a heavily manual system to do that, both to capture that data in the moment, but more challenging to roll that data up in such a way as to be able to report out on that.'",
        "'speaker_3': 'We've made great progress. And and I think that our staff recognizes the importance of eliminating solitary confinement, room confinement. And and we hope that we can continue to work with this body as we discover opportunities to continue to improve and perhaps some opportunities to revise in ways that make sense both for the council bodies, but also for'",
        "'speaker_3': 'the community and for the operations of our facilities as well.'",
        "'speaker_4': 'You mentioned in your opening remarks the overall framework of a public health response, and that's something the executive has proposed. How we handle young people held in detention. And I'm interested in your thinking. You also described kind of a merit or points based system, which I know we use and is typical in facilities to get into the'",
        "'speaker_4': '. What's the primary merit center?'",
        "'speaker_3': 'The merit.'",
        "'speaker_4': 'Center?'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'It strikes me when you're seeing a medical professional, is that the doctor or the practitioner doesn't kind of make you do good behavior to get the things that are good for you. They just make that available. And I wonder if instead are instead of requiring a young person to earn those points to get into the rec center'",
        "'speaker_4': 'or the merit center, if the default shouldn't be, you're in the educational setting, you're in the rec center, you're being treated as a young person and wrapping those positive reinforcements around you. And only if you earn your way out of that, you know, do you go back to some of the stuff that might be a little less'",
        "'speaker_4': 'enjoyable. You see, I'm saying they're kind of a different frame of perspective, a different reference instead of your bad. But you can earn your way to something good. You're good. We're going to treat you with positive reinforcement experiences and opportunities, and only behavior that makes it unsafe for others or unproductive would get you out of that.'",
        "'speaker_4': 'Is that is that.'",
        "'speaker_3': 'Well, I mean, I think that that is certainly an approach that could be implemented. Part of the responsibility that we have for managing young people in a detention environment is it is also about managing their conduct. And some of these young people may not have developed the self-control or the consistency in positive and appropriate interactions with their'",
        "'speaker_3': 'peers and or with other adults, for that matter. And so part of what what we have an obligation to do is to create an environment that not only teaches those new skills, but then provide some incentive for the young people when they comply with those expectations, when they reach those standards far.'",
        "'speaker_4': 'And so often that approach, consistent with the contemporary literature that's out there on best practices for, say, helping young people out.'",
        "'speaker_3': 'What feels.'",
        "'speaker_4': 'A little dated to me.'",
        "'speaker_3': 'With respect to that.'",
        "'speaker_4': 'You're the you're the expert. I'm asking.'",
        "'speaker_3': 'No, thank you for the question. With respect to a a merit center center, I think there has to be a variety of strategies. There is no one size fits all in the way that we interact with young people in our custody.'",
        "'speaker_3': 'And there are some young people who will be able to meet those minimum expectations quite easily, others who will struggle. But I but I do want to separate our commitment to a therapeutic trauma informed public health approach from the day to day activities involved in managing behavior.'",
        "'speaker_3': 'I think that while there may be some overlap in those there, there are also very distinct concepts that need to be considered with respect to a trauma. Informed approach, for example. That's a recognition that young people have experience, adverse childhood experiences.'",
        "'speaker_4': 'Don't you have to carry out that concept of a trauma informed approach to supporting young people who are in detention into the practices of the facility? Yes. I mean, why would you draw? Why would you separate those two?'",
        "'speaker_3': 'But what I'm and what I'm separating is the fact that there are clinical needs that a young person may have that are learned based on an assessment, and that there are specific clinical strategies that are designed to respond to those clinical needs in a therapeutic manner.'",
        "'speaker_3': 'And and we should always do that with our young people. But but we should also prepare them for the community that they will return to, where society will have expectations for them that they will have to meet, and that when they meet those expectations, that there are incentives to continue to work hard to get to the next'",
        "'speaker_3': 'level. And so that's not about being punitive. It's not about denying a young person an opportunity. It's about creating an environment that reinforces and motivates young people to do better, to be better, to continue to improve. And so while I'm not objecting that that we could make the merit center available to every young person and then perhaps'",
        "'speaker_3': 'pull that away when they don't comply. The best practice literature is that instead of having a system that's based on a punitive response when young people misbehave, that it is far better to create opportunities to incentivize the behavior that we seek in the young people that are in our care.'",
        "'speaker_4': 'Final question or topic. Sure. Your last employment was at the city and county of San Francisco last June. The board of Supervisors there voted 10 to 1 to close their juvenile justice facility by the end of 2021.'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'Do you support. Did you when you're down there, did you support that policy change? Were you involved in the development of it? Did you oppose it there doing by providing alternative facilities and programs that support what many in the community here are interested in seeing us do?'",
        "'speaker_4': 'So I'm wondering, since you were there, what's your take on it? What was your role in that?'",
        "'speaker_3': 'I, I would say that. It was rolled out in a fairly quick fashion. The legislation was introduced in April. I had not had an opportunity to review it prior to its introduction, so I didn't really know what the details were.'",
        "'speaker_3': 'In California, detention facilities are approved and the standards for those facilities are set by a state agency, the Board of State and Community Corrections in any county, the Superior Court, the judges to determine what is a suitable juvenile detention facility.'",
        "'speaker_3': 'And as the discussion regarding the elimination of San Francisco's juvenile hall, a facility that was built approximately 12 years ago, is that came on the radar. I expressed concern that eliminating the facility without any consideration for the state regulations with respect to alternatives or creating an opportunity where there was a voice of the judicial branch with respect'",
        "'speaker_3': 'to what those alternatives would be and the lack of clarity as to the future plan and the absence of the existing facility, that all of those were reasons where we should take pause before a date certain was established to close the existing facility.'",
        "'speaker_3': 'And so while I certainly believe and support the reduction in the overutilization or the utilization of secure detention, I was extremely concerned that that would happen before a more reasonable alternative could be developed.'",
        "'speaker_4': 'They did put together a work group to implement a plan and program on its on the way to closure. So do I understand your answer to me that you were not supportive of that legislation for the reasons you articulated?'",
        "'speaker_3': 'That is correct.'",
        "'speaker_4': 'Would there have been any basis on which you would support the closure of the juvenile detention facility?'",
        "'speaker_3': 'Yes. And as I stated, if there is a clear plan for the alternative, that wouldn't adversely impact the youth and families that were in our system requiring them to be moved outside of the county. I believe that we in San Francisco could have proceeded in a thoughtful way in the in the absence of a clearly articulated alternative'",
        "'speaker_3': 'site. Environmental review. A budget. A strategic plan. All of the things that a capital project would require. It was more aspirational than than concrete. And so I don't have any concern about moving in that direction. But clearly, there has to be a clear plan to get there.'",
        "'speaker_3': 'And the group that you identified hadn't developed that.'",
        "'speaker_4': 'Yet, 10 to 1, the supervisors yet to proceed. So you're up here now and you've stated that there is a way where you could be supportive of closing the facility. Would you take it upon your self in this role to develop the specifics of a plan with budget facilities, environmental review, the different elements that you've outlined there'",
        "'speaker_4': 'to see us achieve the aspirational goal as has been described as zero detention, but to bring it to reality. Because I'm impressed with the boldness get there not we'll see at the San Francisco Board of supervisors to say let's let's let's take action and move in that direction rather than articulate a going.'",
        "'speaker_4': 'I hear your concerns there. They seem reasonable and valid, but would you take it upon yourself in this role to bring us closer to that vision in reality instead of just aspirations?'",
        "'speaker_3': 'Well, first of all, I don't know that I can say that that is within my role in my current capacity here, to take that upon myself, to move that vision. I can say with confidence that if that is the will of the county, that I will do everything within my power to support it.'",
        "'speaker_3': 'I believe that there are a number of great ideas that exist across the nation and elsewhere around the world to respond to the secure custody needs of young people in the community. And I think we should explore any of them that will create better outcomes for young people in King County.'",
        "'speaker_3': 'And if that means sitting at the table and helping to develop those strategies, I'm happy to be a part of that. Again, I, I was in a different role in in King County or in San Francisco as the chief probation officer there.'",
        "'speaker_3': 'Not the role that I'm in in this capacity. But rest assured that if that is the vision of the county through the executive's office and this council, I will support it.'",
        "'speaker_4': 'I hope we can get you to be more than a supporter but a leader on it with your expertize.'",
        "'speaker_3': 'I'm happy to contribute in whatever way can help that be achieved.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Balducci.'",
        "'speaker_1': 'Thank you, Mr. Chair. I'm going to just make a quick statement, and I'm going to try to keep it to less than what we offer to the public in terms of time to speak. I am so impressed by your experience, your the different ways you come at the challenge of youth detention did have the opportunity to also'",
        "'speaker_1': 'go on a tour of the detention facility. And we had a lot of time to talk through your tour. So I don't have a lot of questions, but I want to add a little bit to this discussion. I think what you're being asked is if you had been here three years ago or four years ago, would you'",
        "'speaker_1': 'have supported building the new facility or not? I'm here to say it's built and we're hiring you to run it. The question is, what are we going to do with it? Right. And I think all of us here agree that we should have as few youth in detention as possible.'",
        "'speaker_1': 'Kids locked in a small cell are being traumatized. Kids who are not locked in a small cell, but whose freedom is being curtailed because they were thin in a detention facility, are being traumatized. This is not the place I think we all agree.'",
        "'speaker_1': 'This is not where you send kids for therapeutic reasons. You send them there for other reasons. And we should limit that as much as we absolutely can. And I'm hearing no disagreement and I'm seeing you not. And everybody up there.'",
        "'speaker_1': 'Not yet. So. So the goal of zero youth detention is absolutely the right goal, whether we get there or whether we just asymptotically get closer and closer all the time. That is the direction we should be going. I think that the proposal from the executive branch to take a public health approach to juvenile detention is very interesting'",
        "'speaker_1': '. It's unique. I don't know of anybody else who's doing it, and I think that maybe a way to break through to that next level of can we reduce that population even more while maintaining public safety? I think what we want to do is we want to continue the county's focus on early intervention and family supports through things'",
        "'speaker_1': 'like the best starts for kids levy. We want to have community investment so that the communities are strong and can support themselves and support their youth. We need human services for kids and families who do have challenges in their lives.'",
        "'speaker_1': 'We have a strong policy role. You talked about not controlling the front door. It was absolutely controlling the front door that caused that first big jump down from 200 to where we are today. And Cliff's 90 because he was part of it.'",
        "'speaker_1': 'Right. I wasn't here at the time. And that was saying you can't bring any old kid here because they shoplifted a candy bar. You have to meet some kind of a police officer. You have to meet some kind of a level or you can't bring that kid here because we're not going to lock a kid up for'",
        "'speaker_1': 'a minor, minor crime. Council members are always pointing to, are we really living up to that? Are there other youth in detention right now who we could say they don't really need to be here and find more alternatives?'",
        "'speaker_1': 'We need obviously more diversion, more alternatives. The building allows for that. And I think we should be very proud of that fact. And of course, it's all about partnerships and system integration at schools dependency and and like homelessness response.'",
        "'speaker_1': 'All those organizations that work around you need to work with us. So I am delighted to have you come and bring all your experience and your heart and your and your, you know, integrity to this role. And I want to just encourage you to think about that holistic sort of approach that we have to take.'",
        "'speaker_1': 'We have to deal with what's happening now. We have to plan for the future, and we have to do it in a really holistic way. I think you're the right guy to do it. I'm going to be very happy to vote for your confirmation.'",
        "'speaker_1': 'Okay. Forward to working with you.'",
        "'speaker_3': 'I appreciate your support. Thank you.'",
        "'speaker_0': 'Councilmember Cole.'",
        "'speaker_5': 'WELLS Thank you, Mr. Chair. And I'd like to say ditto to what Councilmember Bell did. She just said very pointed and right on remarks. I see this is very complicated, though complex. And throughout my legislative career, I've been disinclined to lock kids up.'",
        "'speaker_5': 'I when I was first in the state Senate, I was the lead force against the Baca bill. I'm not sure if you know what that is, but so I have a real disinclination there. But I understand that there are some compelling reasons, and I think you've stated them well, that we have to work for the betterment of'",
        "'speaker_5': 'the kids who for various reasons have been traumatized in their life and we do not want to contribute to further traumatization. I was very fortunate with some of my staff to visit the New Children Families Center last Thursday with Councilmember McDermott and his staff.'",
        "'speaker_5': 'And I don't know if it's the timing of when other council members have visited there, but I was really pleased with the bricks and mortar. I was pleased with the detention floor to overall as much as I could be, but the cheerful, bright colors, the big, very large library, the classrooms, I mean.'",
        "'speaker_5': 'It was night and day to what I had perceived going through the former center, the detention center, and I may have understood things or misunderstood things, but when I talked with you on our tour, I was pleased that the kids were not locked up in separate cells.'",
        "'speaker_5': 'It was during the night time. Did I hear that correctly?'",
        "'speaker_3': 'That is correct. Primarily during the the overnight hours, although the restroom facilities are in each of the rooms. So the young people take breaks throughout the day so that they have access to those facilities.'",
        "'speaker_5': 'I'm concerned if people watching this are thinking that the kids are locked up in individual cells the whole time. They're just not. I think there's 16 person units that were very open and lot of things going on there.'",
        "'speaker_5': 'That is correct. Liberties and the food and so forth. And the library, the classrooms. But I see I'm old in this. And I can remember when the state had a lot of liability because kids said they were called schools then such as Serco, Glen were in two person living units and the kids were very vulnerable.'",
        "'speaker_5': 'Some of them and were raped, were sexually assaulted by the person who was in the unit with them overnight. There's a little window that was all in the door and the guard would go around and make rounds once every half hour and look in the units.'",
        "'speaker_5': 'But of course, the kids knew when that was happening. And there were, I think, two or three wings. And when the security guy was in the other wing, that's when kids were very vulnerable. And as a result of that, not only was the state liable for a huge trauma to kids who are assaulted, but also for lawsuits'",
        "'speaker_5': 'and other things. But what we did is develop a sexually aggressive youth measure through an instrument to determine which kids were sexually aggressive and which weren't to try to get away from kids being placed in very vulnerable situations.'",
        "'speaker_5': 'And from my tour last week, I had asked about, you know, why kids were in individual units overnight. And it seemed to me that's part of it, is some type of protection and then away from all the the goings on so they could have some time now I that could be just a no.'",
        "'speaker_3': 'That's absolutely correct.'",
        "'speaker_5': 'I'm not trying to just buy into everything that's said that I think, again, this is complicated. People get upset with having an average daily attendance. Now, I think it's 43 somewhere in.'",
        "'speaker_3': 'There on average. Around 40.'",
        "'speaker_5': 'Yes. As you said, it's 34 today. Correct. But on. And so the concern I've heard has been that we have capacity for 100. How many?'",
        "'speaker_3': '112? 100, the capacity for the state to.'",
        "'speaker_5': 'Also look at factors such as gender. You don't mix up the girls and the boys. You have to look at gang activity. So the kids who are part of one gang that's in conflict with another gang are not going to be in the same unit.'",
        "'speaker_5': 'And so my point is there are many extenuating reasons. I'm not trying to stick up here for locking kids up, but I'm very pleased with what I have seen there on the tour. One question here, though, is it accurate to say that under federal and or state statutes that we have to have a detention center, or is'",
        "'speaker_5': 'that in?'",
        "'speaker_3': 'That is correct.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_3': 'You're welcome.'",
        "'speaker_0': 'Student Council member.'",
        "'speaker_2': 'Mr. Chair, I would be my privilege to move proposed motion number 2019 0480 confirming the appointment of Alan Nance as director of Juvenile Division.'",
        "'speaker_0': 'Thank you. Councilmember Dunn has moved adoption of our motion 2018 480 council Councilmember Dunn and.'",
        "'speaker_2': 'To speak to it. Thank you, Mr. Chair. Mr. Nance. In my view, we are incredibly lucky to have you coming up to our community. Your willingness to serve in this very important role. I think the timing is is really good.'",
        "'speaker_2': 'We've had a, you know, a real sort of dramatic public debate about the facility itself. And that debate has triggered a variety of policies here at the county council. You weren't really in the fray, which is kind of good, but you were in your own fray, I'm sure, down in San Francisco dealing with things down there.'",
        "'speaker_2': 'But, you know, your experiences without. Question and your attitude is excellent. And you just, I think, in my judgment, successfully ran the county council gantlet, which can be challenging. You know, we went to stuff, we were in the middle.'",
        "'speaker_2': 'It was up there. There was a couple pretty good. You did very well. And here's here's here's here's my challenge. And then I just want to is, is because you come from outside of the community of Seattle that you continue to bring new ideas and energy and enthusiasm and policy direction that I hope you will continue to'",
        "'speaker_2': 'infuse. One thing up here, we don't want to have you know, we've done it this way. Let's just continue to do it that way. We want to have, you know, ways in which we can find efficiencies and improve the overall outcomes, which, as my colleagues have aptly noted, is is not just, of course, about incarceration rates.'",
        "'speaker_2': 'It's about the outcomes on the on the street. And and that's a good thing. So I'm eager to support your nomination, vote for it, and I encourage my colleagues to do the same.'",
        "'speaker_3': 'Thank you. Councilmember Dunn. And I accept that opportunity to continue to bring new ideas.'",
        "'speaker_2': 'Thank you, sir.'",
        "'speaker_0': '16. No further discussion, madam. Kirk, if you please, call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilman Balaji. Councilor Dombrowski. Councilmember Dunn. All right. Councilmember Well, I'm councilmember member. I have a member of the group. Councilmember One right there. Councilmember John Gay. Mr. Chair. Mr. Chair, the vote is nine I's and zero notes.'",
        "'speaker_0': 'Thank you for your vote. We've given a do pass recommendation to motion 2019 for 80. I think I misspoke earlier and called it 2018 and we will advance that to full council. But we come from putting that on consent.'",
        "'speaker_0': 'We put that on the consent agenda.'",
        "'speaker_3': 'Thank you very much.'"
    ],
    "Initial Framework for the Gender Identity and Sexual Orientation Inclusion Task Force.": [
        "'speaker_0': 'Thank you. And that takes us to item eight on today's agenda. This is proposed motion 2019 476, which would approve the initial framework for the King County Gender Identity and Sexual Orientation Inclusion Task Force as required by earlier motion, which established the task force.'",
        "'speaker_0': 'Jeff Mumm will offer a brief staff report and when you're ready, invite panelists up and we'll proceed. And as we begin, I want to acknowledge and apologize and acknowledge that you've been here for a full 2 hours of committee hearing.'",
        "'speaker_0': 'Appreciate your being here through this. And even more so appreciate the work that you're bringing to us today. Is it Councilmember.'",
        "'speaker_1': 'Lambert? Thank you. Thank you. I just wanted to say that I won't be able to hear your presentation in total because I have 75 homes that are in trouble right now. So I will be leaving. But I want you to and I'll be watching it on tape.'",
        "'speaker_0': 'Thank you, Mr. Mayor.'",
        "'speaker_2': 'Thank you, Mr. Chair. I heard the request for a brief briefings, but I will be brief. So, for the record, Jeff, ma'am, counsel, central staff, before you is motion 2019 0479, which would improve an initial framework for the County Gender Identification and Sexual Orientation Inclusion Task Force.'",
        "'speaker_2': 'The Staff Report, which was authored by Sam Porter, who can't be here today, is found on page 15 of your packet in. And to be brief, the framework is in compliance with the with the initial council motion 15162 which the Council adopted to establish the task force.'",
        "'speaker_2': 'And it lays out a timeframe, a goals and a budget for the task force to do its work over the next year. And I think the major or not the major the the one issue I will highlight is in the budget implications.'",
        "'speaker_2': 'The task force, the second 2018 omnibus budget included expenditure restriction within the Office of Performance Strategy and Budget for 100 and $100,000 to support the task force work and the budget outlined within this document and ranges between 175,000 and $240,000 to support the work.'",
        "'speaker_2': 'And that would be for a consultant to hire one term limited position. And then the support honorarium of $100 a month for task force members. The executive has stated that they don't intend to seek additional funding to support the task force.'",
        "'speaker_2': 'So it's so I'm assuming in the executive staffing speak to this more that they would absorb those costs within the department. And that concludes the the very brief report. I think you wanted to save time to hear from the task force members themselves.'",
        "'speaker_0': 'Very much so. See no questions of Mr. Ma'am. I invite the members of the Task Force Forward. And while they don't have a complete list, I also know that at least one of your members seems to have had to leave, I assume, due to the due to the hour.'",
        "'speaker_0': 'So. I apologize again. And we have the Mr. Members stood up with the chair at the end as well. Good afternoon and welcome.'",
        "'speaker_6': 'Thank you. Terry McDermott and members of the Council. And my name is Kelly McDermott. I work on external relations in the executive's office, which means I have the pleasure often to work with our community partners and different taskforces and community engagement opportunities.'",
        "'speaker_6': 'I prefer she and her pronouns and I am the Deputy Director of External Relations in the exact office that Jack Kennedy can go quiet askance.'",
        "'speaker_1': 'A la de Channel E Jen.'",
        "'speaker_6': 'My name is Samantha Bhaskar from the Haida Conquer and Inupiaq nation. And I'm here. I prefer she here, her pronouns as well. And then I'm here with Na Elihu friend as their community engagement specialist Inc.'",
        "'speaker_3': 'Hello, Honorable Council members. And I tell you what. Waiting is not a problem when real democracy is happening. So thank you, Marsha Boxer. She and her Ingersoll gender senator Martin Luther King County Labor Council, the new Washington State LGBTQ Commission, Equal Rights Washington.'",
        "'speaker_3': 'But so honored to be a part of this project that we're going to present today.'",
        "'speaker_1': 'Tal Afar. Armenia is a society for Hanon and thank you for having us today. We're really honored and humbled to be here. Pronouns are she her and so one feminine pronoun. And I'm here on behalf of Pride, Foundation, Utopia, Seattle, Trans Women of Color, Solidarity Network and the Washington State LGBTQ Commission.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Good afternoon. Steven Sawyer, executive director of Spokane, formerly known as People of Color.'",
        "'speaker_3': 'Against AIDS Network.'",
        "'speaker_2': 'Also with the State Western State LGBTQ Commission. Thank you.'",
        "'speaker_6': 'Great. And we'll be brief, but we wanted to take a minute to talk a little bit about the process that led us here today. And I will just say we had three long, wonderful task force meetings that went into the creation of the document in front of you, the initial framework.'",
        "'speaker_6': 'And we took time to educate and become educated about the work programs and lines of business for each county department, agency and branch of government and separately elected office, which was incredibly helpful to help the task force and winnowing down and determining particular areas of focus for the work ahead.'",
        "'speaker_6': 'We had a meeting after we transmitted the framework with council members Baldacci and Cole Wells to talk about the budget request. And Jeff was correct that we did make a compromise around executive staff sort of subsuming the role of in place of hiring a TLT to liaise with county departments.'",
        "'speaker_6': 'And we've worked to identify a roster of points of contact in all executive departments so that when the work kicks off, once we've onboarded our consultants and sort of rebooted in the second phase of our work, that will we'll be able to really easily and quickly respond to the task force's needs as it relates to departments in'",
        "'speaker_6': 'separate and separately elected offices. And we just want to thank the Council for their unanimous support of the budget request. We are looking forward to the work ahead. And now I'm going to pass it on to Samantha and Steven to talk a little bit about the different elements of the initial framework, including our inclusion of a land'",
        "'speaker_6': 'acknowledgment at the top of the report, as well as the guiding principles focusing on equity, intersectionality and the centering of impacted communities in the work ahead. Thank you, Kelly. As I said before, in my language, my name is Samantha Basco here at Na Elegy Fund.'",
        "'speaker_6': 'I was really intent on including a land acknowledgment in our body of work, not as sort of hollow words that make documents and meetings longer, but rather as an opportunity for us all to ground our work in this place and with each other.'",
        "'speaker_6': 'So I really and truly believe that land acknowledgments are an opportunity and a responsibility to one another and to this land and the people who are here first to work with each other for the care of.'",
        "'speaker_1': 'The land and each other.'",
        "'speaker_6': 'I really believe also that a land acknowledgment is sort of the beginning step. It's definitely not the end step.'",
        "'speaker_1': 'And that with land acknowledgments, it's sort of the opening.'",
        "'speaker_6': 'To a dialog in which we make sure that Native American people are included at the table on which our land, our culture, our traditional knowledge and our labor helped build. I believe that in our.'",
        "'speaker_1': 'Culture, in many Native American cultures, there is a.'",
        "'speaker_6': 'People we call to spirit, people who are diverse in gender expression as well as sexuality, and they hold a very honored and special place in our culture. They are celebrated. They are who we traditionally have gone to in both times of peace and war for advice and counsel and who have unique gifts that they give to community'",
        "'speaker_6': 'when they feel safe and welcome. And so it is within this work that we really wanted to ground that opportunity for education and learning among each other and look to all marginalized groups within this county to really make them feel secure, welcome and included in our body of work so that they can feel safe and welcome enough'",
        "'speaker_6': 'to share their gifts with us.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'And just to.'",
        "'speaker_2': 'Talk about the social justice and equity piece, you know, so often as the executive director of okay and I'm talking about social justice and equity as we do work.'",
        "'speaker_3': 'Broadly in the community, but we've always.'",
        "'speaker_2': 'Still had a focus around LGBTQ issues as well.'",
        "'speaker_3': 'And it's incredibly important that we think there are folks.'",
        "'speaker_2': 'That are marginalized, especially our trans women of color. You know, African-American men who have sex with men is very.'",
        "'speaker_3': 'Important to kind of center this work around that.'",
        "'speaker_2': 'Oftentimes they don't get a voice at the table. And so they're creating this. By creating this, you allow them to have a voice at the table and have some buy in in the process of government, which is very key and important to this work.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'So beginning my activism in the late sixties and moving to LGBTQ issues in the mid seventies and focusing on trans sense, I have to say this is a real moment in history and you are making this moment happen and we're doing the part.'",
        "'speaker_3': 'I wanted to let you know about what we're doing with this task force, what this project is. We're making sure that we're contacting those folks who can really help us do the right thing and the right job. So specific groups that we have identified there in the list, of course, but let me just mention a few.'",
        "'speaker_3': 'We're definitely now aware, thanks to the work of this task force in our meetings, that the Department of Community Resource, Human Resources, Department of Public Health, Adult and Juvenile Detention and many others are departments and areas we need to talk to to make sure that our project around gender identity, around sexual orientation is understood not only in'",
        "'speaker_3': 'those departments, but what they can tell us how to do it. We've we haven't just conjured up we've worked to make real engagement strategies that we have, for example, focusing on the key stakeholders. We ourselves, we know many of those folks, but we don't know them all.'",
        "'speaker_3': 'Although the work of this this taskforce has indeed shown us some other partners that we are definitely going to include. We're also going to create an online tool. No, no surprise there, but we will definitely have that for a public commentary.'",
        "'speaker_3': 'We'll have our materials up for us to see. It'll be there for us in the way that it is done these days. Very different than it was in the sixties. Let me tell you, we are going to invite county staff, clients, experts, anyone that has been identified to us to join us, to help us.'",
        "'speaker_3': 'And then finally, we are fully aware of organizations, other organizations that we need to connect. For example, Immigrant and Refugee Commission is one that we will want to talk to, have been talking about and to and so many others, our Community Policing Commission, disability rights and so on.'",
        "'speaker_3': 'We have the large list. We are aware we will contact. We will do the work. And many thanks to you.'",
        "'speaker_1': 'And we're really grateful that you've all approved the budget around Ontarians, and it's something that's been tricky to talk about even with the other commissions at the table. And and it's really important that we honor the work of community organizers, right?'",
        "'speaker_1': 'As Council member Buttigieg said before, this is a community investment. Right. When we leave our jobs, we the work doesn't stay there. We take it home. And we work to keep our community safe and to build stronger relationships and keeping those communities safer.'",
        "'speaker_1': 'So and also I just want to mention that when we're not doing when we're here as part of the task force, every for every $100 that's awarded by a foundation to LGBTQ communities, we get about $0.28 of that.'",
        "'speaker_1': 'And it's even less for trans communities, it's about $0.03. So it's really important that we seize this opportunity to do something different, to honor the work of organizers like Marshall, who's been doing this since the sixties for free and for a lot of marginalized communities and for a lot of black indigenous people of color, we've always done'",
        "'speaker_1': 'things for free and it's time to do something different. So I think.'",
        "'speaker_6': 'And to close. I'm happy to talk a little bit about what's next. Next steps for the task force. So we had our I worked with our procurement department and our RFP for consulting services for somebody to come and help facilitate to help us facilitate and work with the exact staff on community engagement and to write our final'",
        "'speaker_6': 'report. That is the recommended strategy as well as a set of recommendations for how we might be a more inclusive government when it comes to different gender identities and sexual orientations outside of dominant narratives. So that bid is closing next week and hopefully we will have somebody on board at our next task force meeting is in the'",
        "'speaker_6': 'building on February 26. That's open. So if you want to attend or send your staff or let your constituents know and please feel free to do so, I'm happy to send information to any offices. And additionally. So with the proviso on the honorarium funds in our initial framework, we said we wanted to disperse the funds on a'",
        "'speaker_6': 'monthly basis, but the proviso asks us to take a look at how we might bring honorarium to scale for efforts such as this moving forward, where we're really asking folks who represent or work with marginalized communities to step away from their regular duties and come and help us out as an institution.'",
        "'speaker_6': 'And so a small committee of task force members is going to be working with executive staff and folks from PSB, the Office of Equity and Social Justice, as well as our Boards and Commissions liaison to develop some processes and protocols about how we will disperse honorarium and what it might take monetarily to bring it to scale for'",
        "'speaker_6': 'these types of processes moving forward. And with that, I think we're happy to answer any questions that you might have.'",
        "'speaker_0': 'Thank you. I think that a land acknowledgment is indeed a first step and an important step to recognize a community that stewarded and cared for these lands for so long and has the wisdom to recognize unique people as being as perhaps having unique contributions rather than to be other than shunned as so many other communities have.'",
        "'speaker_0': 'Thank you. And talking about a ability to evolve in time. Marcia is a woman ahead of her time. Marcia has started with bullhorns and organizing and today is not afraid of organizing with websites and social media. The report and speeches don't follow Marcia at a podium as Councilmember Dombrowski I know very well.'",
        "'speaker_0': 'But the work that you've all collectively come together to do on behalf of the county and people of the county is really essential. Thank you for bringing this up to us and for the work that you're prepared to do for the rest of the year.'",
        "'speaker_0': 'In your report, you lay out an ambitious set of work for which I'm very appreciative. Questions come. Councilmember Up the Grove.'",
        "'speaker_2': 'Thank you, Mr. Chair. More of a.'",
        "'speaker_3': 'Comment, if that's okay.'",
        "'speaker_0': 'I11 is I will not rule you out of order.'",
        "'speaker_2': 'Why, thank you. I missed the day of the media. I would suggest maybe just shoot it off to all the council members offices. That would be great.'",
        "'speaker_3': 'Also, what you said.'",
        "'speaker_2': 'About Marsha, that, you know, it's a sign of how far the movement have come that you're now with. Was it generations aging for pride as once as the young leader. But I think we all stand on your shoulders and the work you've done.'",
        "'speaker_3': 'May I come in? I think everyone for these exceedingly kind comments, and for me, it's just such an honor to be with my compatriots who are taking us not only through this stage with you, but to the future.'",
        "'speaker_3': 'They are the ones carrying us to the future.'",
        "'speaker_2': 'Definitely.'",
        "'speaker_3': 'And the. I also wanted to thank you for, as you said, centering equity.'",
        "'speaker_2': 'You know, I as a I'm a gay man, I marginalized to some degree, but I'm a man and I'm white and I'm financially stable. And that's a very different experience than a low income trans woman of color. But I think building those coalitions and speaking as one is important, and that only works if we put.'",
        "'speaker_3': 'Equity at.'",
        "'speaker_2': 'The center of that. And so I.'",
        "'speaker_3': 'Appreciate that approach as you.'",
        "'speaker_2': 'Move forward. And then finally, one little as you're doing your work and your relationship building with other organizations, I wanted to share with you a a little victory that.'",
        "'speaker_3': 'You might be able to plug.'",
        "'speaker_2': 'Into if you hadn't heard about. Our last county budget included a little bit of funding for our housing agency to do outreach specific to the LGBT community. And I'm I'm not sure how it's going to be administered they might be contracted was ally ship that had requested the funding and I assume they'll be involved in implementing it'",
        "'speaker_2': 'and there's an opportunity there, as you know well, that the transgender community faces unique challenges, even separate from gay and lesbian population in terms of housing discrimination. And we do have a few resources there and maybe be able to weigh in and help make sure that those are being targeted effectively and that the county's.'",
        "'speaker_3': 'Making good use of. That could.'",
        "'speaker_2': 'Be something that that task force could weigh in on or.'",
        "'speaker_3': 'Participate in. So I want to let you know that body of work was happening.'",
        "'speaker_0': 'Thank you, Councilmember Zala.'",
        "'speaker_2': 'Thank you, Mr. Chair. I just want to thank you all so much for your work and for being powerful voices and advocates. The point you made about honoraria is so important because, like you said, so often black, indigenous, especially women of color, are expected to do work unpaid as expected to march and protest and organize on behalf'",
        "'speaker_2': 'of others unpaid. I would love it if you treated this task force as a model for how we can best engage community. So if you see other ways in addition to honoraria, in addition to be paid being paid things that we should do better as local government in engaging community and partnering with you.'",
        "'speaker_2': 'We would love to hear from you and using that as a model. Thank you.'",
        "'speaker_0': 'Councilmember Dombroski.'",
        "'speaker_4': 'Thank you, Mr. Chair. In a moment, I'll move adoption of the motion to approve the initial framework. But before I do. Earlier on in this hearing, I talked about a piece of legislation of which I was particularly proud.'",
        "'speaker_4': 'And the legislation that I wrote that commenced this work ranks right up there with that. I have not had the burdens and difficulties in my life that the folks in which were aiming to lift up with this work have.'",
        "'speaker_4': 'But you talked, Marcia, about an honor and a privilege do the work. It's an honor and privilege to get to just be a small part of the work that you're doing and all of you are doing. And to me, what makes it so special and important to me is it's about at its core, the dignity of the'",
        "'speaker_4': 'human being. It's a very emotional thing. The dignity of the human being coming to people and meeting folks where they are and who they are, and setting aside false constructs imposed by society. The history lesson that you reminded us of that this is just a rough go.'",
        "'speaker_4': 'I had a little sidebar that really it's a westernized contemporary imposition of these gender identities and that our first peoples aren't burdened by that. They had a more complex understanding and it is pretty powerful when you remind us of that, that just because things are what they are today, it doesn't mean that's what they should be or'",
        "'speaker_4': 'have always been. And so this work at its core to recognize, honor and respect the dignity of each person is what this is about. And I am so impressed with the seriousness with which you have undertaken the work, the thoughtfulness, the way you're in, the depths in which you're going.'",
        "'speaker_4': 'We have almost 15,000 people here at King County working every day. We come in contact with hundreds of thousands, maybe over a million people a year. We have two and a quarter million here in the county. But delivering these vital services and how we treat not only our own folks, but the public that we're dealing with is'",
        "'speaker_4': 'really a foundational principle. And when we look at this, we realized we weren't doing all that we could or should be, and your work is going to help us get there. I think it'll take some time, but I am excited that the policy leaders here in the government are open and willing to learn from you, the experts'",
        "'speaker_4': ', to take your advice and follow your leadership. And I want you to hold us accountable. And when you say we need more resources, don't be afraid to speak up and you need more resources, I think you'll find open ears.'",
        "'speaker_4': 'And when you say we need to make, which I hope you will. These kind of changes in policy and practices, I think you have open minds and eager allies here to do that, and that's the work that I'm looking forward to seeing.'",
        "'speaker_4': 'I'm here. I'm learning myself. The idea was sparked by reading an article when I couldn't sleep about X gender, right? Put an X on your license and start talking to my staff. And they said, Well, look, Ron, it's a lot more complicated and that's a lot more in-depth than that.'",
        "'speaker_4': 'And that's what has generated this. So I'm just very, very, very moved at a very real and deep personal way about the work that you're about that you are doing and the recommendations that are coming. I'm so excited to see it.'",
        "'speaker_4': 'And with that, Mr. Chair, I'm pleased to move adoption and a proposed motion 2019 0479.1. And I understand there's at least one amendment.'",
        "'speaker_0': 'Council member domestic has moved adoption of motion 2019 479 and Councilmember Dombroski. There's a striking amendment S1 and page 33.'",
        "'speaker_4': 'Move adoption.'",
        "'speaker_0': 'Council member Debusk has moved adoption of a striking amendment S1 and from members information is technical changes Marines in a striking amendment at more than 2 hours into a meeting. Right. Sneaking anything by.'",
        "'speaker_4': 'Come on. That's not.'",
        "'speaker_0': 'Discussing questions. Oh, there's. Oh, there's a favor. Please say.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'Those opposing a the striking amendment S1 has been adopted moved to one title amendment on page 35 of our package is before us see no discussion others and favorite please say I oppose May the ayes have it? The title amendment is adopted.'",
        "'speaker_0': 'We have motion 2019 for 79 as amended before us. See no further further discussion, Madam Clerk, if you please call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chair. Counselor. Founded by John Bolton, Muskie. Counsel you're done. Councilman Folau's chapter on climate can cover up the role of companies that on record hire council members on the right. Mr. Chair. Mr. Chair, the vote is seven eyes, zero no's and council members.'",
        "'speaker_5': 'Done in.'",
        "'speaker_1': 'Lambert are excused.'",
        "'speaker_0': 'Thank you. Having received the required majority motion, 2019 479, as amended, is sent to full council with the do pass recommendation. And we will take shall we put that on consent? Without objection, we'll put that on the consent agenda.'",
        "'speaker_0': 'Again, I want to thank you so much for the work you've invested already and the work that you're invested in doing throughout the year as well. Not only the communities you represent, but the entire county and beyond will be Richard for it.'",
        "'speaker_0': 'Thank you. And with that having no other business to come before us, believe it or not, we are adjourned.'"
    ]
}