{
    "Ordinance related to the cultural development authority and its responsibilities, functions, and funding sources.": [
        "'speaker_0': 'It's been moved and is before us. Any comments or changes on the minutes seeing none. All those in favor please signify by saying I any opposed minutes are approved unanimously. Okay, this brings us to proposed ordinance number 2018 0086.'",
        "'speaker_0': 'This item would make some changes to the for Culture King County's for Culture Development Authority. And as I said earlier, we're going to ask this. Our staff, our King County Council staff to make their report first, then move on to the panel discussion and then we'll take public testimony after which the committee will have a chance to'",
        "'speaker_0': 'deliberate on everything that we have heard. Okay. So we have a striking amendment to consider today, as well as the original proposal. And with that, I will call on council staff Leah Greco Zoghbi and Wendy Sue, who thank you both for all your work on this topic.'",
        "'speaker_0': 'And please go ahead and give us your staff presentation.'",
        "'speaker_1': 'Good morning. Council members and audience members. I'm Leah crackles at the council staff. With me is Wendy Sidhu. The materials for this item begin on page nine of your packet. The ordinance for you is concerning county oversight of King County's cultural development authority known as for culture, and it would amend King County Code, the fourth for Culture'",
        "'speaker_1': 'Charter and for culture bylaws. I'll begin with some brief background and then Wendy and I will present the analysis of the legislation prior to the existence of our culture, King County Arts and Cultural Services were administered by the Office of the King County Office of Cultural Resources and within the Executive Office.'",
        "'speaker_1': 'In 2002, the King County Executive proposed and the County Council adopted an ordinance creating the Cultural Development Authority, later named for culture to assume their functions previously provided by the Office of Cultural Resources, as well as some additional functions under state law.'",
        "'speaker_1': 'Counties by ordinance may establish a public development authority defined and often called PTA defined as a special purpose quasi municipal corporation created by a local government to carry out a specific public purpose. The proposal to form the PDA was in response to changes in cultural funding at the time, including a reduction in lodging tax revenue available for'",
        "'speaker_1': 'up. Operations and a reduction in the County General Fund, which resulted in the elimination of General Fund support for cultural grants in 2002. In forming the For Culture PDA, King County wrote an adopted four cultures charter and bylaws and selected the acting executive director and members of the Nominating Committee to select the four culture.'",
        "'speaker_1': 'The initial for Culture Board currently the primary funding sources for for cultures ongoing operations are a special account which was formally called the Endowment Fund. And I'll get into that more in a little bit. And the 1% for art funding, which is which comes from capital budgets, from county construction projects, investment earnings and county general fund money'",
        "'speaker_1': 'for maintaining King County's art collection. So table one on page 11 of the staff report shows four cultures projected revenues for 2018. Historically, a portion of the lodging tax collected in King County has been dedicated to arts and culture.'",
        "'speaker_1': 'And then in 1995, the state legislature reduced that support requiring and also required that 40% of the arts and culture revenues received after January 20 or January 2001 be set aside into an an and a down endowment account, which was to begin supporting arts and cultural functions in 2013 in lieu of that lodging tax support.'",
        "'speaker_1': 'So in 28 and then in 2011, the state legislature once again established a permanent funding stream for arts and culture in King County by dedicating a portion of the lodging tax revenue to arts and culture beginning in 2021.'",
        "'speaker_1': 'And so currently for culture is living off that endowment. Table two on page 12 of your packet shows the uses for lodging, tax for arts and culture in King County over time. Moving to an overview of the proposed ordinance, pages 13 through 15 of your packet provide a section by section summary of the proposed ordinance.'",
        "'speaker_1': 'But in the interest of time, I'm just going to give a brief summary. So the proposed ordinance would require that the King that King County or the County Council accept a accept by Motion for Cultures Board adopted budget prior to transferring funding to forge for culture in the next fiscal year.'",
        "'speaker_1': 'It would modify the for Culture Board appointment process to include one boy board appointment each by county council members and six appointments by the county executive. The requirements for a specific balance of expertize on the board would be eliminated, and it would provide for the county executive to appoint and King the King County Council to confirm the'",
        "'speaker_1': 'for culture executive director and recommended for selection by the for Culture Board. And it would provide for the county to remove the executive director by ordinance and it would provide for the county to amend for culture bylaws to make them consistent with changes to the For Culture Charter.'",
        "'speaker_1': 'Table three on page 16 of your packet shows a comparison between the proposed ordinance and existing conditions. Now turning to the analysis of the proposed ordinance, the ordinance page 17 and 18 of your packet discuss comparisons of the proposed oversight of fort culture to oversight of other PDAs, public agencies and public art programs in the region.'",
        "'speaker_1': 'The full comparisons can be found in attachments six and seven, which begin on page 171 of your packet. The comparison shows that for culture, beginning in 2021 would receive more public funding than most of the other agencies in the comparison.'",
        "'speaker_1': 'It also shows that this proposal would make for culture one of only two PDAs where the founding government plays a role in confirming the agency's executive director. And it would make for culture the only PDA to have its operating and capital budget approved by its founding government.'",
        "'speaker_1': 'I'll now turn to Wendy, who will provide the analysis of the budget impacts.'",
        "'speaker_0': 'Thank you, Wendy Sidhu Council staff and Mr. Crackles IP pointed out earlier this proposed legislation would establish a process for the County Council to review and accept for cultures budget by motion. Specifically, the ordinance would require for culture to transmit its board approved budget for the following fiscal year to the Council by late September each year.'",
        "'speaker_0': 'Under the proposed legislation for culture would be required to transmit information. Similar to that which the Council receives when the executive transmits the county's biennial budget. Specifically, the elements that would be required in the proposed legislation would be budgeted operating expenditures and full time equivalent positions for the next year.'",
        "'speaker_0': 'Capital expenditures for the following six years. And then supporting data including but not limited to a financial plan for the preceding year current year in the next five years. And a description of significant changes from the current fiscal year budget to the next year's proposed budget.'",
        "'speaker_0': 'Under the proposal, if the Council were to not accept the budget by motion, which would mean either rejecting the motion or not taking action before the end of the year, then the county in the following year would begin to discontinue transfers of the county funds that go to 44 culture currently.'",
        "'speaker_0': 'And these funds include the hotel motel tax revenues that Ms.. Zaki described that will begin resuming in 2021, as well as 1% for art funding, the capital program funding that goes to for culture as well as general fund support.'",
        "'speaker_0': 'And the general fund support is the money that goes to culture to essentially take care of the county's art collection. Under the proposal, the transfers would not resume until after the council had accepted a four culture budget by motion and according to the sponsors of the proposed legislation, the rationale for this proposal is to provide greater public'",
        "'speaker_0': 'accountability over the public public dollars being expended by for culture. Council staff did talk with for culture to try to understand what the potential operational impacts would be according to for culture. Preparing and transmitting the budget to council on the timeline that's proposed would require some significant changes to the agency's budget process.'",
        "'speaker_0': 'Historically, they've adopted a budget or they've proposed a budget to the board in December once the county budget has been adopted and the amount of county expenditures are known, and then the board approves the budget in January. And so under this approach they would need to provide a budget to their board that was based on estimates of'",
        "'speaker_0': 'revenues and expenditures, which could mean that throughout the fiscal year they would need to make updates to their budget to reflect actuals as as they were learning more information about their financial condition. I would note that the legislation would not require that those budget updates come to the Council.'",
        "'speaker_0': 'Once the council had actually taken action on the motion, there would be no need under the legislation for for culture to make any updates subsequently. However, in the case that the Council didn't approve the motion by the end of the year or had rejected it in that case, it's possible or even likely that for culture would probably'",
        "'speaker_0': 'want to submit a revised budget to the council. Council staff asked for culture to provide information on the potential impacts to the actual programs. If the transfers of these funds were to discontinue for a period of time for a culture indicated that if the council rejected or didn't accept the budget by the end of the year, then'",
        "'speaker_0': 'they would have to announce that they would be postponing funding for all programs until the budget impasse was resolved. According to For Culture in 2019 and 2020. So before the lodging taxes resume, the primary impact would be to the 1% for art program.'",
        "'speaker_0': 'Public art projects have multi-year schedules, and the 1% funding from the county is typically transferred to for culture in the beginning of the biennial budget period. And so if the funds stopped being transferred, the public art program would have to be suspended, which could lead to layoffs as well as delays in implementing the public art projects.'",
        "'speaker_0': 'In addition to stewardship of the county's art collection, would also need to be suspended if general funds ceased to be transferred. And this could lead to temporary layoffs of employees. So turning to page 20 of the staff report, by 2024, culture does expect to have depleted most of its reserves.'",
        "'speaker_0': 'So the grant programs that are funded by the lodging, tax and special account funding would also be impacted most before cultures. Application deadlines are early in the calendar year, which would be problematic if the Council didn't accept the Fort Culture budget by the end of the preceding year.'",
        "'speaker_0': 'Without significant reserves, to be able to rely on the grant awards could be delayed, which would potentially delay projects or impact organizations or individual artists that receive funding. And then I would also note that for culture would potentially only be able to cover 1 to 2 months of their general operations.'",
        "'speaker_0': 'If transfers were discontinued before, they would have to consider layoffs. Council staff also worked with the Office of Performance Strategy and Budget and asked for input on the proposed budget review and acceptance process. They had a number of requests.'",
        "'speaker_0': 'Specifically, they requested that the Fort Culture Budget be transmitted. Via PSP so that it can provide a quality control review before the transmittal to the council. A PSP also suggested that the for culture budget transmittal include information on administrative expenses and estimated expenditures by program area, but limit the estimate of capital expenditures to only one year as'",
        "'speaker_0': 'per culture does not manage a significant capital program. PSP also expressed the executive's interest in specifying that the Council should act on the motion in order to accept the port culture budget at least 30 days prior to the end of the year.'",
        "'speaker_0': 'And then lastly, PSP requested that only the hotel motel tax revenues be withheld and pending council acceptance of the budget in order to prevent any delays or implementation issues with the public art programs and or the 1% for art programs or the stewardship of the county's art collection.'",
        "'speaker_0': 'I would note that the acceptance of the four culture budget that contemplated in the proposed legislation would be a separate action from the appropriation of county funds for transfer to fort culture. That's something that the Council does as part of its biennial budget process.'",
        "'speaker_0': 'It appropriates the hotel the the funding sources that the county transfers to for culture as part of the budget ordinance. And so that would continue to occur. And so the budget ordinance would remain a vehicle for potential expenditure restrictions and provisos on those funds.'",
        "'speaker_0': 'That concludes my remarks, and I will turn it back over to Julia.'",
        "'speaker_1': 'Thank you, Wendy. And so we're turning to page 20 of the packet for the impacts to the for culture board of the proposed changes to the report or to the board nomination or appointment and makeup. And so the proposed ordinance would change the board nominating process and board makeup such that new appointments and re appointments due to'",
        "'speaker_1': 'vacancies unexpired terms would be appointed six by the executive and one each by each county council member. The executive and Council member could make appointments from among those forwarded by the For Culture Board or other qualified candidates. According to the sponsors of the proposed ordinance.'",
        "'speaker_1': 'The rationale for the proposal is to increase communication between the for Culture Board and the County Council and to ensure diverse geographic representation on the For Culture Board. The proposed changes would not impact the current board members as the changes would take effect in the case of filling vacant or expired terms.'",
        "'speaker_1': 'Four Culture has expressed that while they welcome County Council input into the nomination of Fort Culture Board members, they are concerned about having board members not appointed by individual council members rather than as part of a whole, that that could decrease the overall diversity that they strive for on the board.'",
        "'speaker_1': 'And I think you will hear more about that when there are four culture board panel comes up. So I will move on the table beginning on page 21 of your packet shows a comparison of the makeup and nomination appointment and confirmation process for select county boards and commissions.'",
        "'speaker_1': 'And while the table shows that the nomination and appointment process is, ah, they vary quite a bit. One common thread is that the executive appoints most members and the council confirms appointments and that is the case even for boards and commissions that are required to have members residing in each council district or where the council plays a'",
        "'speaker_1': 'role in the nominating process. The proposed ordinance would make for a culture the only board in this comparison to have a member directly appointed by each council member turning to the Executive Director impacts on page 24 of your packet.'",
        "'speaker_1': 'The proposed ordinance would keep in place the provisions that allow the Fort Culture Board to manage the selection of four cultures, executive director, oversee the executive directors performance and remove the executive director. The proposed ordinance would add provisions requiring that the four Culture Board recommend to the recommended executive director candidate to the county executive for appointment and'",
        "'speaker_1': 'confirmation by the County Council. The proposal would also allow the county to remove the executive director by ordinance. According to the sponsors of the proposed ordinance. The rationale for the proposal is to increase the responsiveness of the for culture executive director to the County Council and Executive who directly represent the people of King County and for culture'",
        "'speaker_1': ', has expressed concern about the proposal. And as they point out that the. Executive Director would be an employee for culture, and that hiring and firing by an outside entity would be a concern for that reason. And that they also noted that they believe the proposal would create confusion for the executive director reporting to multiple entities and would'",
        "'speaker_1': 'deviate from the governance structure typical of PDAs and nonprofit organizations. To compare this proposal with the management of other county departments and independent agencies generally, King County Department Heads and other appointees are appointed by the executive, confirmed by the Council, and can only be removed by the executive.'",
        "'speaker_1': 'There's further feedback from Fort Culture on the proposal on page 24 of the packet and in the attachments beginning on page 185 of your packet. You'll also hear from them during the panel discussion after the staff report. So turning to page 25 of your packet, there's a striking amendment that's been proposed by the sponsor of the proposed'",
        "'speaker_1': 'ordinance. So I will briefly describe that it would make the following changes to the proposed ordinance charter and for Culture Charter and for culture bylaws. It would eliminate the ability of the county and the county to remove the four culture executive director.'",
        "'speaker_1': 'It would stipulate that the four culture budget be transmitted to the executive rather than the council 125 days before the end of each fiscal year. And then to the executive would transmit to the council with the regular budget process.'",
        "'speaker_1': 'And it would require that the for culture budget review and executive acceptance process begin in 2020 rather than on the effective date of the proposed ordinance. It would allow fund transfers to continue in the next fiscal year if the county or the council did not act on the motion by November 30th.'",
        "'speaker_1': 'So transfers would only discontinue if the Council rejected the four culture budget by motion by November 30th, and it would provide for a process for notifying and get it and providing input from the for Culture Governance Nominating Committee on board vacancies.'",
        "'speaker_1': 'All other elements of the proposed ordinance would remain as previously described, and that concludes our staff report.'",
        "'speaker_0': 'Okay. Thank you. I have just been told that we can open up the balcony. I'm waiting for somebody to come along with a key. Apparently, it's been closed due to the as I said it, I heard the key in the lock.'",
        "'speaker_0': 'So we're going to be moving some chairs in upstairs that can help to accommodate a few more people. But I do want to take just a few minute recess at this point because it'll be noisy. So I'm going to call it into recess for about hopefully no more than 5 minutes.'",
        "'speaker_0': 'And we can accommodate a few more people in the chambers. There's at least 40 or 45 people up in the overflow and I see people standing outside. So I'm hoping we can get a few more people in here.'",
        "'speaker_0': 'So we'll be in recess for about 5 minutes. Is this on? We're going to continue in about 30 seconds so people could take their seat. If you have a seat. I'd appreciate it. The overflow room remains available for those who don't have chairs upstairs.'",
        "'speaker_0': 'Welcome for those who do that. So, of course. So. All right. We'll be back in session. Thank you all for your patience. I'm glad we were able to accommodate a few more people here in the chambers. And at this point in the agenda, we have three representatives from the Board of Four Culture.'"
    ]
}