{
    "Proposition for Bond Issuance for Harborview Medical Center Improvements.": [
        "'speaker_1': 'or any members. Okay. So we will move on. This was not for action today. This is going to be on the council agenda next week. This brings us to item number six, which is a proposed ordinance number 2020 20176, which would place on the November ballot a bond proposal for public health, safety and seismic improvements at Harborview'",
        "'speaker_1': 'Medical Center. We're going to have a briefing on this in a moment. But I just want to alert folks that when the briefing is done, we will be going into executive session, which means that the council members will leave this Zoom meeting.'",
        "'speaker_1': 'The Zoom meeting will continue without us in it. We are going to another meeting to have our executive session to discuss an item that I will describe if the chair isn't back. And and then we will come back into this Zoom meeting to take final action on the Harborview Bond and move on in our agenda.'",
        "'speaker_1': 'So that will all be announced and flagged as we go ahead. But I wanted to make sure people knew that was coming. And before that, we have a briefing from our council central staff, Sam Porter and Nick Bowman.'",
        "'speaker_1': 'Why don't you are you are you on the line, Sam or Nick? Yes. I don't think. You don't have.'",
        "'speaker_0': 'To.'",
        "'speaker_1': 'Thank you. Thank you, Madam Chair. Materials for this item begin on page 67 of your packet. As the committee was previously briefed on this item at the May 19th meeting, I will just provide a very quick, high level overview today and lead with the only notable change since May 19th being the Revised Office of Economic and Financial'",
        "'speaker_1': 'Analysis on the weather forecast that was released earlier this month. This forecast anticipates significantly lower assessed values than previous forecasts, the result of which being that while the average rate of approximately $0.08 per thousand dollars of assessed value has not changed for the proposed harbor view bond, the average increase in property taxes is now estimated to be'",
        "'speaker_1': 'approximately $75 annually for homeowner over the life.'",
        "'speaker_0': 'Of the.'",
        "'speaker_1': 'Proposed bond. This is $7 more than estimates previously provided based on the August 2019 forecast, and that was included in the previous staff report for this item. The staff report in your packet has been revised to reflect this change.'",
        "'speaker_1': 'The proposed ordinance 2020 0176 would place a 20 year $1.74 billion capital improvement bond on the November 2020 general election ballot, the proceeds of which would go towards new construction, renovation, seismic retrofitting and other health and safety improvements of Harborview Medical Center facilities.'",
        "'speaker_1': 'Attachment of the proposed ordinance provides a high level overview of the improvements which may be funded with levy proceeds. These improvements are based on the Harborview Leadership Group recommendation report that was transmitted to council on April 8th of this year.'",
        "'speaker_1': 'This report, requested through Motion 15183, provides background and detail on the Harborview Leadership Group efforts and summarizes the size and scope of their bond recommendation in order to meet the elections deadline to include the proposed bond on the November ballot.'",
        "'speaker_1': 'The last regular council meeting to adopt with maximum processing time is July seven. The deadline for elections to receive the effective ordinance is August 4th. And that concludes my remarks. I'm happy to answer any questions. And we have Nick Bowman available as well.'",
        "'speaker_0': 'Thank you. Councilmember Bell, did you are there Councilmember, other council members, other questions? This is our second briefing on the item. C-note Councilmember Dombrowski. Thank you, Mr. Chair. Yes. And thanks for having this second briefing on this important legislation.'",
        "'speaker_0': 'Sam, thanks for the report and the updated information with respect to the property taxes. My recollection from reading the materials in the first briefing was that in the first, certainly first year, but maybe then the second and third that the actual amounts collected are quite small.'",
        "'speaker_0': 'And then it goes. Then it begins to peak and then tapers off. Can you confirm that? And I'm just and then I'm wondering, is there any ability I don't know that we'd want to do this, but is there an ability to seek approval this November?'",
        "'speaker_0': 'But because the amounts are so small in the first year, or to actually delay collection or commence collection some time, say, in 2022 or 23 without materially impacting the time or or length of the of the period of taxes imposed.'",
        "'speaker_1': 'Yes. Council Member, I will direct you to pages 72 and 73 of your packet. This is a revised debt issuance schedule with the estimated annual levy rate based on the June 29th 2020 or even forecast the first few years.'",
        "'speaker_1': 'And the estimated levy rate for 2021 is about $0.12 per thousand dollars and then goes up from there. Does that kind of get to the answer of your question?'",
        "'speaker_0': 'Yeah, I thought the numbers were quite works worse, much smaller in the first year or so. I just missed the mystery of calling.'",
        "'speaker_1': 'I believe Patrick Hamacher is available to answer this.'",
        "'speaker_0': 'I think I think I think so. Very briefly in this book, that's not $0.12. That's quite $0.22 in the first couple of years. And Sam said $0.12. It was just an honest mistake. So it doesn't even get to a full penny until the third year.'",
        "'speaker_0': 'It's 2.8 $0.08. But I was I was coming on the line to get to the second part of your question, Councilmember, because it's a little different than what we normally have about can we not? Levy Initially, and I think we would ultimately want to ask legal counsel about that.'",
        "'speaker_0': 'But in general, I believe the answer is yes, because in as opposed to your normal little lift levies where you say we're going to collect a certain rate per year or up to a certain rate per year, what you approve in bond ordinances is a principal amount up to a certain amount.'",
        "'speaker_0': 'So what you would probably need to find out in the first couple of years if you didn't want to levy it initially, is how you were going to raise the cash to do the planning and design work in the first couple of years, which is why that rate is so low.'",
        "'speaker_0': 'It's a small expenditure if you're on the way to do that. I do believe you could wait a year or two before you started levying it, but it's such a small rate too. That would kind of be a policy option.'",
        "'speaker_0': 'Yeah, it's a it's such a small rate for a small amount of money. You could maybe look at an inner fund loan. And I even wonder if the administration of collecting that small amount is is very efficient. So I don't know, we probably lost weight deeply and I don't want to do anything that would take this off'",
        "'speaker_0': 'of that the track toward a strong launch. But given the economic times it and the very small sums collected, I know that sounds somewhat inconsistent, but I just wonder if we might take a look at that between now and final adoption as to when the collections would start.'",
        "'speaker_0': 'So. Councilmember, I'm still here. Oh, Dwight. And I think Mr. Henniker had the right idea. You should ask legal counsel, but my recollection when we did something similar many years ago, when I was at the city of Seattle with the Libraries for all bond issue, if you put a measure on the ballot in a year, I believe'",
        "'speaker_0': 'the legal advice we received at that time is you have to levy the tax the next year, even a very small amount. Otherwise, you're basically asking voters for something that's speculative that way in advance. And the law, as I remember, does not allow you to do that.'",
        "'speaker_0': 'Thank you. Appreciate it. Right. Mr. Chair, are you looking to advance this to a full council today? Not at this moment I am, but not at this moment. Okay. Are there any other questions? Colleagues. Colleagues, for your information, this is one I would anticipate questions, certainly, which is why I'm asking for questions.'",
        "'speaker_0': 'And then we do have a unrelated matter regarding Harborview. They will introduce as an executive session and we'll go into executive session before I would be seeking a motion on the bond measure. And just so you know what course we're charting here.'",
        "'speaker_0': 'So questions on the policy of the bond measure. Okay.'",
        "'speaker_1': 'Thank you. Just wanted to know in the chart when he heard that estimated rate is three and a quarter. With what's happening right now, is it a possibility? The best estimate actually could be lower.'",
        "'speaker_0': 'Mr. Hamacher. Yes.'",
        "'speaker_1': 'Like that king sized insect. What might it be at this point?'",
        "'speaker_0': 'But remember that because of this, we might issue some debt in the first year. Back to the customary Damascus question, but it'd be for very small amounts to do planning and design. So when we start to issue the construction debt in maybe three years, the market could be completely different.'",
        "'speaker_0': 'If we were selling 20 year bonds today, I think the rate would be closer to 2% than it was to 3%. But because of that, the executive, I think they did they have brought the estimate for the interest rates down during the time the council's been considering it.'",
        "'speaker_0': 'But I think they do want to plan to be more conservative than less conservative when they're trying to guess the interest rates for a couple of years down the road.'",
        "'speaker_1': 'I think if.'",
        "'speaker_0': 'Hey, no further questions. While not related to the bond proposal, the Harborview Medical Center Board of Trustees has been directly and indirectly authorized as directly and indirectly off until agreements for four properties that are being operated under Harborview is a hospital license and the rents paid out of Harborview Medical Center revenues.'",
        "'speaker_0': 'However, both the county code and the Hospital Services Agreement specifically define what properties are considered to be part of the medical center. These additional properties are not included in those definitions. The Council needs to go into executive session to confer with the county's attorneys to obtain legal advice of potential actions the county may take related to this'",
        "'speaker_0': 'matter. Therefore, the grounds for executive session under RTW 4231 ten are to discuss with legal counsel legal risks of a proposed action when public knowledge regarding the action is likely to result in an adverse legal or financial consequence to the county.'",
        "'speaker_0': 'The committee will be the executive session for approximately 15 minutes until about 3:02 a.m., asking QC KPTV to please post the virtual meeting to that effect. And I'm asking only council members and any county employees directly necessary for the discussion to join the executive session by state at this time and council members, you may still stay logged'",
        "'speaker_0': 'in to zoom and leave yourself muted and step and committee assistance will make sure that you're muted when you leave Zoom as well so you can leave zoom open and I will see you in the executive session scope momentarily.'",
        "'speaker_0': 'Thank you. All right, then we're coming out of executive session and as we've ascertained that all members are accounted for. Councilmember Dombrowski, I would entertain a motion if you were so inclined. Thank you very much, Mr. Chair. I move adoption of the Harborview Bond ordinance, and as the prime sponsor, I defer to you for opening remarks.'",
        "'speaker_0': 'Thank you, Councilmember Dombrowski, for moving. We give a do pass recommendation to ordinance 2020 176, and it was my pleasure to serve with you, Councilmember Dombrowski, people from Harborview, people from UTEP Medicine, our labor partners at the hospital and neighbors around Harborview on first tail, and perhaps most importantly, the mission population.'",
        "'speaker_0': 'The hospital's duty is to serve. And as you already heard, when the board chair for Harborview Board of Trustees testified during public comment, the recommendation from that working group was unanimous for the package that has continued from the working group that Councilmember Nebraskan I served on through the Harborview Board, the Facilities Committee and the executive to arrive'",
        "'speaker_0': 'to us in the same form. We see now in the middle of a pandemic the work that Harborview and its partner that we contract with operate medicine do so well. But to single out and be particular the work that Harborview does as the county hospital and in fact serving our mission population, recognizing that they have a mission'",
        "'speaker_0': 'to serve non-English speaking poor persons, the uninsured and underinsured victims of domestic violence and sexual assault, people incarcerated in our jails, people with mental illness or substance abuse issues there has been treated and voluntarily. People with sexually transmitted diseases and those who require emergency trauma or burn care.'",
        "'speaker_0': 'That's truly the mission population of the hospital and who they serve every day. The bond measure itself does some critical work that Bernie spoke to in her testimony, particularly making the the hospital rooms single patient because of the number of beds that end up unusable on any given night due to infection control, something that I think the'",
        "'speaker_0': 'layperson is probably more aware of today in this pandemic than we might have been before. As we come to understand the transmission of COVID 19, and this is a as the current by measure is expiring, this is our chance to make substantial investments in the Harbor Harborview campus and truly its mission, including up to 150 respite beds'",
        "'speaker_0': 'in Harborview Hall while maintaining the shelter capacity at the most appropriate place within the campus, redesigning the arrival of the medical helicopter. Because currently, if you arrived at Harborview by helicopter, you're under being transported from that building to another by ambulance rather than simply an elevator ride down into an emergency room.'",
        "'speaker_0': 'That that will be addressed within the bond measure and enhancing the greatly enhancing and in investing in behavioral health, in the investments that are so needed in behavioral health and our ability to provide support and treatment to people.'",
        "'speaker_0': 'So I will ask my colleagues to join in this sustained investment not only in our county hospital, but truly in our community and our own well-being. Further remarks. Saying None. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member belt reaching. I council member Baluchi votes. I Council Member Dombrowski. I Council member Belsky. Both I Council member. Done. High Council member downvotes i council member calls I Council Member Commonwealth Votes Council Member Lambert i.'",
        "'speaker_1': 'Member Lambert I council member us across. Council member of After Grow. Councilmember Vaughn right there I. Councilmember Vaughn right there are both I council members online. Council members on lifeboats. I. Mr. Chair.'",
        "'speaker_0': 'I. Mr. Chairman. Mr.. Full time.'",
        "'speaker_1': 'Mr. Chair, the vote is nine zero on us.'",
        "'speaker_0': 'By your vote, we have given a do pass recommendation to ordinance 2020 176, and we will send that to full council without it. Without objection, we will expedite. So it appears that the account on the council agenda one week from today.'",
        "'speaker_0': 'See? See? No objection. So order. Thank you, colleagues. This takes us to briefing 2020 B 51. It's a briefing from the Charter Review Commission. You remember that last year the co-chairs of the Charter Review Commission, Louise Miller and Ryan Simms, presented their early reports.'"
    ],
    "Charter Amendment to Grant Subpoena Powers to the Office of Law Enforcement Oversight.": [
        "'speaker_0': 'Any other questions for Coach Miller? Being none. We thank you very much. And we will take up the first of the two charter amendments that are on our agenda today. This is proposed ordinance 2020 206, which would amend the county charter to grant the Office of Law Enforcement Oversight subpoena powers.'",
        "'speaker_0': 'Nick Bowman will give a staff report on the proposal. Mr. Bowman, the one is yours. Good afternoon, council members. For the record, Nic Bowman, council central staff. The materials for this item begin on page 389 of your packet.'",
        "'speaker_0': 'Proposed Ordinance 2020 0206 would submit to the voters of Clayton County an amendment to the county charter to be placed on the next general election, which would add the authority to subpoena documents, witnesses and other relevant evidence. The list of charter powers granted to the Office of Law Enforcement Oversight.'",
        "'speaker_0': 'As the council is well aware, King County has worked for many years to improve oversight of the King County Sheriff's Office. In the interest of time, I won't go into the full background of those efforts, but I will say that they began in 2006 with the establishment of a blue ribbon panel on police oversight and the adoption'",
        "'speaker_0': 'of Ordinance 15 611 Creating Aliyah. In November 2015, the voters of King County approved an amendment to the county charter that established OLEO as a charter mandated county office within the legislative branch. This amendment, now Section 265 of the King County Charter, increased oversight responsibilities for Oleo and requiring that those authorities be established by ordinance.'",
        "'speaker_0': 'And in April 2017, the Council adopted Ordinance 818 500, expanding all those authorities to include investigative authority with subpoena powers for the office, complaint and concern intake responsibilities, including the authority to review Ccso complaint intake classifications, authorization to review policies, procedures, training and operations and to make recommendations.'",
        "'speaker_0': 'Access to relevant information and crime scene authorities. Notification requirements regarding cases of Complaint Handling Processes and review of inquest findings. Proposed Ordinance 2020 0206, as I said, would submit to the voters an amendment of the King County Amendment to the King County Charter, which would add the authority to subpoena witnesses, documents and other evidence relating to its'",
        "'speaker_0': 'investigations or review to the list of all your powers described in Section 265 of the County Charter. As stated earlier, Oleo has subpoena powers under King County Code 2.75.055. However, unlike its charter provision that can only be added or removed by a vote of the people lost, ravished by ordinance is transitory and can be changed by the'",
        "'speaker_0': 'council adopting a new ordinance. If the subpoena power were added to the charter, it can only be removed by a vote of the people. According to Olio director Deborah Jacobs, without the ability to compel the sheriff's office personnel to be interviewed and to produce relevant records.'",
        "'speaker_0': 'OLEO has limited ability to complete, thorough and objective investigations. Now the authority to issue subpoenas is an established power within oversight agencies around the country and one granted to numerous county entities. A non-exhaustive list of oversight offices in other jurisdictions across the country where some form of subpoena powers can be found on page 391 of your packet'",
        "'speaker_0': 'and includes. Oakland, California. Washington, D.C.. Chicago, Illinois. Denver, Colorado. Indianapolis, Indiana. Detroit, Michigan. Los Angeles, California. New York City. Cambridge, Massachusetts and Rochester, New York. The table on page 392, your packet lists the county entities with the authority to issue subpoenas as well as any limitations to that authority.'",
        "'speaker_0': 'And some of these entities include the County Council, the Ombud office, the Office of Civil Rights, the auditor, the chief medical examiner. The Personnel Board and the hearing examiner. It should be noted that should the proposed ordinance be adopted and subsequently approved by the voters, the amendment passage alone may not be enough to effectuate the desired change'",
        "'speaker_0': ', as the proposed amendment may affect the working conditions of cso's unionized workforce. The county would most likely need to engage in bargaining with the affected unions before Oleo could exercise the powers granted by that amendment. I also just want to touch briefly on some election timing requirements in order to place on the November three, 2020 ballot and'",
        "'speaker_0': 'effective ordinance must be transmitted to Elections Department by August 4th, 2020. Therefore, the last regular council meeting date for adoption is July 21st and August 4th. 2020 is the last special council meeting date to adopt the ordinance as an emergency.'",
        "'speaker_0': 'Finally, there are two amendments. Amendment one would make changes to the language and substance of the proposed charter amendment, including changing the general election date in which the proposed charter minute would appear on the ballot from November 2019 to November 2020.'",
        "'speaker_0': 'Granting Oleo the authority to administer oaths to witnesses subpoenaed by Oleo and clarifying that any witness subpoenaed by Oleo shall have the right to be represented by legal counsel. Amendment One confirms the title of the proposed ordinance to the changes made by Amendment One.'",
        "'speaker_0': 'With regards to changing the general election date in which the proposed charter amendment would appear on the ballot from 2019 to 20 2nd November 2020. That concludes my staff report. We have also director for Jacobs and she's Patrick Singleton, CSO Online to help answer any questions the committee may have.'",
        "'speaker_0': 'Mr. Bowman For my clarity. Clarity? The two amendments are the one substantive amendment and the title amendment. Is that correct? That's correct. Thank you. And next, I'd like to call on our commissioner from the Charter Review Commission. I believe, as I'm prepared to present on this amendment.'",
        "'speaker_0': 'Alejandro. Pausing at 100 trees. There we go.'",
        "'speaker_1': 'Hi, everyone. One thing, Councilor McDermott, first of all, is that it says that my Internet is a bit unstable here in rural unincorporated, which I think all of us feel a little unstable during COVID. So let me know if I'm lagging.'",
        "'speaker_1': 'And I can try to adjust or shut off my video. I wanted to thank you, Councilmember German pair and all the council members for this discussion. I also want to express my gratefulness to the charter commission, some of whom are watching especially.'",
        "'speaker_0': 'At 100, you just walk up. Of 100 drives. I suggest you turn your video off.'",
        "'speaker_1': 'Okay. Will do. Is this any better? Yes. Okay. Excellent. So just wanted to say thanks again to the charter commission, especially the equity committee, especially my co-chair, Liz Ford, who was a main driver. I think Nick actually mentioned quite a number of things, so I don't know that I'm going to be doing a lot more of fleshing'",
        "'speaker_1': 'that out. But I just want to say a little bit from the charter conditions perspective as to what we felt that this amendment would do and also why we felt it was necessary. As Nick mentioned, this also needs to have the authority to subpoena records and provide effective civilian oversight for law enforcement.'",
        "'speaker_1': 'And, of course, the amendment for subpoena power would add to that list of oleo of authority charters granted to oleo in the charter, and the county code already has a reflection and contemplates granting this authority to oleo. But it is not listed as in the charter as it is with other agencies.'",
        "'speaker_1': 'Now the CRC believes this amendment, if this amendment passes and ultimately can be bargained, that subpoenas rarely be used as parties will share information and not want to have to use the subpoena process. Well, with that in mind, why do we feel this is necessary?'",
        "'speaker_1': 'The Charter Commission believes that the residents can county have expected civilian oversight of the King County Sheriff's Office since 2006 and before, but at least 2006 when the council created the office, and certainly since 2015, when the voters added oleo to the county charter.'",
        "'speaker_1': 'However, efforts for effective civilian oversight, including subpoena power, have consistently been thwarted by the collective bargaining process. The issues to this day, the charter commission believes, continues to this day and we feel is a powerful statement to add the subpoena power to the charter and make it consistent with other agencies.'",
        "'speaker_1': 'It's been almost 14 years since the council first created Oleo, and that way it is long enough for effective civilian oversight. We feel by you moving this forward to the ballot, voter approval will help clarify the public's desire for more empowered oversight of our sheriff's office.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Council members questions of Mr. Goldman Miss Trace and I'm Patty content. I'm sorry, Miss Court. And I don't know your current title, Undersheriff.'",
        "'speaker_1': 'In another week, I'll be the undersheriff. And currently you don't, chief, but okay.'",
        "'speaker_0': 'And also Director Jacobs are all available for questions as well. Colleagues. Ashton Lambert Councilmember, remember?'",
        "'speaker_1': 'LAMBERT Thank you. So I have two questions. One is, will this change the requirement for it to be parliament? And secondly, if you look at the chart, there are many departments that have the subpoena, including us. And to my knowledge, we have never used it.'",
        "'speaker_1': 'So how often in all of this has it ever been used? To my knowledge, it hasn't been. So I would like to be updated on that.'",
        "'speaker_0': 'I can speak generally to the first question, which is that it may require bargaining. It is our understanding that, yes, bargaining would need to take place before the olio to actually be able to subpoena you. So personnel that but that of course we would have to actually have the men would have to be adopted by the voters'",
        "'speaker_0': '. So I don't want to put the cart before the horse too much.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'And in addition, I do not have on hand a record of how many Times County entities have issued subpoenas. I would have to query all of those offices to determine that.'",
        "'speaker_1': 'It should be pretty easy because I think the answer is probably zero. I don't understand what is different. We already have the ability for them to subpoena. And as she said, it's been years that it hasn't been fired and for a variety of reasons that we probably should get to the bottom of.'",
        "'speaker_1': 'But this this doesn't change it. We'll be back exactly where we are right now in my mind. So that's a concern. We're making a pretty much false assumptions public that this will change the underlying.'",
        "'speaker_0': 'Richard Jacobs, did you have a response either to the previous question or the current one?'",
        "'speaker_1': 'Yes. Thank you. I appreciate you hearing from me a couple contextual comments. So the officers in the county that have subpoena power are counsel of Ombud, Office of Civil Rights Auditor, Chief Medical Examiner, Personnel Board and hearing examiner.'",
        "'speaker_1': 'And I also want to let folks know that it's a pretty much a norm for investigatory oversight agencies to have subpoena power. And I have a list of about 15 or 20 that I'm aware of that have it.'",
        "'speaker_1': 'In fact, almost none of them use it. And there's a good reason why. The reason is, is that once they have it, the threat of using it suffices to get the access to information that they need. That's been the lesson I have learned from hearing from my nationwide colleagues, is that once you have it, it sort of'",
        "'speaker_1': 'works without having to assert it. But Councilmember Lambert's comments are so well taken. The other thing I did want to mention is that there's specifically a real concern, the current collective bargaining agreement. It says that. That if the charter is amended, then it's a reopen after bargaining subpoena power as required by law.'",
        "'speaker_1': 'So that's one reason to do it now, because I know we have a lot of ambitions for the next round of bargaining. I also feel like having the voters affirm that this is their desire and make it consistent with the council's understanding of the role and the investigation role will be very important.'",
        "'speaker_1': 'And I think that affirmation would be meaningful and even potentially meaningful if there are challenges in the context of bargaining. So no, it's definitely does not overcome the state law challenges presented by collective bargaining for or oversight. But I still think it's important and worthy thing to be in the charter, to speak the will of the county'",
        "'speaker_1': '. Thank you.'",
        "'speaker_0': 'Thank you. Further questions, colleagues. John. Councilmember Dunn. Thank you, Mr. Chair. Appreciate. And this is a question for our two questions. One is, does the sheriff's office have a position on this particular the charter amendment aside, appreciate your articulating it.'",
        "'speaker_0': 'And then the other question I have is, and maybe Debra countered, there are different kinds of subpoenas in the world. There are civil or criminal. There are legislative subpoenas. What is the what is the type of subpoena we are talking about here?'",
        "'speaker_0': 'And is there any standard that has to be met in order to request the subpoena? In other words, does it have to be within the scope of an active investigation, or can it be very broadly used in terms of various policy?'",
        "'speaker_0': 'What is what is the charter amendment speak to with specificity? Thank you.'",
        "'speaker_1': 'So I can keep cold Tindal sheriff's office, so I can answer Councilmember Dunn's question. So the position of the sheriff and our office is that we really are not taking a position on this. Obviously, this is something that has been an issue, if it goes to the voters, becomes part of the charter.'",
        "'speaker_1': 'It does have to be bargained. At least that's my perspective as your previous director of labor relations responsible for collective bargaining in the county, and that currently it is the executive who has that responsibility to negotiate this, which is really a working condition but because the voters previously.'",
        "'speaker_1': 'Basically approved that, you know, we would not bargain our own working conditions, which makes sense.'",
        "'speaker_0': 'Thank you. You're welcome. And on the second.'",
        "'speaker_1': 'So I don't have a full answer to your question. What I can tell you is the intent is that it would be able to have compel people, personnel to be interviewed about incidents and also to compel to get banking or phone records as far as the legal complexities of sort of how it would be administered.'",
        "'speaker_1': 'I don't have the familiarity and we'd have to have some research done on that. Can I just make one state? I'm sorry.'",
        "'speaker_0': 'Yeah, I'm sorry. Go ahead. Go ahead. I want to ask I think that like some other issues, I need some legal clarity on it. It may be just that it's substantially similar, as you said, are other independent counsel appointed positions.'",
        "'speaker_0': 'But I'd like to know and in particular, I'm interested in the in the contours or in other words, the limitations and what the subpoena power provide for my own information at some point. I mean, we're going to take action to travel with your passport.'",
        "'speaker_0': 'Helpful. So appreciate that. And go ahead.'",
        "'speaker_1': 'I just want to clarify one other thing about a reopen or that Deborah mentioned. That still has to be something that the guild would be interested in doing while it's in the contract. It still requires that there is the willingness to reopen.'",
        "'speaker_1': 'So I just wanted to point that out. Thank you. I mention one other thing, Councilmember. Councilmember Dunn, you know, the questions you're asking also would relate to what kind of independent investigations are being conducted. And this is something I'm really eager for a council to give some thought to and hopefully have a stakeholders conversation that includes guild'",
        "'speaker_1': 'members and KSO and the public. There are different ways it could be approached and I won't go into details now because I know we're short on time, but I think that there's a lot into sort of what this might look like.'",
        "'speaker_0': 'Yeah. And I appreciate that and I'll just finish with this. And so I'm not like, you guys aren't like searching in the dark. What I'm looking for is that the subpoena power is rationally related to the charter, the mission of Oleo in the charter, and other subsequent motions and legislation we put forward as well as staffing that'",
        "'speaker_0': 'is that it if it goes forward, that it move in a way that is directly related to that mission as opposed to some, you know, blanket authority to subpoena whatever it is that is desire for the purpose of driving some policies or set of policies forward.'",
        "'speaker_0': 'That's a little bit different and it just needs to be discussed so we don't work or buy in here, so to speak. Up the road. Can about the growth. Thank you, Mr. Chair. I think I know the answer to this, but I want to make sure is the Sheriffs Guild contract next up for renewal at the end'",
        "'speaker_0': 'of next year. The crisis heads nodding. This charter amendment wouldn't take effect. The November ballot take effect, I assume, January one. And imagine that timing would be just about right to begin going into negotiations and. Right.'",
        "'speaker_1': 'So perfect timing.'",
        "'speaker_0': 'So that speaks to me as one reason to act. And I'd just one comment, if I may, if that's appropriate, Mr. Chair, then I. My constituents or people I hear from are often very confused about this process. And it's frustrating as an elected official because the heat is on us.'",
        "'speaker_0': 'I don't think most people realize that the only tools of civilian oversight that we're able to conduct over our sheriff's department or those in which the police agreed to. Because of this provision in state law that allows not only for the police guild to negotiate, but if we don't reach agreement, it goes to a third party and'",
        "'speaker_0': 'that decision is final. And when that third party often looks at comparables, it means it's a barrier to change. And so this. Just to be clear about communicating what we're doing, we're. You know, this is being proposed to go in front of the voters, be put into our county constitution or county charter to strengthen our position there'",
        "'speaker_0': '. Whether legally, politically, structurally. But at the end of the day, the only oversight we're allowed to provide is that in which the police agree to let us provide intel if and when state law were to change, and so not to get people's hopes up too much who are advocating for this?'",
        "'speaker_0': 'Because unless again, unless that state law changes, this is going to be. Only if the police want us to, basically. So that's my my comment on it. But I'm very supportive moving forward. Colleagues.'",
        "'speaker_1': 'Edification.'",
        "'speaker_0': 'Was my remember.'",
        "'speaker_1': 'So could you clarify? I think all of us had the right to do independent investigations. And I thought that there was a grievance at some point about that. Can you tell me where the grievance landed in and is there the right to do independent investigations?'",
        "'speaker_0': 'So I can say on the history that there was a grievance filed after the audience was initially passed in 2006. Most of that ordinance was repealed and then the grievance was dropped and the ordinance was passed in 2008 that aligned with the contract with guilds at the time, and then the powers were later established.'",
        "'speaker_0': 'I'll let Deborah speak it to the individual or the independent investigations, but that the initial grievance was for the initial ordinance, and then another ordinance was put in place.'",
        "'speaker_1': 'So I you're talking about the more current grievance. The grievance was over a systemic review of the shooting of my chance to get involved. And the guild has been on hold with its grievance because it wants to present it to Oehler in person and because of the virus that has not happened.'",
        "'speaker_1': '310. I do not believe that report is an investigation is because no investigation was done, meaning no one was called. It was just the review of the file, much like, you know, of adding and then adding expertize. So if they don't like that, they're really not going to like what an investigation is.'",
        "'speaker_1': 'And that's something that, as I mentioned earlier, we really need to discuss, but that's a status after it's presented to all our rules. And then it's possible it could be appealed to arbitration. That would be the next step.'",
        "'speaker_1': 'I would love for us to be able to resolve it peacefully before that myself, and I've expressed that to Olara. So at this very moment, you have the right to do.'",
        "'speaker_0': 'Whatever.'",
        "'speaker_1': 'I'm sorry. The right to what? You independent investigations. So on a very limited scope, for example, it would be possible under limited circumstances to investigate someone who is not represented by the Guild. Yes. So basically, Deborah is correct.'",
        "'speaker_1': 'That would mean the chiefs, the undersheriff. Perhaps our legal advisers, those that are know, I think there's seven or eight of us that are not represented. A very limited. And beyond that, Patty, I believe the scope is also limited, meaning it might have to be a use of force or something like that as well.'",
        "'speaker_1': 'I'd have to look at the language, but I think it's along those lines.'",
        "'speaker_0': 'Thank you. Councilmember Dombrowski. Thank you, Mr. Chair. We've had some discussion about this. And I want to remind folks and please Deborah or Nick or legal counsel, correct me if I'm wrong, but Nick mentioned the 2017 implementing ordinance that I had worked on with councilmen, Councilmember Gossett, which carried that brought to life the the charter amendments passed'",
        "'speaker_0': 'by the voters. And we, I believe, already adopted in that ordinance the authority for the Office of Law Enforcement Oversight to issue subpoenas so that the the it's in their charge today. And I know that hasn't really been mentioned or has it's maybe got lost a little bit that this charter amendment would basically the thinking behind putting'",
        "'speaker_0': 'in the charter is that it elevates the importance and to the extent we don't get agreement from the guild at the bargaining table coming up, the grove is 100% right. And I like the way you phrased it, that we can only do the oversight that the guild lets us do.'",
        "'speaker_0': 'But the thinking is that perhaps what the voters speaking on this particular topic, that it might, if necessary, to go to an arbitrator, have some extra strength in terms of the the people speaking so that the power is there by ordinance.'",
        "'speaker_0': 'This just puts it in the charter. We're not changing the contours of it at all in terms of the kind of subpoena power. And I think with respect to the individual investigations, the investigations of individuals, their use of force versus other investigations by the office, the subpoena power could be helpful in their systemic review as well to'",
        "'speaker_0': 'the extent they need documents to complete that. And maybe that's my question to Director Jacobs. Would you agree with that?'",
        "'speaker_1': 'I would say at this point we are fairly successful in getting the documents we need from the sheriff's office. They have capacity problems, so there's a timeliness issue. But besides that, we have that kind of access. So it would be hard for me to envision that systemic review.'",
        "'speaker_1': 'I guess we would have to be trying to get data from like outside sources. It's possible, but I'll have to think a little bit more on that and I'll let you know.'",
        "'speaker_0': 'Okay. Thank you, Mr. Chair. You're welcome. Colleagues, anything else? Would you like a motion? I would welcome a motion. They, Mr. Chair, I'd be happy to move. Adoption of proposed ordinance number 2020 0206, which would with a do pass recommendation of the full council.'",
        "'speaker_0': 'The ordinance would put before the voters in the November 2020 election the question of whether they would like to amend King County Charter to specifically grant the Office of Law Enforcement Oversight, which was created by Charter. The power to issue subpoenas.'",
        "'speaker_0': 'And if amended here by Amendment one, to compel witnesses to testify with the assistance if they wish to counsel. Councilmember Dombrowski is moved to give a to pass recommendation to ordinance 2020 206. Councilmember Dombrowski if you want to move adoption of the amendment so moved to amendment one is before us.'",
        "'speaker_0': 'Staff addressed the amendment as the discussion on the amendment. All those in favor. Please say I i i opposed nay.'",
        "'speaker_1': 'A.'",
        "'speaker_0': 'The ayes have it. The amendment is adopted. Move t one and two. Two. One is before us discussion. All those in favor of Taiwan. Please signify by saying I oppose. Nay, the ayes have it. Total amendment is adopted.'",
        "'speaker_0': 'We have ordinance 2020 206 as amended before us discussion.'",
        "'speaker_1': 'Mr. Chairman, I'd like to speak.'",
        "'speaker_0': 'As a member of No Duty. Thank you.'",
        "'speaker_1': 'Thank you. It's been a while since somebody did that. I didn't speak up during the question and answer, but I wanted to just make my feelings on this clear is I have always believed as somebody who spent a lot of time working with internal investigations, people as labor advisers, legal adviser, as a director, I have always believed'",
        "'speaker_1': 'that a good oversight, oversight that is accepted by all sides, by the public, by the people who have been harmed in most situations where we're doing an investigation and somebody has been harmed somehow and by the people who are providing critical services like law enforcement, feeling that they get a fair shake, I think that public oversight provides'",
        "'speaker_1': 'that kind of assurance to everyone when it's done right. But in order for it to be done right, the investigators need access to the information they need to to do their job without full information. They cannot provide the transparency.'",
        "'speaker_1': 'That's what we seek with oversight. And so I think this is almost almost a no brainer. I don't have any concerns with this level of of of authority at all. I hope that we can implement it. I personally also believe that oversight should not be subject to bargaining.'",
        "'speaker_1': 'I should not be able to say whether somebody what somebody how somebody judges me. I should not control that process for myself. That's just that's almost unethical. And so I think it's really important that we move in this direction for everybody.'",
        "'speaker_1': 'By the way, I'm very much in favor of having a process that was briefed to us in that earlier briefing about how elected officials can be held accountable, not holding in on myself or my colleagues separate from this.'",
        "'speaker_1': 'So I just feel very strongly this is a good step. I will vote for it. I hope that it passes in November and that we can find a way to implement it. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you. Other colleagues. Councilmember Dombrowski. I think it was I know the meeting's running long and I'll try to be very brief here, but I echo the comments, of course, from about 80. And I've been thinking a lot lately about the phrase law enforcement.'",
        "'speaker_0': 'And there's two pieces to that, the laws and the enforcement. And I think in the debate we're having here in our country right now, we should look at what laws we are passing and have passed and determine whether they are laws that have just put impacts in the way they come down on folks and make changes.'",
        "'speaker_0': 'We also need to look at our enforcement side and make sure that it's just and fair and effective and that people have confidence in it. This is one small piece of building confidence in the enforcement side of the laws that we as politicians and others have adopted.'",
        "'speaker_0': 'And like any profession, I just think that independent oversight, checks and balances, if you will, on that is par for the course. And it not only builds confidence by it in the system, by the public, or at least it can if it's done well, but it can also improve the organization.'",
        "'speaker_0': 'This is not about getting somebody or going after somebody. This is about ensuring that there is transparency when something goes wrong and that there is accountability and that there can also be vindication and clearance. Right. Let's let's keep in mind that these outcomes are not predetermined.'",
        "'speaker_0': 'We have independence in the structure to take a look at things when there's been a complaint made and make sure that when the decision is rendered that it comes from not an internal investigation unit or somebody part of the organization, but rather somebody outside.'",
        "'speaker_0': 'It's why our courts are independent. It's why the judge wears a black robe to signify neutrality. This is these are values enshrined in our in our in our country. And this today is just a tool for our independent oversight office to be able to hopefully carry out that mission.'",
        "'speaker_0': 'I want to just signal to colleagues, we've had a good discussion today about the role that the labor negotiations plays in this. And I've heard some new statements, including one echoing our county executives leadership saying, hey, you know, buffer state law, we wouldn't and maybe shouldn't have to negotiate this.'",
        "'speaker_0': 'We set the labor policy today for the county as the county council. And I think that we shouldn't wait on this issue and also on the ability of Oleo to conduct independent investigations until the next bargaining cycle. I know a lot has happened since we adopted that contract a couple of months ago.'",
        "'speaker_0': 'And I, I want to just let you all know that we're working on a draft labor policy that would ask the executive to go back to the bargaining table and see if the guild is willing to reopen the contract on those two items and get it done.'",
        "'speaker_0': 'Because I just don't think you can watch what's occurred here in America and have the same answer that we've had for a decade, which is no. And if it is no, I think that tells us some valuable information about what policy responses and what budget steps we might need to take.'",
        "'speaker_0': 'Because as I said at the last meeting, we talked about this on Friday. I think our public wants us to fund a law enforcement system that protects and serves in a fair and just way. And effective oversight and transparency is a part of us, a critical part of that and is necessary, in my view, before significant funds'",
        "'speaker_0': 'are put in. So I think the governor about it, she got it right. This is like almost a no brainer. We've already done it. The ordinance, this enshrines it if the voters approve it in our county constitution and courage colleagues support.'",
        "'speaker_0': 'Appreciate the co-sponsors that have come on councilmembers alkali co wells and McDermott. Thank you, Mr. Chair. The discussion. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member, Belgium. I Councilmember Carducci, but I also remember asking.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Demovsky both to council member.'",
        "'speaker_0': 'II.'",
        "'speaker_1': 'Council member done both I Council member calls I Council Member Caldwell's full time Council Member Lambert No. Council member Lambert Voltz, now council member of the drop.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'Council member of the Girl Scouts, council member Conroy Fowler. I council member by night thereabouts. I council members are high. I council members on halibut i. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is eight ice. Councilmember Lambert. No.'",
        "'speaker_0': 'By your vote, we've given a do pass recommendation to ordinance 2020 206 and. We will. Staff. Is this the one that time to engross might be needed?'",
        "'speaker_1': 'Yes, I think it's possible. But it's it's also if if there's a desire to expedite, that would be fine as well.'"
    ],
    "Charter Amendment on Inquest Process and Legal Representation for Decedent's Family.": [
        "'speaker_0': 'Is there a desire to expedite? Mira. Then I will. We will not expedite. It will be a regular course of action to full council and not on consent. That takes us to item nine. Proposed Ordinance 2019 to 36, which would amend the County Charter to clarify when an inquest was being held and to provide for legal representation'",
        "'speaker_0': 'for the family of the decedent. I know my colleagues are aware of litigation surrounding the inquest process. I want to point out that the litigation is separate from the charter amendment we'll be discussing. And it's my hope that we'll be able we will focus on the charter amendment and not discuss the litigation issues which would it would'",
        "'speaker_0': 'necessitate in executive session. Jennie Jim, John Batiste will give a staff report on the proposed charter amendment. And Ms.. Jon Batiste, the line is yours.'",
        "'speaker_1': 'Thank you, Mr. Chair. Jenny. Jon Batiste, Counsel. Staff. Agenda item nine begins on page 43 of your packet. As you noted, Mr. Chair, this is a charter amendment related inquests, and it would add language to the charter about when an inquest is to occur, and it requires the county to assign an attorney to represent the family of'",
        "'speaker_1': 'the decedent in the inquest proceeding. In the interest of time. I will be covering highlights in each section of my staff report. I'd like to start with a few background facts on inquests on page 404 of the packet.'",
        "'speaker_1': 'An inquest is an administrative fact finding inquiry into in the review of the manner, facts and circumstances of the death of an individual in King County. Inquests are held when a death involves a member of any law enforcement agency within King County, while in the performance of his or her duties.'",
        "'speaker_1': 'The scope of the inquest is limited to the cause and circumstances of the death, including whether the law enforcement member acted pursuant to policy and training. The purpose of the inquest is not to find fault or determine whether the use of force was justified.'",
        "'speaker_1': 'An inquest is not a trial in the sense that there is no judgment on liability or found fault is produced. However, an inquest has some of the attributes of a trial, including hearing, sworn testimony of witnesses and a selection of a jury in the case of an inquest known as a panel is the finders of fact.'",
        "'speaker_1': 'As you are well aware, there have been recent changes to the inquest process in recent years. I wanted to highlight a few of those changes on page four, oh five and four and six of the packet. In December of 2017, the executive convened a six member King County Inquest Process Review Committee.'",
        "'speaker_1': 'Then in January of 2018, the executive temporarily halted all King County inquests in order to allow more time to review the existing inquest policies and procedures. In October of 2018, based on some of the review panel recommendations, the executive signed a revised executive order for the policies and procedures for the inquests.'",
        "'speaker_1': 'Then, in May 2019, under the new inquest process, Judge Michael Spearman was appointed as an inquest administrator. There was a pause again in the inquest process in December 2020 as the parties indicated that they intended to seek review of the inquest procedures in King County Superior Court.'",
        "'speaker_1': 'Petitions were filed with the King County Superior Court subsequent to that, and most recently on Friday, June 11th, the Executive signed a revised executive order which includes revised policies and procedures. However, of note, there were really two things that were revised.'",
        "'speaker_1': 'Substantive changes to now allow for subpoenas to be issued to involved officers and to allow counsel for the involved officers to participate in the inquest hearings regardless of whether they offer testimony. The next date. That's coming up is July 17th of 2020.'",
        "'speaker_1': 'That is when you hear your court is scheduled to address all of the pending petitions related to the inquest process. I want to note that it's my understanding that the outcome of the litigation won't affect implementation of the charter amendment if it's approved by the voters.'",
        "'speaker_1': 'Page 5405 of the packet provides a very high level summary of the current inquest process that is outlined in the executive order. The process starts with the prosecuting attorney's office receiving information from a law enforcement agency within King County of a death of an individual involving more law enforcement.'",
        "'speaker_1': 'The PAO then reviews that information and advises the executive as to whether there should be an inquest. Upon receiving the advisory opinion, the executive determines whether to hold an inquest. If the inquest is to be held, the executive then directs the manager to proceed with the inquest and the manager then assigns one of the inquest administrators to'",
        "'speaker_1': 'preside over the inquest and the Superior Court provides the facilities, the jurors and the courtroom staff. Specifically now looking at the language in the charter amendment. Please turn to page four of six and four seven of the packet.'",
        "'speaker_1': 'The proposed changes to the Charter, if adopted by voters, include several substantive changes to Section 895 of the Charter. Specifically, it adds additional language regarding when an inquest is to be conducted. This additional language specifies that an inquest shall be held where a member of any law enforcement agencies actions, decision or possible failure to offer the appropriate'",
        "'speaker_1': 'care may have contributed to an individual's death. Was this language the intent of the Charter Review Commission was to expand and broaden the number and circumstances under which the inquests are to occur. The next substantive change in the charter amendment is that it defines what a member of any law enforcement agency is for purposes of this section'",
        "'speaker_1': 'of the charter. And that is the second substantive change. The third one is that it requires the county to assign an attorney to represent the family of the deceased decedent in the inquest proceeding. But the family has the option of accepting the attorney or not.'",
        "'speaker_1': 'As Council members are aware, in January of 2018, the Council did adopt Ordinance 18652, which requires the Department of Public Defense to provide legal representation to the family participating in inquests regardless of the income level of the family.'",
        "'speaker_1': 'The proposed charter amendment is very similar to this language. Mr. Chair, I would note that there are two amendments in your separate amendment packet starting on page seven. These amendments are not substantive to the First Amendment, which is on page seven, and it also has a corresponding title amendment reflects suggestions by legal counsel so that all the'",
        "'speaker_1': 'charter amendments use the same language when referring to the election dates. The Second Amendment on page nine is really a style and readability change so that the sentence reads a little bit better. Well, Mr. Chair, that concludes my comments.'",
        "'speaker_1': 'I'm happy to answer any questions for you.'",
        "'speaker_0': 'Thank you. Mr. Jon Batiste, before we go to questions, I would call on Mr. Surkov to take to present. Minister from the Review Commission. Good afternoon. Good afternoon, Mr. Chair. Good afternoon, Council members. My name is Rob Soca and I'm a commissioner.'",
        "'speaker_0': 'Can you hear me? Yes. I'm sorry. Right. And I'm a commissioner on the Charter Review Commission. It is my honor to appear before you all today, and especially Council Member Sala. Tommy Lee. Hey, Suz Fernandez Marial. Joseph Pepin.'",
        "'speaker_0': 'My chance. Dunlap. Giddens. Malina Lyles. These are just a few of the people. That when we talk about inquests, irrespective of whether the death is is deemed to be justified or not, we must never forget to acknowledge the humanity in the names of those killed in encounters with police.'",
        "'speaker_0': 'Sadly, the lives of families and communities are forever changed when someone is killed by police. Nationally. We're also mindful of the recent brutal killings by law enforcement of George Floyd, Breonna Taylor and others across the country. And I'll tell you that in my personal capacity over the last few weeks, I've been absolutely honored to march alongside my'",
        "'speaker_0': 'my dear friend and old colleague council members Natalie. As well as thousands of others in the movement for Black Lives across our region and our nation. Personally, I've also been moved by Dormice devotion to serving others and humbled by his presence and inspired by his bold leadership.'",
        "'speaker_0': 'And I thank him. And I think every one of the council members who have supported this particular proposal today. I'm also hopeful that our region. Our region's unified voice will bring meaningful, lasting policy change to address issues of police accountability and transparency.'",
        "'speaker_0': 'But in this forum, in this legislative body in which I virtually stand before you today, you must move from protest the policy. And here is the opportunity at hand. And when we're talking about the proposed charter amendment, what will it specifically accomplish?'",
        "'speaker_0': 'Well, on the commission, we believe that this common sense charter amendment recommendation before this committee would directly advance three basic ideals and law enforcement accountability, truth and transparency. Therefore, the Commission recommends making two substantive changes, which Jenny already highlighted.'",
        "'speaker_0': 'As it pertains to inquests. To recap. We want to do. We want to elevate to the charter the relevant county code provision for writing a county funded attorney, the families of the deceased during the inquest process. Again, this particular proposal, with respect to this particular proposal, it's 100% consistent with existing law and interpretation.'",
        "'speaker_0': 'The second thing that we want to do, as Danny alluded to, is we want to ensure that the inquests process occurs in the event of an in-custody death. She talked about some of the the textual underpinnings and some of the specifics as it relates to the exact language.'",
        "'speaker_0': 'But broadly, what we want to do is make sure it applies to law enforcement agencies and corrections agencies and require an inquest at any time that any action or decision or failure to act may have contributed to a death.'",
        "'speaker_0': 'We talked about what an inquest is. There's some egregious myths out there. We've heard from the community during this process, but the overwhelming majority of community input that we've heard and gathered during this process was was strongly in favor of having the inquest, as we we've proposed today.'",
        "'speaker_0': 'It's just the Administrative Fact-Finding Inquiry. The purpose is not to determine liability or fault. It doesn't address wrongdoing or whether the death could have been avoided or whether it was justified. So why do we why do why are we moving this specific proposed charge, a charter amendment before you today?'",
        "'speaker_0': 'Well, broadly when we began our work on the commission to help enhance the inquest process potentially at the charter level, we started with the premise that agree families deserve answers, they deserve truth as well. Again, inquests are not a finger pointing exercise to assign blame.'",
        "'speaker_0': 'One way or the other, the findings of an inquest help all stakeholders, including policy makers, including you all help you understand the causes and circumstances of the death to enable people to learn and grow from these experiences. We we found that inquest reform at the charter level helps maintain and improve public confidence and trust in the integrity'",
        "'speaker_0': 'and professionalism of the community's various law enforcement agencies across King County. During officer involved killings. Again, the goal is to enable departments to be held accountable for creating better safer. And more equitable ways of protecting and policing. So we know that it adds legal representation and affirmative right to legal representation for family members of the deceased.'",
        "'speaker_0': 'We think that this will fully and more equitably allow participation in the in the inquest process, regardless of a family's financial means. And we also learned that providing legal counsel for all families of the deceased will better ensure each party to an inquest will have equal opportunity to participate.'",
        "'speaker_0': 'Again, that one is 100% consistent with the existing law, but we felt strongly that as a matter of policy and priority. Before the current crisis that we're seeing. And I'm not talking about the COVID crisis. That it was important to up level that particular provision to the charter.'",
        "'speaker_0': 'And then with respect to the in-custody death clarification. The Commission wanted to shine a light. The light of transparency that's inherent with a more robust inquest by expanding the requirement to all in-custody death situations. And we felt that understanding in-custody deaths, learning from each other's deaths, and using that information to make positive, positive changes to the system'",
        "'speaker_0': 'outweighed any potential concern or cost of having too many inquests. Again, we felt that aggrieved families deserve answers. So does the public and members in the law enforcement community. They all deserve a full and complete investigation of the facts that led to any tragic death.'",
        "'speaker_0': 'Which of course, is tragic. So, Mr. Chair. And Council. In sum, we believe that these common sense reforms to the Charter to create additional transparency and accountability and trust in law enforcement are necessary. And now the time for action and accountability is more.'",
        "'speaker_0': 'Is more clear than ever, in my view, and we must move forward together to get to the truth. And I'd finally like to make it clear that this was one of the early action items that Chair Miller identified earlier, that we moved forward last summer because it was adopted unanimously.'",
        "'speaker_0': 'We thought it was less controversial, and so we felt strongly about it then. And given current events, we feel well. I personally feel even even more strongly about it. So, Mr. Chair, that concludes my overview of the inquest proposals.'",
        "'speaker_0': 'At this time, I welcome any questions or comments that you all may have. Thank you very much. Colleagues questions. Seeing no questions. Council members all i. Thank you, Mr. Chair. I just want to first thank Rob soccer. Thank you for first of all, for making me blush.'",
        "'speaker_0': 'I appreciate you. I got to know Rob when I was an associate at Perkins Curry, and he's always been an exceptional attorney and tireless champion for justice. I want to thank him all and trace Mikita, Oliver, Chair Miller and everybody on the Charter Commission, Charter Review Commission for all the hard work that you all have done.'",
        "'speaker_0': 'I'm very supportive of this amendment. You know, families that have gone through the inquest process, our families who we owe the most to these are families who lost loved ones at the hands of the government. And this charter amendment would make sure that if one of our constituents has had to suffer the death of a loved one'",
        "'speaker_0': ', that they would be provided an attorney to go through the inquest or investigation process. So it's the absolute minimum that can be done, in my opinion, to provide the fundamental right to representation during what is the most unimaginable situation that a family could go through.'",
        "'speaker_0': 'So I ask for everyone's support on this, and thank you also to the co-sponsors on this legislation. Some of those. Councilmember Dunn. Thank you. Thank you, Mr. Chair. I'm a little unclear. I got all the good arguments and the good arguments in favor of the legislation.'",
        "'speaker_0': 'I didn't get sort of a real breakdown with specificity of the of the language. Is this are passing an ordinance is charter amendment. I guess I'm missing exactly what the details in terms of the inquest language. This is a charter amendment as recommended by the charter commission.'",
        "'speaker_0': 'Okay. So let me ask this question. What I heard was was a very good explanation of the arguments in favor of the charter amendment. I didn't hear a central staff breakdown, and we're not going to do that. We're just going to rely on the charter review commissioners to provide the briefing.'",
        "'speaker_0': 'And that's fine. But I think there needs to be. A little more analysis in terms of what it does with the language does. And in terms of pro and con, there's a mr. Sanchez presentation is the commissioner was preceded by a staff report by Getty Jon Batiste.'",
        "'speaker_0': 'And if you have questions of Mr. Batiste or or want further information, we can certainly facilitate that. Yeah. I mean, Jenny, can you just break this down to quick parameters? I might have missed that. I was out of service for just a little bit longer.'",
        "'speaker_0': 'Can you break down the parameters of what the language changes?'",
        "'speaker_1': 'Yes. So on page 4:06 a.m. 407 of the packet, it's just a sentence that we're talking two sentences. The existing language is is very short and the changes are also very short, but they are substantive. So I'll go over it again.'",
        "'speaker_1': 'If adopted by voters, these changes to Section 895 of the charter would add the additional language regarding when an inquest is to be conducted. This additional language specifies and so this is the following is new language. An inquest shall be held where a member of any law enforcement agencies actions, decision or possible failure to offer the appropriate'",
        "'speaker_1': 'care may have contributed to an individual's death. Additionally, there is another sentence added for the purposes of this section. Members of any law enforcement agency includes a commissioned officer, noncommissioned staff and agent of any local or state police force, jail, detention facility or corrections agency.'",
        "'speaker_1': 'The next substantive and it's an is again, a one sentence but very substantive. The county shall assign an attorney to represent the family of the decedent in the inquest proceeding, but the family has the option of accepting the attorney or not.'",
        "'speaker_1': 'As Mr. Sokka indicated. Currently, the current code provides that the Department of Public Defense shall provide an attorney to represent the family. So this would not change. The county's the current practice now, but it would elevate that to the charter.'",
        "'speaker_1': 'Additionally, as I noted earlier, the added language is intended to expand and broaden the number of inquests that occur with that additional language.'",
        "'speaker_0': 'Got it. Very good. That's okay. That that that helps me. I try and thank you for that. And I missed part of that. Is there a beneficial note or anything in terms of the cost associated with it, with that those additional changes.'",
        "'speaker_1': 'There has not been a fiscal note currently the. County does fund the administration of the inquest process. But there has not been a fiscal note to specify how many what the additional costs, if any, would be.'",
        "'speaker_0': 'And Mr. Chair, real quick on this, we got 11 charter amendments to the plan will be a central staffer will introduce the issue, then we'll have a charter review. Commissioner, make the pitch essentially. That's the point. Just so I understand.'",
        "'speaker_0': 'That's how we've done it today. If there are additions, if when we take up additional charter amendments. And to date, only five of the 11 have been introduced. There are commissioners who wish to make presentations. The commission supplies somebody.'",
        "'speaker_0': 'Then, yes, we would follow a very similar format. Okay. Thank you. Councilmember Yvonne, regular. True. That was the question. Council member Dunn's question was the one I was curious about. If there is a fiscal note, if there is a limit on how much we pay and I want that, we'd have an opportunity to evaluate that and the'",
        "'speaker_0': 'forecast. Thank you, Councilmember Lambert.'",
        "'speaker_1': 'You can understand it. Agree with Councilmember Graham there couldn't be a more horrendous experience than life for anybody but to lose a loved one's. I did support the inquest process and paying for the attorneys. But the reason for a charger for me is how the government works not to pick special laws.'",
        "'speaker_1': 'We like the Mexican charter so can't be changed for ten years. So the things that are important here are writing in law or providing the attorneys and we have inquests. And so I think that as a policy, taking our favorite pieces of legislation and sticking it in the charter, that's not what the charters for.'",
        "'speaker_1': 'And I have some concerns about some of the language, like possible failure, appropriate care, who who decides what was appropriate care. And that's the reason we have laws so that we can define what is possible failure, what is appropriate care.'",
        "'speaker_1': 'So we have a definition, we put it in the charter. We don't have that. These are already existing in the existing law. And I think that they are important. I can't imagine them being changed. So having them clearly defined in law is in my mind where these things should be, not in charter.'",
        "'speaker_1': 'Thank you, Mr. Chair.'",
        "'speaker_0': 'Further discussing colleagues. Councilmember Bell DC.'",
        "'speaker_1': 'Mr. Chair, just a brief comment. I really appreciate the what appears to be some serious care that went into drafting the language around when an inquest will be required. I'm glad to see that this came out of the executives process because I think, as we all know, currently, the executive or prior to his executive orders of recent'",
        "'speaker_1': 'times would have a decision. Yes, this one gets an inquest. No, that one doesn't get an inquest and that can. And that in and of itself can be, I imagine, a very difficult decision to make, but also seems very odd and unfair to the people who have been infected by the person who's been, you know, their family'",
        "'speaker_1': 'member's death. Like, why is one one death worthy of this kind of deep public inquiry? And another one isn't? So I think the standardization of it is really good. But also, the the Department of Justice has standards for when we report what what in custody death is.'",
        "'speaker_1': 'That counts for purposes of data collection. And it sometimes doesn't make a whole lot of sense, I'll tell you. Like so we have had people who have never, ever set foot in our jail, who died in custody and were counted as a death inside the King County jails.'",
        "'speaker_1': 'We have likewise had people who have come into jail, had bad things happen to them in jail, got sent to the hospital because of the injuries they incurred, died at the hospital from their injuries and don't count as an end to custody death, which is just crazy, right.'",
        "'speaker_1': 'So I like when I read this, it to me it makes a lot of sense that the way it's been stated and I appreciate the work that apparently went into that and I'm happy to support both the standard that's being set here for a routine inquest be happening whenever there is a death in our custody, whether that'",
        "'speaker_1': 'be in police custody or in or in like sheriff's custody or in our jails. And I really I mean, I don't I'm very happy to support the proposal that the family gets a support person who understands this difficult process, which I think would be hard for a layperson to navigate at the best of times.'",
        "'speaker_1': 'It all makes good sense to me and I support it. Thank you.'",
        "'speaker_0': 'Further questions. Councilmember Carlos.'",
        "'speaker_1': 'Thank you, Mr. Chair. Just to chime in, I also support, since I was pleased to work on this issue in one justice committee when it came through earlier. And I think it's an important step forward thinking.'",
        "'speaker_0': 'Council members are prime sponsor. I'd like to move the amendment. Mr. Chair. Councilmember Sala has moved adoption of Ordinance 119 to 36 and moved adoption of Amendment one. There are two amendments, correct?'",
        "'speaker_1': 'That's correct. There are two amendments in a title amendment to conform with the First Amendment.'",
        "'speaker_0': 'Can you remind us the contents of Amendment one in Amendment two?'",
        "'speaker_1': 'Yes, they are both non substantive amendments and Amendment One is simply to make the same changes to the election date language. And then Amendment two is intended for style and readability changes that. The sentence reads a little bit better.'",
        "'speaker_0': 'Councilmember Zala has moved to adoption, a move that would give a two passed recommendation to Ordinance 2019 to 36 and adoption of Amendment one. The date change discussion on Amendment One seen none of those in favor of Amendment One.'",
        "'speaker_0': 'Please signify by saying i. I. I opposed. Nay, the ayes have it. Amendment one is adopted. Council members all by Amendment two. So move. Mr. Chair and some of his allies moved the adoption of amendment to see no discussion.'",
        "'speaker_0': 'All those in favor of amendment to please signify by saying i. I opposed nay. The ayes have it. Amendment two is adopted. Council members on how they would you move it? Adoption of Title Amendment one, please. So move, Mr. Chair.'",
        "'speaker_0': 'Adult Amendment Tier one as before. See no discussion. All those in favor of title amendment to one please signify by saying I, i all those opposed. No, the ayes have it. Total Amendment one is adopted. We have Ordinance 2019 to 36 as amended before us.'",
        "'speaker_0': 'Discussion Council members. Hello. Would you like to open? Sorry, but I think we have said everything that needs to be said at this point. I hope everybody supports this amendment and I'm very thankful for all those who worked on it and co-sponsored it.'",
        "'speaker_0': 'Thank you. Thank you for the discussion, Councilmember Caldwell's.'",
        "'speaker_1': 'Sorry, Mr. Chair. I just left the unmute. None.'",
        "'speaker_0': 'It's my little trick to see. Oh, I think it's my advance warning if I realize some of these mute is off. I see people meeting all over the place right now. See no further. No one further to speak.'",
        "'speaker_0': 'I'd ask the clerk to please call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Belushi. Hi, Councilman. Douchey Council member Dombrowski.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council member Dombrowski. Both I Council member. Done.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Council member done votes now. Council member Cole wells. I. Councilmember Caldwell's votes I. Councilmember Lambert. No. Councilmember Lambert. Votes. No. Councilmember. Autograph.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember after grove votes. I. Councilmember Yvonne Wraith. Our.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Councilmember von Right. Thereabouts, no. Council members only.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'Council members on high votes? Yes. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is six I's Council Councilmembers Lambert on rank power and one vote no.'"
    ],
    "Outdoor Dining, Personal Service and Retail Opportunities in Unincorporated Areas.": [
        "'speaker_0': 'By your vote, we've given a do pass recommendation to ordinance 2019 to 36, and we will advance that to full council. We will expedite it. So it would appear on next Tuesday's council agenda. That takes us to the next to them on our agenda.'",
        "'speaker_0': 'Proposed Motion 2020 208 calling for the executive to allow restaurants and retail businesses in unincorporated King County to have flexibility to provide more outdoor service. Mary Annan will give the Senate report has begun. The line is yours.'",
        "'speaker_1': 'Thank you, Mr. Chair. For the record, Mary Bergeron from the council staff and the materials for this item began on page 433 of your packet. As you noted, proposed motion 2020 0208 would ask the executive to allow restaurants and retail services in unincorporated King County flexibility to provide outdoor dining or retail services in addition to what is'",
        "'speaker_1': 'allowed indoors during the phased reopening plan. As you all know, King County is right now in modified phase one of the Safe Start reopening plan and has applied to move into phase two, which could be permitted as early as the end of this week.'",
        "'speaker_1': 'Both of those phases impose fairly significant limitations on the kinds of activities that can happen indoors. And you'll see on page 435 of the packet, there is a chart that lists the types of activities that are allowed in modified phase one.'",
        "'speaker_1': 'And I'll call out in particular that for restaurants. Indoor seating is allowed at 25% capacity in modified phase one, 50% in phase two for retail operations, 15% indoor capacity in modified phase one, 30% in phase two for both of those types of services.'",
        "'speaker_1': 'Outdoor activities are more expansive, basically because the risk of transmission is lower outdoors. And so for restaurants in both phases, outdoor seating is allowed at 50% of existing capacity, with new or additional seating allowed if it can be spaced so that there's six feet of distance between tables.'",
        "'speaker_1': 'And then for retail activities again, there would be additional activities allowed outdoors as long as there is appropriate distancing. So what this motion would do is ask the executive that for restaurants and retail services in unincorporated King County, that they be given flexibility to expand outdoor activities in privately owned areas such as parking areas or other private'",
        "'speaker_1': 'property, as well as adjacent sidewalks, alleys or other right of way ensuring that steps are taken to ensure adequate pedestrian pathways and that there be no additional permits or fees required. So the proposed motion would ask the executive to look into this to prepare any legislation needed and to implement this request with the provision that at the'",
        "'speaker_1': 'time that the county enters phase four of the Safe Start plan, which would essentially be the back to normal activity that these provisions would sunset. That concludes my report. At this point, I know that we've got executive staff here, if there are any questions, and I'm happy to answer any questions as well.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Astronauts. Up the Grove. Member of the Grove. Thank you, Mr. Chair. I assume, Mary, that this has flexibility, given that it's a motion to the executive to somehow account for any potential conflicts. Should. One person's right, you know, new ability to set up tables.'",
        "'speaker_0': 'Impact. Other peoples, something other than a traffic flow was the only thing. But I'm if it reduces the number of parking spaces or creates noise for a business next door. I mean, is there I don't think it'll be a problem, but I assume we don't get in that level of detail here, that we just ask the executive'",
        "'speaker_0': 'to come up with a way to do this?'",
        "'speaker_1': 'Yes, that's correct. Councilmember, this motion would just ask the executive to implement the appropriate regulations and again, to do them in a way that doesn't require additional permits or fees during the Safe Start reopening period. Executive staff have noted that there would be essentially additional complications for businesses expanding into the right of way that would have to'",
        "'speaker_1': 'do with access and, you know, to maintain appropriate ADA access, for instance. And so all of those would, of course, have to be looked into as part of the permitting process. And this motion would ask the executive to take those steps.'",
        "'speaker_0': 'Okay, thanks. Further questions.'",
        "'speaker_1': 'Obuchi.'",
        "'speaker_0': 'Councilmember Vale Dewji. I think this is.'",
        "'speaker_1': 'A great idea. Thank you to the sponsor and the co-sponsor. And I just want to ask, is it something that's written in a way that we could update the code so that there are opportunities to allow this sort of activity even when we are beyond like COVID one, just just because it's a good thing to do.'",
        "'speaker_1': 'I would love to see that as well. I wouldn't say no because it wasn't in there. But it would be great if it was something that was permissive where you could see more outdoor eating and encourage more outdoor activity this way into the future.'",
        "'speaker_1': 'Thank you. Council Member The motion as written would sunset these temporary and more expansive opportunities. At the time that the county enters phase four, however, it does ask the executive to prepare any needed legislation to implement them. And so it would certainly be something that were there to be additional legislation.'",
        "'speaker_1': 'The Council could choose to keep it in force or to evaluate it at such time as we get back to normal life. Thank you.'",
        "'speaker_0': 'Thank you for that question. Councilmember Bell duty for further questions to preference to those who often complimented the sponsors of the motion. Councilmember Dombrowski I do want to compliment the sponsors and let it be known that I will accept any invitation for al fresco dining for many of my colleagues in their districts pursuant to this legislation.'",
        "'speaker_0': 'And I'll buy the first round. Very good. With that, I see no more questions. This was an idea that I started to work on, and I was obviously not thinking as big as Councilmember Lambert, who always things very big because I was only thinking restaurants.'",
        "'speaker_0': 'It was her idea to make sure we were including retail as well. Councilmember Lambert Promotion.'",
        "'speaker_1': 'Mr. Jack, pleasure working with you. I'd like to make a motion that we that we pass ordinance 2020 0208 with a DE Pass recommendation.'",
        "'speaker_0': 'Councilmember Lambert has moved to the we get a do pass recommendation the motion 2020 208. Discussion Council member Lambert.'",
        "'speaker_1': 'Thank you well and to the just ears back council member. I'm a beauty. I will enjoy eating with you afterwards and the speaker and speaker after that. And we will look for how many rounds. But this is important.'",
        "'speaker_1': 'I would like to thank the city of Spokane. They had the legislation and had put together quite a extensive book on what their thinking process were. And so we were able to get a lot of information that might be helpful in going forward if you choose to do this.'",
        "'speaker_1': 'After we get the phase four and this will help our businesses that are having a huge struggle being sustainable to have more options of being able to keep their businesses. So I look forward to more evenings out and having a nice dinner or something.'",
        "'speaker_1': 'Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you. Further discussion. Say, No, no, that's the court to please call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chairman. Council member. Founder. It's a great idea. Hi. Council Member. Calgary Chief Outside Council Member. Dombrowski.'",
        "'speaker_0': 'It's a fabulous idea.'",
        "'speaker_1': 'I Council Member Dombrowski Both I Council member one.'",
        "'speaker_0': 'We.'",
        "'speaker_1': 'The council member done both. So I council member calls it a high. Council member wells full time. Council member. Member. Council member Lambert I Council member Lambert Oh, it's like.'",
        "'speaker_0': 'I guess I.'",
        "'speaker_1': 'Kill council member of the group outside council member gun our.'",
        "'speaker_0': 'Fears I.'",
        "'speaker_1': 'Council member go and make report council members online.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'Members. ALL Hello, Bullseye. Mr. Chair.'",
        "'speaker_0': 'Fantastic sponsors. I vote.'",
        "'speaker_1': 'I know the vote is 980 now.'"
    ],
    "Payment Agreements for 2020 Property Taxes.": [
        "'speaker_0': 'Thank you. By your vote, we have given a unanimous do past recommendation to motion 2022 await and we will expedite that posthaste. And Council Madam Council Chair, I urge you to have a meeting next Tuesday so we might take this legislation up and with that we move to item 11 on today's agenda.'",
        "'speaker_0': 'Motion 2020 192. This calls for the County Treasurer to provide for payment agreements for 2020 property tax payers. Wendy Sue who will give our staff reports. Ms. who the line is yours.'",
        "'speaker_1': 'Thank you. Wendy Sidhu Council staff. I'm really hoping the sponsor of this legislation can actually see my video because I feel like he would appreciate it. So the materials for this item begin on page 453, but I'm going to actually move you to the analysis section that starts on page 424.'",
        "'speaker_0': 'Of your packet.'",
        "'speaker_1': 'Proposed motion 2020 0192 would request the County Treasurer to provide four monthly payment agreements for 2020 and 2021 for tax payers affected by the COVID 19 pandemic. Under state law, however, the Treasurer can only provide for payment agreements once a count because what's once a tax account becomes delinquent and so payment agreements can't actually be offered prospectively'",
        "'speaker_1': '. The Treasury section does have a property tax payment agreement program in place for taxpayers who are delinquent on prior year taxes. There was a change in state law earlier this year that would allow the Treasury to expand the program to taxpayers who are delinquent on current year taxes.'",
        "'speaker_1': 'So that means that as of this change in state law this year, people who did not make their payment as of June 2nd, they would now be eligible to enter into payment limits are turning to page 455. The amendment section at the direction of the sponsor council staff has drafted a striking amendment as one that would request'",
        "'speaker_1': 'the Treasurer to identify those accounts delinquent on 2020 taxes as of June 2nd, 2020. The executive would also be asked to perform outreach to promote the delinquent tax payment program and also to look at considering waiving or subsidizing fees charged by the third party vendor that Treasury uses to administer the payment agreement program.'",
        "'speaker_1': 'Then finally, the motion also requests the Treasurer to report on utilization of the program by April 1st, 2021. The striking amendment is on page 13 of the amendment packet and I'd be happy to answer any questions. And Ken Guy and Carol Basler are here as well.'",
        "'speaker_0': 'So who does the legislation? Is the county able to do this without legislative action from the state legislature?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'We have. We have the authority. We need to do this now.'",
        "'speaker_1': 'Yes, there was a state law change that allows for counties to offer payment programs for current year delinquent taxes.'",
        "'speaker_0': 'Further questions? Council member done, Mr. Chair move proposed the motion 2020 0192 to speak to it. Council member Dennis moved to give a dubious recommendation to motion 2020 192. Council Member Dunn Thank you. And Wendy, I wish I could see you.'",
        "'speaker_0': 'I tried like crazy to do that, but I'm I'm a I'm a low tech man in a high tech world. So just barely able to hang on to the speaker phone. But I appreciate your patience. Um, I want to thank my colleague to work with me on this plan to provide property tax assistance to King County residents'",
        "'speaker_0': 'who, in a number of cases, many cases desperately need it. Over the past few weeks, we've worked really hard with the executive offices and the Treasurer to integrate a lot of their valuable input into the strike or that is before you.'",
        "'speaker_0': 'Today we are painfully aware of the financial strains caused by the COVID 19 pandemic, and we share the common goals of getting help to those who are most affected by our present crisis this year. And this is important to note this year, 28% more King County residents are delinquent on their property taxes compared to 2019.'",
        "'speaker_0': 'That's an additional 10,000 people who are not able to pay their property tax bill. And what today's striker does is focus on those taxpayers who are currently delinquent June one being the deadline, and offers more flexibility to the county treasurer in implementing a proposed payment program while maintaining the intent of the original motion.'",
        "'speaker_0': 'The amendment asked the county treasurer take steps, affirmative steps to engage those who are delinquent in the first half property tax payments for the June 2nd and offer them a payment plan for their 2020 property taxes. However, it leaves up to the Treasurer to determine the details of designing and implementing the payment plan.'",
        "'speaker_0': 'The amendment maintains the request that County Treasurer consider the feasibility of either waiving or possible subsidizing third party vendor fees that accrue during that are accrued due to that payment plan. So basically payment plans are already authorized under state law.'",
        "'speaker_0': 'They're are also something we already do. The county does not promote them or reach out in an effective way. And Ken may want to speak to the details of that, but there are vendor fees and other things that are involved.'",
        "'speaker_0': 'So I appreciate, again, my colleagues willingness to work with me on these, providing some flexibility for tax payers during these challenging times. And I also think that putting a payment plan together actually will end up generating the county more revenue because instead of people just abandoning their taxes for six months or a year until there's a leave'",
        "'speaker_0': ', it gives them a decent payment plan option that they might be able to pay to amortize this debt. And I thank you for your consideration. Thank you for the further discussion. McCormick, would you please call the roll? I'm sorry.'",
        "'speaker_0': 'I'm sorry. Councilmember Dunn, will you remove adoption address one? I move as one? Strike Amendment. S-1 is before us saying no discussion and all those in favor of S1 please signify by saying hi are opposed. Nay, the ayes have it.'",
        "'speaker_0': 'S1 is adopted. Then see no further discussion. Madam Clerk, will you please call the roll?'",
        "'speaker_1': 'And Mr. Chair. Council Member Bellucci I Council Member about due to votes I Council Member Dombrowski I Council Member Dombroski votes i council member done.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Council member downvotes i council member.'",
        "'speaker_0': 'Commonwealth High.'",
        "'speaker_1': 'School Member. Cornwall School Science Council Member Lambert I. Council Member Lambert Outside Sponsor Member of the Grass.'",
        "'speaker_0': 'Fire.'",
        "'speaker_1': 'Council member of the crowd outside council member Yvonne right. Are I council member or outside council member?'",
        "'speaker_0': 'While I.'",
        "'speaker_1': 'Remember I saw the light bulbs, I missed your chair.'",
        "'speaker_0': 'By your.'",
        "'speaker_1': 'Chair. The vote is nine zero now.'",
        "'speaker_0': 'Thank you. By your vote, we have given a do pass recommendation to motion 2020 192, and we will expedite that to full council a week from today. Madam Clerk, I believe we have no council members who missed any votes, so no need for reconsideration.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'All right. And Members, I will remind you before we adjourn, I will remind you, we have an Employment and Administration committee meeting that will immediately follow this. So the fun is not over. Do not hang up. Do not depart with that.'"
    ]
}