{
    "Amendment to Agreement with Department of Ecology for Wastewater Project.": [
        "'speaker_0': 'The third amends a loan with the State Department of Ecology for a wastewater capital project. We have a motion to approve the consent agenda.'",
        "'speaker_3': 'Mr. Chair. So moved.'",
        "'speaker_0': 'It's been with the consent agendas before us. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member Bellucci I. Council member Dombrowski.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council member.'",
        "'speaker_3': 'Done by.'",
        "'speaker_1': 'Council Member. Commonwealth I. Council member, Lambert. Councilmember Lambert. Councilmember Up the Grove.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'Councilmember Yvonne Lothar.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Council members online.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is eight. Eyes are on us and Councilmember Lambert excused.'",
        "'speaker_0': 'I thank you by your vote. We have given a do pass recommendation to the consent agenda item six, seven and eight. And today's agenda, we will without objection, we will expedite those to full council next week.'",
        "'speaker_1': 'Those are our McDermott. This is Aaron. The hearing for the moratorium is on until December 8th. That one will hold until then.'",
        "'speaker_0': 'Fair. Thank you. Yes. So two of the three will be on the agenda next week. And the brewery distillery moratorium is requires a public hearing. So it will appear in due course December 8th, I believe. Correct. Thank you.'"
    ],
    "Emergency Supplemental Appropriation for COVID-19 Response.": [
        "'speaker_0': 'That takes us item nine, an item for discussion and possible action. It's the fifth COVID supplemental ordinance. Andrew Kim of our central staff is here to provide the self-report. Mr. Kim, the camera is yours.'",
        "'speaker_3': 'Thank you, Mr. Chair. Am I coming out okay?'",
        "'speaker_0': 'Yes, you are.'",
        "'speaker_3': 'Great to share. Andrew Kim with Council Essential Staff. The staff report for this item begins on page 46 of your agenda packet, but I will actually begin my briefing starting on page 47, on page 47. In table one, you can see a summary of the Cobas supplemental omnibus that has been adopted thus far, and also the COVID'",
        "'speaker_3': 'five, which is before you today. So if you include all the proposed appropriations in COVID five, then all the COVID supplementals that have been adopted would amount to about 360 million, of which 42 were for operating purposes and 73 million for capital.'",
        "'speaker_3': 'With regards to COVID five, I've provided a table to categorize some of the expenditures. Details of the COVID five elements are actually in Attachment four to the staff report before effort for the purpose of the staff report. I thought it would be more valuable to provide some categories.'",
        "'speaker_3': 'So the only real policy decision for the for the members is an increase of $500,000 to the digital equity program for vulnerable populations. That was established by the council during the third COVID omnibus with the initial appropriation of $500,000, and then in call before council increased that appropriation by another 195,000.'",
        "'speaker_3': 'So the Executive is proposing to increase that even further by another half billion as there is more of a demand for that for that program. The other items in COVID five, as you see in table two, about 4 million is related specifically to various departments for their operational expense related to COVID.'",
        "'speaker_3': '27 million is directly to counties the public health response to COVID. So that's all for public health. And it is five $5.6 million grant acceptance for the CARES Act, a HUD CDBG grant. And lastly, there's about $4 million of technical corrections from errors in in COVID four.'",
        "'speaker_3': 'Moving on to page the next page, page 48, page 48 through page 50, top of page 50 is is a summary, as I mentioned, of the COVID 19 grant programs administered by Gillespie, DHS, DLS and Public Health. This is just a summary of the details that that I've emailed to all the members on on Monday.'",
        "'speaker_3': 'It just provides some key figures of some of the programs, along with how much was appropriated for each program, how much spending has been done for each program, and and the project expenditures for some of the programs. This is, again, kind of a status update for now.'",
        "'speaker_3': 'Executive staffs state that the contracts are still ongoing or and there are some committed dollars. But but as as they move through the process, we'll make sure to follow up with executive staff to get some additional updates for the members.'",
        "'speaker_3': 'Now on to page 51. There is a table on page 51, table seven. And through this proposed ordinance, the executive is making some assumptions, some new assumptions. Since the Ford COVID omnibus adoption on table seven, you'll see two columns, one column titled After Adoption of Ford Code Omnibus and Come to the Right says as proposed via Fifth'",
        "'speaker_3': 'Omnibus. After the adoption of the Ford Code Omnibus, there was about $194 million of the 262 Kroner relief fund adopted in in the course of the supplemental appropriations. And then 68 million of that you see in the sheet it rose were reserved for those four items.'",
        "'speaker_3': 'COVID 19, you point out costs that caused for those taking leave due to COVID 19, FEMA match and risk reserves. Now, there wasn't much of a breakdown at the time, but since then, the executive is taking a new approach on the $262 million of the Corona Relief Fund.'",
        "'speaker_3': 'So as you see, the adopted appropriation to date is still 194 from COVID one to COVID four. And then the assumptions for the the middle of the COVID 19 redeploy staff costs is about 70 million. Staff costs for taking those taking leave due to COVID is 2 million.'",
        "'speaker_3': 'And they're not utilizing any of the Corona Relief Fund for the FEMA max and risk reserves. The executive is asked to assuming some under expenditures and and some removal of funding for ineligible expenditures of about $24 million. There's also some additional there's an additional $1 million from the interest earned for for the 262 million.'",
        "'speaker_3': 'And with the fiscal the omnibus proposed appropriations of 19 million, that leaves 3 million of the 263 million unallocated. The reason for this new approach, one of the reasons for this new approach is because because we're still so uncertain about the counties FEMA match obligations for for those for the FEMA grants.'",
        "'speaker_3': 'And and because we have to extend the current relief fund monies by December 30th to provide some more flexibility. But what the executive is proposing is to utilize some of the Corona Relief Fund to pay for general fund staff costs related to COVID and free up some general fund reserves so that that can be utilized through the'",
        "'speaker_3': 'FEMA match. And if FEMA matches up the necessary, then then it can be used for other flexible general fund expenditures. And then on the on page 52, there is a timeline for the budget shares proposal on actions regarding this code five.'",
        "'speaker_3': 'Just notably that on November 5th there is a new and the budget is requesting deadline for a striking amendment request. And then on Sunday evening, the finalized the amendment will be released and then any amendments to that striker is due on Monday, November 9th, at noon.'",
        "'speaker_3': 'That concludes my remarks. Mr. Chair.'",
        "'speaker_0': 'Mr. Kim. Thank you very much. I'm scrolling back. It was unfortunately, a. I'm sorry. I'm not going to find it. Here it is. Page 50. The table at the top. Can you speak? Can you clarify for me how much funding is in just care?'",
        "'speaker_0': 'The Pioneer Square City program as this budget arrives and how much is in the program? If we were to adopt the budget as the executive transmitted it to us for the Chest Cares program program.'",
        "'speaker_3': 'Yeah. So the Just Cares program was so the council appropriated 4 million for that program and covered three, and there was no additional appropriation for this proposed ordinance. So it remains at 4 million for the end of the year.'",
        "'speaker_0': 'Right. Thank you for their quote and other questions of Mr. Kim. Councilmember Wells.'",
        "'speaker_1': 'Thanks you this chair. I am turning this discussion over to. The Bench of Fiscal Management. Committee member Dombroski is in the lead on this and is covered by the budget. How would you like to have them make the motion at this time?'",
        "'speaker_0': 'Catherine Dombrowski.'",
        "'speaker_2': 'Okay. Well, thank you, Mr. Chair. And Madam Chair and Andrew, thank you very much for the overview. Just for I think, Mr. Chair, you want to have a little discussion if members are interested, right, about what we might like to see in getting this the rather than you saying yes.'",
        "'speaker_2': 'Okay. So just again, top line, it's about a $41.6 million appropriation ordinance covered five we're calling it five or 6 million. Of that, I think is that is a capital and the rest is in operating funds. And Dwight David tells us we've got and Dwight, correct me if I'm wrong here, but maybe $4 million or so of'",
        "'speaker_2': 'additional opportunities to add on to this with with members priorities and suggestions, am I to do for Dwight or where what's our number. Yeah, I think you're safe at four. Okay. That's kind of been our language with Dwight.'",
        "'speaker_2': 'Where are we say fall on this year. And we've been working very closely with his shop and PSB and his deputy, Erin, to make sure we get this done. As you all know, the original plan, because of all of the budgets was to try and do this in December.'",
        "'speaker_2': 'But given the December 30th spending deadline required by federal law and to give better guidance to the department and to comply with kind of budget transparency and open means act and get members interest in it, we thought we'd take a run at speeding it, speeding up our consideration.'",
        "'speaker_2': 'So the plan, I think Andrew highlighted there would be if it would be to hopefully pass this out today without recommendation, with the understanding we put together a Stryker on that schedule that's outlined for adoption a week from today.'",
        "'speaker_2': 'Just a couple of guideposts to remind us all what we're trying to do, and that is, one, be consistent with the motion adopted early in the year which prioritizes I'm going to go from memory here, but number one, our public health needs and response to COVID two, housing three, security or behavioral health needs and economic recovery.'",
        "'speaker_2': 'Those are kind of the big buckets. And maybe I missed something there, but I'm going for memory. And then maybe even more importantly, we are not we are going to try not to and maybe we just can't. In any event, drop on a new program to our executive branch folks.'",
        "'speaker_2': 'We're trying to get money out the door. I think we all know that now. But we're looking for folks in your priorities, looking for for contracts that exist, providers that exist, kind of channels that we can get the dollars out, because that's the that's the whole point here.'",
        "'speaker_2': 'So those are my those are our requests from the budget chair and myself. And we thought we would have just a little bit of dialog here for members to express interest. I won't speak for members, but I will share mine and then turn it over.'",
        "'speaker_2': 'I'm interested in we put two and a half million dollars into the behavioral health bucket last time. We have a contract provider network of about 40 organ entities around the county and that money was well received and worked pretty quickly.'",
        "'speaker_2': 'We've worked with the department to gauge potential additional need in that space, and they think that they could use another 2 million or so in the behavioral health space. So that is one request that is kind of on the table and I know there are others, but from a numbers, I'll let folks speak to them.'",
        "'speaker_2': 'And Mr. Chair, do you want to call on colleagues or how do you want to proceed?'",
        "'speaker_0': 'Yes, I'd be happy to.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Then brought the growth.'",
        "'speaker_2': 'Thank you, Mr. Chair. And. And, Mr. Vice Chair. I was going to mention one of my interests as we work through this in the week ahead. I think everyone may have seen the headline in the Seattle Times. I think it was like five or six days ago that said South King County has been disproportionately affected by coronavirus'",
        "'speaker_2': '. And I think the reason largely has to do with poverty also has to do. You know, we're continuing to see higher rates among communities of color. You know, the I understand, if my notes are correct, are the age adjusted rate for infections in King County's about 1200 cases per 100,000.'",
        "'speaker_2': 'It is an almost twice that for native Hawaiian Pacific Islanders and for Hispanic population. It's about 50% higher for African-Americans. And so as we think about crafting what we do, where we have a kind of a focus or an emphasis down the stretch, I'd like us to think about the public health response side, as well as the'",
        "'speaker_2': 'community services side. And the department is doing some really good work with some targeted, qualified disaster relief for low income individuals. It's basically the strategy the department has developed to address some of this disproportionality, recognizing that there's folks who are on who are essential public workers or people who work in the service industry and don't have the'",
        "'speaker_2': 'option to work from home. There's some evidence that suggests those kinds of economic situations can exacerbate the spread in a community because of the challenge of being able to isolate when you're exposed to because you need to continue to work.'",
        "'speaker_2': 'And so I had some initial conversations with the public health department as to whether or not that existing program could benefit from some additional dollars to target, wouldn't be specifically targeted geographically, but would be targeted generally at folks who are low income and where we're seeing the greatest spikes.'",
        "'speaker_2': 'So it would be a general suggestion that we we. We continue to look at the public health side as well as the community service side, and look forward to hopefully bringing some ideas and options forward.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Corals Council. Councilmember Caldwell's Thank you, Mr. Chair. I'm not sure. Councilmember DEMBOSKY when he was speaking what that we can certainly look at making reimbursements to already. Chance. Do I? If you want to comment on that. I did mention that.'",
        "'speaker_2': 'Yeah. So it's easy to amend existing contracts to increase amounts and it's particularly easy if it's for reimbursements of expenses that have already been incurred. So where we have contracts where I'll make up a number, I'd organization got $25,000, send us their receipts, we paid those $25,000 out if we know they have another 10,000, they didn't send'",
        "'speaker_2': 'us, but they've already spent. Amending the contract is very easy and then providing that additional $10,000 is pretty easy. So those are things that even on, you know, we're going to be looking at six weeks notice or pretty doable.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Cast member Belushi.'",
        "'speaker_1': 'Thank you. They're going to echo a little bit what has already been said, but I thank you. I really appreciate the reminder of the framework that we adopted for how to put out CARES Act funding, because I think it still really holds up that our first our first priority is to fully fund our COVID response efforts.'",
        "'speaker_1': 'And that is very much at risk right now without additional funding from the federal government. But assuming that we get to that part, we do have a letter which I think I think everyone will have received. It comes from the YMCA and they're talking about and this is a nonprofit childcare provider, one of our larger ones.'",
        "'speaker_1': 'And they ask into us for over $2 million to support their their provision of service and keep them afloat. Really. And I, I don't I don't raise that because I think it's something we ought to try to earmark in our budget, but because I think it is possibly indicative of real catastrophic red ink throughout the child care'",
        "'speaker_1': 'provider sector. And I want to also pick up on something that Councilmember Coble said, which is if there's a way to push, if there are resources and a way to push more resources into that sector, I do believe that it's just kind of a foundational thing.'",
        "'speaker_1': 'If we don't have child care resources and we're coming out of COVID, it is going to be a devastating impact on employment for parents and especially for women, because we know that women have a lot of child care responsibilities, and we know that this COVID induced recession has had a much harsher economic impact on women than men'",
        "'speaker_1': '. And so just as it sort of fits all our equity principles and the things we ought to be doing is to make sure that parents are able to have a place to go with their children so that we can, you know, maintain our workforce.'",
        "'speaker_1': 'So I really hope we can find a way to do something affordably in this probably in this last 2020 COVID budget. Also, it would help us make sure we've expended all the money that we have so that we don't end up with extra.'",
        "'speaker_1': 'I know, I understand the femur Nash approach and that makes good sense, but if not in this budget, then certainly next year, if we have more resources, that can mean we need to really get back to taking a hard look at this issue.'",
        "'speaker_1': 'There are so many ways, I mean, hearing the stories from the restaurants and that was something that was done in one of our letter budgets. And, you know, there's many, many ways that people need help. But I just really hope that we can continue to focus some of our resources on supporting childcare.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'I would I want to affirm all the comments my colleagues have made already and also add to that and to the conversation, the supportive housing work that some of our nonprofit partners are doing in the community. And I believe they reached out to more than just me.'",
        "'speaker_0': 'Some of the housing providers who support people in supportive housing with the goal of moving them into permanent housing have been stalled because of the pandemic and finding work and helping people find employment and move at the same pace out of what might be a temporary housing situation into a more long term housing situation.'",
        "'speaker_0': 'And therefore the nonprofit partners find themselves strapped and that might be a worthwhile place to make an investment as well. Particularly since some of those from those friends have been extended. You. I believe it is a reimbursement and contract amendment situation.'",
        "'speaker_2': 'Okay. Mr. Chair, I've taken copious notes.'",
        "'speaker_0': 'Very good. Not seen anyone else. I'd entertain a motion council member to Baffsky.'",
        "'speaker_2': 'Okay. Thank you, Mr. Chair. And I had said without recommendation, under the kind of assumption that we would be amending this. But is that your preference or how would you like it to proceed?'",
        "'speaker_0': 'I. I would think without recommendation, since we know a significant striker or formative striker would be coming.'",
        "'speaker_2': 'Okay. Thank you, Mr. Chair. Then I'm pleased to move adoption of proposed ordinance 2020 DASH 0383 of what we are calling the fifth COVID 19 omnibus and would be expedited for action on Tuesday's council meeting with the striking amendment expected.'",
        "'speaker_0': 'Thank you. We have ordinance 20, 23, 83 before us. Is there further discussion? Seeing none. I'd ask the clerk to please call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Bell Duchin, I. Councilmember Dombrowski.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Gunn.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Coleman. I. And remember Councilmember after girl I. Councilmember Brown, my father. I council members online.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is 880 noes council member Lambert. Excused.'",
        "'speaker_0': 'Thank you. By your vote we have advanced ordinance 2020 383 to full council on the consent agenda for next week. All right, your mikes are off. But you all knew it wasn't really unconcerned that there would be a full council next week.'",
        "'speaker_0': 'Thank you, Councilmember Dombrowski. Thank you, Mr. Kim, for leading us in that discussion. That takes us to item ten on today's agenda. That is a briefing from Jack Nicholson, the council's director of government relations on the council's state legislative agenda.'"
    ]
}