{
    "WaterWorks Grant Program Allocation Approval.": [
        "'speaker_0': 'I'm going to wait for one more member to approve those minutes. Well, turn to item eight. Is that our best action item? Okay. We'll go to item eight. Item eight is an ordinance which will improve the grant funding allocations for our Water Works program.'",
        "'speaker_0': 'This is round three of this very popular and successful program. These are sewer rate funded projects to address water quality improvements. The rate includes. What is it like about $3.6 million per biennium as at 1.8 per.'",
        "'speaker_3': 'It's about two 2 million for this portion of the program. Now that there is a council portion of the program in the separately executive portion. So this is the executive portion.'",
        "'speaker_0': 'Right. So in this this this half of it goes through the recommendation committee.'",
        "'speaker_3': 'The grants rank and committee.'",
        "'speaker_0': 'That's correct. And those are the recommendations that are before us.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_0': 'All right. And we're going to be joined by a representative to present the recommendations.'",
        "'speaker_2': 'Right.'",
        "'speaker_3': 'You've largely captured what I was going to present. So I think I'm I'm sorry.'",
        "'speaker_0': 'Working out of my class there.'",
        "'speaker_3': 'I think I'll just just introduce Elizabeth Louden, who's the Water Works program manager for the water program. She will give you a briefing, as you indicated here, this is based on water, on water and wastewater treatment division funding.'",
        "'speaker_3': 'And from there, I turn to Elizabeth.'",
        "'speaker_0': 'All right. Thank you, Mike. Thanks for your work. Welcome, Elizabeth.'",
        "'speaker_1': 'Good morning. Good morning. And thank you for inviting me. I'll be just offering a some brief comments on the water grant program and the current round before you. The overall goal of water works is to fund projects that improve water quality in the Wastewater Treatment Division's service area.'",
        "'speaker_1': 'The program also has additional benefits, including community involvement, building stewardship and leveraging funding. To date, 82 projects have been funded totaling $5.8 million, and that's for both the competitive and the council allocated projects. Project types include green stormwater infrastructure.'",
        "'speaker_1': 'Rain gardens and cisterns. Education and community engagement. Research and monitoring. And stream and riverbank restoration. Most projects include more than one type of activity, and as mentioned, there are two different tracks for funding. The competitive and council allocated.'",
        "'speaker_0': 'Are very competitive to.'",
        "'speaker_1': 'Ensure they are for the competitive track. The Grant Ranking Committee reviews applications and makes recommendations. And this year for the competitive track, we have a biennial cycle which will award all the funding for 2017 and 2018. And also this year, we had a two step process.'",
        "'speaker_1': 'Letter of intent, short pre application and then a full application. We started with 80 proposals and then the 23 before you were considered by the committee to be the the best ones.'",
        "'speaker_0': 'And are these before us as the committee recommended, or were there any changes between committee recommendation and submission to the council?'",
        "'speaker_1': 'There were a couple of changes. There was one project that was proposed initially proposed by a wastewater treatment division that the committee recommended, and then subsequently the management decided that their preference was to have the funding go to outside entities.'",
        "'speaker_1': 'So the committee reconvened for another session to decide what to do with that $113,000 and decided to awarded to two other projects which are on the list. The last two projects on the list. Yeah, great. So that was the one change that was made.'",
        "'speaker_1': 'So the round three recommended projects list starts on page 50 of your packet, and there are 23 projects totaling $1.86 million. There's a wide variety in project types, in size of projects that also location and I, things that are different this round.'",
        "'speaker_1': 'The recommended projects include 11 organizations that have not been previously funded by Water Works and two led by Native American organizations. So overall, this $1.86 million in water works funding is leveraging another $6.8 million in match, both cash and volunteer time.'",
        "'speaker_1': 'So this represents a significant community investment in water quality improvements.'",
        "'speaker_0': 'Excellent. Do members have questions or comments on this item? Councilmember Building.'",
        "'speaker_1': 'I'm still kind of going through the analysis here, but there's a series of grant programs that we do repeatedly where I'm very concerned. Turn that my district gets very shortchanged. And this is one of them. And I'm just going through the math here, and I haven't been able to work all the way through because there's not a'",
        "'speaker_1': 'summary by district. There's kind of a general. And and I just want to point that out. It's it's concerning to me because the first year when I had this comment, our chairman pointed out, and I thought quite correctly and wisely, that these things come and go in cycles, and some years you're going to get less, some years'",
        "'speaker_1': 'you're going to get more. But I'm on year three now and I'm just not seeing that there's a fair distribution to my district, so I'm concerned about that.'",
        "'speaker_3': 'I might briefly note, Mr. Chair, that that on page one, page 71 of your packet, there is a listing of projects, and you will see on that fourth column from the left that there that it's defined by district.'",
        "'speaker_1': 'Yeah, I'm busy sorting through that right now and trying to do it because it's not totaled up my district. And so I'm doing math and spreadsheets over here, which is probably not a good activity on my part, but it just I'd like to know what what's being done to make sure that there's a fair distribution of this'",
        "'speaker_1': 'money. So I can respond that that the committee does look at the geography of where the projects are. And so what we do is we look at the we ask the applicants what districts their project takes, takes, takes place.'",
        "'speaker_1': 'And that's where we have this information from the table here. And many of the projects take place in more than one district. So we do put we put together a map, kind of a preliminary map showing where the different projects were.'",
        "'speaker_1': 'We are also limited by where the applicants are coming from. So. But I did look at all of them because I know that there was a question about this earlier. I did look at all of the projects in the final list, the final 23, and just to see how many were only in Seattle versus outside of Seattle'",
        "'speaker_1': '. And the numbers on that were 21% of the projects recommended for funding were in Seattle. And then.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Almost have about 45 were in multiple districts. And then another chunk, 30 something percent, were entirely outside of Seattle. So. That's helpful. But is there outreach to make sure people are applying? Is there is there a way of making sure, maybe by mapping out where these are, that things are being spread fairly?'",
        "'speaker_1': 'Do we look back over five or ten years and see where there are gaps and try to fill those gaps? I mean, I'm asking more of a process question. Sure. Yeah. Yeah. And we're I'm happy to do outreach.'",
        "'speaker_1': 'We have workshops that we've done in different locations around the county, and I'm happy to do presentations if people have suggestions on where I might present on what works opportunities.'",
        "'speaker_3': 'So Mr. Chair, if I might suggest I'd be happy to work with the agency if it's possible to take a look over the last several years and do a basically a spreadsheet analysis of where money has gone in terms of districts and how it has been balanced over over time as a resource for your information.'",
        "'speaker_1': 'I think that would be really helpful. And then maybe we can think about doing it because before you. So I appreciate offers, but before I personally or asked my colleagues to ask for specific work, it would be nice to do a little bit of an analysis to see if my perception is correct, first of all.'",
        "'speaker_1': 'Second of all, if so, why? And then what is what would be the best way to address whatever the issue is? Okay. So I wouldn't ask you to run right out and do that right away. And I do appreciate the offer.'",
        "'speaker_1': 'But let's see if we can do a little analysis about what's really going on and why. Thank you, Mike. I appreciate that. Okay.'",
        "'speaker_0': 'Thank you. Councilmember LDC and Councilmember Coleman Wells might remember better than than me as former chair of the Regional Water Quality Committee, but I had some similar concerns the first time this came out, and we prepared some legislation to kind of help shape the technical or the recommendations committee.'",
        "'speaker_0': 'Right. In terms of having council members suggest representatives. Yeah. And do either of you recall if you type of how we structured that and whether each district get a representative and how are we doing on filling those? I think I know I've got my person.'",
        "'speaker_3': 'Yes. So very briefly, there is a grand ranking committee, as you're referring to, that Grant's ranking committee does. I believe there are nominations from each of your offices to the council district offices, which go to the executives executive appoints them to the to that committee.'",
        "'speaker_3': 'And I am not in fact, I was going to ask what the what. She's got.'",
        "'speaker_0': 'The list.'",
        "'speaker_1': 'I've got the list. Yes.'",
        "'speaker_0': 'So why don't we before we let's not call out any vacancies in case there there. But if there are council members who have not got their representative to you, why don't you let those officers know offline?'",
        "'speaker_1': 'Do you have to do that? Yeah.'",
        "'speaker_0': 'That was one solution because, well, gee, I'm not sure it's the most effective. You know, it's just one way to have a voice at the table, which is part of the process. Obviously, I think it would be interesting to see on the denominator, if you will, where all the applications came from in terms of determining that that'",
        "'speaker_0': 'equity. And I think that could be rather readily transmitted. And the other piece of this was to ensure that equity we got these funds in half. So there is the council side. What is the will of the body on this today?'",
        "'speaker_0': 'Are folks ready to move forward either with or without recommendation? Is there any timing issues? I mean, I know what, by not approving it, we're holding up the funds.'",
        "'speaker_1': 'Oh, ahead. So for timing issues, let's see. So the initial letters of intent were submitted in June of last year and then went through the review process. So we did tell people, I think people are hoping to be able to get started this summer and some of the projects to have a seasonal aspect to them this year'",
        "'speaker_0': '. Window.'",
        "'speaker_1': 'Yeah. Yeah.'",
        "'speaker_0': 'Mm hmm. What do you think, customer value. Will you be able to get the information you want between now and two weeks? Or would you like this to remain here?'",
        "'speaker_1': 'I, I don't know. Let me look to Missouri. Do you think we can do some work on this between now and two weeks from now?'",
        "'speaker_3': 'I would certainly start today to work with the agency, and I'll look to see whether whether you can produce information that would be needed for that sort of an array over the next, let's say, week. Yes, sure. We can do that.'",
        "'speaker_0': 'Okay. All right. Customer McDermott, it's your legislation.'",
        "'speaker_3': 'Thank you, Mr. Chair. I would move that we give you a do pass recommendations and a full council, he said, looking at the ordinance number ordinance 2018, 149.'",
        "'speaker_0': 'All right, that's before us. Further questions or comments this customer about.'",
        "'speaker_1': 'To say, I'm going to vote no on do pass, but I might get there by final count. Thank you.'",
        "'speaker_0': 'Okay, very good. The clerical cultural on.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Baldi Chino, Councilmember Dunn, Councilmember Garzon, Councilmember Colwell, Councilmember Lambert, I Councilmember McDermott.'",
        "'speaker_3': 'High.'",
        "'speaker_1': 'Council Member of the Grove. Councilmember Wainwright Bauer. Mr. Chair. Mr. Chair. The vote is for eyes. One No. Four. Excused.'",
        "'speaker_0': 'All right. We've given a preliminary do pass recommendation to this legislation. It'll go in the ordinary course, which will allow a couple of weeks, and even if necessary, a courtesy delay for a third week. It sounds like that's reasonable information that could be gotten quite probably, and I'd appreciate a copy of it to our office as well'",
        "'speaker_0': '. Maybe all offices, I'm hearing, to take a look and appreciate Councilmember Bowdich duties, diligence in making sure there's a balance in these grants. Thank you for your work and for being here.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay. We are going to turn now to item nine, which is. Oh, the minutes. We like to put those before us. All right, Councilmember Cole. Wells.'",
        "'speaker_1': 'Thank you, Mr. Chair. I'm approval of the minutes of the May 2nd 2008 committee of the whole meeting.'"
    ],
    "Gender Identity and Sexual Orientation Inclusion Task Force.": [
        "'speaker_0': 'All in favor. Say, I hope any oppose minutes are approved. All right. Now we will turn to item nine, which is a motion which would declare the necessity of an administrative planning and coordination to address gender identity and sexual orientation, inclusion in King County administrative processes, and would establish a gender identity and sexual orientation inclusion task force'",
        "'speaker_0': 'to develop a recommended King County Administrative Gender Identity and Sexual Orientation Inclusion Strategy. This legislation is written in my office and co-sponsored by Councilmember Cole Wells and Councilmember Up the Grove and is really had a good partnership in its development over many months with community partners, which we appreciate.'",
        "'speaker_0': 'We're joined by Sam Porter, who will give us an overview from the central staff's perspective. And Mathias is here I see from our Office of Equity and Social Justice. You're welcome to come forward to if you want to do this.'",
        "'speaker_0': 'Thank you, Sam.'",
        "'speaker_1': 'Thank you, Mr. Chair. Sam Porter, Council Central Staff. The documents for this item begin on page 75 of your packet. Proposed Motion 2018 0165 would require the executive to establish a gender identity and sexual orientation inclusion task force that would review and make recommendations to revise administrative processes with regard to gender identity and sexual orientation.'",
        "'speaker_1': 'Administrative processes would include but not be limited to forms, questionnaires and interviews conducted by person county personnel. The analysis and recommendations of the task force would be done not only on the contents of the forms, for example, when a form requires the individual to indicate their gender, but also on the experience of gender nonconforming gay, lesbian and'",
        "'speaker_1': 'bisexual individuals when accessing county services. When such questions are being asked in January 2018, the Washington State Department of Health adopted a rule change that amended the Washington Administrative Code pertaining to birth certificates to include a gender option of X to provide individuals with an additional gender option if they do not identify with being either male or'",
        "'speaker_1': 'female. According to the Oxford English Dictionary, gender identity is defined as a person's perception of having a particular gender, which may or may not correspond with their assigned sex at birth. A list of possible organizations to request representation from is described on page 82 of your packet and includes the King County Council Executive's office and the Human'",
        "'speaker_1': 'Resources Division, as well as business representatives and organizations that serve gender non-conforming and sexual minority communities and communities of color. The proposed motion outlines the following six task force objectives, which are seen on page 76 of your packet.'",
        "'speaker_1': 'One To review the Washington State Department of Health ruling and determine its implications for King County. To consult with county departments and community groups. To assess existing King County administrative processes regarding gender identity and sexual orientation. Three Identify processes suitable for modification and consider potential implications if a process gathers information used by other government agencies.'",
        "'speaker_1': 'Four Develop a recommended statement of intent to address gender identity and sexual orientation inclusion in identified King County administrative processes. Five Assess the experience of individuals accessing county services and providing requested gender identity and sexual orientation information and identify strengths and weaknesses in the current state of King County Customer Service.'",
        "'speaker_1': 'And six Make training recommendations for county employees to achieve excellent customer service and address the concerns of task force members. The proposed motion would require Task Force members to transmit an initial framework for completing their work, including an estimated budget to council within three months of their first meeting.'",
        "'speaker_1': 'The executive's final report would be due to council one year after the approval of the initial framework. And while the motion does not prescribe specific dates upon which the deliverables must be transmitted, it does state that the task force excuse me, shall expire 60 days after all reporting provisions have been completed.'",
        "'speaker_1': 'And that concludes my remarks.'",
        "'speaker_0': 'Thank you very much. Sam, do members have questions or comments for Sam before we hear from the Executive Branch Council member Gossett? Good morning.'",
        "'speaker_4': 'Good morning, Mr. Chair. Sam, I I've in recent months, maybe the last year, seeing a lot of Latino people used. Latin X. An overwhelming majority of them do see themselves as either male or female. So how do you distinct distinguish that from just put an x, which means you don't identify with any gender.'",
        "'speaker_1': 'That is a very good question. I am not prepared to answer that at this point.'",
        "'speaker_4': 'What about what about this guy?'",
        "'speaker_3': 'I can say some things about that. I mean, the actually, it's often what it would look Latino with Latino or Latina. The the actually Spanish is a very male focused language in the sense that when you talk about a mixed group of genders, the default is kind of the OS, which is the male.'",
        "'speaker_3': 'So I think generally the ax has been done as a way to be inclusive of male female, you know, would include transsexual gender, not non-binary, too. I mean, I think it's an all inclusive term beyond the male female binary.'",
        "'speaker_4': 'So how do we do that in relationship to what we're trying to do and create more clarity? And more responsiveness to how people perceive themselves.'",
        "'speaker_1': 'COUNCILMEMBER The task force would would address that concern and bring that up within within the context of what their the intention is.'",
        "'speaker_4': 'Okay. Thank you. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Gossett. And I think you've highlighted just one of the kinds of issues that we're hoping to gain more knowledge and expertize and recommendations on from the task force about how King County can respond and be more reflective of our community in our systems and processes.'",
        "'speaker_0': 'Councilmember Lambert.'",
        "'speaker_1': 'Thank you and good morning. Good morning. Thank you. This is my third meeting into North Bennett back already. So I want to first respond to Councilmember Gossett. What the gentleman said a minute ago is actually accurate, that the Latin Spanish language is very much prides themselves in in having everything, including inanimate objects like pencils, have a gender'",
        "'speaker_1': 'determination. And it's part of their culture. And I really don't think it's really our place to be telling another culture how they speak and what their words are. So I think that we're stepping into things that really aren't the role of government to be doing right now.'",
        "'speaker_1': 'So I don't understand on page 75 where we're talking about the Board of Health ruling on birth certificates, how we got from that to having a task force. And it seems to me and looking at the things that the task force will do, that there's a huge overlap between our sj r h r r we have lots'",
        "'speaker_1': 'and lots and lots of committees. They seem to be doing government by committee, so I'm not sure what is. Where do the overlap is? Where what's missing that we need this. What is the reason for this? And what do you think the costs will eventually be?'",
        "'speaker_1': 'I realize that we don't know exactly yet, but in order to do this, we must have some ballpark figure of what we think this Casperson will cost. So I'd like to have those questions answered.'",
        "'speaker_0': 'All right, Sam, take your best shot there.'",
        "'speaker_1': 'I would defer to you, Mr. Chair.'",
        "'speaker_0': 'Oh, that means I had to listen. I was listening, Councilmember Lambert. Here's my view on the task force. This is an area that. Well, let me start up start back with some general principles. King County, one of the things we're talking about now in our messaging is making sure that we are a welcoming place and this government'",
        "'speaker_0': 'is a welcoming place for everybody. All 2.2 million people in our county and I think we are getting a little more aware and a little more knowledgeable and a little more sophisticated about understanding the depth of diversity in our community and that there are in historic systems barriers that have been built into those systems that really can'",
        "'speaker_0': 'turn people away, can turn people away from participating in important government functions and can inhibit our ability to provide services as a government. 2.2. 2 million people and I mean all of them. What this task force asks us to do is bring some expertize to the table in the area of gender identity and sexual orientation issues that'",
        "'speaker_0': 'I don't have and that I don't think a lot of us have here in the government. And I think it's an appropriate use for a task force to bring expertize into a decision making process, to look at the issues from a community perspective, from and with experts in the community, to give us some recommendations and advice about'",
        "'speaker_0': 'how we can be a welcoming government, an inclusive government, a responsive government that respects and reflects the individuality and diversity of all members of our community. So whether it be in our delivery of health care, whether it be in our civil rights functions, are voting functions, our transit system, our justice system go down the list of functions'",
        "'speaker_0': 'that King County provides. We think that there are areas that we could be better at and be more inclusive of that in terms of how we deliver those services. So that is the motivation, if you will, behind this legislation.'",
        "'speaker_0': 'And with respect to the process, the suggestion to have a task force is really to have its expertize. With respect to cost, there is some probably additional cost. I don't think that's been as fleshed out, if you will.'",
        "'speaker_0': 'But my sense is my understanding is that the executive, while stretched, is supportive of the legislation. But these will be. Able to carry out this work.'",
        "'speaker_1': 'Councilmember Caldwell's Thank you, Mr. Chair. I don't know what else I can really add to your, I think, eloquent statement here, but I would like to comment on my colleague's remarks. Councilmember Lambert. I think she is correct in saying we as a government should not be dictating to any cultural group there anything about their language or their'",
        "'speaker_1': 'customs, their terminology and so forth. But I don't see that reflected in this legislation. In fact, what the intent of the legislation, or at least one of the intent is to be able to become more informed by a process of inclusion, of having individuals and organizations who represent various cultural groups, gender identity and so forth, to provide'",
        "'speaker_1': 'the input to the county so that we are able to make informed decisions and in doing so become more inclusive and making sure that we're doing everything we can, as Councilmember DEMBOSKY stated, to be a fully welcoming county for all of our citizens.'",
        "'speaker_1': 'And not only am I in support of this legislation, I did sign on as the sponsor to thank you, Mr. Chair.'",
        "'speaker_0': 'And Councilmember Caldwell's Councilmember Duchin.'",
        "'speaker_1': 'Yeah, I am. I actually appreciate this effort quite a bit. So when you think about all the different things that the county does internally, externally, how we provide services, it's hard to even imagine the ways in which our work can impact people, how we could do a better job of serving people, how we can do a better'",
        "'speaker_1': 'job of interfacing with people. If we are more thoughtful and respectful about where everyone is coming from and who they are. My own personal experience is you all are probably tired of hearing at the jail. This was a really difficult issue for us with treating people with respect.'",
        "'speaker_1': 'Keeping them safe, you know, and basically acknowledging their rights as human beings. And we grappled with it. And sometimes it was really challenging to do the right thing. And our knowledge has changed so much over time that our practices really I don't I can't imagine that all our practices have kept up.'",
        "'speaker_1': 'So the idea of having a really close look at how we're doing, how we're treating people, we're a service organization. We serve the people of this county. And I think that we're going to serve them much, much better if we are thoughtful and listening and respectful of who are or customers essentially are.'",
        "'speaker_1': 'So I really appreciate this effort. I'm also a little like I get a little bit hesitant with the bureaucracy sometimes, you know, like another task force. But we need to bring it's just a way of saying we need to bring people together from different points of view with different knowledge to the table to help us understand what'",
        "'speaker_1': 'we don't know already and how we can do more and do better. So I think this is I think this is a worthy effort. And I'm I'm glad it came forward. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I also agree that it's a worthy effort. I'm just concerned that we have worthy efforts on this topic and others repeatedly and that we're getting a repetition of it, the repetition of the repetition. So I need to see what we aren't already do.'",
        "'speaker_1': 'We get the regular charts that show how we're doing in all these categories and and every place in the county by their classifications, the working level, the upper management, the elected, we get these charts on a regular basis.'",
        "'speaker_1': 'So I think with all the committees we already have, I don't know what this will provide that we aren't already doing in multiple places. So if you could get me a chart on that, that would be really helpful.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Mathias. We invited you here to share a few words in the executive's office and didn't get a chance.'",
        "'speaker_3': 'Sure. And happy to say a few things. Good morning, Mr. Chair, and council members. I think from the executive side, I think we are strongly in support of the intent of this proposed legislation. I think as already has been mentioned, it's very much in line in terms of our intent to be a welcoming county for everybody.'",
        "'speaker_3': 'And also not only that, also, as we know from an equity and social justice perspective. The more we are able to disaggregate that, I know exactly who we're serving, who's in our community. We're actually better able to serve those individuals and those communities.'",
        "'speaker_3': 'So it's not just a I think, a feel good thing. It's actually about how we can better serve our residents. So I. We support it. And those grounds, if we don't have that, that we don't know what we need to actually do.'",
        "'speaker_3': 'So that's very important. I do have some some of my concerns, but I'm confident we'll be able to work through some of these things is around the resourcing and prioritization and how do we actually do this jointly with council to be able to stop it sufficiently?'",
        "'speaker_3': 'We have full work plans already running at full force, so trying to figure out how we actually resource that, staff it, whether we use some of the models we've used for some other taskforces, including bringing in consultants willing to, I think, explore some of those options.'",
        "'speaker_3': 'And I think the maybe the final thing too is just potentially a concern in terms of trying to think about this piecemeal first. First, I'll also say just in terms of generally, we've already been doing some of this work.'",
        "'speaker_3': 'I know I worked with one council member, Belden. She was also with the tension and the jail. Why work with your health to include sexual orientation and the and the history forms, for example, medical history, which is extremely important.'",
        "'speaker_3': 'Already in the employee survey, we included transgender and non-binary as categories. So I think we've already been, as a county, been making some good work and been looking at some of those kind of best practices. The concern I would have, too, is that maybe we are potentially looking at this also piecemeal in the sense that we're looking'",
        "'speaker_3': 'at sexual orientation and gender identity, but also we kind of sometimes run into similar challenges around other demographic categories. So, for example, race and ethnicity and we do a lot of employee we do employee survey, we do customer surveys, you know, we we track information from clients, etc..'",
        "'speaker_3': 'And I think there's a lot of inconsistency in terms of how we do that. So I think that's one of the things is just thinking about how we can actually use this an opportunity to be better in our demographic and tracking, trying to make sure that we're following our best practices.'",
        "'speaker_3': 'Sometimes that's a complicated issue because sometimes there are some federal requirements in which we have to track information in a particular way that isn't necessarily the kind of the best practices or where we where we should be going in the future.'",
        "'speaker_3': 'So brings in a lot of different considerations to think about, but just trying to think about how we actually not just set up a task force this time and then, you know, next year are going to be having to set up another task.'",
        "'speaker_3': 'So like a race, ethnicity, for example. So that's some of my thoughts. Thank you.'",
        "'speaker_0': 'Very good. Thank you. Councilmember Sure.'",
        "'speaker_3': 'Thanks, Mr. Chair, and I appreciate it. Came a little bit late, so I didn't get all your staff report. So let me just I just try to read that entire audience real quickly. So we're putting together a task force.'",
        "'speaker_3': 'That task force is going to report back to a variety of people, including the council, within three months. Is that right?'",
        "'speaker_1': 'The first report would be due back within three months upon the first meeting of the task force. Though once the task force is identified and they have their first meeting, they would have three months to transmit a report, including a budget to council.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'And then one year upon the transmittal of that report, the final report of the task force would be transmitted. Wait a.'",
        "'speaker_3': 'Minute. So one year within one year from that point, the final report would be transmitted?'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'So I guess what maybe the chair would permit a question. What is the timeline for us directly from creating a task force to look at these issues that make sense? It's the recommendations themselves that I think that largely won't be controversial.'",
        "'speaker_3': 'There might be a couple in there that are controversial.'",
        "'speaker_0': 'We're going to put a couple in for you just to be controversial.'",
        "'speaker_3': 'Okay. Perfect. I got make you want my job to be interested. What? What? So what? What what is your vision in terms of this coming back before the council for us to take action to ratify it?'",
        "'speaker_0': 'Thank you, Mr. Chair. I think we'll look to work with the executive branch and the task force with respect to how we would receive and then respond to and implement. If that was the decision, any of the number of recommendations that might come back, it could be on a rolling basis, you know, or it could be.'",
        "'speaker_0': 'Here's a final report on the general steps we think the county should take to be, you know, a better provider. You'll come up with your implementation plan and funding to do it. I don't have a set vision for that, and I would defer too to the group that will do the.'",
        "'speaker_3': 'Work very well. The only thing that struck me, Mr. Chair, is that three months seemed like a quick turnaround. It sounds like you're building in additional time.'",
        "'speaker_0': 'That's kind of an initial. Okay, great.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Dunn.'",
        "'speaker_1': 'If it's all right, I would also like to add that on page 84 of the packet online 131, the task force may also provide interim updates and recommendations as the task force deems necessary or as requested by the Council or executive.'",
        "'speaker_1': 'Or by the council on me.'",
        "'speaker_0': 'Thank you, Sam. Council Member McDermott, thank you for joining as a co-sponsor. Would you want to put this before us for action?'",
        "'speaker_3': 'I'm of the Give it to Pass recommendation to Ordinance Motion 2018 165.'",
        "'speaker_0': 'All right. That's before us. Thank you very much. Any further comments or questions, Mr. Chair? Yes, Councilmember McDermott, thank you.'",
        "'speaker_3': 'You know, we've had a discussion about other task forces and other work, but I think the testimony we heard today speaks to the amount of information, research and knowledge we have about transgender issues and issues around sexual orientation.'",
        "'speaker_3': 'The executive director of the Internal Gender Center showed us the statewide report for the city of Washington on trans issues. It was three pages. There's a dearth of information in this area, unlike some of the others that we tracked more carefully and were behind.'",
        "'speaker_3': 'I think this is an opportunity to catch up. For a community that's far too often at risk.'",
        "'speaker_0': 'Thank you. Councilmember McDermott, Councilmember Gossett.'",
        "'speaker_4': 'Thank you, Mr. Chair.'",
        "'speaker_0': 'Hey, I. I'll answer anything. I do identify as male Councilmember Garcia, and.'",
        "'speaker_4': 'I'm going to identify your thoughts. All right. You tell me differently.'",
        "'speaker_0': 'I appreciate the way you respect me like that.'",
        "'speaker_4': 'And that is the last thing I wanted to say. I think this is a significant sound step forward because in terms of our commitment to equality and social justice, because it allows people who are seen as I perceive themselves in a very, very small minority to be respected and to be able to articulate to us what their'",
        "'speaker_4': 'perceived gender is. And we have not had that in the past, and that is clearly a form of discrimination. So that's why I'm happy and planned to support this ordinance. It's a step in the right direction. Thank you, Mr. Chair.'",
        "'speaker_4': 'And again, I apologize for my mistake.'",
        "'speaker_0': 'That's okay. Thank you, Mr. Gosset. All right. A clerical collar on this motion 2018 0165, which is before. So that do pass recommendations.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Bell, DG Hi. Councilmember Dunn.'",
        "'speaker_3': 'II.'",
        "'speaker_1': 'Councilmember Gossett, I. Councilmember Kowalski. Councilmember Lambert. Councilmember McDermott.'",
        "'speaker_3': 'All.'",
        "'speaker_1': 'Councilmember of the Grove. Councilmember Bond. Right. Member. Mr. Chair. Mr. Chair. The vote is six ies. One No. Two excuse.'",
        "'speaker_0': 'Okay. We have given a do pass recommendation on this motion. It'll be on the ordinary calendar, in the ordinary course. Thank you, everyone, for their work on it today and your participation. Look forward to continuing with that work.'",
        "'speaker_0': 'And I want to thank, if I can, my chief of staff, Christina Logsdon, who for close to a year, I think has been working with folks on the legislation. So thank you, Christina. Very, very nicely done. Okay. Let's turn now to item ten, which is a briefing, I'm sorry, to the fleet of lawyers who is here.'"
    ]
}