{
    "Appointment of Gregory Beams to the King County Cultural Development Authority.": [
        "'speaker_0': 'Okay. Well, sorry. We're going to move to item number six, confirming the appointment of Gregory Beans to the King County for Culture Cultural Development Authority. Please come on up and set the table. The light in front of you is the white button and that'll turn on your microphone.'",
        "'speaker_0': 'But first I'll call on Leah crackles OPR Council staff to give a report.'",
        "'speaker_3': 'Good afternoon council members and is critical Darby Council Staff. The materials for this item begin on page 15 of your packet and this is a motion that would confirm Gregory Beames to the For Culture Board for a three year term expiring December 31st, 2019.'",
        "'speaker_3': 'I'm going to provide some brief background on the for culture board and the appointment process, and then I'll provide an introduction for Mr. Beames and the King County Council created for Culture King County's Cultural or Cultural Public Development Authority in 2002 in order to support, advocate for and preserve the cultural resources of the region in a manner'",
        "'speaker_3': 'that fosters excellence, vitality and diversity for culture is funded through a portion of the lodging tax revenues collected in King County. In addition for culture administers King County's public arts program, the 1%.'",
        "'speaker_0': 'For Art Program.'",
        "'speaker_3': 'And manages the King County Public Art.'",
        "'speaker_0': 'Collection.'",
        "'speaker_3': 'For culture is governed governed by a 15 member board of directors who are nominated by the King County Executive and confirmed by the King County Council. The composition of the For Culture Board is established by the For Culture Charter.'",
        "'speaker_3': 'The Charter requires that the Board of directors have a demonstrated commitment to and knowledge of cultural resources and be active and experienced in community and civic issues and concerns and have the available ability to evaluate the needs of cultural constituencies in the region as a whole, represent a range of talent, experiences, backgrounds and viewpoints, and be sought'",
        "'speaker_3': 'from a range of cultural, civic and business professions. Are residents of King County and reflect the geographic and cultural diversity of the county and have no more than six directors from any one municipal municipality. In addition, the board must include one of each of the following a director with expertize in the arts, a director with expertize in'",
        "'speaker_3': 'public art, a director with expertize in heritage, a director with expertize in his historic preservation, and a director from the business community. A board member served for terms of three years and may serve up to two consecutive full terms.'",
        "'speaker_3': 'In addition to the 15 board members, four culture has five ex-officio board members, which include one member of the executive staff and three county council members and four culture executive director. The Culture Board has a governance nominating committee that includes the ex-officio board members designated by the county executive and the County Council.'",
        "'speaker_3': 'And that committee is responsible for nominating candidates for appointment to the Board of directors after seeking community recommendations, the for culture board votes on the nominations made by the committee, and then those nominations are forwarded to the county executive who is responsible for appointing four culture board members.'",
        "'speaker_3': 'And then the County Council is responsible for confirming that board member members may serve, may begin serving upon confirmation by the Council or 30 days after their appointment, subject to subsequent council confirmation or rejection. And unless there are questions about the for culture board or appointment process, I'll next introduce Mr. Bean.'",
        "'speaker_4': 'Councilmember Gossett Thank you, Madam Chair. A few days ago we had a I think it was a law and justice committee meeting in. Sponsored quite a few members to the board for culture. And then one of the members of the Common Council said I'd are three or four or five members, all from your district and on board'",
        "'speaker_4': ', all from District two. And I didn't really know the answer. So we had a little discussion about distribution of board members. And we also had challenges to that concept that it needs to be removed from every district. So it's hard and it's probably coincidental that two, three, four people from the same district are on the board.'",
        "'speaker_3': 'There can be up to six from one municipality, but it doesn't specify within which council districts. And so you couldn't have more than six from the city of Seattle, which your council district has and there aren't. But you could have a number from that council district of the nominating committee.'",
        "'speaker_3': 'And the executive and the council find that there are qualified members to serve.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'And it was my understanding, Councilmember, is that the way as as Leah said, that the way the charter sets this up is that there was a desire that the board have diversity, not all from the city of Seattle.'",
        "'speaker_0': 'And so the definition is no more than six from any one city, and that we have six from the city of Seattle on the board now. And the other nine or however many, I don't know how many vacancies there are today are from other places.'",
        "'speaker_0': 'So but it's a good question and worth addressing. Councilmember Lambert. Thank you. Since I'm one of the two districts that has nobody on this committee, that is very disconcerting to me. And I agree. We talked yesterday about the idea that isn't district wide, but it seems to me that there's 15 people that every district should have at'",
        "'speaker_0': 'least one person. So so the part here on page 15 is there no more than six directors, meaning one municipality that is in King County code or is that in the charter?'",
        "'speaker_3': 'That is in the four culture charter, which was initially adopted by the King County Council and could be amended, but it.'",
        "'speaker_0': 'Can't be amended. Yes. So I would like us to talk about taking that number from six down to four so we can talk about that. Who's on the governing nominating committee?'",
        "'speaker_3': 'Some of your colleagues sitting next to you.'",
        "'speaker_0': 'On the.'",
        "'speaker_3': 'OC are fired by the charter. Could be on the nominating committee.'",
        "'speaker_4': 'No, but you're done. What could be? It's like you're saying are.'",
        "'speaker_0': 'On it.'",
        "'speaker_3': 'According to the charter. That's what it should be. And he says You are.'",
        "'speaker_4': 'I'm on the nominating committee.'",
        "'speaker_1': 'By virtue of being. This is you only have 1/2.'",
        "'speaker_0': 'Okay. Trying to maintain control of the meeting here for a second. Mr. Kelly, why don't you come up, turn on the microphone, introduce yourself for the record, and then you can please proceed to address the councilmembers question. Thank you.'",
        "'speaker_5': 'Good afternoon. Members of the Council. I'm Jim Kelly, executive director for Culture. The fourth culture charter requires the three members of the King County Council serve as ex-officio members of the Four Culture Board. Currently, that is council members Baldacci, Gossett and Cole Wells.'",
        "'speaker_5': 'By virtue of your being ex-officio members of our board, you are on the board nominating committee. The board nominating committee includes all three ex-officio members from the council, the ex-officio member of the appointed by the executive, which is Jennifer Meissner and four members of the For Culture Board.'",
        "'speaker_5': 'And the charter also calls that the nominating committee be chaired by the four culture vice president. So vice president, three other board members, county council members, executive and myself serve as the nominating committee.'",
        "'speaker_4': 'Does it say in there that you're on the nominating.'",
        "'speaker_5': 'Committee because I'm an ex-officio member of the board? Yes.'",
        "'speaker_4': 'The executive director is a ex-officio member of the board. Okay. When when are these meetings going to.'",
        "'speaker_5': 'We've had we've already had one. We've had our first meeting already. You have been invited to that meeting and you will be invited to others if you can't attend. That doesn't mean you can't send a nomination over to us.'",
        "'speaker_4': 'Oh, but is this process going on now?'",
        "'speaker_5': 'Yes, because we have two openings that will occur on the board at the end of 2017. We have one board member who's completing two terms at the end of 2017, and we have a second board member who is moving in her fifth year of board service out of Kane County.'",
        "'speaker_5': 'So those two positions are open.'",
        "'speaker_4': 'Well, I would definitely like to know when the next meeting is. I didn't know that the charter calls for us to automatically be on a nominating committee, and I want to be a little more responsive to that request in the future.'",
        "'speaker_4': 'All right.'",
        "'speaker_0': 'Thank you, Mr. Bassett. Councilmember Caldwell's. Okay, Madam Chair, I'm not wanting to be circumspect or the opposite of that, but I. I also had not known that I was a member by accepting the exhibition status of the nominating committee.'",
        "'speaker_0': 'But I did receive an email three weeks ago or so alerting me to the meeting and that if I could not attend, that I could submit recommendations for or nomination. So I did do that. I submitted one person's name and so I would think the others got that to me.'",
        "'speaker_0': 'But we get so much email and we get so.'",
        "'speaker_5': 'We tend to seek your staff because it.'",
        "'speaker_0': 'Makes.'",
        "'speaker_5': 'You believe that you have time to open all our emails between you and you.'",
        "'speaker_0': 'But I do it faithfully here. You do their councilmember member. So I have in the past when I was an expedition member, put in names and so I'm very concerned just one district, we are the two that have nobody.'",
        "'speaker_0': 'And I just don't think that. That's right.'",
        "'speaker_5': 'Well, I totally agree. I have not a problem with that. One of our board members was actually appointed to the board as a resident of District one, and then she and her husband moved to District four. I'm sorry we couldn't control that.'",
        "'speaker_0': 'So I would hope that that and I will do something on my part to send out an email asking for people in my district this expertize. But if you could look for people in my district also that you have regular contact with, that would be wonderful because I really do believe that we have discussions around here about'",
        "'speaker_0': 'things like is a barn art or is it not? And, you know, it's very important, as you know, and people love it. So we need to have somebody at the table that has that part of the county in mind.'",
        "'speaker_0': 'Right. Okay.'",
        "'speaker_3': 'Councilmember, I'd also add that I recently saw their For Culture newsletter, their e-newsletter that goes out and the call for board members did specifically say they were looking for people from districts one and three.'",
        "'speaker_0': 'Excellent.'",
        "'speaker_5': 'I forgot to mention that.'",
        "'speaker_0': 'They say that you. I'm so glad. Well, thank you. Very good. Thanks, Councilmember. Go. Wells Madam Chair. Tim So what she just said about having had been a member from District one, but she and her husband moved to District Court, otherwise I would have not had any.'",
        "'speaker_5': 'That's here. You've got Kirsten.'",
        "'speaker_0': 'Powers. I just have one. And that apparently was she was appointed to justice.'",
        "'speaker_5': 'Right. So it was accurate when we reported that we have a restriction that no more than six board members can come from any one city. And it so happens the two board members who were leaving are not Seattleites.'",
        "'speaker_5': 'So those open up to positions. If the council wants to consider reducing that number to four, that's entirely up to you. That is a charter revision that you would have to do by motion or ordinance.'",
        "'speaker_0': 'Okay. Like so, we have had a robust discussion about the structure of the board. We are here to appoint Mr. Beames. So welcome, Mr. Muzaffar. Thank you for being with us. Now you can sort of see the sausage being made here and how we how we engage with these issues.'",
        "'speaker_0': 'Can you just tell us a little bit about yourself and why you're interested.'",
        "'speaker_3': 'In you want me to go first introduction.'",
        "'speaker_0': 'What are you going to share? Okay, my notes here say ask him to introduce himself.'",
        "'speaker_3': 'So I'm just going to give his bio and then.'",
        "'speaker_0': 'Very good.'",
        "'speaker_3': 'Okay. So Mr. Bean lives in Kirkland in District six. He's a coordinating partner at Ernst and Young and has 25 years experience providing audit services to public and private companies in a variety of technology and media fields. He's also a member of Ernst and Young Global Coordinating Partner Network and oversees Ernst and Young's Pacific Northwest Entrepreneur of'",
        "'speaker_3': 'the Year awards program. Additionally, he's a board member for the Washington Technology Industry Association, where he serves as the finance chair and he has bachelor's degrees in finance and accounting from Central Washington University and is currently pursuing his master in fine arts degree.'",
        "'speaker_3': 'From the Academy of Art University in San Francisco.'",
        "'speaker_0': 'Okay. Thank you. Now, if there's anything else you would like to tell us about yourself and and about your interest in serving on the Fort Culture Board, please welcome.'",
        "'speaker_5': 'And thank you. I appreciate that. Yeah, I would say I actually completed my master's degree here this past December, and so I was fortunate enough to now have that in the bank and can spend time with my family again.'",
        "'speaker_0': 'Congratulations.'",
        "'speaker_5': 'Thank you. The other thing I would tell the committee is I serve on various other nonprofit organization boards here in the community. I've joined the photographic center, Northwest Board. I'm actually the board chair for this year. It's an arts education organization located on Capitol Hill that provides classes as well as certification in photography.'",
        "'speaker_5': 'And then I also am a board member and the Treasurer for an organization called Apprenticeship. It's developing an apprenticeship program that's taking people that are non software engineers and moving them into software engineer field. It's a one year apprenticeship program.'",
        "'speaker_5': 'It's focused primarily on minorities, women and veterans. And so over 50% of the participants have to be in that pool. We're actually at 80% at this point. It's a Washington based program, but it's also going to be rolled out nationally, and we're in the process of doing that as well.'",
        "'speaker_0': 'All right. Good. So my understanding is that you have been serving on the Fort Culture Board already for a period of time. So can you tell us a little bit about your experience, what you've learned, and maybe what some of your interests are going forward?'",
        "'speaker_5': 'Yeah, so I have been fortunate to serve on the Finance Committee for a little over a year now, and you're not required to be a board member in order to serve on the Finance Committee. And then beginning this year, I began attending the board meetings as well.'",
        "'speaker_5': 'And so I've really enjoyed my experience thus far with for culture. It's a very rigorous process was one of the things that impacted me initially in terms of the applicants for grants, both at the arts level, the individual artist as well as the organizational level.'",
        "'speaker_5': 'And I've been impressed both with the committees that go through that initial process, the other board members that then review, ask questions and approve that, as well as the staff people and their involvement just in making sure to do diligence around that and their involvement in the arts community.'",
        "'speaker_5': 'So it's an organization that I've been extremely impressed with and it's one that I'm excited to be able to participate in.'",
        "'speaker_0': 'Thank you. CASTMembers. Any other questions for Mr. James? Customer Gossett.'",
        "'speaker_4': 'Thank you, Madam Chair. One of the things I hear a lot from people in the community about for a culture or entity, that this was a expand culture around our county is that they don't pay enough attention to cultural relevancy.'",
        "'speaker_4': 'What does that mean to you?'",
        "'speaker_5': 'In in terms of the different art for different cultures, or how do you mean that?'",
        "'speaker_4': 'And what I was asking you, what do you think it means? Cultural relevancy.'",
        "'speaker_5': 'So I would take that to mean that is the in the culture within which somebody sees themselves and is the artwork relevant to that particular culture as opposed to a general culture or somebody else's cultural background?'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'All right. At this time, yes. I called Councilmember Lambert to move this action item. Put it before us. Thank you. I'd like to propose motion 2017 0046 with a do pass recommendation. Okay. It's moved and is before us.'",
        "'speaker_0': 'Any other comments on this action? Or if not, I will. This is a roll call vote. Well, please call the roll. Thank you, Madam Chair. Councilmember DEMBOSKY. Hi. Councilmember Dunn. Hi. Councilmember Garcia. Hi. Councilmember Colwell. Hi. Councilmember Lambert.'",
        "'speaker_0': 'Hi. Councilmember McDermott. All right. Councilmember off the ground. Councilmember one right there. Madam Chair, I. Madam Chair, in the bonus, eight eyes, no no's and councilmember phone right there. Excuse. All right, with that, we have a do pass recommendation to the full council.'",
        "'speaker_0': 'And I haven't I don't think we've done a lot of these out of this committee. Does that typically go on a consent agenda? Yes. All right. We might as well expedite it because he's been serving for a while already.'",
        "'speaker_0': 'So no need for you to come to the full council meeting. It'll be a perfunctory consent agenda item, and we look forward to formally appointing you to the board and your continued active participation. Thank you so much for serving here.'",
        "'speaker_0': 'All right. And that will move us on to briefing item number seven, which is on the future of the regional solid waste system. It sounds almost philosophical. What is the future of the regional solid waste system? So we know there's a lot of study and planning that's been going on for a while, and I look forward to'"
    ],
    "Factoria Recycling and Transfer Station Workforce Diversity Report.": [
        "'speaker_0': 'Very good. Look forward to it. All right. That brings us to agenda item number eight, which is another solid waste item. When the county opted to build the new station in Victoria, in Bellevue, it's another Bellevue, solid waste issue.'",
        "'speaker_0': 'In fact, council will recall that specific goals were set for hiring minorities and women. Use of women and minority apprentices and use of minority and women owned businesses. Now that the project is either complete or very, very, very near to completion, we have before us the final report on how that went, which will inform the committee, how'",
        "'speaker_0': 'well we did meeting the targets that are set. So remaining here to brief us again this terre Rose, please take it away again.'",
        "'speaker_3': 'For the record, Terre Rose Council staff as the chair described proposed motion 2017 0288 would acknowledge the receipt of the final Victoria Recycling and Transfer Station Workforce Diversity Report. The materials for this item begin on page 33 of your packet.'",
        "'speaker_3': 'In 2014, the Council approved ordinance 17830, which authorized the executive to execute a contract to replace the 1960s era Victoria transfer station with one that was larger and more modern. This ordinance also required, as the Chair noted, some reporting on data related to minority and women participation in the construction project.'",
        "'speaker_3': 'The first area relates to minority owned and women owned businesses participating as subcontractors. The second area concerns minority and women in the project workforce, and then the third related to hours worked by many minority and women apprentices. Additionally, these reports were to include a narrative description of efforts to meet the goals established by the ordinance.'",
        "'speaker_3': 'Reason for any shortfalls as well as recommendations for minority and women participation in future transfer station replacement projects. In order for the Solid Waste Division to meet the June 30th deadline required by the ordinance, the report uses data through March 31st of this year, and that's when the station was 90% complete.'",
        "'speaker_3': 'Overall, the final report demonstrates progress in most categories relative to the interim report that was transmitted two years ago. The project exceeded the goal established by ordinance for minority of. Just hours. Ours and the project also met or exceeded the self established goals for women and minorities in the project workforce.'",
        "'speaker_3': 'However, the project fell short of the goals for minority owned and women owned businesses participating as subcontractors, as well as the goal for women apprentices. The report notes that the project performed better than the national average for women apprentices and identified two challenges related to meeting the goal.'",
        "'speaker_3': 'The first being just the high level of construction in the region seeking to use apprenticeship labor and then the second that women represent only 6% of the local construction workforce. Before I move on to the recommendations, would it be helpful to go into more detail about each of these goals and the project's performance?'",
        "'speaker_0': 'We have the report before us and I think people can read it unless there's a desire to have you read the details to us. Why don't you move on to the next segment?'",
        "'speaker_3': 'I will continue with the recommendations in the report. So this final report does provide a series of recommendations on how to promote participation of women and minorities in future transportation projects for minority and women owned businesses. The recommendations mainly relate to effective outreach strategies, communication about contracting opportunities, and also structuring, structuring subcontract packages into increments that might'",
        "'speaker_3': 'be favor more favorable to small businesses to promote minority and women in the contractor workforce. The report notes the importance of supporting apprenticeship programs for women and minorities as a way to build up that workforce for the future.'",
        "'speaker_3': 'And the recommendations for women and minority apprentices include but are not limited to making apprenticeship hiring goals a priority on all county capital improvement projects, working with unions to commit specific percentages of construction slots to targeted demographic groups and developing a mentorship program.'",
        "'speaker_3': 'The final report also suggests that King County perform a comprehensive examination of the challenges encountered by women apprentices to help identify barriers and best practices. And as the Chair noted, the Council may wish to consider incorporating participation, goals and relevant recommendations in future transfer transportation replacement projects.'",
        "'speaker_3': 'I will note that there is a technical amendment on page 63 of your packet. Amendment one deletes the transmitted report and inserts an updated report dated August 11th, 2017. The August 11th report corrects an inverted calculation error in table three of the transmitted report and the associated references.'",
        "'speaker_3': 'That concludes my staff report and happy to take any questions.'",
        "'speaker_0': 'Thank you very much for that report. And I'll call on Councilmember Garcia to ask a question.'",
        "'speaker_4': 'Thank you, Madam Chair. And Terry, you mentioned the kind of things that we that the report says we plan to do to help minorities and women, potential contractors or workers, be better prepared or more competitive for securing work with the county.'",
        "'speaker_4': 'But I didn't hear anything about what we're going to do to make contractors and King County government itself better at figuring out ways that we can incentivize or become aware ourselves so that we are more successful at utilizing and involving minority and women.'",
        "'speaker_4': 'Do you care to comment on that?'",
        "'speaker_3': 'I think that's probably an answer that's larger than what's contained in this report. And so I.'",
        "'speaker_0': 'Would suggest.'",
        "'speaker_3': 'That perhaps the business development and contract compliance staff here might be able to answer that if the council member would like to call.'",
        "'speaker_0': 'Customers or somebody here to speak. Correct. Oh, please call me. Welcome. Thank you for sitting through the whole meeting. It's going to pay off now. When we invite you.'",
        "'speaker_4': 'Maybe.'",
        "'speaker_0': 'Welcome. Please introduce yourself for the record. Thank you. I'm standing and working my way.'",
        "'speaker_4': 'Way. You're not.'",
        "'speaker_0': 'Alone. I'm Sandy Hanks. I work in the Department of Executive Services and the Finance and Business Operations Division, and I manage the Business Development and Contract Compliance Section.'",
        "'speaker_4': 'Did you know if you heard my question.'",
        "'speaker_0': 'I Councilmember Garcia, could you repeat the question for me?'",
        "'speaker_4': 'Our staff indicated that we've had some challenges involving minority owned and women owned businesses in our or to the extent that we have established goals to successfully involve them and then lay and then our staff laid out two or three things that women could do to be more competitive and some things that minority prospective contractors could do'",
        "'speaker_4': '. But one of the problems around our larger society is that we never challenge, lay out changes that the employer or the larger contractors are utilizing. These smaller businesses can do to be more receptive and encouraging to minority and women businesses because they still have that same stereotypic, stereotypical view of what women and minorities might be able to'",
        "'speaker_4': 'do if we do give them a chance to work and make that really difficult no matter what minority and women undo in terms of improving themselves. So my question was, do we lay out things that are aimed at challenging the powers that be to change so they're more successful in reaching our affirmative action or inclusion kinds of'",
        "'speaker_4': 'strategies? Okay.'",
        "'speaker_0': 'Thank thank you for that. So there are two different approaches that we're using to meet the goals that were used to meet the goals in this report. One was for the participation of minority owned and women owned businesses as subcontractors and suppliers in the project.'",
        "'speaker_0': 'And as you heard, we had a 10% goal for minority owned businesses and a 6% goal for women owned businesses. And we fell just slightly short of those hiring goals. But what we did as a strategy was to set a requirement for the private contractor to use small businesses.'",
        "'speaker_0': 'We can be very directive in our outreach. And so we have the King County has a local small business program that is race and gender neutral. We set a goal of 25%, which is fairly high for participation rates.'",
        "'speaker_0': 'We believe that we can meet it. We want to set something that's reasonable and achievable, and we assisted the prime contractor in doing that in terms of identifying businesses, prospective businesses for our outreach, looking at the availability of those small businesses in the marketplace based on the scope of work and the trades and crafts involved.'",
        "'speaker_0': 'And I'm pleased to say on this project, the county exceeded that 25% goal for small businesses. We achieved 28. We had hiring goals for minority owned businesses, and we fell about a percent short. We tried to be very broad in our outreach to minority owned businesses, and we have taken extra steps to put potential small contractors who'",
        "'speaker_0': 'are minority owned and women owned in front of all potential prospective bidders for our projects ways in which we do that. We last year, for example, we hosted 45 or participated in, hosted in or participated in more than 45 outreach events that were designed to put prime contractors in direct contact with businesses, small businesses, minority owned businesses'",
        "'speaker_0': 'and women owned businesses indicated that they had an interest in doing business with King County. So we're always trying to forge those partnerships and relationships that provide that access for those firms.'",
        "'speaker_4': 'Okay. Can you show on page 28? I mean, 35, 35. The chart. So we have a 10% minority business. And then what is the percent of dollars paid to firms was 3.2 versus 7.1. Me is related to time frame.'",
        "'speaker_3': 'So the figures because the project was not complete at the time that this report was produced. Two methods of showing participation for minority businesses and women owned businesses was included in both the interim report and the final report, both for which are shown in the table.'",
        "'speaker_3': 'The actual column represents the percentage of dollars paid for the interim report as of 2015 and for the final report as of March 30th. And that's relative to the amount paid to the prime contractor in that same period.'",
        "'speaker_3': 'And then the final column in table one is that is.'",
        "'speaker_0': 'The.'",
        "'speaker_3': 'Awarded subcontracts. So that's what they expect to pay over the whole duration of the project.'",
        "'speaker_4': 'Oh, okay. That prime contractor and the count is back there that it will get up to 8%.'",
        "'speaker_0': 'All right.'",
        "'speaker_4': 'Okay. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Mr. Gosset. Okay. Councilmember Lambert. Thank you. I just like to make a comment that on the conclusions page, on page 62, that you had exceeded three of the goals. So that's pretty exciting. And I'm really glad to see that you've got those specific goals as wonderful.'",
        "'speaker_0': 'You've been to 45 events and that the apprentices goal, you went over by 3.2%, which is great. So I think what I've seen in the last couple of years is greater flexibility and more practicality in how we help the contractors and to meet these goals.'",
        "'speaker_0': 'But there's two things that I think we need to be careful of, and that is, number one, the paperwork. So when you look at this report you're having in here, just keeping all this data. Well, it looks lovely.'",
        "'speaker_0': 'And charts, you know, when you're trying to build a building, you have to keep all this data. It costs time and money and employees. And until I started working on that little project that you and I work on every week.'",
        "'speaker_0': 'I had no idea the voluminous ness of this, and it was huge. But it right up to the word voluminous after seeing what that is. So I think we need to be a little bit careful in how much paperwork is required and how many employees are required to do that, because that takes away from, you know, the'",
        "'speaker_0': 'function of building the building or whatever the task is. The other thing is that I think sometimes we think things will work on paper that don't work in practicality, and we have to be honest about that. And the example I'm thinking of is when you and I both know where we put a 17% goal in contractors that'",
        "'speaker_0': 'I'll do, 21% of them don't make me do those paperwork. We said we're not going to do it. You have to do it our way. And then it went downhill from there. So I think we need to be a little bit more flexible.'",
        "'speaker_0': 'And I know that this is not going to make everybody happy. But the idea that we pick certain areas where we have to get employees and that that's a requirement created a lot of havoc for everybody. And if we had just said that's our preferred area, but everybody inside a much larger area would qualify, I think it'",
        "'speaker_0': 'would have made things a lot simpler. So I'm really going to be looking at lessons that I have learned from being on that committee, that what really works and how can we do it with as least angst, paperwork and confusion as possible?'",
        "'speaker_0': 'So thank you. We certainly put that before you, conservative given other comments you made. And I thought, okay. Please go ahead, Councilman.'",
        "'speaker_4': 'I wanted to respond to what Councilor Lambert said, because I'd like to caution her about saying that we should push for these admirable social justice goals because of the burden of the kind of paperwork required to document that we're actually trying to get better.'",
        "'speaker_4': 'I think that we're better off by not allowing those who have historically been able to just do the work, not document who they're using, but almost always use the same people who are never, ever. Women are people of color and a society that has a long history of structural racism and implicit bias.'",
        "'speaker_4': 'There might be a medium where we cut down on paperwork, but we still got to keep the goal that these kinds of folks man involved and included. Thank you, Senator.'",
        "'speaker_0': 'Thank you. Councilmember Gossett, I believe Councilmember Lambert also has a comment. I know that you've noticed that I'm a woman, so I do care about women being able to get contracts and be able to succeed. Those are what I said at all.'",
        "'speaker_0': 'What I said was, there's paperwork and then there's paperwork. We need to be very careful that we don't require truckloads of paperwork. Paperwork is fine, but if it's really been onerous, we need to be a little bit careful of that.'",
        "'speaker_0': 'Okay. Would you like a motion? I think we're ready to move forward. Yes, please. Okay. I'd like to propose motion 2017 0288 with a do pass recommendation. Okay. The motion is before us, and there is an amendment. Amendment number one.'",
        "'speaker_0': 'Thank you, Madam Chair. I'd like to move amendment number one. This is updating the report, the correct calculation error that was in table three and associated references in the narrative, executive summary and conclusion. Okay. I just want to confirm for the record, before calling for a vote on the amendment, that that correction is something that the executive'",
        "'speaker_0': 'branch agrees is correct. It's not our correction. It's your correction. Okay. Thank you. All right. All those in favor of Amendment One, please signify by saying i, i, i. Any opposed Amendment one carries the motion as amended is now before us.'",
        "'speaker_0': 'Any final comments or questions, councilor, about please go ahead. Councilmember Dombroski.'",
        "'speaker_1': 'Thank you. I've been listening to the discussion and read the report on two things. One, my memory me said to me that I believe this was an amendment that I had offered around the time of the commencement of construction of the factory transfer station.'",
        "'speaker_1': 'And I'm really pleased to see that it accomplished two goals, one, which was to encourage additional outreach and work for small contractors and suppliers and apprentices, including women apprentices on the project. And two, to kind of shine a light on this so we can keep doing better.'",
        "'speaker_1': 'And today's report is really good. And those were stretch goals and most of them were met or exceeded. I want to thank Sandy Eddington, the Executive Branch Homicide Division, for their good work on this.'",
        "'speaker_0': 'And thank you, Councilman Debusk. I was just going to say in my comments that I think there's a tremendous value in this kind of transparency around what we're doing, even though we may fall a little short on some of our targets and be ahead on other targets, it just helps to focus attention and keep us always trying'",
        "'speaker_0': 'to bring more people into this contracting fold. So thank you so much for this work. And I think it's it's very encouraging. All right. With that, I would call for a vote on the motion to recommend approval. And we voted on the amendment, didn't it?'",
        "'speaker_0': 'Yeah. Yes. Sorry, I missed it. Okay. Thank you, Mr. Chairman. Councilmember Dombrowski.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilmember Dunn II.'",
        "'speaker_5': 'Councilmember Gossett, I.'",
        "'speaker_0': 'Council member, Cornwall High Council member. Member. High Council member McDermott. High Council member at the Grove Council member Yvonne right there. Madam Chair, I. Madam Chair, the vote of seven ayes, no nos. Council members of the Gerben von Mike Bauer.'",
        "'speaker_0': 'Excused. All right, by your vote, we have approved the motion as amended for recommendation to the full council. I believe I can also go on consent and we've come to the end of our agenda. But I'd like to circle back and approve the minutes from the beginning.'",
        "'speaker_0': 'So, Councilmember Lambert, would you be willing to put those before you? I'd like to move the minutes of both July 19th and July 26, 2018, 2017. As written, it's been moved to approve the minutes. Any comments or corrections?'"
    ]
}