{
    "Appointment of Alina Santillan to the 4Culture Board.": [
        "'speaker_2': 'And me to do so. Thank you very much for your time. You.'",
        "'speaker_0': 'Okay. Our next agenda item is the appointment of a Lena Santillan to the Fort Culture Board for a three year term representing Council District four. I made the appointment and the staff report begins on page six. We are happy will brief us.'",
        "'speaker_0': 'We do have E Kennedy, the appointee with us and we also have Claire Michel from the fourth culture coming who is support culture, government and Community Relations Manager. So go right ahead, Leah, and you can talk to us outside the fireplace right afterwards.'",
        "'speaker_0': 'Thank you. Thank you. Council members. Good morning. My name is Leah Crackles. I'll be council staff. This item before you, as the chair said, is a motion to confirm the appointment of Elina Sundin to the Fort Culture Board of Directors for a three year term expired, expiring on December 31st, 2024.'",
        "'speaker_0': 'And I'll provide some brief background and introduce Mr. some at the end and then turn it over to the chair for any questions the council members may wish to ask the appointee. And as a reminder for culture, is King County's cultural development authority responsible for administering King County's arts and heritage programs and for culture is governed by'",
        "'speaker_0': 'a 15 member board of directors who are to have a are required to have a demonstrated commitment to and knowledge of cultural resources, the active and experienced in community and civic issues and concerns, and have the ability to evaluate the needs of cultural constituencies in the region.'",
        "'speaker_0': 'Board Position number four, which you are considering today, is to be appointed by the Council member representing Council District four, which of course is Chair Caldwell's. As she said, Mr. Santiago resides in Council District four and his professional experience includes works for Seattle Arts and Culture, for Anti-Racism and for Katie XP.'",
        "'speaker_0': 'And his current community experience includes serving on the city at Seattle Community Police Commission and the King County Equity Cabinet. And the Racism is a Public Health Crisis Committee and the Seattle Works Board. The appointment of Mr. Sunshine to the Board Culture Board appears to be consistent with the policies and process governing for culture appointments.'",
        "'speaker_0': 'And that concludes my staff report. Thank you very much, Leon, and greetings and welcome, Mr. Santillan. And do you prefer being referred to the Senate or as Mr. Santillan? ALEX Fine. Councilmember Thank you. And I've had the opportunity to meet Aruna and commend this nomination.'",
        "'speaker_0': 'Confirmation, rather, appointment confirmation to the committee of the whole. I'm very excited about joining the Fort Culture Board. And I think, Alina, you were at this month's meeting. Is this your first one? Is that correct? Yes, ma'am, that's correct.'",
        "'speaker_0': 'So we welcome you and we'd love to hear from you about your wanting to be appointed. Why are you why you chose to be on the board? Thank you so much for giving me an opportunity to talk with you.'",
        "'speaker_0': 'I hope that my permanent.'",
        "'speaker_2': 'Top dog.'",
        "'speaker_0': 'Will be quiet while I share a little bit about why I've been excited to join the culture board. I've been in the arts and culture nonprofit sector for more than a decade now. And, you know, I'm sure over the past couple of years, we've seen a lot of change and conversation around how we're making all of our'",
        "'speaker_0': 'spaces, government, our built environment, arts and culture, health care. How are you bringing an anti-racism lens to that work?'",
        "'speaker_2': 'How are we talking.'",
        "'speaker_0': 'About equity and intersectional way? That is not just for some people, but is actually for every single person, especially those that have been historically and presently under invited into our spaces. And I think that my kind of passion in wanting to join the.'",
        "'speaker_2': 'Culture.'",
        "'speaker_0': 'Board is, is bringing my perspective, bringing the skills that I've built over time around. How do we make culture change that is lasting? How can we make, you know, when we are giving messages of solidarity with communities that have been harmed, how do we make that solidarity actionable?'",
        "'speaker_0': 'How do we live out our values, especially with the intersection of funding? Right. We've had a lot of conversation well, I've heard a lot of conversation today about the experiences of our community members, Jackson County, whether that is like struggling to pay rent, but then they're struggling to say, hey, I'm doing my best and I found a'",
        "'speaker_0': 'job, but I can't I don't have access to.'",
        "'speaker_2': 'Housing.'",
        "'speaker_0': 'And and where I'm bringing hopefully skillset.'",
        "'speaker_2': 'And passion.'",
        "'speaker_0': 'And perspective is bringing those conversations that we're having today.'",
        "'speaker_2': 'Largely.'",
        "'speaker_0': 'Throughout.'",
        "'speaker_2': 'The culture board.'",
        "'speaker_0': 'Obviously within that.'",
        "'speaker_2': 'Race and culture sector. But really about our work.'",
        "'speaker_0': 'How do we make this work last? So we make sure we are bringing our our.'",
        "'speaker_2': 'Lived perspectives.'",
        "'speaker_0': 'At the table, that those who don't have a seat at the table like these.'",
        "'speaker_2': 'Have a lot of.'",
        "'speaker_0': 'Privilege in being able to be here today. Are we make sure that we're elevating the voices of those that don't. So I'm excited to and honored to be nominated and to to be serving in this role. And I just thank you all for the opportunity.'",
        "'speaker_0': 'I look forward to working with everyone. Thank you, Ilene. A very much and uncertain. My colleagues on the committee can see why I was so enthusiastic about making this appointment. I had three recommendations and I did not hesitate with making the decision to select two coming.'",
        "'speaker_0': 'Are there any questions that. Come to more of a comment than a question. I'm very happy to support this nomination, and I really thank you for your perspective and for listening to us and working that into how you think about our.'",
        "'speaker_0': 'And my comment is, I feel like in the arts and culture and, and heritage space, there is such an opportunity to bridge the historical and present gaps that we see between and among people. That leads to the kind of inequitable outcomes we see.'",
        "'speaker_0': 'And that can seem really intractable in a political space. Like we're not trying to convince people of something. We're trying to share our experiences in a really, really immediate way that gets past the mental processing. And so I just have a lot of hope when I hear people who want to help build our public art space further'",
        "'speaker_0': 'in these ways, because I think that is a huge part of how we move forward from where we are today. My comment my second comment, Madam Chair, is I just want to take this moment to make a bit of a pitch to you, my colleagues.'",
        "'speaker_0': 'We have three ex-officio seats on the floor. Culture Board Council member Coles is in one of them. Council Member Perry will be a new member in another one. We had two members who were on the board last year who will have termed out there are there is a three year term limit, although you can cycle back on'",
        "'speaker_0': 'after a break. And so I just want to make sure that members are aware we do have one seat that we could still fill as an ex-officio member. And if you're interested in it, please do contact me. Thank you.'",
        "'speaker_0': 'I imagine. Thank you. And I appreciate your you're making that effort. Are there any other questions that. We do have with this Claire Michaud from Fort Culture. Claire, do you wish to make any comments? No, I. I think Alina said it all.'",
        "'speaker_0': 'Thank you very much. I think it's very obvious how much Alan is going to be contributing to the Fort Culture Board. Very excited to be working with Galena and of course, the current board. Okay, good, good. I spent hours watching the proposed motion.'",
        "'speaker_0': '2020 1069 travel. I've never done this to a council member than as vice chair.'",
        "'speaker_2': 'Oh, thank you. My vice chair of this fantastic committee this year. It's so good to know. Oh. Oh, good. I'm glad to have some leadership responsibilities. I'd be happy to move the motion out of that sneak bias in the word feature.'",
        "'speaker_0': 'Email Council Member Don.'",
        "'speaker_2': 'Feature.'",
        "'speaker_0': 'Email and the agenda where you're listed at the top tier and I'm here you are.'",
        "'speaker_3': 'You did a really good job though.'",
        "'speaker_2': 'Vice-Chair as well. Thank you. Thank you all.'",
        "'speaker_0': 'And our commission has been made. Any discussion? Okay. Could you please support the bill?'",
        "'speaker_1': 'Thank you, Madam Chair.'",
        "'speaker_0': 'Councilmember Ritchie, I.'",
        "'speaker_1': 'As a member of the.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'Council member done.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'Anthony McDermott.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'I'm in a very I.'",
        "'speaker_1': 'As a member of the group.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'As a member and I by way.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'As a member, sir. Hello.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Madam Chair.'",
        "'speaker_0': 'But is my.'",
        "'speaker_1': 'iPhone also no.'",
        "'speaker_0': 'Excuse? Thank you. With our vote, we have approved the motion 2020 10469 and scheduling of send this motion with the deep recommendation to be placed on the consent calendar at the February 15, 2022 Council meeting. And congratulations to Lina, since we will be taking this up on the consent calendar.'",
        "'speaker_0': 'You do not have to be in attendance. Of course we welcome you to be there, but there won't be any discussion at that time. Thank you for your service. Next, coming up, do you want to say anything? Just gratitude.'"
    ],
    "Equitable Development Initiative and Implementation Plan.": [
        "'speaker_0': 'I'm so excited to work with all of you and excited to get to work. Thank you so much. Okay. And we're I'm very excited to work with you. Okay. With that, we will go on to our last agenda item number seven, which is a proposed motion 2020 10467 requesting the executive to establish an equitable development initiative or'",
        "'speaker_0': 'II and prepare an implementation plan with a priority on unincorporated area communities. Now, we heard a lot about this motion during public comment today, and I did mention that we are going to have a discussion on it, a staff briefing, an opportunity to have a briefing on the amendments that have been submitted by the council members that'",
        "'speaker_0': 'the Grove and Dombroski. We will not take this up for action today. There have been requests to hold that so we can see if there's anything else that we need to do on it before taking action. So it likely will be on the next committee agenda.'",
        "'speaker_0': 'The motion, as I mentioned, does pertain to our having an implementation plan over two phases which we were here about. And equitable development initiatives generally provide investment programs and policies that take into account past policy decisions, as well as historic inequities and current conditions to prove access to opportunities for the most affected communities and to allocate resources'",
        "'speaker_0': 'to communities at risk from displacement. Jenny know from my central staff will provide the briefing on this item as well as the amendments. We also have with us woman, seconded staff, current girl and copywriter. So if you have any questions for them, they will be available with that.'",
        "'speaker_0': 'Jenny Thank you. Chair Goals China Central Staff. The materials for this item begin on page 14 of your packet. Oppose Motion 2020 10467 would request executive to establish a wide a global development initiative, also known as CDI, with a priority on unincorporated area communities.'",
        "'speaker_0': 'The motion also requests that the executive prepare an implementation plan in two phases. This developed in conjunction with the planning workgroup. Equitable development can be defined in a number of ways. The city of Seattle, whose program this motion is modeled after, defines equitable development as public and private investments, programs and policies.'",
        "'speaker_0': 'In neighborhoods to meet the needs of marginalized people. Enter these disparities, taking into account past history and current conditions so that quality of life outcomes, such as access to quality education, living wage, employment on the environment, affordable housing and transportation are equally distributed for people currently living and working here, as well as for many people living in'",
        "'speaker_0': 'the City of Seattle establishes a global development initiative and 2016 Page 15 of your packet includes information on Seattle's CDI program, including background in context of the development of the program. In summary, Seattle's EDI program is primarily primarily known for its fund, which awards money to community organizations, organizations to fund projects, site acquisition and capacity building in'",
        "'speaker_0': 'high displacement risk communities. The FBI distributed $49 million in 2017 in the area also includes equity indicator monitoring, which evaluates displacement risk within the city, as well as incorporating equal development principles into city work and planning. Turning to the proposed motion for a hear, this motion would request the executive to create a King County EBI and to'",
        "'speaker_0': 'prepare an implementation plan in two phases. The motion identifies that the idea should be countywide in scope in prioritizing urban areas or excuse me, urban area communities, particularly historically in marginalized communities. The motion states ideas should be guided by a framework with the following principles one Advancing Economic Mobility and opportunity for residents.'",
        "'speaker_0': 'Preventing Residential, commercial and cultural displacement, building upon and protecting local cultural assets and communities. Supporting organizational capacity building, promoting transportation mobility and connectivity and enabling equitable access for all communities. Further, the motion identifies a set of principles that would guide development of a framework including well, excuse me, the motion identifies that phase one of the implementation plan'",
        "'speaker_0': 'should include a developed idea for more consistent with the principles I just mentioned. Information on how the initiative would guide the best starts capital program. Recommendations for county and community structure, capacity and resources to implement the program in this first phase would be due June 30, 2022.'",
        "'speaker_0': 'Phase two would include objectives and strategies to reduce disparities. Utilize data of displacement, risk and other metrics to determine programs and policies, including metrics for monitoring and evaluating outcomes. Describing partnerships with outside agencies such as community based organizations or regional partners.'",
        "'speaker_0': 'Identify funding sources that could be leveraged. Propose strategies to coordinate across county agencies and programs. Identify community outreach and collaboration. Utilize the community direct action level of engagement. Propose next steps in a timeline and recommendations for a permanent advisory board.'",
        "'speaker_0': 'In the second phase would be dated June 30th, 2023. The motion requests that all work done under these two phases be completed in partnership with the planning workgroup, emphasizing black, indigenous and people of color, leadership and geographic requisite representation that includes unincorporated county.'",
        "'speaker_0': 'There are some amendments to this proposed motion, and Madam Chair, that completes my staff report. But I'm happy to accept the amendments, if you wish. Thank you very much. Good job. Turning a reminder that we do have Kelly Rider and Karen Gill here with us today.'",
        "'speaker_0': 'We have questions for them before Jenny does and two of the amendments. And by the way, you all should have received the packet, I think it was this morning or maybe last yesterday from staff with regard with the amendments in the packet.'",
        "'speaker_0': 'Does anybody have a question at this point for Jenny? Okay. I'm sorry. Just to clarify, this idea of sport is expressly for county wide, but it's got a priority on certain communities. All right. Okay. Any questions? I'm sure.'",
        "'speaker_0': 'Yes. Councilmember Belding, I'm going to have some comments and a number of questions, but I kind of just wanted to wait until after we briefed the whole amendments and everything. If that's all right with you, I can do it.'",
        "'speaker_0': 'When you. When do you think best? No, that's fine. If you have a question of Charlie pertaining to what she went over. No, not this time. Thank you. Councilmember at the end. We cannot hear you.'",
        "'speaker_3': 'Thank you, Madam Chair. I would ask Staff what it means that we're going to prioritize funding in the unincorporated areas. What does it mean to prioritize?'",
        "'speaker_0': 'And you want to check that? Sure. Actually, I would defer to the sponsor to get an answer to what he means by prioritizing this lead sponsor. And this is Councilmember Dombroski was to comment on that.'",
        "'speaker_2': 'Well, thank you. I'm sure. Would you. Can I make a few opening remarks first?'",
        "'speaker_0': 'Whatever you would like, there is a question for.'",
        "'speaker_2': 'I'd like to just set the table a little bit, and I'd be happy to answer that, because that's an issue that we should have a good dialog about. So thank you for hearing this. A motion before us today just by way of background.'",
        "'speaker_2': 'This idea and proposal came from folks who are interested in seeing this kind of work done on a more countywide basis. And they came forward in the context of our best efforts for Kids Capital Grant program, which was added, you'll recall, and I came to the Council and the Regional Policy Committee and as defined in terms of'",
        "'speaker_2': 'its implementation in the plan over there. And they were interested in maybe looking at those dollars to start an equitable development mission at the county. And I, I thought that, frankly, that was too small. We have a a big county, and that's a limited set of funds.'",
        "'speaker_2': 'And the vision there had kind of gotten started on a different path. And so I encouraged folks to take a more holistic approach and develop a standalone initiative that would develop an equitable development initiative countywide and look at sustainable effect, effective and adequate funding for the initiative that wouldn't just be limited to that one bucket.'",
        "'speaker_2': 'So that was kind of the genesis of it. This really has been in terms of its formation, community led. And I, I think it's really important work. I think for years the county, frankly, we've dialed back our economic development work.'",
        "'speaker_2': 'It's been a small function, frankly, squeezed by the general fund. But in more recent years, it's popped up in different spaces, communities of opportunity and some of our other work around the county. This would be, I think, a holistic approach that would recognize the true that the impacts of the tremendous economic growth here in the county that'",
        "'speaker_2': 'has not been equally shared. And in fact it has had some adverse consequences to a lot of our at risk communities in terms of gentrification and loss of historic communities as people have been pushed out by big money.'",
        "'speaker_2': 'To put it in plain English. And the question is, is there a role for King County to come in as a partner, as a partner with communities to ensure that they are not displaced and to run with that, that's a defensive notion.'",
        "'speaker_2': 'But put a ladder down, put many ladders down to help folks climb the ladder of economic opportunity that's here in King County. That may have disadvantages, too, and barriers to those economic opportunities. And you do that with the principles laid out here.'",
        "'speaker_2': 'Now, I said this is community led and it is on this question of prioritizing certain communities. I will tell you, I had hoped and my vision was, well, you do it countywide and maybe we don't have that prioritization.'",
        "'speaker_2': 'But this was a this was a policy compromise. And this was a space where I had to listen to those who had more experience and are more directly affected. And that was a priority for them and for a couple of, I think, of the co-sponsors.'",
        "'speaker_2': 'So I think there's a reasonable debate there. But in this work and this work in particular, the equitable development notion and the centering communities and those most impacted, I deferred because I thought that their voices were more informed, the impacts were more direct.'",
        "'speaker_2': 'And frankly, it spoke to me a little bit when I first came to the county. We had an actual policy and practice with respect to our urban unincorporated areas that were within prior years potential annexation for cities of disinvested.'",
        "'speaker_2': 'So, Councilmember Rizal, I take Skyway, West Hill. You know this. Our policy was don't invest in a community center, don't invest in parks, don't invest in the roads. We wanted to. I'm going to be real blunt here. We but the county policy was essentially just to walk away and encourage by doing so, those communities to annex to'",
        "'speaker_2': 'in that case, the city or revenue. Well, I didn't like that. And we began to turn the tide on that. We put $1,000,000 into the park there and we realized, I think, that that was wrong. But that history shows why an initiative like this is important.'",
        "'speaker_2': 'And you heard in the testimony there has been an underinvestment in our urban unincorporated communities, some of it by actual design. And I think to some degree, we see the error of our ways there in which we should be making those investments in partnership with the community.'",
        "'speaker_2': 'So that's a little background on it. Madam Chair, I think that the county with our. Equitable and just principles that are our philosophy and how we do business as codified in our own code is the right place to do this from a regional perspective.'",
        "'speaker_2': 'There is this notion that, well, some local jurisdictions like the city of Seattle have their own, and so maybe we shouldn't engage in that space. I don't know that we should have bright line rules. Some communities, even though Incorporated, may have more needs.'",
        "'speaker_2': 'I think we are a regional government and we can work in partnership with community in our cities to make these investments when they're most needed. I think that the language with respect to prioritization is flexible enough that would allow the work to go forward and come back with more specificity.'",
        "'speaker_2': 'But that's some background, and I think that this is a tremendous opportunity for the county to engage in a in a serious undertaking, a partnership with Communities and Central, those voices most impacted and partner with them. So looking forward to the dialog and working with colleagues to get this into acceptable form.'",
        "'speaker_2': 'Thanks, Madam Chair.'",
        "'speaker_0': 'Thank you. I appreciate your comments. We've obviously dealt with issues relating to what does prioritization mean. I remember that in our cultural access legislation discussion and there have been many others relating to coded budgets. Our concern about the.'",
        "'speaker_0': 'Was your question answered?'",
        "'speaker_3': 'So I have comments on the topic, but I don't know if you want them now or with. I don't know how you want to structure things.'",
        "'speaker_0': 'I think it might be helpful for Ken to brief us on the amendments. Councilmember DEMBOSKY also has an amendment. Councilmember Sarai has a question based on what his own work was presented by staff.'",
        "'speaker_2': 'Thank you, Madam Chair. I just wanted to add one more point to Councilmember up the Grove's question. I think Councilmember Taberski touched on everything that I would touch on, especially with respect to motive. I've spoken to many times at this Council about the historical disinvestment in Skyway, and there are special obligations unincorporated King County as its as'",
        "'speaker_2': 'their only local government. So I'll spare you all the spiel there. But in terms of not just motivation, but mechanics, how do you what does priority mean? I think a lot of that would be figuring out at the executive branch.'",
        "'speaker_2': 'You know, we get a high level directive and then the executive branch kind of puts the rubber to the road and figures out how we do prioritization. But it could look like a system of giving more points to urban, unincorporated or unincorporated high displacement areas that present a project.'",
        "'speaker_2': 'It could look like more intentional outreach in those neighborhoods to make sure that they apply for these kinds of funds. But more than happy to listen to the thoughts and concerns. Because I completely hear Councilmember up the group's concern around making sure that.'",
        "'speaker_2': 'There are cities and neighborhoods that are unincorporated areas that also have very high needs and have high displacement risks. And this motion should not exclude them, should not, you know, should not make it harder for them to apply or make it less likely that they'll qualify.'",
        "'speaker_2': 'So if my intention is that we put intentional emphasis and priority in the neighborhoods where both there's a high displacement risk and King County is the local government because of our special obligation to those areas. But it is not to exclude those neighborhoods that are in incorporated cities that are high displacement risk.'",
        "'speaker_0': 'Going.'",
        "'speaker_2': 'To.'",
        "'speaker_0': 'Councilmember McDaniel, did you hear something? Go and see them meeting. So I'm wondering. Okay. Is there any other question of general or the sponsor? And by the way, as was mentioned, councilmembers online and some sponsors and sponsors, I believe in this legislation.'",
        "'speaker_0': 'Okay. At this point, Jenny, I'd like you to give us all of the amendments. And again, you can look at what was sent out to us with the actual chart and the amendments and the amendments themselves. Or look at the staff notes on page starting 17.'",
        "'speaker_0': 'And I don't think not all the amendments were done at that time going here. Ten So we as chair goals measure the amendments are in the additional packet that was sent to you yesterday around 430. There is one SCHRAGER and five amendments that I will go through.'",
        "'speaker_0': 'Striker S-1, beginning on page two of the additional packet, would revise the two phase implementation plan to a single seat feasibility analysis with additional work from an advisory committee. Page two No, excuse me. Page eight of your supplemental packet shows the comparison table.'",
        "'speaker_0': 'The well lays out the similarities and differences between the motion and the striker and will quickly walk you through that to orient you to the differences between the two. In summary, S-1 changes the scope of the Equitable Development Initiative that will be changed to reduce disparities and achieve equal outcomes for more marginalized populations.'",
        "'speaker_0': 'The initiative would be county wide in scope and designed to reduce disparities in communities that are at highest risk of displacement based on race indicators in in areas where there aren't other ideas in place, as one would require the development of a feasibility analysis similar to the concept of phase one in the motion that would be developed'",
        "'speaker_0': 'by the executive, but without expanding worker when compared to the underlying motion, the striker would not require a developed framework. It would rely on what's on in the motion. Information on basic capital grants and nor would it require recommendations of next steps for County H community structure customer resource needs.'",
        "'speaker_0': 'The striker would ask the committee to make recommendations on potential policy and programmatic changes to reduce displacement and to create and preserve community stability, as well as make recommendations on a capital grant program through the incorporation of displacement, risk data and metrics to determine project eligibility.'",
        "'speaker_0': 'MRA. The striker would also require an analysis during the feasibility report stage that looks at current county efforts to prevent displacement. In an analysis of risk indicators, the striker would remove a requirement regarding describing potential partnerships as well as coordination across county agencies.'",
        "'speaker_0': 'It would maintain a report requirement to identify funding sources and identify a community outreach process, including outreach to potential applicants. The striker removes requirement about using the community direct action level of engagement that's currently in the underlying motion.'",
        "'speaker_0': 'The striker modifies the advisory group. The underlying motion discusses composition, emphasizing Bipoc leadership and geographic representation. The striker leaves the makeup to the executive and to each councilmember, where the executive chooses three representatives in the council member offices choose one each.'",
        "'speaker_0': 'And lastly, the striker would change the report requirement to December 31st, 2022, with no requirement for a second phase. Thank you, Kenny. Are there any questions? And I'm not sure. Councilmember The Grove, this is your strike S-1 amendment.'",
        "'speaker_0': 'Would you rather that we go through all the amendments first and then speak to them? Because I know there's some duplicity with your individual line amendments and the strip.'",
        "'speaker_3': 'I would love the opportunity to speak to it. It lays the foundation. Also, since we're getting tight on time for all of them, I think.'",
        "'speaker_2': 'That.'",
        "'speaker_0': 'I'm.'",
        "'speaker_3': 'You know, growing up here in South King County, I really watched my community grow and change a great deal. And you walk down the streets in any of the cities in South King County and look around. You see people of different ages, different races from different ethnicities and income levels, and that diversity is our strength.'",
        "'speaker_3': 'And one of the cool parts about being an elected official, the part I love the most is the ability to immerse ourselves in the community and build those authentic relationships and communities of color and immigrant and refugee communities.'",
        "'speaker_3': 'And I'm.'",
        "'speaker_2': 'Very, very proud.'",
        "'speaker_3': 'Of Concerned and Boesky for bringing this forward. You know, as you know, this is an issue that's been near and dear to my heart. You know, we've been working together as a council on you know, we saw some high profile commercial displacement in 2019 about Tugwell and SeaTac that garnered a lot of attention.'",
        "'speaker_3': 'We see this wave of gentrification coming out of Seattle into South King County and now beyond, and it's devastating to a community to see the loss of community, character and cohesion. And, you know, and these are tough issues to tackle.'",
        "'speaker_3': 'We know some of it is due to blatant racist policies we have in the past, whether it's redlining or access to capital being denied to black and brown communities. We also see it just in the systemic racism around how decisions are made.'",
        "'speaker_3': 'And it's heartbreaking when you see not just economic displacement, what that means culturally for different communities. And so I want us to make increased investments in community based and community led strategies aimed at reducing residential and commercial displacement.'",
        "'speaker_3': 'I want us to make sure that we're reviewing, with support of the community, all of our policies to find those solutions where we need to change our land use laws. And so I sat down to read the legislation.'",
        "'speaker_3': 'I'll be candid. I did struggle to understand, having read it multiple times, exactly what each of the steps mean. I think the language used, I think the the definitions I think there's a lot of information that's vague. I'm interested in us making sure we understand in concrete terms specifically what is it we are looking for in here'",
        "'speaker_3': 'and trying to spell it out? So I took a stab in a striker based on the multiple meetings I've had with the there's a coalition working on this and based on a lot of conversations I've had in the community, the folks in the coalition who drafted this obviously hate it.'",
        "'speaker_3': 'I'm not wedded to it or the language, but I wanted to. Try to bring what I saw as language that cut to the chase. And specifically, I figured, you know, it's not my job to try to. Clean up per se, or try to add those definitions.'",
        "'speaker_3': 'But there are three concerns and they're flagged in the amendments and to save. Speaking on each of the amendments, I'll just speak to a now, the number one concern for me is this. This doesn't this motion doesn't generate any money.'",
        "'speaker_3': 'So we're setting up an expectation we're going to fund and it's likely going to come from existing sources because we don't have the ability to raise taxes without going to the public. And there are some obvious areas it specifically references the best starts for kids capital funds right now.'",
        "'speaker_3': 'Well, it may 5 million this year, $8 million a year going forward. Those are pretty much the only capital funds we have for non housing. So if we want to build community centers, we want to do create mental health facilities for kids.'",
        "'speaker_3': 'This is our shot we've got is $8 million a year in capital funds right now. Without this, it's targeted at Bipoc communities. It's targeted where the need is. All of these good metrics, adding a new layer on top of it, saying it will now be prioritized in unincorporated areas, I think is a step back for South King'",
        "'speaker_3': 'County and step back for an area where I think we're seeing the greatest displacement, a community where we have the largest black population, we have the largest levels of diversity, the largest levels of poverty is now being deprioritized and putting if we put those best starts through kids capital dollars, through that displacement lens is defined here.'",
        "'speaker_3': 'Another potential source of funding for it would be the housing development funds, obviously. And we have, you know, a lot of good work that's being done now. I'm not sure how it's going to be integrated, but we know we based on community input, we now have a program funded through housing, the equitable, community driven, affordable housing development'",
        "'speaker_3': 'that is funds affordable housing development to mitigate displacement measures, ensure marginalized communities have access. It supports the creation of affordable housing developed by and in collaboration with communities facing displacement. Communities historically experience policies that limit opportunities for people of color, projects led by impacted communities conceived and created through an inclusive community engagement process driven by a place'",
        "'speaker_3': 'based, community based organization. You know, we put 5 million specifically into Skyway last year to support equitable, community driven development aimed at preventing displacement right now, with the exception of the dollars we've targeted into the unincorporated areas specifically.'",
        "'speaker_3': 'The whole county has equal ability to compete for those dollars. And I really appreciate it. Councilmember Xilai's comments about not wanting to make it projects in other impacted areas less competitive. But I'm not sure how you can say we prioritize one community.'",
        "'speaker_3': 'But we don't want that to mean it's harder for the other communities to do that. You prioritize what it means. The others are deprioritized on lower priority, and I just don't think that makes sense to do to the most some of the most impacted communities.'",
        "'speaker_3': 'And so that's my concern. The other two things I flagging the amendments. One, there's some language that's very vague and confusing to me and says this committee will have the authority to establish policy and budgets. I don't I know they can't create ordinances.'",
        "'speaker_3': 'This be the first time all of our other boards bring us recommendations or else it's an RFP panel where we've set the policy. So if we're going to give a board the ability to establish policies and budgets. They were charter doesn't allow them to amend the RC ws.'",
        "'speaker_3': 'I mean, these are county ordinances. Most of the policies, not all our land use related state law really dictates the growth management land use policy update process. So I don't think a group of executive appointees, I don't think we can delegate land use policy making to them legally under the Growth Management Act.'",
        "'speaker_3': 'Besides whether or not it's a good idea. And with budgets, I'm not sure what the scope is. It says they will have the authority to establish policy on equitable development. I don't know what the range. What does that mean?'",
        "'speaker_3': 'What policies have we delegated? There. There's just some real. Strange language there, and we're really good about listening to our boards and commissions. When the Conservation Futures Fund's brings us their funding recommendations, we rarely touch that. So I think we have language in there that's a problem.'",
        "'speaker_3': 'It's well-intentioned. We can tell people, Yeah, you get to establish this, but legally I just don't know how we do that. So we give executive appointees the authority to change our growth management laws or to change county ordinances, which is how we establish policy.'",
        "'speaker_3': 'So I think that needs some clarity. I would suggest my amendment would say have them recommend or we define the scope of their policies around the grant program. Are we going to let them set the criteria and that kind of thing?'",
        "'speaker_3': 'And then the other is the composition. We fought for months and this council with best starts for kids and BSA tussle over making sure we had an equal voice in appointing those who are making the funding recommendations. And here we just delegated all the executive.'",
        "'speaker_3': 'We replace our decision making authority and we delegate that to the executive to appoint a group of people to do that. And I think it makes sense if we want to ensure that the ideological diversity and the true geographic diversity is reflected.'",
        "'speaker_3': 'I think having council members nominate folks from our district, along with the county executive, ensures that more democratic process where everyone's values and everyone's community is represented. And so those were my amendments and suggestions and concerns. I appreciate you.'",
        "'speaker_3': 'Let me share. I look forward to work with everyone and open to all kinds of ideas.'",
        "'speaker_0': 'Thank you very much. Councilmember at the Grove. We are running short on time. I think we can go a little bit more. However, we haven't been briefed on all of the amendments. Maybe that can come next time around.'",
        "'speaker_0': 'I know that Councilmember Bell, did she want to speak? Is this a good time for you? Yeah, I'd love to. Thank you, Madam Chair. So. I'm glad we're having this public airing of this proposal because it's been it's been around for a little while.'",
        "'speaker_0': 'And I want to thank the community members who came to meet with me. I came to meet with me virtually and and have offered to to to talk at any opportunity. I mean, they've been very active, very diligent and very available.'",
        "'speaker_0': 'So that that's been helpful as we review this. I think I want to start with principles and the principle here that for a lot of reasons, good reasons and bad reasons. Aspects of unincorporated King County have been underinvested in.'",
        "'speaker_0': 'I mean, I think we can start with that premise. The good reason, by the way, is it's not a good reason, but not our not our decision reason is we don't have the same taxing authorities as a city does.'",
        "'speaker_0': 'We don't have the same ability to raise funds in all the ways that cities can. And so we have more limited sources of funding for this local government purpose. I think we should also start with first principles that we it is undeniable that the outcomes in our unincorporated areas where we have underinvested are inequitable, that we see'",
        "'speaker_0': 'and we see all the all the challenges of underinvestment. And like Councilmember Ismail, I am not going to try to list them all today. I've been pleased to watch this county in the time I've been with the county really evolve in how we work with our communities, especially our underserved communities.'",
        "'speaker_0': 'We've come up with new ways to really bring community voices, voices of black, indigenous and people of color to the table, voices of all kinds of underserved folks in that areas, and then really taken that partnership and made it into policy.'",
        "'speaker_0': 'Some good examples recently are the update to our mobility and transit plans really have centered equity in a way that we really didn't explicitly do before. And there are others. Community of opportunities and Best Start for Kids is an example of this evolution.'",
        "'speaker_0': 'And this kind of a proposal would be a further step in that evolution. And for that reason I find the idea extraordinarily promising and attractive, and I'm very supportive of walking down the road like this. This action that we're asked to support sets up a process to send a plan that we then will adopt at some point'",
        "'speaker_0': '. So, you know, that speaks to me. I love the plan. The plan, and I'm not even joking about that. I think that when you're doing something totally brand new, it behooves us to be very cautious and thoughtful and make sure we're thinking about all the things that we're doing, the consequences, the unintended consequences, make sure it's a'",
        "'speaker_0': 'success. So I think that this in many ways comes as a a welcome proposal, in a thoughtful proposal. The questions. Oh, and I also want to say my first personal involvement with the Seattle idea was when their director at the time and she may well still be there.'",
        "'speaker_0': 'Director Obama I'm going to mispronounce name Marjorie. I believe Canary came and spoke to our affordable housing task force where several of us served on and spoke about their anti displacement efforts. And I was very impressed by some of the good work they had done and some of the proposals that they were building at the time.'",
        "'speaker_0': 'This was a few years ago. So I know that we can we can merge this kind of a community partnership, effort and investment with our highest priority, things that we want to see done as a policymaking body. And we can make progress before we get to the final vote.'",
        "'speaker_0': 'I know we're just talking here today. I want to make sure that whatever we do has enough public involvement and transparency. The proposal to date has been in the development stage, and I know development stages happens in desks and board rooms and that's all okay.'",
        "'speaker_0': 'But when we get to the debating and adopting stage, that needs to come out into public. So I'm very glad that we started that today and I think we need to continue with that. I, I, I've been listening carefully to council member of the Grove and I feel also that as we send this over to the Executive'",
        "'speaker_0': ', when we do for the development of Phase one and phase two, we should make sure, I think that we stay involved enough and that we are watching closely enough and giving input as a body so that whatever comes back to us is something that we can adopt without a lot of drama, so that we work through the'",
        "'speaker_0': 'stuff in a way that is that is healthy, that takes into account all of the interests, and that comes back is set up to succeed. And one of the big questions I have is what expectations are being set up about how much money is going to be put into this and where it's going to come from?'",
        "'speaker_0': 'Because that's important. And it's. Hard. We had a big debate. It was at least 18 months ago. So I can I can forgive as people have forgotten. But we had a big debate about that Best Start's for Kids Capital Grants program on what it would be used for.'",
        "'speaker_0': 'It started as a proposal, at least in part, from a council member from the city of Boston who says on a regional policy committee, we had a big dream about creating a youth activity center out in unincorporated East King County in the Sammamish Valley area.'",
        "'speaker_0': 'And it's that's where the debate started. Where it ended was with a broader set of expectations, with the language that has been quoted by Councilmember Danowski earlier about this community driven, equitable process. But I think that there are expectations out in the world, including with our partners at the Regional Policy Committee, about what's going to happen with'",
        "'speaker_0': 'that particular bucket of money. So we need to deal with our partners, all of them the advocates we heard here today, the people who supported the levy, the voters who voted for the levy, and make sure that we're meeting all of the things we said we were going to do with that funding bucket.'",
        "'speaker_0': 'And maybe we look for other funding opportunities. I'm just there's a lot to be worked through here. I'm very happy to move to the next step and start working on it. But I do think we have to think carefully about how we do it so that we don't create expectations we cannot meet.'",
        "'speaker_0': 'Thank you, Manager. Thank you for those thoughtful comments and suggestions. And we do. And Councilmember Dombroski. One moment, please. And I do want to get to you. Of course. I'm just wondering if Kern, Gil and Kelly Rider would like to make any comments or have any questions addressed to them.'",
        "'speaker_0': 'And Councilman Dombroski, would you rather speak first before they do that?'",
        "'speaker_2': 'Well, I think I can just be on point for the flow. Okay. This is on a precise this is terrific dialog. I appreciate comes from the Grove and comes from about his comments on that. I was a little bit vague on the best words for Kids Capital Grants program.'",
        "'speaker_2': 'I do have an amendment that we worked on with the Executive Office and it may need further clarification, but I think that the parameters for that grant are set and it was and it went through our Regional Policy Committee.'",
        "'speaker_2': 'It's in the implementation plan and we can't collaterally change it with this and we shouldn't. That's my view. So we did clarify that we should, because you're right, because that program is designed. Commitments were made. Understandings were agreed to.'",
        "'speaker_2': 'And and frankly, that's where it was kind of the genesis of this, where I said, well, hey, folks in the community that are interested in this, let's let's do a standalone where you get real dedicated. We look for funding.'",
        "'speaker_2': 'I don't know what it is. Got some ideas. We have opportunities, but let's do a wholesale look rather than just give me a little, little bit of an already existing program. Why don't we do this with some some some heft, you know, and maybe it starts small, maybe it grows, maybe it gets big.'",
        "'speaker_2': 'I don't know. But I think that would be that's one of the reasons I think I'm interested in this process. And one of their one of their items of work is how much should we fund it and how should it be funded.'",
        "'speaker_2': 'So yeah, let me be really clear where I am on that. On the Bill State Capital Grants program I believe in particularly we need to be respectful of our process that that went through, including with our regional partners.'",
        "'speaker_2': 'That that said and frankly, if we tried to undo it, this goes over to our P.S., I think so we don't want do that. So thanks for letting me clarify on that. Madam Chair.'",
        "'speaker_0': 'Certainly. And would you like to have Jenni go over your amendment, which is I don't think.'",
        "'speaker_2': 'We need to at this time. They're pretty self-explanatory. We can keep working on them.'",
        "'speaker_0': 'So I asked of Kern or Tully would like to make any comment. I see Kern here with this. Kern. Go ahead.'",
        "'speaker_2': 'Thank you, Madam Chair. Coming up with the exact opposite. Nothing much to add. I can say from an implementation perspective, we're comfortable with both approaches and then concerned, asking for working with us to make some slight adjustments to his introduced version to make it more implementable and feasible.'",
        "'speaker_2': 'So since they are both implementable, I defer to council on the approach and I look forward to the partnership work.'",
        "'speaker_0': 'Thank you. Have anything to add, Kern, about this issue on what does priority or prioritization really mean and how is that determined?'",
        "'speaker_2': 'Yeah, I mean, I think with the language as is our interpretation. As for the community led workgroup to decide the priorities and on this council defines a more clear I don't know Kelly if you have anything to add to that.'",
        "'speaker_0': 'Yeah. Community and Human Services. If I understand counsel's intent correctly, and so far as I have understood the motion and the but we have received from stakeholders, our expectation would be to take this broad direction through the community directly and work with that work group to identify what it looks like for us to prioritize certain geographic regions'",
        "'speaker_0': 'as we develop that framework for the program. And either one of you want to comment on the idea that no community in the county would be disqualified. Indeed, just so they would be up to the group. Maybe that was in another legislation and it's a hard one.'",
        "'speaker_0': 'It is always a challenge to take on prioritization of limited funding, and we continue to do it with our funding streams. And I would expect that this program would be no different. My expectation would be you would develop priorities with the community.'",
        "'speaker_0': 'We would develop a framework for how funds could be released and wouldn't necessarily see the community orienting around know this community as in and this community is out, but without further council direction in the motion it would have a broad conversation with community that would be bringing it back to the council.'",
        "'speaker_0': 'Thank you, Councilmember.'",
        "'speaker_3': 'Thank you. And thank you, Curran and Kelly, for being here. I'm wondering if you could share how you see this potentially integrating with the $25 million Bipoc Economic Resiliency Fund we funded last year, the 10 million for community led displacement planning and Skyway we funded and as well as the work that's underway on the sub area planning'",
        "'speaker_3': ', displacement, how are those going? Do you have community led or community engagement on those and kind of what's the status and how does this support duplicate fit? You know, talk a little bit about, if you could, those efforts already under underway and how we could integrate this most effectively.'",
        "'speaker_2': 'Yeah. Thanks, guys. Remember, as you referenced last year, the exact proposed and council allocated 25 million in federal funding to be allocated through a community led process to invest in economic opportunities and recovery from COVID for our bipoc communities.'",
        "'speaker_2': 'Last, just to give an update on that last August, the exact name, two additional chairs to the Community led Oversight Committee. And since last year, the co-chairs and a group of community ambassadors and amplifiers have been meeting nearly weekly to establish a community process for that work.'",
        "'speaker_2': 'Earlier this month, the group and by committee members to take part in this committee, which will lead in allocating the funds and longer term action to make permanent to help the vision for the county's continued committed to the anti-racism work.'",
        "'speaker_2': 'There have been more than 200 community members that have expressed interest in joining that effort, which has been dubbed the Gathering Collaborative. And this week the co-chairs, ambassadors and amplifiers are hosting two informational sessions to better inform community members about the work.'",
        "'speaker_2': 'And so through these conversations with community in these sessions will be able to determine which community members will will be joining this collaborative. So the goal is to form and on board members by early spring for for that work.'",
        "'speaker_3': 'About the unincorporated areas specific work, both the summary plan, the anti displacement policy work and the I think was it 10 million we did for this community based budgeting is that skyway or urban unincorporated that we call it kind of what the status of that those funds are because I know and I just placer it was a'",
        "'speaker_3': '. One of the concepts that led to that.'",
        "'speaker_2': 'Yeah. You want to take that one on since we're close to that?'",
        "'speaker_0': 'Yeah. I can take on the $5 million that was allocated for Skyway, as well as our anti displacement, where the $10 million fund, I believe, operates outside of DC. Just in terms of the investments in Skyway, we have been working very closely with the Skyway community.'",
        "'speaker_0': 'We just released that RFP here in the last couple of weeks and are excited to get that funding out into the community. In addition, the anti displacement work, I would say that was based off a relatively similar model, but a much smaller geographic scope continues to work on the implementation phase and figuring out how we can make'",
        "'speaker_0': 'sure that we implement the very specific community programs and planning aspects. I would imagine that something like the Equitable Development Initiative, which has a much broader geographic scope, would have some amount of alignment around investing in outcomes that complement our affordable housing investments that you see across the traditionally prioritized type of dollars for.'",
        "'speaker_0': 'But I. We are very focused, I would say, for us in making sure that the very detailed work of implementing the anti displacement efforts in Skyway, West and North Highline continue apace while stacking this equitable development initiative with a broader geographic lens on top and making sure that we can continue our focus in these unincorporated areas at'",
        "'speaker_0': 'risk of significant displacement right now, while thinking about how we broaden our investments for this community. That's. I don't know if that gets to the core question.'",
        "'speaker_3': 'A clarifying question to with that, if we give the executive's appointees the. Ability to establish policy versus recommend policy. How does that work mechanically with like the sub area work you're doing? Would the direction come from them for the comp plan updates?'",
        "'speaker_3': 'Where else? What what does that mean in your mind if we if we delegate the establishment of the policy to that appointed group?'",
        "'speaker_0': 'Yeah, it's a big question, Councilmember. And very much since we are in the initial phases of this, I think we're going to go through a lot of growth phases of trying to figure out what each of these things mean.'",
        "'speaker_0': 'In our work in DC, just with the community across our other initiatives, what we have found is that the most important thing is that everyone is aligned in what these words mean to make sure that nobody gets surprised later down the line when decision making painful is actually somewhere else.'",
        "'speaker_0': 'So what I'm seeing in the language as of right now is the phrase determining policy and funding decisions. I hear you very clearly. I would say with our other funding decisions, those all sit directly with Director Leo for and he makes those decisions.'",
        "'speaker_0': 'Our advisory committees traditionally advise. I will say at the same time we do attempt to defer strongly to community when we engage them in review processes. And so I think it's going to be a point that we want to work closely with the work group on understanding what it means when we say decision making, what it means'",
        "'speaker_0': 'when we make a recommendation around this. And it will be a point that we want to make sure we have shared ownership of the decision on so that everybody can feel comfortable. I can't tell you right now where exactly we'll sit.'",
        "'speaker_3': 'Okay. I just want to be clear. Is it like agency policies or land use policies? And and I just think that the most when you look at which policies impact development the most, apart from budget, the most of the rest and the most impactful other than spending are land use decisions.'",
        "'speaker_3': 'And so I'm trying to understand what it means to. Have someone else step, you know, establish those as opposed to bring us recommendations. And what just from a mechanical standpoint and in a legal standpoint, what can we delegate?'",
        "'speaker_3': 'What do elected officials have to do? What does the government have to do? And that kind of thing? So, I mean, I'll quit talking. I know we're we're time.'",
        "'speaker_0': 'Thank you very much. This has been a tremendous discussion, very thought provoking and I believe very helpful to all of us. Certainly to me, I am a sponsor of the legislation. I do not represent any of the unincorporated King County area.'",
        "'speaker_0': 'But I think that this is really an important issue that we address and see where we can go forward with that. I still have some questions. I think some of you others do as well. And I believe that we will be able to address this more thoroughly, hopefully at our next meeting, which will be on February 616'",
        "'speaker_0': '. This committee and council member and I appreciate that, Terry and Kern during this, I thank Jennifer for all the staff work. I encourage you all to look over the amendments that were emailed to us late yesterday afternoon. There may be more or maybe fewer when we next meet.'",
        "'speaker_0': 'And Councilmember Jim Baskins, anything we would like to say in closing?'",
        "'speaker_2': 'Very well. Thank you, Madam Chair. I do want to thank all my colleagues for taking a hard look at this and for really a good dialog today. And I think that I want to express my openness to continue to work, to refine language, to get to.'",
        "'speaker_2': 'Yes. And just to refresh, because I think it went over quickly in the staff report. But the language that centered that was the base of a lot of our discussion here was this on line 56. So the initiative shall that's commanded tary for us lawyers being county wide in scope but should prioritize unincorporated communities comma particularly historically'",
        "'speaker_2': 'marginalized unincorporated area community. So there's a shall and a should and a filter there. We can work on that. Let's let's think about that. Is that really what we want to do? But there is some work to do there and I look forward to working with you all on it.'",
        "'speaker_0': 'Thank you. Councilmember Peskin. I'm going to do a little bit of research. I mentioned that. I know. And there is that cultural access with again, language and prioritization that I think the results are one or more of our budget.'",
        "'speaker_0': 'So the last two years that is perhaps a different approach was, as I recall, more along the lines of this shirt. I don't remember this show shared, but that will prioritize communities and organizations and unrest under historically underrepresented communities but not be limited to those.'",
        "'speaker_0': 'So I think we can look at some potential options to include include here are but I also want to thank those individuals who spoke in public comment to come in today. I found them very compelling and obviously with a lot of thought and strong feelings and ready to get to work.'",
        "'speaker_0': 'So thank you all and empty on our staff. I believe that we do not miss any votes. We only had one item at a fraction and that was on the for culture confirmation vote. And I believe all members voted on that set.'",
        "'speaker_0': 'Correct, Madam Chair? So with that, unless there's any other business to bring up. We are turn.'"
    ]
}