{
    "Conveyance of Surplus Property at 906 Pine Street.": [
        "'speaker_0': 'Oh, okay. Let's make it a 15 minute recess. We'll be in recess until about 5 to 11. Thank you. All right. I will call the meeting back into session. We are ready to start on agenda item number six, which is briefing number of 20 $17 009 for the sale of convention police station.'",
        "'speaker_0': 'This would office action would authorize the executive to sell convention PlayStation to the Washington State Convention Center for construction of a convention center addition. As council members are aware, this item was also included our committee of the whole last week I felt that we were close enough to being able to make some decisions that I wanted to'",
        "'speaker_0': 'add it to today's agenda, partially because there's not another committee of the hall meeting for a few weeks after this one. Since our next regularly scheduled committee, the whole meeting will be the time for our labor summit, our annual labor summit.'",
        "'speaker_0': 'On Friday I sent out proposed chair striking amendment. I am aware that there are other amendments, both public and not yet public. I have a revised agenda today, a revised amendment, I should say today that is asked to and I'd like to ask staff to go ahead and distribute that.'",
        "'speaker_0': 'Now, while they do that.'",
        "'speaker_3': 'It's it's at your places.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'We were we were working and imagine that.'",
        "'speaker_0': 'So wait, you told me to say it distributed. Then you went ahead and distributed. It's like a Scottie move right there. I couldn't.'",
        "'speaker_2': 'We need 3 hours cup.'",
        "'speaker_0': 'It's done now. Yeah. The only substantive change between as to and the in the striking amendment that was distributed on Friday morning is a change that delays action on the PSC agreement. That's an agreement to move some electrical and communications equipment on the site that's necessary for metro and sound transit operations.'",
        "'speaker_0': 'The original striking amendment said that we would cap the cost at $17 million to make that move. But because it's early days and and the number is hard to nail down, there's a process approach now that would allow that to come back for a decision at a later time.'",
        "'speaker_0': 'This is consistent with the proposal that Councilmember Dombrowski sent out on Friday. Thought that was a good approach. So I asked staff to incorporate it into the chair Stryker so I hope are prepared to work through these items today, see if we can't reach a decision on a package that we can forward to full council.'",
        "'speaker_0': 'I would ask Council Member Cole Wells, who's the lead sponsor, to move the item before the committee.'",
        "'speaker_4': 'Thank you, Madam Chair. I move the chair striking amendment to proposed ordinance 217 zero.'",
        "'speaker_0': 'I think we actually have to move the underlying item first.'",
        "'speaker_4': 'I was so anxious. Think so. Thank you. Thank you, Madam Chair. I move proposed ordinance 2017 009 for it.'",
        "'speaker_0': 'All right. And then would you be also willing to put the chair's directive, which is amendment as to before us for discussion?'",
        "'speaker_4': 'Thank you, Madam Chair. Yes. Some of the chairs striking amendment as to the proposed ordinance 2017 0094.'",
        "'speaker_0': 'Okay, that's before us in accordance with council rules 1683 With the item now before the committee, I would ask that all amendments be distributed to each member. If there are additional amendments and ask council members who have amendments they may wish to offer related to this item to provide those to our committee assistant at this time.'",
        "'speaker_3': 'In Councilmember, the amendments that we are aware of is there, as we know are made public. Is council striking amendment as to which you was just moved by councilmember caldwell's? There is a Councilmember Lambert amendment to insert a price cap on the TPS.'",
        "'speaker_3': 'Yes, there is a Councilmember Gossett amendment to increase the affordable housing contribution and require that that that affordable housing be built on the site of the project. And there is a Councilmember DEMBOSKY amendment adjusting the timeline for a vacation of the CPS site.'",
        "'speaker_3': 'And I would also add, Madam Chair, that because we prepared your speaking notes before we checked in with you this morning, there's one other change in your striking amendment also that adjust when the county would leave the CPS site.'",
        "'speaker_3': 'Do you want to speak to that?'",
        "'speaker_0': 'Yeah, let me speak to that a little bit. I thought that would be a standalone amendment, but it's an abstract. Okay. So the then let me just describe the change that was is now in situ. So there's a second change in as that makes it different than the striking amendment proposal afforded on Friday.'",
        "'speaker_0': 'And that is regarding the date by which the county must vacate and sound transit must vacate the convention place tunnel station for busses. The I think as we all are aware at some points in a. At this point, that is September of 2019.'",
        "'speaker_0': 'Busses are going to have to come out of the tunnel anyway because of the expansion of light rail. This language would state our our I don't know if preference is the correct word, but our policy that September of 2019 is the date that busses should come out of the tunnel unless the Convention Center expansion project has their'",
        "'speaker_0': 'permit by July of 2018. And unless they make a statement to us by September of 2018 that they are ready to start construction. If they do those two things, then they can start construction in March in a way, or they can be constructing in March in a way that causes the busses to have to leave the tunnel'",
        "'speaker_0': 'earlier. The thinking behind this is that there's a balance here between allowing this large and impactful public project to move forward, but not having us vacate the the convention police station and have it be empty, sit empty for a period of time when it could be used for a little longer for the benefit of the traveling public'",
        "'speaker_0': '. Did I capture that accurately without speaking those disciplines? All right. So that's the striker that's before us. Do we have a perfecting order for the amendments?'",
        "'speaker_3': 'Yes, ma'am. Beginning on page 133, in your packet, we've got the other amendments laid out in order with the sponsors listed for each sold. Go Councilmember Gossage, then Dombrowski, then Lambert. And that matches the order of the purchase and sale agreement.'",
        "'speaker_0': 'Web page again, please. 133 133 Okay. So with that, unless there's some preliminary discussion, Councilmember Dabrowski, thank you.'",
        "'speaker_2': 'Preliminary because just procedurally, I want to make sure I understand where we are with respect to amendments. And Pat, I think you can help. I had prepared working all last week with the various stakeholders, basically a striking amendment to the underlying ordinance that was that was approved by Metro Transit, the Convention Center Authority, outside counsel of the'",
        "'speaker_2': 'Gay Councils Council assault. And you've prepared, but we have another striking member from the chair here and then you've got some one off amendment. So I'm wondering does to a in in that you've got for me here incorporate all of the agreed changes in the kind of omnibus amendment that I prepared last week.'",
        "'speaker_3': 'Staff believe that the substantive difference between the two purchase and sale agreements at this point is the exit date for the station, and that is what is incorporated in Amendment two. And I was the other documents, the other the two striking amendments yours, which staff have not released yet because it's been confidential to this point.'",
        "'speaker_3': 'And Councilmember Bell, ducks are substantively the same on all key terms except for the vacation date of the station. And so that's what is an amendment to.'",
        "'speaker_2': 'So let me ask you this. The purchase and sale agreement that's on my omnibus amendment, which you're welcome to release the details summary of which was shared for me with all colleagues as soon as we got concurrence by everybody, including the exact office.'",
        "'speaker_2': 'But you've said they're substantively the same have the as the convention center. Their lawyers and our lawyers reviewed and consented and agreed to the proposed purchase and sale agreement on the Baldacci amendment.'",
        "'speaker_3': 'I don't know what the maker of that amendment has shared outside of the county, and so that would be a question best directed to her.'",
        "'speaker_2': 'Okay. So let me direct this question that you then you say that the purchase and sale agreements on the two are substantively the same. I mean, this is a $200 million and sale agreement that we spent a lot of time working with lawyers on last week to get the language precisely correct.'",
        "'speaker_2': 'And by lawyers, I mean with all the parties, have the lawyers on the Baldacci strike in their conserved contract concurred and participated in its drafting? I mean, their clients are going to have to sign it, right? Are we just is this a one side proposal?'",
        "'speaker_3': 'I don't know who the who the chair has shared her striker with. All right.'",
        "'speaker_0': 'I'm happy to speak to that. I have shared the proposal with the Essex office and they reviewed it. I have had a conversation, a verbal conversation with representatives of the project, but they have not had a chance to review it.'",
        "'speaker_0': 'However, this is a committee and if we take action today on the concept, if we agree that this is the right concept, then we have some time between now and the final vote at the Council to have legal review and a.'",
        "'speaker_0': 'Address any issues that may have been introduced. I'm not aware of any sitting here today.'",
        "'speaker_2': 'And thank you, Madam Chair, if I might follow up, please. So we've got some issues around the legal nature of the document. But the other difference you mentioned Pad, that you thought the vacation of the tunnel was the big thing.'",
        "'speaker_2': 'We had spent a fair bit of time last week again with the Essex Office and Metro Transit and the Convention Center, and lawyers for the county and the courts are working on the transit power substation agreement that TPS has and trying to figure out whether we could figure that out now and the cap issue and all that'",
        "'speaker_2': '. And we had some eventually landed on some specific language there where the parties would continue to go work that presented to the council for a potential override. And is that now where do we stand on that? Between the two version.'",
        "'speaker_3': 'The council and the chair striking amendment has the same allowance for that agreement to be moved to after closing and continue to be worked on. And the Council has the same kind of conceptual review and ability to object to the agreement.'",
        "'speaker_3': 'Yours does have additional language that was worked out between the attorneys for the parties on indemnification and a it's not really a binding date, but a a go goal target date that was added at the convention center attorney's request.'",
        "'speaker_3': 'That is not in the chair.'",
        "'speaker_2': 'Striker Okay, very good. And so Madam Chair, there's some differences just that arise from the way we've come here to today between the two approaches, and I'm happy to proceed. As you wish. I'm trying to get this deal done.'",
        "'speaker_2': 'I've been for it from the beginning, and I've worked very hard since the Budget Committee to try and bring folks who have to sign this document together in rooms to work out the details. And details on this are important because of the complexity of it.'",
        "'speaker_2': 'And so I think on principle, there is for most issues, consensus, although I'm satisfied with a minimum date of March 19 for the vacation, the tunnel and you are, I think, have a preference here for September of 19, but that may be the substantive policy difference.'",
        "'speaker_2': 'But there are some technical differences. And so I don't know, Councilman Baldacci, if you have a set of amendments, say that there was the will of the body to go with the more advanced document that has concurrence by all the parties.'",
        "'speaker_2': 'If you have a set of policy amendments to that omnibus amendment, that could advance your policy objectives of a September 19 departure. But I think that might be another way to approach it.'",
        "'speaker_0': 'I calendar Bousquet. I want to acknowledge the hard work and the detailed work that you have done. There may very well be a couple or even more than a couple of technical items that are in the document that you've been working on that are not in the document I've been working on.'",
        "'speaker_0': 'But. Those things weren't. Haven't been. At least not vetted by. By me and in my office. And so what I would like to try to do today, I mean, we have options. We have we have quite a few options here in front of us today.'",
        "'speaker_0': 'One is we work through the action on the table in front of us. And if we get to an agreement in principle, because the amendments that we have, other than some of the language in yours, it are much more policy level and much less technical level.'",
        "'speaker_0': 'If we can get to a decision on the policy and there are technical changes that need to happen between committee and council to make sure we are affecting the policy in a way that is implementable, if you will, then we can take that up at the council meeting.'",
        "'speaker_0': 'Alternatively, you know, this is a special meeting. We've been going for a while. We could take some time. We could wait until the next council meeting, which will be in early July. I would I think on balance, the I would rather proceed and get to the policy level discussion, see where we all are, and then decide what'",
        "'speaker_0': 'to do about the technical, assuming we can get past the policy. That would be my preference today.'",
        "'speaker_2': 'I think it comes from, well, duty. I guess I'll just say this and I think after budget we should pass this up to the full council was referred to this committee. You and Casmir Caldwell's and I had convened a working group of members of staff to see if we can get to an agreed amendment.'",
        "'speaker_2': 'It became clear last week that there was not an agreement among the three of us on a key policy issue, and that was the vacation date of the tunnel. I was very pleased that we were able to get that kick from September of 18 to March of 19 plus perhaps later, depending on the project's construction schedule.'",
        "'speaker_2': 'We worked very hard with the proponents to negotiate that, but your office indicated that that your preference was a September minimum 19 departure, and Councilmember Caldwell's was trying to find those. I couldn't tell, she agreed, but was willing to work on things.'",
        "'speaker_2': 'So that's what prompted me to proceed to see if I could get. And with all due respect, they're much more than technical amendments. But to get an actual deal with all of the stakeholders of approved that they would sign that the buyer would actually sign and there are protections in there for Metro with respect to the TPS'",
        "'speaker_2': 'and the comp facility as they go about the site. And I'm happy to talk to those. So I'm having trouble understanding why we would not why we would continue to ask folks to come and spend time, resources, energy on perfecting a purchase and sale agreement that has been perfected, that addresses all those issues and instead advance one'",
        "'speaker_2': 'that's incomplete, that's been not negotiated, that's not had the consent of the parties that the buyer we don't know if they'll sign it over basically the departure date policy question. And I think that's really the main difference here that needs to be resolved.'",
        "'speaker_2': 'So maybe you will advance through yours. You have expressed a strong desire to advance a chair striking amendment and and staff has prepared this. But I don't think it gets what I'm hearing is it doesn't address the practical reality of a purchase and sale agreement which isn't ready to go.'",
        "'speaker_2': 'And I would then suggest to my colleagues, if there is interest that that is there and it's ready and I'm happy to talk to it at the right time if we if we can get to it. So again, I'm trying to get this done.'",
        "'speaker_2': 'I think that this project, by continuing to experience delay, puts it at risk. And I don't want to do that.'",
        "'speaker_0': 'Thank you. I, I don't know that we need to have further discussion on that topic right now other than to say I think we're all trying to get this done in a way that works for the various stakeholders, including the transit riders of King County, who we serve, including some of the labor representatives who are still working'",
        "'speaker_0': 'through issues from there and the hotel motel workers. I mean, there are stakeholders who have not been at the table. And so let's just see how far we get. Let's just go and see how far we get. And when we when we we hit a point where there's a relatively firmed up policy decision here, then we can'",
        "'speaker_0': 'talk about whether there are additional things we need to take up before council. And I will certainly follow the will of the body with regard to what we want to do next. So with this action in front of us there, the First Amendment that has been offered is from Councilmember Gossett.'",
        "'speaker_0': 'It's Amendment one, a Councilmember Gossett. Would you like to put that into the window to put that before us?'",
        "'speaker_1': 'Thank you, Madam Chair. I'd like to draw folks attention to Amendment One. Located on page 133. I've been thinking about and wrestling with this. Concept of how do we improve equity and social justice, particularly as it relates to the lower income workers that are working in hotels and motels and the downtown area, as well as the ones'",
        "'speaker_1': 'that will be working and the expanded part of hotels and motels to deal with the hopefully, hopefully increased number of folks that will be attending conventions as they are. Some of the basics. The essence of that. America. Help me with this.'",
        "'speaker_1': 'The specific aspects. But the basics are the amendment are located in effect statement at the bottom. This increases the affordable housing requirement from 5 to $10 million and required that affordable housing be constructed on the side of the project.'",
        "'speaker_1': 'About whether we estimate the number of units the 5 million would have purchased.'",
        "'speaker_3': 'I think it's I think it's hard at this point to determine that. I think it's a rough rule of thumb for affordable housing units is typically around 300,000 a piece. But I think you've summarized the key differences in the amendment.'",
        "'speaker_3': 'Remember, the deal came over with essentially a buyer option. They could either contribute 5 million to the county for affordable housing programs or build the affordable housing on site. This amendment would say that that number is now 10 million and the buyer option has gone away.'",
        "'speaker_3': 'So that would need to be built on site.'",
        "'speaker_1': 'All right. And but we don't have a total number of expected units for the apartment building part.'",
        "'speaker_3': 'I don't I don't know that the project does not yet have permits from the city, so they don't know yet how many apartments can be built on the site.'",
        "'speaker_1': 'So. Thank you, Madam Chair. That is my amendment.'",
        "'speaker_0': 'Okay. Amendment one is before us. Did you have. Did you want to speak to it further? Councilmembers.'",
        "'speaker_1': 'I want to hear the responses from members.'",
        "'speaker_0': 'Okay. Councilmember Coldwell.'",
        "'speaker_4': 'Thank you, Madam Chair. I have a question for Councilmember Gossett, and it is have you discussed this amendment informally or formally with the purchasers.'",
        "'speaker_1': 'Particularly people that are going to who build it?'",
        "'speaker_4': 'Well, the purchaser or the representative, I believe, Mr. Matt Griffin, about the thoughts, as long as we're trying to be inclusive and determine what all the parties think about striking amendments and amendments. I'm just curious, have you spoken with them?'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'I haven't spoken. I'm not real clear on who the developer partner is.'",
        "'speaker_4': 'Mr. Griffin.'",
        "'speaker_1': 'I'm sorry. No, I haven't spoken to them. I just think that this is a reasonable price to have to pay, given our commitment to equity and social justice, and that the previous time I was not minimally reasonable to me.'",
        "'speaker_4': 'Thank you. Mr.. That's please. Thank you. So there are actually two major parts to this amendment. So we could find some of us might agree with one part, but not agree with the second part, which may be challenging.'",
        "'speaker_4': 'Have a quick follow up question with Pat. Pat. I think I asked you kind of a similar question before, but has because I am new here. Is it normative to require construction of affordable housing on site as compared to having the the the other option that we had originally?'",
        "'speaker_2': 'I think that.'",
        "'speaker_3': 'We do so few deals where we actually have a piece of county land being sold and then essentially immediately developed again. I don't think there is a normal we have done it both ways. The Kingdom North Lot, for example, there were requirements that it be built on the site and other other deals.'",
        "'speaker_3': 'We've required a contribution. So, you know, this one having an option of either one for the buyer as originally proposed. Is consistent with the various directions the county has gone before. They didn't quite answer your question, but I don't think I don't think there is a clear answer to it.'",
        "'speaker_3': 'We've done it both ways before. And I think that's this is not outside of the norm from that perspective.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'I have a couple of questions. First of all, my understanding is that there is expected to be a discussion with the city of Seattle as part of either their permitting process or their Ali vacation, road vacation or both, and that there's a likelihood of a requirement for affordable housing that comes out of that process.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_3': 'So where we are currently as part of this deal, the developers offered King County the $5 million payment that was proposed as part of the permitting actions and the community benefit process at the city. They have offered 9 million as part of two different programs, so 4,000,001 and five and the other.'",
        "'speaker_3': 'And every time I try to figure out which is which, I get them backwards. So 9 million total to the city, 5 million to the county. But neither deal actually is done yet. And so that number may move.'",
        "'speaker_0': 'Right. And just for reference, the sales price is about 144 million.'",
        "'speaker_3': 'It's 160. But they're paying 20 million cash at close. And 140 million is where that numbers is. Your head is being financed.'",
        "'speaker_0': 'Got it. So that's if you're talking about approximately 14 million out of that that amount. I just want to remind us that the executive's proposal included a buyer option to pay cash or build on site. And Councilmember Lambert, among others, questioned that about what would get us the affordable housing built soonest.'",
        "'speaker_0': 'Do we have a sense of that?'",
        "'speaker_3': 'I think certainly building on site would be the latest or the or certainly later than cash to close because a cash a close option would result in a check being written to the county later this year or whenever the closing occurs.'",
        "'speaker_3': 'That would then be used for county affordable housing programs building on onsite. Real realistically, the the apartment or condo building that's being built wouldn't be opened before 2021. So you're still talking quite a bit down the road before that housing would be built on site.'",
        "'speaker_0': 'Okay. And I want to I want to acknowledge Councilmember Dombrowski for the concept of requiring cash at closing because of the idea that that would accelerate the opportunity to provide $5 million worth of affordable housing as quickly as possible.'",
        "'speaker_0': 'Okay. Any other comments or questions about this amendment right here? Councilmember Garza to close.'",
        "'speaker_1': 'Thank you very much, Chair. An additional concept that influenced my mind was listening to the representatives of Unite here and some of the people who have represented inner city communities on this project, and others where people have a difficult time grasping and understanding the commitment to affordable housing when it's not tied more specifically to the actual project'",
        "'speaker_1': '. I would tie it to the actual projects. Then we have what Mayor Arroyo used to call almost a guaranteed habit, scattered site and low income housing in various neighborhoods. Now, I've just given the money to the city or the county.'",
        "'speaker_1': 'The only place where low income housing can be built is when low income developers are developing. Yeah, and it seems to be mostly low income community. That's all right. But I like the idea. I love the, you know, the working poor living in units in the same buildings with moderate and market rate housing falls.'",
        "'speaker_1': 'That adds more to the enriching social experience that occurs in the buildings. And I don't see how we can get there unless we start as the government requiring that it be on site and trying to facilitate that occurring.'",
        "'speaker_1': 'So I think any consideration that is given to my No. One. Hey, thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Mr. Garza. Okay. I'm prepared to call for a vote on amendment. What is each one? A all those in favor. Please signify by saying I. I opposed. No, I think I'm going to have to call for a show of hands.'",
        "'speaker_0': 'All those opposed. Please signify by saying, I am raising your hands. You say that you support that. I heard those of those who are in favor of the amendment. Did I say opposed? It's been a long day already.'",
        "'speaker_0': 'All those in favor of the amendment please signify by saying I and raising your hands. Okay. And those opposed? No. Okay. The amendment does not carry. The next item is where I am right now. One item to a council member.'",
        "'speaker_0': 'Ambassador.'",
        "'speaker_2': 'Thank you. I think I'll withhold this amendment at this time. And because I just think it's going to make more sense to offer my combined omnibus amendment and I will probably speak against adoption of the chair Stryker because it does not it just hasn't been negotiated with the parties.'",
        "'speaker_2': 'And I think there's a more efficient way to go the alternative way. And I'll ask Pat if this makes sense, because you've prepared this and I'm really not sure mechanically how you've set it up. Pat Would it be possible to offer two way which relates to the timing of the departure from the tunnel?'",
        "'speaker_2': 'Right. As I understand, yes. What it also and say that regardless of how that carries or is a I said to adopt and would then be possible to offer an oral amendment to substitute my purchase and sale agreement form as the attachment to the Belushi's striking amendment to get it to get in other words, get a current'",
        "'speaker_2': 'purchase and sale agreement or more up to date purchase agreement that has all the material terms negotiated attached.'",
        "'speaker_3': 'I would have to defer to legal counsel on that. The item that is before the committee right now is a striking amendment with an attachment. I don't know if a right oral amendment to replace the attachments would be in order or not.'",
        "'speaker_3': 'I just don't know the procedural ruling on that.'",
        "'speaker_2': 'But okay, so procedural there's that issue. But, but just mechanically, because we've got a very basic kind of ordinance, if you will, with the language that references that attachment. The attachments seem to be kind of stand alone documents and trying to just mechanically you're.'",
        "'speaker_3': 'Asking for a legal conclusion. I just don't know the answer to it, because an amendment is. Kendall, the thing and I don't know if you can split that amendment into two things or not. I just don't know.'",
        "'speaker_0': 'So what you have Kendall Mora, deputy legal counsel, what you have before you now is S-1. And as part of this to excuse me as to and as incorporated in as to is the purchase and sale agreement to which all of your amendments are now running or actually to the attachment.'",
        "'speaker_0': 'So I, I would conclude that offering a, an amendment to replace attachment a at this juncture, it would be out of order because you are you have to deal with your S-1, which includes the attachment.'",
        "'speaker_2': 'And that S-1 is.'",
        "'speaker_3': 'To.'",
        "'speaker_2': 'You as to attach attaches attachment which to the purchase agreement which.'",
        "'speaker_0': 'Is incorporated into the Stryker. It's part I mean, it's what you are dealing with now is ask one and it's attachment ex S-1. I'm sorry, I keep saying that as to what to call it the belt dutchie Stryker.'",
        "'speaker_0': 'Right, easier.'",
        "'speaker_2': 'So what you're saying is an amendment, but we're offering amendments to the Balducci Stryker. This would just be another amendment to it which would say substitute in a different attachment.'",
        "'speaker_0': 'But your amendment to replace attachment a yes would now be, I would conclude out of order because it wasn't handed out at the beginning of this.'",
        "'speaker_2': 'No. Well, we have handed it out. I asked that thing out and it was handed out.'",
        "'speaker_0': 'But is then.'",
        "'speaker_3': 'That amendment is a striking amendment though. It is not.'",
        "'speaker_2': 'It is part of it.'",
        "'speaker_3': 'So I think I think I think what I'm hearing from legal counsel, that's.'",
        "'speaker_2': 'Out of order because of the procedural.'",
        "'speaker_0': 'Rule. Let me ma'am is. Yeah.'",
        "'speaker_2': 'I'm just saying I'm trying to we have 318 to a three.'",
        "'speaker_0': 'Right.'",
        "'speaker_2': 'What I'm trying to do is not mess it up by offering to a which is change the personnel agreement. If, if we could get your if we could get your.'",
        "'speaker_0': 'Eyes to.'",
        "'speaker_2': 'You see what I'm saying?'",
        "'speaker_0': 'It would be cleaner if you're willing to, if you will, perfect or complete the Stryker with the striking amendment that's currently in front of us mine with whatever substantive policy amendments there are that might include yours, which is different language around the dates, it might not include yours, but then when it comes to actually maybe swapping out'",
        "'speaker_0': 'the purchase and sale agreement, which is what this is all really about, is adopting the purchase and sale agreement, maybe we could do that as a separate thing at the end after we've it just might be less confusing that way.'",
        "'speaker_0': 'And I think that's what you started to say.'",
        "'speaker_2': 'And yeah, I was told by my staff that staff had prepared any amendments necessary to advance kind of my package on yours. But now. I'm saying that that actually didn't occur. So what I think I'll do my share is not before the fair.'",
        "'speaker_0': 'This all happened between Friday and this morning.'",
        "'speaker_2': 'So now I have a mic and maybe I think I will probably just argue against adopting the striker and then if it fails, advance my S-3 because that would be the consolidated document.'",
        "'speaker_0': 'That might be a cleaner way to go if that works for you.'",
        "'speaker_2': 'I mean, if if if your amendment carries if you're striking minimum carries, then mine probably won't. Right?'",
        "'speaker_3': 'I don't I don't think can I think if the chair's striking amendment carries, I don't think you can offer a revised striking amendment. Is that correct.'",
        "'speaker_0': 'That's correct. Because all the decisions will have been made with regard to the bout dutchie the purchase.'",
        "'speaker_2': 'And so yeah.'",
        "'speaker_0': 'But we will have, as I said, at least a couple of weeks between now and the council meeting. If there are items that you feel were not picked up that are important to try to merge them and then we can take up additional action.'",
        "'speaker_0': 'I guess it.'",
        "'speaker_2': 'Seems goofy to me, but I mean there's a lot of items, but I think I will I will not offer mine and we will see if yours has adequate votes and then I'll offer. If it does, then we're done.'",
        "'speaker_2': 'And if it doesn't, all offer mine.'",
        "'speaker_0': 'Okay. All right. Thank you. So we'll move on to Amendment three A, which is Councilmember Lamberts. Thank you. That Chair, in looking at this important project, I had a feeling that there were many items that were taking and reducing the amount of our net proceeds from the sale.'",
        "'speaker_0': 'And one of them, I felt we needed to have some kind of oversight over. And that is if you look on the effect statement on page 137, it says that it adds a sentence that obligates them to pay for all costs for the TPC work above 70 million unless the county approves a higher amount.'",
        "'speaker_0': 'I think we've we've talked about that the price. And my concern is that the price would escalate so much and we would have no input in that. So I think as being notified and being able to have some say on that is very important and not be a blank check because I believe that there could be instances'",
        "'speaker_0': 'where that might be exceeded and we should know about that. So it's just to make sure that we have oversight. Okay. Okay. Amendment three A is before us. Any questions or comments? Councilmember Gossett.'",
        "'speaker_1': 'Thank you. I wanted to ask Patrick and I thought that the Common Council already had the ability to approve a significant price increase. Or is this different than that?'",
        "'speaker_3': 'I think to be fair, we are trying to thread a very fine needle in this case because what has changed in the striking amendment is the movement of this TPS agreement to, more likely than not, post-closing. And also you have an opportunity that's in this amendment for the Council to review, and if they don't like it, reject'",
        "'speaker_3': 'the TPS agreement. And this this language, I think is a policy statement. But because this has to be reviewed by the Council later on anyway, I it's it's a bit odd in the in trying to get it in just but but from a policy statement perspective I think it works.'",
        "'speaker_3': 'But because the agreement already has to come back and the council already has a 30 day review and opportunity to reject, I think that's what makes it a little unique. Okay.'",
        "'speaker_0': 'Comments. Other comments for questions. I had.'",
        "'speaker_2': 'A couple of.'",
        "'speaker_0': 'Comments. Yeah. Come from an and I think there might be some more before you close.'",
        "'speaker_2': 'Councilmember DEMBOSKY I think that I'm chair so this issue, the TPI SRS that is the transit power substation memorandum of understanding is one of two major follow on agreements beyond the purchase and sale agreement. I will be candid and say I didn't realize the complexity of it until after several hours of meetings last week with the executive'",
        "'speaker_2': 'branch, with the Deputy General Manager, Victor Bass of Metro Transit, with the county's lawyer, Matt Hanna from Cairncross and help him and with that central staff. And it is an integral piece of making sure that this works smoothly.'",
        "'speaker_2': 'It has two components. There's a communications facility and a power facility which are covered by this agreement, both of which are important in operating our bus system in the tunnel and our light rail system. And this is what it comes down to.'",
        "'speaker_2': 'It is a life safety issue. This equipment, power and communications are essential for safely operating the tunnel, both in light rail and busses. There's a complexity to this in that the there's some issues around who would be obligated to pay the cost of moving certain of this equipment, sound transit or King County.'",
        "'speaker_2': 'And there are also some advantages to having some of those things worked out later. That's just the highlights of the complexity around this issue and the amendment that I have, the personnel agreement that resulted from extensive hours of discussions, including on this particular topic I tried to achieve, and I'm not sure that Councilmember Lambert's amendment were well-intentioned'",
        "'speaker_2': ', achieves the goal in the in the best way. Her amendment sets a firm dollar cap of $17 million on it. And I think in doing so, she's trying to protect the benefit of the bargain, which is a principle I think everybody here agrees to.'",
        "'speaker_2': 'Now, interestingly, if the number had come over to us at 22 million, I think we'd be trying to protect the benefit of the bargain and saying 22 million. We at least I don't have the level of granularity to know what if it's 17 million or 22 million and who should pay and what's right.'",
        "'speaker_2': 'So what I think the better approach is, given the complexity of this, while still trying to achieve Councilmember Lambert's objective, which I share with you, to protect the better, a bargain is to keep the council involved with the process that is set up to, say, continue negotiations.'",
        "'speaker_2': 'Mr. Executive, with all the parties Sound Transit, the Convention Center and Metro Transit, continue those negotiations. And then once you think you've got a deal, report back to us at the council and give us adequate time. If we don't like it to reject it.'",
        "'speaker_2': 'And that's the structure that is in. I think my I know it's in my mind abundantly. I think it may have made its way into law. So I think the hard cap in this case is, is a is a well-intentioned idea to preserve in a bit of a bargain, but it's a blunt instrument to blunt, I think'",
        "'speaker_2': ', for the complexity of this. And and again, the complexity of this particular issue didn't become apparent to me until last last week. Councilmember Lambert. So for that reason, I'm not going to support it, but I know that the intention behind it is good.'",
        "'speaker_0': 'I'll add my own comments. I, I agree that I think all of us have our eye on the ball of not of creating some certainty that the benefit of the sales price not be, you know, frittered away and additional costs that we'd have no control over.'",
        "'speaker_0': 'I think that the language that I frankly cribbed from Councilmember Dombroski gives this body a veto. It gives us an opportunity to say in the future, we don't like that price that you came back with. And so no.'",
        "'speaker_0': 'And forces, you know, to go back to the table. And with that, we can achieve the same goal. And it's even slightly more flexible, I think, because there's nothing that says that even a slight overage could, could, could trigger that.'",
        "'speaker_0': 'We have to be thoughtful and we have to act in good faith, of course, at that time. But we have we still have some control over what's happening with that that cost that we don't really know exactly today what it will be at the point in the future when it is incurred.'",
        "'speaker_0': 'So I agree with the intent in both cases, but I have incorporated the procedural approach for a reason and B, I think that meets our our needs. So I'm going to I'm going to vote against the amendment, but I definitely support the motivation behind the amendment.'",
        "'speaker_0': 'Any other comments before Councilmember Lambert? Councilmember Lambert, go ahead. Thank you. Well, as you said, this happened over the weekend and this was written before over the weekend. So I think it signals our intent. I am excited about the project and what it can do.'",
        "'speaker_0': 'I would like to see the affordable housing be part of it because then I know for sure it will get done. And that is. My concern that there's affordable housing get done. I am not feeling like I always have confidence that when affordable housing is being done for this or that, it it is the quality or the'",
        "'speaker_0': 'quantity that we had originally thought. So if it's in the building, I know that it's not going to be of lesser quality. But when you look at the price and you look at the comps per square foot and maybe this is part of my closing statement, but it was in the it was in the middle.'",
        "'speaker_0': 'It wasn't at the very top. And that concerned me. The desirability of this property is very, very high. So for that reason, it should be at the top. The length of this contract is longer than I have seen in some contracts, which is favorable, and that's fine with me too.'",
        "'speaker_0': 'But that also should put us up towards the top. The size of the down payment is smaller than I would have liked, which should put us up more to the top. So. Oh, and then I see these other costs that we don't really know what this is going to be and we really don't know what that's going'",
        "'speaker_0': 'to be. And you just know that we hadn't seen the language over the weekend when we wrote this, but it keeps lowering the price per square footage. And one of the things I'm going to want to know when we get this done is what what did it ultimately come out to be as the cost the square footage'",
        "'speaker_0': '? Because I wasn't really pleased where it was when it started. And if it keeps getting lower, then I'm really going to be less pleased with that. And in addition, during the time of this construction, if the current trends in real estate properties cost continue to escalate at the same rate, then it's even a lower rate of what'",
        "'speaker_0': 'we have offered here. So I'm trying to look out for the taxpayers and I think in the way you put this together, bringing it back to the council again. So we continue to do that. I just hope that we don't feel as we have in some projects, Oh, this is so much into it or that so much'",
        "'speaker_0': 'has been done already that will just go along with it. I'm not ready to go along with it. As we go on it. It means that the taxpayers are not getting the full value of what that property was worth.'",
        "'speaker_0': 'So I'm going to withdraw this in light of the fact that you have put it in your striker and be ready to vote on final passes. Okay. Thank you, Councilmember Lambert. That concludes the submitted amendments, which brings us to a final vote on Amendment S two as amended.'",
        "'speaker_0': 'Are there any comments or questions at this time, Councilmember?'",
        "'speaker_2': 'Do you think that you're just procedurally at somewhat awkward here and that I guess I'm asking Mike. I'm having a little difficulty in being able to present the differences that I would offer in SE three, and I think that's the choice before council a fully prepared negotiated agreement that the lawyers have looked back, that Metro Transit is'",
        "'speaker_2': 'looked at, that the exact office is looked at and the buyer has looked at and agreed to, but which folks have not been able have been briefed on it fully. And I want to make sure that folks know that that's here.'",
        "'speaker_2': 'It's in front of you. It's S three. And I'll do my best to highlight some of the things. One, well, anyway, and I guess maybe I'm asking procedurally, you would like to have an up or down vote on yours first.'",
        "'speaker_2': 'Is that is that right?'",
        "'speaker_0': 'That's what was before us. And so that's the next step. But if you would like to take your time now to explain the differences, I think that would be the now would be the time.'",
        "'speaker_2': 'Okay. I guess I appreciate the opportunity to do that. I would I would ask maybe Mr. Hanna, our counsel, who has had a chance to look at mine if he would be available for for four questions or an overview or.'",
        "'speaker_2': 'Pat, do you have anything that you would like to add?'",
        "'speaker_3': 'I would think that Mr. Hanna giving legal advice would need to be an executive session, which I think can be done. I can hit the highlights of what was in your amendment, I think in open session without.'",
        "'speaker_0': 'Before we do that, I have a question, if you don't mind. Councilmember Caldwell's has a question.'",
        "'speaker_4': 'Thank you, Madam Chair. I had requested that a side by side comparison be developed between Mr. between Councilmember Dombrovskis and Council and the chair approaches. And I know there was one change in the Chair's approach in terms what's reflected in striking amendment as to I think though that what went out on Friday or Saturday may not have'",
        "'speaker_4': 'gotten to all council members relatively.'",
        "'speaker_3': 'I, I don't believe it did council member I believe it went to you because at the time that the the other striking amendment wasn't available yet. So I provided it to Mr. Dombrowski. The chair striker has since changed to that document.'",
        "'speaker_3': 'That document would not.'",
        "'speaker_2': 'Be relevant.'",
        "'speaker_1': 'That.'",
        "'speaker_4': 'I perhaps by the time we get to the full council meeting. It could have a side by side, certainly. And regardless of what happens here, it's just helpful for me anyway. And I think it could be helpful for others.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you for. Thank you. Councilmember Domanski, you had the floor and thank you for allowing the question. But can you please give a brief summary assurances?'",
        "'speaker_2': 'Sure.'",
        "'speaker_3': 'I think and actually we tried to do a similar so if you take the two amendments at the top of the page is actually same format. I think from my perspective, both you, Madam Chair, and customary Taberski talked about the difference in the date.'",
        "'speaker_3': 'Customary Dombrovskis would be March 30th of 2019 unless the permits were not issued by the City of Seattle by June 30th of 2018. And yours, Madam Chair, would be September of 2019. Almost the opposite. Unless by June of by the end of June or July one of 2018, the city has issued permits.'",
        "'speaker_3': 'And then later that year, the project provides notice to the county that they will be ready to take over the site in March. So that's certainly a difference. The other major difference that I would say is through that work with legal counsel on the TPS US agreement itself, while both agreements have to come back to the council'",
        "'speaker_3': 'and the Council has a similar review and rejection period. Councilmember Dombrovskis includes more protections for the equipment that is on the site, which is a big deal. And what's changed there, because both amendments move that approval of that agreement, most likely to a post-closing scenario.'",
        "'speaker_3': 'That means after the deal closes, after we've transferred the property to them, the the power substation and communications equipment will still be on site. So Councilmember Dombrovskis purchasing sale agreement adds additional protections for the county to make sure that we have continued operations of the site undisturbed and puts I'm not sure what I would call a target'",
        "'speaker_3': 'date in there for when the parties should reach agreement, although that agreement still has to come back to the council. So I think from the staff perspective and one other change, although maybe this doesn't rise to the level of major change, but I pointed out, just to be fair, both amendments say the same thing for how the'",
        "'speaker_3': 'proceeds shall be used first for costs from the sale, then for routes or services impacted by the early closure. Then for the long term Metro connects. As you're aware, if we do transfer the tunnel earlier than planned, the county will avoid a couple of years, one, maybe two years of debt service depending on when it transfers.'",
        "'speaker_3': 'Councilmember Dombrovskis amendment also says the debt service payments that are avoided go into that pot as well for allocation and that could be three, three and a half to 4 million to 8 million depending on whether it's one or two years debt service payments, it's probably going to be one.'",
        "'speaker_3': 'So in that 3 to $4 million range, I think unless Mr. Dombrowski thinks something else, I think those are the major differences between the two documents. And if I missed something, I'm sorry.'",
        "'speaker_2': 'And I think that was a good summary. I think in addition and this is important with respect to affordable housing, I have added language agreed upon with the purchaser in the recital section on page one, page seven of my amendment.'",
        "'speaker_2': 'But page one of the purchase agreement that reflects the commitment by the Convention Center to the Seattle Affordable Housing Piece of the $9 million that is not in the chair striking purchase and sale agreement. And I thought that was important, given the interest in affordable housing to be able to kind of cement that public commitment in the'",
        "'speaker_2': 'purchase and sale agreement as a as a floor. And that's on lines 19 through 26 of my purchase and sale agreement on artwork. Pat, is there any difference on the artwork language?'",
        "'speaker_3': 'No, proper, proper. I'm using decommissioning because I can never say of the other word. Proper decommissioning of the artwork is a condition of closing in both agreements.'",
        "'speaker_2': 'Okay. I think also on that note, I'm sorry to jump back to you on the TPS. There's another thing that we negotiated and agreed upon was the, you know, suspension provision. And this is on page seven of line 738 of my purchase agreement.'",
        "'speaker_2': 'And that is if the demolition work on the project's critical path is suspended by the buyer for a period of three days or more, then our termination date may be extended by like period. In other words, what I'm trying to do here is here's my main goal keep the tunnel for our operations as long as we can'",
        "'speaker_2': ', but not interfere with the project's construction. So when they're ready to go. They would have it. And if they suspend their work and we could continue to use it, that clause lets us keep using it. And that's been my main thrust here while trying to build an objective test, which, frankly, Pat, you suggested the hard date of'",
        "'speaker_2': 'June 30th as the permit date and and then the service changed thereafter. So there's a number of other language provisions in here, I guess, colleagues. Boils down to two things. One, my strike amendment is the result of a lot of work of all the parties that have to sign it, and they're advising the council.'",
        "'speaker_2': 'The Chair Stryker doesn't reflect that work. And importantly, and I think it's a big win, frankly, for our operations, we pushed the date to March of 1904 coming out of the tunnel. Cast member Belushi's has a September 19 date and I don't know whether that's agreed upon or workable mind.'",
        "'speaker_2': 'Could go back to to to two 2019 if the convention center doesn't have their permits and I have additional flexibility in there to get us as long as we possibly can without interfering in the project. So we're trying trying to advance a sale.'",
        "'speaker_2': 'I took a lesson from Councilman McDermott when we were doing the Bellevue site, when finally we could we figured, one, you couldn't negotiate with nine council members. And he went into the room with council duty and negotiated and brought back a recommendation.'",
        "'speaker_2': 'And we tried to do this with three council members, but it became apparent that there was a difference in policy. And that's why I was available. I attended all of the meetings and and continue to attend them. And and the policy is around that vacation date.'",
        "'speaker_2': 'And I don't want it to interfere with the project. We've made some very good progress in here. We've capped at $4 million the ramp cost. That was an open item before, but we've got a hard cap on that to protect the benefit of the bargain.'",
        "'speaker_2': 'And Councilmember Gossett, with respect to housing, please know, in addition to the language in my purchase and sale agreement that makes the developer commit to that promise over at the city of Seattle, we do have a preference for workforce housing.'",
        "'speaker_2': 'Both of the amendments are the same in this regard and a priority for 30 to 50% AMI on the lower end. And I think that's good and that's the same across both. So I think I would ask I think it's it's fair to ask the lawyers if there's anything we've missed here that Mr. Hannah would add.'",
        "'speaker_2': 'I think it'd be important for colleagues to hear it, given the amount of work you put in on last week.'",
        "'speaker_0': 'Mr. Hanna. Do you want to come forward and add anything?'",
        "'speaker_2': 'Mr. Hanna is the special your lawyer.'",
        "'speaker_0': 'He says he'll introduce himself a.'",
        "'speaker_2': 'Special deputy prosecuting attorney and other outside counsel working for the prosecuting attorney's office advising King County on that. He's our lawyer, but our lawyers.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Welcome, Mr. Hanna. Thanks.'",
        "'speaker_5': 'Morning. I had a chance to review the amendments in the last hour. So from my very brief review, I would say the only other difference is with respect to the threshold that the convention center would have to meet in order for the timeline to either be extended to September 2019 and Councilmember Dombrovskis version or for the exit'",
        "'speaker_5': 'date to be rolled back from September to March. And Councilmember Vale teaches for a version in council member duties version. There is a threshold that needs to be met. The language, I believe, is take control of the site, that the notice to the county would be that the convention center would need to, quote, take control of the'",
        "'speaker_5': 'site, which means continued operation of the site as a transit base would impair the construction of the project. The threshold that is in Councilmember Dombrowski, his version. Bear with me just one moment. Would be that the permits necessary to commence construction, which are contingent contingent upon the issuance of a master use permit and demolition and construction on'",
        "'speaker_5': 'the site for the project has not begun by by June 30th. So in one case. Councilmember Dombrowski, the threshold that must be met is that permits are issued and that the convention centers mobilize the state site and begun construction.'",
        "'speaker_5': 'Councilmember Belushi adds Notice that the convention center needs to take control of the site. So a slightly different description of the threshold and each version. That's the only other substantive difference that I was able to identify in my very brief review here in the last hour.'",
        "'speaker_0': 'Well, we appreciate your your on the spot legal work. And there's a question from Council Lambert. Thank you. So I've had the privilege of working with the city. Is that the I'm trying to get a new P for our out of street facility, which has been a nightmare.'",
        "'speaker_0': 'So I want to make sure that if they treat the convention center as charmingly as they've treated the county, that this may be built in the years 75, 92. So what do you mean when you say take can ask me how I really feel.'",
        "'speaker_0': 'What do you mean? You say take control in order to be able to to work in this space. You have to have a grading permit, assuring permit part of that, and you require that there's a variety of permits.'",
        "'speaker_0': 'So does the language take control? Also assume that.'",
        "'speaker_4': 'You have those permits in hand?'",
        "'speaker_5': 'Councilmember Lambert, I'll mention right off the bat that I candidly was not involved in the development, the language around taking control of the site. And and so I don't want to interpret the intention that was behind the use of that language.'",
        "'speaker_5': 'But if I read the language that's proposed in the in the agreement, it states that this is simply notice from the convention center that the convention center will need to take control of the site. So I think there's a built in assumption that permits have been issued and that there are other ways ready.'",
        "'speaker_5': 'Right. So there's a two part test that looks like in Councilmember Belushi's version. The permits are, in fact, issued in the same way that it is in Councilmember Dombrovskis version and that we received this notification that they're prepared to take control of the site.'",
        "'speaker_5': 'So again, they have the permits and are otherwise ready to proceed.'",
        "'speaker_3': 'They have acted customarily. Did the both amendments treat Seattle permitting in essentially the same way and that they June 30th or July one is the target date? One of them says it's September unless they meet this threshold. One of them says it's March, unless they don't meet this threshold.'",
        "'speaker_3': 'So if Seattle, as you put it, treats this project the way they treated the CFTC, you will be beyond that June 30th date and I'm not even sure which year, and that's the reality of it. But that is not a substantive difference between the two documents.'",
        "'speaker_3': 'The subsequent notification is the difference.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'I think that that's.'",
        "'speaker_0': 'Really an important part, and I'm really glad to see that it's got that second part test. And I would say it's not only the year I would be talking about what century after having dealt with that. So make me go to Wednesday morning meetings for four years to talk about something.'",
        "'speaker_0': 'It makes me a little testy. So thank you. Okay. Councilmember Gosset.'",
        "'speaker_1': 'Thank you very much, Madam Chair. My question is for Councilwoman Ranking Biles, because I'm trying to figure out what happened, because to me, these two documents look like plans that we got. The only difference is, as they are Stryker and the other ones they have.'",
        "'speaker_1': 'DEMBOSKY Stryker, and you talked about the meeting with all the parties that took place that led to your being bought off on by all the parties. And my question is, were the other two council members on the subcommittee of three invited to that negotiating session?'",
        "'speaker_1': 'And if they weren't, why not?'",
        "'speaker_2': 'Customer recalls that they were. We were working together, including doing the recommendations up until, I think Thursday or Friday. I did not invite them to the Thursday or was at the Friday meeting meant for me because at that point all of the points which had been agreed upon is there are a lot of similarities were done, but'",
        "'speaker_2': 'there was a fundamental difference in opinion on the vacation of the tunnel date. And Councilman Belushi wants September of 19. In a way, Councilmember Caldwell said, I agree with Claudia, quote unquote in the meeting. And I said, Well, I just don't agree.'",
        "'speaker_2': 'And so then I continued to work with the parties to try and get something that reflected the March date. Now I kezman remember Caldwell's is certainly capable of speaking for herself, and I want to say that she has been open to trying finding a resolution throughout, but that those two things, when it became clear to me that'",
        "'speaker_2': 'cars were real douchey, who wasn't there but her chief of staff was said that she wants to use this trigger period for coming out of the tunnel to make and basically a September date. Or it could even be be worse, to be honest with you, under the prior language.'",
        "'speaker_2': 'But that fundamental difference in direction caused me to say, well, I don't agree, I want to be out in March or as soon after is as we need to be to let the work commence. And so that's why I advanced this work.'",
        "'speaker_1': 'And you are by yourself to all the other partners?'",
        "'speaker_2': 'Yes, I did so. But that's the only choice. They had to advance the deal. I did not want to negotiate with myself on a complex deal. I thought, in fact, I'm the only one that has invited repeatedly the purchaser to come into the room.'",
        "'speaker_2': 'And that was with Councilman Belushi and Caldwell's a week ago or more to try and get this done. And so I think it's been inclusive until there was a fundamental disagreement on the policy, and then I continued to advance the measure.'",
        "'speaker_2': 'So I've tried to put together a deal that will actually be signed that the buyers willing to sign, that the executive supports that works for Metro. And that's what I've done before with with the alternative. And so they're not twins, but they're closed because there's mostly agreement, but there's some big differences.'",
        "'speaker_2': 'And on a deal of this nature, I don't think you can sit in a room on the 12th floor and write words and then pass it in legislation and expect the other side to sign it. I think you got to bring them into the room, hear that their concerns are listened to.'",
        "'speaker_2': 'Our own lawyers who I brought into the room to work the deal and put it together and bring in the deputy county executive to get their input. And Victor observed, So I've done the best I can. I want to move this project forward.'",
        "'speaker_2': 'My alternative is ready to go. It will be signed. It protects Metro. Very importantly, that TPS language that I have in there protecting our equipment is not in the Baldacci amendment. Not in there. And that's an important piece of language for a life safety system.'",
        "'speaker_2': 'I'm not saying it can't be fixed. We're kind of in a procedural wrangle here, but I've tried to move this ball in a responsible way from a governing perspective. And there is a fundamental difference in policy between Councilmember Bell, Dutchie and me.'",
        "'speaker_2': 'She wants the floor of September 19, a year later than they first wanted in 18. I got working with them six more months March and it could be later. But I do not want to cause a delay on this project and put it at risk.'",
        "'speaker_2': 'And that's been the thrust of my work. And that's why the convention center has agreed to it and Metro has agreed to it and the executive has agreed to it, and our lawyers have blessed it.'",
        "'speaker_0': 'I want to call on Councilmember Caldwell's and then move to a vote, because we're already well past the end of the meeting time, if we could. Councilmember Caldwell.'",
        "'speaker_4': 'Thank you, Madam Chair. I feel compelled to speak on this, and I think this disagreement could have been avoided. And we were agreeing on a lot of things in a meeting that Councilmember Dombroski. I requested our attendance last Wednesday with very little noticed and unfortunately the chair of this committee, she was not able to attend.'",
        "'speaker_4': 'I it was not a convenient time for me to meet either, but I went there and at one point I did say that I would like to say I agree with Councilmember Bell. Do try to stay in the tunnel for the better sense as long as we could, but without disrupting putting the deal together.'",
        "'speaker_4': 'That's a very different comment than saying that there was a total impasse and there was a fundamental difference in opinion. I am the sponsor of this legislation. The site is in my district and I believe as such that I was certainly to be considered one of the parties who should have been consulted with continuing work to bring'",
        "'speaker_4': 'everything together. I also believe strongly that Councilmember Bell Banducci expressed, as Harris has expressed, a very similar if not the same view as I had expressed at this one meeting. I was not informed of a follow up meeting.'",
        "'speaker_4': 'I was not invited to attend, nor was my staff. And if that had happened, I believe we would be here today with an agreed upon striking amendment that everybody could be supportive. And I think we really are in a very unfortunate position at this point.'",
        "'speaker_4': 'And I'm not appreciative of the procedure in terms of how we got here, rather the process. Ready to go with that. I think there is time to reach agreement, whether we postpone this to a later meeting or we go ahead and take a vote, which I am fine with on Striking Amendment two, sponsored by Councilmember Belge.'",
        "'speaker_4': 'Then we can have time to perfected before we get to our council meeting, which I believe would be on the 26th. Is that correct?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'But I felt the need to say this. I don't like to get in. You know, he I said you said this type of thing. And I think we blew an opportunity to all work on this together. But I'm going to let you know, I want everybody to hear this when I'm the sponsor of legislation and especially when'",
        "'speaker_4': 'it's in my district, I want to be consulted. Absolutely. And I don't want it to be said later that I had expressed a fundamental difference. So why consult with me any more? That's not appreciated. Thank you.'",
        "'speaker_0': 'Okay. I think we're ready to move to vote. I just want to say a few brief comments in closing on the substance of the amendment that's before us. I think what this amendment fundamentally does, if it passes, is it sets a policy direction that says on the question of removing busses from the tunnel, that that will happen'",
        "'speaker_0': 'in September of 2019, which is the same date that sound transit is scheduled today to remove busses from the tunnel anyway because of the expansion of light rail. Unless the the convention center project proponents by July 1st, 2018 have their permits in hand and by September 30th, 2018, give us notice that they're ready to take over the'",
        "'speaker_0': 'site in a way that they need the busses gone. The point of this is that the busses can be removed from the tunnel earlier. They can be removed from the tunnel by March of 2019 under this language. But what we don't want to see happen is the busses be removed from the tunnel and then the site sits'",
        "'speaker_0': 'there for months unused when it could be being used for the benefit of the traveling public. That is the big picture policy direction that we will be adopting. The changes that were described that are in Amendment S-3, that's not before us.'",
        "'speaker_0': 'There are some things and they are a number of things that might be I might support these ultimately, but I just hadn't seen them until today and hadn't had a chance to look at them. Those things that I had seen before today that I agreed with, that Councilmember Dombrowski proposed.'",
        "'speaker_0': 'I have tried to include in the Stryker because I think there are some good, good innovations in here that that that make it possible. We will have to have legal review of this before we take final action on all sides to make sure that it is implementable.'",
        "'speaker_0': 'But I believe it sets a course that we then can implement. Final comment I want to say is there's an issue that is kind of in the room but not in the documents, and that is the request that we have had from representatives of hotel motel workers to make sure that their interests are being considered as part'",
        "'speaker_0': 'of this sale. I understand there's some discussions going on right now outside of our process to try to address those. And I think it's important that we allow those to go on and not and not rush through this in a way that that forecloses that discussion.'",
        "'speaker_0': 'With that, I'm just going to go ahead now and call for a vote on an amendment as to as amended. Is this a voice vote?'",
        "'speaker_1': 'But what is this.'",
        "'speaker_0': 'We can do either? Okay. Would you like a voice vote on it or wrong? Ah, okay. Do you care, Councilmember? Domestic violence to voice vote. All those in favor of amendment as to as amendment please signify by saying I.'",
        "'speaker_0': 'I opposed.'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Okay. The motion carries our electorate. Okay. I have been asked for division. Okay. Councilmember Dombrowski, Councilmember Dunn, Councilmember Gossett, I.'",
        "'speaker_4': 'Councilmember Crowell's I.'",
        "'speaker_0': 'Councilmember Lambert I. Councilmember McDermott, High Councilmember of the Grove, Councilmember Yvonne Wright. Bauer No, Madam Chair. Hi, Madam Chair. The vote is 652 nos. Councilmembers Dombrowski and Councilmember If I'm right, they're voting no. And Councilmember Dunn excused. Okay, so at this point now.'",
        "'speaker_0': 'We still have some more work to do, but this is prepared to move to council in the normal course.'",
        "'speaker_2': 'Of the reproduction strike.'",
        "'speaker_0': 'Oh, I am so sorry. We have the final passage. Any words on final passage? Councilmember up the Grove.'",
        "'speaker_2': 'Thank you, Madam Chair. I want to start where you left off. One of the things I've thought a lot about during this discussion is who are the stakeholders? Is it just those who signed the agreements, or are there more people impacted?'",
        "'speaker_2': 'Obviously, with a proposal like this, the benefits are widespread, but there also can be adverse impacts, as is often the case. And so when I think about stakeholders, I also think about the obviously the transit riders, not just the transit agency.'",
        "'speaker_2': 'And I think that the approach in this Stryker is one that that I'm supportive of. But I also wanted to echo your comments. It is my understanding, too, that the men and women who work in the hotel industry and their representatives have met recently with the Washington State Convention Center to talk about how these costs and benefits'",
        "'speaker_2': 'are shared and ways in which the costs and benefits can be distributed in more equitable ways. And I don't know what the answer is. We do know that one of the largest economic beneficiaries is the hotel industry, and that's generally speaking, that's a good thing.'",
        "'speaker_2': 'But we also have employees who work in many of these hotels in Seattle who have been struggling, not only struggling economically, but struggling with their relationships with their employers. And I'm I think the Washington State Convention Center would be wise to engage more specifically in those conversations, both before we take full action, but also, I think as'",
        "'speaker_2': 'this hits the city of Seattle, I think that it's important to keep a broad view on this. You know, I support this because I believe that overall the economic benefits are a positive for our region. But I do think that those are important discussions that the convention center should take seriously and engage in specifics as as we'",
        "'speaker_2': 'continue to move through the process. And so I appreciate your comments, Madam Chair. I wanted to reiterate those.'",
        "'speaker_0': 'Thank you. Other comments? Okay. I think Councilmember DEMBOSKY.'",
        "'speaker_2': 'Thank you, Madam Chair. I'm hopeful that this will get into a form that eventually can be signed. I'll be voting no today, obviously. I think it'll it'll advance. I think there's generally consensus about the terms, but we're we're, in my view, risking a multi hundred million dollar project by continuing to impose a delay.'",
        "'speaker_2': 'Ironically, the language on your take control words compared to the language that was in mind could mean that the convention center boots us out of the tunnel sooner because my language required that they actually start work on the site.'",
        "'speaker_2': 'Your language has them take control and then we're gone. But that is what it is. And and I think that we'll eventually get it get it done. And I think this is a good public project. Sometimes people forget that the public the convention center is a public institution created by the King County Council, and that we confirm'",
        "'speaker_2': 'every member of the board of directors. And one of the people sitting on the board is the secretary of the King County Labor Council. And I was very pleased and proud to push the convention center behind the scene to get to a project labor agreement with the building and construction trades, because I think this is a good'",
        "'speaker_2': 'project for generations of jobs and we'll build that up. So I hope that we can get it done and I think that we've made some improvements here. But I hope that folks, as they negotiate, will actually quit negotiating with themselves and reach out to folks that have to sign the agreement and get something that's workable.'",
        "'speaker_2': 'And I trust that will occur. The executive will veto it and the party won't sign it. So more work to do. And I commend you and enjoy working with the folks who are on the other side. They're good folks who are smart folks who are trying to do the right thing.'",
        "'speaker_0': 'Okay. I think we're ready to vote. The the very last word I will give as the as the proponent of this, if if the maker of the motion will indulge me, is that I think we have all been trying very, very hard to balance a variety of public benefits.'",
        "'speaker_0': 'There are opportunities here. There are also impacts here. We all are attempting to do our best to represent the people that we are sent here to represent and to get the best deal possible for the residents of King County while supporting a project that can do a great deal of good for the residents of King County.'",
        "'speaker_0': 'And to the extent we have hit that balance today, I am pleased to the extent we need to do more to strike the right balance. I am open and with that I would urge your support and I think we're ready to call for a vote.'",
        "'speaker_0': 'Thank you, Madam Chair. Councilmember Dombrowski, Councilmember Dunn, Councilmember Gossett. Hi.'",
        "'speaker_4': 'Councilmember Colwell.'",
        "'speaker_0': 'Councilmember Lambert. Councilmember McDermott. All right. Councilmember of the Grove. Councilmember Bond right now. Madam Chair, I tried to go to seven days. Councilmember DEMBOSKY voting no and Councilmember Dunn excused. Okay, that counts. Mr. Hamacher.'",
        "'speaker_3': 'Just a very quick announcement, Madam Chair, just for everyone's recognition on the schedule, you have an advertised public hearing for this item scheduled for a week from today on the 19th. That's a state law requirement. The convention center proponents, however, have asked that the council delay this action until the 26th, so you'll see a advertised public hearing'",
        "'speaker_3': 'for the 19th. That's because we had to publish and get that out to the public. But if this is on a regular calendar, it would be up at council on the 26th.'",
        "'speaker_0': 'Does that mean that we will move the public hearing to the 26th so that a year can both happen on the same day? Or will we hold the public hearing on the 15th?'",
        "'speaker_3': 'I think you should hold the public hearing on the 19th. And if the chair desires, though, he can keep the public hearing open until the 26th if he wants, or he can close it on that day.'",
        "'speaker_0': 'We will leave that in the chairs. Good hands. Okay. Thanks you, everyone. This meeting is now.'"
    ]
}