{
    "Contract with University of Washington for COVID-19 Analysis.": [
        "'speaker_0': 'And with that will continue to. The second item on today's agenda is a motion requesting the executive contract with University of Washington to conduct a retrospective analysis of the effectiveness of actions taken by county leaders in the Health Department to limit the spread of the novel coronavirus.'",
        "'speaker_0': 'We were briefed on this item back in June, and I'm sure you remember it intimately by Sam Porter from Central South. This porter is here to give us a short overview and brief this on amendments. Ms.. Porter.'",
        "'speaker_1': 'Thank you, Mr. Chair. Sam Porter, Council Central Policy Staff documents for this item began on page 19 of your packet, and as the chair mentioned, since this was previously briefed in committee, our focus on the amendments and proposed motion 2020 0182 would request the Executive to contract with the University of Washington to conduct a retrospective analysis of'",
        "'speaker_1': 'the current coronavirus pandemic response in King County and transmit the report to council. On page 27 of your packet, you can see Amendment one. This would remove previous language stating that a report should be conducted with Public Health, the Institute for Health Metrics and Evaluation, the Gates Foundation and other organizations, and would add language stating that the'",
        "'speaker_1': 'contract should be made with the Evans School of Public Policy and Governance at the University of Washington. For graduate students to conduct an independent analysis to include but not be limited to the health, economic and social impacts of COVID 19 and the actions taken by King County leaders and Public Health, Seattle and King County to limit the'",
        "'speaker_1': 'spread of the virus. And this would be done using publicly available data and resources. The amendment states that the work should commence in January 2020, 2021 and that the executive can negotiate access to public health and other executive branch leaders in order to prioritize the ongoing pandemic response.'",
        "'speaker_1': 'The next amendment, amendment two is on page 29, and this would just change the due date for the report from June 30th of next year to July 31st of 2021. And the title amendment on page 31 of your packet would inform the title of the proposed motion to the revised scope of the analysis, as stated in Amendment'",
        "'speaker_1': 'one. We have current gill from the Office of the Executive and Sally Clark from the University of Washington on the line to answer any questions. And that concludes my remarks.'",
        "'speaker_0': 'Thank you. Questions of Ms.. Porter. Miss Carr, did you have any comments to make or are you simply simply willing to respond to any questions?'",
        "'speaker_1': 'You know, I'm actually pinch hitting for Professor Matt Stallworth from the Evans School of Public Affairs, and I'm happy to pass along some of that thoughts about how the student teams would approach the work. But given that this is your second briefing, I'm happy to also sit back and simply answer your questions.'",
        "'speaker_1': 'I think overall, we just want to thank Councilmember Dunn and for the and the Council on the Executive and Public Health for even considering this at this point. It's a great opportunity for the student teams.'",
        "'speaker_0': 'Great. See? No questions. Council member done.'",
        "'speaker_2': 'Is it on the table? Have I moved to get a date movement? Back in July, when we first heard it or not?'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'All right. Well, I'd like to move it, if I might. Before the committee, the whole.'",
        "'speaker_0': 'Council member has moved to give it do pass recommendation to ordinance 2020 182. Councilmember Dunn.'",
        "'speaker_2': 'Thank you, Mr. Chair. And then I'd like to move Amendment One.'",
        "'speaker_0': 'Amendment one is before us. Miss Porter has spoken to Amendment One. Are there further questions about Amendment One?'",
        "'speaker_2': 'Let me speak to it, if I might, please. When the when the pandemic began early on, when we were learning what was really happening in China and the first cases had come much to Europe as well and and to the West Coast of the United States.'",
        "'speaker_2': 'I spent a lot of time looking to try and find more information about the pandemic back in 1918. And it was surprising how little information there was. I'm sure many of you saw some of the data I was able to dig up to the National Geographic and others, but there just wasn't a lot of information, a clue'",
        "'speaker_2': '. There's going to be a lot more information about the pandemic of the Corona virus in 2019, 2020. But local information, local analysis sense of how we handle here in the Puget Sound, Iraqi County is going to be really important.'",
        "'speaker_2': 'It's not about saying, hey, we did it better than other cities, although I think we did, but that it will be a guidepost for future generations. Maybe our grandchildren will have another pandemic. So we worked with the executives office and others in the public health arena to come up with a way that we could do this without'",
        "'speaker_2': 'getting in the way of our existing pandemic responses. And so I think we've fallen on. The Evans School at the University of Washington is sort of uniquely positioned with their expertize, along with the access to one of the best research universities in the United States, the medical field and the county and other public health information to do'",
        "'speaker_2': 'it. Sally Clark, always great to see you. Appreciate the university's willingness to do this as well. And we'd like to partner in this, I think gets it out of the way of the executives response. It still gives us a really good work product.'",
        "'speaker_2': 'So that's what the amendment is. I hope my colleagues can support this and urge your support.'",
        "'speaker_1': 'Further discussion on coal wells.'",
        "'speaker_0': 'Amendment one. Councilmember Cole Wells.'",
        "'speaker_1': 'Thank you, Mr. Chair. And maybe it would've been better to ask this earlier, and I'm not sure that it was mentioned. It's done. The estimated cost for this.'",
        "'speaker_2': 'Staff. Do you want to take that on? I know that we were going to use existing resources in the Emergency Management Department. Has there been any additional cost with the Evans School besides the contract?'",
        "'speaker_1': 'Referring to Curran in the office to help answer that.'",
        "'speaker_2': 'They scowls, remember? I do not know if we have a cost on this right now.'",
        "'speaker_1': 'Perhaps we could try to narrow that down before we vote on it at full council. Just an I'm.'",
        "'speaker_2': 'Yeah. We'll get you we'll get you all that information. The last conversation I had was the emergency department. Emergency Services had the money in their budget and that was going to come from that point for the that the study unless something has changed that's my belief.'",
        "'speaker_2': 'But Councilmember, I'll get that information to you before a vote of full council.'",
        "'speaker_1': 'Thank you. Especially because we'll have completed our being on budget.'",
        "'speaker_0': 'Yeah, I just. Just. Just so.'",
        "'speaker_2': 'You know, the cost and I just got a text as you were speaking is between ten and $15,000. 10%. It's a small.'",
        "'speaker_1': 'Okay. Okay. Thank you.'",
        "'speaker_0': 'Amendment one is before us. See no further discussion on this. In favor of Amendment one, please signify by saying I find I oppose nay. Guys have. Amendment one is adopted. Councilmember Dunn.'",
        "'speaker_2': 'I move amendment to.'",
        "'speaker_0': 'Amendment two as before as Councilmember Dunn.'",
        "'speaker_2': 'And this changes the deadline to late July of next summer, allows the winter and spring quarters for the graduate students to work on this and gives them a chance to to complete it right around their graduation in in.'",
        "'speaker_0': 'Next year. Garcia. Well.'",
        "'speaker_2': 'I do. And it would be really fun if one of the committees and subcommittees that's really happy to do this would would hear the final report. I think it would be very important to, you know, not only to process all that work, to publicize it, agreed for the students as well.'",
        "'speaker_2': 'We would get some of them here and well here, meaning the county courthouse hopefully by then and can showcase what they've learned and what we can learn from it.'",
        "'speaker_0': 'Thank you. Say no further discussion. All those in favor of amendment to please signify by saying i. I opposed nay. The ayes have it. The council member done the title amendment on page 31 of our packets.'",
        "'speaker_2': 'Two. One.'",
        "'speaker_0': 'Q one is before a scene of discussion. All those in favor, please say I am opposed. Nay. The ayes have it. The title amendment is adopted. We have ordinance 2020 182 as amended before us. Further discussion.'",
        "'speaker_2': 'Urge your support, Mr. Chairman.'",
        "'speaker_0': 'I'll consider it. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Gallucci. Councilmember Powell, due to events, I can't remember how I. Council Member Tim Baffsky. Both I Council member.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council member done Bosnian Council Member Coles I Council Member Calwell Spokes II Council Member Lambert I Council Member Lambert Woodside Council Member of the Growth. Councilmember Arturo. Councilmember Bond right there. Councilmember Bong right there.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'I was on Larry King Live as well. Some members only high council members on line votes. I. Mr. chair.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Chair votes. I. Mr. chair, the vote is eight i's. Council member of the group excused.'"
    ],
    "Support for Unbanked Money Transfer Operators and Immigrant Communities.": [
        "'speaker_0': 'Thank you very much. By your vote, we've given a do pass recommendation to where or does 2020 182. And we will unless the objection, we will put that on the consent agenda at full council. Our last item today is a motion related to the unbanked.'",
        "'speaker_0': 'Money transfer operators. Matt Nicholson, the council director of government relations, is here to provide the staff report. Mr. Nicholson, the screen is yours.'",
        "'speaker_2': 'Thank you, Mr. Chairman. Counsel, can you hear me?'",
        "'speaker_0': 'Yes, we can.'",
        "'speaker_2': 'Great. Thank you. Mack Nicholson, Director Government Relations for the Council Here to brief proposed motion 20202086. The motion itself is relatively straightforward. The subject of the motion is a little bit more complex. The staff report for this is on page 33 of your packet.'",
        "'speaker_2': 'The motion itself does three things expresses council's support for the East African community and their desires to support their loved ones. Affirms the right for money transfer operators to engage in lawful commerce in a safe manner, and calls on the state legislature to study the issue of bank derisking and find a solution that promotes financial inclusion and'",
        "'speaker_2': 'public safety. As far as the background, the crux of this issue really is a phenomenon known as bank derisking. And bank derisking happens when financial institutions or banks terminate or restrict business relationships with clients or categories of clients to avoid rather than manage risk in the context of the motion before you.'",
        "'speaker_2': 'Banks have been de-risking or refusing to offer their services to money transfer operators, money transfer operators, or any type of business that facilitate the cross-border transfers of funds using it or their internal system or relying on international banking networks.'",
        "'speaker_2': 'Money transfer operators are commonly used by immigrant populations who have relatively low rates of financial participation to send money to family who remain in their country of origin. These type of transactions are called remittances. Western Union might be the best known money transfer operator, but there are certainly many others.'",
        "'speaker_2': 'As far as why banks are de-risking money transfer operators, generally, it's because banks make the business decision that the cost of compliance with national and international regulatory systems governing the cross-border movement of money, along with the risks and penalties for for noncompliance, outweigh the benefit of providing these services.'",
        "'speaker_2': 'So they start providing them rather than carry that risk. And that's that de-risking concept. In light of de-risking money, transfer operators have had to find other ways to send money overseas. As you heard in some of the testimony earlier today, it's become kind of a cash transaction and that the money transfer operators that remain in business are'",
        "'speaker_2': 'transporting cash, which has turned into a public safety issue as well. So to bring it all full circle, the motion calls on committees of jurisdiction in the state House and the state Senate to study the issue of bank derisking and to find a solution that promotes financial inclusion and public safety for these immigrant communities in King County'",
        "'speaker_2': 'in the state. And I'm happy to answer any questions.'",
        "'speaker_0': 'Questions of Mr. Nicholson. Council member of the Grove. I. We'll record your vote for the previous item. Ordinance 2020 182 Council member out the group. Did you want to speak to motion to the motion regarding item bank money transfer operators?'",
        "'speaker_0': 'Would somebody be willing to make a motion?'",
        "'speaker_2': 'Mr. Chair, because to preserve Grove isn't there. I'll go ahead and move it.'",
        "'speaker_0': 'Thank you. Councilmember Dunn is moving that we give a do pass recommendation to motion 2020 286 as Mr. Nicholson is that Mr. Nicholson has just briefed Jason. Discussion. Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I am concerned also that in a money transfer that I have been making for over a decade, all of a sudden all kinds of new things are happening. And I'm wondering what's happening, why? Why this is necessary.'",
        "'speaker_1': 'And recently, the the bank overseas got my money, but they wouldn't give it to the person unless they knew my relationship to the person. What is going on where that kind of information is so necessary? We are aware of what's going on.'",
        "'speaker_0': 'Is that something you can respond to, Mr. Nicholson? I can take a crack.'",
        "'speaker_2': 'We're going to quickly get out of my expertize. But in reviewing sort of some of the reports and what's happening is going to be a focus on anti-money laundering and making sure that funds are not ending up for terrorism funding purposes.'",
        "'speaker_2': 'And in that process, I think there's just more sort of paperwork, more disclosure requirements, both nationally and internationally. And so I think these banks are feeling more of an obligation to do more due diligence to make sure that the money that's flowing through their systems doesn't end up being used for sort of unauthorized purposes.'",
        "'speaker_2': 'And that might be what kind of what you're noticing on a on a a transactional level.'",
        "'speaker_1': 'Now and a small amount that small but not huge amounts of money. I was really surprised by the amount of information. So thank you.'",
        "'speaker_0': 'Further discussion. My personal privilege. I'm pleased to be your client. If Kaphar.'",
        "'speaker_2': 'Or Lambert wants to send.'",
        "'speaker_0': 'Any money to me, I will not ask any questions.'",
        "'speaker_1': 'But I would. And my husband would.'",
        "'speaker_0': 'Okay. You're all out of order. A council member at the Grove. Thank you, Mr. Chairman. I apologize. When you called on me a moment ago, I have taken a personal phone call from. From family and was distracted. Would it be appropriate for me to make some remarks on this, or would you like me to wait until final'",
        "'speaker_0': 'passage where we have it before us now? So this would be most of and I'm not aware of any amendment, so it would be most appropriate now. Okay. Thank you, Mr. Chair. I look at this. I think nothing is more important than family, regardless of our political party or race or national origin.'",
        "'speaker_0': 'The one thing that unites every human being is this the love we feel for family. And there's no more noble instinct than to care for a child or an aging parent, you know, to support them, to care for them, give them a better life.'",
        "'speaker_0': 'And the motion before us is about helping people care for their families. And specifically, it's about helping our constituents who are immigrants and refugees from East Africa overcome barriers so that they can care for their families back in Africa.'",
        "'speaker_0': 'Like many of you I've heard from community members in my case in South Kent County, who work hard often to jobs to earn money to support not only themselves, but their family members who are still in Africa. And they often, however, face a barrier in sending money to those relatives around Africa.'",
        "'speaker_0': 'And that barrier is called derisking. And that's, as was noted, the process banks go through of either terminating or restricting the business relationships of account holders that they deem to be, quote unquote, high risk. And this was something that began in the U.S. after the 911 terrorist attacks.'",
        "'speaker_0': 'And it makes sense to have good procedures in place. But unfortunately, many of the account holders and the local East African and Muslim communities believe financial institutions have closed their accounts not due to legitimate risk, but instead due to discrimination.'",
        "'speaker_0': 'And King County has one of the largest African communities in the United States. It also creates a public safety issue because many of these small business owners who aren't able to engage in the banking activity end up storing large amounts of cash on their on their premises, making them vulnerable to attacks and robberies.'",
        "'speaker_0': 'So my interest is in being able to promote financial inclusion so that people can support their families as well as protect public safety. And it's a gentle motion. It directs our government relations team to reach out to the state of Washington, explore the actions they can take to promote that kind of inclusion, or for all King County'",
        "'speaker_0': 'residents and members. So, too, for a lot of the folks you represent, this is a really important measure, and I hope you'll give it fair consideration. Further discussion, just briefly, Mr. Chair, Dombroski Cast Member, Dan Basket Davis Chair I just wanted to take this moment to highlight a strong and growing Eritrean community in one of the strongest'",
        "'speaker_0': 'parts of my district, Lake City, where we have a strong faith community and a community center. And this is an issue that I also understand is important to them, and I'm happy to sign on as a co-sponsor today for the reasons outlined by Councilmember Up the Grove, the prime sponsor, in his remarks.'",
        "'speaker_0': 'Thank you. Thank you. For the discussion. Seeing none. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member WG High Council member belted Schubert. City Council Member Dombrowski.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council Member Dombrowski both I Council member done. I remember done both i council member Colon. I Council Member Commons both. I Council member Lander. I Council Member Lambert Fox. I Council member.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council member up the both on Council Member upon rank power.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council member upon rank power votes. I Council Members are high.'",
        "'speaker_0': 'Ranking.'",
        "'speaker_1': 'Council members on line votes. I. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is 990 knows.'",
        "'speaker_0': 'By your vote we've given a do pass recommendation to motion 2020 286 and investors objection. We will place that on the consent agenda for for council. Sordid and having. Madam Clerk, I want to be assured that you recorded Councilmember up to vote on motion on Ordinance 2020 182.'"
    ]
}