{
    "Assessment Report for Best Starts for Kids Levy Renewal.": [
        "'speaker_0': 'conversation we realize that we don't have final amendments in place. With that, Mr. Williams and Mr. Maslin asking the line, Is yours? Thank you, Mr. Chair.'",
        "'speaker_4': 'Hillary Williams, Council Policy Staff. The staff report with this item begins on page 11 of your agenda packet. I propose moves in 2020. 200 would request a report from the Executive to inform Council deliberations on possible renewal of the best charge for kids.'",
        "'speaker_4': 'Levy. As you all know, Best Start for Kids is a levy funded, prevention oriented regional plan that is aimed at supporting the healthy development of children and youth, family and communities across King County. The motion asks the executive to transmit a report that assesses the effectiveness of current levy strategies and programs and meeting the goals of the'",
        "'speaker_4': 'levy. And that analyzes and makes recommendations on various policy considerations, including how a renewed levy would benefit the entire region while targeting resources to those most in need. This report would be due by September 30th, 2020, and I will now provide a little bit of background on the specifics of the levy.'",
        "'speaker_4': 'In November 2015, King County voters approved the current best start for Kids Levy, which is a six year property tax levied at a rate of 14.14. Cents per $1,000 of assessed value in 2016, with an increase of up to 3% for each of the five subsequent years of the levy.'",
        "'speaker_4': 'As you stated earlier, Mr. Chair, this levy is up at the end of next year, and based on recent revenue forecast, the levy is anticipated to generate a total of approximately $404.5 million in revenues over the life of Levy.'",
        "'speaker_4': 'The Bank Levy Ordinance, which is ordinance 18088, directed that out of the first year levy proceeds, $19 million be set aside to fund the Youth and Family Homelessness Prevention Initiative, as well as the amounts that were necessary to pay for election costs related to the lift.'",
        "'speaker_4': 'All remaining levy proceeds are to be disbursed as follows 50% for the invest early allocation, which focuses on children and families ages 0 to 5, where they are to support healthy child development and family well-being. 35% for the sustained sustained to gain allocation, which focuses on supporting positive development for children and young adults ages 5 to 24'",
        "'speaker_4': 'as they progressed into into adulthood, and then 10% for the Communities Married Matters allocation, which focuses on strategies to create safe and healthy communities. Building on a partnership between the county and the Seattle Foundation on Communities of Opportunity, which is based on the latest research regarding the impact of placed on individual and population health and wellbeing outcomes'",
        "'speaker_4': '. This includes local community supports and building their own capacity to create positive change. And finally, there's a 5% allocation for the outcomes focused and data driven part of the levy. And this supports evaluation, data collection and improving the delivery of services and programs under the.'",
        "'speaker_4': 'Let's quickly talk about levy oversight. The BSC levy is overseen by the Children and Youth Advisory Board, which carries dual responsibilities, ties to the best stance for kids Levy and the Youth Action Plan, as well as the communities of Opportunity Best for Kids Advisory Board.'",
        "'speaker_4': 'Which is the advisory body for the communities of opportunity portion of the network. These groups play an integral role in monitoring progress of service and program implementation, while partnering with the county to ensure that these investments are consistent with levy requirements are effective and transparent to the public.'",
        "'speaker_4': 'I am now going to cover the analysis section of the staff report, which begins at the bottom of page 14 of your packet. Again, this motion would request the report from the Executive to inform Council of possible renewal of the best stance for food levy.'",
        "'speaker_4': 'More specifically, the motion ask that the Executive transmit this report to be developed in consultation with stakeholders. That includes one an assessment of the effectiveness of the current strategies and program in achieving the current levy funding goals, including in an analysis of the impact of investments in advancing equity and social justice and changing systems and policies of'",
        "'speaker_4': 'racial and other forms of oppression to. An analysis and recommendations on the following potential changes to the levees three Primary Goals and existing and existing strategies and whether a Renew Levee should incorporate any new goals in our strategy.'",
        "'speaker_4': 'How a renewed levee would align and coordinate with children and family. Strategic Task Force Recommendations. The Veterans, Seniors and Human Services Levy. The Mental Illness and drug dependency on the Puget Sound Taxpayer Accountability Account as well as other funding streams.'",
        "'speaker_4': 'How a renew levee would benefit the entire region while targeting resources to those most in need. And final point there is that the assessment report would look at whether a renewed levee should retain or revise the current oversight structure or the representation of the Children Youth Advisory Board.'",
        "'speaker_4': 'And finally, the member should have received a recent email that I sent out with an attached conceptual, conceptual, striking amendment. I'd like to note that staff is currently working with Council member about Dempsey's office to finalize a striking amendment to be offered at next week's council meeting.'",
        "'speaker_4': 'I will now go over the conceptual strike if there are any questions at this point.'",
        "'speaker_0': 'I sense for Mr. Telhami before moving before the addressing the concept of a thinker comes number validity.'",
        "'speaker_2': 'I wanted to say a word.'",
        "'speaker_0': 'Please.'",
        "'speaker_2': 'Okay. Thank you. The artillery and is doing a great job with the briefing. I just wanted to give a brief little bit of additional background, if I could. I wanted to thank Department of Community and Human Services. They initiated this request for the motion to do an assessment because it is always a good first step to look'",
        "'speaker_2': 'back at how the Levy programs have performed. To help us then develop a base of information to create a program with changes as needed to to be more effective going forward. Assuming we ask the voters to continue this program, which I am assuming that we will.'",
        "'speaker_2': 'I will have a few more words to say after the next part, but I wanted to just briefly share that in developing this striking amendment, we did reach out to all of the council officers and we got feedback from a number of them.'",
        "'speaker_2': 'We tried to include I think we include all we include all but just one request. And I hope that that one was minor and not in not too upsetting to the member who asked for it. And we're still working a little bit on language just to make sure that we're really clear.'",
        "'speaker_2': 'And I'm having one additional conversation with DHS on this. Now, there's a really clear understanding of exactly what the report will contain so that it sets us off on a really good path to be talking about potential changes to the program going forward.'",
        "'speaker_2': 'I just wanted to set that context. And then because of the timing, I'll say this in the middle, but I'll say it again at the end. If members here today hearing this, looking at it, think, I really wish we would also ask about something else.'",
        "'speaker_2': 'Please, please, please bring that up today so that we can make any final changes within the next 24 hours, because we do have a three day weekend coming up and this is up for a final vote at next week's council meeting.'",
        "'speaker_2': 'So thank you for letting me jump in there and just add a little bit to what has already been a very thorough staff report. And I look forward to hearing the conceptual strike or briefing.'",
        "'speaker_0': 'Thank you, Mr. Williams.'",
        "'speaker_4': 'Thank you, Mr. Chair. So I am currently on the conceptual striker document. It is a list of about seven things to go through briefly.'",
        "'speaker_0': 'Mr. Williams, if I may, just to direct members. Mr. Williams was not kidding when he said he had recently sent this. It was after the meeting started on 20:05 p.m. today. Met email from all members from Hilary Williams with the attachment he's working through now.'",
        "'speaker_4': 'Is there. So I would just start with number one and go down the list. So the first thing that the amendment would do is add language directly to direct the executive to develop the assessment report in consultation with the Regional Policy Committee.'",
        "'speaker_4': 'Two. It would provide more specificity about what information is being requested to be included in the assessment regarding the goals, strategies and programs in the first years of the escape. It would also require the report to include an analysis of levy proceeds used to fund technical assistance and capacity building.'",
        "'speaker_4': 'The amendment would require the report to include the rationale for any unspent or reallocated levy funds. Iraq's language ban directs the executive to explore goals and strategies that could be incorporated in an increased or expanded level. The ads efforts focused on equality and social justice, including racial justice, to the list of new or revised goals or strategies'",
        "'speaker_4': 'that should be considered in a new, increased or expanded level. And finally, the amendment would require that the analysis of investments by geographic area includes zip code level data of person served. So that's currently what we're working on and refining at the moment.'",
        "'speaker_4': 'And. Mr. Chair, that concludes my remarks for this item.'",
        "'speaker_0': 'Thank you, colleagues. Councilmember Lambert, you're unmuted. There you place. Councilmember Lambert, we can hear you. You don't seem to me. You don't seem to be muted. Now you're muted. Now you're not.'",
        "'speaker_2': 'Councilmember Lambert, could your device be muted? You're unmuted on.'",
        "'speaker_1': 'Zoom.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Can some Mr. Chair sentiment be that I my volume is down on my laptop. Maybe she could check that.'",
        "'speaker_0': 'Oh. Councilor and Council Member Lambert. I don't know if it would help if you logged out like back in. I mean, now you have your colleagues offering I.T. support. None of us, right? Professionals catch our attention and will help recall your involvement.'",
        "'speaker_0': 'Council Member Demovsky.'",
        "'speaker_3': 'Thank you, Mr. Chair. A couple of thoughts to share here. I wondered. I recall that we built in some reporting out and results kind of language in the original ordinance that was adopted by the voters in the levy.'",
        "'speaker_3': 'And I think it would be worthwhile to circle back and look at that language when we were advocating for it in the community, including particularly, I recall, before the Municipal League, they were particularly interested in how we would demonstrate the efficacy of the investments.'",
        "'speaker_3': 'And it can be kind of hard on some of these macro community investments to show the needles to move. But there has been some reporting during the course of the levee with the with the annual report that's done that.'",
        "'speaker_3': 'So I think the reporting on it has been been pretty good. I would hope that we could include a reference, as we did in the original legislation, to the goals set forth in the adopted policy by the county for youth and young adults and the Youth Action Plan, and making sure that that continues to be a guiding'",
        "'speaker_3': 'light. My office has had some early discussions with our youth Czarina, as I call her, who I see is on the line Sheila campus Danny about eventually updating that to reflect and a ten year anniversary the basis of where we ought to be on policy there.'",
        "'speaker_3': 'And I think that's a good idea. But I think it's good to have a policy document that guides us. And I would also be interested in one of the things that I was pretty happy to work on was making sure we included a bucket of money, which I think is 35% for youth and young adult investments.'",
        "'speaker_3': 'We had to invest early, right, and then sustain the game was the language when the concept was first advanced. It was really an early childhood program and we broadened the investments and I think those have been, in my observation, very well received.'",
        "'speaker_3': 'I do think that the investing early from a. Science standpoint is good and you get great results there. But I know that those dollars that have supported young people during critical years of development and growth and formation have just been really critical to a lot of organizations.'",
        "'speaker_3': 'And I hope that we can continue those investments in a renewed level. So there's some some thoughts in terms of the reporting out. Do we have a put in the form of a question that maybe we would like analyze?'",
        "'speaker_3': 'Do we have the right balance in the bucket? 5035. And then the balance for measurement and administration. Thank you.'",
        "'speaker_0': 'And you.'",
        "'speaker_1': 'This is.'",
        "'speaker_0': 'Here comes my plumber.'",
        "'speaker_2': 'I have had computer problems for the last half hour, so thank you to the kids for your.'",
        "'speaker_1': 'Assistance.'",
        "'speaker_2': 'In dealing with this. Luckily, I have the computers in my house, so they're running back and forth to figure out how to get it on. Anyway, I have two questions on this on the best for Kids. One of the things I noticed in there is it talked about second and fourth graders, but it didn't say anything about'",
        "'speaker_2': 'my grade as being a pivotal year. Fourth grade is the year that your teachers are most likely to be able to predict who is going to be getting into trouble in later lives, which is an unfortunate thing. But ninth grade is when you can tell whether somebody is probably going to drop out of school or not.'",
        "'speaker_2': 'So there was a study done a couple of years ago by.'",
        "'speaker_0': 'Dr..'",
        "'speaker_2': 'Gentry reinvesting in youth, and that report was very well done, had some superintendents or fabulous on the committee, and I think that's a report that we should make available to the people doing this research. And then the second thing is, when we started the search for kids, if I remember correctly, there were.'",
        "'speaker_1': 'Several boards that were huge. Could you tell.'",
        "'speaker_2': 'Me how many boards would be support boards and how many members to those boards at.'",
        "'speaker_4': 'This point? Councilmember Leppert The only boards that I am aware of are the ones that I mentioned during my staff report. And those are the. Once again, the Children and Youth Advisory Board and the. Communities of opportunity based on expertize advisory board.'",
        "'speaker_4': 'I would have to defer to executive staff on the line or any other of the boards that are that that may be applied here.'",
        "'speaker_2': 'If she ever heard. Good afternoon, Councilman. Councilmember Lambert, we do have the two governing groups with.'",
        "'speaker_1': 'The Children Youth.'",
        "'speaker_2': 'Advisory Board is up to 40 members. I believe we're somewhere around 34, 35 at this point. We've greatly increased our membership of youth on that board. And as all of the members come before you all to confirm, you've seen the caliber of candidates we have.'",
        "'speaker_2': 'But right now, it is about 35 or 36, and I'm not sure how many are on the committees of Opportunity Board, but those are the two.'",
        "'speaker_1': 'That function right now. In point.'",
        "'speaker_2': 'Of 40. It's pretty, pretty big. So. Oh that I was just concerned about. Well we have to have those meetings. We better to do them. Other than actually, yes, it is a big board. They operate by subcommittee a lot.'",
        "'speaker_1': 'So a lot of the.'",
        "'speaker_2': 'Work gets done in smaller groups and then they report and tackled larger issues. A large group.'",
        "'speaker_0': 'Alex.'",
        "'speaker_3': 'Dombrowski.'",
        "'speaker_0': 'Councilmember Dombrowski.'",
        "'speaker_3': 'Thank you, sir, for the second round. Sheila, great to see you. With the September deadline, I know we are leading up to kind of a renewal program, but when you have enough time to do a thorough report given the to kind of put a deadline in here, how does that schedule work for the department?'",
        "'speaker_2': 'Thank you so much for that question. We certainly have lots and lots of things that we are managing. I think that a September 30th deadline is one that we can make. Mostly because we've started to do the dig in part of this and working with all of our staff on how is your strategy going?'",
        "'speaker_2': 'What's been happening with it? So we've started that deep work. What we're going to be needing to do in the next couple of months is all the writing and the analyzing of all of that. But the work has started to be able to produce the report.'",
        "'speaker_0': 'Councilmember Balducci.'",
        "'speaker_2': 'Thank you. I've been listening to the comments with an ear to.'",
        "'speaker_1': 'What.'",
        "'speaker_2': 'Might be added to a striking amendment that we will work up for next Tuesday. And I heard some good ideas about things to focus on as we're building the program. And I heard Councilmember Lambert say that it would be a good idea to make sure that the folks working on the report were familiar with the Reinvesting in'",
        "'speaker_2': 'Youth study, which I think if it's in English, probably they are, but we will make sure that that's easy to do. I actually I would just want to check with my colleagues. I heard one suggestion that I would interpret as a change for the Stryker, and that is to make sure we ask the question as part of'",
        "'speaker_2': 'the analysis whether the balance is right between the different buckets or a large, you know, high level programmatic divisions in BSC. So if anybody thinks I missed something, please say so, because that's that's what I will take back as a potential add to the Stryker.'",
        "'speaker_2': 'And we will work up a final version as quickly as we can.'",
        "'speaker_0': 'Councilmember Balducci. I did not hear them speaking. So we will expect they will forever hold their peace.'",
        "'speaker_2': 'I don't expect that. But I think I've done the best job I can collecting one additional thing for the conceptual striker list, and then we'll work on making sure that's all in language. We've got a pretty good draft underway.'",
        "'speaker_2': 'Miranda and Tillery have been working on it, but we'll finish it up quickly and circulate it. Thank you very much, everyone.'",
        "'speaker_0': 'Thank you. Councilmember Valdes, you're the prime sponsor on this piece of legislation. Would it be your wish that we move it out without recommendation of all council that we hold in committee and expect to relieve committee of our counsel next week?'",
        "'speaker_1': 'I do not have a strong.'",
        "'speaker_2': 'Preference, but I suppose it would show commitment to move without without recommendation, I mean, and at least the commitment of getting it to council. So that would be fine with me. And I would I would so move.'",
        "'speaker_0': 'Councilmember She has moved. We move our motion 2020 202 for council without recommendation and again highlighting our discussion today about a striking amendment that would be prepared and offered to council next week.'",
        "'speaker_3': 'Councilman Romanski This is a procedural question, Mr. Chairman. I'm a little confused on the explanation regarding the relationship of the Regional Policy Committee. Was this a non-mandatory referral or or how is it that we're just not getting their input?'",
        "'speaker_0': 'It was another mandatory dual referral.'",
        "'speaker_3': 'There was not a corridor for all.'",
        "'speaker_0': 'Correct.'",
        "'speaker_3': 'But that's all I needed to understand. Thank you.'",
        "'speaker_0': 'And then in the council member building, as you just mentioned, I also understand that in the timeline for the report, there's a as you already asked the department to make sure they have time to do it, not to delay the formal request for the report.'",
        "'speaker_0': 'Councilmember Bell, anything further?'",
        "'speaker_2': 'Briefly. And I may be speaking for Councilmember Von Right, but a little bit here. But as chair of the IPC, I understand that he did put out a request to members of the IPC about tell them to if they had any input upfront that they should feel free to share that.'",
        "'speaker_2': 'And I actually did receive one piece of feedback from a member of the IPC, and I included that in the Striker Amendment list. I think that. Yeah. You know, again, it's a motion. It's a request for a report.'",
        "'speaker_2': 'Not a not an ordinance requiring a report. And if anything comes out, we have an RPG meeting coming up this week. If anything comes out of that, that is important. I will certainly join my colleagues in asking TCHC to make sure that they look at things that are important to our city partners, and I believe that they'",
        "'speaker_2': 'will be open to doing that if they can. So it's it's a sort of a mushy answer, but but we will do our very best to make sure we include feedback from the PC in our requests around this report.'",
        "'speaker_3': 'I thank you as chair and customer about the chamber, as I was truly just unsure of the process or the procedural posture of it. And I obviously when we go to advance the ordinance to put it on the ballot next year, that would be also the dual mandatory through our if it's on their work plan.'",
        "'speaker_0': 'So I'm hearing no more discussion. We have more than 20, 20, 200 artists advancing to full council without recommendation. So someone else seemed to be recognized. No. No. Ask the court to please call the.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Barghouti, I Council member BANDUCCI. But I. Council Member Dombrowski, i. Councilmember Dombrowski, outside councilmember dunn.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'Councilmember dunn, go to councilman caldwell's i. Councilmember Caldwell spoke to councilmember lambert. Councilmember lambert gonzales. I am up the ground. I councilmember of the ground but i councilmember of honor. I council member upon break thereabouts i council members on life.'",
        "'speaker_1': 'I council members all my votes i. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is 19 to announce.'"
    ],
    "Charter Amendment on Disposition of Real Property for Affordable Housing.": [
        "'speaker_0': 'By your vote we have moved advanced motion 2020 202 for Council without recommendation we will expedite. So it is on the agenda for next Tuesday's council meeting. Thank you, everyone. That brings us to item seven proposed ordinance 2020 203, which would place on the November ballot a charter amendment to allow the county to sell some properties for'",
        "'speaker_0': 'less than fair market value, provide for affordable housing. Mary Brennan from the council's policy staff will present a staff report and then we'll hear from Charter Review Commissioner Michael Harrison. Some colleagues please note that each of the charter after each charter amendment staff and there are presentation slides from the Charter Review Commission members in the meeting packet'",
        "'speaker_0': 'without Mary.'",
        "'speaker_2': 'Thank you, Mr. Chair. For the record, this is Mary Burge, and I'm from the council staff. And the materials for this item begin on page 23 of the committee packet. As you noted, Mr. Chair, proposed ordinance 2020 0203 would propose an amendment to the Charter to allow the transfer, sale or lease of county metropolitan functions surplus property'",
        "'speaker_2': 'at less than fair market value for affordable housing. As you noted, this is one of the 11 charter amendments recommended by the King County Charter Review Commission. And just for timing. If you wish to place this charter amendment on the November 3rd ballot, the last regular council meeting date for adoption is July 21st.'",
        "'speaker_2': 'So moving on, just to provide some context on this issue, if you'll jump ahead to page 25 of the staff report, because of the importance and need for affordable housing in the county, the King County Code has a process for dedicating county owned surplus property for housing.'",
        "'speaker_2': 'In fact, it requires that if a county agency declares property surplus, the agency must first determine whether that property is needed for a different county agency, for essential government services, and if not, whether it is suitable for affordable housing.'",
        "'speaker_2': 'If that property is suitable for affordable housing, then the code allows that it can be leased or sold for less than fair market value. That said, as a number of restrictions on properties that cannot be used in this way either because they're not suitable for affordable housing, because they're outside the urban growth area or not zoned residential'",
        "'speaker_2': 'or have other issues, or because of the funding source that was used to purchase the property, or specifically for properties that are called out in section 2310 ten of the King County May Charter. And if you'll turn to page 26 of the staff report, that section of the charter deals with functions.'",
        "'speaker_2': 'Properties that are owned by what are called metropolitan functions of the county. Those functions are defined in state law. And you'll see a list on the top of page 26 of the packet as being a number of services that can provide for populous areas of the state a way of obtaining essential services.'",
        "'speaker_2': 'Those include any of the following of water pollution abatement, water supply, public transportation, garbage disposal, parks and parkways and metropolitan comprehensive planning. Now, the two we typically think of in King County as being metropolitan functions are those that were once part of the independent municipality of Metropolitan Seattle, which was created by King County voters in 1958.'",
        "'speaker_2': 'Voters created that entity to manage wastewater treatment. And then in 1972, added public transit. The independent municipality of Metropolitan Seattle functioned until 1994, when its functions were assumed into King County under a state law that allows for metropolitan functions to be operated by county governments.'",
        "'speaker_2': 'In anticipation of King County, Samsung's assumption of these functions. In 1992, King County voters approved a charter amendment that did a number of things. First, it expanded what was then a nine member, King County Council, into a 13 member Metropolitan King County Council.'",
        "'speaker_2': 'It created the three regional committees, regional policy, transit and Water Quality, and it added a section to the charter. The section 2230, 1010 that I mentioned earlier and that you can see cited on page 26 of the staff report that specifically notes that metropolitan functions that are performed by the county must be operated as distinct functional units'",
        "'speaker_2': ', and specifically that any revenues or property received for those functions cannot be used for any other purpose. But for that function. What that means specifically is that properties owned for the use of metropolitan functions operated by the county cannot follow the code provisions for being transferred or sold or leased for less than fair market value for affordable'",
        "'speaker_2': 'housing. That then takes us to 2018, an action by the state led by the state legislature, which will see described on page 27 of the packet. During the 2018 state legislative session, the Legislature passed a bill to promote the use of surplus public property for affordable housing.'",
        "'speaker_2': 'And while it had a number of exclusions of types of properties that could not be used in this way, it did specifically allow for the transfer or sale at less than fair market value for properties held by enterprise funds regardless of the primary purpose or function of the agency holding the property.'",
        "'speaker_2': 'Following the passage of this law last year, the Charter Review Commission proposed that that relevant section of the charter be amended to add in the ability to transfer, sell or lease these enterprise fund metropolitan function properties if surplus to be used for affordable housing.'",
        "'speaker_2': 'You can see at the bottom of page 27 the relevant charter section again and then at the top of page 28. In underlined the sentence that the Charter Review Commission has recommended be added, which would state to the extent not otherwise prohibited by law.'",
        "'speaker_2': 'This section shall not preclude the county from leasing, selling or conveying the properties at less than fair market value for affordable housing purposes. So if the Council were to adopt this ordinance and place this charter amendment before the voters, what it would do is not require, but rather allow that properties owned by agencies operating metropolitan functions could'",
        "'speaker_2': 'make that property available for less than fair market value for affordable housing. Now, what would that mean? You'll see starting on page 28 of the staff report, a number of potential implications, many of which were discussed by the Charter Review Commission during the course of their work last year.'",
        "'speaker_2': 'First, the notion that some of these properties may have been designed for or purchased for capital projects or to, if not actually be used for capital projects to have the proceeds fund capital projects, which could have implications next that there would obviously need to be careful inter-governmental accounting to account for any transfer or sale of a metropolitan'",
        "'speaker_2': 'function piece of property. Third, the notion of best use of funds. The committee asked whether it is always the best use of funds to sell a piece of county property at less than the fair market value, rather than to simply sell the property for fair market value and use the funds to develop affordable housing elsewhere.'",
        "'speaker_2': 'Presumably a question that could be resolved on a case by case basis. Next, restrictions on use and resale, with the committee noting that if you were to sell any of these properties, you would want to make sure of the long term affordability of the property.'",
        "'speaker_2': 'Some things that King County's Housing and Homelessness Community Development Division has developed for their other property transfers and affordable housing programs. Next issue, noted, is the cyclical nature of the housing market, with the Charter Review Commission noting that in some cases when the housing market is not roaring ahead as it has been these last several years, it'",
        "'speaker_2': 'may be that there are other tools or even just the market itself that would be sufficient to provide affordable housing. And so this tool may not always be necessary. Next, the Commission pointed out that there are other housing investment options that the county has in its capacity as a regional government, including zoning, other developer incentives and other'",
        "'speaker_2': 'forms of funding that would be in addition to making surplus property available. And then finally, the Charter Review Commission just raised the caveat that they did not see it as being appropriate, that the county would ever be in a situation of purchasing property simply to then sell it for less than fair market value for housing.'",
        "'speaker_2': 'So again, these were all issues raised by the commission during their deliberations. All issues that were this charter amendment to be adopted by voters the Council would want to consider in some way, potentially by amendments to the section of code that deals with the surplus of county owned property.'",
        "'speaker_2': 'I'll conclude by noting that it is impossible at this point to estimate what the potential fiscal impact from this could be, as this is something you'd have to consider on a property by property basis. Looking at. First, if a property is available and suitable for affordable housing, then if it has any other restrictions on its use or'",
        "'speaker_2': 'surplus. For instance, if it was purchased through the use of a levy by ratepayer funds or with federal grant funds, that would preclude its transfer for a less than fair market value. And then finally, what would be the difference between what would be fair market value at that point and what the property would be transferred for?'",
        "'speaker_2': 'So this is something that would really have to be done in the future on a case by case basis, typically in the way that the council makes property surplus decisions. Now finally, I'll note that there is a technical amendment on page three of the First Amendment packet that you were sent out this morning simply makes a couple'",
        "'speaker_2': 'of wording changes to make sure that the title and the body of the ordinance have the same words in them, but nothing substantive. And then again, just a reminder that if you wish to move forward in November, the last regular council meeting date for adoption would be July 21st.'",
        "'speaker_2': 'That concludes my report. As the Chair noted, there is a member of the Charter Review Commission here to make a presentation which begins on page 35 of your packet.'",
        "'speaker_0': 'Thank you, Mr. Burton. See, no urgent questions will go to the member of the Charter Review Commission. Mr.. Help me. I'm sorry, Mr. Holsten. Some. Michael Hirsh. Hansen Michael Hirsh. Jonathan, welcome. Thank you.'",
        "'speaker_4': 'Well, thank you very much for inviting me, Mr. Chairman, and thank you, Mrs. Bourguignon, for your presentation. I think you should include clarifying all the details that the Commission considered over its term and why the Commission believes that this is an important change to make in the King County Charter.'",
        "'speaker_4': 'I have very little to add that you have all the details before you. I'm happy to take any questions, if you have any, but I would encourage you to place this matter on the ballot this coming November. It is very.'",
        "'speaker_0': 'Appropriate.'",
        "'speaker_4': 'Even more appropriate now in our present time than when the commission considered this last year. So I don't want to take any more of your valuable time and any questions that you might have for new women's bourguignon would be appreciated.'",
        "'speaker_0': 'Thank you very much for joining us today, and thank you, more importantly, for your work on the Charter Review Commission for over a year. We appreciate the work you and your colleagues did in bringing all of the recommendations to us.'",
        "'speaker_0': 'And you're joining us to speak to this one today. Welcome. Questions of staff for our commissioner. Member Council member LAMBERT Thank you.'",
        "'speaker_1': 'So.'",
        "'speaker_2': 'You know, because I've been used to they have to keep each enterprise whole. How will an enterprise who had on their books an asset was worth, say, $10 Million and now it's going to be given away. How will that enterprise be made whole?'",
        "'speaker_2': 'Because a lot of our enterprises are doing better than the general fund, but that may not always be true. And then one of the things that concerns me is that I think we should, if we do go forward with this, that we should look at tracking whether the property was acquired by eminent domain or as a staging'",
        "'speaker_2': 'area. Because I am concerned that some of our projects, if we say we need a staging area of five acres, that maybe we only needed three, we would say five, and then we would have that as surplus property.'",
        "'speaker_2': 'And it's a concern I'm already concerned about. So this would only make that a bigger concern.'",
        "'speaker_1': 'So if we do go forward, those are.'",
        "'speaker_2': 'Two things I think we would need to put in the enabling legislation so that we don't end up with that. So my question is, how do we keep the enterprise accounts as much as they possibly can be without it being moved at less than market value?'",
        "'speaker_2': 'Thank you, council members. So as as I noted, these were issues that the Charter Review Commission considered last year and are issues that would not necessarily need to be in this charter amendment legislation, but rather through a future amendment to the King County Code.'",
        "'speaker_2': 'In terms of the processes that are used to surplus property, clearly you would have to ensure that there are very careful accounting measures taken so that if enterprise fund properties are surplus for less than fair market values, that is clearly accounted for.'",
        "'speaker_2': 'And as you noted, council member clearly there would need to be oversight of good business practices so that the county is not in the situation of purchasing properties it does not need for another purpose. That said, we do have a fairly extensive section in the King County Code right now for all non enterprise function agencies that surplus'",
        "'speaker_2': 'property. And so it may be that if this were to be approved by voters, you could address those issues through the code as part of that section. Okay. Thank you for that. How does the enterprise made whole? Would that be the general fund?'",
        "'speaker_2': 'How would that happen? Council Member It would essentially take the loss of that delta and I see that Patrick Hamacher is available, who staff the Charter Review Commission. If he wanted to add anything but essentially the Enterprise Fund would have to eat that difference between what they could get and what they are getting.'",
        "'speaker_4': 'That's exactly that's all I was going to add as well. Mary, Mary, hit it right on the head. The price. You're you're right council member Lambert that you've always learned that. And that has always been true. Prior to that 2018 state law changed.'",
        "'speaker_4': 'So what what is now allowable is that the Enterprise Fund could take a loss on the difference between the value of the land and what and transferring it to whatever they got out of it for if it's being used for the affordable housing purposes.'",
        "'speaker_4': 'So you're not you're not wrong to remember it that way. It's that the state law has changed.'",
        "'speaker_1': 'So.'",
        "'speaker_2': 'It the enterprise zone enterprise, the opportunity to tell the council, you know, I realize this is surface property, but we can't.'",
        "'speaker_1': 'Afford to eat.'",
        "'speaker_2': 'X number of millions of dollars.'",
        "'speaker_4': 'You know, all of these transactions would have to come before the council for approval. Well, I guess there are some very tiny ones that don't have to come to the council for approval, but those aren't going to be the ones you're talking about.'",
        "'speaker_4': 'Anything with any meaningful dollars would. Still, as Mary is noted for the Title four, provisions have to come to the Council for approval.'",
        "'speaker_0': 'Councilmember Dombroski.'",
        "'speaker_3': 'Thank you, Mr. Chair. Are you ready for a motion?'",
        "'speaker_0': 'I would be, yes.'",
        "'speaker_3': 'All right. Thank you, Mr. Chair. I move. Adoption of proposed ordinance 2020 203.'",
        "'speaker_0': 'Councilmember Dombroski did we give a do pass recommendation to ordinance 2020 203? Councilmember Dombrowski.'",
        "'speaker_3': 'Well, thank you, Mr. Chair. I don't have a whole lot to add beyond Mary, Vernon's Comprehensive and Excellent Staff Report and the remarks of Commissioner Hirsh Johnson from the Charter Review Commission. My recollection is that this was one of the early action items that they brought last year before us.'",
        "'speaker_3': 'Maybe not. But in any event, is a high priority. The Regional Affordable Housing Task Force, as you all know, identified a number of strategies to respond to the affordable housing crisis facing residents of our region. And one of the strategies or maybe it's a tactic, but whatever it is, is to look at available public lands to see'",
        "'speaker_3': 'whether or not they can be put to use. And a number of inventories have been done on those lands, like many solutions that maybe sound easy. I think those inventories have shown that a lot of public property simply just isn't suitable because it's too small or it's incorrectly zoned or in the wrong locations.'",
        "'speaker_3': 'But there are a number of parcels that often are owned by the county government that could be put to use to support the response to the affordable housing crisis facing the region. Some of those are, in fact owned by the kinds of funds that Mary identified, what we might traditionally call their funds.'",
        "'speaker_3': 'This charter amendment would be the next step in an initiative started by then Speaker Chopp in the Legislature, which I think followed some meetings with many of us at the council he had IS as he began to work more closely with the county in identifying actual sites to build projects.'",
        "'speaker_3': 'Some of those that became clear really couldn't be freed up in at a below market rate. He helped pass that law, led the effort to pass the law in Olympia to bring us to this point today. The Charter Review Commission, I think correctly has phrased the language.'",
        "'speaker_3': 'It's is not a mandate as simply as the releasing of the fines, the chains that prevent us from making the decision to sell a piece of property in the wastewater treatment division or the solid waste division, for example, at less than fair market value.'",
        "'speaker_3': 'I agree with the Commission and Mary and Councilmember Lammers point that some additional policy work will probably need to be done in an implementing ordinance later or motion that says, you know, in what cases and under what terms and conditions we would want to pursue this.'",
        "'speaker_3': 'And it may be a case by case basis. It may be, Councilmember Lambert, that a division could afford to turn over a piece of property with no compensation. Or maybe they want half the fair market value. The way this is written is it doesn't preclude any any of those options.'",
        "'speaker_3': 'So I think it's a good step and allows us some flexibility if the voters approve it, to be able to put some property that we have to use for this important public function. We're doing some of that on a short term basis.'",
        "'speaker_3': 'Just by way of example, Councilmember Cole Wells knows this well and she may want to speak to it in her district down on Elliott. The wastewater treatment division owns a a parcel where we have placed on a temporary basis modular housing.'",
        "'speaker_3': 'And the reason it's temporary and the reason we haven't been able to. One reason we have to move forward on a permanent basis is this very issue of of the Enterprise Fund and the Accountancy Act and the requirement that properties acquired for use by a utility be be used for the utility.'",
        "'speaker_3': 'So I think, for example, this would allow us to on that parcel and other similarly situated to have more flexibility to bring them on line for housing. So I encourage members support and I'll offer the technical amendment when you're ready, Mr. Chair.'",
        "'speaker_0': 'That's not my double duty.'",
        "'speaker_2': 'I just a question and so.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Thinking similarly there we worked on a been working on a project here on the east side to create not affordable housing. But while some affordable housing and a shelter on a piece of property that's owned by the Solid Waste Division, and I have been told repeatedly that that property can't be reduced in price.'",
        "'speaker_2': 'It has to go for fair market value because it's owned by the utility. Does this change remove that impediment? I didn't think it did. I thought it had to do with state law. So, Councilmember, I think we'd have to look at the the way the property was purchased.'",
        "'speaker_2': 'This the change in state law allows enterprise funds to take a loss on these properties for affordable housing, and changing the charter would remove our prohibition. But if there are other impediments such as that the property was purchased using funding that cannot be dedicated in that way, for instance, you know, ratepayer funds or a federal grant for'",
        "'speaker_2': 'parkland with conservation futures tax dollars, there may be other impediments that would prevent it. So it would really be on a property by property basis. But this charter change amendment would remove the Enterprise Fund impediment. Okay. I believe in this situation.'",
        "'speaker_2': 'It would have to do with repair funds being involved. So it does not change the legal requirements with regard to. And that, by the way, I'm totally in favor of this proposal. And you can only do what you can do with the county charter.'",
        "'speaker_2': 'And I would be in favor of us trying to find ways for a government to be able to surplus properties even if they had been purchased with ratepayer funds. But I'm just trying to confirm what this actually does.'",
        "'speaker_2': 'This does not change the rules with regard to purchase properties purchased with ratepayer funds. This would not this would simply say that if the property is held in an enterprise fund and there are no other impediments, while it could not be used in this way today, it would be able to be in the future.'",
        "'speaker_2': 'But if there are other impediments or legal issues, then it would not be able to be so today because of the language immediately preceding this charter amendment. Enterprise funds wouldn't be able to discount properties, but with this change they would.'",
        "'speaker_2': 'That is correct. Without other amendment the correct answer.'",
        "'speaker_0': 'Councilmember Dombrowski.'",
        "'speaker_3': 'I thank you, Mr. Chair. A move adoption of Amendment One, which is the technical amendment previously described.'",
        "'speaker_0': 'Councilmember Damascus approved adoption of Amendment One, saying no discussion. All those in favor, please say i.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'I oppose nay. The ayes have it. The amendment is adopted for the discussion. Of no further discussion, Councilmember Wells.'",
        "'speaker_1': 'Just be ready to vote, Mr. Chair.'",
        "'speaker_0': 'Okay, fair enough. And then I ask you to please call the roll.'",
        "'speaker_2': 'Thank you, Mr. Chair.'",
        "'speaker_1': 'Council Member Value Chain. I Council Member Blue Chip Outside Council. American Masking. I remember DEMBOSKY about to become.'",
        "'speaker_4': 'A.'",
        "'speaker_1': 'Council member done or to iron council member Caldwell's high member Caldwell spoke. Council Member Lambert High Ranking Member Lambert Goldstein Council Member of the Grove High Council Member of the Girl Scouts I Council Member Von Richthofen.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Council member of one night bar votes i council members all my.'",
        "'speaker_4': 'High.'",
        "'speaker_1': 'Council members all I. Votes I. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. Votes I. The vote is 980.'"
    ],
    "Charter Amendment to Replace the Word \"Citizen\" with More Inclusive Terms.": [
        "'speaker_0': 'Knows by your vote we have given a do pass recommendation to ordinance 2020 203 will expedite that to full council next Tuesday. Takes us to item nine proposed ordinance 2020 204, which would place on the November ballot amendments to carry charter the would change the term citizen to public or resident.'",
        "'speaker_0': 'Brenda Luskin from the council's policy staff will provide a report and then we'll hear from Charter Review Commission members Toby Nickson and Linda Miranda.'",
        "'speaker_2': 'Thank you, Mr. Chair. Thank you. Members of the Committee for the Record, Randall Askern and Council staff. The materials for this item, item number eight begin on page 39 of your committee meeting packet. As noted by the chair, this item, if approved, would submit a charter amendment proposition to the voters to update terminology and change references from'",
        "'speaker_2': 'citizen to either public or resident where applicable in the King County Charter. As a quick note of background, the word citizen currently appears in four areas of the charter in its preamble in Section 260, in Section 630 and in Section 800.'",
        "'speaker_2': 'Again, the proposed ordinance, if approved, would place on the November general election ballot a proposed charter amendment that would replace references to citizen to either public or resident. In the preamble in sections 260 and 800 of the County Charter.'",
        "'speaker_2': 'The proposed ordinance itself, which is consistent with the recommendation of the Charter Review Commission, shows the specific changes that the proposed Charter amendment would make in the charter language, and a copy of the proposed ordinance is in your packet on pages 43 to 46.'",
        "'speaker_2': 'Of note, the proposed ordinance and amendment would not make changes to Section 630 of the Charter, which relates to all elected officeholder qualifications. And just for context on this, as stated in the 2018 19 Charter Review Commission's report to this Council, as quoted, there is one reference to citizenship that will remain in the Charter if this amendment'",
        "'speaker_2': 'is passed. Currently, state law requires citizenship to hold elective office in the state unless state law changes. The Commission does not recommend removing this sentence. Similarly, for the last item in order to place this potential charter change amendment on the November ballot, the last regular council meeting date for adoption of this item would be July the 21st'",
        "'speaker_2': ', as the deadline for elections to receive an effective ordinance is August the fourth. There there are amendments for this item, Amendment one and a corresponding title amendment Amendment One, which is located on page five of the committee's amendment packet and would make technical corrections and clarifications regarding the ballot title and the election date in which the proposed'",
        "'speaker_2': 'amendment would appear on the ballot. And then title the corresponding title of amendment, which then page seven of the amendment packet would simply conform the title of the ordinance to the changes made by Amendment One. As noted by the Chair, we are joined by members of the Charter Review Commission, including Linda Larson and Toby Nixon, who are'",
        "'speaker_2': 'on the line and will also speak to this item. Mr. Chair, that concludes my remarks.'",
        "'speaker_0': 'Thank you, Mr. Tusk and Ms.. Larson. Mr. Nixon. I'm going to go first.'",
        "'speaker_4': 'Thank you, Mr. Chair. Members of the Council. It's good to be with you again, albeit virtually. For the record, I am Toby Nickson, member of the Charter Review Commission and of the King and of the Kirkland City Council.'",
        "'speaker_0': 'Each Council member.'",
        "'speaker_4': 'Thank you for this opportunity to address you today. Commissioner Larson and I will be presenting the proposed Charter amendment on revising use of the word citizen in the charter. I will first talk about what the proposed amendment does, and then Commissioner Larson will talk about why early in the charter review process, I carefully reviewed the entire charter'",
        "'speaker_4': 'and among other things, were surprised to see the word citizen used in several places where it didn't seem necessary and this amendment would change all but one of those instances to a more inclusive term. In the preamble, it changes the phrase enable effective citizen participation to enable effective public participation.'",
        "'speaker_4': 'In Section 260, it changes the name of the Office of Citizen Complaints to the Office of Public Complaints in two places and also changes citizen of the county to member of the public with regard to when the subpoena power of the office may be used.'",
        "'speaker_4': 'And finally, in Section 800, it changes the makeup of the Charter Review Commission itself from being citizens to being residents, which really is a substantive change. It does not change, as noted, the one instance of citizen in the charter where it refers to holding elected office, which under state law does require you to be a registered voter'",
        "'speaker_4': ', which requires you to be a citizen. And this is a very simple charter amendment.'",
        "'speaker_0': 'I suspect there might be some.'",
        "'speaker_4': 'Controversy about it, but nevertheless, it's the right thing to do. And I believe it will be supported by the people of King County. I urge you to support placing it on the ballot this November. And I also want to thank Councilmember Adam Baffsky and Councilmember Caldwell's for sponsoring the ordinance.'",
        "'speaker_4': 'And to you all for hearing it. Now, I'll hand off to Commissioner Larson to explain why the commission made this recommendation.'",
        "'speaker_2': 'Thank you. I'm Linda Larson. I'm a member of a charter review commission and a lawyer and a partner at Norseman LLP in Seattle. As part of our initial work, the Commission looked at the changing demographics of King County.'",
        "'speaker_2': 'We learned that King County has grown by almost 300,000 people since 2010, and over three quarters of the population growth in that last decade has been people of color. And over half of our total population growth has been from people born outside of the you know, outside of the United States.'",
        "'speaker_2': 'One in four residents of King County over the age of five speaks a language other than English at home. So having a charter that was inclusive for all King County residents was very much top of mind as the commission went about its work.'",
        "'speaker_2': 'The citizenship of a person. And what that means in terms of access to government and government services has become highly politicized, as Toby just mentioned. However, the commission is not aware of any situations where the county denies access to government or services to individuals based on their citizenship.'",
        "'speaker_2': 'And we believe that the Charter should reflect this policy and this practice. Many agencies and protections exist to prevent discrimination based on citizenship. The 50 year old language in the charter does not reflect either the current demographics of.'",
        "'speaker_1': 'The county and is needed and.'",
        "'speaker_2': 'Is needlessly politically charged. It's also unwelcoming to new residents who we very much welcome to our community. The Commission strongly concurred with existing county policies that make access to government and government services.'",
        "'speaker_1': 'Available to all.'",
        "'speaker_2': 'Residents of King County. And we believe that the proposed amendment is both necessary and equitable to make sure.'",
        "'speaker_1': 'That.'",
        "'speaker_2': 'The words of this 50 year old document reflect the current reality. And I actually I agree with Toby that the majority of voters are going to want to adopt this amendment, and we hope very much that you will put it before them in November.'",
        "'speaker_0': 'Thank you to you both. Colleagues. Questions of staff or our commissioners. Three None. Council Member Dombrowski.'",
        "'speaker_3': 'Thank you, Mr. Chair. I'm very proud to move adoption of Ordinance 2020 DASH tool for.'",
        "'speaker_0': 'Council member Damascus moved adoption of Ordinance 2022 for Councilmember Dombrowski.'",
        "'speaker_3': 'Well, thank you, Mr. Chair. Socrates said, I am a citizen of the world and my nationality is goodwill. This recommendation brought forward by the Charter Review Commission represents the best of goodwill and the welcoming spirit that we exhibit here in King County.'",
        "'speaker_3': 'Like many of you, I have had the privilege in elected office to attend swearing in ceremony for new citizens in Seattle down in Boston. And I think they are the most uplifting and heartwarming of public ceremonies that I am proud to have been able to attend an and entrepreneur.'",
        "'speaker_3': 'Wells often attended the one at the Seattle Center and speaks very fondly of it. And at those ceremonies I realized the privilege I had of being born here and being given citizenship. And I'm very proud to be an American citizen and to have all the rights and obligations that come with that.'",
        "'speaker_3': 'We have over 500,000 people. As Commissioner Larsson mentioned in some of her statistics, but in addition to the ones she mentioned, over 500,000 people living in King County, more than one in five were foreign born. And while many choose to become citizens, many aren't.'",
        "'speaker_3': 'But we in King County do not discriminate in our service provision or in our rights and duties as a government to be responsive to those living here based on their citizenship. And so this this this charter amendment really, I think, clarifies and corrects, perhaps an unintended use of the term from 50 years ago, because it is used'",
        "'speaker_3': 'in a number of contexts in the charter where clearly it doesn't apply. And Commissioner Nixon, you correctly pointed those out. Should somebody be precluded from making a complaint to the Office of Citizens complaint because of their nationality or their lack of citizenship or their citizenship?'",
        "'speaker_3': 'No, I don't think so. And so this change would would clarify that it does leave intact, obviously, the citizenship requirement around voting, but I think it is a step in the right direction. The wonderful thing about our charter is it's a lot easier to mend than some of the founding documents of our country where they had phrases'",
        "'speaker_3': 'like all men are created equal and how often do we wish that that was not as exclusive today as it sounds and and in many cases has been? So I think this is a great amendment. I think it's consistent with recent work done by our three female members of the council, Councilor Carlos Baldacci and Lambert, to remove'",
        "'speaker_3': 'gender, a language that was exclusive a couple of years ago. The community that residents of our county that voted for that overwhelmingly, I think appreciated it. And for those reasons and that the reasons articulated by the commissioners, I really think this is the right thing to do and I hope it will go forward.'",
        "'speaker_3': 'I'll say this as a proud American citizen, it does not diminish in any way all of what it means to be a citizen of this country. Instead, it means that we are more welcoming here in King County and not excluding folks based on some language put in our charter over 50 years ago.'",
        "'speaker_3': 'So thank you very much. And when you're ready, Mr. Charter comments, I'll move the amendments.'",
        "'speaker_0': 'Councilmember Carl Wells.'",
        "'speaker_1': 'Thank you, Mr. Chair. I'd like to join you in supporting this Charter Review Amendment, and I'd like to say that what is so one of the most amazing things about our country is our embracing of our equity and social justice principles, using that as a lens in evaluating everything that we do.'",
        "'speaker_1': 'And I am particularly gratified that the King County Strategic Plan, which was first adopted in 2010, brings out a guiding principle of our government of being equitable and fair and focusing on equity means that our people have full and equal access to opportunities that enable them to attain a folk potential.'",
        "'speaker_1': 'And I think that actually brings in another concept of equality and fair and just meaning. The county serves all residents by promoting fairness and opportunity and eliminating inequities through actions to reach equity and social justice. Foundational practices are applied, and that's what this measure is about.'",
        "'speaker_1': 'Every resident of our county deserves to have equal treatment. Every resident of our county deserves to be able to obtain their full potential. So I commend this to you and support this amendment. Thank you.'",
        "'speaker_0': 'Seeing no further discussion at this time. Councilmember Dombrowski.'",
        "'speaker_3': 'Thank you, Mr. Chair. I move Amendment One technical amendment previously described.'",
        "'speaker_0': 'Councilmember Dombroski moves adoption of Amend one, which is on page five of our amendment packet. See no discussion of this. Please say I, I may. The ayes have it. The amendment is adopted.'",
        "'speaker_3': 'Councilmember Dombrowski moved the title amendment. Mr. Chair.'",
        "'speaker_0': 'Title moment to you one as before. I see no discussion others in favor. Please say I. I opposed nay. The ayes have it. The title amendment is adopted. Any further discuss, debate and conclusion. Councilmember Dvorsky.'",
        "'speaker_3': 'I just want to close by thanking our two commissioners who are here today, and in particular Councilmember Nixon, who jumped right in on the Charter Review Commission work. Councilmember Balducci made a very wise recommendation there in getting on the Charter Review Commission, but for catching this language and thinking about it critically, as he does on some of'",
        "'speaker_3': 'the issues and bringing it forward to today and hopefully to adoption in November. Thank you, Councilmember Nixon. And thank you, colleagues.'",
        "'speaker_0': 'Thank you, Madam Court, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member. Baluchi I Council member body Chief Council member Dombrowski. I thank the member Dombrowski about I Council Member Done.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'Item member Dan Goldstein Council Member Caldwell's High Council Member Caldwell Sports Ion Council Member Lambert I Council Member Lambert voted for Article II Council Member of the group I Council member von right there. I council member gone make the votes I council members all my.'",
        "'speaker_4': 'High.'",
        "'speaker_1': 'Council members are the line votes. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. But I the vote is 19 zero noes a vote.'",
        "'speaker_0': 'We have given a passed recommendation to ordinance 2022 or four as amended. Are we comfortable putting this on consent at full council? We will expedite to next week. Are we putting it on consent? Yes, gentlemen. Yes, I hear.'",
        "'speaker_0': 'Yes. So, yes, we will put it on consent next week. And colleagues have your attention about consent. Would we be also comfortable putting the previous item ordinance 2022 or three regarding housing consent as well?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Yes. Thank you.'"
    ],
    "Charter Amendment to Prohibit Discrimination Based on Family Caregiver, Military or Veteran Status.": [
        "'speaker_0': 'Yes. So we will put forth the ordinance we just adopted to a floor and the previous one, two or three consent, and both are expedited to full council. That takes us to the last item in our agenda, proposed ordinance 2020 207 which replacement of member ballot a charter amendment to the anti-discrimination provisions of the charter.'",
        "'speaker_0': 'The proposal would seek to prohibit discrimination in county employment or contracting on the basis of being a family caregiver or on the basis of military or veteran status. Andrew Kim will give us a staff report on the proposed charter amendment and then we'll hear from Charter Review Commission member Marcos Martinez.'",
        "'speaker_0': 'Mr. Kim.'",
        "'speaker_4': 'Thank you, Mr. Chair. And you can with council essential staff. The staff report for this item begins on page 51 of your agenda packet. As you mentioned, Mr. Chair, the audience were pleased to file a proposal on the next general election to amend Section 840 of that.'",
        "'speaker_4': 'All right. I'm doing a zoom call or a Zoom hearing.'",
        "'speaker_0': 'Councilor, by working your mute, please. There we go.'",
        "'speaker_4': 'So this would place a ballot proposal to amend King County Charter to prohibit discrimination in employment or compensation of county officers or employees, and also prohibit the county from contracting with any parties that discriminate on the basis of family, caregiver and military status or status.'",
        "'speaker_4': 'As a veteran who was honorably discharged or who was discharged solely as a result of the person's sexual orientation or gender identity or expression. If I can direct members to page 52, I'm on top of page 52. So the last time the session 840 on Anti-Discrimination was amended was in 2008, where the council voted for adopting an'",
        "'speaker_4': 'ordinance to place a ballot proposal to add disability, sexual orientation and gender identity or expression as additional protected classes. And that ballot proposal was adopted with 71% of the vote on November 4th, 2008. I'm moving forward to page 54.'",
        "'speaker_4': 'The section called Protected Classes. Just for background, a protected class refers to a group of people with a common characteristic who are legally protected from discrimination on the basis of that characteristic. The protected classes have been inconsistently applied throughout King County Code, and these and this include inconsistencies between the county charter and the county's nondiscrimination ordinances, which'",
        "'speaker_4': 'is throughout King County code. These inconsistencies have been a result of both council policy choices and from inconsistently updating the King County code when set, when legislation is taken up related related to protect the classes. Table one on the bottom of page 54 and beginning on page 55 provides a list of protected classes that are included in'",
        "'speaker_4': 'federal, state and county laws. I would direct you to the last I'm sorry, the row that the rightmost column to move to two rightmost columns of the table comparing the King County Charter and King County Code. So on page 54, the list of protected classes are fairly consistent together with King County, China and King County Code.'",
        "'speaker_4': 'But if you go to page 55, you'll see that some of the protected classes are included in King County Code, whereas some of those protected classes are not applied in King County Charter. Just wanted to provide that that comparison between the charter and the King County Code and to the members.'",
        "'speaker_4': 'Moving along to page 56 as as is similar to the other proposed ordinances. This is also one of the 11 charter amendments recommended by the Charter Review Commission and deferred to one of the members to provide their thoughts on that.'",
        "'speaker_4': 'On the bottom of page 36, we talk about the family caregiver protected class. So as shown in table one. State law includes families with children as a protected class, and familial status is a protected class under federal law.'",
        "'speaker_4': 'However, neither are protected classes in the county charter nor in King County Code. The county's nondiscrimination ordinance is related to fair housing, and public accommodations include parental status as a protected class. However, the term family caregiver is not an explicitly designated protected class under federal, state and county laws, according to an advocacy group that promotes equality for'",
        "'speaker_4': 'family caregivers. They state that a few states and over 60 local jurisdictions currently offer protection for caregivers under their employment discrimination laws. One example is New York City, which explicitly designates the family caregiver as a protected class under their human rights law.'",
        "'speaker_4': 'In addition, the EEOC issued guidance in 2007 explaining the circumstances under which discrimination against workers with caregiving responsibilities may constitute discrimination. Military and Veterans Status Protected Class. So, as also shown in Table one, honorably discharged veteran or military status is designated as a protected class under federal and state law.'",
        "'speaker_4': 'However, the protected class is only included in the county's nondiscrimination ordinance related to county employment discrimination. Under Chapter three, that 12 by way of background. Don't Ask, Don't Tell was a federal policy between 1994 and 2011, which prohibited prohibited any LGBTQ person from disclosing their sexual orientation or from speaking about any relationships, including marriages or other familial'",
        "'speaker_4': 'attributes while serving in the United States Armed Forces. The policy stated that any LGBTQ service member disclose their sexual orientation conduct be other than honorably discharged. According to the Servicemembers Legal Defense Network. More than 13,000 service members were discharged under the Don't Ask, Don't Tell policy.'",
        "'speaker_4': 'But as as members are aware, in 2011, this policy was repealed by the Don't Ask, Don't Tell Repeal Act in 2010 of 2010, and thus allowing LGBTQ persons to serve openly in the United States Armed Forces. The Military.com article, Military.com article in 2016 states that approximately 8% or about 1000 individuals of those discharged under the Don't Ask'",
        "'speaker_4': ', Don't Tell policy have applied to upgrade their discharge status. Based on preliminary analysis by council staff, there is currently no US governmental jurisdiction that have explicitly designated veteran who was discharged solely as a result of a person's sexual orientation or gender identity or expression as a protected class.'",
        "'speaker_4': 'However, just recently, in November 2019, the State of New York adopted law to restore benefits for those LGBTQ veterans. And the state of Rhode Island recently adopted law to upgrade discharge status for those LGBTQ veterans that were other than honorably discharged to honorable to permit them from receiving veterans assistance.'",
        "'speaker_4': 'Similar to the other proposed ordinances that were spoken today, the ballot timeline is similar in that we've inquired executive staff on event, but due to the timing, we we didn't have time to incorporate their feedback into the staff report and they are here at the meeting.'",
        "'speaker_4': 'If members have any questions. And lastly, Mr. Chair, there is a striking amendment S1 entitling them to one which makes them technical corrections. And that concludes my remarks.'",
        "'speaker_0': 'Thank you, colleagues. Okay. Thank you, Mr. Chair. Move!'",
        "'speaker_3': 'Move! Adoption of the ordinance.'",
        "'speaker_0': 'Thank you. However, I jumped the gun and I want to back up and invite Mr. Martinez to present.'",
        "'speaker_4': 'Yes. Thank you, Mr. Chairman. And thank you to the rest of the council members for including these proposed amendments on the agenda today. Thank you, Andrew Kim, for your presentation. Just to very briefly kind of underscore and share with you some of our thinking.'",
        "'speaker_4': 'You know, the family caregiver proposal is an idea that is very timely, especially now we are seeing so many demographic changes in our society. One of the advocacy groups, a group called Caring Across Generations, shares with us these very quick statistics.'",
        "'speaker_4': 'So every day, 10,000 people in our country turn 65 years old. It's estimated that 70% of people over 65 will require long term care for for an average of three years. And importantly, 80% of that care will be provided by family members.'",
        "'speaker_4': 'And so that's really kind of the key there, is that a lot of the care that our elders are receiving is provided by family members. And so that's really kind of the key point here that our families are providing care.'",
        "'speaker_4': 'And so it's important for for our families, this is really changing the nature of work. You know, and we're seeing this so much right now in the during this pandemic, you know, the blurring of work and home life.'",
        "'speaker_4': 'It's been it's been discussed in this very set, in this very meeting. And so, you know, this having this this this kind of antidiscrimination protection for people who are home caregivers is really important. And then the I think that the the protections for veterans is is something that, you know, we've seen these protections for years and years'",
        "'speaker_4': 'now. And so having this codified in the King County Charter makes perfect sense. There's been a great deal of progress made in this area. Unfortunately, under the current administration, we've actually seen some of the we've seen, for instance, transgender individuals.'",
        "'speaker_4': 'We've seen some steps backward, backwards in that against that community. And so one of the amendments that provides the protections for the transgender community. And so, you know, those are some of the important points, I think, with regard to these proposed amendments.'",
        "'speaker_4': 'So thank you for your attention.'",
        "'speaker_0': 'Thank you, colleagues. Councilmember Dombrowski.'",
        "'speaker_3': 'Okay. Thank you. And just for good measure, again, I'll move. Adoption of the ordinance.'",
        "'speaker_0': 'Thank you. Councilmember Dombrowski approved adoption of Ordinance 2020 207. Councilmember Dombrowski.'",
        "'speaker_3': 'Thank you very much. I think the staff has done a good job and the commissioner an excellent job and explaining what this would do and the reasons for it. And just speaking briefly on my behalf as the sponsor of it, you know, we talk often of the charter as being the Constitution for our government.'",
        "'speaker_3': 'And the Constitution is the right place to enshrine protections for individuals, including those often quite the subject of discrimination by society at large. We protect the rights of minorities in our foundational documents, and this charter amendment would do that in these two important areas.'",
        "'speaker_3': 'The first, the family caregiver classification. And I think that the articulation of the reasons, therefore, by the Commissioner are really compelling with a growing, aging population. You know, many, if not all of us on this council have dealt personally with those issues of aging parents and shared those experiences with each other.'",
        "'speaker_3': 'We do offer some the federal federal government offers some protection in the FMLA, right. For folks to take leave in a protected way from your job to take care of folks. This is along those lines. With respect to the veterans protection, the story of Gretta or Kamehameha comes to mind a colonel in the Washington National Guard who'",
        "'speaker_3': 'served very capably and heroically for many years now. She was after disclosing her status as gay, honorably discharged. But many who served like her were dishonorably discharged. And there has been over the decades of limit on receiving public benefits and assistance for veterans to those who are honorably discharged.'",
        "'speaker_3': 'I think it's widely acknowledged that that policy of excluding folks who want to serve this country because of their orientation or status or identity is wrong. And that we have made some positive strides in that direction, that correcting that this charter amendment would add protections in our veterans programs and elsewhere in the government for those who were'",
        "'speaker_3': 'discharged, perhaps even quote unquote, dishonorably because of their status, sexual orientation or identity. We at this county have a tremendous history, probably the best in the country of any county for supporting our veterans with our state mandated program.'",
        "'speaker_3': 'It's been around a long time, but also our local veterans, seniors and human services levy. And I think this is a sends a positive message, but also makes a real change to to eliminate, frankly, what is a discriminatory restriction?'",
        "'speaker_3': 'A discriminatory restriction when we denied benefits or rights to those who served our country honorably and ably and bravely, but may have been discharged because of a discriminatory reason that to a large degree, the U.S. military has eradicated.'",
        "'speaker_3': 'So I commend these changes for for your consideration and hope that we can advance them to the voters. Thank you, Mr. Chair.'",
        "'speaker_0': 'Your council member. Would you remove adoption restriction amendment as such moved from striking amendment one has before us see no discussion of those in favor of Second Amendment S1 Please signify by saying I. I don't oppose. No, the ayes have it.'",
        "'speaker_0': 'Councilmember did ask you to one so moved. Councilmember DEMBOSKY has moved. Adoption of title amendment times wants those in favor. Please say I, i, i. I don't know. The ayes have it. However amendment is adopted. We have before US Ordinance 2020 207 as amended.'",
        "'speaker_0': 'Discussion. Further discussion, I shouldn't say. Seen no further discussion. Would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member Belushi I Council member Belushi. Both I. Council Member Dombrowski.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Council Member Dombrowski both I. Council Member Dunn. I council member done votes. I Council Member Coles. I Council Member Caldwell Spokes II Council Member Lambert. I Council Member Lambert. Voted Council member after girl. I Council member of the group.'",
        "'speaker_1': 'I council member upon my staff. I council member gone make the proposal. I council members online. I also members on high votes. I Mr. Chair. Hi Mr. Chair. Votes I The vote is 19 zero no's.'",
        "'speaker_0': 'Thank you. By your vote we have given a do pass recommendation to ordinance 2020 207 as amended objection to including this on consent as well.'",
        "'speaker_1': 'No objection.'",
        "'speaker_0': 'Sharing them include this on consent as well. Madam Clerk, I believe all members were recorded as having voted on all items today. Is that correct?'",
        "'speaker_1': 'That's correct, Mr. Chair.'",
        "'speaker_0': 'Then we have no need of a reconsideration moment on the Council's agenda, and therefore I'd like to thank everyone who's here to participate in today's meeting. Most importantly, I'd like to thank the staff who made it all work so flawlessly and with no other business to come before us.'"
    ]
}