{
    "Creation of Ruth Woo Emerging Leaders Fellowship Program.": [
        "'speaker_0': 'Thank you very much. Those are the minutes of our special meeting on page three. Others in favor please say I, i, others opposed. Nay, the minutes are passed. Okay. So that takes us down now to proposed ordinance 2017 0301 and item number five, the ordinance creating the route through Emergency Leadership Program.'",
        "'speaker_0': 'And so this is sponsored by councilmembers Dombrowski, McDermott and Heidi Puppy. Chuck, would you begin? Thank you, Madam Chair. Heidi Papa, our council staff. The staff report begins on page seven of your packet proposed ordinance 2017 0301 would create a new fellowship program and King County Government to honor the late Ruth Woo for her dedication to public'",
        "'speaker_0': 'service. To provide some background on Mrs. Woo. She was born on November 28th, 1926, in Kalispell, Montana. To Tom and Ricki Oya. Her father, Tom Oyer, worked on railroad gangs in Montana. After her father died, the family moved to Seattle, where the mother worked as a seamstress and later to an Oregon farm.'",
        "'speaker_0': 'In 1941, World War Two began and led to the internment of Japanese-Americans. In 1942, Mrs. Wu's family was banished first to the Tool Lake internment camps in California, then to Camp Mini Doka in the Idaho desert. She she graduated from Hunt High School while interned at Camp Minnetonka.'",
        "'speaker_0': 'After camp she married Hiroyoshi excuse me, only Yama, whom died in 1960. They had two children, Teresa and Janice. In 1975, she married Benjamin Woo, an architect and influential leader in the Seattle Asian community and a father of five.'",
        "'speaker_0': 'Mr. who died in 2008. In the late 1950s, Mrs. Woo worked as secretary for the city of Seattle Mayor Gordon Clinton. After working as a secretary, she moved to Olympia to work as a receptionist for then Governor Dan Evans.'",
        "'speaker_0': 'When Governor Dan Evans ran for a third term in 1971, Mrs. Miller offered to campaign for him. Mrs. who managed her first political campaign for Mr. James Oliver in 1975, whom she had met while working at the governor's office while he was running for state Supreme Court Justice.'",
        "'speaker_0': 'Shortly thereafter, Mrs. who managed Mr. Douglas Stewart's campaign for City of Seattle city attorney. She eventually held a succession of administrative professional positions for elected officials. Mrs. Will passed away on July 13, 2016, in Seattle, Washington. At the age of 89, Mrs. Woo was well known in the Asian-American community with a talent for organizing political campaigns.'",
        "'speaker_0': 'Mrs. Moon was created credited with shaping the careers of a cadre of notables from both political parties, including former Governor Gary Locke and former King County executive Ron Semmes. The fellowship program that would be created by proposed ordinance 2017 0301 to honor Mrs. Wu would award one person who has demonstrated a commitment to public service a full'",
        "'speaker_0': 'time paid term limited to a temporary position in King County government. For a term of one year, the fellow would be an employee of the Department of Executive Services, Human Resources Management Division or h.r. D The fellow would be assigned to work in various county agencies for periods of 3 to 4 months at a time, working on'",
        "'speaker_0': 'projects such as following a piece of legislation through the legislative process, preparing briefings and assisting with outreach and executive branch policy administration. Each agency would reimburse h.r for the cost of the fellow for the period assigned to that particular agency.'",
        "'speaker_0': 'A selection committee will convene annually to review the applicants of the for the fellowship program and to recommend an applicant to be appointed as the fellow to h.r. The members of the selection. A committee will be appointed by the county executive and the chair of the Council.'",
        "'speaker_0': 'Council staff and Council's legal counsel has identified technical corrections to the proposed ordinance for Council consideration, which includes the striking amendment in a title amendment starting on page 15 of your packet. The striking amendment S1 would insert the new section of the fellowship program in Chapter 3.12 of the King County Code instead of Title two.'",
        "'speaker_0': 'The title Amendment one would confirm to the effects of this striking amendment. Executive staff in the Office of Labor Relations recommends that as the Fellowship Work Program is developed, an ongoing dialog regarding the program should commence with the labor unions that represent the employees of King County.'",
        "'speaker_0': 'Madam Chair, that concludes my staff report. We have three of Mrs. Woo's friends in the audience this morning. It's Ms.. Dolores in Bangor. Ms.. Joan, Yoshi, Tommy and Mr. Frank Rae. Thank you. Can I ask you a question on line 23 on the S1?'",
        "'speaker_0': 'What is that? On the word most. I've never seen us do that. I think it's just a citation since it's not capitalized and because it was a particular issue, speech issue in a quote. So that is there is a quotation and then with the persons of M.'",
        "'speaker_0': 'Since it's not capitalized, I would presume and we can it's just different. I never seen that before. Okay. So with the three friends want to come up to the table if you like to make any comments, would you like to come on these microphones?'",
        "'speaker_0': 'You have to pull very close to your mouth and it's the bottom line. And please introduce yourselves for the record. Good morning, Madam Chairman, and members of the Council. My name is Josh Utomi.'",
        "'speaker_4': 'I'm Dolores Bonga.'",
        "'speaker_0': 'Hey, would you like to make any comments about this? I guess Ruth Wu had a extensive network. Everybody shaking their heads so could tell. Everybody has touched with her. Been touched with her at some point or another. She always was great about trying to find young people to fill positions that she would hear about how she found'",
        "'speaker_0': 'that out. And none of us really knew. And then she on her campaign, she always looked to have young people be involved. And I believe, although she never articulated it this way, that it was her way of introducing young people to public service and government service.'",
        "'speaker_0': 'And she was very successful over the a lot of us are in those positions because of that. So I urge you to pass this legislation today. Thank you. Do you want to make another comment? Yes, please. I want to.'",
        "'speaker_4': 'Thank all of you for taking this magnificent step. We were thinking of a way to memorialize Ruth's life, and we could think of nothing better than to help young people become part of government. The beauty of this bill as well is that this fellow will be able to go to three different departments and I'm hoping their finance'",
        "'speaker_4': 'and budget and policy and operations, because then that individual will be able to, as Ruth did, influence many, many others to join government and to be a contributing member. This also fits in beautifully with your equity and social justice legislation, and we're very, very thankful for your doing this.'",
        "'speaker_0': 'Thank you. I think I have a clue. I want to use tricks. I met Ruth in December 2011 and she called me because she'd been watching me on TV and she wanted to give me some information. And it was one of the most pleasant meetings of meeting somebody knew.'",
        "'speaker_0': 'And her expertize, her kindness, the kinds of things she said and how much she knew, she'd been watching a lot of television. So I was really impressed with her ability just to see and know so much. So I, too, along with everybody else, will miss her a lot.'",
        "'speaker_0': 'And I appreciated her phone calls. So this was framed by two members of the committee. Do either of you want to say anything with it? Okay. McDermott.'",
        "'speaker_2': 'Okay. Thank you, Madam Chair. The staff report outlined Ruth's political work, but Ruth also ran the licensing agency in Rainier Valley. And I was actually home from college. Grew up here in Seattle, was the women's college in Spokane, and home for a college break when someone else who had done some political mentoring of me told me I'",
        "'speaker_2': 'needed to go meet. Did I know Ruth Wu well? No, I didn't know Ruth. Well, you need to meet Ruth. I'm going to call her and tell you to come in. You need to go by the licensing agency, introduce yourself and have coffee.'",
        "'speaker_2': 'I didn't quite understand why at the time. Only later did I understand how important and valuable that coffee, that time with Ruth would be. And Ruth was somebody who did, in her small way, mentor me and in much larger and more direct ways, mentor so many other people.'",
        "'speaker_2': 'And like Mr. Banga said, really invited and prompted many people to think about a career in involvement, whether it was a queer or not involvement in public service that they wouldn't otherwise have done. In addition to the people already introduced, they see that Judge alum Dean LAMB has joined us and I suspect you here for this item'",
        "'speaker_2': ', not for something else in our agenda. Ruth Ruth's reach is deep, and this is a way of continuing that legacy, of introducing people, involving people in the public process, in government. And I think it's much the way Ruth would have done it herself.'",
        "'speaker_0': 'Thank you. Councilmember Dvorsky.'",
        "'speaker_5': 'Thank you very much, Madam Chair. Want to echo Councilmember McDermott's remarks and really thank former Councilmember Salonga. And Joan Yosh, tell me, former deputy county executive, I think that was your title here in Lake administration for really bringing this forward.'",
        "'speaker_5': 'I think it's apropos of Ruth that it was this is a community based and community driven proposal. And that was what Ruth Wu and then her husband were all about, community based and community activism. And I think it's important I want to emphasize in here that Ruth was bipartisan and she may have been more Republican.'",
        "'speaker_5': 'The Democrat. I don't really know. I don't know that a lot of people knew she worked for Republicans and Democrats, but I think her driving force was inclusion and opportunity and making sure that those who were not always easily in the system or had access to the system or put into places and opportunities and connected with folks'",
        "'speaker_5': 'so that they would have those opportunities. And that's the goal of this program. As much as it's a tribute to Ruth, well, it really is about making King County more responsive and a better government to serve the diverse community of King County that we have today at 2.1 million people.'",
        "'speaker_5': 'We don't just go around making tributes to folks. That's a secondary benefit. And I think it's something that Ruth would appreciate and never like credit. She didn't want attention. I think she skipped an event that was set up to honor her one time.'",
        "'speaker_5': 'Right. But many times, yeah. And so she might be a little reluctant to have her name on this, but I have no doubt that she would be supportive of the thrust and goals of the program, and that is to bring rising stars into the government, train them up and ensure that we get the benefit of their service'",
        "'speaker_5': 'here to the county and that the county is able to better serve their communities in a reciprocal way. So I'm pretty excited about this. I hope that at some point it will succeed and its success will generate more positions, that the fellowships will be on be grow beyond just one.'",
        "'speaker_5': 'And I really want to thank Dolores and Joan for bringing this really good idea forward and then your advocacy for it. So thank you.'",
        "'speaker_0': 'Thank you. Okay, so which one of you would like to be okay? Oh, sorry. That's a member of our right there.'",
        "'speaker_3': 'Thank you very much. I had the privilege of first meeting Ruth when I was chair of the Transportation Committee of the State Senate. And I had not a lot of knowledge about some agents, and I was one of my colleagues in State House.'",
        "'speaker_3': 'Gary Locke said, Yeah, I had to meet Ruth to understand and appreciate some agents because we had legislation before us to eliminate some agents. And of course, Ruth took a keen interest in that issue, and I first got to know her through that process.'",
        "'speaker_3': 'And then when I became a member of the King County Council, the added privilege of getting to know Ben and Ben was an incredible partner, friend and mentor to everybody as well. And. Ruth, Ruth Seattle is very long, but Ben did his work as well.'",
        "'speaker_3': 'He did and should not be forgotten. I think it's nice to point out how nice she was, but she was tough. Certainly there was a certain state representative who thought it was his turn to become to the King County Council.'",
        "'speaker_3': 'And there was another person in the community that he thought he should be on the King County Council when a vacancy occurred not that long ago. And and she made it very clear her who her choice was. And her choice was eventually appointed to the King County Council.'",
        "'speaker_3': 'So, Ruth, as a person who not only was kind and a mentor, but she was a tough political person who understood which fit the district best, in this case, the South Seattle district. And she, as a person who has a great legacy and so many people in so many places, and this is a great continuation of her'",
        "'speaker_3': 'endearment to so many people by helping others. Thank you.'",
        "'speaker_0': 'Thank you. I like how she reached out. You know, it was it was really important that she would always take the time to reach out. Councilmember Would you like to put this before us? Councilman McDermott, would you like to put this before us?'",
        "'speaker_6': 'I'd move that. We give a do pass recommendation.'",
        "'speaker_2': 'To ordinance 2017 3001, the Ruth Ruth Fellowship.'",
        "'speaker_0': 'Okay, so before us, we have 2017 301 before us and I'll go down to the other. Would you councilmember or like you strike.'",
        "'speaker_5': 'That's one striking.'",
        "'speaker_0': 'In my look at a strike has gotten on page 15 others in favor of striker one please say I right those opposed nay and council member making.'",
        "'speaker_5': 'The title amendment.'",
        "'speaker_0': 'Okay and title amendment number one impeach 19 all those in favor title them one please. They I I you're now on the underlying as amended. Any comment? You got them. Okay. Would you please call for the votes? Thank you, Madam Chair.'",
        "'speaker_0': 'Councilmember Dombrowski.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Councilmember Dunn. Hi. Councilmember Gossett. Councilmember Caldwell's council member McDermott. High Council member of the Grove. Councilmember Yvonne. Right, member I. Madam Chair. Councilmember Ritchie. Madam Chair, the vote is five eyes. No nos. Great. I don't think we'll put it on the consent count because I'm assuming people want to speak on it.'",
        "'speaker_0': 'So we'll just put it on the regular course. And thank you so much.'",
        "'speaker_5': 'And Madam Chair, would it be possible to expedite it?'",
        "'speaker_0': 'To expedite it? Okay. We can expedite it.'",
        "'speaker_5': 'Nope, nope, nope, nope. I guess we have scheduling.'",
        "'speaker_0': 'Sorry.'",
        "'speaker_6': 'Sorry. Thank you.'",
        "'speaker_0': 'Very much. Good thing they have staff that knows how to do arm signals. Okay, we're good. All right, so it'll be on the regular course. Thank you so much for being with us today. Thank you. All right. So now we will move on to item number seven, which is 2017, briefing 172.'"
    ]
}