{
    "Appointment of Carlos Michel to the Immigrant and Refugee Commission.": [
        "'speaker_0': 'Thank you very much, Commissioner Paula, for being with us today. And I'm sorry that we did not get to hear from Commissioner Surridge, but we're now going to move on to three appointments to the commission there in the agenda item seven, eight and nine.'",
        "'speaker_0': 'They're going to be briefed together by Melissa Bailey on our central staff. We have, I believe, two of the three appointees with us today. We want to hear from them. We are going to be short on time. We still have another agenda item on the even year election ordinance, which does have some urgency because we do want'",
        "'speaker_0': 'to have that in time to be placed on the ballot if that is adopted. So, Melissa, please go right ahead. And this begins the staff report begins at ten. Thank you for your calls and good morning. Council members Melissa Bailey with central policy staff.'",
        "'speaker_0': 'As the Chair noted, this is a combined staff report for the three appointments which are item seven, eight and nine on the agenda, and they begin on page ten of your packet. As noted, the proposed motions are to confirm the executive's appointment of the following three persons to the King County Immigrant and Refugee Commission, who also became'",
        "'speaker_0': 'resident of Council District three for the remainder of a three year term expiring September 30th, 2024 five Wilhemina, who resides in Council District five for a partial term, expiring September 30th of this year. And Carlos Michel from Council District nine.'",
        "'speaker_0': 'For the remainder of a three year term expiring September 30th, 2024, are in the background section of the staff report that included some basic information about the commission, since you've just received a briefing straight to the section with Appointee Information, and I believe we have two of the appointees here who are eagerly waiting to talk with you'",
        "'speaker_0': '. So I'm just going to give a little bit of information on appointing. So who wasn't able to be here today? Appointee and information for the appointees begin on page 11 of your packet. On page 12 is information for appointing yourself so based on rent in Highland area.'",
        "'speaker_0': 'He's currently a senior at Haven High School where he serves on the Associated Student Body Executive Board as the ACP parliamentarian. He will be attending Seattle Pacific University to study nursing. According to his application, Mr. Michelle is looking forward to bringing a youth perspective to the commission and he would serve on the commission as an organizational representative'",
        "'speaker_0': 'as he was nominated by a Lima fund out of Pueblo. That concludes my remarks that I'd be happy to answer any questions. Thank you very much, Melissa. And is there any question? Okay. I've given a short time. We do have two and two of the appointees with us today, and I'd like to have each of them introduce'",
        "'speaker_0': 'themselves and see if we have any questions. First of all, I'd like to congratulate you for your appointment and which is very exciting. And we hope to be confirming you at the full council meeting coming up. But let's start off with, let's see, the dual.'",
        "'speaker_0': 'Saidu Sadiki I'm saying that Ron, I'm sure that welcome very much and we thank you for joining us and we'd like to hear you give us a little bit of background that you have and what your thoughts are about during the commission.'",
        "'speaker_0': 'Yes, thank you. My name is Gul Siddiqui and I have been very excited to join the commission. I have been living actually in Arizona for the past 15 years, very actively involved for eight years with the International Humanitarian Organization, moved to Seattle, Washington, and was blessed to continue this work and this passion of working with refugees and'",
        "'speaker_0': 'with immigrants locally as well as internationally. Here in Seattle. I live in Sammamish and am. Also working as the development manager with the International Rescue Committee, which is a humanitarian global organization responding to the needs of refugees and one of the largest resettlement organizations here in Washington, bringing in a variety of refugees from many, many different countries'",
        "'speaker_0': '. I have joined them since January this year. And in fact, it's interesting. I'm sitting outside their Redmond Hotel as we speak because I had an appointment to meet with the site director there. And we are serving and. Helping with their resettlement and the education and the medical services very needs that we are seeing for the families here'",
        "'speaker_0': '. So I'm very excited to be part of the King County Commission to be able to channel this effort and bring the voices of the refugees to the commission. Thank you very much. And again, congratulations. How long have you been meeting with the commission?'",
        "'speaker_0': 'Just this year. Okay. Yes. Very recently? Yes. And do you have any thoughts on what you would like to focus on in your work in serving on the commission? Yes. So I would primarily. The need is to bring the voices of the refugees who are underserved and who have needs that many times are overlooked.'",
        "'speaker_0': 'Like Lily mentioned, there is hesitation in sometimes speaking of their needs. And we are seeing a few challenges, for example, of Afghan women who are not seeing medical doctors, even though they may be pregnant because of their hesitation of seeing male doctors.'",
        "'speaker_0': 'So there are a few very sensitive needs that we have to determine how to. Best, you know, bring the resources to them, help with education in this aspect and mainly like connect the dots of what are the resources that are available here in Washington to serve them, but do it in a very empathetic way and do it'",
        "'speaker_0': 'in a way that shows compassion from Washington. And really, you know, help them in rebuilding their lives here in Washington. Terrific. Again, thank you for your wanting to serve. And you seem to have an outstanding background for being a member of this commission.'",
        "'speaker_0': 'I'd like to turn now to our second guest appointing Gray Hyman. But he others who I believe like prefers to go by type and excuse me, prefers to go by check like a checklist. So welcome and congratulations to you as well for your appointment.'",
        "'speaker_0': 'And we'd love to hear from you about your background and as being able to serve on the commission. And you've got a Newt yourself, please.'",
        "'speaker_4': 'I forgot that.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_4': 'As you correctly said, my name is Amanat and. People want to call me tackler but shorten it so I can go by tackler. No problem. I am from Eritrea and I went to school in Ethiopia, so I have the passion to help people who speak.'",
        "'speaker_4': 'Amani and Teresa this are people who live in East Africa, Ethiopia and Eritrea, and as a refugee, I.'",
        "'speaker_1': 'Would share.'",
        "'speaker_0': 'My.'",
        "'speaker_2': 'Experience with.'",
        "'speaker_4': 'Newcomers to this and my profession. I am a teacher. I have been teaching for the last 30 years. At five.'",
        "'speaker_0': 'Years.'",
        "'speaker_4': 'I am. I came to send to the United States and now I am working for open doors for multicultural families. This is an agency who specializes with. Different cultural people getting services for their children with disability. So we.'",
        "'speaker_1': 'We, we.'",
        "'speaker_4': 'Kind of unite disability and the cultural diversity that means people from different cultures having their loved ones with disability need culturally responsive services and in open doors we help with this kind of services. My focus is on Amharic and Greek speaking families, though there are other families from East Africa chicken in Tanzania that are included in my'",
        "'speaker_4': 'caseload. So what would I focus is I would focus on the resettlement of these people. As I said earlier, there are a lot of issues in Ethiopia, Eritrea.'",
        "'speaker_1': 'Other areas in South Africa, Yemen.'",
        "'speaker_4': 'All these people, they come to America and when they come here, they find very complex process. As earlier said, they were thinking to succeed easily and to be to integrate easily into the community. But when they come here, they find a lot of problems.'",
        "'speaker_4': 'So I would share my experience of resettling into the system and trying to be able at least to be self-sufficient on your own and then to help others as well. So that is my intention coming to the commission.'",
        "'speaker_4': 'I think that would be suffice. And I think you.'",
        "'speaker_0': 'Thank you very much for your willingness. And I can tell enthusiasm in serving on the commission. You bring an extraordinary background to that role. Are there any questions of my colleagues from my colleagues, council members and asking?'",
        "'speaker_1': 'Thank you, Chair Coe Wells. I'm sorry for talking so much today. I know we have a packed agenda, but this is a terrific agenda. You. I want to thank both of the appointees for their willingness to serve. And just to do a little advertisment here.'",
        "'speaker_1': 'A few years ago, the council, as we all know, the county owns our hospital. It's run with you, Doug. Medicine and the council a few years ago took steps to make sure we protected the clinics that are offered up there.'",
        "'speaker_1': 'And Harborview offers a very unique, as they describe it, International Medicine Clinic for high quality primary and mental health care services for refugees and immigrants 16 years of age and older. They have tremendous and broad language expertize and really have developed an expertize in this area.'",
        "'speaker_1': 'And I just given the presentation here, an update from the Refugee Commission and this new appointee. TS I thought I would mention it and perhaps encourage them to reach out for a presentation to make sure that the clinic is being connected with leaders in the community who are in direct contact with folks who maybe could use their'",
        "'speaker_1': 'services. It's a tremendous service we provide here and is more important than ever, I think, given the strife and dislocation around the world, much of which is landed here on our doorsteps in King County.'",
        "'speaker_0': 'Thank you, Councilmember Dombroski. And are there any other questions or are you all ready to move on for action on these appointments? I assume that's already.'",
        "'speaker_2': 'Let me just say something.'",
        "'speaker_0': 'Between.'",
        "'speaker_2': 'The expenditure, the the other appointee, Carlos Michael. He is a is taking on the remainder of a term and he was raising rent and goes to Hayes in high school as a member of the SB executive board and is the ACP parliamentarian, which is a very useful thing to happen, is attending and going to attend Seattle Pacific'",
        "'speaker_2': 'University to study nursing next year. So supporters amendment as well.'",
        "'speaker_0': 'Cool. That's in my district where he will be attending college. So any unless there's any concern expressed, we will go ahead and take action on these three appointments. And Andy Nicholas, can we combine these into one vote or do we need to take them up separately?'",
        "'speaker_0': 'I think taking off separately would just be the easiest. Okay, we will do that then. So, Councilmember Dunn, as vice chair, I appreciate you're making these motions. The first one would be proposed motion 2020 20130.'",
        "'speaker_2': 'A proposed motion. 2020 20130.'",
        "'speaker_0': 'Okay. Any discussion? Will I please call the roll? Thank you, Jeff Caldwell. As I'm able to achieve I. Councilmember DEMBOSKY.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Dunn.'",
        "'speaker_2': 'I have.'",
        "'speaker_0': 'Councilmember Thurmond.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Councilmember Berry, I. That's the of the girl. Does the member ban Dybala? Councilmember. Hello.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Chuck Hall Well, I the board is ayes, no nos. The council member bonded by our excuse. Very good. With our vote. We've approved proposed motion 2020 20130, which we will send with the due cast recommendation for the consent agenda at a June 14th Council meeting.'",
        "'speaker_0': 'Okay. Next Council Member Dunn proposed motion 2020 2013 to be proposed.'",
        "'speaker_2': 'Motion 2020 20132.'",
        "'speaker_0': 'Thank you. Any discussion? Okay. Well, please call the roll. Thank you, chef. Caldwell Council member. Balducci High Council member.'",
        "'speaker_1': 'DEMBOSKY, I council member.'",
        "'speaker_0': 'Done.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Council Member McDermott, I. Councilmember Perry, I. Council member at the grow i. Council member Van de Boer. Council member, Sally. I. Scott Caldwell I know what is air no nos in council member Bundaberg Bower. Excuse me. Thank you.'",
        "'speaker_0': 'With our vote we have approved proposed motion 2020 20130. Where am I? Three, two. We will send with with the Duke's recommendation for the consent agenda to the June 14th Council meeting. And then lastly, I council and return proposed motion 2020 20133.'",
        "'speaker_2': 'View Proposed Motion 2020 20133.'",
        "'speaker_0': 'Okay. Any discussion? Okay, Bill and Kirk, then please call the roll. Thank you, Chair Caldwell Council Member By the time I council member DEMBOSKY I council member Dunn I had. Councilman McDermott.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'As a member. Perry, I. Council member Afterglow II Council Member Van de Boer. Council member, Sally High. Chuck how well on the boat is ayes no nos in council member type our excuse thank you with our vote we've approved proposed motion 2020 20133 which we will send with the deepest recommendation or the consent agenda to the June'",
        "'speaker_0': '14th Council meeting. And thank you both of the appointees who are here today. I really enjoyed meeting with you, reading about your background and am very, very.'",
        "'speaker_1': 'Impressed.'",
        "'speaker_0': 'And believe you're going to make very strong commissioners. You do not need to attend our June 14th meeting because we placed the appointments on consent for confirmation and we will be notified. You, of course you can you can tune in as well, but congratulations.'"
    ],
    "Charter Amendment to Move County Elections to Even-Numbered Years.": [
        "'speaker_0': 'Okay. Our last item on the agenda is proposed ordinance 2020 20180, which proposed to the King County Charter to move elections for state and county offices from odd numbers to even numbered years. And we would by passing this, we would send this to the voters of the county for their ratification or rejection of the November eight, 2022'",
        "'speaker_0': ', general election. The Staff Report begins on page 22 and Nick Lowe briefs, and I hope we still have with us Julie Wise, director with the Department of Elections, and Kendell Hudson, chief of Staff, Department of Elections. And Councilmember Bell, did she introduced this?'",
        "'speaker_0': 'Do you want to say anything now? Councilmember rebuild the chair and wait till after the staff report. I'll wait. Thank you. Okay. And we're a little rushed on time. If we can, we would like to take action on this today.'",
        "'speaker_0': 'But if not, we will do so at our June 15th. Go right ahead, Auntie. Good morning. Andy McLellan. Council Central Staff. Just as a note, Cherie Sue is the lead stock of this item, but I will be presenting the verbal staff report this morning.'",
        "'speaker_0': 'I mean, as you noted, we also have staff in the departments, but options on the call materials for this item begin on page 22 of your packet. Proposed Ordinance 2020 201801 Placed on the November 2022 election ballot, a charter amendment proposal to move elections for County Executive, County Assessor, County Director of Elections in County Council members from'",
        "'speaker_0': 'odd numbered to even numbered years. Each of these county positions was most recently elected in an odd numbered year for a four year term ending in in either 2023 or 2025. For each position, the proposed charter amendment would change the following term only to a three year term 2023 through 2026 or 2025 to 2028.'",
        "'speaker_0': 'And then move to move to an even your schedule, subsequent terms starting in either 2026 or 2028 would again be four year terms. A little bit of background. Every November, the state holds a statewide general election. By default, county officer elections are held in even years, with an exception for counties governed by a charter that provides for'",
        "'speaker_0': 'ideal elections such as King County elections for the county executive assessor. Director of elections and councilmembers are outlined in Article six of the King County Charter. As we've, as I mentioned before, they are currently elected in odd years.'",
        "'speaker_0': 'The remaining county office, the prosecuting attorney, is a position created by state law and is elected in even years. The Elections Department administers elections countywide for federal, state, judicial and local positions, along with state and local ballot measures.'",
        "'speaker_0': 'Table one on page 24 summarizes the type of elections currently administered and even at odd years of the seven home rule charter counties in Washington, Kingston, Home and Whatcom hold elections for county officers in odd numbered years. Moving to the analysis section, beginning on page 25, as we just as I just noted, but in table two summarizes'",
        "'speaker_0': 'on page 26, the proposed changes to the election schedule under the proposed Charter amendment, both for the county executive and council members from districts one, three, five, seven and nine. These were most recently elected in 2021 for a four year term to end in 2025 under the proposed Charter amendment.'",
        "'speaker_0': 'The next term would the term would change the following term only to a three year term from 2025 to 2028. Again, after that, the terms would be four years for the county assessor, elections director and council members from districts two, four, six and eight.'",
        "'speaker_0': 'These were most recently elected in 2019. Under the proposed charter amendment. The next term would change for a three year term for 2023 to 2026. After that, the terms would again be for years, the remaining county elected office prosecuting attorney was most direct elected and most recently elected in 2018 and serves four year terms.'",
        "'speaker_0': 'The proposed ordinance also repeals some sections that would no longer apply. Summarizing some of the cost considerations in this can be found on page 27 of your packet. Operational costs election staff indicate that moving county elect county officer elections from odd to even years would not directly result in operational changes or costs to department, executive or election'",
        "'speaker_0': 'staff believe it's unlikely that the proposed change would impact turnout and even are odd years and therefore unlikely it impacts staffing and costs. The only potential, a potential operational change or cost would be if moving it to even year elections resulted in two page ballots.'",
        "'speaker_0': 'Administering two page ballots would incur additional costs for printing, storage, space and staff time to sort through the boxes. Data does not show that moving to giving year elections would necessarily result in two page ballots. There is a table on page 27, table three, that summarizes the total number of ballot items in recent elections.'",
        "'speaker_0': 'The exact number of contests on a ballot given ballot would vary with respect to the allocation of election costs among county, state and local jurisdiction. Election costs are divided proportionally across jurisdictions appearing on a given ballot, the allocation of cost would shift.'",
        "'speaker_0': 'Is moving county officer elections to even years changes whether or not the county appears on the ballot. Turning to your direction or directing your attention to table four on page 29, this shows the potential fiscal impact if county officer elections had been held in even years instead of on.'",
        "'speaker_0': 'Moving County office elections from odd even years when occasionally have a fiscal impact to the county, and even years if the county would otherwise have no races or ballots or other measures on the ballot and table for these would be highlighted in blue.'",
        "'speaker_0': 'If the county does not run a ballot measure in odd years, local jurisdictions may see an increase to their election costs, since there would be no county races or measures. Since 2009, there have been three elections where holding county officer elections in even years would have increased cost to local jurisdictions.'",
        "'speaker_0': 'The 2009 primary, 2011 primary and 2015 primary elections in table four. This is highlighted in orange. In the in these odd year elections, the county did not run a ballot measure and only ran county officer races. If county officer races had instead been held in even years, the county would not have any races or measures on the'",
        "'speaker_0': 'ballot. Additional costs would have been passed along to the local jurisdictions. The cost to the county with the increase in the cost to the state would increase in this case. I will now discuss some of the potential policy considerations.'",
        "'speaker_0': 'This begins on page 30 of the open reading packet. Low voter turnout over the last 20 years, I can tell you have seen higher voter turnout in even number of years. There's a chart on page 30 that summarizes voter turnout or general elections in the county over the last 20 years.'",
        "'speaker_0': 'You can see that since 2010, the county's average voter voter turnout rate is 77% and even number of years and 47% an odd number of years. Low voter turnout data is also available from King County elections by precinct, and this is displayed in the two maps on page 31.'",
        "'speaker_0': 'Regarding impacts to your voter turnout based on voter turnout in other counties, data does not suggest that holding Cobb County not holding county officer elections in even years rather than odd would impact volunteer turnout. Number of races on ballots in county officer elections to even years would increase the number of races on even your ballots and reduce'",
        "'speaker_0': 'the number of races on all of your ballots. It is not clear to what extent voter response rates are impacted by ballot lanes, ballot position or voter interest in the types of races. What measures and finally, alignment with federal and state elections.'",
        "'speaker_0': 'Moving county officer elections even years would align with the election schedule would align the election schedule of these county offices with federal and state elections, which are held during even years. This means that county officer elections would take place in a different electoral context.'",
        "'speaker_0': 'Whether council desires, desires to align county officer elections with federal and state elections is a policy decision. Just a quick timing consideration to place this potential charter amendment on the November 2022 ballot. The last regular council meeting date for adoption as a non-emergency would be July 19th, 2022.'",
        "'speaker_0': 'As I mentioned earlier there, staff from the Department of Elections to answer any questions. This concludes my remarks. Thank you. Thank you very much. And excellent work. And this was mentioned, Julie Wise and Kendall Hudson from the Department of Elections are here to answer any questions.'",
        "'speaker_0': 'Do any of my colleagues have questions of Andy or Julie Wise who can.'",
        "'speaker_1': 'Vote.'",
        "'speaker_0': 'Hudson? COUNCILMEMBER two.'",
        "'speaker_2': 'Thank you. Caracol Wells. So my question is, I sort of heard a sort of reference phrase generally the state legislature considered a change like this to move a lot of these other races at a statewide level to even years.'",
        "'speaker_2': 'And there were a lot of legal hold ups and challenges in terms of what state law required. Did anyone do an analysis of how this might run afoul or not run afoul one way or the other of other state election laws?'",
        "'speaker_0': 'I'm for this. What I would need to divert to election staff, where we would have to get back to SRI or somebody would have to get back to you offline without question for the amount of analysis done. Do we have any data either of our election staff wanting to answer that question?'",
        "'speaker_0': 'Good morning to Chairman Reynolds and council members. It's great to be with you all this morning. Kim County Director of Elections Julie Wise. Councilmember Dunn I'll attempt to answer that question. Under RTW, county offices are up for election an even numbered years unless a home rule county decides otherwise.'",
        "'speaker_0': 'I know this is, I think just mentioned by Andy. So of those seven home world counties in Washington, King Snohomish and Whatcom counties are the only ones who hold elections for county officials in odd years. So I believe it does not run afoul of current RTW.'",
        "'speaker_0': 'Thank you. Are there any other questions? Okay. Look, so, councilman, rebels itching for a question and then this is prepared for me. Thank you. Maybe for Andy. Thank you. First of all, for the very detailed staff report and the visualizations in the staff reporter are really impactful.'",
        "'speaker_0': 'And I think they were super helpful. You mentioned that you looked at the number of resources that would increase or decrease if we made if the voters chose to to make this move. I did a quick count myself, and I believe that the difference in any given ballot would be between one and three positions, up or down'",
        "'speaker_0': ', no more than that in any one year. Is that is that on track with what you found when you looked at it? I believe so. Again, I apologize. Sherry Steele is the lead staff on this, but I believe that is what was in every staff report table.'",
        "'speaker_0': 'Yes. I mean, it makes sense because you've got your council member in each vote, only has one council member and then you've got the executive and two other county wide positions, but they are not all up in the same cycle.'",
        "'speaker_0': 'So you would have your council member plus the executive, I believe, or you would have two other statewide positions. So and that depends on whether your council members, even district or district. But the point is when people talk about the ballot getting longer, the most number of positions that you would see added to any ballot would be'",
        "'speaker_0': 'three. On ballots that routinely have between 20 and 30 plus items on them. That's without a whole lot of measures. And by the way, this this this council has been responsible for a whole lot of measures. Thank you.'",
        "'speaker_0': 'Thank you. Council members online and then followed by council member Jim Barnes.'",
        "'speaker_2': 'Thank you, Chair Wells. Thank you, Andy, for this great briefing. Can you explain a little bit more what the reasons are between the fiscal impact chart? The table four that you had provided were the reasons behind increases or decreases to estimated costs.'",
        "'speaker_0': 'Yes. Just give me 1/2. I do apologize and I will defer again if the election staff wants to increase. But I believe, Julie, if you would like to help, I believe it's if one is removed, there'd be costs because there's proportionately divided among the jurisdictions.'",
        "'speaker_0': 'If the elections were shifted and ones were removed, there would be a cost that if the jurisdiction still had ballot items on the ballot, that they would receive that reduction in cost if the counties that had one more time.'",
        "'speaker_0': 'But that's what I think is happening there. It's offsetting the cost. If the county would remove their ballot items from the ballot, but again, would defer to election staff on the exact date of calculations. Thank you.'",
        "'speaker_2': 'Julie, did you want to add anything to that?'",
        "'speaker_0': 'I think he did a fabulous job. But yes, it really is the cost. The cost shifting between King County, the state and local jurisdictions based off of what appears on the ballot. So, for example, let's use like a real world example here.'",
        "'speaker_0': 'So in 2015, primary, the city of Kent. So if there wasn't anything from King County on the ballot in the 2015 primary, the city of Kent would have seen its elections cost go up from 43,000 to about 62,000.'",
        "'speaker_0': 'Right. For the years that the county cost would have increased. As Andy laid out in the in her presentation and in the report, you know, the years the county cost could have increased that numbers between 1.5 and 2.5 million.'",
        "'speaker_0': 'But it's all about that shifting between county, state and local jurisdictions about what appears on the ballot.'",
        "'speaker_2': 'I don't think I'm understanding at all, but I'll ask for further clarification offline.'",
        "'speaker_0': 'And then I'm happy to. We have Chief of Staff Kendall Le Van Hudson, who does a fabulous job explaining it. So we want her to take a go at it as well.'",
        "'speaker_2': 'We're certainly happy to do that.'",
        "'speaker_0': 'Let's have let's do that. Is she here? I'm here. Thank you. Count for number 500. Kendall Hudson, chief of staff for King County elections. This takes me multiple times to grasp when I first started. Seconds number. It is not you.'",
        "'speaker_0': 'The way election costs are divided is based proportionately on the number of registered voters per jurisdiction. So Kent's portion is based on how many registered voters there are out of the total. When you add the county in or take the county away, that means a whole lot of registered voters out of that total.'",
        "'speaker_0': 'So the costs aren't going up in any way. They're just spread out differently depending on what that denominator is. I don't know if that helps, but we can we can go off and do it again, too, if that helps.'",
        "'speaker_2': 'So why would county costs go up? First of all, by reading the chart that costs would go up if we moved to odd years or mine. I mean, even years are in my misreading that.'",
        "'speaker_0': 'It would really depend on the year. So there are some years where the county now wouldn't have anything on the ballot. In those years, local jurisdiction costs and state costs would go up. There are other years where the county otherwise wouldn't have had something on that even year ballot, or all of a sudden the county is paying'",
        "'speaker_0': 'a large share of that election. So the other I think thing I didn't mention is it doesn't matter how many things you have on the ballot. If you're on the ballot, it's based on how many voters you have.'",
        "'speaker_0': 'So the county could have one race or the country could have five races and ten measures. The course, the question of the cost is the same.'",
        "'speaker_2': 'I got it now. Thank you so much, gentlemen.'",
        "'speaker_0': 'Thank you. Councilmember Dombroski.'",
        "'speaker_1': 'Thank you, Chair. Call Wells and Andy, thanks for your excellent staff report presentation. Thank you, Director Wise, for being here. Very interesting issue with respect to the turnout and the issue of ballot drop off. We know that in a presidential year, a lot of people vote in that presidential race and some don't vote for anything else on'",
        "'speaker_1': 'the ballot. But usually as you go down, there's a drop off. Where would the county races appear on the ballot? These are the federal candidates or even years in Congress, state candidates, when we have the statewide elections, legislative candidates.'",
        "'speaker_1': 'Kind of. Where would these races appear? Other ballot questions, city races. If they were to come over.'",
        "'speaker_0': 'Thank you, Councilmember Dombrowski, for the question. You're correct. They would come after you got federal, state, and then it would.'",
        "'speaker_1': 'Be all.'",
        "'speaker_0': 'The state offices and then the county. And we can, of course, draft up an example of what that ballot would look like.'",
        "'speaker_1': 'Oh, you could. Sure, we could do that.'",
        "'speaker_0': 'That would be.'",
        "'speaker_1': 'Amazing. So I was actually I didn't know it would. So the county races would be the last on the ballot down at the bottom on the back side. Is that what you're saying?'",
        "'speaker_0': 'That is correct. But they would come before, right? Like if there was local jurisdiction ballot measures. And except for judicial, I think would be the very last.'",
        "'speaker_1': 'Okay. I don't mean to put you on the spot on this, because I.'",
        "'speaker_0': 'Think.'",
        "'speaker_1': 'It might be interesting to see see a ballot. And then since we have some counties that are doing this, of the 700 charter counties in the state, three of us, I think you said are on odd year, the other four on even.'",
        "'speaker_1': 'Could we have some analysis done of the percentage drop off of the county races, you know, and maybe apply that to here? I think as I understand it, the expectation is that are the number of people participating would still be expected to be higher.'",
        "'speaker_1': 'But I'm kind of curious as to the magnitude of that. If they were to use other jurisdictions, say the mean of the other four counties that are doing it, even their drop off on a county council or some of those are commission counties may be kind of what that would be.'",
        "'speaker_0': 'Okay. Thank you. And Counsel.'",
        "'speaker_1': 'I have one more question.'",
        "'speaker_0': 'Okay. Yeah.'",
        "'speaker_1': 'This is of great this is of interest to me. I didn't hear it addressed in the public testimony, which was excellent or in our staff. And I'm not sure if that's because it's more of a political question. But when you're talking politics, you're often talking money and we no longer have public financing in the county.'",
        "'speaker_1': 'We did have a program years ago, and that is a big issue in terms of access. And I'm it seems to me the cost to run an election where if if the number of voters you have to reach, it'd be higher.'",
        "'speaker_1': 'And I am interested in whether we could do any assessment of of that, either at the county with our independent staff or maybe maybe some of the folks who are interested outside the outside of our government could help us with that.'",
        "'speaker_1': 'But the issue of kind of incumbents being able to raise a lot of money and a barrier that that attracts to greater participation on the ballot is such is of interest to me as we explore this question. Thank you.'",
        "'speaker_0': 'Jerry. Thank you, Councilmember Perry, followed by councilmembers. Hello. Thank you. Thank you for this. For all of the great testimony and for this report, direct wise, I'm always interested in your reports. And so it's from what I'm hearing statistically, if we actually follow the data on this, that there is more participation by by a huge volume of'",
        "'speaker_0': 'people voting on those currently off year elections when they're moved to on your elections or on year elections moved to even year elections, there is because there's a certain amount of voting in the on year elections. And then then what this what the data is saying, if I'm hearing it correctly, is that it only increases, it doesn't'",
        "'speaker_0': 'decrease, but it only increases when it is moved to the even year elections. Is that correct? Director was doing to answer that. Councilmember Perry, thank you for the question. You know, it's really difficult to predict what changes could happen with turnout.'",
        "'speaker_0': 'But yes, even your turnout often reaches 70, 80% in the end. But then in an odd year elections, we will see like here in South King County jurisdictions, hitting 30% turnout. So even years generally, again, are getting double what the turnout is in an off year election.'",
        "'speaker_0': 'And I'm not sure if that answers your question. Well, I just I'm trying to be really clear on like trying to understand this. And first, I'd love to see a ballot. That would be awesome. And maybe I need the the off line conversation that councilmembers are asking for.'",
        "'speaker_0': 'The question I have is, statistically, we have the statistics, I think, that show the increase in participation specifically for those that would otherwise have been in an odd year election when they moved to an even year election, either in our state or elsewhere.'",
        "'speaker_0': 'We have the statistics available to us, do we not? Of those that wear those ballots, then have an increased response than those of where they sit on the ballot, simply because an exponential number or a greatly increased number vote on even year elections.'",
        "'speaker_0': 'And by virtue of those that would already be motivated to vote in odd year elections, you already have that population. Plus you're putting in front of people who vote only in even your elections that don't often vote in odd years.'",
        "'speaker_0': 'So you're putting it in front of more people. So I'm just wondering about the data itself. So because we have these sort of big ideas about it, but I know that you were talking about the statistics and others were talking about the statistics.'",
        "'speaker_0': 'Is it possible to actually see those statistics where there's been a shift that we've been able to record? As in to say, you know, selecting those that voted that don't previously they vote only and even your election said don't previously vote in of your elections showing statistically where those folks now vote when they had the opportunity.'",
        "'speaker_0': 'You know for those folks down ticket the police director was. Councilmember Perry, just to clarify on the question, of course, I'm happy to get my, you know, my data from the office around this to see what sort of data we can pull out here.'",
        "'speaker_0': 'So I think we can definitely follow up. I'm not sure if the question is, do we have any models or examples of things that used to be an off year elections and are pulled now to the general and that we've seen a higher turnout in that.'",
        "'speaker_0': 'I can't in the 22 years that I've been here in elections, can't recall something where we're going to be able to identify that. But we certainly will take it back to the office and dig in deeper around that.'",
        "'speaker_0': 'And it sounds like it looks like, Councilmember Perry, that that was your question is do we have something that that would which would show a similar sort of change? Right. Are there examples that exist that way? Because I think that's the verbiage around this is people are saying, no, no, it won't.'",
        "'speaker_0': 'And others are saying yes, it will. And do we have any simple examples of where, in fact, that has been the case? I'm just curious about that. Councilmember Perry, I'm going to move on now to Councilmember Satellite previous question, because we're really getting late.'",
        "'speaker_0': 'We're already almost 15 minutes over our meeting time. And I want to have to thinking about did she be able to comment on her legislation? So Councilmember satellite and then councilmember about it.'",
        "'speaker_2': 'Thank you. Chair Caldwell's I think I'm asking something in a similar spirit as Councilmember Perry, but maybe hopefully easier data to track down in the areas that have shifted to even year elections to local level elections see the same or significantly higher percentage turnout as compared to if they were still in the artier elections.'",
        "'speaker_2': 'This is not a trend that we see.'",
        "'speaker_0': 'From some members. Actually, we can try to dig into a little bit of the data around California. California has completed sort of a recent change, which is what comes to mind with Councilmember Perry's question as well. But when we look across the state, turnout patterns across counties with even versus your county races don't show any real pattern'",
        "'speaker_0': '. And turnout varies so much anyway across the state. But looking across the country, we haven't really been able to find any real valid comparisons to help us understand what might or might not happen with such a change as this.'",
        "'speaker_0': 'But again, happy to take it back to the awesome Team Kerry elections team to see if there's some more data sleuthing we can do here in Washington state and across the country.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. I'd like to now have Councilmember Balducci speak on the legislation. And Councilmember Bell, I think given the lateness of the time, we will defer taking action on this to our June 15th meeting so we can get the material from director wise as well.'",
        "'speaker_0': 'Yes, thank you, Chair. I think that's that's good to make sure that people get answers to their questions to the extent that there is available before we before we take action would would make good sense. I just wanted to say a few words about this.'",
        "'speaker_0': 'The this proposal came to me from some advocates in the community for who are looking to improve access to elections. It is a principle that this council has supported in a number of ways over the last several years, including expanding access to ballot boxes, including really pioneering prepaid postage for ballots that then went statewide.'",
        "'speaker_0': 'We have, along with our elections director and department, been very diligently committed to increasing access to the ballot box and thereby making sure that the people like us who are elected to represent the public are elected by as representative of a sample and as large of a sample of the public as possible.'",
        "'speaker_0': 'And so this that's what this is about. This is about making elections, continuing to make elections fair and accessible. You've heard a lot of numbers, and I know that there's a lot of desire to dig down deeply. But just at the very base level, you look at the turnout for positions in this county like assessor in 2019'",
        "'speaker_0': ', where the turnout was 31% of registered voters like our elections director who we love. But who's the vote on her line in 2019 was 41% of registered voters. And then in 2018, the year before, when our prosecutor countywide position is up 61% of total voters.'",
        "'speaker_0': 'So you see just the number. The increase from one year to the next is in double digits. I think it was pointed out very well in some of the excellent public comment that we heard today that we we would invest in something that got us safe, two, three, 5% increase in participation.'",
        "'speaker_0': 'And here we're talking about 20%, 50% in some years. It's it's very compelling. But for a neighborly example, last year, in 2021, our King County executive race saw 40% turnout. The Pierce County executive, who's I think they're statutory county and therefore do elections in even years.'",
        "'speaker_0': '82% turnout. Turnout for King County Council members in 2021 range between 30% and 47%. Turnout for Pierce County Council members in 2020 ranged between 75 and 85%. And you're not always going to get those eye popping numbers because it's not always going to be a presidential election.'",
        "'speaker_0': 'But those are the people who voted for president and Pierce County Council. They got down there to those to those lower level ballots, lower level votes. Voters who are more engaged in odd year elections tend to be older, whiter and wealthier than the general electorate that vote and they are voters more likely to be paying attention and'",
        "'speaker_0': 'voting in off year elections by moving to even year elections. We would align those with these important local offices with more high profile state and federal offices that attract higher turnout by more voters and more diverse voters. Younger people, more people of color, more renters.'",
        "'speaker_0': 'That makes us the people who are elected to sit here at King County, more representative of the people who send us. And that's that's got to be good for democracy. So I'm going to stop right there. I guess the last thing I will say is we are by no means pioneering here.'",
        "'speaker_0': 'If we do this, if we put this out to the voters and the voters approve it, we will join the majority of counties in this state that have their positions elected in even years, because most states do that because they are cold states.'",
        "'speaker_0': 'But we will also join other charter states that do this. So charter counties, I should say. So it looks very compelling to me. I want to make sure that members have a chance to get their questions answered and that we can then hopefully move forward to ask the voters to have their say about when they would like'",
        "'speaker_0': 'to see these positions on the ballot. I thank you, Chair Caldwell's for the extra time today. Well, thank you. I found Jeremiah's very compelling, and I'm glad that I also signed Spencer to this legislation. Are there any questions of councilmember ability to.'",
        "'speaker_0': 'If not, we will take this up at our next meeting, which is on June 15th, and we will hope to have some materials or a sample ballot that we can look at that will be provided by Director Wise from the Department of Elections.'",
        "'speaker_0': 'And I think this has been a terrific discussion and something that is new to all of us here at this county that I think has a great deal of promise. And I thank you, Councilmember Belgian chief, for bringing the legislation forward.'",
        "'speaker_0': 'Now that I'm Kirk, I know that Councilmember Von Bauer was excused from some votes. Were there any other members who were excused? Madam Chair, council member Monday about what is on the line right now. Oh, yes. Okay. Councilmember Bowen.'",
        "'speaker_0': 'Right. Would you like to vote on the measures that you missed?'",
        "'speaker_2': 'Thank you, Madam Chair. Can you hear me all right?'",
        "'speaker_0': 'Yes, we can, Madam Chair.'",
        "'speaker_2': 'Thank you. All right. Barbosa Affirmative.'",
        "'speaker_0': 'Okay. So for any of the votes that you missed, you are saying you about you vote now affirmatively for all of them.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_0': 'Thank you very much. And did any other member miss the vote? No, Madam Chair. No, nothing. Very good. Before we adjourn, I'd like to let you know that our next regular meeting of the committee of the hall is scheduled for June 15th, at which time we will hear from a panel providing a status report on the Harborview'",
        "'speaker_0': 'Medical Center. We'll also take up action on the ordinance, placing the ballot a charge, a change to our ballots to even number of years. And we will have further discussion and possible action on the reappointment of beneath the condo wall as director of the Department of Public Defense.'",
        "'speaker_0': 'And a preview for our meeting after that, which will be July six. We're planning now to have a panel and gun safety measures that are provided by the state, the county and other local jurisdictions, jurisdictions likely these will the panelists will be members of various departments in the county.'",
        "'speaker_0': 'And we will also have a discussion on what else might be done to ensure greater public safety in the question of gun use. I know that Councilmember Dan Barsky is already working on some legislation, and if that timing works out, we could take that up as well.'",
        "'speaker_0': 'If anybody else is working on legislation, we might be able to include that as well. So one other item that we will also hear from Dwight Daly and we will take up a motion for a discussion and possible action on that is sponsored by council members on extreme weather sheltering.'",
        "'speaker_0': 'And so I think that that'll be a good time to get ready for this summer. I thank you all for participating in today's meeting. And if there's no other business we are chairing.'"
    ]
}