{
    "Funding Transfer to Support Khemara Buddhikaram Buddhist Temple for Vesakha Day.": [
        "'speaker_0': 'Thank you. We do have some funds transfer items that were in the consent calendar item. Those were 16, 18, 20, 32 and 34. Believe with those. We take those separate to traditionally and so just want to motion in a second for those.'",
        "'speaker_0': 'Did you want to read those?'",
        "'speaker_2': 'Madam Court Item 16 is a communication from Councilwoman Manga recommendation to increase appropriations by 3000 to provide a donation to the La Cerritos Neighborhood Association to support their annual summer concert series at Los Reedus Park. Item 18 is a communication from Vice Mayor Richardson recommendation to increase appropriations by $500 to provide a donation to City Heart.'",
        "'speaker_2': 'Item 20 is a communication from Councilman Austin. Recommendation to increase appropriations by $5,000 to provide a donation to the Long Beach Partners of Parks in support of the Long Beach Juneteenth celebration. Item 32. Is a communication from Councilman Super, not Councilwoman Price recommendation to increase appropriations by $2,000 to provide a contribution to the Rancho Los Alamitos for'",
        "'speaker_2': 'the Cottonwood Awards luncheon. And item 34 is a communication from Councilwoman Sauro recommendation to increase appropriations by $2,000 to support the Buddhist temple for the Long Beach. The Scar de. That concludes the funds transfers and there's no public comment on these items.'",
        "'speaker_0': 'Thank you. I do have a comment by Councilman Mongo.'",
        "'speaker_7': 'Thank you. Specifically, my agenda item related to an opportunity to do a concert in the park on a Friday at La Cerritos Park is part of a continued effort to build up and better, better understand the demographics and volume of attendance that we could receive if we move the municipal band to Fridays.'",
        "'speaker_7': 'And so in a partnership with the Low Cerritos Neighborhood Association, we're putting forward these funds to explore what a Friday night concert would look like versus the typical Wednesdays, and to see if that has a better following so that if that is the case, we would be able to potentially bring in additional funding for the municipal band'",
        "'speaker_7': 'on a long term basis. This has been a priority of understanding how to best fund and maintain the municipal band into eternity. And to be able to do that, we have to take some risks. And so I appreciate the listeners Neighborhood Association for joining me in this great opportunity.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Sara.'",
        "'speaker_8': 'Thank you. I wanted to speak on the Long Beach for Saturday. This is the first time we're doing it in Long Beach. And this is a sacred day to Buddhists, millions of Buddhists all over the world. And we'll be doing it here on the terrace on May 15 to bring together all of the Buddhists in the city'",
        "'speaker_8': 'of Long Beach, to honor the day, to commemorate the birth of Buddha and birth enlightenment, death and his passing into Nirvana. And this has been recognized by the United Nations as an important day. Thank you very much.'",
        "'speaker_0': 'Thank you. Councilmember Austin.'",
        "'speaker_3': 'Thank you. I've also have a transfer item up. To celebrate or to help us celebrate the Juneteenth celebration. As many of you know, last year I brought forward the resolution that was unanimously passed by the council to identify, celebrate Juneteenth as a day of celebration in the city of Long Beach.'",
        "'speaker_3': 'I had the opportunity of working with Connie Olden, who was no longer with us, and John Malvo and many folks in the central area. When we first started the Juneteenth celebration here in the city of Long Beach, Juneteenth celebration and MLK celebration were always the vision was always to to grow that celebration and to expand to two'",
        "'speaker_3': 'areas where the entire city could enjoy. And so the downtown this year, the Juneteenth celebration is going to be at Rainbow Lagoon that I think fulfills a dream and a vision of many years ago. And I expect that to be a great celebration.'",
        "'speaker_3': 'So thank you very, very much and ask for your approval.'",
        "'speaker_0': 'Thank you. There's no other comment on these items. And so we will I believe there was no public comment. And so we will go ahead and cast her votes.'",
        "'speaker_2': 'Motion is carried.'"
    ],
    "Resolution to Amend the Master Fee and Charges Schedule.": [
        "'speaker_0': 'Thank you very much. We do have one hearing, so let's go ahead and begin that hearing, please. It's on the master fee schedule.'",
        "'speaker_2': 'Report from Financial Management Recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt a resolution amending the master fee and charges schedule citywide.'",
        "'speaker_0': 'Thank you. There's a motion any second on this already. Let me turn this over to Mr. Modica.'",
        "'speaker_1': 'Thank you, Mr. Mayor. We can give a short staff report from Grace Yoon, our budget manager.'",
        "'speaker_8': 'Great. Thank you, Tom. Good evening, Mayor. And members of the City Council. City Council's approval is being requested to amend the Fy22 master fees and charges schedule. This is something that's updated citywide at least twice a year to allow departments to meet City Council's stated policy on user fees, which calls for full.'",
        "'speaker_2': 'Cost recovery whenever appropriate.'",
        "'speaker_8': 'City Council last approved an amended master fees and charges schedule on September 7th as part of the Fy22 budget adoption. So this report, the changes to the master fees and charges schedule includes adjustments across six departments, with changes based on the completed cost of service study.'",
        "'speaker_2': 'For Energy Resources and Public Works.'",
        "'speaker_8': 'Department, which were presented to City Council on February 1st of this year. In addition to those changes related to the cost of services study, proposed fee changes also include other department fee recommendations necessary for administrative and operational purposes.'",
        "'speaker_2': 'So that concludes my report.'",
        "'speaker_8': 'And Department Representative representatives are available to answer any specific questions you may have on proposed changes.'",
        "'speaker_0': 'Thank you. Do we have a public comment and we'll come back to the diets, please.'",
        "'speaker_2': 'There's one public comment. Dave Shukla. Dave Shukla. He's not in the audience.'",
        "'speaker_0': 'I don't see public comment. We to go and go back to the dais. Councilman Mongo.'",
        "'speaker_7': 'I just want to take a moment to recognize the staff at financial management. It has taken a long time for us to get to a place where we know and understand our fees in a meaningful way. I know it took many years.'",
        "'speaker_7': 'I do want to ask specifics on an animal control licensing fee for about four years now. We've been asking that all of the licenses get coordinated through a process where you would be able to pay a partial year to catch up so that all your animals can be renewed at once, saving the department hundreds of dollars a'",
        "'speaker_7': 'year, if not definitely be thousands by now considering postage rates. Instead of mailing my house three animal dog license renewals at three different months of the year. You'd save a dollar by putting them all together. This has been three years in the making and I've heard excuses of, Well, we don't have a fee that works for that'",
        "'speaker_7': 'or we can't prorate. Do we have any progress towards that? Do we need to add a fee to the schedule or do we need to make any annotation at this time that we'd like to be able to prorate and ensure that entering into the fiscal year of 2020.'",
        "'speaker_7': 'Three. No. Yes. 2023. That that would be policy.'",
        "'speaker_8': 'Yeah. We have our director.'",
        "'speaker_2': 'Of Parks, Recreation and Marine.'",
        "'speaker_8': 'Who can come up and talk on that. Parks, Recreation and Marine was part of the round one fee study for our citywide fee study. So that may have also been something that was looked at during that.'",
        "'speaker_7': 'And I apologize. I know that this started before our current Parks and Rec director. We appreciate you. And we know you picked up a lot of projects and this is a big priority and I'll make sure it's done before the next fiscal year.'",
        "'speaker_1': 'Yeah. Thank you, Councilman Mongo. I know Stacy Danes, who unfortunately is ill tonight, or she'd be able to probably answer this more specifically. But I know in our recent council briefing last month, we did discuss this in depth.'",
        "'speaker_1': 'And I know she is looking into that alignment, which makes a lot of sense. So we are working towards that. And I appreciate your bringing attention to this financial matter.'",
        "'speaker_7': 'Thank you. Mr. Monaco, do I have your assurances that this is something we can pursue before the next budget cycle? Or do I need to bring an agenda item?'",
        "'speaker_1': 'Sure, we'll work on it. I'll get this as an item you and I've talked about, and we're talking with the Parks and Rec director about what's the path forward and if you'll need to bring an item. If there's some other challenge that we need to tell you about, we will do that.'",
        "'speaker_7': 'Thank you. I appreciate it. I know it's a priority for animal lovers across the city and an opportunity for us to really find some cost savings and save the money for the department. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Richardson, any comments?'",
        "'speaker_1': 'Okay. I'm good. Thank you.'",
        "'speaker_0': 'Okay. We have a motion in a second. Please cast your votes.'",
        "'speaker_2': 'Motion is carried.'"
    ],
    "Agreement with ASM Global for Convention and Entertainment Center Management.": [
        "'speaker_0': 'Thank you. We're going to go ahead and go right into item 23, please.'",
        "'speaker_2': 'Report from Economic Development. Recommendation to execute an agreement with ASEM Global for Management of the Long Beach Convention and Entertainment Center, District one.'",
        "'speaker_0': 'Thank you. And before we begin, Councilwoman Allen, I.'",
        "'speaker_4': 'Yes, I have to recuse myself with this item. I live within 500 feet of the convention center.'",
        "'speaker_0': 'Thank you. There is a motion in a second, but I want to start off, of course, by doing the staff report.'",
        "'speaker_1': 'Thank you, Mr. Mayor. We do have a staff report. This is a very significant item. The council has been really involved in this through some closed session negotiations, and we're really happy to be here for an open presentation on a lease amendment.'",
        "'speaker_1': 'We have been for the past several months looking to really reposition our convention center, our arena, our theater, and really, you know, take even more steps beyond the amazing facility that it is today, modernizing the agreement and achieving some key goals.'",
        "'speaker_1': 'So we're really happy to be here. It's been a very good negotiation and I think it's been beneficial for both parties. And we're looking for a long term, ten year agreement for your approval tonight. So I will turn it over to Gianni Vallejo, our acting director of economic development, to walk us through the details.'",
        "'speaker_9': 'Thank you. Good evening. Honorable Mayor and council members. Simon is intended to provide details. As Tom noted, I've negotiated terms for the management of the Long Beach Convention and Entertainment Center. Start off with a little background. The original agreement from 1991 was a spectacle management group, which subsequently became SMG.'",
        "'speaker_9': 'In 2019, AG Facilities and SMG merged to become ASEM Global, the largest convention and entertainment venue management company in the world. The current agreement is set to expire September of next year, and while the original agreement has served the center well, it's provided for expansion, improvement and flexibility.'",
        "'speaker_9': 'Many of the existing terms and fee structure are outdated. The agreement lacks incentive for key priorities and lacks performance measures more consistent with modern center management agreements. In June of 2021, Edison Global submitted an unsolicited proposal to, among other things, extend the term of the existing agreement with direction from council staff of engage with Anthem RSM Global'",
        "'speaker_9': 'to update and modernize the agreement. First, we negotiated with ASM Global for a relatively short term, a seven year extension through 2029 with a three year option to extend. This gets us through the Olympic Games but does not overextend and provides the city the opportunity to reevaluate the agreement at that time.'",
        "'speaker_9': 'These revised terms would commence on October 1st, 2022, to accommodate the fiscal year. The base management fee will be set at $500,000 annually with CPI increases. This is an almost $1.5 million reduction in the current base fee. A committee consisting of City, ASEM, Global and CVB representatives will convene annually to develop an annual operating plan to assist'",
        "'speaker_9': 'in establishing benchmarks, capital improvement priorities and key performance indicators. RSM Global will provide $7 million immediately in direct funding to Citi for urgent capital improvement items and another 3 million if a three year option is exercised. ESM Global will incorporate the use of a mobile based survey tool to measure visitor and user experiences across all venues and'",
        "'speaker_9': 'event spaces. Annually and prior to each fiscal year, the committee will meet to assess and recommend weightings for financial and performance based benchmarks for a fixed pool incentive program. The purpose here is to incentivize the city's financial, operational and booking priorities.'",
        "'speaker_9': 'A special revenue incentive provision would provide financial incentive for new and special revenue generation. This would only be paid after city receives 100% of established financial benchmarks. This incentive is only available for new revenue and goes away if and when revenue is established as an ongoing revenue source.'",
        "'speaker_9': 'This may include development of new food and beverage or special events outlets. It's m global will continue its commitment to labor relations through labor, peace and collective bargaining agreements. And the city will be afforded the opportunity to review and provide input on key facilities.'",
        "'speaker_9': 'Staffing changes. In addition to already established to the already established City Free Youth Program supporting large citywide events, ASM Global will now provide a Community Free Youth Program providing up to 100 hours of free youth for small community based meetings and gatherings.'",
        "'speaker_9': 'ASEM Global will establish a $350,000 annual marketing fund to increase by 5% annually, which will include diversity, specific outreach and marketing efforts. And finally, the city retains the option to develop the elephant lot during the term of the amended agreement, and ASEM Global is committed to working with the city to accommodate preparations for the upcoming Olympic Games'",
        "'speaker_9': '. Here we have a brief summary of the proposed benchmarks, KPIs that would be tracked and measure to ensure city priorities are structural lies and that performance standards are set for ASM Global. There are also these are also the goals ASEM Global would need to meet to access the fixed pool incentive.'",
        "'speaker_9': 'Broadly, these categories would include operational and financial performance, community benefit and venue activation goals, and they would include priorities such as revenue in revenue achievement, visitor satisfaction, energy efficiency, diversity, equity, inclusion, and venue booking goals, among others. One area of distinct interest from council was looking at the possibility of utilizing venues for more commercial and entertainment uses'",
        "'speaker_9': '. In particular, the Arena Pacific Ballroom has been majority utilized to support conventions and trade shows. The city here would provide a booking plan for ASM Global to work towards as part of its fixed pool incentive as the venue requires updating to Bette to better accommodate entertainment functions.'",
        "'speaker_9': 'These goals would be developed pre and post capital investment. The proposed initial arena booking goals would be in years. One through four city would set a goal of 30% or more for commercial and entertainment bookings for years five through ten after improvements are made, such as updated seating and concessions at the arena.'",
        "'speaker_9': 'That booking goal would increase to 50% or more for commercial and entertainment bookings. It's some global has continued to work on programs to benefit the center even during the prolonged COVID closure. Some of the new special revenue programs at the center include participation in the ASEM Global Sponsorship Network, estimated to result in $200,000 in new revenue annually'",
        "'speaker_9': '. And a new Ticketmaster exclusive agreement estimated to result in $400,000 in new revenue annually. Even during COVID as and Global has continued to develop revenue opportunities for the center. And despite the uncertainty of the industry, they are willing to make substantial investment to continue as our partner at the Long Beach Convention Entertainment Center.'",
        "'speaker_9': 'And lastly. Just a brief reminder that the center has substantial facility investment needs and there is a potential to utilize ASM Global's capital investment payment, along with any stronger net position resulting from this agreement to fund a broader capital investment effort.'",
        "'speaker_9': 'Any consideration of financing or debt service would be evaluated with the Council at a later date. So we believe these terms represent an updated agreement that provides for increased revenue to the city, more accountability for the operator, and incorporation of city council priorities.'",
        "'speaker_9': 'Thank you. And this concludes my staff report.'",
        "'speaker_0': 'Thank you very much. Let's go ahead and do public comment first and then we will go back to the council. And then we have four members that have signed up. And Madam, quickly want to read those four names and then we'll go from there.'",
        "'speaker_2': 'Can the following people please line up? Bob McClintock said Ramani. Nikki Claire and Todd Lummis.'",
        "'speaker_5': 'Right.'",
        "'speaker_2': 'You have 3 minutes.'",
        "'speaker_1': 'Mr. Mayor. Members of the council, I want to thank you very much. My name is Bob McLintock and executive vice president of Convention Service, Race and Global. And I'm here on behalf of the entire company. And Ron Benson, our president.'",
        "'speaker_1': 'I'm here to actually direct three. Thank you. First, I want to thank this body here. We are so fortunate in Long Beach to have an engaged council and mayor and what we do and the thousands of people who make their living in the hospitality industry.'",
        "'speaker_1': 'Thank you for that. Because without that, we could not have the lives that we have. The second group of people I want to take a moment to thank are the men and women who work at the Convention Center itself.'",
        "'speaker_1': 'Their work over the past two years has been unbelievable. The challenges they face, the way they've stepped up. And and I know that they are excited to be able to continue to serve the customers that come to Long Beach.'",
        "'speaker_1': 'In particular, I want to take a moment to thank Charlie Byrne. Some of you may know Charlie and I go way back to our days in the city. He came here on what I call the Gilligan's Island tour.'",
        "'speaker_1': 'I asked him to come here for six months to help me. That was 11 years ago. He has agreed to take a promotion with us to move to Fort Lauderdale. He's going to take on two very important jobs there.'",
        "'speaker_1': 'One, of course, is being the regional vice regional general manager of the convention center there and in Fort Lauderdale. And the second is to be closer to his impending grandchild. The last person I want to thank and I have to do this is Steve Goodling.'",
        "'speaker_1': 'I'm very fortunate and blessed in my career to be able to travel the world and work with convention centers and destinations all around the world. Nowhere do I see a partnership with our destination marketing organization and the vision and commitment that Steve has brought to this and his willingness to work with us to create that unique product'",
        "'speaker_1': 'that is Long Beach is really, I think, what makes this community so special. So thank you all and thank you for your time. Good evening, Mr. Mayor and council members. My name is Sid Romani and I'm the area general manager for Hyatt Hotels overseeing the Hyatt centric and the Hyatt Regency.'",
        "'speaker_1': 'Thank you for supporting the Convention Center. It is such a big part of our local community and the center of our hospitality hospitality community. As you know, the Hyatt Regency is connected to the convention center. In my 24 years of working with Hyatt.'",
        "'speaker_1': 'I have never seen a strong and effective relationship between the Convention Center and CVB, as I have here in Long Beach. I think through the site inspections around Bryan Brothers, the ACP site, and to see all the stakeholders and the community come together to try and attract this business to Long Beach is truly phenomenal.'",
        "'speaker_1': 'Their hard work and collaboration bring thousands of guests to our hotels every year. Thank you for keeping our award winning teams at the Center and CVB together for succeeding Long Beach. I also have some friends in the audience that would like to stand up and show their appreciation.'",
        "'speaker_1': 'So thank you so much for your support.'",
        "'speaker_7': 'Good afternoon, Mayor Garcia and council members. My name is Nikki. Eloise, Iris Claire. I am the owner of George's Greek Caf, along with my family. We have been in the Long Beach community for over 42 years and have been in business in Long Beach for over 22 years.'",
        "'speaker_7': 'First, I want to thank you for your support for the team at the Long Beach Convention and Entertainment Center. These events are a huge part of our business and I know we've always realized it, but didn't realize how much until this pandemic hit us and saw how significantly this affected our business.'",
        "'speaker_7': 'Actually, since the pandemic, these past couple of months are the first that we've had, two that are in the positive. So thank you to the convention center. It's a big, big part of it. I just want to reinforce how important the center is to our organization, to our businesses, to our local businesses, to our restaurants, to our'",
        "'speaker_7': 'hotels. The CVB and convention teams have been an integral part of our success, and they have been incredibly supportive of us. And thank you for your continued support as well.'",
        "'speaker_1': 'Good afternoon, mayor garcia and members of the council. I'm todd limits. I am a founding partner of pacific six enterprises as well as Ocean Center and Breakers Development. But today, I stand before you as the chairman of the Board of the Convention and Visitors Bureau.'",
        "'speaker_1': 'In that position, I've had a unique front row seat to see how Steve Goodling and the CVB interact in a truly symbiotic relationship with the three legs of the stool that is the convention industry. It's the CVB, the Convention and Entertainment Center, and the the hospitality community in general.'",
        "'speaker_1': 'I say it's a symbiotic relationship. As. As somebody who's. Who's been around the block a few times, you never see such an unbelievably good relationship with any member of that that triumvirate of entities. No one ever says no.'",
        "'speaker_1': 'We all work together. No one no one comes at this self-interested. We regularly win conventions from from larger and fancier convention areas San Francisco, Las Vegas, San Diego, Anaheim. And we do it by all coming out together, rallies, the troops, the folks from the Convention and Entertainment Center from SMG Global.'",
        "'speaker_1': 'All come together. We get we get community members together. We had a gathering recently for the NAACP council members. Mayor Garcia showed up. And it's really just a winning, winning combination. So I say as the as the the chair of the CVB and as a community member and a very eminent member of the of the hospitality and'",
        "'speaker_1': 'hotel industry, we couldn't be more grateful and more supportive of of keeping the band together and keeping this wonderful relationship continuing. Thank you all very much.'",
        "'speaker_2': 'That concludes public comment.'",
        "'speaker_0': 'Thank you. That concludes our our comment. We will come back to the council. Let me just go ahead and go to the council. Then I'll close and say some comments. Compliments in the house.'",
        "'speaker_6': 'Thank you, Mayor. I am so excited and so pleased with this agreement, with this contract with an ASEM Global. I think it's just been amazing all the work that you do, all the highlight that you bring to our city, you just shine a light on Long Beach so beautifully and you bring so many wonderful people to experience'",
        "'speaker_6': 'Long Beach. And that's something that we are so appreciative to, to you for. And it it works. It trickles down. And so, you know, I know I hear a lot of my small businesses in the community really, really embrace it when when they know that there's conventions in town because they are able to benefit from that.'",
        "'speaker_6': 'So thank you. Thank you for doing all the amazing work that you do all all of your workers. From the top to the bottom, from the bottom to the top. Everybody feels so special being part of this wonderful family.'",
        "'speaker_6': 'And so I'm just really excited to have you in my district, in District one, and really look forward to a really great relationship moving forward even better than we already have if you if that can even happen. But I'm really, really excited to do this and to be in this in this space with you guys.'",
        "'speaker_6': 'And again, thank you. Thank you. Thank you for bringing so many, so many people here to Long Beach. And really, you are one of our most valuable economic engines in the city and that we can't thank you enough for the wonderful way that you represent the city and the wonderful way that you treat people when once they'",
        "'speaker_6': 'get here. And I think that that's very, very important. Your your customer service is outstanding. And I'm just so, so very proud of you and so very proud to have you in our city. We are very lucky to have you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_1': 'Sure. I just want to chime in and, you know, thank our convention center, our CVB, RSM, really for being there for us. Over these past few years, it's been difficult time. Our downtown, our convention center, our tourism district was impacted by the pandemic.'",
        "'speaker_1': 'But you showed leadership despite that. Helping organize convention centers across the state to establish rules for reopening. When we saw a crisis on our border. You all stepped up and provided shelter to migrant children. And now, as we're charting our recovery and you're now presenting an agreement that you've come to terms with that positions us to explore'",
        "'speaker_1': 'new opportunities. That puts our city in a better position to slingshot out of this recovery. And so as we think back on this moment in our city and our city's history, you can't you can't think about this moment without acknowledging the incredible work that all of you did to help position our city for strong recovery.'",
        "'speaker_1': 'So I'm enthusiastic about this agreement. I look forward to the additional economic opportunities this will present of conventions and entertainment in our downtown. So congratulations, and I'm happy to support this motion.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_7': 'I was going to take the opportunity to thank each and every one of you for all that you're doing. Many of you who are downtown are still helping out the hotels that are downtown with your overflow and your support.'",
        "'speaker_7': 'And that's really important that we're a city as a whole working together. And I also want to thank how not just within one specific area, we have hotels and restaurants and the community all coming together. And that means a lot.'",
        "'speaker_7': 'It means a lot to the residents. And we appreciate you and being so inclusive. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you. I would like to just join in the chorus in congratulating our ACM and CVB for this agreement. I think this is going to definitely move us forward. This is a little bittersweet. It is sweet in that we are celebrating an agreement.'",
        "'speaker_3': 'It's a little bitter because we're losing a great asset and Charlie Burn. And so I want to just ask Charlie to stand up, put him on the spot. I know he's here somewhere. He's been an amazing partner for four years here.'",
        "'speaker_3': 'He's made our convention center a success. And the big part of that is because of the operations there. And I wish him the very best. And as he moves on to his next venture in sunny Florida, very nice.'",
        "'speaker_3': 'And you all are our best ambassadors to our city for our city here, the face of our city to conventions. I wish you many years of continued success. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Sorrell.'",
        "'speaker_8': 'Yeah, it's just. I also want to add my support for the this item as well as renew the contract and just want to thank everyone so much for your hard work as we are entering this phase of important recovery and as we start to make sure people bring their business and activity to Long Beach and that we'",
        "'speaker_8': 'continue to demonstrate what we have to offer. And I think you do that well, and I hope that we can continue to diversify the kind of opportunities that people can have to do their events here. Thank you.'",
        "'speaker_0': 'Thank you. I think that's all the comments from the council. I'm just going to say a few comments. First is, I do want to, before we take the vote, just to congratulate everyone that's been involved in this incredible process.'",
        "'speaker_0': 'It's been actually quite a process, a lot of negotiation, a lot of really great conversation, great proposal. And I want to also just think our team at the city who, you know, oftentimes are the unsung heroes in getting this done.'",
        "'speaker_0': 'And I think, you know, Mr. Modica, you in the team did a great job of really getting this thing across the finish line. And I just want to thank thank them. I do want to also say, you know, to to just to some global to the whole team there.'",
        "'speaker_0': 'Of course, Bob, and thank you for being here. And you've been a phenomenal partner already. So this isn't this isn't a risk. This isn't some unknown, you know, new, new era we're going into. But this is a continuation and expansion of something that's already going really, really well.'",
        "'speaker_0': 'We're just very fortunate to have you all as part of the city team, our convention bureau business, our tourism business, our hotel and restaurant business is an incredibly important part of the success, not just of Long Beach, but the state of California and the entire region.'",
        "'speaker_0': 'We are blessed to have a great team. You're all here. Many of you were here. Thank you for all your hard work to bring folks to our city and and to allow folks an inside look at what makes a city so great and so special.'",
        "'speaker_0': 'I also just want to note, you know, these these votes and these decisions to go into these this new contract is actually a very significant deal. This is a huge contract. And it should be because it is essentially picking a partner that is going to be with us as we make investments, bring you folks and really lead'",
        "'speaker_0': 'tourism into the future. So it's a very big decision and I think we have the absolute right partner for us to do so and do this work in the future. You know, I'm looking forward to the investments into the facility.'",
        "'speaker_0': 'I'm looking forward to the investments that this contract makes into marketing, into making sure that our hotels are well resourced and have folks coming in to them, that the contract really focuses on bringing incredible events and experiences into Long Beach, into the spaces that we're going to reimagine, many of our spaces that is going to support our'",
        "'speaker_0': 'already thriving tourism and convention business. I'm particularly excited about the what's in this in this agreement to enhance the Terrace Theater and being able to bring the best shows, the best Broadway musicals, the best theater experience to folks in Long Beach.'",
        "'speaker_0': 'And a lot of us don't want to drive out to the Pantages every every few weeks that enjoy going to the theater. And so I think that those are things that I'm really looking forward to that I think are all in this agreement.'",
        "'speaker_0': 'I mean, and make the agreement really strong. We? We pushed really hard to get the best agreement for the people of Palm Beach. And I think this agreement reflects that. And so I just want to thank Bob, you again and your and your team, because I feel very confident that that we're going to be able to enhance'",
        "'speaker_0': 'an already stellar relationship with with with ASEM Global. And so thank you to all of you, especially to our man Charlie back there, who's been so phenomenal to us. And we've already shared with you that we'll miss you greatly, but we're really excited about the future.'",
        "'speaker_0': 'So thank you all for being here. We have a motion on the floor which by councilman's and day house invites me. Richardson. And please go ahead and cast your votes.'",
        "'speaker_2': 'Motion is carried.'",
        "'speaker_0': 'Great. Well, thank you all very much. We're going to move on now to thank you. I know that will be exiting. Thank you so much to everybody. We do have we're going to transition to our cannabis items now.'",
        "'speaker_0': 'So not a lot of folks here for that as well. I do have, I believe, three general public comments. Why don't we do those for those three folks and then we'll go right into item 28.'"
    ],
    "Ordinance on Cannabis Retail Storefront Licenses and Social Equity Program.": [
        "'speaker_0': 'Thank you very much. That concludes the Open General Comment section. So we're going to move on to item 28, which is an ordinance and I know there's a staff presentation on it. So we will go ahead and have the item read and then move on to staff.'",
        "'speaker_2': 'Report from City Manager Recommendation to clear ordinance relating to the regulation of Cannabis Retail, Storefront Business License and the Cannabis Social Equity Program. Read the first time and later to the next regular meeting of the City Council for Final Reading and to adopt a resolution to establish a request for proposals for cannabis retail storefronts citywide.'",
        "'speaker_1': 'Thank you, Mr. Mayor. This is an item that came from the Council to provide direction to bring additional dispensaries for equity applicants to the Council for consideration. There's been a lot of work, a lot of research and a lot of outreach.'",
        "'speaker_1': 'And I will turn it over to Emily Armstrong to walk us through this fairly complex presentation of a very important subject. Thank you, Emily.'",
        "'speaker_2': 'Thank you. All right. So good evening, honorable mayor and members of the city council. Tonight, I'm happy to present to you the equity dispensary ordinance and resolution for your approval. So to provide some history on this item. In October of last year, the City Council directed staff to prepare an ordinance allowing up to eight new dispensary licenses'",
        "'speaker_2': 'to be issued to verified equity applicants. The City Council directed staff to focus on a merit based RFP process that did not include a lottery to select the eight applicants eligible for a license, as well as expand the Green Zone for dispensaries in Long Beach by reducing certain sensitive use buffers.'",
        "'speaker_2': 'In addition, the City Council also directed staff to prepare an ordinance to allow equity delivery businesses in the city. That ordinance will be presented to the City Council after the zoning amendment has been approved by the Planning Commission in the next few months.'",
        "'speaker_2': 'So to start, I will be providing an overview of the key provisions in the Equity Dispensary Ordinance. To prepare the ordinance and resolutions staff researched best practices and consulted other cities, as well as held discussions internally and with equity applicants in the program.'",
        "'speaker_2': 'The outreach to equity applicants included an online survey, an in-person interactive workshop and an in-person town hall meeting. The key pieces of the ordinance include adding up to eight new dispensary licenses issued to equity applicants, which will be selected through a competitive RFP process.'",
        "'speaker_2': 'These dispensary licenses will be able to hold both a medical and adult use license, similar to the existing 32 dispensary licenses. Lastly, to expand the Green Zone for these dispensaries, staff has identified buffer amendments to certain sensitive uses as part of the expansion.'",
        "'speaker_2': 'Staff is recommending a six month moratorium on the existing 32 dispensaries being able to move locations into a newly expanded Green Zone area to allow the equity dispensaries time to find a viable location without additional potential competition. The buffers that are being reduced in the ordinance include buffers for schools, parks and beaches.'",
        "'speaker_2': 'However, these will be replaced by buffers for playgrounds and community centers, which will continue to buffer cannabis dispensaries from some parks and beaches in the city. Continuing our focus on the equity dispensaries, I would now like to discuss the resolution which establishes the guidelines and procedures for how the eight equity dispensary applicants will be selected through the'",
        "'speaker_2': 'RFP process. The intent of the RFP process is to create a fair and equitable process that utilizes criteria that evaluates the ability for the applicant or applicants to successfully apply for and operate a dispensary in Long Beach. To be eligible for the RFP process, you must either be a current verified equity applicant in the equity program or'",
        "'speaker_2': 'you must qualify for the equity program under the eligibility criteria that is in place as of the date that the RFP is advertised. Individuals that are not currently in the program will be able to submit their verification application documents along with their proposal for the dispensary license.'",
        "'speaker_2': 'If an individual meets the equity program eligibility criteria, they will be verified as an equity applicant during the RFP process by staff from the Office of Cannabis Oversight. If an individual does not meet the equity program eligibility requirements, their proposal will be deemed non-responsive and they will be disqualified from the RFP.'",
        "'speaker_2': 'Proposals may be submitted by one applicant or a group of equity applicants. However, no individual may be identified in more than one proposal. In addition, only one equity applicant per household may submit a proposal. The RFP will be reviewed and scored by a panel similar to a traditional RFP.'",
        "'speaker_2': 'However, members of the panel will be voluntary, anonymous and will not consist of panelists from Long Beach. Panelists will consist of individuals who have expertize in economic or business development, involvement in social equity matters, and or cannabis business regulators in another jurisdiction.'",
        "'speaker_2': 'The panelists will be selected by members of the Economic Development Department to reduce any bias in the process. The proposals will be evaluated by the panelists based on the categories you see on the screen. The specific evaluation criteria is currently being developed by staff from the Office of Cannabis Oversight, Financial Management and Economic Development and will not'",
        "'speaker_2': 'be made public until after the RFP process has concluded. As part of the RFP, applicants must also certify in their proposals that they will remain equity owned and will not transfer ownership to a non equity business for a period of five years from the issuance of the dispensary business license, as well as certify that they will obtain'",
        "'speaker_2': 'the license within three years from the date they are selected to move forward in the licensing process. Now that we've gone through the guidelines, I would like to walk through the steps of the RFP process. So first staff will conduct a stakeholder meeting to provide details on the RFP process, go over how to submit proposals and answer'",
        "'speaker_2': 'any questions applicants may have about the process. Next, the RFP will be posted on the city's procurement portal for 30 days, where applicants can submit their proposals. Unlike a traditional RFP, this RFP will pose questions and include response fields to make it easier for equity applicants to submit their proposals.'",
        "'speaker_2': 'Then once all proposals have been submitted and the submission period is closed, staff from OCA will evaluate the applicant's eligibility in the equity program. Individuals that do not provide the appropriate documents and who do not meet the eligibility criteria will be disqualified from the process.'",
        "'speaker_2': 'Anybody who does qualify will be able to move forward. For those that are deemed eligible, their proposal will be forwarded to the panelists for review and scoring, using the evaluation criteria and rubric established by staff. Scores will be compiled by OCO staff and the 16 proposals with the highest scores will move on to the interview phase of'",
        "'speaker_2': 'the RFP. They will be interviewed by the RFP panel using standardized questions to gauge their fitness to open and operate a dispensary. The RFP panel will then select the top eight equity applicants using a forest ranking process. Once the top eight are selected, the city will post the intent to award at least ten days before the award'",
        "'speaker_2': 'is made. Applicants who are not selected are able to submit a protest with the city's purchasing agent, who will evaluate the protest to verify if there is merit. Once the protest period has concluded, the eight equity applicants awarded will be able to move forward in the dispensary licensing process.'",
        "'speaker_2': 'During the RFP process, the equity applicant will not be required to have a property identified. Staff will assist and provide resources to the eight equity applicants to help find a viable location for their dispensary business. Once they have been awarded to move forward.'",
        "'speaker_2': 'This slide outlines the proposed timeline for the process. Staff anticipates releasing the RFP shortly after the ordinance takes effect in July, and the process is anticipated to take approximately 4 to 6 months to complete. The eight equity applicants will likely be selected around November to begin the licensing process.'",
        "'speaker_2': 'In addition to the equity dispensary process, the ordinance also outlined some updates to the equity program. So first off, is proposing to strengthen the equity program criteria to ensure the grants and assistance are provided to individuals most impacted by the war on drugs.'",
        "'speaker_2': 'Currently, individuals must have a family income below 80% of the area median income, and they either have to have lived in an eligible language census tract for at least three years or have a personal cannabis arrest or conviction.'",
        "'speaker_2': 'And up until July of last year, individuals could also qualify if they were currently receiving unemployment benefits in addition to meeting the income requirement. As you can see on the screen, under the current criteria, the majority of equity applicants have qualified under the residency criteria and or the unemployment criteria, and very few have qualified under the cannabis'",
        "'speaker_2': 'arrest or conviction requirement. Therefore, Staff is proposing to amend the equity program eligibility criteria to require individuals to have a family income below 80% of the army and to have lived in an eligible Long Beach census tract for at least five years.'",
        "'speaker_2': 'And to either have a personal cannabis arrest or conviction or have an immediate family member with a cannabis arrest or conviction. In addition to the eligibility criteria, the ordinance also includes a requirement that all equity businesses remain equity owned for a period of five years from the time they submit an application before they can transfer ownership to'",
        "'speaker_2': 'a non equity business as well as a one member per household policy. So that grant funds and assistance can be evenly distributed to applicants across the equity program. That concludes my report and I'm happy to answer any questions.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. And I just want to also just thank you and the staff for the presentation and the work to get us here. Another still council discussion and we want to hear from the public. Unless there is any objection, I'm going to have public comment and then we'll go back to the council.'",
        "'speaker_0': 'So we will read the first five members of the public who are set to speak, and then we'll do the next set. Just as a reminder for council rules, if ever we hit over ten people on any specific item, the 90 seconds gets gets gets hit because of the length of items.'",
        "'speaker_0': 'So as a reminder, I think there's there's a more than ten on this item as it probably will be for a few others. And so I'll turn it over to the clerk to get us through public comment.'",
        "'speaker_2': 'Well, the first.'",
        "'speaker_7': 'Five speakers, please line up first. Anthony Souza. Jovi. Davis. Eliot Lewes Sinai campaign and Tamika Boyce. You have 90.'",
        "'speaker_5': 'Seconds.'",
        "'speaker_1': 'Mr. Mayor, city council members, staff does a great job. You put together I know you guys been working really, really hard on it. We've been following it and it feels like we're getting a lot closer. First of all, my name is Anthony Souza, and I've been part of the city of Long Beach my whole life.'",
        "'speaker_1': 'I went graduated here from St Anthony's High School. I own businesses here. I own commercial, retail and residential properties here. My my kids live here. My grandkids live here. My nieces and nephews live here. So I've been part of this.'",
        "'speaker_1': 'I'm also currently an owner of a dispensary here in the city of Long Beach. I'm here today to briefly talk about the social equity program that's being considered. I have four points and that's it, I think. And the criteria should be as objective as possibly can.'",
        "'speaker_1': 'I feel is very important that the criteria as objective there should be not be a subjective inherent bias and be an objective that the applicant should have requirements which would include a minimum site location along with the business plan.'",
        "'speaker_1': 'I feel that it's hard and I went through the last application. Yeah, it's hard to qualify everybody and rank everybody. And I think the lottery is a very subjective way to process after. And so basically my second point is a lottery.'",
        "'speaker_1': 'If the applicants meet the requirements or applications would be eligible for a lottery when the eligible applicant.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'What? I'm done. Okay. I didn't realize it so quick. Okay. Two more points and all. I won't. I won't go buffer zones. I think it should be a thousand feet from Kate K to 12 and 15, 1500 feet from dispensary.'",
        "'speaker_1': 'Thank you. Thank you, sir. Okay.'",
        "'speaker_7': 'Jodi Davis. Hi, everyone. My name is Jovi. I am a social equity applicant that you're speaking about. I just want to bring to the council's attention the obstacles facing social equity applicants in the city when it pertains to lack of capital and obtaining in a location.'",
        "'speaker_7': 'There's currently 32 dispensaries in the city, and most of them are multi-location or multistate operators with deep pockets, and they have all of the prime locations in our city. And what I'm asking is for the city's assistance with helping social equity applicants differentiate ourselves from these other competitions.'",
        "'speaker_7': 'I'm asking that you grant us the exclusivity to host consumption events. I feel that there is a demand for that. I feel that people are asking for these things, and I feel that this is a way for us to connect with our community.'",
        "'speaker_7': 'I feel that it would bring in a lot of the tourism that you're looking for, for coming in the city. And I feel that this should be exclusive to social equity applicants. We oftentimes when we're looking to investors and we're asking them for money, they're asking us, well, how are you different from the competition?'",
        "'speaker_7': 'How are you different from the other 32 dispensaries in the city that have money? They had the location that have all of the the brand deals. And I think that being able to host events and connect with our community would be a great way for us to boost our businesses.'",
        "'speaker_7': 'So thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'Elliot Lewis.'",
        "'speaker_1': 'Elliott Lewis, owner of Cannabis Cannabis Co. Look, you know, I can't get it all in a minute. Throw. Everybody who knows knows. Cannabis has been supporting this item since day one. So we're glad to see City Council move it through.'",
        "'speaker_1': 'I'm also really happy that we're moving on the tax issue. Great job. In addition to that, the letter to the state. I do want to say one thing. The cities are starting to move and that's great. And we're moving on social equity and we're moving on taxes.'",
        "'speaker_1': 'But at the end of the day, who's really sticking it to us is the state. And if we want to make any progress in this fight for cannabis businesses, not just social equity businesses get equal treatment under the law.'",
        "'speaker_1': 'We need to go down and chase down our state representatives. Senator Gonzalez needs to step up and get into this fight. Patrick O'Donnell needs to step up and get into this fight. The letter is a first step. I appreciate it.'",
        "'speaker_1': 'But if we move taxes from 8 to 6, we're going to take that entire hit. The state is the one that's oppressively taxing us. They have a $60 billion surplus and the taxes on cannabis is less than $1,000,000,000.'",
        "'speaker_1': 'It doesn't make any sense. We need equal treatment under the law. We need you guys to put the pressure on the state representatives. All this is great. I love Long Beach being progressive on cannabis. I tip my cap to everybody who's been involved that move this issue along.'",
        "'speaker_1': 'As you know, we support social equity. But none of this is going to work if we don't do the work at the state. They're the ones sticking it to the industry.'",
        "'speaker_7': 'Will the next few speakers please line up? James Marx, Julien Xavier, Muriel Burrill, Nate Boles and Dmitri Woodard Sunday Campaign.'",
        "'speaker_1': 'Um, I think a great staff presentation. I have to say respectfully, I don't know if the office of cannabis oversize appropriate administrator for this program. Um. Respectfully I think that it should be a DTI certified firm that is going to be run in that RFP panel.'",
        "'speaker_1': 'Um, economic development has some great people on the team, but I don't necessarily know if there's an equity lens inherent within that body. So if there is to be an emphasis on, you know, creating more opportunities for people that were being afflicted by the war on drugs, then I think we we as a city have to do'",
        "'speaker_1': 'a better job in actually facilitating that. We just had an applicant just so eloquently. She she, you know, brought forward the adversities that a lot of these businesses are dealing with. I would be curious to see or know how many people who have gone through the social equity program here in the city of Long Beach, who are'",
        "'speaker_1': 'a dispensary owner today or even in remaining in the cannabis space. I know for me in the six district we have a we already have a buffer zone being impacted by on the on the Pacific Avenue cultivation, people who are just across the street from YMCA.'",
        "'speaker_1': 'So I just think that if equity is to be taken serious, the city has to step up. Thank you.'",
        "'speaker_2': 'To meet the.'",
        "'speaker_7': 'Voice. Good evening, City Council. One of the things that I needed to get up and speak about after watching the resolution that Emily just presented is that we have to note one of the key points in it is that people will be allowed to enter into the RFP and the dispensary application process without being a verified social'",
        "'speaker_7': 'equity applicant on the front end. That absolutely flies in the face of every other social equity applicant who has been in this process since 2018, two current that have gone through the process and been waiting and trying to find the barriers and to lower the barriers to entry into to get into the business.'",
        "'speaker_7': 'I think it's absolutely ridiculous to even consider letting other people come and just jump the line. Now that there's an opportunity for retail dispensaries, additional retail dispensaries within the city, please reconsider that piece of the resolution. Thank you.'",
        "'speaker_7': 'James Marks.'",
        "'speaker_5': 'The.'",
        "'speaker_1': '14th Amendment to the United States Constitution is an amendment to the United States Constitution that was adopted in 1868, granted citizenship, an equal set of civil and legal rights to African-Americans and enslaved people who have been emancipated after the Civil War.'",
        "'speaker_1': 'And it read Section one. All persons born or naturalized in the United States and subject to the jurisdiction thereof are citizens of the United States and of the state wherein they reside. No state shall make or enforce any law which celebrates abridge.'",
        "'speaker_1': 'The synonym is curtailed to less and reduce or decrease the privileges or immunities of citizens of the United States. Nor shall any state deprive any persons of life, liberty or property without due process of law, nor denied to any person within its jurisdiction the equal protection of the laws.'",
        "'speaker_1': 'So what we are asking under the Constitution of the United States, under the 14th Amendment, is an opportunity to play on an equal playing field, along with the immediate dismissal of Emily Armstrong, who was in Office of Inequity, due to her continued guardianship of past institutionalized racism and our current recent implementation of practices that are blatantly racist'",
        "'speaker_1': '. And her disregard for the impact that the war jurors have had and still had on black communities in the city of Long Beach. We request someone who fully innocence the devastation of the war on black people in the black community here in the city of Long Beach.'",
        "'speaker_1': 'By removing Emily Armstrong from that office. We can surely start the journey of writing many wrongs by remaining true to the spirit of the unanimous City Council vote and other departments citywide acknowledging racism as a public health crisis.'",
        "'speaker_1': 'We can begin. And then can we? Only your time.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'It all starts with accountability. With that comes a great deal of responsibility, which is the ability to respond.'",
        "'speaker_5': 'Also, yes. The responsibility for.'",
        "'speaker_0': 'Thank you very much, sir.'",
        "'speaker_7': 'Gillian Merry. Jillian Xavier is next. Mary Ellen, speak first and then I'll go. Joanne, I'll go next. Thank you. Great evening, everyone, with giving all glory and honor to God. I have a letter here written by the LBC, which is a Long Beach social equity entrepreneurs, and that would be who was standing behind me this letter to'",
        "'speaker_7': 'notify the city of Long Beach and other authorities responsible for the licensing and regulation of social equity cannabis businesses in the city, that they are not in compliance with the previously written policies or the framework for reconciliation. We seek accountability and amendments to recent policies enacted by the Office of Cannabis Oversight regarding cannabis technical assistance, funding the'",
        "'speaker_7': 'regulation regarding who is eligible to apply, and privacy protection for the intellectual property of each applicant in the form of an NDA signed agreement. The US and the City of Long Beach have a history of racist policies and practices that have hurt black residents and other communities of color.'",
        "'speaker_7': 'The city of Long Beach is currently guilty of this ongoing practice. We are requesting a full independent investigation into the aforesaid and requesting additional amendments to your current policies and procedures that further exacerbate the progression of black people.'",
        "'speaker_7': 'Systemic racism occurs when institutions and organizations such as municipalities and government agencies and their officials adopt and maintain policies that routinely produce inequitable outcomes for people of color and advantages for white people such as past redlining and the current policies and procedures that are in place by the Office of Equity, which is also the Office of Inequity'",
        "'speaker_7': '. Before I continue this letter, I want to address an elephant in the room. So we were at the town hall meeting and you guys said, Well, we're going to do changes to the equity grant program. We're going to go from 445 to 80000.'",
        "'speaker_7': 'Right. The question was asked them as Emily Armstrong, any applicant put in the application prior to April 1st, would they be grandfathered in? The woman repeated. The question that we asked disappeared for a week and came back and said, Oh, Jillian, you know, I misunderstood the question, but you repeated the question.'",
        "'speaker_7': 'You can't just insult us. We've been here since 2018, and you bring in other people to come. And do what? The application process for our dispensaries is closed. You've got more than enough. You got 40 people in the room.'",
        "'speaker_7': '32 people not going to make it. You got to give us a chance to make it. Give us what we need, and here's what we'll do in exchange. You give us the funding. In exchange, we will donate back into the program to help the next person.'",
        "'speaker_7': 'That's an even exchange of services, right? That makes more sense than having $1,000,000, giving ten people a hundred thousand and half a million to get into the business to a million. So ten people failed. That's ridiculous. That's a failing grade.'",
        "'speaker_7': 'That's a f.'",
        "'speaker_5': 'You lied.'",
        "'speaker_7': 'Thank you. Your tongue said get rid of her. For the next few speakers, line up. Jose Hernandez. Danielle Lopez. Carlos Cepeda.'",
        "'speaker_1': 'Good evening. City Council members. My name is enables. I'm a social equity applicant here in the city of Long Beach and owner of the Good Smoke Company Cannabis brand based out of Long Beach. The city needs to get it together as far as social equity and creating a process to see these licenses through.'",
        "'speaker_1': 'We need to create a common sense approach and to continue the letter from my colleagues in the Long Beach. Social equity entrepreneurs matters such as current policies passed or not passed funding invested or not invested directly affect the quality of life in Long Beach neighborhoods that have been and are still being grievously targeted and impacted by such'",
        "'speaker_1': 'policies. Overpolicing and racism. All one has to do is a data check, a fact checked on the arrest and convictions when it comes to neighborhoods of color. Although cannabis is legal, it's almost as though being black is not, according to citywide data and statistics.'",
        "'speaker_1': 'On June nine, 2020, the Long Beach City Council engaged in earnest conversations about racism and unanimously declared racism as a public health crisis with the need to restore public trust in the city government and how to reconcile a gap in the experiences of impacted around black people within the current city policies, especially the black community.'",
        "'speaker_1': 'The City Council called upon city staff to prepare a report that would put the City Council in a position to enact policy and make decisions to change the system. The palpable, disrespected presented recently in city public meetings, city officials, especially those in the Office of Cannabis Oversight and a staff, is ethically and morally unacceptable.'",
        "'speaker_0': 'Thank you, sir. Thank you, sir.'",
        "'speaker_2': 'Demetrius.'",
        "'speaker_1': 'Hi. My name is Demetrius Woodard, an original lottery winner back in 2010. And I can write a book. What Happened to us? We would like for you to open share use manufacturing of paper for equity applicants in addition to social equity delivery licenses.'",
        "'speaker_1': 'Immediately please revise grant application process to be less redundant and simplified for equity applicants as previously done to receive your funding without any delays, setbacks and or unnecessary repudiation while ensuring applicant protection with necessary privacy policies and NDAs in place if not a book.'",
        "'speaker_1': 'The City of Long Beach and its council in all other municipalities with its jurisdictional metropolis, are supposed to be aligned under these three key goals, according to the Framework for Reconciliation Goal number one within systemic racism in City of Long Beach and all local government and partner agencies to internal transformation, go to design and invest in community'",
        "'speaker_1': 'safety and violence prevention. GOAL three Improve health and wellness in the city by eliminating social and economic disparities in the communities most impacted by racism. The above goals and recommendations represent the LPC believes can be reasonably accomplished within the existing power and the governing authority of the City of Long Beach.'",
        "'speaker_1': 'Please make a motion to discuss and adopt and approve the above recommendations. Thank you.'",
        "'speaker_7': 'You'll see.'",
        "'speaker_1': 'Good evening, Mayor. Council members my name is Jay-Z Mendes. I'm the political director for Catalyst Care, which is the Community Service and Policy Advocacy Branch of Catalyst Cannabis Co. And I'm here to speak in favor of the three items that are here tonight.'",
        "'speaker_1': 'We've spoken about this issue before, folks. Many folks have spoken about this for months and years. And so I'm very happy to hear that this council is in unison in support of the three items, of course, lowering local cannabis taxes, making sure that we have a chance to fight against the black market and really have a chance'",
        "'speaker_1': 'to thrive. But of course, as was mentioned, the state taxes are really what's holding us under. They don't tax liquor like they do us. They don't tax oil like they do us. But for whatever reason, we're, you know, overtaxed.'",
        "'speaker_1': 'And so our rallying cry is this lowered taxes, higher access. And so I would definitely want to uplift Mary and the council members and their House and Councilmember Cindy Allen for championing these issues. You know, you're on the right side of this, and we thank you.'",
        "'speaker_1': 'And most importantly, the social equity applicant situation, our communities, Latino, black, brown communities, minority communities we would think were impacted by years and years. Folks are still in prison for something that affluent folks are benefiting from. So people that are in the game that are supporting social equity applicants, as we've been building up for this moment, to'",
        "'speaker_1': 'pass the ordinance to allow for more people to benefit from this, that's who we want to be with and that's what we uplift. And thank you so much. And please do the right thing. Thank you.'",
        "'speaker_2': 'Carlos.'",
        "'speaker_1': 'Oh. Good evening. Mayor and City Council. The city's slow action has contributed to the social equity dilemma by restricting the competition in line. Most of the non social equity dispensaries to build and protect the market power illegally. Current city ordinance aims at maintaining an operational footprint primarily, primarily limited licenses with high natural barriers to entry, resulting in'",
        "'speaker_1': 'a limited market participation which benefits, you guessed it, those resources. And again, we start in the back of the line. Given the significant diversity of the city's population, it is appalling that out of the 32 operating dispensaries in the city, not one is owned by a black, brown or Southeast Asian individual.'",
        "'speaker_1': 'We are better than that. This is not indicative of who we are as a city. Collectively, minorities are the backbone, foundation, soul, seasoning and energy of the city. While delivery licenses and social equity dispensaries are an acceptable start, it is far from equitable.'",
        "'speaker_1': 'A disparity will still exist. We must push ourselves and talk about licenses for cannabis consumption lounges and special events for social equity applicants. My only concern is who we deem Long Beach residents. Let's be more selective about who we consider.'",
        "'speaker_1': 'Three years of living in the city does not make you a Long Beach resident. I use myself as an example. Horace Mann. Jefferson Middle School. Wilson Reed. A continuation and to Cal State Universities to complete an undergraduate and graduate degree all while remaining a resident and active member.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'All right. Thank you.'",
        "'speaker_8': 'The last speaker is Danielle. Hello. My name is Danielle Lopez and I live.'",
        "'speaker_2': 'In District one. I am a community and digital organizer for Catalyst Cares from Catalyst Cannabis Company. And like you, I'm here to work to help enrich the lives of our community. That's what Catalyst for Change is. I support Agenda Item 17, 28 and 33.'",
        "'speaker_2': 'Outrageous and unfair. State and local taxes are driving the cannabis industry to fall before it's given the chance to rise.'",
        "'speaker_7': 'Because of high taxes, thousands of.'",
        "'speaker_2': 'Union paying jobs with benefits will be gone. I support the social equity applicant program. There are hundreds of folks who are victims of the war on drugs. For years, when cannabis was illegal, that could have built generational wealth by creating and owning a stake in the legal cannabis industry.'",
        "'speaker_7': 'Long Beach must move to right the wrongs of the past by giving more licenses.'",
        "'speaker_2': 'To bipoc groups in retail for retail ownership. I once again call on my city to action and have lower taxes and higher access support social equity applicant ordinance and urge the state to lower the state cannabis tax. And thank you, Councilmember Cindy Allen and marrieds in the House for leading these initiatives for the people.'",
        "'speaker_0': 'Thank you very much. I want to thank everyone that spoke on this item on on this, particularly on the social equity ordinance. And we also have two other additional cannabis items that we'll be hearing as well. But I just want to thank you for for those that made comments.'",
        "'speaker_0': 'We do have a motion and a second on this item. So go through the folks that have that are to send it to Q and I'll make some comment as well, but I'll let the council go first. I will start with Councilman Austin.'",
        "'speaker_3': 'Thank you very much, Mr. Mayor. And I want to thank all of the those in the public who came out to speak today on this particular item. This is a, I think, a great day for the city to move social equity forward in cannabis industry.'",
        "'speaker_3': 'This is a long time coming, and I'm glad we're finally here at this critical point. It's not perfect, but I for the sake of moving the agenda forward, I think it's important that we move in, vote on something tonight to get social equity.'",
        "'speaker_3': 'I'll make that a reality in our in our city. Today, we are again moving the bar toward a more equitable future for cannabis retail in our city. Eight new licenses will represent at least 20% of the retail market in the city, and that could be as soon as within, within months from now.'",
        "'speaker_3': 'In a feedback from this process, I want to just say compliment staff and command everybody in the public who participated, because much of what you have seen before you has been a result of comment from city council coming from subject matter experts, comment from folks in the industry and the public who helped really frame this process.'",
        "'speaker_3': 'I know one of the the when we when we brought this item forward, when I brought this item for several months ago, it was, hey, we want to make sure that the process is fair. And so I kind of want to ask a couple of questions regarding the fairness of the process.'",
        "'speaker_3': 'You know, there was there was conversation about, you know, potentially making it more subjective and going toward a lottery. Can you tell us why why we didn't move forward and make that a recommendation? Why was staff hasn't made that a recommendation.'",
        "'speaker_2': 'Yeah. So back in October when we released the feasibility study, that was an option and that was actually the recommendation by staff was to include a merit based process similar to an RFP. But at the very end, select those who kind of meet the top using a lottery.'",
        "'speaker_2': 'And at that meeting in October, it was clear from community input that the lottery was not the way to go and that you should really just focus on the merits of the business and the application. So I believe Council at that time decided to take away the lottery aspect.'",
        "'speaker_3': 'Thank you for clarifying that. And also so we heard from a number of people who said, hey, you know what, we've been in the system for many years and now we are going to, you know, number one, how many applications do we have?'",
        "'speaker_3': 'If you could tell us that? And and is there a cutoff is there a moratorium on new applications during this process?'",
        "'speaker_2': 'So we have currently today 156 verified equity applicants. The the involvement is unclear. But for this process, we don't have a cap and we don't have a cap on the number that we're allowing into the program.'",
        "'speaker_3': 'Okay. Well, I'll just tell you from my concern that that's a high number. I would I understand the apprehension of anybody who has been waiting for four years in the process to get there. And if there is a way to, you know, to put a moratorium on on on on applications, I'd be happy to to support something'",
        "'speaker_3': 'like that. Is that something that we could do tonight? Mr. City attorney.'",
        "'speaker_1': 'We can, and it would have to come back again for a new first reading, but we could change it and make that change.'",
        "'speaker_3': 'Okay. Or we could bring an item next week to do that as well. Right.'",
        "'speaker_1': 'We. I'm sorry, I think but we can we can make the change a required and bring it back next week if that would be how we would do it. It's it is a substantive change to what's before.'",
        "'speaker_3': 'It's a substantive, substantial change. Yes. But if we were to bring it back as an individual item next week and layer it on top of this, we could pass something tonight. Is that correct?'",
        "'speaker_1': 'You could you could start that process. You could request us to prepare it next week. Then it'd be another week for us to bring it back for a first reading to amend what we're doing. So you couldn't you couldn't do it next week.'",
        "'speaker_1': 'Okay, you have to request it. Then it would come back for first reading and a second reading. So it wouldn't it wouldn't be able to happen next week.'",
        "'speaker_3': 'No, there's a second on his motion, but would you be open to supporting that as well?'",
        "'speaker_4': 'Council Member Yes, I would.'",
        "'speaker_3': 'Okay. Well, that is an amendment that I like to put in.'",
        "'speaker_2': 'And just to be clear. Councilmember Orson, are are you putting a moratorium on the program as a whole, allowing new or just the dispensary process.'",
        "'speaker_3': 'The dispensary, the retail applications?'",
        "'speaker_5': 'Okay.'",
        "'speaker_3': 'To ensure that, you know, we're talking about 156 and only eight people are going to get get applications tomorrow. Once we this is announced, you probably get another 50 more applications. I want to say, hey, you know, the people that have already been in this process should should be awarded the given the opportunities.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'And then and then I did decide I gave a significant amount of my time to a staff here. But there was also something that was very, very interesting to me, because I heard from one applicant that said that they won in the original lottery process.'",
        "'speaker_3': 'Right. That to me, that should be a priority in terms of an award as well. And, you know, and I'd be interested, I did 150 cents applicants. How many of them were awarded in the original lottery process?'",
        "'speaker_2': 'Yeah. I don't have that data, but we can look into that.'",
        "'speaker_3': 'Okay. Because that shouldn't be an extreme number. And again, we we have folks who went through the process, got the lottery award to begin with, lost their their businesses for whatever reason. And now they're coming back to to to be in the back of the line for.'",
        "'speaker_3': 'For an application process, I think is is a little counterproductive and unfair as well. And so I'd like to give some priority to any social equity or applicant who had previously been awarded a business license through a lottery process here in the city of Long Beach.'",
        "'speaker_3': 'Those are my comments. And I would ask my colleague support on those two items. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Allen?'",
        "'speaker_4': 'Yes. I definitely like to think staff on all of your hard work on these ordinances. I know that we requested some changes, and it's great to see that our social equity program is expanding today. I do appreciate the expansion of the Green Zone and updates to the eligibility criteria.'",
        "'speaker_4': 'I think that was really helpful. I do have some concerns about the ownership requirements in this ordinance. It says that applicants must certify 51% ownership for a period of five years. And it is my understanding that after five years, the business can be sold to a non-equity entity.'",
        "'speaker_4': 'I understand that these folks may want to sell the business at some point in time, but I am concerned that immediately allowing non equity businesses to buy these licenses after five years will compromise the viability of our equity program.'",
        "'speaker_4': 'I also like to make a note. This is not a motion that my office is exploring innovative ownership structures and will be working with staff to bring these ideas to council when it's appropriate. But I would like to make a motion at this time that applicants submit a ten year business plan instead of a five year business'",
        "'speaker_4': 'plan, and that staff. Bring back a report to Council on the Status of our equity businesses in five years to determine if these entities should be sold to non equity owners after the completion of the submitted ten year business plan.'",
        "'speaker_4': 'Also. I appreciate Councilman Austin. I agree with everything that you said. I I do believe that people, you know, already in the process should get those licenses. So I support all all of the the items that that you that you recommended.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you, Mayor. May I ask a question?'",
        "'speaker_0': 'I'm sorry. The city attorney. I wasn't actually going to ask to make sure that those were accepted by the maker of the motion as part of a master motion. Okay. And the city attorney. Did you have a comment?'",
        "'speaker_1': 'Just a question. Councilmember Allen. On your motion for the five year plan, you've asked to amend the ordinance to make that a ten year plan and a ten years before it could be sold. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Sorrell.'",
        "'speaker_8': 'Thank you, Mayor. I'll add my support to both amendments and also add that, you know, I just want to make sure there's a little more clarity around the review panel as far as the criteria in participating it to ensure that there is fairness and impartiality, impartiality, excuse me, impartiality in how it's scored.'",
        "'speaker_8': 'So when it asks that if they are scoring the applicants, that maybe the name is not shown, but everything else can be as far as their description, so that there isn't kind of this kind of set up with, you know, because it's hard to tell if there's a relationship connected to the applicants.'",
        "'speaker_8': 'So that's one request I like to make as we maybe get a little more clarity about what that that would be the process. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_1': 'Thank you, Mr. Mayor. First, I want to thank and acknowledge staff for bringing this back and thank all the community advocates for being at the table for this entire process. Some things stood out to me from what I heard today.'",
        "'speaker_1': 'One that stood out was lower taxes, higher access. I think the package of things that are on the agenda today certainly speak to that. I think it's we just have to acknowledge that it's an economic imperative that we continue to invest in this industry.'",
        "'speaker_1': 'And we've seen, particularly at a time when sales tax has gone down, transit occupancy tax has gone down during the pandemic that we were able to continue services because cannabis demonstrated its resiliency at a very difficult time during the pandemic.'",
        "'speaker_1': 'And so it's an economic imperative, I think, in order to continue to provide services and come out of this recovery, that we double down on what works. And so this step, adding eight additional dispensaries, is actually smart business for the city.'",
        "'speaker_1': 'We've shown and we've learned from the beginning of the cannabis process how to refine it, make it better on the cannabis equity process. You know, hasn't it hasn't worked. And I think what we see here are some examples of how we've learned on what doesn't work and made it better.'",
        "'speaker_1': 'I think even looking at like I remember the first lottery when the balls didn't even fit in the machine when I was working for a previous councilman, Steve Neal. And now we have a it looks like an evaluation process that really built on independence, a panel where no one's from Long Beach.'",
        "'speaker_1': 'And it's all people who don't have a, you know, any bias and are going to look at the merit of the process. I think that's good. One other thing that I heard today was someone talked about the barrier of the lack of capital to enter the market.'",
        "'speaker_1': 'And, you know, I was you know, I was curious and I know we got a big grant to help with this. But if you could walk us through the resources that are that are actually available today to help people, I think that's important to make sure local folks actually have support and capital to get into the marketplace'",
        "'speaker_2': '. Yeah. So just to give an update on kind of where we're at with the grant funding that we have, we have two grants. One has not yet been received. That's the latest round of GOPers funding, which was $3.2 million.'",
        "'speaker_2': 'So we're just waiting for that check to come from the state. But right now for round two, we have about $50,000 remaining in that fund and that's supposed to last through October of this year. So we're trying to space it out and make it more equitable and be able to give funding.'",
        "'speaker_2': 'And I'm looking forward to getting that 3.2 million.'",
        "'speaker_1': 'Okay. I mean, 3.2 million is is definitely good when you spread it out across applicants. You know, we certainly are going to need to do better and identify more resources to help people make it through. I like the idea of figuring out how to make sure that, you know, there's some longevity with the program, that it doesn't'",
        "'speaker_1': 'disappear in three years. I think there may be other ways to achieve that. You know, I'm supportive of, you know, what's in front of us today, but maybe a covenant on the licenses. People can sell it, but they need to sell it to a cannabis offering.'",
        "'speaker_1': 'So it continues to be a cannabis person. That's something to explore. But what's in front of us, I think makes sense. I'm happy to support it. I think we need to again. I think it's just an economic imperative that we continue, you know, to invest in this market so we can continue to get resources and revenue from'",
        "'speaker_1': 'this market, particularly so we can invest in homelessness and some of the quality of life issues that are really impacting our city right now. And so I want to see those revenues continue to grow. So this has my support today and I encourage the council to support it.'",
        "'speaker_1': 'Thanks.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_7': 'Thank you. I want to thank everyone for coming tonight. I really appreciate all the input. I want to acknowledge that this has been a long process, but I do want to also acknowledge that when we were prioritizing a lot of these different components of equity applicants, I'm really a councilmember Austin championed pushing forward a a parallel track'",
        "'speaker_7': 'so we would be where we are today. And so I know that that is difficult on the staff when you have multiple things going on. And I know there was a little bit of frustration for the lack of resources, but I want you to know that everyone here tonight and those of us on the dais really appreciate'",
        "'speaker_7': 'the extra hours that it took to make sure that both of those things came forward at the same time. Because really, the standalone dispensaries is where there's a lot of opportunity at this time. I'd also like to state that sometimes people want to come and bring an item to council and not have any changes.'",
        "'speaker_7': 'And I think that listening to the community and really thinking about the things that you've said can change things in a meaningful way. And so I appreciate sometimes when we make changes, there's a lot of frustration and the audience because they want it right now.'",
        "'speaker_7': 'And I hear something different from all of you. You want to get it right. And I really, really appreciate that. And so for that and because we do have great relationships, I'm just going to throw something out there.'",
        "'speaker_7': 'Councilwoman Allen and Councilmember Austin, I know that you're really committed to finding a way to maintain equity in the city. As someone who has been involved in investments in the past and sometimes found out that I'm the person that I was in an investment with, might not have been the right partner at the time.'",
        "'speaker_7': 'I never want to lock someone into something that they can never get out of. So I'd love to add something where, if you would like to sell your share in advance of the ten years, it would need to be to another equity partner.'",
        "'speaker_7': 'Therefore, we maintain the equity, but we really talk about you and your freedom. If you have an opportunity to capitalize earlier than ten years, we don't want you to have to wait for ten years to realize that that that revenue.'",
        "'speaker_7': 'We want you to be able to have that flexibility and bring that forward at any time as long as it still benefits another equity member. Is that something you'd be open to?'",
        "'speaker_4': 'I'm absolutely.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman in the house.'",
        "'speaker_6': 'Thank you very much. I think we've come a long way in this council since since I first got on this council. And thank you council member Austin and council member Allen for bringing this very important item forward. I love it when we create policy and draft policy and launch policy that is guided with the community's input and'",
        "'speaker_6': 'listening to the community because they are the ones that are living it every day, day in and day out. And so I want to thank the staff for being so flexible and so open and so willing to really work and really try to make this equity program work.'",
        "'speaker_6': 'I feel that we are not there yet, but we're headed in the right direction and it's all because we all come together and work together. So for that, I'm very thankful. Thank you. Very happy to support this item.'",
        "'speaker_0': 'Think it, Councilwoman. So I'm just going to just say a few. I think I think most has already been already been said. I just want to first really think of just the team. I know this has actually been a very difficult process to kind of get where we are today.'",
        "'speaker_0': 'This is a actually significant amount of work that has gone into creating not just this city's first social equity program related to cannabis, but really one of the first that is happening across this city and across the country in a way that actually is going to make an impact and is meaningful.'",
        "'speaker_0': 'So I just want to thank the city for leading on this issue and acknowledge that we wouldn't be here had it not been for the folks that are actually here in the audience. And I've actually been pushing not just this issue, but organizing, working with elected officials, uplifting the issue at the council and in the community, and'",
        "'speaker_0': 'keeping folks accountable every step of the way to ensure that the city adopts a program that is really centered on equity, on access, and one that we can be walk away and be proud of to have developed in this in the city.'",
        "'speaker_0': 'I it's important to recognize I mean, any time that we have a discussion or debate about about particular about cannabis or cannabis policy or or tax regulations, I'm reminded that we have we have figured so much of this out together in a process that has been in many ways two so still very new as a legal economy'",
        "'speaker_0': 'in the city, in the state. And so to get here and going through this process has been difficult. But I am also really proud to be in a city where so many folks are fighting for equity and on this issue especially, that has damaged so much of our black community, of people of color and the injustices that'",
        "'speaker_0': 'have happened and the racial inequities that have happened around the drug war, around marijuana convictions, has has damaged so much of our community today, and especially the dialog around around cannabis. And so I think that what we're doing today is such a great and positive step.'",
        "'speaker_0': 'I agree. It's not a perfect policy. I don't think anything we've done around cannabis has been perfect the first time we've done it, whether it's our tax structure or the regulations or the buffers, it's we have we have tried to fix things as we go because we're actually this is the first time that we're actually doing this'",
        "'speaker_0': 'type of this level of work on this issue. And so I'm glad that we're doing it and I'm glad along which is leading the way and things that aren't working. We're going to have to tweak and we're going to have to fix and we have to improve as we go along like we have on every other issue'",
        "'speaker_0': 'related to cannabis and and the marijuana economy. I also just want to note, and I know we're going to talk about this soon on the on the tax side, but I do want to thank folks who have brought this issue up that it's pretty clear to to to most of us that in the development of whether it's'",
        "'speaker_0': 'been social equity policy or whether it's been our own marijuana ordinance that was on the ballot that voters voted for, whether it was the initial tax structure that was put on the ballot that voters voted for. You know, we have learned along the way, and I think tonight is a great reflection of the city on making adjustments'",
        "'speaker_0': 'to be better and to hopefully center more more equity, to support more people and to really shine a light on just the the misconceptions and the prejudice that still exists out there around cannabis and around what I think all of you are trying to do in trying to uplift to the community and to the country.'",
        "'speaker_0': 'So I just want to thank you for your work. And with that, we do have a motion and a second in front of us. That's by Councilman Ashton and Councilman Allen. We have all of the amendments that are in place.'",
        "'speaker_0': 'Again, a big thank you to Emily and the. And the team. I know it's a lot of hard work and no, not everything is perfect. But I just want to thank everyone and what that will do, we will do a vote.'",
        "'speaker_2': 'Motion is carried.'"
    ],
    "Feasibility Report on Reducing Adult-Use Cannabis Retail Tax Rate.": [
        "'speaker_0': 'Great. Thank you very much. We're going to move right into item 17, which is the tax reduction report.'",
        "'speaker_2': 'Recommendation to request. I'm sorry. Communication Councilwoman Allen Councilman Zendejas. Vice Mayor Richardson recommendation to request a report exploring the feasibility of reducing the city's adult use cannabis retail tax within 90 days and submit the findings to the Budget Oversight Committee and the Economic Development and Finance Committee.'",
        "'speaker_0': 'Thank you. I'm going to start with Councilman Allen.'",
        "'speaker_4': 'Yes. Thank you, Mayor. I want to quickly recognize Kevin Raper from financial management and Emily from the city manager's office for their help on this item. This is a very important issue which touches businesses, workers rights and issues of fairness.'",
        "'speaker_4': 'I've heard some from so many folks in the cannabis industry that operators are overtaxed and burdened by various regulations. As a former small businesswoman myself, this really bothers me. It's important that businesses receive equal treatment under the law.'",
        "'speaker_4': 'I think looking into whether we can reduce our sales tax is one way we can help these businesses succeed and keep jobs in the cannabis industry. Currently, all legal adult use cannabis operators already pay application fees, annual fees and equity program fees to the city in addition to state fees and taxes.'",
        "'speaker_4': 'Looking into aligning the adult use sales tax with the medical sales tax rate would be beneficial, especially to our small cannabis operators. Council has the ability to lower taxes and has done so has done so for cannabis businesses and numerous and numerous on numerous occasions.'",
        "'speaker_4': 'I do want to take a moment to recognize Council member Al Austin for recently taking the lead on finding ways to reduce our local cultivation tax together on items we can help create a more equitable business climate for legal cannabis operators in the city.'",
        "'speaker_4': 'Lowering lowing lowering the adult use sales tax will help our local cannabis businesses expand their local workforce and provide their employees with livable wages, lower the price of cannabis products for consumers, and also increase their sells, which is always good.'",
        "'speaker_4': 'Addressing tax inequities is also a good way to break up the illicit market. I have heard on that on several occasions that there are over 300,000 jobs in the illicit market producing goods that are untested and potentially unsafe.'",
        "'speaker_4': 'The state needs to take the lead on this, but as a city we should do all that we can do to make sure that businesses are shut down, are brought into the legitimate market. By reducing taxes and by reducing these taxes is one way that we can help do that.'",
        "'speaker_4': 'I do understand this is still a funding source for the city, and I appreciate all the conversations I've had with staff on this matter. I'm looking forward to report back and to finding ways to create a better environment for the legal cannabis operators in Long Beach.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. All right. So I'll offer my comments here as the second year of the motion. I mentioned it earlier that this is a new industry and we have to understand it and nurture it so that it provides the revenue that our city needs.'",
        "'speaker_1': 'And as a new industry, there's already a workforce here. And I think Councilwoman Allen sort of mentioned that. And this is a local workforce. These are local people, local jobs, and they pay good wages and many of them are union jobs.'",
        "'speaker_1': 'And I think it's important that we continue to nurture that and grow that. You know, as this has developed, we've seen the economic I love that the Economic Development Committee is engaged in this because that's the committee that engaged in this the first time when we looked at manufacturing taxes.'",
        "'speaker_1': 'Our manufacturing tax structure was significantly higher. We initially brought it to city council. The initial response was, Yeah, we can explore this, but we're concerned about declining revenue. So the so they projected it out and guess what happened?'",
        "'speaker_1': 'The opposite happened. The revenue actually increased dramatically after we reduced the manufacturing taxes. Now the city council has taken a step on cultivation and this is on retail. It's just the next natural step that we should explore in this new industry that we have.'",
        "'speaker_1': 'So I think this makes sense. We have to continue to monitor it, continue to track it, continue to invest in it. I also think that there's a relationship between the action we just took with expanding dispensaries and lowering taxes because you're going to increase revenue as we add more dispensaries.'",
        "'speaker_1': 'That revenue helps us address quality of life issues in the city. People have to understand that we have significant work to do around homelessness and other issues. This is a new revenue source to help add resources to battle and help ensure that we're getting families off the street and finding the housing that they need.'",
        "'speaker_1': 'So there's a relationship to this strategy. So I look forward to I serve on that committee, the Economic Development Committee. I look forward to this discussion and I look forward to the report that staff will bring back. So thanks so much.'",
        "'speaker_1': 'Next, we have Councilwoman Mongo.'",
        "'speaker_7': 'Thank you. I would like to ask the maker of the motion if you'd be open to. I see that the motion was written. First it goes to this committee and then another committee. Would you be open to a parallel track again so that we would be able to resolve some of these things and dig into them faster'",
        "'speaker_4': '? Yes, I'm fine with that.'",
        "'speaker_7': 'Wonderful. So I would ask the staff member for Economic Development Finance, along with my chief of staff, to put this on the next EDF committee meeting. I look forward to digging into the details. While we love all business in the city, we have to recognize that not every dispensary is the same.'",
        "'speaker_7': 'Some dispensary owners are really great to live next door to, and some dispensaries are not as great to live next door to, just like restaurants and grocery stores than anyone else. Traffic patterns and other things. And one of the things that I always fall back on as I have, I think that most dispensaries in my district but'",
        "'speaker_7': 'now with redistricting, who knows, is that this is a paying member of our community and they are contributing to programs that help our parks and our schools and so on. I think that it's great to address this at this time when we're adding additional dispensaries, because then there will be no loss of tax that we have to'",
        "'speaker_7': 'actually make up the gap for. But I also think that it's important to be really transparent about when and how that tax impacts total sales and total volume and what the traffic patterns continue to look like. We want to also support dispensaries in business transition and I don't know if that means certain dispensaries that are only open'",
        "'speaker_7': '. Short hours could extend a bit because the demand and the lines at some of the places in the city are just very difficult for neighbors and the community. So I look forward to, in some cases, opening additional dispensaries to take on some of that demand and also recognizing that the messaging of wanting to increase demand doesn't always'",
        "'speaker_7': 'digest as easily for certain neighbors as others. So we'll look for a balanced way to both achieve the goals and make sure that the community is served. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Sauro.'",
        "'speaker_8': 'Thank you. I want to thank Councilwoman Allen for bringing us item forward for us to better understand how do we support our and nurture our growing cannabis industry. I know that that's been mentioned earlier. It's a new industry and we're trying to figure out, you know, how do we ensure we're doing the right thing as a city'",
        "'speaker_8': 'to ensure all businesses, including cannabis business, succeed? And so with that said, I really am interested in seeing how the feasibility study will look at how not only to align the cannabis retail tax rate with the medicinal. I actually so I'm a person who loves research and looking at possible scenario.'",
        "'speaker_8': 'So I would like to offer to see if we can also add, well, what does it mean to look at lowering it even more just to see? Right? Can we do a scenario of 4%, 5% and 6% on what that would mean?'",
        "'speaker_8': 'Because as much as it may individually reduce the amount of tax that person is paying, it could also increase the number of people buying in the legal market. Right. So how do we make sure we're also attracting more away from the illicit to the legal market and the other with that study to also want to look at'",
        "'speaker_8': 'the feasibility of what it would mean if we passed the state bill that is going to come before us is like kind of doing this match of like it was at 8% of state reducing it to that the state excise tax to 8%.'",
        "'speaker_8': 'So seeing what it would look like at 6% local, 5% to 8% just so that we're seeing at the whole picture of what everything would look like financially to best inform our committee as it comes before them through the budget oversight as well as economic development.'",
        "'speaker_8': 'So I think the more that we have material wise as far as content for us to consider, the better so that we can ensure we have a thriving cannabis industry here in Long Beach. But also, how does it also ensure the city is going to be able to also receive the revenue it needs to support our services'",
        "'speaker_8': 'as well? So I think. And that's it on my end. Thank you.'",
        "'speaker_0': 'Thank you. Customary Ringo.'",
        "'speaker_1': 'Thank you, Catwoman. Sir, I was thinking along the same lines that, you know, once it comes to the to the Budget Oversight Committee, I think we should be looking at all the different scenarios, because that's the only way we can really make a real sound decision as to what would be the best route and the best approach'",
        "'speaker_1': 'to take this. I totally agree that it's a new industry we need to look at with fresh eyes, and of course we're going to be mistakes. But at the same time that if we can assure ourselves that we are covering as much as we can and looking at all possible and reasonable scenarios to ensure that what comes'",
        "'speaker_1': 'out of this committee and what comes out of the city council is is absolutely the most appropriate for us to follow. That would be benefit is beneficial not only for the city itself, but for all those operators out there who who need to help.'",
        "'speaker_1': 'I mean, it's a new industry. You need help. It's growing, it's evolving. And so we need to have those ordinances and rules in place to help you do the business that you want to do. Thank you very much.'",
        "'speaker_0': 'Thank you. Councilman's councilman and.'",
        "'speaker_6': 'Thank you, mayor. And, yes, this is this is really good. I think that I was thinking along those lines as well as how it would be and how it would look for our for our community. In the cannabis industry, as we know, the cannabis industry is booming.'",
        "'speaker_6': 'And here in Long Beach, we have committed to supporting its growth and ensuring communities that have been mostly impacted by the criminalization of cannabis are included in this thriving process. I am proud to be proud to place social equity at the forefront of our local policies and the and including them as we work through this.'",
        "'speaker_6': 'So thank you very much for that. High taxes really creates a big barrier, and I'm so very supportive of this request to do a feasibility report on how we can better address that. So very supportive of this item.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_7': 'Thank you. Councilman, a great idea on the state tax. I would also ask that that committee consider there are a lot of interesting things that happen as acceptance is brought to the forefront. We are on the front edge of this and we want to make sure that those state laws benefit the cities that were willing to take'",
        "'speaker_7': 'those risks. And so if we as a city of Long Beach choose to go with a lower sales tax, then I hope that residents of the City of Long Beach would want to then purchase their marijuana here, but also that there's an opportunity to capture that sales tax in a meaningful way.'",
        "'speaker_7': 'And I know there are some sales tax formulas, like when you buy a car, you don't necessarily pay the sales tax of that city in that city. I would be interested in looking at some opportunities that really reward Long Beach for being at the forefront of the industry in that state legislation.'",
        "'speaker_7': 'So I'm just something to think about. I know it takes a long time to develop those mechanisms, but I know that we have the the brains on our team to come up with something that would be beneficial and meaningful.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. We're going to go ahead and get a public comment in just a minute. Just going to say just two things. So I obviously am very much in support of what's in front of us for two reasons.'",
        "'speaker_0': 'I think. The first is I'm one of the few folks I think probably left here at the city. There's a couple of us that were here when we actually debated and were discussing this very question of what the actual rate should be.'",
        "'speaker_0': 'And the truth is, is that we weren't sure. I think we tried to set what we thought was the most fair rate that our our priority was trying to ensure that we created a regulatory framework so that cannabis could actually become a part of the economy of the city.'",
        "'speaker_0': 'And we had, of course, had some experience with with medicinal use. And we're working with our partners and in the industry, folks that where we're already here working and we were all trying to come up, staff, the community, those of us that were here with what the right number would be or the right tax structure would be'",
        "'speaker_0': '. And so the reason why I think it's I support this conversation and the study is because we were very aware then and we're very honest that we would always look at adjusting the rate in the future and that it wasn't a permanent number that was somehow the perfect right number.'",
        "'speaker_0': 'We had always discussed reviewing it, of course, always keeping in mind that there are costs and that we have to ensure that that the city has the needs to to manage the program. That's always been important, but the review is really critical.'",
        "'speaker_0': 'So I of course, I support that. The second reason why I support this is I have been convinced by many folks, business owners in the industry, other folks I'm talking to at the state level that the illicit market is destroying the industry right now.'",
        "'speaker_0': 'And right now, the illicit market and what's happening not just here in Long Beach, but across across the state is is causing incredible damage to legitimate business owners that are trying to operate their business. They're trying to provide good jobs to local folks that are working really hard to actually reinvest back into not just the community, but'",
        "'speaker_0': 'the broader cannabis movement. And that is being undercut by by folks that are able to, because of taxation and regulation, are operating outside the system and are making profits that are not going back into communities and the same in the same way.'",
        "'speaker_0': 'And so I think this is a fair way of looking at this issue, looking at it, doing an appropriate study like we did months ago. And and I hope that we have some some good suggestions moving forward. I know that this you know, we really can't have this conversation around what's going on with the city without having'",
        "'speaker_0': 'the conversation around. What's really egregious is what's happening at the state level. And I'm hopeful that this year it appears to me that there is movement on the state level for a reduction and a change in the regulatory framework of of of the taxes there.'",
        "'speaker_0': 'So I think we're all hopeful that that is that will also happen. I know that's that's going to be discussed next. But I think this is also a really good opportunity for us to look at the entire retail tax rate and see what's what's what's best for the city.'",
        "'speaker_0': 'And with that, I want to go and ask the public comment period to start and if I can have the first five speakers, Madam Clerk.'",
        "'speaker_2': 'Natasha Bramblett, Christopher Conch, Elliott Lewis, Jose Hernandez and Charles Pankey. Can you please come to the podium? Natasha. Christopher. Elliot. Josie and Charles. Hello, Mayor and City Council. My name is Natasha. I am one of the first adult use cultivation licenses to get up in the city.'",
        "'speaker_7': 'In the city of Long Beach. I am here today on behalf of the ABC to encourage.'",
        "'speaker_2': 'You to support the study on retail tax modernization.'",
        "'speaker_7': 'Not only does modernization of retail taxes help make legal.'",
        "'speaker_2': 'Cannabis product more affordable, affordable to patients and residents, but also widens the.'",
        "'speaker_7': 'Tax base tax base.'",
        "'speaker_8': 'Of.'",
        "'speaker_7': 'Residents able to purchase.'",
        "'speaker_2': 'Legal cannabis products and.'",
        "'speaker_7': 'Reduces the size of the illicit market. Long Beach is a leader current and currently is being looked at by the state.'",
        "'speaker_2': 'For data.'",
        "'speaker_7': 'Metrics on how to lower.'",
        "'speaker_2': 'Taxes and can increase the tax revenue over time.'",
        "'speaker_7': 'Please allow the study to.'",
        "'speaker_2': 'Look at different tax rate options.'",
        "'speaker_7': 'For the Council to consider, which is 4%.'",
        "'speaker_2': '5% and 6%.'",
        "'speaker_7': 'I would like I would also like to call all the cannabis communities behind me to stand up and show their support. Thank you.'",
        "'speaker_1': 'Just do that.'",
        "'speaker_5': 'And.'",
        "'speaker_0': 'Please. Next week, please.'",
        "'speaker_1': 'Hey, what's up, everybody? My name is Christopher Kader. I'm the vice president of a manufacturing facility in District six. Today's pretty historic. Thank you for championing all the efforts that we're talking about today. I know there's no such thing as a perfect cannabis policy, but if we all work together, we can make things perfect.'",
        "'speaker_1': 'So thank you for your effort. I don't want to parrot a bunch of talking points we've all been talking about today. We all know adjusting retail taxes makes products more affordable. More affordable products brings more people into the stores, more people in the stores makes more sales.'",
        "'speaker_1': 'More sales makes more taxes. So that being said in this study, if we could really look at something that's a substantial discount on taxes, you know, I know aligning with medical is a great talking point, but let's do something that is going to drive people into the stores.'",
        "'speaker_1': 'I think 4% is something we can look at, if not four, maybe five. But I think those are the two numbers I think that are going to be the most progressive to increase the tax revenue. So that being said, thank you.'",
        "'speaker_1': 'We appreciate your efforts. And let's get this done. Cleaning Council. Once again, I'm just so happy I didn't get a chance to speak for 3 minutes, so that's why I'm here again. But I also wanted to just uplift the key aspects of it.'",
        "'speaker_1': 'Like a lot of the workforce that I'm with, they're unionized labor. And, you know, in a time when like labor is under attack, this is a very important component that I think folks don't understand. These are young people that a lot of times go to college, have degrees, have student loan debt, and they can't find good jobs'",
        "'speaker_1': 'in the work that in the in the major that they went for. So then they find themselves scrambling to find good jobs that will pay them a dignified wage, that will give them health benefits. And this is, you know, substantial in the moment, again, when there aren't that many good jobs out there.'",
        "'speaker_1': 'A lot of the folks came from trap shops. You know, women were harassed, our folks were overworked. We're content 20 hours a day or whatever, 15, no overtime. So it's this is just such an opportunity. There's a long way that we have to go to destigmatize the industry.'",
        "'speaker_1': 'And I think that, you know, as far as Catalyst Cares is concerned, we're doing the most we can with when it comes to community service, community cleanups, food distributions, hygiene and, you know, and offering services for the homeless folks and and advocating for good policy that will create even more jobs for our community members and our friends'",
        "'speaker_1': 'that, you know, are still trapped in the black market but want to be legitimized. You know, we deserve to get out of the shadows and be brought into it. I mean, I came from a time when you had to meet somebody at a dark alley and they would get there an hour later after they said that they'd'",
        "'speaker_1': 'get there. But, you know, that's neither here nor there. We know now we go into places. It's like a pharmacy, you know, and you go to places and there's older folks. There's like companion hours and, you know, that's the next step to getting Latino communities to understand that it's not the, you know, this scary stuff that, you'",
        "'speaker_1': 'know, that's similar to heroin because that's basically when you tell people that is marijuana, you might as well tell them that you're addicted to heroin. So these are the kind of things that we're trying to fight against. And one day my parents will accept that aspect of me.'",
        "'speaker_1': 'And then one day everybody around the world will accept how you know, that this is the plant that God put on this God green earth to be able to heal us in ways that the big pharmaceutical companies have not.'",
        "'speaker_1': 'So I'm personally really focused on the healing aspect of it and I feel as well as the recreational. And so I want to help promote that in the city with anyone here that wants to be able to be championing that aspect of mental health awareness, public health and all the beautiful ways that this plant is helping reshape'",
        "'speaker_1': 'our society. Thank you. Thanks to my colleague, Joe. Hello, Mr. Mayor. City Council members. My name is Charles Pankey. I am the director of operations for Catalyst Cannabis Co. Thank you for having us here today. Thank you for considering this agenda item.'",
        "'speaker_1': 'You know, it's been touched on here, but, you know, the legal cannabis market is extremely important to the city of Long Beach and to all cannabis users. The one thing I'd like to point out to is that taxes need to come down strictly because it's a point of survival for us at the retail level.'",
        "'speaker_1': 'I've been in legal cannabis for nearly ten years. I've been selling cannabis since college. I'm mid-thirties, so I've seen the ways it's come through in several different markets and I've never seen anything like in Southern California, the either not on purpose, but just the overall undermining of a legal of a legal business, legal economy, a legal way'",
        "'speaker_1': 'to get cannabis to people, shops. These people do not care whatsoever about public safety. I've actually hired people from trap shops are making $12 an hour trying to live in Southern California at $12 an hour. And it's only the only reason I took these jobs is because the only way for a lot of people to get into'",
        "'speaker_1': 'cannabis. That is the way that and that's another thing about cannabis to cannabis is is a space for people that are a bit different from everybody else. People that maybe stumbled once in a while here and there. But with the legal cannabis system, we can really uplift a lot of different types of people and a lot of'",
        "'speaker_1': 'different types of communities. So I really implore you to consider this agenda item and bring these taxes down to help us as retailers continue to thrive and succeed. We employ union people. We employ security guards. We make sure that this whole process is safe for people to get cannabis.'",
        "'speaker_1': 'And not only the public safety aspect from the traps running to, but people are buying products that aren't tested. You know, our vendors are required to test their products every single batch. You know, they're required to get rid of them after a year's time in distribution, you know, people are selling old, possibly cannabis laced with all different'",
        "'speaker_1': 'pesticides, things like that. I don't mean to be an alarmist, but another good thing about retail cannabis is that people are actually getting safe products that are vetted and actually they can be talked to about these products and their property in a proper manner.'",
        "'speaker_1': 'You know, all of our all of our consultants and countless cannabis are seriously taking every single person that walks into consideration of what their health can do for them, what cannabis can do for them. So I just, you know, would like to see taxes as low as possible.'",
        "'speaker_1': 'Bring it in line with medical is a good start. But again, it needs to be even lower to help to help the legal cannabis industry thrive. So thank you. Elliot Lewis Catalyst Cannabis Co. Sorry for the double dip, but I'll take another 3 minutes.'",
        "'speaker_1': 'Passionate on this tax issue. It's the bad policies of the states and the municipalities that have created a monster. The black market is bigger than ever. It's 75% of the market today and all the bad outcomes that Charles and Josie talked about are happening in the black market, and that's due to bad policy.'",
        "'speaker_1': 'All we have to do, and I've heard state officials, state and local officials say, oh, well, the black market is never going to go away. No, that's wrong. All you have to do is abolish all the taxes. I know we can't get there today.'",
        "'speaker_1': 'Right. But if they abolished all the taxes in particular at the state and white, you know, it's very important. Every step we make is a step in the right direction. There would be no demand. The problem in the black market and why it exists and just so every city official understands it, it's a demand problem when you'",
        "'speaker_1': 'charge 45, 50% more for a product and we have union workers, right. And etc., etc., and all the costs and compliance that come along with being legal. Just besides the state tax, we're about to clip out a bunch of hundred K annual fees in June just to keep each license going.'",
        "'speaker_1': 'Each one of these payments is a breaker. So at the end of the day, the government is creating the demand for the black market and that's what's really frustrating. And what's the basis for this? Cannabis has been an accepted medicine for 10,000 years.'",
        "'speaker_1': 'It's only this little hundred years and the reefer madness that existed that preceded it, then it got put into this category and de-stigmatize. So I know there's this stigma that's attached to it, but there's really no reason for it.'",
        "'speaker_1': 'Why is cannabis taxed at a different rate than everything else across the board? Nobody can give a logical explanation, and I understand that the special interest of the city, of the city and the special interests of the state need to get their money.'",
        "'speaker_1': 'But it's like a kick in the face when, you know, the state has a $60 billion surplus again to repeat it and they're getting less than 1 billion and they're killing 300,000 jobs. And at the end of the day, the other comment I want to make that's really important.'",
        "'speaker_1': 'These are upward mobility jobs. A third of the people that work at our HQ started as bud tenders and or receptionist and or have escalated to general managers or all the way to HQ. And these people are way more valuable than some jerk off from some box store that doesn't understand cannabis, which make this industry really, really'",
        "'speaker_1': 'cool. The last thing I want to say, despite all the differences some of us have in the audience, you see how deep the industry rolled today, right? Everybody on this issue unified. So I want to give a shout out to everybody who showed up no matter what their affiliation is.'",
        "'speaker_1': 'The industry stands strong on this issue and it really this whole idea that there needs to be a vise tax surrounded cannabis is just twisted thinking that makes no sense. And it's the government both at the city and the state level.'",
        "'speaker_1': 'And I applied law because we're going in the right direction. I love it. But at the end of the day, that's what's creating the demand in the black market. It's bad government policy. Even if you abolish taxes or drastically lower them, it'd be gone.'",
        "'speaker_1': 'And by the way, y'all could make some more money if you could fix it at the state.'",
        "'speaker_5': 'Thank you, Danielle Lopez. We have many more public comments.'",
        "'speaker_2': 'Two more speakers, please. Danielle Lopez. Jordan Wilbur, can you please come to the podium?'",
        "'speaker_1': 'Hello. My name is Jordan. Wilbert and I live and work here in Long Beach. I'm a lead at the Cannabis Cherry Dispensary. I've worked there for over two years now. I'm up here to say that if the taxes do not come down in the legal market, union workers like myself, growers, distributors and shops all over the state'",
        "'speaker_1': 'won't have a job in the future or health benefits of any kind. And lots of great product slash medicine will go to waste on the shelves due to the super competitive illicit market being a cheaper route for patients and recreational users alike.'",
        "'speaker_1': 'If taxes could be lowered, then the legal market can continue to provide jobs for people all up and down the state of California and a safe way for medical users to get their medicine without having to resort to the streets.'",
        "'speaker_1': 'I want my city council members to please investigate the possibility of reducing the state and medical cannabis retail tax rate and to support the social equity applicant ordinance. Everybody and I mean, literally everybody should be able to have access to, be and thrive in this industry.'",
        "'speaker_1': 'Thank you for your time and hearing me out.'",
        "'speaker_8': 'Hello again. My name is Daniel and I'm from.'",
        "'speaker_2': 'Catalyst Cares be a Catalyst.'",
        "'speaker_7': 'Cannabis company.'",
        "'speaker_2': 'And what an honor it is that that last one was only a minute and a half. But now that I have your time, it's a bit more relaxed. But that being said, yes, taxes must be lowered. It is incredibly and outrageous and very ridiculous.'",
        "'speaker_2': 'Why? It's nearly 40%. And again, as they said, there's no logical explanation behind it. Just because it's cannabis and just because it's new, they're going to exploit.'",
        "'speaker_7': 'Us to squeeze every dollar that we have. But that's the thing we are running out of dollars to provide.'",
        "'speaker_2': 'And so this new income that.'",
        "'speaker_7': 'The city gets, that the state gets, it's going to fall.'",
        "'speaker_2': 'And that's what's going to happen. It's going to fall because these taxes are so high, because the regulations are so deep, and because the track and trace system that.'",
        "'speaker_7': 'They have for us is not.'",
        "'speaker_8': 'Helping.'",
        "'speaker_2': 'And it's not helping. And it's really sad because there's 300 thousands of jobs and more that could be possible. We need a janitor for the building. And it's not even just that we need a head of a company.'",
        "'speaker_2': 'We need every single job that takes and makes a business function. And that's what's really sad about it all, because we can't offer it.'",
        "'speaker_7': 'We want to, but we can't. Why? Because we just can't afford it.'",
        "'speaker_2': 'And that's what's really frustrating. And that's why we demand lower taxes and higher access. And that's why we demand to be taxed fairly like any other business should be. You know, there's no reason why if my cousin could go distill his own beer in his backyard and then sell it and make a label on it.'",
        "'speaker_7': 'Where.'",
        "'speaker_2': 'His track and trace this and where is the metric where his 40%, there's none. Why? Because it's not made like that. And for whatever reason, just because we were once an illegal industry and now we want to thrive, we keep putting setbacks after setback after setback.'",
        "'speaker_2': 'And that's just not fair. And how is it that we have to limit and not let anyone else have a chance for their American dream? And who are we to send in anyone else's way to do that? I don't think that's fair.'",
        "'speaker_2': 'And I want that to be fair. I want that to be fixed. I want that, too, so that every person, bipoc group can have a chance to do that because it's just a dream until they can do something about it.'",
        "'speaker_7': 'Right.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. I think that I think that concludes public comment. We have a motion and a second. I think I've come to remember I want to make an additional comment.'",
        "'speaker_7': 'I want to thank you guys for additional comments tonight. And I know that it is frustrating to be in a new industry. And you are right, there are lots of stigmas. But I challenge each and every one of you to do what many of us will not many of us left over from the original group had said'",
        "'speaker_7': 'on day one. There needs to be more advocacy to change marijuana and not have it be a Schedule one drug. If you can change the federal law. Look who's running for Congress. Look who's running for U.S. Senate and support.'",
        "'speaker_7': 'And ask these candidates what their position is. Government is complex and we appreciate you that you are here advocating tonight. But oftentimes because you're good advocates for your own cause, other causes ask for your support. And it's easy to jump on those bandwagons that add complexity to local government.'",
        "'speaker_7': 'And those complexities result in layered tax systems that don't cooperate and really restrain the success of entrepreneurs like yourself. And so next time someone asks you to stand up for a cause that's not really connected to your main focus.'",
        "'speaker_7': 'Ask yourself what those implications are down the line of adding the additional need of the government, the additional burden of another industry or another complexity. And then, last but not least, we started down this path with a lot of naysayers in the neighborhoods, in the city and in the state.'",
        "'speaker_7': 'And you've done an excellent job changing their minds. But those naysayers started to open their minds only because, at least in my conversations, well, I'm really against it. But if they're going to tax it and it can pay for our park programs, then I'm okay with it.'",
        "'speaker_7': 'But now that you've established yourself, we can work towards that. So I know that it's frustrating to have the tax rates as they are today, but know that we might not have gotten to where we are today without them.'",
        "'speaker_7': 'And so we are here to walk that path with you and help guide you through, because each and every one of our communities is very different. And we need to get enough consensus among all of our neighbors to make sure that you're successful.'",
        "'speaker_7': 'So thank you for your partnership. Thank you for your feedback. And let's work together at the federal level to advocate for what you believe in that could really help all of us. And then let's also talk a lot more about putting significant funding into the enforcement of significant penalties to illegal dispensaries.'",
        "'speaker_7': 'Until we do that, I can't tell you how many meetings I've been out with the BCA members or one off here or one of their. I consistently ask, how much have you advocated for LAPD, LBP, the DEA, FBI, all these organizations to come together and rid the cities of illegal dispensaries?'",
        "'speaker_7': 'Long Beach has done an excellent job, but that doesn't mean that the drugs aren't still flooding into our communities through non dispensary distribution methodologies. And the reason that that happens is because of relationships and you guys are breaking some of those relationships.'",
        "'speaker_7': 'Some people have had relationships with their dealers for decades. And until you are out there telling them about the alternatives and the safety associated with all the components that are very expensive, and they see a friend who got something that was laced and had a really bad outcome.'",
        "'speaker_7': 'Those stories help bring people in to the authorized market. And we're here to help you with that because we don't want to see people on the illegal market either. So thank you for all that you're doing to help eliminate the illegal market.'",
        "'speaker_7': 'But also let's work towards legalizing at the federal level so that each and every one of you can benefit from that as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Ciro.'",
        "'speaker_8': 'Yeah. I just wanted to verify if I had to make a friendly amendment to ensure that there is an addition to doing the review feasibility of the three or four sorry, four or five 6% review or is, is or is it noted as a request.'",
        "'speaker_1': 'So in reading the spirit of the Room, I think you do want to look at different options. So unless we hear any objection to that in there, we're going to go ahead and do that. Part of our analysis that was part of our plan is to bring you back a full package of what happens to the best'",
        "'speaker_1': 'of our knowledge if we look at different variables.'",
        "'speaker_7': 'Okay.'",
        "'speaker_0': 'Thank you. There's a motion. There's a motion and a second. Members, please go and cast your votes.'",
        "'speaker_2': 'Motion is carried.'",
        "'speaker_0': 'Thank you. We have we have item. The last cannabis item is number 20. Or is it here whether it is 33?'"
    ],
    "State Legislation Review and Support for Cannabis Tax Reduction.": [
        "'speaker_2': 'Communication from Councilwoman Allen, Councilmember Younger Vice Mayor Richardson recommendation to request the State Legislation Committee to review and consider supporting SB.'",
        "'speaker_8': '1281.'",
        "'speaker_2': 'And AB 2792 and consider adding an item to the state legislative agenda advocating for lowering the state cannabis cultivation tax.'",
        "'speaker_0': 'Thank you. I'm going to turn to Councilman Allen to be.'",
        "'speaker_4': 'Thank you, Mayor. I want to start by recognizing council member your Ranger and Vice Mayor Richardson for their support on this item. Our state cannabis laws were designed to regulate cannabis, protect public health, and help sells out of the illegal market.'",
        "'speaker_4': 'But I mentioned earlier tonight the cannabis industry is over, taxed and burdened by various regulations. There is no industry taxed as much as the cannabis industry. While this certainly benefits towards the state and local budgets, it's just flat out unfair to the industry.'",
        "'speaker_4': 'And this structure is also a factor and how strong the illicit cannabis market is throughout the state as this existing state laws imposes a weight based tax, the cultivation tax and a 15% excise tax on cannabis operators. Local taxes are then imposed in addition to these state taxes, the cultivation tax of $161 per pound.'",
        "'speaker_4': 'This is a flat tax, meaning that the impact of this tax will vary depending on the market price for per pound of the cannabis. If the market price of cannabis is low, the tax is a greater burden on legal cannabis operators, often leading businesses to cut jobs, cut, lost or lose their doors altogether.'",
        "'speaker_4': 'Or like the lady who just spoke. You can add janitors if you need them. The structure makes it very difficult for legal cannabis businesses to be successful and earn a profit. This is a result. And displace workers. Close cannabis entities to seek other, more low cost avenues for business, such as the illicit market, which does not face'",
        "'speaker_4': 'the operating and regulatory cost of the legal market. If legal cannabis businesses struggle to operate, the illicit market will continue to grow and be even more persuasive. The state is working on cannabis tax reform and it's important that the city demonstrate strong support for its current and future legislative items.'",
        "'speaker_4': 'Both SB 1281 and AB two 2792 address these tax issues. These bills will help the legal cannabis industry market compete against the the illicit cannabis markets, which in turn will help create more jobs, increase government revenues and community benefits from local business owners.'",
        "'speaker_4': 'So I ask the State Legislation Committee support these bills and add an item advocating for lower state cannabis cultivation tax on the committee agenda. Thank you very much.'",
        "'speaker_0': 'Thank you. Can I get the motion in the second, please? On record. The second, please. There you go. Counselor, we want to thank you.'",
        "'speaker_1': 'Councilmember Allen, for bringing this forward. More than happy support. I think that when we look at our legislative agenda for this coming year, this is a very important item that should be included in there. And I think we should have some real robust discussion on this because obviously, as we've discussed tonight, the cannabis industry is is being'",
        "'speaker_1': 'I'm not going to say attacked, but it is under scrutiny and it needs in support. It needs help. And I think one of the most progressive things that we can do in the city council is to support that in support of our cannabis industry partners here.'",
        "'speaker_1': 'So more than happy to agenda, is it we will discuss it and I'm sure that we will support it and send it forward to our legislation committee as well and then to the City Council for full support later on in the in the process.'",
        "'speaker_1': 'So thank you for bringing this forward. Happy to support. Thank you.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_3': 'Thank you, Councilmember Allen and Your Honor, for bringing this forward. I certainly want to support this item before us this evening. And I've already written letters of support on both SB 1281 and maybe to 279 to to the sponsoring legislators in Sacramento and noting that two of the three state legislative committee members are agendas in this particular'",
        "'speaker_3': 'item. I just want to ask from a from a form kind of perspective, what's going to be the process? As I understand this, this will go back to the state merge committee where we.'",
        "'speaker_1': 'Will.'",
        "'speaker_3': 'Possibly get a report from staff and support this. Because I just heard our chair say that he he wants to support this. My question is, can't we just cut the process and and support it tonight as a as a body and women that.'",
        "'speaker_1': 'So you do have some options. I think you with the consent of the chair of the state large committee, you can actually amend that and bring it. If there's support of doing this, we are going to be bringing the state legislature agenda, I think, next week.'",
        "'speaker_1': 'It just got heard in committee. And so, you know, this could be then added in as a as a supplemental to that and bring back to your to your consideration or if you really wanted to delve into it and get additional testimony and information, you could do that in committee and then bring it back.'",
        "'speaker_3': 'Okay. Like I said, I'm I'm inclined to support it tonight. But, you know, if the maker of the motion and the senator one to continue with this process, I'm I'm okay with that to support it as is.'",
        "'speaker_4': 'Yeah, I'm absolutely in favor of getting this done. So if you if the colleagues are amenable to supporting this tonight, I'm all for it.'",
        "'speaker_1': 'It's a matter of the advice of our attorney. But we can do it tonight. Let's do it. Let's get it. Let's get out of the way. So. So, if I understand, the amendment to the motion would be to add it to the supplemental state led agenda that will come back in a week to the council.'",
        "'speaker_1': 'There you go. Stupid teacher. Okay.'",
        "'speaker_0': 'Yeah. I mean, I think I think the the the from the perspective would be, I think adding it to the state let's committees for approval next week which I think is set to be approved next week in skipping the committee process, I think meets Councilmember Austin's needs as well as the councilwoman.'",
        "'speaker_0': 'I'm sure it comes from for. Is that you're amenable to that. Okay, Councilwoman. Okay. So then the adjusted motion is then to just fold the support into the seat ledge. Official agenda, which it needs to be anyways. And that way our, you know, our lobbying team and our, our, our folks and also get engaged on the city'",
        "'speaker_0': 'side to push this issue in Sacramento. So that is the motion. Vice Mayor Richardson Giovanni, there's no comment.'",
        "'speaker_1': 'I like where this is headed. I'm support.'",
        "'speaker_0': 'Thank you. Then with that, please cast your votes. We're actually I'm sorry about that. We actually have public comment on this one as well. Madam Quirk.'",
        "'speaker_2': 'Well, Elliot Lewis, Jose Hernandez, Daniel Lopez, Jordan, Wilbert and Edgar Cruz. Please line up at the podium. Elliot, Jose, Danielle, Jordan and Edgar.'",
        "'speaker_0': 'I think some of them are saying that they don't want to speak up. Okay. So I think we're I think we're good because anyone comes forward, we're going to go out and take a is there someone that's speaking or please come forward.'",
        "'speaker_1': 'Good evening, counsel and staff. As you may know, my name is Edgar Cruz, Social Security recipient, and I am the founder of the Cannabis Concert Complex of Long Beach, where we focus on social equity and community redevelopment in our jurisdiction.'",
        "'speaker_1': 'I'd like to start off by thanking counsel, cannabis oversight and economic development for their hard work and support. In regards to Agenda Item 17, 28 and 33 and October, the Office of Cannabis Oversight presented a proposed map that would amend Green Zone for dispensaries but made no mention of the other license.'",
        "'speaker_1': 'Types are in desperate need of relief. Even after the state has revived their location requirements, the city has done little to catch up. Property owners and realtors are well aware of what this means and for them to be valued, their property is 2 to 3 times higher than those not in the Green Zone.'",
        "'speaker_1': 'While it is unknown how the market will respond to this expansion of the buffers, the initial response will, we hope, will level devise and force them to offer more competitive pricing. Another issue facing the cannabis industry is federal legalization, with the banking industry threatening property owners to foreclose a property if leased to any cannabis businesses.'",
        "'speaker_1': 'This again limits competition and the valuable properties, so any guidance you can offer would be appreciated. A solution could be to promote property ownership. They are also has stated that they currently do not support ownership through the grant program, instead encouraging leases that increase the likelihood that the lease would enter into a predatory or financial unstable agreement'",
        "'speaker_1': '. Property ownership will not only provide location for the business, but a real asset that may outlast the business. What does it mean to truly support equity businesses? If we look at other cities that have done that have done to bring parity to the marketplace, the answer is really simple Give equity applicants exclusive access to a licensing process'",
        "'speaker_1': '. Equity businesses are not essential because anyone can do it, and if anybody can do it, they're going to do it without us. From the property owner to the investor, all seeking ways to control or cut out the equity owner.'",
        "'speaker_1': 'But if equity is the only point of entry, equity is vital to the industry. The city has taken many steps to support equity businesses, with the exception of building equity businesses to support equity businesses. The collective power of a group of like minded business owners will ensure the success of all incubating, training, learning as a whole towards'",
        "'speaker_1': 'the mutual success of each with the collective buying power and resources to have a fair shot in an industry that is locking them out, facing regulations that are more punitive than any other similar business or industry. At the October Council meeting, it was made clear that new licenses, delivery dispensaries, shared manufacturing would be exclusive to equity applicants'",
        "'speaker_1': '. And I would also encourage you to go further and expand licensing to include events and onsite consumption. Denver recently approved the first social equity onsite consumption loan, and I hope that you take cue from 2015 when Long Beach went to complete with the other cities at the forefront of this new industry.'",
        "'speaker_1': 'I really thank you guys for your time in industry and I know it's been a frustrating and long process in regards to creating the social equity program and making it more substantial. And I think it takes all of us, we are learning as we are going and is very grateful for you guys to have this process.'",
        "'speaker_1': 'A lot of people that I know don't have the opportunity to speak to their council members. Mr. Speaker, murder, economic development. So for us to have that opportunity is very grateful. So thank you, guys.'",
        "'speaker_0': 'Thank you very much. That concludes public comment. We have a motion in a second on the floor, please. Members, cast your vote.'",
        "'speaker_2': 'Motion is carried.'"
    ],
    "Support for California Constitutional Amendment on Abortion Rights.": [
        "'speaker_0': 'Great. Thank you very much. We are we're going to continue the regular agenda. I know the cannabis items are over. If I can ask everyone to exit as as quiet as possible so we can continue the meeting. That would be great.'",
        "'speaker_0': 'Thank you so much. We're going to hear item 31, please. And then after 31, we're going to hear 19.'",
        "'speaker_2': 'Item 31 communication from Councilwoman Price, Councilwoman Allen, Councilwoman Sara recommendation to draft a letter of support for the California State Legislatures. Proposal to place permanent protections for abortion rights into the California Constitution.'",
        "'speaker_0': 'Okay. We're going to go ahead and move on to item 31. So I know that Councilman Price is is not able to be here, but we have a motion and a second. But Councilman Taro and Councilwoman Allen, Councilman Sorrell.'",
        "'speaker_8': 'Thank you, Mayor. I think that many of us have heard the potential of return of Roe versus Wade. And I actually want to thank the mayor, actually the county supervisor, President Mitchell, for bringing forward an item at the county level to ensure there's protection and that the mayor had offer to bring forward an item so that we'",
        "'speaker_8': 'as a city will work as a county to ensure we continue to protect women's reproductive health and their rights and to ensure there's justice for all women. And so I want to make sure that we thank our governor, as well as our Senate Pro Tem Atkins and Assembly Speaker Rendon for proposing at the state level.'",
        "'speaker_8': 'This, despite what may happen federally, that we will ensure there is protection permanently of women's reproductive rights and their right to abortion by making it permanent at the California state constitutional level. And more recently, I just want to thank Senator Gonzales for hosting a press conference with Attorney General California Attorney General Rob Bonta.'",
        "'speaker_8': 'And that was joined by my colleague, by our mayor, as well as Councilmember Sandia and Councilmember Urunga, that we will continue that that uplifted what our state leadership is committed to do. And so we want to thank Planned Parenthood as well, our advocacy group, for ensuring that we keep women's reproductive justice at the forefront.'",
        "'speaker_8': 'And, you know, and as well as having many of the advocates. So there it's just absolutely I want to reiterate our support at the city level that we continue to want to make sure that women here in Long Beach feel safe, it's a safe haven and that we continue to ensure all levels of resources provided for women'",
        "'speaker_8': 'to continue to have access to health care, abortion and whatever it is they need to ensure they can make the decision that is right for them and their family. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_4': 'Thank you, Mayor. I can tell you that this item is very important to all of us on council, and it's also very important to our community. I also want to thank Councilmember Yarrawonga for already working on this through the State Ledge Committee.'",
        "'speaker_4': 'I know that means a lot to so many of us. The protection of woman's body and their right to choose is under attack at the highest level. Long Beach can and should lead in pushing for a codification of women's rights to choose and our Constitution.'",
        "'speaker_4': 'I have faith in the voters of our state to pass such a measure if the legislature places it on the ballot. I know that Supervisor Hahn is working on an abortion safe haven pilot program that will safeguard patient access to abortions regardless of residency.'",
        "'speaker_4': 'Senator Gonzalez offered S.B. 245 the Abortion Accessibility Act, which removes barriers to accessing abortion care. Our leaders at the county and the state level. Supervisor Janice Hahn and Senator Lena Gonzalez are are just such strong women leaders. And and I just personally want to just say thank you, thank you, thank you for all that you are doing'",
        "'speaker_4': 'to protect the women in our community and also protect those women who are coming here to seek refuge. Now I think it's time for our city to formally support further protections. Thank you very much.'",
        "'speaker_0': 'Thank you very much, Richardson.'",
        "'speaker_1': 'Thank you. I think it's important that our city speak out loud and clearly in this moment. You know, we're in a state where people will, you know, come to our state to seek safe haven. And I think we need to show leadership in this moment because the reality is you you can't dictate free will.'",
        "'speaker_1': 'What people what's happening is and is an erosion of a protection of of health opportunity to have safe access to women's reproductive rights. And so we have to protect that. And I think cities have a responsibility of stepping up.'",
        "'speaker_1': 'I want to thank everyone who's shown leadership in this moment, Governor Newsom, on proposing the proposal for the state constitutional amendment. Senator Gonzalez, for showing leadership in Attorney General Bonta for coming to Long Beach locally. Mayor Garcia, Janice Hahn for leading at the county level.'",
        "'speaker_1': 'Councilman Durango for taking this action last week at the state led committee to for the city of Long Beach to formally support taking this step. I think Long Beach needs to be on the right side here. And so, you know, I think all of our council members, everybody has been on the right side.'",
        "'speaker_1': 'And we need to speak clearly as a city and show our show solidarity. And so I'm happy to support this. Three.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you, ma'am. I would like to add my unequivocal support to this item as well. Obviously, we need to speak with a unified, collective voice to stand up for women's reproductive rights. Not only for our city, but our state and our entire country.'",
        "'speaker_3': 'I'm going to read a statement prepared on behalf of Councilmember Price, who couldn't be here because she obviously has tested positive for COVID and we give her our very best wishes. Her statement reads as follows. Unfortunately, I'm not able to join the city council meeting tonight after testing positive yesterday.'",
        "'speaker_3': 'However, I still want to speak on this item. I would like to thank my colleagues for signing on to the item with me. Tonight, we seek to take action in support of women's rights to choose reports proposing that the Supreme Court are planning to undo 50 years of legal precedent are why I put this issue on the'",
        "'speaker_3': 'city council agenda tonight. We must ensure Long Beach is doing everything it can for vulnerable women and to support protecting the rights of women in California. As women, we must support others and raise up the voices and experiences of overlooked women.'",
        "'speaker_3': 'We owe it to one another to stand up, not just for ourselves before our fellow women who deserve to have their rights protected and have their access to safe reproductive health care. These are my values and the values we should defend for women here in Long Beach and all across America.'",
        "'speaker_3': 'If we stand together, our rights can be protected.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'So that's a Councilmember Price's comments. And this item has my full support as well. Thank you.'",
        "'speaker_0': 'Thank you. Councilman's in the house.'",
        "'speaker_6': 'Thank you. I just want to deter all the comments that have been made by my colleagues. I think that this is a very important time for us to unite and to. Just be able to support women all over.'",
        "'speaker_6': 'It's also very important that we stand strong because we really need to protect this because I could see a down downfall from this. And it's it's really important for us to stay together and stay on message and make sure that we we come united and that we stand strong together on this.'",
        "'speaker_6': 'And I'm just very thankful that we're all like it's been said before here tonight on the same side. Thank you.'",
        "'speaker_0': 'Thank you. Let me just say a few comments and then we'll go to public comment. One is I just want to just echo what everyone has said. When we had a chance to gather a few days ago, I wanted to reiterate that abortion care is health care.'",
        "'speaker_0': 'It's incredibly important that at this moment that the city takes a formal position to support this incredibly important constitutional amendment. I want to commend the governor and the pro tem and the speaker for move this forward to the legislature.'",
        "'speaker_0': 'I do want to thank Councilwoman Price for bringing this forward today to Councilwoman Sorrow, to Councilwoman Allen for bringing this forward today and for their, you know, unified support for abortion, access for for partners at Planned Parenthood, and to ensuring that all women that all people have access to care, that is support, and really to to being'",
        "'speaker_0': 'able to to live in a community and in a country that supports them and their and their freedom to make those choices. I want to also just add that I'm really thankful. Mr. Modica, you had released an update to the request that we had made a few months ago.'",
        "'speaker_0': 'It's no secret that we've been anticipating this moment, unfortunately, for for many months. And so with our Planned Parenthood partners, the city partnered with L.A. County as well, because we have our own health department to put in place a series of of measures that we're working on to better prepare and assist women that are going to be'",
        "'speaker_0': 'looking to do these services, and that we need to do a better job as a city to prepare for this moment. And so we've put in place and are working towards enhanced medical training for the community. Budgetary improvements and and expansions work for additional workforce training for, for our partners and a unit for our referral system.'",
        "'speaker_0': 'And these are all programs that we're working with, with Planned Parenthood compared to Los Angeles, who our partners are here. And I want to just thank them for their advocacy, but also, most importantly, just for operating a incredibly important clinic and center that they have here in Long Beach, which is widely used by the community and that'",
        "'speaker_0': 'we're very, very supportive of and grateful that they're here in the city. And finally, I just want to say that the city taking this position puts us, I think, in the in the in the category of of of early action on any cities in the state to formally endorse this constitutional amendment.'",
        "'speaker_0': 'And so I'm really proud of that. And I'm hopeful that we can continue our advocacy and then as a city, lean in on what will be a very important effort to to codify this into our Constitution and more broadly, work into codifying Roe.'",
        "'speaker_0': 'Of course, at the at the federal level, which which needs, of course, in this moment to happen more than ever. And with that, we have a motion in a second. I want to turn this over to public comment.'",
        "'speaker_0': 'So I'm going to ask the following speakers or please come forward. We have Jacob O'Donnell, Dave Shukla, Jamie Kinnock and Kathleen Puder.'",
        "'speaker_1': 'Good evening. My name is Jacob O'Donnell, field representative to State Senator Lina Gonzales as Senator Gonzales, thanks Mayor Garcia and the City Council for your collective support for reproductive justice. As you know, in response to the Supreme Court's draft decision to overturn Roe v Wade, the state legislature is working to codify the right to an abortion within'",
        "'speaker_1': 'our state constitution. This legislative action will strengthen California's health care access to safe and legal abortions, which are among the strongest in our nation, including SB 245, the Abortion Accessibility Act, authored by Senator Gonzalez, which was enacted this year.'",
        "'speaker_1': 'And it requires all state licensed health care plans to cover the cost of abortion services without a co-payment deductible or any type of cost sharing agreement, effectively eliminating the cost barrier. Senator Gonzales urges your support on item 31.'",
        "'speaker_1': 'And thank you. Thanks you for your advocacy to ensure California remains a reproductive freedom state. Thank you. Good evening. I'd just like to thank the three council women who brought this item forward and urge you to support it and pass it.'",
        "'speaker_1': 'Um, it's important that this city, uh, take early action to defend, uh, these, uh, very basic and fundamental rights. This is an issue of considerable importance and concern to me and my family. And I'm grateful in this moment to live in Long Beach.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'Hi all. Jamie Kinetic, public affairs specialist with the Planned Parenthood Advocacy Project. Great to see a lot of you. Again, I'm here in support of item 31. I just wanted to say thank you all to this council for your active role in protecting reproductive justice.'",
        "'speaker_7': 'And most recently, with your action declaring Long Beach a haven city for reproductive health care. Thank you to Councilmembers Price, Allard and Farrow for authoring this motion. It is deeply appreciated. And just as we see these rights eroded at a national level, it's really important that we at a state and local level are here to step up'",
        "'speaker_7': 'and to really meet this moment. So very excited to be here, very excited for your partnership, and thank you again for your support on this motion.'",
        "'speaker_1': 'Hello, Mr. Mayor. Members of the council. My name is Kate Improver. I am the president of Stonewall Young Democrats for Los Angeles County, and I'm also a volunteer for the Planned Parenthood Advocacy Project. Perhaps strong supports agenda item 31.'",
        "'speaker_1': 'California cannot and will not stand idly by as women. People who can get pregnant are stripped of their rights, and progress is erased that so many have fought for as a result of this leaked opinion. California must work to protect this right and enshrine it in our state constitution to further affirm to all people across the country'",
        "'speaker_1': 'that California will remain a safe haven state for reproductive rights. I want to thank council members Pryce, Allen and Sara for your support on this and to all of you for your continued support. Thank you for your time.'",
        "'speaker_0': 'Thank you very much. I'm thinking especially especially to our Planned Parenthood partners and friends. I appreciate your especially in this moment. We do have a motion in a second. Please cast your votes.'",
        "'speaker_2': 'Motion is carried.'"
    ],
    "Update and Action Plan on Nuisance Motel and Alcohol Abatement Ordinances and Human Trafficking Issues.": [
        "'speaker_0': 'Thank you very much. We will now move to item 19.'",
        "'speaker_2': 'Communication from Vice Mayor Richardson, Councilwoman Island Councilwoman Sara recommendation to provide an update on the city's Nuisance Motel Regulation and Alcohol Nuisance Abatement Ordinance. Ordinances including options to strengthen the ordinances within 90 days. Identify resources to support efforts to address the issue of human trafficking along the Long Beach Boulevard corridor in coordination with the City of Compton'",
        "'speaker_2': ', and coordinate outreach and education pipelines through the Long Beach, My Sister's Keeper Initiative.'",
        "'speaker_1': 'Thank you so much. Let's go ahead and cue up the presentation we have. All right. I want to thank the residents and everyone who stayed out and a lot of discussion on cannabis tonight. But right now we're going to talk about quality of life.'",
        "'speaker_1': 'And I want to thank the Public Safety Committee members who signed on to this item. Tonight, we're talking about Long Beach Beat 23. This is a map with meet 23. It covers a number of North Libby's neighborhoods, College Square, Starr, King, Hamilton, Coolidge Triangle and along with neighborhood.'",
        "'speaker_1': 'Major, major landmarks within this area include Uptown Commons, Pools of Hope, the North Long Beach Community Garden, Golden State, Humane Society, Hamilton Middle School, Jordan Plus. Colin Powell Elementary School Start King Elementary School, Sal's Gumbo Shack, Atlantic Bridge Community and Organic Harvest Gardens.'",
        "'speaker_1': 'So it's a lot of community landmarks in history on this corridor. There's also a history of chronic, chronic issues that have lasted for decades, literally decades, that involve human trafficking, nuisance motels, nuisance liquor stores, all of which are sort of anchored along Long Beach Boulevard, which is in red.'",
        "'speaker_1': 'Now, I believe if patterns of disparity exist for generations, then that means this is systemic and the system is doing what it's designed to do. So we have to commit to systems thinking, and a lot of the chronic issues are really related to policies we have and land use that hasn't been updated in decades.'",
        "'speaker_1': 'And so let's walk through a little bit of history here. So in July 24, July of 2012, Councilman Neal in the City Council began to talk about alcohol nuisance abatement ordinance. I remember I was around because I worked for Councilman Neal at the time, and it was based on looking at nonconforming grandfathered liquor stores to see which'",
        "'speaker_1': 'stores reside on places that are not zoned for those anymore or don't have modern standards like a cup. These stores had no requirements like addressing lighting and landscaping and, you know, graffiti standards and signage in the window and safety standards.'",
        "'speaker_1': 'And so this new program would set requirements on these liquor stores, including security cameras, lighting removal of payphones, stopping the practice of using ads and signs to block the windows. The following year, a draft ordinance was prepared and submitted to the Planning Commission.'",
        "'speaker_1': 'The result of the pilot program was passed that August. A year later. A little bit. A little bit later. In May of 2014, 11 of the 26 stores were identified that were identified in the pilot area of North Long Beach had reached compliance.'",
        "'speaker_1': 'And then by 20 by two years later, 26 of all 26 of the liquor stores were brought into compliance. Now, this ordinance was a big success story. It expanded citywide. And ultimately, at the last report, 51 liquor stores received an update.'",
        "'speaker_1': 'Well, a lot of that was driven because of the nuisances in this place. It started there and sort of expanded citywide. The ordinance received awards from the American Planning Association of Los Angeles and Statewide American Planning Association in California.'",
        "'speaker_1': 'Now, the next step was nuisance motels after addressing liquor stores. Motels. So, you know, I'll tell you, nuisance motels have had a real, meaningful, real impact on many of our lives. I can think when I, you know, tell the story often I was driving my two year old well, my my for my five year old was just'",
        "'speaker_1': 'born in Long Beach Memorial and I lived in the Coolidge Triangle neighborhood. So the day she was coming home from the hospital, the neighborhood was quarantined off. Why? Because there was a homicide at a neighboring motel and we couldn't get into the neighborhood our very first day bringing her home.'",
        "'speaker_1': 'And, you know, I talked to, you know, the police officers and SWAT team. They said, well, there was a homicide and somebody ran into the neighborhood and had to do a house by house search. I checked my security cameras.'",
        "'speaker_1': 'Sure enough, there were five SWAT team members in my backyard. You know, I just, you know, thought this is systemic. How much, you know, resources in our police department do we use on this incident? And so nuisance motels continue to be a focus.'",
        "'speaker_1': 'And so inspired by the alcohol nuisance abatement ordinance we began, we engaged with Long Beach Police Department Development Services, the Human Trafficking Task Force, to develop a program that would apply a similar approach to liquor stores to the motels.'",
        "'speaker_1': 'We passed the pilot program and also began discussing that council, a permanent ordinance. And so we received an update on the progress of that. And there were significant program results. The results it resulted in 30% drop in calls for service.'",
        "'speaker_1': 'A number of motels have received 1500 calls for service in one year, and that was significantly reduced and that's a big improvement. The next step was to codify this into an ordinance. That ordinance finally went into went into effect at the beginning of the pandemic in.'",
        "'speaker_1': '2020, however, has never been implemented because the pandemic hit. And so there are tools available that have not been implemented. Now, here we are at the beginning of the pandemic. We've seen we've heard from the community all across the entire police beat of additional issues.'",
        "'speaker_1': 'You know, and the reality is, is with all the progress, it's a bit disheartening to see all of that sort of come back during the pandemic. And so today, 80% of the prostitution reports and human trafficking related calls for service in the entire city exist in Beat 23 because the issue of justice is an issue of priorities'",
        "'speaker_1': '. North Division as a whole deals with 85% of the citywide human trafficking calls. On the bright side, there's some new opportunities on hand. Number one, this area post redistricting. It now has two council members. That's doubled the eyes, doubled the attention, double the support, double the love.'",
        "'speaker_1': 'And so we're excited to see that we have we should be able to put more eyes and attention on this issue. And so I think in the spirit of double, let's redouble our efforts. That means the following. We know that North Division is preparing an event action plan to order and receive an additional $50,000 in the Neighborhood'",
        "'speaker_1': 'Safe Streets Fund to connect, conduct additional operations to get more eyes on the corridor. That's a good thing we want to look for continue to look for funding for motel conversions and acquisitions, a step that we're proud to see tonight.'",
        "'speaker_1': 'We're exploring this, particularly with a nuisance motel. So that's item 24. So make sure you take a look at that. Updated zoning plan is a process we've been going through to look at the fact that this corridor hasn't been zoned in decades or the last three or four years.'",
        "'speaker_1': 'We've been going through the updated zoning process to address all the corridors in North Palm Beach. It's time to get an update on where we are. I believe that's supposed to come back this year, so now's the time to get an update on zoning so we can see how we're preparing the corridor for the future.'",
        "'speaker_1': 'It also looks like we need we need to continue to explore partnerships between Long Beach, L.A. County and the city of Compton, even the city of Lynwood, because historically these issues have bounced across court, jurisdictional lines, and so they need to be a part of the solution.'",
        "'speaker_1': 'We've had discussions with them in the past. I think it's time to redouble. There's also opportunities right next door at the Ronald Arias Center. Now that's open. We have resources, particularly the My Sister's Keeper program, which is a preventative, preventative program for at risk women and girls between the ages of ten and 24.'",
        "'speaker_1': 'Utilizing our Development Services Department to take a look at strengthening our existing resources, we have to protect them. There's also opportunities in terms of continuing invest in the corridor. Before redistricting, there were a number of projects P.B. and I, as well as a project along these boulevard that seem to have stalled.'",
        "'speaker_1': 'Sure, we got we ended up getting a decorative crosswalk, but there were other things that we talked about investing in. You know, we were in discussions with, you know, developers, Starbucks, 7-Eleven that have been stalled along that corridor.'",
        "'speaker_1': 'There's time to get an update on where those projects are. At the end of the day, the council, the community needs to speak with one voice on this, particularly because we all want the same things. We want to make sure we have a safe, viable, vibrant, a walkable corridor and Long Beach Boulevard.'",
        "'speaker_1': 'And this is a greater issue of the entire beat 23. All of our neighborhoods are impacted. So it's it's not about one or two neighborhoods. This is about the entire beat 23. And so I'm proud to introduce this item today with support from our city council colleagues, Cindy Allen, Sally Sara I want to acknowledge and recognize letter'",
        "'speaker_1': 'of support from Assembly member Mike Gibson and our local neighborhood associations who submitted a joint letter as well. I look forward to hearing feedback from the community tonight and I would love to see what staff comes back with a new comprehensive approach to redouble our efforts, efforts to improve safety and beat 23.'",
        "'speaker_1': 'Thank you so much. Okay. Next, we have Councilwoman Allen.'",
        "'speaker_4': 'Yes. Thank you, Vice Mayor, for bringing this item forward and just for so often leading on on comprehensive community safety items. Appreciate that. I'm proud to partner with you on this item. We know that human trafficking doesn't discriminate and victims can be anyone.'",
        "'speaker_4': 'I'm really glad as I was watching this presentation to see how I thought how how well you thought this out. And by asking the city staff to work with My Sister's Keeper program and the City of Compton, we'll be tackling the root of this problem for permanent solutions.'",
        "'speaker_4': 'Our most vulnerable youth would be protected and met with intervention and intervention while we work with neighbor neighboring regions to ensure that the issue does not come back to Long Beach through the Long Beach Boulevard Neighborhood Safety Initiative.'",
        "'speaker_4': 'We will also make use of our existing resources, such as the Nuisance Motel and liquor store ordinances and the Ronald are areas health equity center to combat human trafficking. This is a problem concentrated in one area and I am told that 80% of all calls for human trafficking are in this beat and that level of concentration demands'",
        "'speaker_4': 'increased attention. I'd like to hear more from departments about how they are breaking down silos and working together on a solution for this issue. Thank you again, Vice Mayor Richardson, for taking the lead on this very complex issue.'",
        "'speaker_4': 'I appreciate it.'",
        "'speaker_1': 'Fantastic. Thank you, Councilwoman Ciro.'",
        "'speaker_8': 'Thank you, vice Mayor, for bringing this item forward as well as Councilwoman Allen for supporting as well. You know, I think that this can be a great model. I'd love to get an update because I think that this area of North Lombard, just similar to Central Long Beach in that Pacific Coast Highway corridor, very similar issues around'",
        "'speaker_8': 'our hotel, our motels, as well as alcohol, liquor stores along that corridor. And I look forward to seeing in ways that this can be used as a model for how we can address the issue in that as well.'",
        "'speaker_8': 'And and I think that this is important to ensure that we're not only approaching those who are victim of human trafficking from a criminalization standpoint, which I know we've come a long way in providing holistic services. And so that's important to make sure we have this program and that we use it.'",
        "'speaker_8': 'So great job. Thank you.'",
        "'speaker_1': 'Fantastic. Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you so much. So this is a, I think, a great item to bring to the attention of our city staff and our city as a whole. The challenges are facing North Long Beach, particularly the North Long Beach, the Long Beach Boulevard corridor, and neighbors who have to deal with, you know, many of those those are unsightly'",
        "'speaker_3': 'nuisance issues that if they were in other any other neighborhood or lots of other neighborhoods in our city, it would be an outrage. It would be a crisis. This is these conditions have had and been standing for for far too long.'",
        "'speaker_3': 'So I appreciate the assistance in bringing forth this item. As you all know, the redistricting process occurred and my office has been engaged with this particular community since January, since actually before the redistricting process was final, we began reaching out and engaging with the neighborhood groups and trying to come up with collaborative ways to develop solutions.'",
        "'speaker_3': 'I just want to be very clear. This item reiterates every point here, reiterates work that is already being done in the city, right. I think it's amplifying some of the areas that we need to focus a little bit more on, but it reiterates work that is already being done.'",
        "'speaker_3': 'The nuisance alcohol nuisance abatement order is already law should already be enforced. The the motel registry regulation, obviously that that's a that's an area where we need to improve upon. And I think it was mentioned that we are working and have been working on acquiring and looking at potentially acquiring properties along that space through the project homekey'",
        "'speaker_3': '. Also and resources that we have, which could change the dynamic there. But there are another number of other issues, economic development challenges that we are rolling our sleeves up and getting involved in, trying to get new businesses, trying to make that corridor vibrant, inclusive, livable for the residents there, as well as infrastructure challenges.'",
        "'speaker_3': 'And so the the the issues there, they're not brand new. They didn't come up six months ago. Councilmember Richardson alluded to them. This is decades of of neglect that we need to work on. And certainly I will be supporting this item tonight, because I think some of this is, again, common sense and it really.'",
        "'speaker_3': 'Rehashes and amplifies many of the tools that we already have in the toolbox to work on these issues. We just need to be more deliberate and city manager stuff about focusing on the North Long Beach Boulevard corridor. And yes, I think the PD here, anyone from PD can come forward because I want to be clear, because we'",
        "'speaker_3': ', I think, put a euphemism on one on one, the oldest profession in that known the man, and we call it human trafficking. And when I was talking to our police chief just the other day, particularly about this area, there was a there was a breakdown in communication.'",
        "'speaker_0': 'A little bit.'",
        "'speaker_3': 'And you tell me the difference between human how you would interpret human trafficking and what we should be calling the activity that are going on on that corridor.'",
        "'speaker_0': 'So thank you, Councilmember.'",
        "'speaker_1': 'And just for clarification and referring to Councilmember Allen's stats as well, the 80% is for something called the 6647 B call is you will remember that that's a prostitution call and a prostitution issue can be tied to human trafficking.'",
        "'speaker_1': 'Human trafficking is specific to commercial sex workers, minors and adults. The exploitation of those individuals where their victims. And that does happen in North Long Beach. 647 B activity is really a lower level of prostitution that.'",
        "'speaker_0': 'Can involve individuals.'",
        "'speaker_1': 'Who are abusing and addicted to drugs that are homeless, that are living on the street. And that's a bit different than that's a quality of life issue. So there are two separate areas. Both can be tied to the same location or the same crime.'",
        "'speaker_1': 'But human trafficking is at a much higher level.'",
        "'speaker_3': 'Thank you. So so what's occurring and what the complaints that we're getting on Long Beach Boulevard are not human trafficking complaints. That's correct.'",
        "'speaker_0': 'So most of the.'",
        "'speaker_1': 'Complaints start as a 647 B.'",
        "'speaker_0': 'Call.'",
        "'speaker_1': 'But those could lead to human trafficking cases as well. So the 647 B is a prostitution call. And then through investigation, you can find that it's the exploitation of an individual and can become a human trafficking call. And we also do proactive effort with the L.A. County Human Trafficking Task Force and a bunch of things that were'",
        "'speaker_1': 'mentioned tonight in terms of collaboration and outreach and trying to address the human trafficking issue.'",
        "'speaker_3': 'I see. I'm out of time. I'll recue and I do look forward to hearing from the public as well.'",
        "'speaker_1': 'Thank you. Councilman's in the house.'",
        "'speaker_6': 'Thank you very much, Vice Mayor, for bringing this up. Of course, I'm a strong, strong, super strong supporter of this because nuisance liquor stores have been a great concern for my residents throughout the district, but in particularly within our Washington neighborhood, which seems to have a high concentration of them.'",
        "'speaker_6': 'In most recent District one check ins, a number of of parents raised concerns about liquor stores too close to their children's schools. And therefore, it is incredibly important to be able to receive updates for residents to know that this city is doing what the city is doing to address these issues.'",
        "'speaker_6': 'One of my things and I just had a meeting on this this week, and I know that we have some of these programs right now, but I would I would like to know why they are in existence, what is you know, what is happening right now?'",
        "'speaker_6': 'Because I know that we have a lot of liquor store news, new nuances in our liquor stores, in our neighborhood. And I know that from what I understand, there hasn't been too much too much done in that area.'",
        "'speaker_6': 'And maybe staff can allude to that, please.'",
        "'speaker_1': 'So Council member Christopher comes from Development Services. As was mentioned in the discussion, the Alcohol Nuisance Abatement Ordinance is on the books. It was. There were over 70 different inspections around the city that were conducted prior to the pandemic.'",
        "'speaker_1': 'More limited work was done during the pandemic. When we talk about motels and when we talk about alcohol, those are multi-disciplined efforts. So those involve staff not just from planning but from other parts of DV, our code enforcement staff, our building staff, our partners at the fire department, our partners, that police department, our partners at the Health'",
        "'speaker_1': 'Department. It's really important work. But some of the motel visits, you know, it's a it's a nine person team. So that has not always been possible to pull together for a number of reasons during COVID. But we have continued to operate the program at a modified, more complaint driven fashion.'",
        "'speaker_1': 'And as we resume staffing in a more normalized way, many of these programs are coming back online, and we hope to be a sort of a more normal operating range this coming October. But we'll be glad to get into more detail in the report back.'",
        "'speaker_1': 'And then we'll also be able in the report back to be able to talk about what these programs do and what they don't do. So the ANAO program, which is for liquor stores, is a great program. It's unique.'",
        "'speaker_1': 'There's a few places in San Diego County that have a program similar, but most cities don't do this, and it's great at getting liquor stores cleaned up, getting them, you know, nicer looking, which helps with loitering, which helps with the appearance, but it doesn't close the liquor store.'",
        "'speaker_1': 'So it doesn't deal with a related issue that we talked that I heard the council discussed this evening, which is just the sheer number of liquor stores in certain areas of the city or in the city at large.'",
        "'speaker_1': 'So so it takes different policy tools to address different issues. So I want to assure you, we have been working. It's not that we forgot about this issue, but it has been a modified approach during the pandemic.'",
        "'speaker_6': 'Thank you, Mr. Quince. And I know that, you know, we've been working on certain areas in my district, so I do appreciate that. From what I understand, there was also a shortage and staff in that area. Is that so?'",
        "'speaker_1': 'So we have the position that the staff program has been vacant for some time prior to it being vacant. That individual. Well, I can't get into the employee issue, but that we could not send that individual into the field during the COVID pandemic for a specific reason, which created an operational problem.'",
        "'speaker_1': 'And then the position was vacant. So we're going through a process of filling that position. That position was recently filled and that person is training. And then when we are in front of you, or when the city manager and the finance director are in front of you during budget season, we'll be talking about stopping within that department'",
        "'speaker_1': ', including staffing scenarios that better address this and other needs in the department.'",
        "'speaker_6': 'Wonderful things. Thank you, Mr. Kunze, for for addressing that. And again, thank you, Vice Mayor, for bringing this up. This seems to be a very, very important item. And so I'm very happy to support this item.'",
        "'speaker_1': 'Fantastic. And we'll go to public comment. But I think some of the discussion here is just to refocus that quality of life on particularly on the issue that's, you know, sort of attached to this area for so long has to be multi-pronged.'",
        "'speaker_1': 'It's got to be short term and long term. The short term is what's been impacted by the pandemic, the staffing, the availability to have bodies out there addressing issues. But the long term is still ongoing. Long term is addressing the zoning, updating the zoning up plan, making sure investment is happening over there.'",
        "'speaker_1': 'That's incredibly important. That continues to move forward. And addressing the new nuisance liquor stores through acquisition, that focus has continue. You're not going to see a significant difference long term if we keep coming back to the same issue unless we change the corridor.'",
        "'speaker_1': 'You have to change some of the uses in PD 23 or are you going to continue coming back to the very same issue? So let's go ahead and go to public comment. We have ten speakers up, so I'm going to call the first five so I can say David San Jose, Patricia Long, Carlos Valdez, Rene Rios, come'",
        "'speaker_1': 'on forward. First this night. There's a night out here. Okay. Next is Dave, San Jose. And you guys can come on up and line up because it's going to go back to back. The next after Rene is Lynda Wilson, Lynda Campbell, Annette Mather, Monica Keller and Steve Neal.'",
        "'speaker_1': 'If everybody can make their way, that would be helpful. Go ahead, baby. I'm for. I remember that year. Councilor, thank you for this opportunity. Uh, this. There was a program of five years ago. They came in and were working on the same situation with the motels, the prostitution.'",
        "'speaker_1': 'And it was working. Then all of a sudden, it went by the wayside. I don't know what happened, but I know in the last four or five years, my neighbors don't feel safe. I think we need some help and maybe trying to fix this thing.'",
        "'speaker_1': 'My community by not feeling safe is I think maybe the problem is we don't have enough police to protect our city. I don't know how many it takes. I don't think it takes the same amount. I think it takes more than it did five years ago.'",
        "'speaker_1': 'So I all the officers that I know are really doing their duty. I really appreciate them. But this here really needs to be fixed and we don't know what to do. I think you guys know what to do, but I think the first thing we've got to do is make our city safe without law and order in'",
        "'speaker_1': 'our city. We don't really have a city. Thank you. Thank you. Next is Patricia Lang.'",
        "'speaker_5': 'Hi, everybody. Thank you for inviting me here. And this issue has three stages to it, as you can see on your agenda. My name is Patricia. I live at 202 Eastport for 40 years. I'm the president of Coolidge Triangle Neighborhood Association, and I represent 550 homes in my neighborhood.'",
        "'speaker_5': 'The first part of this is about the motels. The motels bring some of the problems to our neighborhood. And as Rex mentioned, he was a victim of that about four or five years ago. Things seemed to get better.'",
        "'speaker_5': 'But as you say, the pandemic created that. What we have now is a problem with prostitution, and the prostitution is out of hand. And I've done my best to work with the police commander that we have. We meet on Zoom meetings to try to find out what we can do.'",
        "'speaker_5': 'We call and report the situation on the boulevard, but it doesn't seem to make much difference. And, you know, it has now come into the neighborhood. It's not just on Long Beach Boulevard. It's in the neighborhood. When I go out to take my dog for a walk, I have to look and see the paraphernalia after sexual activity'",
        "'speaker_5': 'in the gutters, in my street, by my house, my neighbors are just frantic because this is happening. The children are having to go to school. The Colin Powell, they are being approached by prostitutes. And a couple of weeks ago on a Sunday, I hate to tell you this, but there was a young woman standing in the street'",
        "'speaker_5': 'totally naked. And we call the police like we've been instructed to do. The police came and I thought this would be an opportunity for us to engage because I know what the sex trafficking rules sort of are. We're trying to help these ladies.'",
        "'speaker_5': 'So. They put the lady in the car. A second car came with a woman officer. They gave her clothes to wear and then they sent her on her way. So now she was back in the neighborhood. The part that I can't understand is because as a nurse, this seems to be like a perfect opportunity to get that'",
        "'speaker_5': 'person help. But she did not go anyplace except on back on the street. I don't know if that was because it was on a weekend.'",
        "'speaker_7': 'Your time is up. Thank you.'",
        "'speaker_5': 'I think that this issue is so severe that we really need to work on this. And we have been trying as hard as we can, and we need your help.'",
        "'speaker_1': 'Thank you. Next is Carlos Valdes, then Rene Rios. Good evening. Carlos Ordaz from Coolidge Triangle and former president of Coolidge Triangle Neighborhood Association. I remember Rex when he first started with Steve Neil. We had prostitution issues. We spoke of decades, not just one decade, decades of human trafficking.'",
        "'speaker_1': 'Think you've been in office in the ninth for about ten years, so that contributed to one of those decades. Just get perspective. I think there's a decorum that we've all tried to maintain of patients that is evolved to rage because you run into other parts of our city.'",
        "'speaker_1': 'And as many of you said, you would never accept this. Office of Equity. Where is the equity for us? And he lived in that neighborhood. You were one of us. We voted you in and you turned away. You moved to a different district, and the problem became deeper and more pervasive.'",
        "'speaker_1': 'Now we're looking at creating hotel turnkey. I don't think any of us were approached in the community about that. Like, one of many things, it's just a surprise. Just like landing settlement when you didn't tell us about that.'",
        "'speaker_1': 'And we had Robert Foxx show up at our neighborhood association meeting. There has to be transparency and clarity in everything we do. It's our neighborhood. We're homeowners. We're vested there. And I just don't want us to continue with status quo.'",
        "'speaker_1': 'There's a lot of promises, a lot of marketing, and it's right before election time. You know, this is what I've done, but I think we've waited too long. And you know, I surely hope that we get away from all the talk and more action.'",
        "'speaker_1': 'It's for that very reason. We decided to leave the ninth District because we had no more confidence and we were really looking forward to working with you and helping us transform it along with Susie Price. It's not just something personal.'",
        "'speaker_1': 'I think as some have said, this is personal. Know it when it comes to my home, my my neighbors here. Pat You see here. Dave, they've been there for decades. If it's happening to my neighbors, I feel like it's happening to me.'",
        "'speaker_1': 'And maybe, perhaps some don't care because they're looking for other aspirations. But we cannot continue with the status quo. And I really hope that we just don't use our neighborhood that we're vested in as a platform to say, well, look what else I have on my political resum.'",
        "'speaker_1': 'You know, I take a look at how endorsements are made, pay for play, and we need to stop it because we're real people who have real interests and we're going to continue fighting. That's all I have to say.'",
        "'speaker_1': 'Next speaker is Rene reals.'",
        "'speaker_8': 'I'm going to wait for the last speaker.'",
        "'speaker_1': 'You have to actually go in order.'",
        "'speaker_8': 'I can't wait to announce.'",
        "'speaker_1': 'Madam Clerk.'",
        "'speaker_7': 'We do have her. Next up.'",
        "'speaker_2': 'It's your discretion as the chair.'",
        "'speaker_1': 'Then I think we're going to go in order.'",
        "'speaker_2': 'Renee, if you going to refuse.'",
        "'speaker_7': 'Me.'",
        "'speaker_8': 'Putting on record, I want to be left.'",
        "'speaker_1': 'Okay. Linda Wilson. And then Linda Campbell. And then Annette Mazur.'",
        "'speaker_7': 'Good afternoon. Mayor In his absence. Vice Mayor Although the city council representative that's here. Thank you for being here tonight and thank you for hearing this very important issue and concern. First of all, I want to say that we want to urge you to please take this this problem that we're having, which is a very serious problem'",
        "'speaker_7': ', which has been going on for a long time. But we are asking for your help. We want to thank the fact that we have been working with the North Division police commander.'",
        "'speaker_1': 'On.'",
        "'speaker_7': 'Several conference calls. And so the main things that she is trying to get to implement the program that she suggests that she would do. We'd like to make sure that she gets that money and in all of the resources that she needs and any additional monies that she might need to make that happen.'",
        "'speaker_7': 'Prostitution. Sex trafficking is a serious matter. It comes out of Compton. We're in the north corridor of Long Beach. It comes out of Compton, comes down Long Beach Boulevard. It affects our youth. It affects our senior citizens. So we have our eyes affected, all age groups affected by what's going on here.'",
        "'speaker_7': 'We urge you and earnestly plead with you to make sure that this proposal is accepted and put forward in the most expeditious manner.'",
        "'speaker_1': 'Thank you. Thank you. Next is Linda Campbell.'",
        "'speaker_7': 'Good evening, fellow Long Beach citizens. I live in the ninth district. I've lived there for 42 plus years. The Long Beach corridor is. A problem, and it's been a problem for a very long time. It's time to step up and.'",
        "'speaker_7': 'Enforce the ordinances and the police protection, whether it be prostitution or sex trafficking or the. Outrageous number of liquor stores that are in that corridor. It all contributes to a negative quality of life for the citizens, for the children who have to walk past that to go to school.'",
        "'speaker_7': 'For the teachers. Who have to drive into the neighborhood. To do the job to educate our.'",
        "'speaker_1': 'Future.'",
        "'speaker_7': 'Citizens. We need you to. Do what the ordinance asks of the city to make our city. A more vibrant. Space for all of us to live, and thank you in advance for the support you're going to give.'",
        "'speaker_1': 'Thank you. Next to his mother, then Monica Keller. And our last speaker is Steve Neal. Thank you.'",
        "'speaker_7': 'Hello. My name is Ron at Mars. I'm with the Hamilton Neighborhood Association co-chair. I'm also here representing the North Long Beach Neighborhood Alliance, all of the neighborhood leaders in North Long Beach. We're in support of this agenda item and we would urge that you do approve it.'",
        "'speaker_7': 'The only difference I would like to make is that time is of the essence. And I'm going to give you the following statistics to prove why a victim of sex trafficking is, on the average, raped 6000 times in seven years.'",
        "'speaker_7': 'In 2019, one in six children reported missing in the US was likely a victim of sex trafficking and most were in the welfare system when they disappeared. The average victim of sex trafficking. The life expectancy is 3 to 7 years.'",
        "'speaker_7': 'Sex trafficking accounts for 77% of human trafficking cases. California and Texas consistently have the highest number of reports of human trafficking cases. The odds of escaping a human trafficking situation are 1%. 95% of girls born in a red light district will be sex trafficked and die in captivity.'",
        "'speaker_7': 'One in 40 million slaves in the world. One in four of those is a child. Please do not wait for reports to come back. To take action. Thank you.'",
        "'speaker_1': 'Thank you. Monica Geller.'",
        "'speaker_7': 'Good evening. My name is Monica Keller. Thank you, city council members for addressing this this initiative. And I am the starting neighborhood president. And on behalf of my neighborhood, I stand with this agenda item and ask that you support it.'",
        "'speaker_7': 'And just to let you know, as long as I've lived there, that is been one of the main things that I hear, especially during my encounters with my fellow neighbors. That is one of the biggest frustrations that they have regarding the human trafficking issue.'",
        "'speaker_7': 'So I think that it is really important that we support this initiative and that we bring all the resources that we can bring to the area as soon as possible. We have, like all the leaders have said, met with our commander, Megan Sable, and we really are thankful to her for listening to our concerns and working with'",
        "'speaker_7': 'us to make sure that we address this issue, which is, as we've heard, is getting out of control. And again, the human trafficking issue is one that we really want to solve. It affects everyone, especially our children in our neighborhood.'",
        "'speaker_7': 'We have to start being elementary and to and from school. These children are witnessing things that they are too young and should not be seeing and that they may be exposed or become victims of. As my fellow colleague has stated.'",
        "'speaker_7': 'So, as I said during our cleanups, we're fighting paraphernalia and before any kind of event in the neighborhood, we have to kind of go through it to make sure that we don't find some of this stuff out there.'",
        "'speaker_7': 'I don't know of any other neighborhoods experiences, but it's kind of frustrating. It's kind of sad that we have to deal with this on a daily basis. So I really ask and I think of Vice Mayor Rex Richardson for bringing this forth.'",
        "'speaker_7': 'And I ask that you all support this and not only like you said in the short term, but the long term. I think this has been a generational issue. And I think all the generations that have lived there and are still there are ready for change.'",
        "'speaker_7': 'And it is a step in the right direction. So I ask for your support on this. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Steve Neal. Good evening Vice Mayor as the council members and the community. Steve Neal My address on file. I'd really like to thank Vice Mayor and Council member Sorrell and Allen for bringing this forward. As you've heard from our residents in the north Long Beach, this is an issue that has plagued the north Long'",
        "'speaker_1': 'Beach area, as we've said, for decades. I had the distinct honor of representing that district. It was a problem when I got there. It was a problem when my predecessor got there. But we are moving in the right direction to address it now.'",
        "'speaker_1': 'I think the attention that you're putting on it and I'd like to I'd like to phrase the wri, the I'm sure a council member, Austin, who now represents this area and is going to be inundated with this. The two focuses on that, knowing that we've got to make a difference up here.'",
        "'speaker_1': 'The I think you hear the frustration in the residents. It's just that this has been going on for so long. And I will say that it has been a lot of progress that was being made. And just like everything else, the pandemic throws everything off.'",
        "'speaker_1': 'But to re-address your focus to this particular part of town, Ms.. Wilson talked about the the Long Beach corridor, and really it starts here in Long Beach and it goes all the way to South Gate. You know, these these type of motels are common throughout the Long Beach corridor from Long Beach to South Gate.'",
        "'speaker_1': 'So you will find that's part of that that sex trafficking, the prostitution area. But a dedicated focus here in North Long Beach, I think would be greatly appreciated. And just by hearing my fellow residents concerns now, it's always been a problem, but it seems to be bubbling to a much greater intensity now.'",
        "'speaker_1': 'So I urge your support. I thank all of you guys for bringing this item forward. Thank you. Thank you so much, Renay. And to everybody here, thank you so much for coming out because you. I didn't say that.'",
        "'speaker_1': 'Hang on. You all waited. You heard multiple cannabis items. I know it's frustrating to wait this late. Everyone took their time to speak at the right time. But I do understand you've waited a long time, and it's a frustrating issue.'",
        "'speaker_1': 'So we're going to depart from the standard practice and go ahead and deliver your public comment.'",
        "'speaker_8': 'You're going to want now.'",
        "'speaker_1': 'You can deliver your public comment.'",
        "'speaker_8': 'Good evening. My name is Rene REO at the president in Language Neighborhood Association. Now I'm in the district. I have been a longtime advocate for my community. I actually go every month, door by door, passing out fliers about our community events and issues.'",
        "'speaker_8': 'And on behalf of many residents and many leaders that I have spoken to, they ask, why now? Why? We've been plagued by this for years. We had multiple meetings and meetings with you and your staff about this issue.'",
        "'speaker_8': 'And we're so frustrated. So what happened? Eight years in office. I have personal conversations with you about this issue and just blow me off to the side. Just like, you.'",
        "'speaker_2': 'Know, council members.'",
        "'speaker_8': 'We have children walking down this corridor, being approached by pimps and prostitutes. We even the johns who don't even get service by the prostitutes, are now reaching out to our neighbors, young neighbors, following them to their homes. They're not feeling safe.'",
        "'speaker_8': 'Now again, Rex. Many residents in my neighborhood and leaders are asking, you know, why? Is it because there's an election coming up? It's perfect timing. You have this type of behavior. So I am here since a part of this agenda item because I'm an advocate for my community and I ask the council, please stand by us and'",
        "'speaker_8': 'move this forward, because this is going to be an item that's going to help our streets to be safe for our children and for our residents. So I just.'",
        "'speaker_7': 'Want you to.'",
        "'speaker_8': 'Understand how important this for all of us. And thank God now we're with us. And hopefully you can pick up from all the mess that reckless behind.'",
        "'speaker_1': 'Thank you, Councilman Austin. You know, pick up the ball.'",
        "'speaker_3': 'Well, thank you. I just want to thank all of the residents who came out in support of this particular item. I, I understand. I feel I think this council feels and understands your passion. I was we were we were just all together, particularly with the Longwood and Coolidge Park neighborhood groups just a few weeks ago, where we'",
        "'speaker_3': 'had a capacity crowd of, you know, I want to say 50 or 60 people coming together. And we had a community conversation around some of these issues. And my office has been in contact, constant contact, working on issues as they come up, but also working on long term solutions with our staff, with our police department, with our'",
        "'speaker_3': 'economic development department, with our Development Services Department, our public works department. We're going to put a full court press on this particular community and give it the attention that it deserves. And that's my commitment to you. I would just ask that and thank you for coming to City Hall today and bringing light to these issues, because oftentimes'",
        "'speaker_3': 'the rest of the city staff don't don't hear and don't hear from the residents, hear the frustrations or feel the frustrations. And so tonight, you all endured a long meeting. You stayed tonight. You spoke your piece. And and I think this this entire council understands what we need to do to support you.'",
        "'speaker_3': 'And again, we'll be engaging with our city staff to to make sure that this area gets the focus and attention it deserves. Again, I think there are a number of remedies that that haven't even come up and aren't even addressed in this particular item that we can work together to to to get to solutions.'",
        "'speaker_3': 'But some require us all working together. And I ask that you not retreat, that you not abandon your ideas and your convictions, and let's work together to make it happen. Those are my comments and I look forward to voting to support this.'",
        "'speaker_3': 'Thank you, Mr. Richardson.'",
        "'speaker_1': 'Thank you. I'll just add some final thoughts. So thank everybody for coming out. I think, you know, we've known each other for a very long time and we've made some meaningful progress together. But the reality is the pandemic is impacting all of us.'",
        "'speaker_1': 'It's not an easy issue. I appreciate Councilman Neal highlighting. He dealt with this issue, Velarde dealt with this issue, and the next council member is going to deal with this issue unless we break the cycle. We have to commit to systems thinking.'",
        "'speaker_1': 'We have to rezone the corridor. We have to address the nuisance uses on those corridors. That takes time. But we've been working every year, some would say. Why now? 2014 Alcohol Nuisance Abatement Ordinance. 2015 It was implemented. 2017 Motel Task Force.'",
        "'speaker_1': '2018 The Motion to Create the Motel Ordinance 2020 The Moratorium Ordinance went into effect. I've been to all of your homes. I've worked with you along the way. You all know the story. It's systemic issues that we have to change the policy.'",
        "'speaker_1': 'The pandemic happened in 2020. That set us off track. Today's focus, people say, why now? It's because we're trying to get our economy, trying to get our communities back on track. And it's only going to happen if we work together.'",
        "'speaker_1': 'So I look forward to the spirit of collaboration Councilman often mentioned. I look forward to new ideas. If there are new ideas, we certainly need them. This was framed in the context of the entire Beat Beat 23 because there's progress happening across that beat.'",
        "'speaker_1': 'But, you know, there are some significant issues on Long Beach Boulevard, both sides of Long Beach Boulevard. And so the pathway forward is unity. But we have to think about systemic changes. We don't want to pass this on to wear continues to go for generations and generations.'",
        "'speaker_1': 'So thank you all for coming forward. Thank you to the city council and let's go ahead and have our vote.'",
        "'speaker_2': 'Councilwoman to the house. Motion is carried.'"
    ],
    "Resolution to Support Sidewalk Food Vending Legislation.": [
        "'speaker_1': 'All right. I think we have item 21 now. Right. Thank you so much. Item 21.'",
        "'speaker_2': 'Report from City Attorney Recommendation to adopt a resolution in support of legislation to enact changes to the California retail code related to sidewalk food vending, and adopt a resolution to implement a citywide enforcement model that prioritizes education and outreach for operating without a health permit.'",
        "'speaker_1': 'All right. Councilman's and they just want to make this motion. I think this is a response to your item. All right. Is there a staff report for this? It's not necessary. It's fine during public comment on item 21.'",
        "'speaker_2': 'No public comment on item 21.'",
        "'speaker_1': 'All right, members, please cast your vote.'",
        "'speaker_2': 'Motion is carried.'"
    ],
    "Resolution to Request and Accept State Loan for Emergency Rental Assistance Program.": [
        "'speaker_1': 'Thank you. Next is 22.'",
        "'speaker_2': 'Report from Development Services recommendation to adopt a resolution to allow the City of Long Beach Emergency Rental Assistance Program to continue assisting eligible renters and execute all necessary documents with the California Department of Housing and Community Development to implement and comply with related state regulations citywide.'",
        "'speaker_1': 'Thank you. I think there's a staff report on this. Yes, there is. I'll turn it over to, of course, he and his team.'",
        "'speaker_0': 'Thank you. Council mayor and council members.'",
        "'speaker_1': 'Tonight, you'll hear a longer presentation, but I'd like to introduce this item. We've had a.'",
        "'speaker_0': 'Phenomenal success with the implementation of the Long Beach Emergency.'",
        "'speaker_1': 'Rental Assistance.'",
        "'speaker_0': 'Program. To date, we have issued over $50 million.'",
        "'speaker_1': 'In assistance and assisted over.'",
        "'speaker_0': '6500 applicants for this program. We are now winding down the program and.'",
        "'speaker_1': 'Are asking the Council to adopt a resolution to request and accept the state rental assistance cash for loan program, which will allow us to continue this effort and help assist those that we still have not been able to.'",
        "'speaker_1': 'And with that, I'd like to have hand this over to Patrick. You're our Housing and Neighborhood Services Bureau manager. Thank you.'",
        "'speaker_3': 'Thank you, Oscar. Good evening, Mayor, vice mayor and City Council. In 2020, the Federal Consolidated Appropriation Act authorized the Emergency Rental Assistance Program, known as ERAP, followed by the state's SB 91, which established the state's program for administering its share of funds.'",
        "'speaker_3': 'The state offered to run a rental assistance program on behalf of the city, which was called Option A, or to provide funding to the city for it to run the program itself. That was option B and the city of Long Beach chose option B.'",
        "'speaker_3': 'The city received $30.2 million in combined federal and state grants referred to as ERA one, ERA one. And in March 2021, the American Rescue Plan established an expansion of Erap, which is referred to as ERA two and was administered similar to ERA one.'",
        "'speaker_3': 'With that program, the city received $34.3 million and ERA two funds. In total, $64.5 million in the city is expected to fully obligate these funds by the end of June 2022. The Federal Government. The Treasury has allowed us to apply for funds that were clawed back from agencies that did not do as well as we have done'",
        "'speaker_3': 'with our program. And those are called recapture funds. So we're working on that. But in the meantime, the State Senate Bill 115 established the State Rental Assistance Cash Loan Program, providing short term cash flow loans for eligible option B jurisdictions participating in the ERAP program.'",
        "'speaker_3': 'Option B's and cities, including Long Beach, will be able to receive cash flow loan payments in monthly installments. The amount of the state loan program will be determined by the amount indicated in the request for reallocated funds from ERA one submitted to the Treasury.'",
        "'speaker_3': 'The city has submitted three separate requests totaling $28 million to the Treasury for estimated access obligations based on prior erap monthly expenditure averages and using a formula that the Treasury provided to us. If approved, the loan funds will allow the city to continue to provide rental and utility arrears payments to eligible applicants that submitted an ERAP application'",
        "'speaker_3': 'before the March 31st, 2022 deadline.'",
        "'speaker_1': 'Thank. Balloon is available to.'",
        "'speaker_3': 'All option B cities, including Long Beach, who have obligated and or spent all allocated federal funds down to a zero balance and can prove a need for additional funds if the city does not receive the full amount of reallocated funds that was requested.'",
        "'speaker_0': 'By June 30th.'",
        "'speaker_1': '2023. The sister state will.'",
        "'speaker_3': 'Forgive the city's loan amount up to the amount not covered by the federal funds. Amounts allocated to the State Department of Housing and Community Development under SB 15 will not accrue interest. A sorry program. Expenditures must be for complete eligible applications submitted by households that were received on or before March 31st, 2022, and includes an administrative cost'",
        "'speaker_3': 'to run the program. No future rents can be paid through this program. So here again, we're here seeking the council's approval to adopt a resolution to request and accept state rental assistance cashflow loan program funds. That's a mouthful to allow the Long Beach Erap program to continue and authorize the city manager to execute all necessary documents with'",
        "'speaker_3': 'the State Department of Housing and Community Development. That concludes my presentation. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Ranga. Just for support of this. I think it's a good program that we need to support, and I'm very glad to be on the on the second of the motion. Thank you, Councilman Ciro.'",
        "'speaker_8': 'Yeah. Thank you for the presentation. I just had a question about I think it's really important that we continue to get the assistance we need from the state. And I was just wondering, how about how much are we trying to recover to ensure that we're able to fulfill all of the applicants that submitted their application?'",
        "'speaker_3': 'Councilwoman were we're applying for $28 million through this round, but we will have another opportunity to apply for additional funding equal to or even greater to that amount. So we could end up with another 50 to $60 million to use for the program.'",
        "'speaker_8': 'Yeah, but I think that one of the things I'm a little I needed clarity is that this is for only exist for those who have submitted. There's no new applicants that are now accepted. Right. It's to fulfill in this program.'",
        "'speaker_0': 'That is correct. The program was sunset.'",
        "'speaker_1': 'On the end of March.'",
        "'speaker_0': 'And we are trying to get.'",
        "'speaker_1': 'Those that have already applied to assist them.'",
        "'speaker_0': 'Potential future programs may.'",
        "'speaker_1': 'Allow us.'",
        "'speaker_0': 'To reopen the program and allow others to to apply.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. I'll just add, I want to just thank and congratulate staff on continuing to figure out how to deploy more resources, keep people in their homes. That's what this is about. We know that significant population in our city are feeling increased impacts from COVID 19, particularly families that make below 70,000 a year.'",
        "'speaker_1': 'They're the ones that are impacted by inflation, rising costs of housing, rising cost of fuel prices, all of those things. And so whatever we can do to deploy more resources to keep people in their homes, I think is good for our city.'",
        "'speaker_1': 'And so is there any public comment on this item saying, nonmembers, please cast your vote?'",
        "'speaker_2': 'Motion is carried.'"
    ],
    "Ordinance to Approve Water and Sewer Rates and Charges Effective June 1, 2022.": [
        "'speaker_2': 'Motion is carried.'",
        "'speaker_1': 'Item number 30 Please.'",
        "'speaker_2': 'Report from City Attorney Recommendation as clear ordinance approving resolution number WD 14418. A resolution of the City of Long Beach Board of Water Commissioners establishing the rates and charges to be changed for water and sewer service and declaring the urgency thereof, and providing that this ordinance shall take effect at 12:01 a.m. on June 1st, 2022.'",
        "'speaker_7': 'Citywide.'",
        "'speaker_1': 'Thank you. It's been moved in. Seconded. Any public comment on item 30?'",
        "'speaker_2': 'There is Mr. Dave Shukla and this requires two votes, one for the urgency and one for the ordinance.'",
        "'speaker_1': 'Right. Mr. Shukla, you're up. Okay. He declined. Okay, let's go ahead and have our first vote.'",
        "'speaker_2': 'Motion is carried.'",
        "'speaker_1': 'Thank you. We need a motion to second on the second vote. Thank you. Please cast your vote.'",
        "'speaker_2': 'Motion is carried.'",
        "'speaker_1': 'Thank you. That satisfies the agenda. Now we have our second public comment. General public comment in a member of the public would like to address the council. Now would be the time.'"
    ]
}