{
    "Confirmation and Direction on the Proposed 2021-2029 General Plan Housing Element.": [
        "'speaker_0': 'Great. Well, let's jump right into it. We have. The next item is hearing 12. The housing element.'",
        "'speaker_1': '912 is a report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and confirm the proposed 2021 2029 General Plan Housing Element Citywide.'",
        "'speaker_0': 'Great. So I know we have a staff presentation.'",
        "'speaker_1': 'I know I'm there for the day. I'd like to introduce the planning manager, Patricia Defender, for who will lead this presentation along with other members of the development services team.'",
        "'speaker_0': 'Great. We'll give them a few seconds to get set up over there. Whenever you're ready.'",
        "'speaker_2': 'Thank you so much, Vice Mayor. Council members. Thank you and good evening. My name is Patricia Defender, her the planning bureau manager. I'll be providing this presentation on the Planning Bureau's efforts to update the city's housing element as required by state law.'",
        "'speaker_2': 'The Council is not being asked to adopt the proposed plan this evening, but rather to confirm the policy direction of the plan so that staff can resubmit this revised plan to the State Housing Department for its review. I'll provide more information on that process later in the presentation.'",
        "'speaker_2': 'So staff has provided many different presentations to the City Council on Housing related topics as some of these earlier slides I'm going to go through more quickly. As you know, the housing element is one of many required elements of the general plan.'",
        "'speaker_2': 'It assesses the condition of the city's housing and housing needs of its residents. It establishes a roadmap for accommodating projected housing unit demand for existing and future residents. And it sets the city wide goals, objectives and policies for housing.'",
        "'speaker_2': 'It must be updated every eight years and submitted to the state for its review and certification. And one of the main objectives of the plan is to remove barriers to housing production and to help ensure that the city is planning for its fair share of affordable and market rate housing.'",
        "'speaker_2': 'Staff has been working on the update to this housing element since early 2020 and has conducted both extensive technical analysis and community engagement. Staff released an initial draft of the plan on July 20, 2021, the year before for the public review and submitted it to the state as well.'",
        "'speaker_2': 'And just as a point of note, the housing element is one of the most regulated of all. The general plan elements by the state and the city must obtain certification for the housing element from CDD to be compliant with state law.'",
        "'speaker_2': 'This slide summarizes that the public outreach and engagement that was conducted for this plan, a great deal of public engagement was conducted largely virtual outreach as COVID hit during the early surge or process of the of this planning process.'",
        "'speaker_2': 'So it limited the in-person outreach that we could do. Many of the types of activities related to outreach included virtual workshops, including Spanish workshops, multilingual focus groups, community meetings there, a virtual open house on the website that allowed people to provide input.'",
        "'speaker_2': 'And this is just on this slide kind of summarizes many of the different efforts as well as this incorporating the feedback of other recent housing related efforts to inform the plan. This slide just shows the different components of the housing element.'",
        "'speaker_2': 'Much of this is prescribed and required by state law and the housing. The draft before you does include all of these different components. The next several slides describe the current state of housing in the city and some of the challenges around that are around housing.'",
        "'speaker_2': 'Much of this this information and data has been shared with the council over time. So I'm just going to go over very quickly. Basically, this slide talks about the fact that 43% of all long beach households are housing cost burdened, and that means that they pay too much for their rent or their mortgage and the even the'",
        "'speaker_2': 'higher paying jobs. The average salary of more well-paying jobs in the city do not. Provide income sufficient to pay for the average rents in the city, which is nearly 9000 dollars. Nor too high for purchasing a home in the city.'",
        "'speaker_2': 'This provides information on how different races are affected by the current constraints of the city's housing market. Long Beach has long been a majority renter city for a number of decades. 2160 1% of the households rent their homes.'",
        "'speaker_2': 'The chart on the left shows that people of color are more likely to be renters. For example, 80% of black households rent in Long Beach. Similarly, the chart on the right shows those that are the division between those who rant and those who own by race.'",
        "'speaker_2': 'And black homeowners are one of the smallest group. Groups of homeowners with four out of five households renting, which we've seen typically means greater housing insecurity. This slide just shows how population has increased at a greater rate than housing units, and this has contributed to a lack of supply.'",
        "'speaker_2': 'And they are also on the right. The graph shows that the housing stock of the city is a very old and aging housing stock, with much of its housing being 30 and even 50 years old. And of course, all of these conditions have contributed to overcrowding in the city and there's significant overcrowding in the city.'",
        "'speaker_2': 'And Black, Latino and Asian and Pacific Islander communities in Long Beach all have higher overcrowding rates as compared to the L.A. County. And almost a quarter over a quarter of Latino residents have lived in overcrowded conditions. This has been particularly challenging during COVID, where more people are staying at home and people are both working and children are'",
        "'speaker_2': 'attending school at home. And that was much of what we heard in our outreach. This next slide just shows the rent levels that are would be affordable to people at different income levels based on the L.A. County median income.'",
        "'speaker_2': 'So you can see by these rent levels, by income level and by size of the units, the number of bedrooms that units or rents are unaffordable to many in the city. They're unaffordable to low income and even some moderate income households, because as you recall, the average rents was about 1900 dollars a month.'",
        "'speaker_2': 'This slide just shows summarizes how the city did in terms of achieving its arena. In the last cycle, in the last eight years, the city added fewer than 4000 housing units and only met 60% of its affordable rent requirements.'",
        "'speaker_2': 'And the new arena is going to be challenging and requires many strategies because it is significantly greater than that of the last cycle. This slide does show the reasons for this upcoming cycle. It is 26,000 units. It is nearly almost four times greater than the arena of the last cycle.'",
        "'speaker_2': 'And almost 60% of the units must be affordable. As you may recall, that staff provided a presentation on the site inventory and the methodology related to the site inventory. Back in April of this year. An important and required part of updating the housing element is to develop a site to develop a site inventory.'",
        "'speaker_2': 'The site inventory identified sites that meet specific criteria and can be developed with housing in the future. It is again required by state law as a way for the city to demonstrate that it has the sufficient capacity and its zoning to accommodate the arena.'",
        "'speaker_2': 'Just as a reminder, the the EU provided the framework for the site inventory and all the sites identified on the map assume densities that are consistent with their place type designation in the elderly. And just again, you know, our staff had described the methodology which involved applying uniform criteria to all parcels of the city to identify sites'",
        "'speaker_2': 'that are under-used based on their zoning and or their place type designation and therefore have a higher likelihood of being developed with housing in the near future. The map shown here on the left represents the results from the site inventory, the latest results, which has been refined a little bit.'",
        "'speaker_2': 'That has largely stayed the same since that April presentation. So the next few slides are just going to talk a little bit more about the site inventory. You may recall that staff prepared two different scenarios. One scenario was the number of units that can be accommodated given the current zoning of the city.'",
        "'speaker_2': 'Under the current zoning, using the Uniform Code criteria that were applied citywide, there is insufficient zoning capacity to meet the Rena and that it only results in less than 15,000 units. With the ability to take credit for pipeline projects and to use the the current zoning scenario is still about 10,000 units short of what is needed.'",
        "'speaker_2': 'So as we have discussed over time, since the city can't meet the Rena using the existing zoning, the city has to commit to rezoning properties consistent with the AUV within 1 to 3 years. In order to to meet the Rena.'",
        "'speaker_2': 'And I'll explain a little bit more about the laws and how the laws have changed recently. The place type scenario is the other scenario that was prepared. It's fortunate for the city that the city had already adopted the land use element, which plans for which plan for additional growth and provides a road map for the necessary rezoning'",
        "'speaker_2': 'to accommodate the Rena and will enable the city to rezone within the prescribed period of time. Since most properties in the city have not yet been rezone to implement, the levy staff has developed the second scenario to demonstrate how once rezoning does occur, the the number the the Rena can be accommodated by the plan.'",
        "'speaker_2': 'So with the plan, with the place type scenario, the there are about approximately 28,000, a little more than 28,000 units that can be accommodated, adding the pipeline, an ADU that brings the the unit count to about 30,000 and that does provide a nearly 4000 unit or 15% buffer, which is going to be important for the city as'",
        "'speaker_2': 'it implements the housing element. So this next table just summarizes the the information that was provided in the previous few slides. So the final results, the site inventory for us are shown here for both the existing zoning and the place tip scenarios.'",
        "'speaker_2': 'You can see the first highlighted row under the current zoning scenario and shows how the zoning is not sufficient that ultimately the place type scenario is insufficient to meet the Rena. The next number of slides are going to provide an overview of the major components of the proposed plan, organized by eight major recurring themes to demonstrate how'",
        "'speaker_2': 'the plan addresses and responds to community feedback and identify priorities and input from the State Housing Department. The first major theme Steph heard was that there's not enough housing available in Long Beach as was demonstrated by the data.'",
        "'speaker_2': 'So this slide shows some of the key strategies of the plan to address this. This issue and a primary strategy is the city wide geographic rezoning program, which will implement value and create more capacity for housing. And the the the plan planning process and the process to update zoning in the Anaheim corridor are some examples of those'",
        "'speaker_2': 'efforts. The next major theme was the need for more affordable housing. This is something that we heard consistently throughout the outreach. The proposed plan includes many policies and programs designed to help address this issue. They're shown here on the slide identifying additional funding sources, local funding sources for affordable housing.'",
        "'speaker_2': 'The Mixed Income US Development Strategy from the Enhanced Density Bonus Ordinance that was recently adopted and the inclusionary housing program are also important strategies, as is preserving existing affordable units. Another theme that was heard consistently throughout the outreach was the need for housing assistance because housing is unaffordable to so many residents in the city.'",
        "'speaker_2': 'Housing assistance is critical for many housing vouchers known as Section eight. Vouchers are in much greater demand than what the city is able to provide. So providing oriented housing vouchers to people with the greatest need and looking for flexible funding pool to provide more vouchers.'",
        "'speaker_2': 'Continuing to provide the emergency rental assistance through the COVID relief and beyond are some of the strategies outlined in the plan. Okay. So the next slide is about moderate income housing, the need for moderate income housing and for there are a number of policies and programs in the presentation or sorry in the plan pardon me that try'",
        "'speaker_2': 'to address this issue of the enhanced density bonus ordinance is among them and it does provide some incentives, particularly for moderate income units. Those incentives are much more attractive to the local density bonus than they are at the state level to encourage moderate income units.'",
        "'speaker_2': 'And the inclusionary requirement has an ownership option for moderate income zoning code updates and implementation of the land use element in some of the lower density zones to encourage more housing types and duplexes. And Triplexes, for example, are also among the strategies for increasing the amount of moderate income housing and facilitating through those efforts as well, and'",
        "'speaker_2': 'looking at new zoning typologies, facilitating naturally occurring affordable housing typologies like the bungalows and courtyard apartments, which are housing types that are commonly found in the city. And home ownership and down payment assistance are among the programs in the plan that are also intended to.'",
        "'speaker_2': 'Generate more moderate income, housing and ownership of moderate income housing. The next slide is related to anti displacement strategies and tenant protections in the plan. This is something that I've heard a great deal about during the planning process, and programs to support this goal include the enhanced no net loss requirements of the local density bonus ordinance that'",
        "'speaker_2': 'was adopted recently, which exceeds the no net loss requirements of the state and development of an ordinance to regulate substantial remodels is something that is also underway to allow the remodels in a manner that does not that minimizes displacement.'",
        "'speaker_2': 'Community members also underscored the importance of eviction protection strategies like tenant right to counsel. The revised draft plan expands the Tenant Rights Council program and reflects the additional resources that were allocated to this program through by the City Council in the 522 budget.'",
        "'speaker_2': 'Another major theme was about community ownership and agency. Residents and housing advocates emphasized the importance of supporting community land trusts and other shared equity models. And the plan includes programs to provide technical assistance to two groups to pursue those kinds of models.'",
        "'speaker_2': 'Another. Some other programs in the plan also are around trying to the first time homebuyer assistance is a focus of the plan as well as trying to create leadership and community capacity building so that people, and particularly in communities of color, can advocate for themselves on important priorities and issues that affect their community, including housing.'",
        "'speaker_2': 'Another theme that we heard a lot about was the need for housing for a special group. And the plan supports many of the ongoing programs and services provided by the Continuum of Care that provide services for people experiencing homelessness or at risk of homelessness, and looking at expanding many hubs such as the Atlantic Farms, Shelter and Services'",
        "'speaker_2': 'that were located in North Long Beach and recently. Other strategies include. More senior housing across the city to provide avenues for older residents to downsize and remain in their neighborhoods. Finally, another theme is that the creating more opportunity for housing in what is called high opportunity or high resource areas, which is a designation made by the state'",
        "'speaker_2': '. Some of the key programs and strategies for increasing access to housing and high opportunity areas are shown on this slide, and it does involve a multi-pronged approach to addressing the issue, which is an issue that is a result of many generations.'",
        "'speaker_2': 'Multi-generational issue that has created segregation in the city. Although there are few sites in the site inventory in the high opportunity areas, even with the UAE place type, the plan does call for supporting finding ways and through zoning, update and zoning and implementation of the QE to support a variety of housing types in low density zones.'",
        "'speaker_2': 'The EDB ordinance, the enhanced NC 20 bonus ordinance will also make mixed income housing viable in more parts of the city, including high resource areas and the accessory dwelling unit production of accessory dwelling units in all areas of the city, including low density residential areas, is another important strategy for creating housing new housing in high resource areas'",
        "'speaker_2': ', as is the C plan, which was adopted recently and created capacity for a significant number of 2500 units of housing in high resource areas. Other. This slide also shows other programs that are intended to increase the amount of housing in those areas.'",
        "'speaker_2': 'So the next few slides are going to try to summarize the feedback, the process that the plan that the city has to go through to get this plan adopted and certified by the state. And some of this summarizes some of the feedback that was received that the revised plan addresses.'",
        "'speaker_2': 'So completed a first review of the housing element and provided comments in September, September 17th of 2021. And the city has updated the plan to reflect those comments. And it is expected that the city will staff will resubmit the updated draft for a second round of review with HPD, and they have 60 days to evaluate the plan'",
        "'speaker_2': '. And if the plan is found to be substantially compliant, staff will then bring the plan back to the City Council for final adoption. If not, then there will have to be for the revisions made the plan the city does.'",
        "'speaker_2': 'The plan does need to be both adopted by the City Council and certified by the State, the Housing Department of the State by no later than February 11th of 2022. In order to avoid being forced to rezone to complete this rezoning program in one year instead of three and other penalties and ramifications for not having a certified'",
        "'speaker_2': 'plan. Okay. So this slide just quickly summarizes the HD feedback and city response. And as you can see, one of the most substantial pieces of feedback from the state related to the city's ability to compliance with affirmatively furthering fair housing and making sure that housing for all income levels and particularly low income levels, is feasible in the'",
        "'speaker_2': 'high resource areas of the city. So on the right is and some of the programs that I described in the previous slides are the ways in which the city has responded to that and try to ensure that there are opportunities for housing throughout.'",
        "'speaker_2': 'And that includes updates to the site inventory and strengthening a number of housing programs and actions and better articulating the things that the city has already done and all of the housing ordinances, for example, that the Council has adopted more recently, other feedback largely has been more technical in nature and requesting additional data and analysis to back'",
        "'speaker_2': 'up the site inventory. Making more firm the commitments of actions of the plan with specific time frames and other sort of data providing other data and technical cleanups and clarifications. This slide basically is just to emphasize what the laws are and and to what our obligations are under state law and related to assessing and promoting fair housing'",
        "'speaker_2': 'in Long Beach and the bottom half. This slide shows the specific feedback again that the city received in terms of compliance on that issue. This provides an overview of the findings of the Fair Housing Assessment, which can be found in Appendix F in the interest of time.'",
        "'speaker_2': 'I won't go into too much detail about this, but essentially the analysis does show that there are there is a need for creating more housing opportunities in high opportunity areas. And the the programs that I outlined previously are the city's response to trying to improve that and address that issue.'",
        "'speaker_2': 'This, again, just summarizes the the ways in which the city has responded. I think I've covered that already. And. These are just examples of ways in which the actions were clarified and more detail was provided in response to some of the feedback from the Housing Department.'",
        "'speaker_2': 'I won't go into detail about this. I explained a little bit about the site inventory. I'm happy to answer any questions that the Council might have on the site inventory. And so with that will conclude the presentation. These are the next the recommendation and next steps.'",
        "'speaker_2': 'We're again, we're looking to have the council just confirm the the plan and the policy direction of the plan. Then the staff will be submitting the plan to HD for a second round of review. Final adoption by City Council prior to certification by the state and then implementation is already under way and will continue to be underway'",
        "'speaker_2': '. And with that, I conclude the presentation and staff is available to answer any questions. And we do have one of our consultants here if there are any questions that she can help answer. Thank you.'",
        "'speaker_0': 'Well, thank you, Steven Dauber, for that very, very detailed report. When you go back to the. The screen here. We have quite a bit of public comment on this particular item. There's no one writing this from the council.'",
        "'speaker_0': 'I'd like to hear from public comment first. Well, 23 speakers signed up. Claire, can you just remind us what our policy is in terms of public speaking?'",
        "'speaker_3': 'First in a three minute.'",
        "'speaker_1': 'If we know that we have over ten speakers, we normally cut it to 90 seconds.'",
        "'speaker_0': 'Each speaker will have 90 seconds. We'll start with and I'll allow the curtain call the names.'",
        "'speaker_1': 'Sure. So I'm going to call the first five speakers, if you could line up at the podium. Rosa, Homes, Magdalena. Per day. Maggie Valenzuela. And I can say, Joseph Lombardi, if those first five speakers can please come to the podium as a reminder, please keep your mask on at all times.'",
        "'speaker_1': 'Vocal said, okay, if I take my mask off. No, please, please keep your mask on. Thank you.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Good evening. Council members. My name is Rose and Holmes.'",
        "'speaker_3': 'And a.'",
        "'speaker_1': 'Part of the Long Beach Coalition.'",
        "'speaker_3': 'I'm a resident in Signal Hill right now, but lived in Long Beach District one for three years.'",
        "'speaker_1': 'I was told.'",
        "'speaker_3': 'I had to leave my last unit.'",
        "'speaker_1': 'Where.'",
        "'speaker_3': 'I was paying 1500.'",
        "'speaker_0': 'Dollars a month.'",
        "'speaker_3': 'Because the building was bought by the new owner and they were going to renovate and I could not stay. I moved to signal a signal. You know, we are now pay $3,000 a month rent. I was 76 years.'",
        "'speaker_1': 'Old.'",
        "'speaker_3': 'And barely making ends meet as a care worker. Most of our family and friends is not here anymore currently and they have two months and have to worry about possibly being evicted and moving again. To top it all off, I was denied rental assistance in Long Beach because I live in Signal Hill and was.'",
        "'speaker_1': 'Told.'",
        "'speaker_3': 'I needed to apply through Los Angeles County.'",
        "'speaker_1': 'So we're.'",
        "'speaker_3': 'Asking, please advise.'",
        "'speaker_1': 'Action.'",
        "'speaker_3': '5 to 2 to adopt a.'",
        "'speaker_1': 'Policy.'",
        "'speaker_3': 'On substantial remodels that early 2022. Instead of waiting until 2023.'",
        "'speaker_1': 'Films, your time is up.'",
        "'speaker_3': 'I'm sorry.'",
        "'speaker_0': 'Thank you. 90 seconds has inspired you to comment.'",
        "'speaker_3': 'I can't hear you.'",
        "'speaker_0': 'The speaker.'",
        "'speaker_3': 'Please.'",
        "'speaker_1': 'All right. Your time is up, ma'am.'",
        "'speaker_3': 'Oh.'",
        "'speaker_1': 'Thank you. Next speaker. Men. I'm not Menominee either. We want listed on why we're putting this collar quality on the lobbyist. We want to know if you feel that your mental illness is part of the parallel. Apartamento nine.'",
        "'speaker_1': 'For me Edificio el Gobierno is another single problem. Upcoming Review of American Mental Health when you've been on the air. But our primary hook at the moment is Costa del Apartamento Formiga. So they own the astrophysical melting capacitor, but I bet they don't care what we mean.'",
        "'speaker_1': 'There is only problem with both of us that are they me in a square left elbow in your mouth with your of as well? Apartamento, but I can put it up. Let me go to my audience. I'm going to put it on but if we're to consider for a the to more for whom we got a leprosy'",
        "'speaker_1': 'like episode code is appropriate. I would mako someone Christopher below for our concern is a lecture on Singapore also but tell a political horror removal of your little Socialist Party principle. The main thing people in the world are solving, they're in distress.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_2': 'Good evening. My name is Michaela PEREIRA, District nine.'",
        "'speaker_1': 'I live in District nine, part of the Long Beach Quality Coalition. I live.'",
        "'speaker_2': 'In a building where.'",
        "'speaker_1': 'I had previously heard a.'",
        "'speaker_2': 'Request to fix a unit due to a new.'",
        "'speaker_1': 'Extension in my building. The landlord did nothing. I have issues with my knee and I take medication for it. Landlord came one day and told me the next day I had to.'",
        "'speaker_2': 'Move all my staff from the unit so they could fumigate.'",
        "'speaker_1': 'They gave me one day notice I am physically incapable of doing my own move. We do my knee problems, my husband works late and my son has called. The landlord advised me if I did not move things around in the unit so they will fumigate.'",
        "'speaker_1': 'They will charge me an amount of 40 or $50, $50. The pressure I have gone through with the landlord has caused me a lot of stress. I ask this advice action 5.2.2 to adopt a policy on substantial remodels by early 2020 instead of waiting until 2020.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_1': 'Good evening, council members. My name is Maggie Valenzuela. I'm the senior organizer for Lane and part of the Long Beach Coalition for Good Jobs and Healthy Community. Housing was already a crisis for our community before the pandemic. I personally have spoken to renters like Shelly Ward, who couldn't be here today because she's been sick due to the'",
        "'speaker_1': 'stress her and her husband are facing because her landlord has recently given her a three day notice, even though she's applied for rental assistance and has paid 25% of her backed up rent to not be evicted. She is one of many members who have talked to us about landlords taking advantage of them because they can't speak the'",
        "'speaker_1': 'language, they don't know their legal rights or have fallen behind on rent because of the pandemic. I urge Council to direct staff to establish additional tenant protections in housing plan program 5.2, including revising action 5.2 to to adopt a policy on substantial remodels by early 2022 instead of 2023, and strengthening the local just cause for eviction ordinance'",
        "'speaker_1': '. Families are being pushed to their financial limit because of enormous housing costs. Long Beach must do better for those who are barely hanging on during these tough economic times. Please incorporate these important policies and programs into the housing element.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Some I can feel. Sixth District resident Thank you staff for that report. I think it did a great effort in showing that, objectively speaking, the city has failed most of its citizens with regard to this housing problem. We simply do not have the supply of units for low income, lower income and even moderate income people.'",
        "'speaker_3': 'And we are pushing the youth and our seniors out of the city. As the staff report showed, African-Americans in the city of Long Beach, eight out of ten of us are renters. In the sixth District where I live, and 19% of the African-American population left.'",
        "'speaker_3': 'And the number one reason for leaving was because of rent. So this is a point of showing that policy is predicated on cleansing, ethnic cleansing with respect to solutions. I think one thing that we can look to, our brother city of Los Angeles is banning the concept of eyevine.'",
        "'speaker_3': 'That is a a concept in which organizations like Zillow and Redfin actively buy houses, and it prevents homeowner first time homeowners from buying houses and they're competing with private equity. Zillow has 365 homes in the city of Los Angeles, city of Long Beach, up for sale, and they're now selling them to private equity companies like Blackstone.'",
        "'speaker_3': 'And we're not allowed to compete with them. That's a problem. And we need to make a solution out of that. Thank you.'",
        "'speaker_0': 'Thank you for your comments.'",
        "'speaker_1': 'That speaker from Speaker Joseph Lombardi. And then following that is Katie DOMA, Melody Ozuna, Joseph Goldblatt and Tatiana Jensen.'",
        "'speaker_3': 'Good evening. I'm here to support Joseph, who's right next to me, Michelle as well. And Sandra, these are folks who are living on City Center Motel and are here in District one to advocate for a strong housing element.'",
        "'speaker_3': 'I can't begin to tell the stories. I really wish the council member who represents the area could talk to them at this meeting. There's just a lot to be said for the units originally now down to nine units.'",
        "'speaker_3': 'They've received eviction notices. City Center wants to tear down to build again something more luxurious. The tenants here are here to advocate for a housing element that's tenant centered, right. That takes into consideration specifics, very specific objectives that could be met.'",
        "'speaker_3': 'We've looked at the document. It's very vague. If we can work on being more specific and more goal oriented in terms of timeline, I think that would bring a lot of hope to people who are having a difficult time finding affordable housing or any kind of housing at the moment.'",
        "'speaker_3': 'So Joseph's going to share a little bit as to what's happening.'",
        "'speaker_0': 'On Joseph Bloomberg Council. Basically, they're telling us to move out of the place without a word or nothing just to come out of nowhere. All these investors came to our property that were and they were surprised we were there, that we were evicted out of there.'",
        "'speaker_0': 'I don't even know that we were there. All these big investors were.'",
        "'speaker_3': 'All going to. And so we've been.'",
        "'speaker_0': 'Fighting them for years to get more time. And we're not. Oh, well.'",
        "'speaker_3': 'I get a few when I talk about you.'",
        "'speaker_0': 'And I haven't had one speaker signed up with that. Joseph Lombardi.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Okay. So unfortunately, we can't allow the entire group to speak, but we thank you for your comments and invite up the next speaker.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Katie Duma. Melodie Ozuna, Joseph Goldblatt, Tatyana Jensen and Liz Vanderwerff. Good evening. My name is Kate, the owner. I think I still live in District two if the lines haven't moved yet. Um, you've seen and read the report.'",
        "'speaker_1': 'You know the statistics. But we are not statistics. We are residents, people voting residents in all of your districts. And we need affordable housing now. We can't wait for 200 for 2023 to eliminate the model exemption. That should be a priority to preserve existing affordable housing.'",
        "'speaker_3': 'As soon as.'",
        "'speaker_1': 'Possible. And I think you have time. Before the current county moratorium expires to revisit protecting all tenants at current risk. Because there is no legal reason preventing you from doing so and making it retroactive. I know you have already decided not to, but there's.'",
        "'speaker_3': 'No legal justification.'",
        "'speaker_1': 'For that. On another issue as.'",
        "'speaker_3': 'Recommended in your.'",
        "'speaker_1': 'Presentation, I hope you will follow it. Even if you don't add additional affordable housing plots to the east side. If you lift the zoning restrictions for multiple family dwellings in those areas and in all areas of the city, at least then private property owners will have the ability to replace single family dwellings or whatever other units on'",
        "'speaker_1': 'their properties with multi-family units. So if.'",
        "'speaker_3': 'Somebody wants to knock down.'",
        "'speaker_1': 'Their mansion and build a 20 unit apartment building.'",
        "'speaker_3': 'They could do so even if you're not going to. So please lift all.'",
        "'speaker_1': 'The zoning restrictions that prevent.'",
        "'speaker_3': 'Multi-Family dwellings in Long Beach.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Good evening. My name is Melody Ozuna. I'm an attorney with the Legal Aid Foundation of Los Angeles. We provide free legal services to low income people throughout L.A. County. We have a community office here in Long Beach where one of our main priorities is housing.'",
        "'speaker_1': 'I'm also a resident of the eighth District. I'm here today to ask for two changes to the housing element the city. First, the city needs to identify more affordable housing sites on the east side of Long Beach. And second, the housing needs stronger.'",
        "'speaker_1': 'The housing element needs stronger anti displacement policies and programs. We are asking for the addition of a rent stabilization order to eliminate substantial remodel as a cause of reason for eviction now and for the city to set up a rental housing division.'",
        "'speaker_1': 'Regarding my first task, the city needs as cites the east side of Long Beach. While the housing element acknowledges the impact of segregation, redlining and that those problems have increased since the 1990s. The city's plan for affordable housing is almost solely focused on the west, central and downtown areas of the city.'",
        "'speaker_1': 'Well, almost completely ignoring the east side of Long Beach, which identifies as high opportunity areas. The additional 25 sites are not enough by placing site inventories, mostly on the west, central and downtown areas. The city argues to estimate that mercury housing into those areas will increase opportunities and resources to the areas that does not address segregation, nor'",
        "'speaker_1': 'does it affirmatively further fair housing. Thank you. We submitted a letter today for your review. Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Speaker Priest.'",
        "'speaker_1': 'Hello. My name is Tatiana Jensen, and I'm here. I'm a pile driver and a member of the Southwest Regional Council of Carpenters. I live in the local area and grew up local to Long Beach. I work and create in the vicinity of the project.'",
        "'speaker_1': 'I believe that I could be impacted and me and my brothers and sisters would be impacted by the environmental impacts of the project. The city should require the project to be built utilizing a local and skilled and trained workforce so we can be, with our families, help out in our community, and stay local to the place that'",
        "'speaker_1': 'we love. Thank you.'",
        "'speaker_3': 'Good evening. My name is Joseph Goldblatt. I am a member of the Southwest Regional Council of Carpenters. I live and work in the vicinity of the project as well, and I believe that it will impact by the environmental impacts of the project.'",
        "'speaker_3': 'The city should require the project to be built utilizing a local and skilled and trained workforce. Thank you.'",
        "'speaker_0': 'If you don't.'",
        "'speaker_1': 'Hello. My name is Liz Vanderwerff. I'm a finished worker and a member of the Southwest Regional Council of Carpenters. I do live local in Long Beach. I don't often get to work here. Actually, I've never gotten to work here, but I spend all the rest of my time here and I believe that I will be impacted by'",
        "'speaker_1': 'the environmental impacts of the project. The city should require the product to be built utilizing a local, unskilled and trained workforce. It would be amazing to be able to work and create in the city that I spend all the rest of my time in.'",
        "'speaker_1': 'So thank you. Next speakers are. Francisco McCullough. Rafael Pimentel. Ray Lawson. Jorge Quintero. Jenna Lim. Those speakers can please come forward. Francisco.'",
        "'speaker_0': 'I just want to make be clear that we're talking about the housing element, correct? Okay. I'm not not aware of specific project. My name is Rafael Patel and I'm with the Southwest Regional Council of Carpenters. And wouldn't that be a great thing.'",
        "'speaker_3': 'That all these housing projects that we're discussing tonight, that they would be built by a skilled and trained workforce, local residents here, that only.'",
        "'speaker_0': 'That are going to be able to build these projects, but they'll be the ones to build the projects that are going to live in these housing.'",
        "'speaker_3': 'Developments. Would that be awesome to have that? So we're asking the city council today that in considering any further projects that will be built under this plan, that you would.'",
        "'speaker_0': 'Please consider building it and.'",
        "'speaker_3': 'Implementing it into your policy to employ a skilled and trained and local workforce here in the.'",
        "'speaker_0': 'City of Long Beach. Thanks for your time.'",
        "'speaker_3': 'You. Good evening, city council members. Once again, my name is very Lawson. Good to see you. Good to be back from our recovery. We have over 50,000 members in six states, and we have several hundred of our members that live and work right here in the city of Long Beach.'",
        "'speaker_3': 'As you can see, our brothers and sisters showed up tonight to speak on the general plan. We believe live here, work here in Long Beach. If the plan goes forward with the zoning element in the housing element, we want it to go on record that we want a skilled and trained workforce skills and training work for the'",
        "'speaker_3': 'people that live here. And working in Long Beach can be with their families. They can coach soccer, football, the doctors that are in cheerleading. And it's also the environmental impact of having them work here. There's less gas, there's less transportation.'",
        "'speaker_3': 'It helps when it comes to environmental impact. So we would just like to consider that when they do the the general plan, the zoning part of it, they can that language be added to the general plan forthcoming? That's what we're here for and that's what we're asking for.'",
        "'speaker_3': 'So thank you for your time, city council.'",
        "'speaker_0': 'Thank you for your comments.'",
        "'speaker_3': 'Let's take a move. Good afternoon, city council. My name is Water Control. I'm also with the Carpenters Union Local 562 here in Long Beach. And my partner here took a lot of my talking points, so I won't repeat all of them.'",
        "'speaker_3': 'But again, local hire. A lot of these members you know outside of a part of the. Of a letter that I have here looking at just closed possession general areas can have significant impact in about your environmental benefits.'",
        "'speaker_3': 'The California Planning Roundtable noted back in 2018, people who live and work in the same jurisdiction will be most likely to transit, walk or bicycle to work so than the residents and business communities and their vehicle trips will be shorter.'",
        "'speaker_3': 'So again, we just ask that you consider implementing skilled work, trade or skill and training workforce and. Take us some, I think, very much.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Janice O'Quinn of Rub Alaska, Aurelia Ortega, Elsa tung, Daniel Lim, Marlena Sanchez, please line up. Good evening. My name is Jenna. I am a resident of District six and I go to Wilson High School. Growing up, it was a lot of instability, constantly moving houses and jobs and schools and new friends.'",
        "'speaker_1': 'When I moved to Long Beach in the middle of eighth grade, it was because our last house overcrowded and my dad had found a job here. During my freshman year, the pandemic hit. My dad was laid off and I had to apply for unemployment as a result.'",
        "'speaker_1': 'My house also like was always on the brink of exploding. My parents were arguing over paying bills and rent and that we were in afraid. If we could, we would have to move out. And I will have to finish.'",
        "'speaker_1': 'I won't be able to finish high school here in Long Beach. The stress and wearing on top of school made it hard for me to focus. I lost interest and interest in things I used to love. My dad was getting offers for jobs, but the offers never offered enough to pay rent.'",
        "'speaker_1': 'This pushed my dad to look for jobs elsewhere. And he now works and lives in Texas to provide for my family here in Long Beach. Our family shouldn't be separated because rent is too high. I shouldn't have to fail or fall behind the school either.'",
        "'speaker_1': 'But this is a real price we pay when housing is not affordable. I know my son is not the only one who pays a high, high price to survive in Long Beach. Six out of out of every ten black x renters are rent burdened, and they pay more than 30% of their income on rent.'",
        "'speaker_1': 'For me and many people here tonight, being part of a local organization is a lifeline to getting a resources that help us to survive and thrive. My my hope is that one of the city will know where to go when they when they are in a crisis about where to live.'",
        "'speaker_1': 'Knowing our rights as renters can also protect during these challenging times. Thank you for your time, you. Thank you. That's when I started. All the numbers are what I don't figure you'll be born in the street or say good evening.'",
        "'speaker_3': 'My name is How did get and I live in District six.'",
        "'speaker_1': 'And they're calling on November zero to receive you. So me and brother group law launch.'",
        "'speaker_3': 'So I live in zip code 90 813 and I belong to the group and.'",
        "'speaker_1': 'Estonia keeper of the year 11. I don't know or belong to the civilization, the la Renta commune. Police are in a plan.'",
        "'speaker_3': 'So I'm here to ask you to promote in order to stabilize rent as part of the plan.'",
        "'speaker_1': 'That we we end up a needed. But we needed all this. The sorrow had been so imperative of the BBN that.'",
        "'speaker_3': 'In order to prevent evictions and the loss of homes.'",
        "'speaker_1': 'From being destroyed, property so established the proposition, the inclusion of these two narratives and programs they planned to be behind the scenes close to you.'",
        "'speaker_3': 'So I'm also here asking you to do more. Protections for tenants can be applied for the 5.2 part of the plan.'",
        "'speaker_1': 'No matter what we see on the allocations in community laws. But I will start on the ordinance to remove the rational system pillars. But.'",
        "'speaker_3': 'And also to take care of the point have to in order to prevent the remodeling part of the order.'",
        "'speaker_1': 'Who said there was a little mill based? It imposes on me very distressed.'",
        "'speaker_3': 'For them to take place in Tucson in 2022 instead of 2023.'",
        "'speaker_1': 'Numeral laws for Palisade Road. In answer, the ABC honors the the gosa holster.'",
        "'speaker_3': 'And then also to strengthen the a cost to the the fair eviction cost or order.'",
        "'speaker_1': 'Based on which other the grasses and.'",
        "'speaker_3': 'That is all thank you very much.'",
        "'speaker_1': 'When I survey several Belasco.'",
        "'speaker_3': 'Without knowing my or even my name is out of Alaska.'",
        "'speaker_1': 'Maybe only three to say I.'",
        "'speaker_3': 'Am from Detroit six.'",
        "'speaker_1': 'And recording a bottle in the window to preface.'",
        "'speaker_3': 'My coat. My zip code is 90 813 Siamese Resistance.'",
        "'speaker_1': 'The other is the lounge.'",
        "'speaker_3': 'And I am also part of the members of the resistance of lounge.'",
        "'speaker_1': 'And style. Keep up by the 11 hour bonanza this public session.'",
        "'speaker_3': 'And I'm here to ask you to elevate and order an ordinance for stabilization.'",
        "'speaker_1': 'The renter. Come on up, Alicia and Planetary. We end up. We need a little friend of mine.'",
        "'speaker_3': 'For that to be part of the plan in order to prevent evictions. Yeah. I mean.'",
        "'speaker_1': 'EPA there are between the solar hope and the Permian historically, but a barrier is established. Protection there in cleanliness.'",
        "'speaker_3': 'And also, I'm asking you here for the eviction protection to be established. And part of the plan is program.'",
        "'speaker_1': 'And they will be in the single year.'",
        "'speaker_3': 'And that would be part of the plan. 5.2.'",
        "'speaker_1': 'That includes a provisional election, single of one. But are that there or no ordinance?'",
        "'speaker_3': 'And then to have an action in order to review 5.2 true in order to adopt an ordinance.'",
        "'speaker_1': 'The Roman election so centavo but I mean when you go.'",
        "'speaker_3': 'To a for the substantive or substantial remodeling for the year 22 to remove the instead of 23.'",
        "'speaker_1': 'Yeah. It at a number of those watermen sailors the answer the it was going to the council.'",
        "'speaker_3': 'And also to make a stronger ordinance regarding provisions.'",
        "'speaker_1': 'Which are aggressive.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Excuse me.'",
        "'speaker_1': 'Good evening, city council. My name is Elsa Tongue Language Forward and a District seven resident. First, I want to thank so much staff for your tremendous work on this extremely complex document. At least seven, at least 11. CBOs have been engaging low income renters of color.'",
        "'speaker_1': 'The majority of this city on this extremely complex housing element and some that we urge city council to direct the staff to implement four specific improvements. Number one, as you've already heard, elevate a rent stabilization ordinance as a specific policy or program in the Chapter six housing plan with specific actions, objectives and timeframes.'",
        "'speaker_1': 'Number two, establish additional tenant protections in housing plan program 5.2, including 5.2.2 on substantial remodels for 2022. Number three, I'll spend more time on this identifying more housing sites, especially affordable housing sites in high resource areas, especially East Long Beach.'",
        "'speaker_1': 'Look, we need to dismantle the legacies of redlining and segregation from more than 80 years ago. 67% of all of the identified housing sites in the inventory are located in high segregation, slash poverty, low resource or moderate resource areas.'",
        "'speaker_1': 'In fact, more housing sites have been identified in the highest poverty neighborhoods than the highest resourced neighborhoods. Housing. Justice now.'",
        "'speaker_3': 'My name is Daniel Loo and I'm giving public comment on behalf of Cambodia countries and United Cambodian community. Thank you for having a portion of the agenda on Native American Heritage Month. However, there is more we can do to ground equity in the EU plan.'",
        "'speaker_3': 'Land is housing and home to our native community, so we need to move beyond land acknowledgment towards land reclamation and reconciliation. Housing is not just a resource, it's a living manifestation that affects everyone's overall life. Because of high rent increases and covert COVID exacerbation of existing inequities, our combined community and broader black indigenous and policy community is'",
        "'speaker_3': 'dealing with overcrowding, with multiple generations living in one home, making it difficult environment to learn and concentrate, especially during COVID virtual classrooms. I teach ethnic studies to high school students at UAB and I witnessed what they go through.'",
        "'speaker_3': 'Being in the kitchen or parking lot or wherever, you know, it just breaks my heart that this is the reality that we live. On top of that, COVID spread quick. When one of our family members get sick. When the dad.'",
        "'speaker_3': 'If the dad were to get sick, everyone gets sick. So there's no space to quarantine. This is our reality. We don't only need equitable housing protections now, but we also need homeownership pathways. Because only 25% of my folks own housing similar to our black community.'",
        "'speaker_3': 'We need more home ownership in the broader black, indigenous and poor communities. Thank you. Thank you.'",
        "'speaker_1': 'Next speaker is Marlena Sanchez and then Elizabeth Linder and Jordan. When. Hi. My name's Alexis. As an additional six. For the past seven years, I've been leading my community with my girls in action and my 20 years of being alive.'",
        "'speaker_1': 'I'm a 13 times. Sometimes you meet every other year. Every few months. It looks like you're always running from increasing rent payments and choosing to rent the way things are going. We can afford vacation or take a simple break to take care of our personal health and well-being.'",
        "'speaker_1': 'Growing up with your parents could be homework if they were comfortable working at least 2 to 3 jobs at a time. My sisters and I had to grow up faster and taking adult responsibilities just so that our family could continue to live in a city that an immigrant refugee families call home.'",
        "'speaker_1': 'Living in the city that I worked so hard to improve comes with a lot of sacrifices. Instead of spending less time with our loved ones, the time we do spend at home are always stressed. I was. It was so hard for me to focus on homework and school every other, fall behind the class and take a break'",
        "'speaker_1': 'from or instead of taking a break during the summer, I was trying to make my Grade Saybrook graduate and was 17. I saw my after school hours after working as a certified nursing assistant to help pay for rent.'",
        "'speaker_1': 'Like many working families, the pandemic took a toll on my whole family. We lost our jobs and could not work again. We had to scramble to survive and find a source of income like me and my little sister to focus on school so leaders like myself deserve to have a home in this city.'",
        "'speaker_1': 'We worked so hard to improve. We deserve to experience all the great things. But for me to meet leaders like you to make sure that we have affordable housing without getting displaced. Thank you.'",
        "'speaker_2': 'Hi. Elizabeth cannot be here.'",
        "'speaker_1': 'She's feeling sick, so I'm taking her spot. Good evening, everyone. My name is Gary Hernandez. I'm the executive director for the Long Beach Immigrant Rights Coalition. And I'm here today because the housing element plan will solve all of the issues impacting our communities right now.'",
        "'speaker_2': 'But because you need to hear and make changes to this plan in order to begin to.'",
        "'speaker_1': 'Address what is pressing for poor renters of color here in Long Beach. That will be see. We listen to countless stories from immigrant families, the work that we work with, about struggles, about the struggles they face due to an affordable housing.'",
        "'speaker_1': 'The Long Beach.'",
        "'speaker_2': 'People that have lived here for more than 20 years.'",
        "'speaker_1': 'Are dealing with landlords that are increasing rents despite a global pandemic. And they're also harassing and intimidating these families.'",
        "'speaker_2': 'Tenants have very limited.'",
        "'speaker_1': 'Resources to turn to and are ultimately being pushed out of Long Beach because they can no longer afford to live here, a city that they helped build. This is not a surprise that the city's own maps show that the legacy of racial redlining and housing segregation still exists in the city, with white folks concentrated in the East'",
        "'speaker_1': 'Long Beach area and poor people of color concentrated in central West and North Beach. This housing element is not for for fair housing and in fact reinforces historical redlining, segregation and racial concentrations of poverty. Long Beach. In order to keep our communities here and prevent more mass displacement, Long Beach renters need a local control rent stabilization ordinance'",
        "'speaker_1': 'that goes above and beyond state law. It is doable. Thank you so much. And other neighbors, other neighboring cities have done it. Santa Ana has done it. We can do it here, too.'",
        "'speaker_3': 'Hello. My name is Jordan Winn. I am a member of the Second District. You've heard so many amazing quotes tonight from folks around my community who just want to continue living in the city that they love from a community that has raised so many amazing, intersecting communities.'",
        "'speaker_3': 'We want to make sure that people have a safe place to live. When I think about the housing unit, the housing element today, I think about the vacant units that exist throughout the city that are deemed unaffordable just because of the priority of the priorities of the city has set so far.'",
        "'speaker_3': 'And the fact that we have not been building or putting into the priorities of the minds of the people in this city, the affordable housing that we need to have on the ground. I think about how in the current housing element, many of the places that are zoned or want to be zoned for affordable or re adapted'",
        "'speaker_3': 'to be affordable are in north, central and west Long Beach. And then I think about the vacant Kmart on the east side that is so much empty space for affordable units. I think about so many of these new places that we should be thinking about on the east side to adapt housing and the fact that we need'",
        "'speaker_3': 'to think outside of the boxes of old and segregated housing policies and expand our minds. There. I'm sorry.'",
        "'speaker_0': 'They don't do a proper comment on the whole thing. No.'",
        "'speaker_3': 'I think somebody has the open mic on the phone apology.'",
        "'speaker_0': 'We'll give you a few extra.'",
        "'speaker_3': 'Okay. Thank you. Sorry, ma'am. I doing something wrong. The basic point is we have over 2000 people experiencing homelessness in the city right now. We have over 60,000 people paying 90% or more of their income to rent. And that has only been exacerbated because of the pandemic.'",
        "'speaker_3': 'We sit at a very critical point. The policy that we make tonight informs the next eight, ten years, of course, in our immediate span, but also decades into the future of how housing is going to be developed in our community.'",
        "'speaker_3': 'We need to make sure that we are prioritizing renters, low income renters and communities of color so that we preserve the culture and the beauty of Long Beach for years to come. Thank you so much.'",
        "'speaker_1': 'That concludes public comment for this item.'",
        "'speaker_0': 'Great. So I'll take it back to under the rail. We have the most moving of the motion of Councilmember Sorrell, seconded by Councilwoman Allen. I'll turn it over to Councilman Massaro.'",
        "'speaker_1': 'Thank you, Councilmember Austin. And thank you to.'",
        "'speaker_2': 'All those who who provided.'",
        "'speaker_1': 'Their public comment and had helped do outreach and assistance on our housing element plan. So thank you to staff for all your hard work on the Element Plan, especially doing the public education and outreach in the midst of the pandemic.'",
        "'speaker_1': 'So I just appreciate all that's been done in response to the pandemic as well. When we had housing concerns around rental assistance, providing the legal counsel for tenants to conversion of motels to temporary housing, as well as providing permanent supportive housing, as well as also just all the recent work around the ordinance that was adopted that, you'",
        "'speaker_1': 'know, goes back to these providing these pilot program to allow the 5500 medical units in downtown inclusionary housing policy, enhanced density bonus ordinance. As was mentioned earlier, I just wanted to just kind of go back to how much work has been done in the midst of the pandemic, and then also what we're continuing to do to make'",
        "'speaker_1': 'sure we're addressing this housing crisis as well as our effort to do rezoning. And I'm looking forward to the ACES, that process that we'll be doing in the midtown area. And so have also been proud to have have done a grand opening of a 95 unit, affordable housing at Spark at Midtown, as well as doing a more'",
        "'speaker_1': 'recent groundbreaking of bridge housing for 88 units. And there's plan for another groundbreaking for affordable housing in central Long Beach early next year. And I share this because there is a higher number of affordable housing sites that are have been identified and and more identified.'",
        "'speaker_1': 'But I'm really interested in looking at the inventory of how many housing sites are identified. I do get a sense that 67% or have been located kind of in the general west central north area. But could you share the inventory, a breakdown based on region?'",
        "'speaker_1': 'Because I can see from the mapping that there are certainly more in certain parts of our city than others.'",
        "'speaker_2': 'Good evening, council members. Thank you for your question. So just some information to share about the site inventory and how housing the site inventory is. The sites are distributed among different areas. It's notable that the the site inventory locates 9% of lower income units in the more concentrated areas of poverty, compared to 23% moderate income units and'",
        "'speaker_2': '13% above moderate. So the point that I'm trying to make here is that with the distribution of the housing units on the site inventory, there's actually a greater portion of those units in the moderate income and market rate and that levels of affordability that are in those concentrated areas of poverty.'",
        "'speaker_2': 'So the site inventory sites actually do begin to change the that distribution.'",
        "'speaker_1': 'Thank you for that information. But it's still concerning to me the higher debt amount of density will.'",
        "'speaker_2': 'Be increasing over.'",
        "'speaker_1': 'The span of the element of this plan. And I'm really concerned because we've.'",
        "'speaker_2': 'Already been having increasing issue with.'",
        "'speaker_1': 'Parking, increasing issue with just ensuring there's open available space. So what I would want to understand is how do we how can we go back to the fair housing process, right? How do we I know that the loo has been a and an element of challenge, but I want to know how can we continue to work at'",
        "'speaker_1': 'this so that there are housing sites identified evenly spaced out because there's so much density we can put over the next eight, ten years in the region that has already high density.'",
        "'speaker_2': 'Right. So just to provide a little bit more information on the of the units in the site inventory, 5% are in the highest resource area and nearly 10% are in the high resource area. 35, almost more than 35% are in the moderate resource areas.'",
        "'speaker_2': 'And that leaves the remaining what percentages that about 40, 40% in the in the lower resource area in total. So I think to answer your question further, there are a number of programs in the in the plan that are aimed at addressing the issue.'",
        "'speaker_2': 'For example, program 6.9 has a requirement to monitor housing production in particular. The program specifies that monitoring housing at about the mid term of the cycle, as the staff in the city would monitor housing production to determine if the geographic distribution of units is furthering of the goal of distributed distributing across the different geographies of the city'",
        "'speaker_2': ', especially the lower income units. And if it's not, there's a trigger in the plan to look at additional strategies to employ. And that could could involve, you know, looking at the the land use element again and identifying additional areas in the city that could be could accommodate multi-family housing.'",
        "'speaker_2': 'I know. My time's up, so I'll call you again.'",
        "'speaker_1': 'But I just wanted to clarify to make sure I got my math correct.'",
        "'speaker_2': 'So you said 5%.'",
        "'speaker_1': 'In the higher resource area, 35% moderate, 40% lower, and then I'm missing 20%.'",
        "'speaker_2': 'Where is that one go? There are there's about 15% among the two. There's sort of six gradations on that math indicate is that six or seven. So among the highest and high resource areas, there's 15% total. In the moderate resource areas, there's a little more than 35%.'",
        "'speaker_2': 'So the remainder is in the low resource or high segregation and poverty area.'",
        "'speaker_1': 'Thank you. I'll call you up again.'",
        "'speaker_0': 'Thank you. Next speaker. Councilmember Owen.'",
        "'speaker_1': 'Yes. Thank you so much for that. I want to say thank you as well by recognizing Patricia and Allison four and everyone of development services for all the hard work that they've done on this item and all they've done with regards to housing assistance.'",
        "'speaker_1': 'I also want to thank all the housing advocate and organizations, even the Southwest Regional Carpenters came out tonight. So I appreciate seeing you guys here. And and I do agree, when we don't have a project right now, we're talking about when one does come up, I stand with you.'",
        "'speaker_1': 'We need skilled and trained people. But but one of the things that I want to say to all these advocates, that housing has been a crisis even before the pandemic. So I agree with all of your signed hold em up housing justice now.'",
        "'speaker_1': 'I said many times that housing is one of my top priorities and I will continue to speak in favor of policies and ideas that create a more equitable housing climate here in Long Beach. On page 21, you had a comment from someone on your presentation.'",
        "'speaker_1': 'I don't know if you just want to pull that out, but I can tell you every resident feels the same way. I mean, they are really concerned about where they're going to live. And we need to strengthen our affordable housing opportunities in the city, and we have to make sure that we protect our vulnerable populations.'",
        "'speaker_1': 'I mean, everyone, everyone, everyone in this city should be able to afford to live in this city. I think that staff has done a great job on this item. The revised housing element incorporates changes from the community feedback and feedback from the state authorities.'",
        "'speaker_1': 'I do also really appreciate the efforts to identify more housing opportunities. But I continue to believe we need to do more to increase the number of housing sites, even on the east side. Also appreciated the inclusion of more dad points and the efforts to strengthen our existing programs.'",
        "'speaker_1': 'The revised A housing element improves our housing climate, and I will absolutely be supporting this. The current housing draft element says to adopt a code amendment substantial remodel by 2023. I know one of the first things I did when I got elected and started working on this substantial remodel ordinance, and I appreciate my colleagues that have signed'",
        "'speaker_1': 'on to this, and I think it's important that this happen sooner than later. And I specifically like you to address can we move this up to 2022 instead of 2023?'",
        "'speaker_3': 'Okay. The council member would be glad to take any direction that the full council wants to provide. I do want to just clarify some of the dates and reasonings behind the date. So that item is scheduled for consideration by this council in a couple of weeks on December six.'",
        "'speaker_3': 'I try to always be optimistic. I think we have a good presentation for the Council and hope that you'll find consensus right there on the first try. At the same time, that doesn't always occur. I know on the short term rentals ordinance we came and thought we had direction and then came three more times for different first'",
        "'speaker_3': 'readings and it took about a year to get a final ordinance in that case. So anything we put in the housing element and we put a date there, we have to meet that date or we're subject to a litigation exposure from the state.'",
        "'speaker_3': 'So that's why the more outward date is in the document. If we want to put a certain a date, we can put a certain date. But I just need to disclose to the council that if we don't if we don't meet that day, we'll be the subject of being almost immediately out of compliance, which is not where'",
        "'speaker_3': 'we want to be.'",
        "'speaker_1': 'If I understand and you know, my major concern is that with that 2023 timeline, it may create space for folks to be evicted under the existing Jessica's Law. So thank you very much.'",
        "'speaker_0': 'Thank you. Councilmember Price.'",
        "'speaker_1': 'Thank you, Councilman Austin. So thank you staff.'",
        "'speaker_2': 'For the presentation. I really.'",
        "'speaker_1': 'Appreciate it. The way this process now we're we're going to present our recommendations to the state and engage in additional discussions. The second review, how on time how urgent is it that it be done within a certain period of time?'",
        "'speaker_1': 'Are we under any sort of time crunch right now?'",
        "'speaker_2': 'Thank you, Councilwoman. Yes, we're very much under a time crunch, given that February 11th, 2020 to date, by which we both have to achieve adoption by the city council and certification by the state, that we have to submit the plan to them immediately.'",
        "'speaker_2': 'Essentially, it was released to the public. The fact this second draft was released Friday, November 5th. Um, two weeks from that time is when we need to submit it to the state. The state does like the public to have had a couple of weeks to review the draft before the city submits it, but that is the timeline'",
        "'speaker_2': 'that we have to basically submit it right away. They have 60 days by state law to provide their next kind of round of feedback, and that already takes us into December, January, you know, mid-January potentially. So that's where our time crunch comes in.'",
        "'speaker_1': 'And we will have as a council another opportunity, of course, before final adoption will be able to take public input.'",
        "'speaker_0': 'All of that.'",
        "'speaker_3': 'You you you do. But there's a reason we're here tonight. You know, I think we did something similar with the land use element. If there are red flags or major changes that any member of the council wants to see, we need to know that now we can't be making those changes, you know, on the on the final'",
        "'speaker_3': 'day. When we come back for the final adoption, we can always do, you know, tweaks or language changes or whatever the pleasure of the council is. But tonight's proceedings are important because if we need to do a major change, which we don't think is warranted and we think we're in the right direction, but we're here for your'",
        "'speaker_3': 'confirmation and we would need direction tonight if there was more substantial change that any member wanted to see.'",
        "'speaker_1': 'I understand. I do want to thank staff your I thought your presentation was very thorough and I do appreciate the fact that you included what our arena goals are or the expectations are the reality that we're probably not going to meet those expectations.'",
        "'speaker_1': 'My understanding is that many cities are not going to meet that expectation and some aren't even working towards trying to meet that expectation. But that's neither here nor there. Language is working towards that. And and I appreciate that you included in there that as part of the east southeast area specific plan, we've added 2500 additional housing opportunities'",
        "'speaker_1': ', which it's been decades since we've identified additional housing, especially at that level. And I'll just speak for the third district. I'm not going to speak for the whole East Side, but that's said to have 20% of our arena requirement the in one district.'",
        "'speaker_1': 'I want to say that I'm super proud of that because we worked really hard as part of the C CEP working with residents to try to get the buy in and the support for that. That's going to bring a lot of density to that PCH corridor.'",
        "'speaker_1': 'But I think the residents in the district have been along with the journey on the need for additional housing and are supportive of that. I do have a question we've talked a lot about I've heard a lot of public comment about we should put more affordable housing in this area versus that area.'",
        "'speaker_1': 'My question to you is, how are those decisions made? Are those arbitrary decisions that are made by staff regarding what districts they want to encumber with additional housing type of housing? Or are there some formulas or best practices that are used?'",
        "'speaker_3': 'So the as you know, the city does not build individual housing projects. We provide the underlying rules of the road, the zoning code, and we have very limited federal funds and some other funds that come out of the prior redevelopment area that we award into affordable housing development.'",
        "'speaker_3': 'It's really not driven by the city, it's driven by the state through a committee called Tick-Tock. And what TAC does is they award the low income housing tax credit and the low income housing tax credit. There may be 12 different funding sources in an affordable project, but that is the largest funding source and it has specific criteria'",
        "'speaker_3': '. It needs to be close to a backstop. It needs to be close to a grocery store with all of these different criteria. And those criteria have changed and evolved over time. So while there was a prior focus very much on transit and we do have transit in the city, but it's not necessarily in a so called high'",
        "'speaker_3': 'opportunity area. The focus from the state. Awarding those tax credits was previously really focused on transit accessibility. Now there's a little bit less emphasis on that, and there is some new emphasis on other factors, including, you know, those higher opportunity areas.'",
        "'speaker_3': 'But that's a change that's happening now that you won't see on the ground for several years, because from the time that someone has an idea, I'm going to build an affordable housing project to the time they see shovels in the ground.'",
        "'speaker_3': 'It's about a five year period of time. So these changes in policy are very impactful. But you see that impact, you know, time wise much further into the future. And then the other thing is cost. So land cost is a factor.'",
        "'speaker_3': 'And where land costs are too high, you're typically not able to do affordable simply because the money behind affordable is competitive. So if your cost per unit is higher than a competing project, the competing project with a lower cost per unit in terms of development cost is going to prevail in terms of being able to secure competitive'",
        "'speaker_3': 'financing.'",
        "'speaker_1': 'And come and I have an additional question. I will note his answer took a long time, but it was very good. So I'm going to queue back up because I do have an additional question.'",
        "'speaker_0': 'Thank you, Councilmember Mongo.'",
        "'speaker_1': 'Thank you. I want to thank all the speakers for coming out tonight. I know that affordable housing and housing as a whole is something that we all talk about a lot. I do want to kind of talk through a couple of comments that were made by the public tonight and some potential thoughts or solutions.'",
        "'speaker_1': 'When we talk about any particular property, some of these properties are owned by individuals who. Aren't interested in owning housing and or it's in a family trust that has. Significant, significant conflict within the family of how to move an asset and things like that.'",
        "'speaker_1': 'So know that as a council we're often approached by individuals who say. Stacy, you need to help this property become housing. I don't own the property. I can talk with the owners. I can encourage. We can reach out to.'",
        "'speaker_1': 'Sometimes they won't call us back. Sometimes they're not interested. Sometimes that's not what their family plan or portfolio is. And so there's a lot of opportunity in our city that won't be realized potentially because of the people who own them and their perception of the highest and best use of that property.'",
        "'speaker_1': 'So that's where incentives come in. Right. So we as a council work with the state and other organizations to figure out what are the incentives that we can put in place to encourage people to potentially change their investment model or to potentially consider selling or any of those other options.'",
        "'speaker_1': 'And when I sit down with individuals who are looking at I'm 80 youth, 80 years are really the main driver of additional housing on my side of town right now. And those ideas have come with considerable conflict from neighbors.'",
        "'speaker_1': 'There's a neighbor who believes in it and a neighbor who wants to put it in, and they invest the 20 to $25000 in permit fees and then they get a contractor who bids the project at. I was just talking to a neighbor $100,000 to put in a adu and that investment of $125,000 is met with to two'",
        "'speaker_1': 'different things. One, neighbors that live adjacent to them that are very angry. And so we need to do a better job, not only as a council, but as a community working with you to really share the bright side of those types of developments, to really change the tone and the discussion both online and in our neighborhoods and'",
        "'speaker_1': 'our community meetings so that there isn't a stigma attached to that. And then furthermore, these projects I have people I know who have been trying to get an 80 you and are still in the process and won't be completed for 2 to 3 years.'",
        "'speaker_1': 'And a lot of that holdup is amazing. People like yourselves that are in labor. There's so much demand right now that contractors are pushing back and saying, we can't start your project till May of 2022. And these are individuals who have been in the permit process for six months at the city side.'",
        "'speaker_1': 'And so what we need to come together on is what we can do to create more hours of work if you're interested, or how that works, because there's only so many people that are qualified labor and whether it's.'",
        "'speaker_1': 'The carpenters or plumbers or a steel worker. I mean, every single different trade. There has to be a way where we can work better together to provide those hours to the people in the community. Because the other side of it, too, is there's not really an incentive right now for your private general contractor to use anyone but'",
        "'speaker_1': 'the same 25 people they always use. And we need to find that incentive because if a project is held up at framing, all these other workers aren't getting that work and you're not getting that work because they've always used this one framer who has six other jobs.'",
        "'speaker_1': 'And so then both the housing isn't built and you're not getting those hours of availability. And so one of the things that that I would love to do is work with in our Economic Development Committee, we have some tools that we've used for our labor partners in the medical field that we think maybe might be a solution'",
        "'speaker_1': '. So all agenda, all of that and find out if we can work together better. And Ray, I know I can reach out to you. I have your number and we can kind of talk through what those solutions could be.'",
        "'speaker_1': 'But you're a big part of that solution. Even if we want the housing, people are taking two years to get the housing that they can afford, much less the incentive side to make it so it's less than $125,000 for a studio.'",
        "'speaker_1': 'And then how do you make that affordable if it's on a property that already has significant tax base and other costs associated for someone to cover their cost? It's going to be 1700 a month. For a studio and 1700 a month is not market.'",
        "'speaker_1': 'Already. So how do we how do we find that middle ground? So. Those are the rest of my comments. But thank you all for being here. We want to be a part of that solution, but the market really has to be a part of it.'",
        "'speaker_1': 'Until we figure out the incentives that balance that market demand. Thank you.'",
        "'speaker_0': 'Thank you. We'll go back to Councilmember Sara.'",
        "'speaker_1': 'Thank you, Councilmember Austin. So I do want to circle back to the conversation or at least the questions I've been asking. I do agree, though, that we do need local labor to build locally on that part. I want to make sure make that statement before I forget.'",
        "'speaker_1': 'As so I wanted to clarify. When we talk about housing available site, we're not just talking about I want to make sure we get clarity. It's not just affordable housing, it's just housing stock, right?'",
        "'speaker_3': 'That's correct. So we're talking about different levels of housing, whether it's very low, low, moderate or above moderate. And 50% of the units are above moderate or what you would call market rate. And there's housing sites throughout the entire city.'",
        "'speaker_3': 'I know there's been a lot of discussion about how they're distributed, but they are distributed around the entire city, including opportunities to have moderate and higher income housing and some areas that maybe haven't seen that investment, as well as the opportunity to have some of that more affordable housing and in those more expensive areas.'",
        "'speaker_3': 'So it's it's not perfectly balanced because we don't start from scratch. The city is not a blank slate, right? So we started from existing conditions and the existing constraints and the land use element. But this plan does, you know, further our fair housing goals more than, you know, any other prior endeavor by the city.'",
        "'speaker_3': 'And we think, you know, it's satisfies the requirements of the law. But to answer your question from earlier, you know, sort of that work is is never fully done. So while now is not the moment to, you know, revisit past decisions or we think make wholesale changes to this plan, that's not to say the council doesn't continue'",
        "'speaker_3': 'having an ongoing role based on annual reports, based on after the land use element has existed for five years. That'll be an important step and it's built into that plan to revisit some of those assumptions. And that and stops here would be the more appropriate time to advance, you know, some of this discussion about reconsidering some of'",
        "'speaker_3': 'those sites in a particular part of town.'",
        "'speaker_1': 'Yeah, and I appreciate that. The opportunity to monitor annually just the production and that's kind of why I want to make sure that we get it right since it's an 8 to 10 year plan and that we want to make sure we give you all the feedback that we do.'",
        "'speaker_1': 'And in general, I just think that we need more housing production overall, obviously more so with affordable, but that's where I'm concerned is about the percentage around. We're not just saying that we need more affordable housing, evenly distributed throughout the city, we need all kinds of housing.'",
        "'speaker_1': 'And so that's why I'm concerned that that we're having less identified site in areas that are less dense. Right. I feel that we're carrying a lot of I feel like I speak for my district, that I'm carrying a lot of the burden of the housing production.'",
        "'speaker_1': 'And so I just want to make sure that we can look at opportunities to explore other kinds of housing that can help balance out the demand. Right. That's contributing to rising rent increase. And so that's where I want to make sure we we look at an opportunity to make sure we're not stuck with this plan that we'",
        "'speaker_1': 'couldn't annually revisit. Right. The production rate.'",
        "'speaker_3': 'So this is not an end point. And this council, you know, always has the discretion through the city manager to give a different direction about what they want studied and changes in policy, including zoning and land use. We do think that this plan, which is built on the land use element decisions made it and in 2019 is'",
        "'speaker_3': 'the right set of policies and programs for this moment. But we're also and I think my suggestion would be even if council wanted to go and in a different direction, you could always give staff that direction to research whatever it is you wanted us to research, but we would probably take that on separate and apart from the'",
        "'speaker_3': 'housing element, because we do believe that it complies with the legal requirements and we need to get it certified by the state.'",
        "'speaker_1': 'Understood. Thank you. Last item I want to I want to comment on is around the concern around homeownership rates, especially among Bipoc community members. And I want to make sure that we do add in there that we are going to be taking specific actions to increasing the numbers and opportunities for homeownership.'",
        "'speaker_1': 'If I'm looking at the number right. We have homeownership of African-American black at 24%, land next to 29 Asian, while not disaggregated, is at 41%. And white a little higher. So I want to make sure that we're creating a fair, more fair process for a pathway to homeownership.'",
        "'speaker_1': 'And so I want to make sure that we're putting in place language there and where we're being able to provide the programing and resource to do so. Thank you, Councilwoman. Yes, there's a program in the plan program 3.3 around home ownership assistance.'",
        "'speaker_1': 'We then hear this feedback from the community and in reviewing other recent plans, including the framework for reconciliation, about the disparity in homeownership rates and the importance of continuing to create and support those opportunities. And so Program 3.3 related to homeownership assistance includes actions for pursuing funding sources and tools to provide additional homebuyer assistance.'",
        "'speaker_1': 'It recognizes our new Recovery Act funding for down payment programs and direct directs us over the next few years to look at additional models to create both homeownership opportunities as well as community ownership of land.'",
        "'speaker_0': 'You you comfortable.'",
        "'speaker_1': 'Price? Thank you. So a couple of questions. First of all, I think I may have said 20% of the RINO requirement is is a part of this effort. It's 10%. So I apologize for that. The question I had, I'm really focused on senior housing.'",
        "'speaker_1': 'I think we we are in deep need of senior specific housing in Long Beach and more specifically, senior housing that also allows for some mixed use development so that we can address some of the mobility issues and challenges that we see with seniors being having the opportunity to walk to things as opposed to drive.'",
        "'speaker_1': 'And I think that's a major issue. We just really don't have any good senior housing that has vacancy capacity right now in the city. So to everyone's point, I mean, we can we can sit up here and say a lot of things that might be pleasing to some and just pleasing to in others philosophical type statements.'",
        "'speaker_1': 'But the reality is we we can't just say we're going to take all this affordable housing and put it here or put it there because we're not the ones that are developing the housing. Right. So the parameters that we're using to distribute the housing allocations are based on what policies and programs are available through our state and'",
        "'speaker_1': 'local partners and federal partners in terms of what incentives will be provided, what credits will be provided, that type of thing. Am I correct on all of that?'",
        "'speaker_2': 'Councilman, this is Patricia Devendorf. That is correct. To a large degree. There's also just the the very technical requirements for the site inventory. The state does dictate the law does dictate that you cannot count as a site for affordable housing, low income housing, unless the area zoned for a certain density and unless the site is of a'",
        "'speaker_2': 'certain size. So that is how the technical analysis that staff did looked at those factors to to determine that distribution, if you will.'",
        "'speaker_1': 'Okay. And I appreciate that, because I just want to make sure I think just how those allocations are made is. It's not really an arbitrary decision by staff. There are some legal parameters that define where certain housing can go.'",
        "'speaker_1': 'And then, of course, now on top of that, you're dealing with a private developer who has to get some sort of return on the investment. And so you're also being realistic. So, I mean, we could we can make declarations here.'",
        "'speaker_1': 'I'd love to see more affordable housing here or there, and that might generate applause or boos of heaven. But the reality is, in practical application, there are certain limitations to where housing can go. What type of housing zoning has to do with it, and our partners have to do with it.'",
        "'speaker_1': 'And just without having you go into it, you're considered all of that factored into this proposal? Yes, we did. Okay. Is there any opportunity in your mind that you have in terms of the recommendations you're making to make any changes to that, to accommodate more affordable housing in other parts of the city that you feel you haven't'",
        "'speaker_1': 'considered?'",
        "'speaker_2': 'The mixed income strategy in general and just housing more housing production overall is going to be important. Looking at the lower density zones. One of the programs is to look at the lower density zones or areas of the city and come up with zoning strategies that allow for leasing in of additional units, duplexes, triplexes the what we'",
        "'speaker_2': 'talked about the courtyard, housing or bungalows. These are all typologies that exist throughout the city and the current zoning doesn't really allow it or not allow it very easily. So the zoning code update would look at creating zones that would facilitate that kind of development in the lower density multifamily or the lower density areas of the city'",
        "'speaker_1': '. Like the east side.'",
        "'speaker_2': 'Like that, you said.'",
        "'speaker_1': 'And would that allow also for moderate senior and lower income housing?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'And that's been factored into the plan.'",
        "'speaker_2': 'The proposal that is part of these strategies. That would be part of the implementation of the plan. Yes.'",
        "'speaker_1': 'Thank you. I appreciate that. I think that's a priority for everybody and I appreciate that. I mean, obviously, we want you to use best practices and what's accepted in your industry to make that reality possible here, because we have such a diverse city, and I appreciate that you've done that.'",
        "'speaker_1': 'I'm taking your word for it since this is your area of expertize and not mine. Thank you.'",
        "'speaker_0': 'Council members in the.'",
        "'speaker_1': 'Thank you, Councilmember Austin. And thank you, Patricia Nelson, for this great report. Thank you to our housing advocates for always.'",
        "'speaker_2': 'Supporting affordable housing for everyone.'",
        "'speaker_1': 'And thank you carpenters for showing up big. I'm really excited to have you guys here. One of the things that I feel is two basic needs for people is want to have food on their table and to to have a roof over their head.'",
        "'speaker_1': 'Housing is one of the most important topics we can discuss and address. The lack of rent affordability pre-pandemic affects us all. But in particular, it has place. It has placed the heaviest of burdens on people of color, seniors and low income communities and this housing crisis in and equitable.'",
        "'speaker_1': 'And it has exacerbated it has been exacerbated by the pandemic. Rents are just way too high and reaching a point beyond what our residents, including myself, can afford. The governor in 2019 signed the rent cap to address the burden statewide, but there are also ways we can address this locally.'",
        "'speaker_1': 'First and foremost, through through our housing element. I would like to ask, can staff speak to the implementation of rent control items within our housing element? Would a temporary rent control help alleviate this or are our current housing crisis?'",
        "'speaker_2': 'Councilwoman, thank you for your question. The plan does have a program that deals with that rent stabilization. It is program 7.2. Currently, the program, the action 7.22 talks about exploring additional housing programs such as rent stabilization and tenant landlord mediation services.'",
        "'speaker_2': 'And it's the time frame associated with that is to provide a report on successful programs in nearby jurisdictions to the Council by 2023 as a means to start to explore that that option.'",
        "'speaker_1': 'Thank you for answering that. As we move forward, we need to do all that we can and do our best to ensure that those who are living in Long Beach now and who are made.'",
        "'speaker_2': 'You know, who are made.'",
        "'speaker_1': 'To live in Long Beach, can stay and continue living in Long Beach as tenants. We all know that the house population in Long Beach are tenants. And also we know that a lot of them are being displaced by all of the high rents all across the city.'",
        "'speaker_1': 'So it is very important to me to highlight that and to address that that that element will guide our development process for the next eight years. We must build enough affordable housing to address our current and future situations.'",
        "'speaker_1': 'Last time the land use element came to us, it was a missed opportunity. That's what I keep hearing from all sorts of, you know, from developers, from housing advocates. This time around, we must get it right. We must get it right.'",
        "'speaker_1': 'It is something that is very important for the next eight years here in Long Beach, for all of our and for all of us here in this city. So I thank you again for for that. And I support the motion on the floor and really, really, really am looking forward to seeing a really great land use element'",
        "'speaker_1': 'going forward.'",
        "'speaker_0': 'Thank you, Councilmember. So I'll take a couple of seconds of privilege to ask a few questions. I wanted to go back to to Rina. And can you just remind us how often those those numbers are adjusted?'",
        "'speaker_2': 'So pardon me as a strategy for the for the arena is determined kind of at the state and regional level and allocations are made to the individual cities through the Look the Metropolitan Planning Organization, which is skog for the Southern California region.'",
        "'speaker_2': 'They are updated every eight years as part of the cycle of doing housing elements.'",
        "'speaker_0': 'Okay, so we won't be dealing with a moving target in terms of our arena numbers as we adopt this housing element?'",
        "'speaker_2': 'No, we should not be.'",
        "'speaker_0': 'All right. And I just want to appreciate all of the the really diligent work from staff, but also the council to deal with our housing crisis. We have, week after week come up with different strategies, different approaches to to recognize the crisis that we're in and do as much as we can to to encourage growth in housing'",
        "'speaker_0': 'production in our cities with a handful of development projects that I'm dealing with in my district alone. I can tell you that is very frustrating and cumbersome, the process of just going back and forth, the negotiations, the entitlement process.'",
        "'speaker_0': 'And then when you finally get to construction, there's still challenges. Most housing developments take several years to get to come to reality. And so we're going to make this happen within eight years. That means that we should have most of our projects queued up within the next two or three years to try to reach and achieve that'",
        "'speaker_0': 'goal of what is like 25,000 new housing in the city. So I think it's aspirational, it's doable, but it's going to be a very aggressive approach. It's going to require the cooperation of a lot of private property owners to help us realize that.'",
        "'speaker_0': 'And so I think that's the missing element. When we look at plans on paper, it does require an element that we don't control to come to the table. And so we have developed a method prong, strategic approach to creating better options and opportunities.'",
        "'speaker_0': 'And so I think we need to continue to keep our foot on the grass and be aggressive gas and be aggressive in doing so. I'm certainly supportive of this this element because of the the work that has gone into getting us to this point.'",
        "'speaker_0': 'My my quick question for. Our staff is. Do you feel like the plan before us is will it be compliant with HCB?'",
        "'speaker_2': 'Councilmember. We are hoping so that the strategy that we outlined and the ways in which we responded. Staff have responded to the feedback we believe is is sufficient and has gone above and beyond what many other cities are doing.'",
        "'speaker_2': 'So that is our hope and we just have to submit it again and see if that is the case.'",
        "'speaker_0': 'And I'll just add my my comments as well that I'd like to see this this plan, to the best extent possible, be less segregated, you know, to to extend options, opportunities and areas of the city that have not traditionally been open to to new housing or affordable housing.'",
        "'speaker_0': 'I think we need to build all types of housing, but affordable is a priority for our city at this point. My office recently did a survey of our our residents over the last couple of weeks about livability and trying to understand what their values are in terms of livability.'",
        "'speaker_0': 'And it was very glaring that the the category of housing affordability was the area that was rated the lowest. Right. And so it's clear that we have work to do as a city, and I'll be committed to doing that.'",
        "'speaker_0': 'And we're partners as well. And then I wanted to just just address that one last point. Is there an area of our housing element or requirement by HPD to deal with the issue of workforce in terms of building new new housing?'",
        "'speaker_0': 'Is there a way to get that in there in any way?'",
        "'speaker_3': 'We don't believe so in this document and the housing element. So obviously when the city is financially involved in a project, depending on that value of that project, labor agreements come into play on affordable projects that receive public subsidy.'",
        "'speaker_3': 'Prevailing wage provisions come into play. But we don't believe there's a mechanism for those projects that are purely private, privately initiated, privately funded and executed on private property. We don't believe there's a mechanism for the city to require specific labor provisions on those projects.'",
        "'speaker_3': 'That requirement would need to come from the state.'",
        "'speaker_0': 'Well, what about. I guess I'm out of time, but what about projects that may have public funding as incentives? Could could we? And can we encourage or do we have any leverage to.'",
        "'speaker_3': 'Well, we can always encourage and we can use the power of persuasion. And I think this council always have that power. And we'd be glad to work with you on individual projects. But it really comes down to is there public money and the project and how much?'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_3': 'Councilmember Price.'",
        "'speaker_1': 'Thank you. And that's a really great point. I want to use an example of that, which was the second development. There was no obligation by the developers to use any union labor, but we were I was very involved in that project.'",
        "'speaker_1': 'We worked very closely with them, we introduced them, made all the right connections, encouraged the parties to speak. And I think it was the result was a relationship that used skilled labor and the developers were very pleased with the outcome.'",
        "'speaker_1': 'So I think project to project that opportunity is there, the developer has to be open to it and certainly that's a question that can be asked at the early stages of the discussions with the developers so that they can factor in any additional costs that they think would be associated with those partnership into their proposal.'",
        "'speaker_1': 'But I know at Second and PCH, that was a major effort that we worked on and that developer was under no obligation whatsoever to use union labor. And the fact that they came to the table and came to the table the way they did was very impressive.'",
        "'speaker_1': 'And as a result, we have a very high quality project.'",
        "'speaker_0': 'Okay. Then concludes the comments from behind the rail. We've heard the public comment and so I would entertain. That's taken a vote.'",
        "'speaker_3': 'Motion carries.'"
    ],
    "Entertainment Permit for Vine at 2142 East 4th Street.": [
        "'speaker_0': 'Thank you so much. And I think we are all a little bit more conscious about Native American Heritage Month heritage. And we'll definitely do what we can to be more intentional with our support and recognition and acknowledgment. Thank you so much for your presentation.'",
        "'speaker_0': 'So I'd like to go to a hearing number 13.'",
        "'speaker_1': 'Item number 13 Report from Financial Management Recommendation to receive supporting documentation under the record, conclude the public hearing and grant an entertainment permit with conditions for entertainment without dancing to Vine at 2142 East Fourth Street District two. This does require an oath.'",
        "'speaker_1': 'Please people participating. If you can say I do, I will. At the end of the statement to you and each of you solemnly state that the testimony you may give in the course now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'I do. Thank you. Uh, so I'd like to go to staff for presentation.'",
        "'speaker_1': 'I'd like to introduce Tara mortensen, our business services manager, for a brief presentation on this item. Good evening, council members. Before you tonight is an application for entertainment without dancing or a third planet LLC, DBA the vine at 2142 East Fourth Street operating as a bar with a Type 42 ABC license for serving and selling beer and'",
        "'speaker_1': 'wine, but not distilled spirits. All of the appropriate departments, Health and Human Services, Development Services, Police and Financial Management have reviewed the application and have provided their recommended conditions as contained in the hearing packet. There is one correction, however, that's in the condition section, section one, item number four is part of our regular standard conditions, but it's'",
        "'speaker_1': 'not applicable on this in this situation as it applies only to restaurants and will be deleted from this item. I, as well as Commander Burford from the police department who was on the phone this evening, are available to answer any questions that you may have.'",
        "'speaker_1': 'That concludes my staff report.'",
        "'speaker_0': 'Thank you, sir. We have a motion by Councilmember Allen and second by a councilmember that they have. We'll turn it over to Councilmember Allen.'",
        "'speaker_1': 'Yes. Thank you. I just want to thank the staff, Emily, also Emily and Dustin from the Vine for all their hard work on this fourth street and the retro row area. It's just an awesome, fun part of our community.'",
        "'speaker_1': 'I know the bid and all the businesses there do a great job at managing the area and the vine is just a very popular spot to go. So I am fully supportive of this entertainment license. Emily and Dustin are great operators and I know that they will comply with all the conditions listed and staff has not received'",
        "'speaker_1': 'any issues. So I don't think there's any reason why we wouldn't move forward with this license.'",
        "'speaker_0': 'That can come from within the data.'",
        "'speaker_1': 'Very supportive of this item.'",
        "'speaker_0': 'Okay. Remove the second and I don't see any further comment. I'll go to public comment now.'",
        "'speaker_1': 'Will the following speakers please line up the podiums? And I can say Justin Lavelle's, Tamara King, Morgan Hughes, Carl Stinson.'",
        "'speaker_0': 'You each have up to 3 minutes. You don't need to use all of that time, though.'",
        "'speaker_3': 'Careful, the one of these groups might say you're trying to, you know, disqualify the Brown Act amendment. Gentlemen, I am speaking in favor of this entertainment permit being received by the Vine Bar. I find Emily Anderson to be running and maintaining one of the finest examples of creativity within the city of Long Beach.'",
        "'speaker_3': 'This is a destination hub for a wide spectrum on the age bracket. But most importantly for me, as a participant in live music within the city, it's one of the few places that younger acts and older acts can simultaneously mix both in performance and in and attendance.'",
        "'speaker_3': 'I think that seeing them make the wonderful turnaround of Retro Row as a resident in the city of Long Beach has been inspiring. And it's it's finally due to the hard work and good nature of people like Emily Anderson.'",
        "'speaker_3': 'You know, it takes a lot, both as a musician and as a young family, to run an establishment such as this. And it's purely been done just for the good nature of maintaining a culture or a music culture here in the city of Long Beach.'",
        "'speaker_3': 'So I'm appreciative, appreciative of that. I think that it's one of the imperative pieces that holds together the whole retro area in itself. And I'm always glad to be in attendance there for any of the events that they have.'",
        "'speaker_3': 'And, you know, very rarely, but at times they do have a lovely root beer selection. And so I always find myself going there at times to just make sure that they they have that intact. So thank you and for support.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_3': 'Hi. My name's Steph in love with. Thanks for having us. This is Emily, my wife. We owned Vine together and Vine is served the Long Beach Music Community, music and arts community for over 12 years. The venue provides a safe environment for all walks of life to engage in and share their music and art.'",
        "'speaker_3': 'Our patrons and staff are extremely community oriented. We look out for the space as well as for street as a whole. We believe having a space like Vine open in the evening greatly benefits Fourth Street and its future.'",
        "'speaker_3': 'It brings new people to the city, brings all people to the city that have been here for a long time. In regards to sound, Vine has always and will continue to strictly follow the rules outlined in our entertainment license.'",
        "'speaker_3': 'Music will be over on time. Doors will be shut during light performances. We have a double pane sound, glass windows and our storefronts from the previous owner. And the ceilings are lined with soundproofing material as well. And I have submitted about ten letters from people that live nearby.'",
        "'speaker_3': 'People have really literally closed as well as the Fourth Street Association. And we have the full support of everyone in that. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Good evening. My name is Tamara King, and I'm a voting member of District two. I'm one of the residents that abuts the vine bar. And it is not quiet. It is not soundproof. I soundproofed my residence. There's apartment buildings.'",
        "'speaker_1': 'We just talked about density and cooperative living. This is a residential area. I love Fourth Street. I love live music. But it's seven nights a week and it doesn't stop at 10:00. There's usually people screaming in the alleyways.'",
        "'speaker_1': 'For those of us who actually do live there, it's a very loud. You know, it's residences on all sides. Apartment dwellers were renters, and no one has tried any sound mitigation whatsoever. So this is out on the parking lot.'",
        "'speaker_1': 'The door is not closed. The trash is gone through. Please think of the residence. Thank you. Hi there. Thank you. I am Morgan Hughes. I am also a resident very close to Vine. I actually live along the alleyway that butts up to the same alleyway that Vine is located on.'",
        "'speaker_1': 'So it is a very, very close location. I am here in front of you today fully in support of a small business and a staple to our community. And I echo what one of the other members here said about the cultural impact and the art and the value that Vine provides to our community.'",
        "'speaker_1': 'As I mentioned, I live very, very close, um, and for a very long time they have always followed the rules. We have never had any issues with people being disrespectful to our property. We do have an open yard against the alleyway and we have knock on wood.'",
        "'speaker_1': 'Never have anybody disrespect our property. We've never had any issues and we've always been very, very impressed with the way that they have followed the rules and been respectful of the noise curfew so fully and support. And I look forward to the next live venue.'",
        "'speaker_0': 'Thank you. This is our final speaker on this.'",
        "'speaker_3': 'I'm Carl Essence and I also live really close by to the vine. Also, musicians have the opportunity to play there sometimes. Yeah, they've done a great job. I think it's a really important part of our street that they keep this license.'",
        "'speaker_3': 'I think it's a big part of the community and the culture there. Especially on Retro Road, there's a lot of business, I think, that locally has driven through there as well as people come to visit from out of the area.'",
        "'speaker_3': 'I think it adds a lot and I would agree with the last speaker that sound wise we can hear pretty well down that street and they're always on curfew. Like when I've been there drinking late, there were the second curfews that like we all get put inside, doors are closed out that they do the best they can'",
        "'speaker_3': '. I think it's more than enough, and I think it's really important to keep that place there and let them do what they're doing. Thank you.'",
        "'speaker_0': 'Thank you. I'll take it back to Councilmember Allen.'",
        "'speaker_1': 'I yes. I just want to speak to the resident and just just know, I. I do hear your concerns, and I just want you to know that we will make sure that, you know, all the rules are being followed.'",
        "'speaker_1': 'And I trust that they will abide by all the stipulations of entertainment permit.'",
        "'speaker_0': 'Okay. The motion and second it we've heard from public comment members please cast your vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Before we go on to the next item, I'd like to hear from the city attorney to report out from closed session.'",
        "'speaker_3': 'Thank you, councilmember and members of the council this evening in closed session, the council by a vote of 8 to 0 authorize the city attorney to initiate litigation and participation in the national prescription opioid litigation. Case number 17, M.D., to No.'",
        "'speaker_3': 'Four in the United States District Court. Thank you.'"
    ],
    "Correction of District Priority Fund Transfer for Glendora Neighborhood Watch Group.": [
        "'speaker_0': 'Thank you. So the next item is I would like to just kind of combine our fund transfers. Item 14, 23, 24, 25 and 26 as one item. Let me get a motion in a second on that.'",
        "'speaker_1': 'I did. 14 is a report from Councilwoman Allen recommendation to increase appropriations by $400 to provide a contribution to Partners of Park to support AOC seven Thanksgiving Dinner Giveaway Community Event. Item 23 is a communication from Vice Mayor Richardson, Councilwoman Zendejas.'",
        "'speaker_1': 'Councilmember Urunga. Recommendation to increase appropriations by $500 to provide a donation to the name Neighborhood Association. Item 24 Communication from Councilwoman Sara Recommendation to increase appropriations by $400 to support the Local Hearts Foundation Turkeys Giveaway. Item 25 Communication from Councilwoman Price Recommendation to increase appropriations by 1500 to provide a donation to the Belmont Shore Business Association for'",
        "'speaker_1': 'their Belmont Shore Winter Village event. Item 26 Communication from Councilwoman Price Recommendation to decrease appropriations by $320 to adjust a previously approved third District priority fund transfer to support the Glendora Neighborhood Watch Group Community BLOCK Party.'",
        "'speaker_0': 'Thank you, Madam Clerk. So we have a motion seconded. Is there any public comment on this item?'",
        "'speaker_1': 'No public comment. At least a public comment.'",
        "'speaker_0': 'It's not a vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Thank you. Next item is item number 15.'",
        "'speaker_1': 'Report from Long Beach Airport. Recommendation to amend contract with ABM Aviation for airport parking operations and management services to increase the contract amount by $1,506,552 and extend the term through November 30th, 2020 to District five.'",
        "'speaker_0': 'Before we go forward with that, was there any public comment signed up on an open public comment?'"
    ],
    "Contract Amendment and Appropriation Increase for Airport Parking Operations and Management Services.": [
        "'speaker_0': 'Good. So that concludes our public comment section. I do want to take it back to item number 15, which was already queued up. We have. We have a motion. Number 15.'",
        "'speaker_1': 'The report from Long Beach Airport recommendation amend contract with ABM Aviation for airport parking operations and management services to increase the contract amount by 1,506,552 and extend the term through November 30th, 2022, District five.'",
        "'speaker_0': 'And we have a very brief staff report.'",
        "'speaker_1': 'Thank you. Problem in Austin. This item is to extend the ABM Aviation Operating Services for or parking structures and be at the Long Beach Airport. They have provided a number of services throughout the years. During the pandemic, it was a difficult year.'",
        "'speaker_1': 'They have been extremely collaborative in the effort of managing staff costs and at this time we are preparing a new RFP for services in 22 to begin in 22. But today we are asking for your approval for.'",
        "'speaker_3': 'An extension for this contract.'",
        "'speaker_0': 'Thank you, Miss Guidry. Is there a councilmember, uncle?'",
        "'speaker_1': 'Thank you. Just excited to move forward with our projects and maintain the progress that our great staff have been working on. Thank you.'",
        "'speaker_0': 'Price. All right. Here in the motion in a second. It is your public comment on this item.'",
        "'speaker_1': 'There's no public comment on this.'",
        "'speaker_0': 'Public comment. Let's vote.'"
    ],
    "Presentation on Police Initiatives and Advancement. ": [
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Great. Next item number 16.'",
        "'speaker_1': 'Report from Police Department Recommendation Receive and file a presentation on police initiatives and advancement from the Long Beach Police Department citywide.'",
        "'speaker_0': 'Okay. Is there emotion? We've got a motion in second. I'll turn it over to staff at our police department of setting up. Give them a second to get through. Welcome, Chief.'",
        "'speaker_3': 'Thank you very much. We do have a presentation. We were in front of you back in January with a similar presentation talking about the number of things that police department is working on. We'd like to take this chance to give you an update and kind of a reminder of the body of work that they're working on and'",
        "'speaker_3': 'how it also ties into our reconciliation plan. I will turn it over to Chief Luna and his team. Thank you, Mr. Modica, and good evening, members of the City Council. I have with me today, just before I get started, I have Ruby Marin Jordan, she's our admin bureau manager.'",
        "'speaker_3': 'Got promoted recently to that position before she was in charge of our Office of Constitutional Policing, which I'll be talking about extensively tonight. And then I have Commander Padel Dowd, who's the chief of staff in our office. Transformational policing is a cultural shift that promotes justice and equity, fostering trust, collaborative community relationships, and empowering all officers to'",
        "'speaker_3': 'make positive change. To the benefit of the communities that we serve and protect. Our department has been proactive in identifying areas in which we need to evolve. We have also learned or I'm sorry. We have also leaned in to the call for change by embracing opportunities as they present themselves.'",
        "'speaker_3': 'As a result, we have been extremely transformative in the way we do business, and we are committed to equity and social justice and to ongoing professional development and growth for our organization. I would like to take a moment to express my deepest gratitude to the employees every employee of the Long Beach Police Department for their dedicated service'",
        "'speaker_3': 'and. Their willingness to embrace the many changes during these challenging times. And I specifically want to call out the Police Officers Association and the I am as well, because they've been our partners. Anytime you make change, you have to have labor on board and they've been partners in that manner.'",
        "'speaker_3': 'I also, in a sense want to thank the mayor and all of you as council members for your continued support of our police department and the opportunity to present this at the Council tonight. And as of as I talk about these changes that that I'm talking about, I've spoken to each and every one of you on many'",
        "'speaker_3': 'occasions, and a lot of this change occurs because you are very progressive. You listen to our community. You want the police department to reflect the city's values. And a lot of that will be talked about this evening. So thank you for that.'",
        "'speaker_3': 'We strive to align our department's mission of public safety through partnerships and our values with the Law Enforcement Code of Ethics and Sir Robert Peel's principles of policing, which inspire our own core values of ethics, intelligence and respect.'",
        "'speaker_3': 'As I've said in the past, the Long Beach Police Department is very different than it was 30, 20 and even ten years ago. Our community and our environment has changed and our department has and must continue to evolve with this change.'",
        "'speaker_3': 'Tonight, we will be providing a presentation on the Police Department's Initiatives and Advancement, which serves as a follow up to the study session we did back in January of this year. In the next year. In the next few slides, I would like to illustrate.'",
        "'speaker_3': 'How progressive our department has been, how we have evolved over the years, and some factors that have influenced that evolution. In January of 2021, the major City Chiefs Association Executive Board, in which I hold an elected position on that board, released a report regarding police reform.'",
        "'speaker_3': 'That has been helpful, a helpful resource for our police department. We strive to align our policies and procedures with the major city chief's recommendations, which bring us at or above the national law enforcement standards. Major city chiefs are setting the tone and paving the way for modern policing and for us here at the Long Beach Police Department'",
        "'speaker_3': '. Another report that has been a guiding resource for our police department in the last several years is President Obama's 21st century policing task force report. Outlined in this report are the six pillars you see here on this slide.'",
        "'speaker_3': 'We have utilized and tied specific initiatives to this report to help us manage and lead our department. This report promotes effective crime reduction while building trust through unique problem solving efforts to improve the quality of life in our community.'",
        "'speaker_3': 'We have embraced those unique problem solving efforts through programs such as our neighborhood walks, which we are continuing to roll out in each of our patrol divisions and our community liaison officer program. And you, the City Council, as I stated earlier, have shaped the way we do business, whether it be through reconciliation, training, recruiting, hiring or transparency'",
        "'speaker_3': 'efforts. And each of you I can name one program that each of you had brought to us that has impacted the way we've evolved. You are advocates for excellent policing and reforms. Here you will see a timeline of 30 different examples of initiatives and advancements since 2014, including training, equipment, wellness and community involvement.'",
        "'speaker_3': 'And it shows the diversity in our recruit classes are various partnerships, alternative response in our work with the City Prosecutors Diversion Program, which provides members of our community options other than incarceration. As a result of our hard work and modifications in training, equipment and the areas of accountability over the years, we are realizing significant declines in the'",
        "'speaker_3': 'use of force and citizen complaints. Use of force is down 28%. Citizen complaints down 30%. You will also see here references to increase diversity and transparency efforts. Together, policies and procedures provide a roadmap for our day to day operations.'",
        "'speaker_3': 'Effective policy change is key to the reconciliation process. Since 2015, we've made over 100 adjustments to several different policies. Some you see listed here today. In addition, we have replaced the word should with Shell to strengthen the wording and all of our new policies and policies currently under review, including our use of force policy.'",
        "'speaker_3': 'The preservation of life has always been at the heart of policing. Refocusing on that core ideal has never been more important that it is than it is right now. And there is no issue of greater consequence in the community we serve or to the community we serve in our profession than the issue of use of force.'",
        "'speaker_3': 'That is why we challenged the conventional thinking on how to approach use of force situations, in particular those that involve people suffering from mental illness to ensure we stay in line with best practices and improve the delivery of our services.'",
        "'speaker_3': 'Excuse me, our services. We conducted a comprehensive review of our use of force policies which are listed on this slide. We identified areas in those policies that could be modified to help prevent officers from being placed in situations that endanger themselves or others where the officers have no choice but to make split second decisions to use deadly'",
        "'speaker_3': 'force. The safety of everyone in our community and strengthening the foundation of trust between our community and our department are our top priorities. Constitutional policing is at the core of our community policing philosophy. Creating the Office of Constitutional Policing reflects a forward looking evaluation of what constitutional and relationship based policing mean today.'",
        "'speaker_3': 'It also represents our commitment to advancing practices that provide equitable, just and fair policing to all. Our Office of Constitutional Policing works closely with other city departments and the Office of Equity promoting the initiatives outlined in the Framework for Reconciliation.'",
        "'speaker_3': 'Reconciliation got our attention, and we learned and we continue to grow as an organization alongside our city family. As you will see here. We are invested in goal two and three of the framework for reconciliation. We are currently collaborating with our health department to reduce gun violence in the Washington neighborhood.'",
        "'speaker_3': 'We are also working with the Health Department, along with the Communication Center and the Harvard Kennedy School of Government Performance Lab to address residents services needs that reduce reliance on traditional law enforcement and medical. 911 Responses better known as alternative responses.'",
        "'speaker_3': 'We are participating in the National Justice Database to help improve transparency and accountability. Our department will also provide RevPAR and crime data to the Center for Policing Equity to analyze and to provide a deeper understanding. Of what can produce racial inequity in policing.'",
        "'speaker_3': 'That becomes important as we are going to release more report data later on this week because we're concerned about what that data says. And we're also concerned about the fact that when we look at our shooting stats and we look at our victims and the suspects described that those are usually people of color, typically Hispanic or African-American'",
        "'speaker_3': 'males. That is very, very, very concerning. We are also currently working with the University of Southern California to implement the police department's portal in their Lewes registry that we've brought to this council floor. The portal is intended to be used as a component of applicant screening before hiring a police officer.'",
        "'speaker_3': 'In addition, the registry will be used for research into trends and patterns of misconduct, leading to new solutions for improving law enforcement practices. At our presentation in January, we provided a report on several other initiatives that the Office of Constitutional Policing was working on.'",
        "'speaker_3': 'And tonight we would like to provide updates on that progress. One of the biggest accomplishments to date is the Assembly of the Community Advisory Committee, consisting of representatives from faith based organizations, neighborhood associations, business districts, attorneys, residents, as well as Cal State, Long Beach professors.'",
        "'speaker_3': 'They provide input and participate in meaningful discussion on a variety of department policies, especially those that impact police community interactions. As a result of their efforts, our use of force policy has taken on new a new shape. Many of the recommendations are currently being incorporated into our policy, which will be posted on our website in the coming'",
        "'speaker_3': 'months. They have also reviewed and provided input on the vehicle pursuit policy and have recently begun reviewing the facial recognition technology policy. Other initiatives that have been completed include the early intervention program that's already been fully implemented in our patrol bureau bias free policing, policy and training.'",
        "'speaker_3': 'That's a special order that's been completed and the training is ongoing and then compelled statements that are now being provided to the PCC. And we recently entered into a demo, you with the Center for Policing Equity, to conduct the critical analysis of our RIPPER data and crime data.'",
        "'speaker_3': 'Future initiatives include reviewing our processes to ensure we are in line with best practices. Continued collaboration with the Office of Equity. Working with the Office of Civic Innovation on two projects, creating a data compliance integrity unit and assembling a recruitment and Advancement Advisory Group.'",
        "'speaker_3': 'As you have heard tonight, we continue to adopt progressive changes in our department to reflect the needs and changing expectations from our community for police services. I am so proud of the employees who continue to adapt to these new change changes in their work environment.'",
        "'speaker_3': 'We will continue to work hard with our community partners and the Office of Equity through the framework of for reconciliation to continue to implement meaningful change and progressively move us towards. As a 21st century police department. And that concludes my presentation.'",
        "'speaker_0': 'Oh, thank you, Chief. I will go to the maker of the motion. Well, before I do, I'll just say thank you for the report and the data presented here. I would just in any way, I mean, obviously, the.'",
        "'speaker_0': 'The council chambers isn't packed with people, you know, really interested in this report tonight. But a year ago, we had, you know, a lot of interest in police reforms and changes and a lot of recommendations from from our public on how they'd like to see a lot of these police department operate in the future.'",
        "'speaker_0': 'And obviously, by the the data that was presented here today and a lot of the hard work of the council staff, and we want to appreciate the Office of Constitutional Policing for actually listening and being innovative to implement changes in a department which I hope will be better received by our community and recognized for, for the, um'",
        "'speaker_0': ', for the efforts that we're making to be more compassionate as a, as a department and more responsive as a department and understanding the, the, the many challenges that have gone into the relationship with particularly communities of color. Um, so thank you very much for the presentation.'",
        "'speaker_0': 'I for one, appreciate it, appreciate all of the, the diligent work, particularly over the last year or more to, to advance this department. Thank you for your leadership, sir. Councilmember Your Honor.'",
        "'speaker_3': 'Thank you. Senior member of Apple.'",
        "'speaker_0': 'Therefore, the day.'",
        "'speaker_3': 'Of gratitude for this comprehensive report. And in all the years that I have worked for and been in the City Council, I have never seen anything so comprehensive. The police department, in terms of their initiatives and their and their report, in terms of what they are doing to improve policing in Long Beach, is a document that I'",
        "'speaker_3': 'think we should probably be looking at periodically, updating, of course, not about it, hear a lot of data that can be reviewed and of course rerecorded in terms of showing what kind of progress we're making as a police department to see the Long Beach.'",
        "'speaker_3': 'Little were the things that that did not represent. It meant that I knew where we had, at least in effect for a number of years in the past was the implementation of a community special interest groups that you would meet with that we would achieve, such as the Latino, African-American, LGBTQ.'",
        "'speaker_3': 'Very similar groups like that that would have a. A voice with the two in regard to issues that may have been very specific or particular to that specific group. Are you planning on implementing that again or are you still is it still in effect?'",
        "'speaker_3': 'Are you still dealing with these groups? And if you are, I think it would be helpful to know that and maybe report in the future as to the number of meetings you held with the various groups and the topics of discussion, whether it be hiring or or general policing as a whole.'",
        "'speaker_3': 'Thank you, Councilman. Your anger for that question I talked about in the presentation that community advisory committee. And what we did is, is we took what I believe to be a very diverse group, not only in culture and race, but in thought from across the city, who is advising us on our policies, specifically the use of force'",
        "'speaker_3': 'policy and others to come our way. We heard the community loud and clear. As the acting mayor stated earlier, when people were here talking and demanding change, we listened. And that's what this report is about. And with our community groups, it's it's absolutely we do not survive without partnerships and getting that input.'",
        "'speaker_3': 'We do not have the same configuration that we had once upon a time when we had a robust community engagement division that came through multiple reductions in budget. But you know what? We didn't blink. We didn't just give up and say, we're not going to do that anymore.'",
        "'speaker_3': 'So we've consistently tried to evolve and think of different ways of recreating that valuable input other than the fact that we are in the community. And I think all of you know this from all of our division commanders were I think last year we had well over 300 community meetings.'",
        "'speaker_3': 'A lot of them ended up being virtual because of COVID, but that never stops. And we didn't have that before. I think we picked certain community members, had them come in, and then we heard from them. Now that's more broadly utilized so that nobody feels left out.'",
        "'speaker_3': 'That being said, we still have we still have like, for example, a Latino advisory group that does come in and attends events and they're very connected to the police department. So that's just one example. Thank you for your report.'",
        "'speaker_3': 'That's all. I have a better bear today.'",
        "'speaker_0': 'Thank you. Councilmember Price.'",
        "'speaker_1': 'Thank you very much, Chief, and members of your team for the presentation. I mean, I chaired the Public Safety Committee for many years, almost my entire tenure on the council until recently. And I have had the opportunity to engage in some pretty serious, controversial and far reaching policy issues with our police department and those meetings.'",
        "'speaker_1': 'And I've never once had a situation where the police department has said, no, we can't. That's not possible. That's inconsistent with our culture and that's unique. And with most city departments, you know, usually when we bring up the suggestion, the first response and I get it, it's human nature.'",
        "'speaker_1': 'People get defensive and they view suggestions for improvement is as a criticism, even when it's not meant to be that way. I understand, but I've found the police department has always, whether it's the chief or someone who they've had staff, public safety has always said, we'll look into that.'",
        "'speaker_1': 'That's a great idea. Let us evaluate what other people are doing. And as a result of that, I think we have some policies today that are very forward thinking that incorporate best practices. You know, I think we have a long way to go, as does most of the law enforcement as a profession in terms of our criminal'",
        "'speaker_1': 'justice system and making it. Relevant to the world around us today. And not being afraid of changes, but embracing them. And I think, you know, I deal with police departments every day. And I think, Chief, you and your team have done a great job, at least listening to what else is out there and being willing to consider'",
        "'speaker_1': 'suggestions whether. They're feasible or not. Your first response to me has never been. It's not feasible. It's always been. I mean, even if it's totally not feasible. And a crazy idea. You've said we'll look into it. Let us research it.'",
        "'speaker_1': 'Let us look at see what's out there, let us evaluate best practices. And that encourages, I think, a very good partnership between you and council members. At least that's been my experience and it doesn't shut down the conversation.'",
        "'speaker_1': 'You always leave room for additional conversation, and I think that's important. Are you guys perfect? No. Do you and your officers sometimes make mistakes? Yes. Are you the type of department that expresses a willingness to make changes, learn from mistakes, and move forward with best practices?'",
        "'speaker_1': 'Yes, and I think that's really all we can ask for at this stage. And I want to I want to thank you for the presentation that you've done. I know you've got to be working really hard on these initiatives, and it should not go unnoticed how hard you work to get to this point and honestly, how hard'",
        "'speaker_1': 'the officers, the rank and file officers who support the department have worked to embrace the changes and to adopt some of the cultural. Cultural changes in the organization that have been necessary as a result of things that we have all learned as best practices.'",
        "'speaker_1': 'So thank you, Chief. Appreciate having you and your team here with us tonight for this presentation.'",
        "'speaker_0': 'I'll turn it over to our current public safety terrorists who come from afar.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Chief, and your team for the presentation.'",
        "'speaker_1': 'I appreciate the thorough.'",
        "'speaker_2': 'Presentation.'",
        "'speaker_1': 'Of how you and your team have been able to take all of the feedback and information from the community in how to integrate it in your plans and initiative moving forward. I think that it's. It's it's definitely noticed that there's a lot of consideration to and how cross department work can happen.'",
        "'speaker_1': 'I like that that was included because we seeing that none of our department works in isolation and in some sense there's also some parallel or overlap as far as the work with that you do with the Health and Human Services Department and probably others too, as we move forward.'",
        "'speaker_1': 'I think with some of the goals that you have, I think some of the things I've learned from having been the chair of public safety in the past year is I appreciate the opportunity to have conversations about how do we increase transparency and accountability, given the continuous conversation about what that means and what that look like.'",
        "'speaker_1': 'And I appreciate the movement and how we can do that together in a way that provides information and builds trust for the community to see that there is a process forward in how we can take steps to do that.'",
        "'speaker_1': 'And I look forward and seeing how we can continue to, I think as the goals get implemented, to seeing how those steps can be shown and how it can be done. And I think a lot of the tests will be how the community, their feedback on it writes their response to it.'",
        "'speaker_1': 'That's the real task and that's what we'll see. Is it working? And it's not how we can fine tune that together. So I look forward to doing that, to having those conversation and appreciate a lot of the efforts taken to make sure that we're being the most transparent account of that that we can be.'",
        "'speaker_1': 'And I hope that we can continue that dialog to do so for to best serve our residents. So thank you so much.'",
        "'speaker_0': 'Thank you so much. A couple of members in the House.'",
        "'speaker_1': 'You. I wanted to thank you, Chief, and our police department, for your effort.'",
        "'speaker_2': 'And your willingness.'",
        "'speaker_1': 'I think that I absolutely echo the sentiments of my colleagues. And I just wanted to say thank you very much for all the work that you do.'",
        "'speaker_0': 'Great, though. Thank you for the comments. Is there any public comment?'",
        "'speaker_1': 'There is no public comment on this item.'",
        "'speaker_0': 'So an excellent presentation. Members, please cast your vote.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Contract Award and Funding Transfer for Santa Fe Avenue Traffic Signal Synchronization.": [
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Wonderful Item number 18.'",
        "'speaker_1': 'Report from Public Works Recommendation or contract to Island Island nor Belco Electric for the Santa Fe Avenue Traffic Signal Synchronization for a total contract amount not to exceed 3,193,628 districts. One and seven.'",
        "'speaker_0': 'We have a motion. It is seconded. Is there any public comment on this item?'",
        "'speaker_1': 'No comment on this item.'",
        "'speaker_0': 'In the discussion forum. But in the world.'",
        "'speaker_3': 'Council member. Yeah. Just looking forward to the completion of this project. I think it'll be very useful and helpful for the communities in that area. Thank you for your work on this.'",
        "'speaker_0': 'Any other council members.'",
        "'speaker_1': 'Very.'",
        "'speaker_2': 'Supportive.'",
        "'speaker_1': 'Of this item.'",
        "'speaker_0': 'Right. In motion and seconded. No public comment. Please cast your vote.'"
    ],
    "Ordinance to comply with SB 1383 on Short-Lived Climate Pollutants Reduction.": [
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Next item please.'",
        "'speaker_1': 'Im 20 Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code to comply with SB 1383. The short lived Climate Pollutant Pollutants Reduction Act. Read the first time and lead over the next regular meeting of City Council for Final Reading Citywide.'",
        "'speaker_0': 'Right. It's been moved and seconded there any. Other comment on this particular.'",
        "'speaker_1': 'Loophole, comment on this item.'",
        "'speaker_0': 'Councilmember Allen, would you like to speak on this?'",
        "'speaker_1': 'I just think it's wrong to say this the is important to do our part locally to reduce emissions and waste. And we can have less of a climate impact through edible food recovery programs and by diverting organic waste appropriately.'",
        "'speaker_1': 'So support this. Thank you very much.'",
        "'speaker_2': 'Yes, I support this item and I look for it in the ways that we can also.'",
        "'speaker_1': 'Ensure we find the funding to implement this as well.'",
        "'speaker_0': 'Right. The only other have comments from Council three. None. Please cast your vote.'",
        "'speaker_1': 'Motion is carried.'"
    ]
}