{
    "Entertainment Permit with Conditions for Miko's Sports Lounge.": [
        "'speaker_1': 'Item one report from Financial Management Recommendation to receive supporting documentation into the record. Conclude the hearing and grant an entertainment permit with conditions on the application of Michael's Sports Lounge at 710 West Willow Street for Entertainment with dancing by patrons and Performers.'",
        "'speaker_1': 'District seven. Please raise your right hand. You and each of you to solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Great. Thank you very much. Moving on through this hearing, I'm going to turn this over now to city staff.'",
        "'speaker_12': 'Mayor, members of the council. I believe council member Austin has excused himself due to a conflict that he represents the owner of the establishment in his job as a representative for that group. So he will not be participating in the hearing this evening.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_10': 'Thank you, Mr. Mayor. Members of the Council for this item are the staff making. The presentation will be Jason MacDonald, our purchasing and business services manager.'",
        "'speaker_8': 'Mr. Mayor, council members, Jason McDonald for the Financial Management Department tonight you have in front of you the application for entertainment with dancing for you needs way.'",
        "'speaker_6': 'Of doing business as Michael's sports bar 710.'",
        "'speaker_12': 'West Willow and District seven. All of the necessary departments have reviewed the application.'",
        "'speaker_8': 'The application and proposed conditions are contained in the packet that was provided.'",
        "'speaker_6': 'We are prepared to address any questions or concerns along with the police department regarding the application or the conditions. Commander Farfan from the police department will address the calls for service. Good evening.'",
        "'speaker_10': 'Mayor and City Council Commander Rick Farfan, Long.'",
        "'speaker_12': 'Beach Police Department.'",
        "'speaker_10': 'During the investigative stage, which takes place from September 12, 2014 until March 17, 2015, we examined calls for service and during this time.'",
        "'speaker_12': 'We found there were 27.'",
        "'speaker_10': 'Calls for service, with the majority of them being cleared advise, which means that an officer actually went there and spoke to the owners or made contact with somebody. The remaining was when the officers arrived on scene. They didn't hear any loud music or there was any disturbance.'",
        "'speaker_10': 'That doesn't mean that nothing occurred, just mean by.'",
        "'speaker_12': 'The time the officers arrived, they didn't hear any music.'",
        "'speaker_10': 'We've also discovered that Migos has applied for seven or EPS occasional entertainment permits, and every time they've had an occasional entertainment permit, there's always calls for service, typically involving loud music and loud patrons. Their most recent EP was issued this past.'",
        "'speaker_12': 'March 12.'",
        "'speaker_10': 'Through the.'",
        "'speaker_8': '13th, and there were.'",
        "'speaker_10': 'Five calls for service between the hours of 1050 to 1:00 in the morning. Three were for music calls, and two were complaining about.'",
        "'speaker_12': 'Large groups that were being loud and disturbing the neighborhood.'",
        "'speaker_10': 'We've also contacted all residents with a 100 foot radius, and that impacted three of the residents. All three residents are opposed to an entertainment permit, citing various reasons such as loud noise.'",
        "'speaker_12': 'Large groups leaving trash in front of their neighborhoods, urine as frequently found in their name in front of the residents. That's a very common complaint. That concludes my report. I can be able to answer any questions.'",
        "'speaker_0': 'Thank you. With that, we're going to go now to public comment for this part of the hearing. So if you're a member of the public, please line up for public comment and then we will go to deliberate through the council.'",
        "'speaker_0': 'So please come forward. Please come forward and just identify yourself for the record.'",
        "'speaker_1': 'Okay. Good afternoon, everybody. Thank you very much for the opportunity to speak today. My name is Leslie Harvey and I live in the 2500 block of Main Avenue, right around the corner from Michaels Sports Lounge. I've lived there for 12 years.'",
        "'speaker_1': 'When my husband and I bought our house on Main Avenue, there was a mom and pop chocolate shop on the corner and a John Edwards paint shop across the street. And adjacent to that, there was a small neighborhood bar.'",
        "'speaker_1': 'It was a quiet neighborhood. We thought it was the perfect place to buy our first home and to raise our two boys. For many years, the neighborhood was peaceful. Our boys grew, went to school, and the eldest went away to college.'",
        "'speaker_1': 'This is when the trouble began.'",
        "'speaker_3': 'The small neighborhood.'",
        "'speaker_1': 'Bar had changed ownership several times and eventually became Miko Sports Lounge. With new ownership came outsiders to our neighborhood. With these outsiders came a myriad of disturbances and disrespect for the people and properties on Main Avenue. Waking up at two in the morning to loud voices, laughing, shouting, and at times fighting became a regular occurrence.'",
        "'speaker_1': 'Car alarms going off. Car stereo so loud that they would rattle our windows. Motorcycles revving their motors and cars racing down the street were frequently heard in the middle of the night. People were parking in front of our house, drinking in their cars, getting high, leaving their empty bottles and trash in our garden.'",
        "'speaker_1': 'And then we would literally watch them walk down the street and go to the bar. After six months, the first six months and over 70 phone calls to the police. My husband and I were absolutely shocked that Mika's application for a permanent business license had been granted.'",
        "'speaker_1': 'And we are further confounded by the news today that the fire, police and health departments recommend approval of this entertainment permit. The Long Beach Municipal Code States. The City Council shall approve the permit if it finds that it, quote, will not constitute an undue burden on the neighborhood, unquote.'",
        "'speaker_1': 'How can what we've been through the last year not be considered undue burden? Our peace has been disrupted. We feel like we live in the parking lot of a bar. I hope that after you hear from my neighbors and me today that you will understand our burden and not add to it.'",
        "'speaker_1': 'Please don't approve this entertainment per permit. Even with the conditions listed, it will add to the existing burden of living near to Mika's Sports Bar. Thank you.'",
        "'speaker_0': 'Thank you so much. And just as a note, where is the actual applicant? Up here on the OC. So the applicant will go last and the applicant will have an opportunity as part of a hearing for a reasonable amount of time.'",
        "'speaker_0': 'So anywhere between five and 10 minutes for the applicant, but for public comment, let's get through that first. So please come forward.'",
        "'speaker_6': 'I. Good evening, counsel. My name is Steven Kirkpatrick. My problem is I have a neurological disease that affects my my muscles and my speech. So please be patient with me. I live two doors down from me cause I take many medications for my disease.'",
        "'speaker_6': 'And I've been told by my doctor to exercise, get plenty of rest, and protect myself from stress. My doctors say this stress will accelerate my disease. I got my doctor's tests. But Michael's PA has made this hard for me to avoid stress and get plenty of rest.'",
        "'speaker_6': 'I can't sleep because of loud disturbance of the patrons waking me up all through the night. Some. Sometimes, especially if there's an event at the bar. All of then all of the noise. Start a chain reaction with the dogs barking in my neighborhood.'",
        "'speaker_6': 'The loud music from the bar wakes me up even when I take medication or when I wear earplugs. How can I? How can I get away from the stress when I feel like the noisy parties in my home.'",
        "'speaker_6': 'This has been very stressful to keep. My health in check. Late, late, late one night has many, several Michaels patrons just to hold it down. When they when they woke me up, they didn't respond. I felt uncomfortable. Then I went back inside.'",
        "'speaker_6': 'The next morning, my last sprinklers were damage. More stress to me. My daughter has to park. Down the street one block when she visits me because the bar customers take up the parking in front of my house. I don't like.'",
        "'speaker_6': 'My daughter has to walk so far to her car at night just to visit me. I take care of my two grandkids after school, after school, when my daughter works three of those days. It bothers me that my grand kids were often hearing offensive language at the bar when they walked, when the patrons walked to the cars'",
        "'speaker_6': 'in front of my house. My grandkids sense that I'm distressed to me at times because of because of the bar. They don't enjoy visiting me anymore.'",
        "'speaker_0': 'And so you're going to get additional time. You know, you mentioned the issue, so please continue. Okay.'",
        "'speaker_6': 'Thank you so much. I appreciate it. Thank you. The bar is is a nightmare for me. And the stress is almost too much to bear. But it's important for me to be here to tell you that I don't just care for my health.'",
        "'speaker_6': 'I care from a neighborhood. But what you look like for your neighborhood, I think you would. I respectfully ask the council to deny any permits at this location. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Thank you. My name is regular person. My house is right behind the barn. I lived there for 15 years with my wife and kids. You know, I'm a local business owner for 20 years. My wife and I have been married for 23 years.'",
        "'speaker_8': 'We have a 20 year old girl, Northridge University. A 15 year old girl in Milliken High School. And a 12 year old boy, the Newcomb Academy. You know, Puerto Rican. But Long Beach has been my home for over 20 years.'",
        "'speaker_8': 'You know, we were a very, very blessed family. Living the American dream. And to me, skateboard came along. You know, I have a number of various I sent to Peter Ronco and Jason MacDonald with loud patron distributors on the street, some living, you know, they were arguing with each other, some blasting their sound system of their cars'",
        "'speaker_8': 'as they leave. Urinating in my yard in between parked cars, in the alleyways, even some having oral sex. We have all that on video. Loud screaming at 2 a.m. from bar staff, thanking their customers for coming for coming out.'",
        "'speaker_8': 'You know, I caught people urinating in my yard and I asked them to please go back inside the bar or go home. You know, some of them apologize and leave. But some of them are very aggressive attitude. You know, I've been told cats obscenities even by one of the owners, the bar owners, you know, telling me that'",
        "'speaker_8': 'she doesn't give an F and to call the police. I have all kinds of harassments. Loud knocking on my front door, screaming from the alleyway, you know. You know, daring me to call the police, you know, on my daughter's 15th birthday, hurting, saying, you know, we were home.'",
        "'speaker_8': 'Two of her friends, you know, the parents couldn't pick him up from from this alone. So as we open our front doors to walk him out, you know, the parents were picking him up. We saw a patron urinating into my yard.'",
        "'speaker_8': 'I told to go inside the bar. You know where he told me to go? You know, how's that for a quinceanera memory? But the worst part is the loud music comes from inside the bar, from their jukebox. You know, they have already have a violation sent by Daniel Phillips from the Health Department, who came to my house'",
        "'speaker_8': 'to monitor noise levels twice. You know, they're still an open case. When he came, it was a very quiet night. You know, my family and I, you know, have three different levels. We cannot live in our house. Please deny the permit.'",
        "'speaker_8': 'But if you are considered to be out of favor before I urge you to come to my house, there's always three sides to every story. You'll be the third one. I guarantee you that. If you come, you know you.'",
        "'speaker_8': 'Not only that, you will deny the permit. You will probably recommend to close the bar guarantee, see the lack of sleep, listening to my stress, my health, my house and my business. I have 11 ployees that the job is in jeopardy because I don't think I can keep up with the business and all this stress.'",
        "'speaker_8': 'I thank you for your time.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_1': 'Hi. My name is Tony at Cattleman's. I live four houses down from the bar. I moved into my home in 1987. I like that. It's a diverse neighborhood. Lots of pride of home ownership. I have a great neighborhood.'",
        "'speaker_1': 'I'm against this permit for a lot of reasons and I appreciate the time to tell you why. It's ironic that last week, as I was thinking about what to say tonight, my partner was on the phone calling the police because of a disturbance from Mika's bar patrons.'",
        "'speaker_1': 'That's what this boils down to. The peaceful enjoyment of our neighborhood has been gone since Migos opened its doors last year in January. Several neighbors and I spoke to the owner of Makos Bar Mzansi in February last year, just a month after the bar opened.'",
        "'speaker_1': 'There are already disturbances not only coming from the bar, but from her patrons who parked on her streets because there's inadequate parking at the bar. We thought we could work something out with her to improve the problem. She said, quote, She had no control over her patrons outside the bar and her advice was to call the police'",
        "'speaker_1': 'when our piece was being disturbed. So my neighbors and I took her advice. We call the police when her patrons were fighting in the street, when they were yelling loudly, going to their cars, one, two, three in the morning, waking us up.'",
        "'speaker_1': 'We call the police because of some lewd acts in front of our homes. When the music from the bar, especially the bass, was so loud, it shook our homes. You get the idea. Loss of sleep, lots of stress.'",
        "'speaker_1': 'The past year has been an emotional roller coaster ride of stress. We've worked hard with our neighborhood, with city departments, police nuisance abatement and others, all in an effort to get this bad business neighbor to fall. Follow just the basic ordinances set by the city.'",
        "'speaker_1': 'Stop disturbing the peace. That's a lot of city resources concentrated on one disruptive business. For the record, we're very appreciative of all the efforts that the city department certainly PD has put into this issue. There have been improvements regarding Migos disruptions in the neighborhood, but the disturbances haven't gone away.'",
        "'speaker_1': 'Please consider this from the beginning. Miss Yancey solution was to let the police handle her disruptions rather than working things out with the family neighborhood that she moved into. Mico Sports Lounge wants to expand itself into a nightclub with live entertainment to attract more patrons.'",
        "'speaker_1': 'Where are they going? To park. The location is not compatible with a long established family neighborhood setting, and the bar has an established history that it is not a good business neighbor. This is a neighborhood, not Hollywood. I want the peaceful enjoyment of my neighborhood back.'",
        "'speaker_1': 'Please don't reward make those bad behavior. Deny the request. Thank you.'",
        "'speaker_0': 'Thank you. That speaker, please.'",
        "'speaker_6': 'Good evening. My name is Dana Dedmon and I live on Main Avenue with a view of the Mico Sports Lounge parking lot for my living room. I fell in love with and purchased my beautiful home in 1989. I was young and to be honest, I didn't pay much attention to the fact that it was near a bar'",
        "'speaker_6': '. Thankfully, it turned out to be a quiet little neighborhood bar half the size that it is now. The prior owners of my house never disclosed that there were any issues.'",
        "'speaker_8': 'Stemming from the bar.'",
        "'speaker_6': 'I assume that's because there weren't any. Unfortunately, I am now experiencing all the michos related disturbances mentioned by my neighbors and friends. Although not my day job. I am a licensed real estate agent. I am trained to know.'",
        "'speaker_8': 'That if anyone affected by.'",
        "'speaker_6': 'The nuisances created by me goes were to sell a home and failed to disclose it on the transfer disclosure statement. It would be considered fraud. None of us want to sell our homes except maybe Rickey. But a buyer interested in purchasing one would most likely move on to other listings or cancel escrow after reading a truthful disclosure'",
        "'speaker_6': '. Or they might make an offer with a serious discount of, say, 50 to $100000. You've heard my neighbors stories and mine, but I'd like to comment a few things that haven't been covered. Number one, as I recall from conversations with nuisance control, conditions were imposed on vehicles that are not being adhered to.'",
        "'speaker_6': 'Music should be contained within the bar, but the bass is rattling our homes. The rear door was to remain closed except in emergencies, and people are still going in and out. The bar is to have security guards and they do.'",
        "'speaker_6': 'But they are clearly not effective and frequently add to the noise problem. They were to stop the loitering on Main Avenue and behind the bar. It is still continuing. Number two In a recent meeting with the bar owner, Selina and council member during his office asked the bar owner to reach out to the neighborhood.'",
        "'speaker_6': 'And that didn't happen. Last weekend, just days before this meeting. The bar produced noise and patron issues comparable to some of the worst, resulting in numerous calls to the police. This either demonstrates her inability inability to control her bar or her defiance of any restrictions imposed on her.'",
        "'speaker_6': 'Number three, a petition requesting denial of the entertainment permit was delivered to our councilman's office earlier.'",
        "'speaker_8': 'Today and submitted to the city.'",
        "'speaker_6': 'Clerk.'",
        "'speaker_5': 'Before the meeting.'",
        "'speaker_6': 'It is signed by over 80 people, mostly living within two blocks of the bar and every household in the 2500 block of Main Avenue. If a permanent entertainment permit were approved, I believe this would increase the noise and bad behavior stemming from Michael's further affecting enjoyment of our home health and prosperity, property values.'",
        "'speaker_6': 'I urge you to deny this permit. Thank you.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_1': 'I have a little breathing problem today, so if you'll bear with me, please.'",
        "'speaker_0': 'No problem.'",
        "'speaker_1': 'My name is Delores. Can you hear me?'",
        "'speaker_0': 'Delores, would you mind maybe speaking into that, Mike?'",
        "'speaker_2': 'This one? Yes.'",
        "'speaker_1': 'I thought that was okay. All right. We'll start now. Um. My name is Delores Williams I've lived in. Oh, I live for houses down from Michael's bar. I lived in my home for I've lived in my home for 28 years.'",
        "'speaker_1': 'I have the same nuisance complaints as my neighbors. However, I'd like to speak to the city about the nonconforming status of this location and how it contributes to the nuisance problems we are experiencing. Here's a little history about the property.'",
        "'speaker_1': 'The building was built in the late fifties in 1995. The city approved a permit to expand the bar to a pool hall. Not a not expand the bar, but to expand to a pool hall that doubled its size.'",
        "'speaker_1': 'With only 11 parking spaces. I believe it's a it's now a 3000 square foot building with a capacity load of 150. As my neighbors have said, Michaels has caused parking, congestion and noise generated by their customers. Parked on our streets at all hours, perhaps as this property was brought into compliance with city codes.'",
        "'speaker_1': 'Our neighborhood would be less impacted. With regards to the bathrooms. Are there enough toilets and urinals to accommodate 150 people? Again. This was built in 1959. Are the bathrooms ADA compliant as required by the city for properties offering entertainment?'",
        "'speaker_1': 'As you have heard, we have a big problem with bar customers urinating in public. They urinate in the streets, in the alleys and on our lawns. This behavior is offensive, unhealthy, and it's illegal. Perhaps if this property had better bathroom facilities.'",
        "'speaker_1': 'We would have fewer people relieving themself in public. Foremost is the difference between 1950 and the 21st century. It's technology. Please consider how digital surround sound can amplify the jukebox of today as compared to the jukebox of the fifties.'",
        "'speaker_1': 'In addition, and this is a big one. Social media and Internet access increases the owners ability to market to massive numbers of people within seconds. The city. The city has not recognized how unsuitable and obsolete this building is.'",
        "'speaker_0': 'Ma'am, I know you said you had a breathing issue, so I'm going to let you continue. Okay. Just to. Oh, no. I'm going to let you. I'm going to let you continue past the time. So.'",
        "'speaker_1': 'All right. Thank you very, very much.'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_2': 'And congratulations, by the way.'",
        "'speaker_0': 'Thank you, ma'am.'",
        "'speaker_1': 'So the city is not recognized as a small bar. It had little impact on the neighborhood as a small sports bar. The impact on the neighborhood has grown to an intolerable level, with live entertainment being packed can only be increased.'",
        "'speaker_1': 'And I'd like to say that I'm disappointed with the way the city has handled this nonconforming building that's 45 years old. This building was abandoned for one year, 30 days before Michaels moved in. That was a chance for the city to jump on it and make it conforming.'",
        "'speaker_1': 'We would not be here today. None of us. Miss Yancey wouldn't be suffering. We wouldn't be suffering. If you guys had been doing your duty. Thank you very much. And happy St Patrick's Day.'",
        "'speaker_0': 'Thank you, ma'am. Next speaker, sir.'",
        "'speaker_6': 'Hi. Good evening. Staff and council members. My name is Steve Duprey. I've been a resident of the Wrigley neighborhood for over 12 years. I also volunteer at the Peace Garden, founded by Dee Andrews at the Martin Luther King Park.'",
        "'speaker_6': 'The biggest issue we have here is the negative impacts on the neighborhood. We've we've got a conflict of interest where we've got a commercial district impacting a well-manicured, well-maintained residential neighborhood. We it's been a neighborhood where you didn't have the lock the doors.'",
        "'speaker_6': 'You didn't have to make sure your car was locked all the time. Can I have a brief show of hands of everyone who thinks there will be a negative impact that is in the neighborhood? Okay. Their concerns are increased crime, public urination, discarded liquor containers, numerous transient individuals drinking doing drugs in cars.'",
        "'speaker_6': 'And if this was on your block, this is not the neighborhood. You would feel safe with your children or to leave a door open. The police department has been overtaxed, responding to the numerous complaints and enforcing any kind of curfew, further taxes, city resources.'",
        "'speaker_6': 'So the people who raised their hands, those are the neighbors who have pride in their neighborhood and feel stressed and impacted. And when you look at the definition of entertainment with dancing by patrons and performers. It even raises a higher question of, you know.'",
        "'speaker_6': 'Of what further impacts are going to be on the neighborhood. Thank you.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_1': 'Good evening, Mayor Garcia and members of the City Council. My name is Joan Greenwood. I live at 2091 San Francisco Avenue and frequently pass by this establishment. Sometimes later at night that I would like. But I do. I am here speaking on behalf of our organization, the Wrigley Area Neighborhood Alliance.'",
        "'speaker_1': 'Our members have taken a vote following meetings and discussions and firmly stand behind the residents of the 2500 block of Main Avenue. I don't know why what they're saying tonight should surprise you, because it seems to me I've heard the residents of Belmont Shaw, I've heard the residents of downtown Long Beach say much the same as neighborhood'",
        "'speaker_1': 'bars. Restaurants suddenly have become clubs, nightclubs. I looked up the definition of a nightclub. A nightclub is a bar that serves more liquor than food. A nightclub requires a special federal license. Has the city checked to make sure they have that federal license?'",
        "'speaker_1': 'I believe the documentation says that they have complied with all local, state and federal licensing requirements. This is an expensive license to obtain. We would love Mrs. Monte's business to be successful and to be a successful Wrigley neighborhood place.'",
        "'speaker_1': 'But I look at what's happened since the downtown on Pine Avenue has become a hot club spot late at night. I work in the Security Pacific Bank building. And you know what my colleagues are telling me? They come back to work late at night and they're finding patrons of the club, the vault up on the second level'",
        "'speaker_1': ', drinking, loosening up and urinating. Maybe it's only 20% of the patrons that carry this behavior, but we see it. We saw it with the party busses. We're seeing it down. I see it in our parking garage, the auto part right over here in First Street.'",
        "'speaker_1': 'I went out one night leaving the office around 10:00 at night. There were six young men waiting to go clubbing, boozing it up, putting their bottles and glasses on someone's brand new white Prius, which I know was not theirs.'",
        "'speaker_1': 'There's the smell of vomit in the garage because before and after they drink, they vomit. They urinate. I'm sorry. Whether it's 20% or 10%. A nightclub does not belong in a residential neighborhood. You wouldn't let that happen any place out in the city.'",
        "'speaker_1': 'It's a bad, bad precedent to set to say that we can continue to grandfather in these activities that put a burden on the local residents and no benefits. Thank you.'",
        "'speaker_0': 'Thank you. Next, bigger plead.'",
        "'speaker_1': 'Good evening, Mayor, and members of the council. My name is Jill Hill and I have lived in the Wrigley area since 1995. I've been active in neighborhood association ever since then, ever since moving three months after I moved in.'",
        "'speaker_1': 'So I've seen a lot of things over the last 20 years and experienced a lot of stuff. And we have had an incident like this come up before, and you were not around at that time. This was about 1999, 2000.'",
        "'speaker_1': 'Our council member was regroup and ski and across the street. Then a few doors down was Showtime Sports Bar. I don't know if you remember anything from that day. Hopefully our council member. Durango remembers that they were applying for entertainment permit as well.'",
        "'speaker_1': 'Our council member at that time denied that permit because he listened to the residents of the neighborhood. The people that lived behind there had the same complaints that all these members that are here today are telling you, I'm not in support of this permit.'",
        "'speaker_1': 'The quality of life, everybody's neighborhood association is all.'",
        "'speaker_9': 'About quality of life.'",
        "'speaker_1': 'And we're no different than anybody else. We don't want to disrupt our long term neighbors that have been there the majority of their life. It's just not fair to them. I wish businesses success. I have a business. I've been a business owner for 30 years.'",
        "'speaker_1': 'But you know what? I'm a good business owner. I don't do things that hurt my neighbors. And in looking at some of these conditions, if this business has not done the right thing or been a good business partner up to this day, do you think that they will once you allow this permit to go through?'",
        "'speaker_1': 'I highly doubt it. And one other little fact that the officer who gave you some stats did not say is in the first six months that they were open, there were 60 calls that residents made about noise issues.'",
        "'speaker_1': 'So, please, I respectfully request that.'",
        "'speaker_4': 'You deny the permit. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_11': 'Good evening, John Dietsch, 3600 Pacific Avenue. But living Wrigley, I've never lived in Wrigley and I don't live near the sports bar. But for about 12 years, the late eighties, early nineties, I was a neighborhood association president in the lot through this neighborhood, and I enjoyed tremendous reciprocal support from the folks in Wrigley.'",
        "'speaker_11': 'I owe them. This is a minimum to come down and support these folks. Friends of longstanding. I know their trustworthiness. I know their credibility. Nobody's pulling your leg about what goes on there. I don't think there's anybody behind that rail it would tolerate this kind of activity.'",
        "'speaker_11': 'Within a block of your personal residence. One of the things that concerns me and I'm not just about this, but things in general is about enforcement. Enforcement of conditions, enforcement of a lot of different things in this sitting right now.'",
        "'speaker_11': 'When I was here a couple of weeks ago, I guess it was for agenda item 23 regarding the airport. SAT through the hearings regarding the permit application where somebody wanted the one of you wanted the food sales to always exceed the alcohol sales.'",
        "'speaker_11': 'Who enforces that?'",
        "'speaker_8': 'That is to the job. Does she have staff to do that? Do you supply, you know, time and talent to.'",
        "'speaker_11': 'Do that as the police department have orders to do that? I lived through that very issue where I have maintained a second residence in Comber, Georgia. Police chief and I were on the same page about how to bring forward a totally enforceable situation down there.'",
        "'speaker_11': 'Instead, there carpetbagging city attorney copied the Athens, Georgia ordinance. You just plagiarized it. It's absolutely, totally, 100% unenforceable. And also my personal observations. I go over there quite frequently at night and as recently as 23, 28 hours yesterday, there were patrons out on the street, on the sidewalk, on Willow.'",
        "'speaker_11': 'And I have been asked by certain folks, the police department or are you calling 911 when you see that? Well, first of all, I'm driving and you're not supposed to use a cell phone when you're driving. Secondly, 20 years ago, if I so much as mention this to anybody in the police department with one or more stars'",
        "'speaker_11': 'on this caller, there would have been an undercover vice people dispatched there to either confirm or deny my observations. And every time I made allegations like this. Vice people were under cover of ice, persons were dispatched and every time my observations were validated.'",
        "'speaker_11': 'So I would respectfully request that you. Denied this application. People have said it's out of control. It needs to be reined in as it is right now before any more generous permitting is given. Granted. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. And then I believe just just for the notes of the hearing, the last speaker on this list, that is the applicant, is that correct? Okay. So closing the speakers list with the applicant last.'",
        "'speaker_0': 'Please can't.'",
        "'speaker_3': 'Tornado. Renfroe I live within a few blocks of Michael Sports Lounge. I have supported Michael's Sports Lounge since it's opened last year. I am grateful and I acknowledge Michael's sports lounge for doing business in the Wrigley area as a loyal customer.'",
        "'speaker_3': 'The lounge has served multiple purposes for my friends, family and I. We have celebrated birthday parties, graduation, and it has become a place for after high school, athletic games and other school events. The occasional entertainment permit plays a great role in keeping us there, spending out money and providing a great alternative to going to Los Angeles in'",
        "'speaker_3': 'Hollywood. We can easily spend our money in other cities, but we choose to keep our money in the Wrigley District in which we reside and we work. In the in the area. I hope that you all will better position Mieko for greater exposure, marketability and support to maintain its long term success and growth in the Wrigley area'",
        "'speaker_3': '. And making a fair decision in I am for the bar.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay, thank you. Next speaker, please.'",
        "'speaker_4': 'Hello, everyone, I am to Michael Lewis. I'm part of sports. I'm out. From the first day. Like I said, we've been here a year now. We can judge from the past bar pretense. That's not fair. You should never be raised that never judge no one until you learn them yourself.'",
        "'speaker_4': 'Right. That's how we all raise. We are being judge from the previous bars. If everything is indicated that we're have been done, where are the police reports that all this has been failed, that we are a new set?'",
        "'speaker_4': 'Yes, we have again the calls because they are being losing calls because that's how they get their way in. But it's okay because we still try to be in compliance. So then we have our security guards all day outside.'",
        "'speaker_4': 'In the back, we have three security guards front door, inside and back. Sometimes these things can be, you know, uncontrollable, but it's not a forest. They walk up the street too long. We controlling our air. We try to give the respect.'",
        "'speaker_4': 'I'm in front of this because I have never been here before, so maybe I might be short of words and not be saying things right. But I feel that we need to be treated fair. Where? Give us a chance.'",
        "'speaker_4': 'You guys, judging on what was there 40 years ago, we just been here a year ago. So that bar there 40 years ago, was they from us being to make our Mico Sports Lounge today because we are being in compliance we do shut the door will sorry that if the delivery people come in and bring in our'",
        "'speaker_4': 'orders. Okay, well how can we keep the door shut if our orders can't be in here? Okay. Yes, it might be people outside being able to see, but that's not totally on us. But we do keep it in fair.'",
        "'speaker_4': 'But all I'm asking you guys just give us a chance because we're being judge what was there prior before us. That is chemical sports now because there's not the indicated in the police that we have been totally erroneous to this neighborhood bar.'",
        "'speaker_4': 'You know, and what I have to say.'",
        "'speaker_0': 'Thank you very much. Okay. Finally, we're going to have the applicant. So as part of the hearing, the applicant gets what's called a reasonable amount of time, which in this case, I'm not sure if we need more anywhere between five and 10 minutes.'",
        "'speaker_0': 'If you don't need that time, that's fine as well.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Okay. But please, please begin.'",
        "'speaker_4': 'My name is Didi Yancey. Demetrius Yancey, born and raised in Long Beach. Um, let me see. What. What state of California license take years. So, um, I decided to open a business. I came back to Long Beach to do a business.'",
        "'speaker_4': 'My mother was instrumental in starting the Martin Luther King Parade. She actually got the statue put up at King's Park. So, yes, I've been in Long Beach forever, all my life. My dad. Born and raised in North Carolina.'",
        "'speaker_4': 'We worked for the city for 33 years. So the thing about it is, did you laugh? You could come, go to North Carolina, start a business, have one in Sacramento. I want to come back home and start a business.'",
        "'speaker_4': 'I didn't know it was going to be all like this, but it is what it is. I'd like to thank the neighbors for coming out and saying wonderful stuff about me. You like that? And in my whole world, I have never cussed.'",
        "'speaker_4': 'I do not cuss at all. So for them to say, for this young man to say, I dropped the F-bomb. Never did that. You would ask any of my customers, do not cuss cause that probably what? I got kicked out of school.'",
        "'speaker_4': 'Never cussed again. How about that? So everything that they saying, like I said, what the police calls the service. It's natural. A lot of times we should look into it a little deeper. I did not tell them to call the police as an alternative.'",
        "'speaker_4': 'What I told them is. I'm trying to do the best that I can. I want to have the security guards walk the customers to their car. I have, um. We exit out in tears. We do last call, and we get a group out.'",
        "'speaker_4': 'Then we get another group out. And then we leave. We have been closed at probably for the last couple of months. We've been closed like about ten, 11:00. The ladies will do as well. We will get calls for service on days that we're shut.'",
        "'speaker_4': 'Just because these people have gone to the city and the city have given them the the power to say do calls for service, do calls for service that would help them that would help you to push them out.'",
        "'speaker_4': 'I've been told by a couple of these people here that you're not going to be here much longer. We're going to shut you down. I've had some of these people come to my customers in the parking lot. This young lady here, I guess this is her because a customer told me I'm out there getting ready to come'",
        "'speaker_4': 'in. She was asking me about the toilet stalls. You don't ever have to ask about the toilet stools. Come in and look at the toilet stools. Who had been on the outside? I welcome everybody to come in. I said my place could be used for whatever.'",
        "'speaker_4': 'We have had meetings in there. We've had repass this. We've had wedding receptions. We've had whatever you want. Fashion shows in the daytime is. I'm not there. It's just there for me almost right now. I want to say I think it's a black thing, but I'm not black.'",
        "'speaker_4': 'Hispanic. No.'",
        "'speaker_6': 'I'm sorry.'",
        "'speaker_4': 'But the thing about it is, whatever they're complaining about is that's that's not true. I have my log here where I have my security guards write down every time a police car for service has come. Each time a police calls for service has come, it always said nothing.'",
        "'speaker_4': 'Nobody. The police said nothing. I've had where the nuisance guy came out and talked to me. He said the young man said it was someone urinated in his yard. At 930, maybe ten, we went back, looked at the cameras.'",
        "'speaker_4': 'They said they urinated in the yard, dropped the F-bomb on him, then came back in the back door and sat in the bar. Man. The nuisance guy looked at the footage. Only people that we saw was this man dropping his family off in the front.'",
        "'speaker_4': 'There was no customers in the bar at all from 930 to 1030. So at what point do you keep giving them ammunition to fight me? When I'm showing you what's going on is not really what's happening. They're just looking for a reason to fight.'",
        "'speaker_4': 'So. And any way if they if if they have any problem. I've always told them make a come talk to me. I had this young man here call me and stated and some people out in front arguing, fighting in this truck.'",
        "'speaker_4': 'This lady she has on this is this. He's texting me on my phone. I said, okay, I'm I'm there. He didn't know I was there. I was sitting in a parking lot. He's describing what's going on that was not even there.'",
        "'speaker_4': 'And I was just like, wow, he's telling me somebody in front of his house is doing this, this and that, and it didn't even happen. So my thing is, we can't fabricate sometimes and it's okay. They don't want the bar there.'",
        "'speaker_4': 'I do. I want the body. That's why I bought the business. I would like, you know, two small business owners to have more say in the seventh District. I went to the meetings with the. Two associations. And what I got from them was they were upset about the Wrigley District because it was all $0.99 stores.'",
        "'speaker_6': 'Um.'",
        "'speaker_4': 'Mexican restaurants. And nasty cheese that nobody could go in. So if we trying to run businesses in the district, what kind of residents, ah, do we have that's supposed to be supporting us? That's talking about our own businesses.'",
        "'speaker_4': 'You know, they don't. They don't care anything about the small business owner. And that's okay because they like he said, he owned his own business. If I roll by in front of his business, sat out in front of it, taking pictures of it and everything, like he do me, what would that make me?'",
        "'speaker_4': 'A predator. Some type of predator. But my thing is, I am applying for a business entertainment permit because I don't want to have live entertainment partying and stuff like that. I just want to be in compliance in case we are in there dancing.'",
        "'speaker_4': 'We could say, yes, we have a permit and we're dancing and we're permitted. I work for the state of California and are licensed daycares, so I make sure they stay in compliance. I want to be in compliance since I applied for the entertainment license.'",
        "'speaker_4': 'I had that new park and I have pictures here of how the place used to look before I got there. The parking lot. We all got new pavement put down. The guy came by and cited me because I had the sign.'",
        "'speaker_4': 'The old sign fell off the wall and it had adhesive tape on the wall. He literally cited me because I needed to maintain the wall how it was additional. So I did. But my business partners next to me, they have graffiti on their walls and the same.'",
        "'speaker_4': 'Adhesive tape on the wall. Did they get cited? No, they did not. We all put new pavement down. I got a citation saying I needed a handicapped parking space. Nobody else in that whole business not got anything. That said, they need a handicapped parking space.'",
        "'speaker_4': 'So did I put it down? Yes, I did, because I'm trying to be in compliance. That's my whole thing. I don't have. Any problem talking with any of them. Like I told them, I'm more than open to go and talk to them.'",
        "'speaker_4': 'I went to the little daisy. Parade that they had. Not the parade, the daisy. Picnic when it was Martin Luther King's Day. On Martin Luther King's Day. They had a little gathering on Daisy in 19. I went out there, set out with my stuff and was introduce myself to them.'",
        "'speaker_4': 'So when they asked me, did I want to come out and talk to the neighbors again? No, I did not, because I already spoke with them and they already knew who I was. Those that really wanted to meet me, I put myself out there to them.'",
        "'speaker_4': 'So why should I have to start back over? Just so they could delay my entertainment. They know who I am. I put myself out there. So I don't know what else it is they want me to do. Do I have another hour to talk?'",
        "'speaker_0': 'No, just a reasonable amount of time. So I think. Oh, if you want to begin to maybe wrap up that your case.'",
        "'speaker_4': 'Okay. So my, my thing about it is I asked if I could, you know, really do this hearing because. Seven days a week. Entertainment stops at ten. There's no place in the world or anybody goes where you could go out and you have to stop Entertainment ten.'",
        "'speaker_4': 'You actually leave your house at ten. So my thing is, I'm just trying to compete. I'm not trying to have a live band. I'm trying to get a kitchen put in. So I wanted to have a little small SpaghettiOs.'",
        "'speaker_4': 'That's what I was trying to go for. But if not, I just have to be patient and wait. I want to do karaoke. That's what I want to do. And I want to have a deejay. I have one live band there.'",
        "'speaker_4': 'That's the time when the guy got the decibel levels. He said the sound was so loud. He came out there like I told him that Levels was 55. He got, what, 55.7? So my thing is I told them, how can I fix that?'",
        "'speaker_4': 'I told them I won't have any live bands. So what? That's it? What? Everything. They come to me with. I do it in compliance and I do try to stay in compliance. Everything they told me to do, I have done with no problem.'",
        "'speaker_4': 'No problem. And if you want to come see the toilets, there's more than enough toilets in here. And we are handicapped. Approved.'",
        "'speaker_6': 'Okay. Thank you very much.'",
        "'speaker_0': 'Thank you very much, ma'am. Okay. So the work, including the hearing, is now concluded and we're moving back to the council for deliberation. So I'm going to begin by turning this over to Councilmember Ranga, and then the council will go to a vote.'",
        "'speaker_10': 'Thank you, Mayor. Now, first of all, I want to thank all the neighborhoods, the other neighbors in the really area, those in Maine who are directly affected by this tour taking time to be out here this evening. There were a couple of other issues that that were brought up that I think I'd like to have staff refer'",
        "'speaker_10': 'to. One of them was the most last one regarding the noise levels. If I could have Mr. Nelson Kerr from the Environmental Services, you can please step up and give us a report on what you found in terms of the noise levels and when and how often and what did you find?'",
        "'speaker_6': 'Thank you, mayor, and members of the city council.'",
        "'speaker_8': 'I'm Nelson Clear. I function as the bureau manager for the Bureau of Environmental Health at the Health Department. And under that bureau is the NOI a community noise program. And I also serve as the community noise officer. The complaints that we received started in July.'",
        "'speaker_8': 'So I'll just go through a quick chronology for you. On July 2nd, we did respond to a complaint that we received. This is July 2nd of 2014. That resulted in a notification letter being sent to the owner of Nico's with a CC to the complaining party.'",
        "'speaker_8': 'This process is complaint driven. We received additional complaints which resulted in a scheduled noise measurement which we took on the weekend night of January 3rd. And at that time, it was about 1130, between 1130 and midnight. And there was no live music at that time.'",
        "'speaker_8': 'The background noise is very important. In this case, it was above what the normal noise thresholds are. It was at 56 decibels. We did get a measured level outside of Nico's at 52 to 54 decibels. And we did receive additional complaints after that.'",
        "'speaker_8': 'So there was no violation.'",
        "'speaker_6': 'There at that initial reading. The next reading we took.'",
        "'speaker_8': 'Was on January 17th, also a weekend night.'",
        "'speaker_6': 'And this was after 10:30 p.m.. And the background noise at that point was 54.7 decibels.'",
        "'speaker_8': 'We did create a new standard to accommodate that at 55 decibels, and we measured the sound outside of MCUs at 55.7 decibels, and that was a violation. We did issue a notice of violation to macOS Bar on January 29th.'",
        "'speaker_8': 'I would also like to point out that this is a logarithmic scale and if it's 55 is the standard and you're at 55.7, it's not just 0.7 above 55. This is an order of magnitude higher. This is a logarithmic scale similar to earthquakes or scales.'",
        "'speaker_8': 'So it's not just a little bit above it's a lot above the din. That in that where we stand now is, like I said, it's a complaint driven process. We have received additional complaints since then and we are in the process of scheduling in another reading.'",
        "'speaker_8': 'If we get another violation, we will have to refer the matter to the city prosecutor. That concludes my report.'",
        "'speaker_0': 'Thank you. Counsel Marie Ranga.'",
        "'speaker_10': 'Thank you, Mr. Kirk. I also want to add that we had a series of meetings with with Mr. Yancey regarding we had a large meeting with the staff there, and I shared with her the concerns that we had regarding not only the the loitering or the patrons going into neighborhoods, but also the noise levels, the the control'",
        "'speaker_10': 'of the back door. We also proposed some conditions. One being the ability to to shut down entertainment at 10:00. We asked her directly if she would be abided by that. She did not give us a response. The again, I want to thank the staff for their efforts in helping me, trying to determine what is the best route'",
        "'speaker_10': 'to take with this. I want to thank the neighbors for coming out and sharing their views. I also want to acknowledge that they're cooperative with us, including Ms.. Yancey, in meeting with my staff and with myself to try to work things out.'",
        "'speaker_10': 'But I am disheartened to come to the conclusion that as a representative of the really, really community and the entirety of a district, that I make the motion to deny the entertainment permit.'",
        "'speaker_0': 'Okay. Is there a second to the motion, please? Okay. There's been. Actually, it's okay. Council, can we count some of your anger? Can you make. Thank you. There's been a motion and a second counsel. Did you want to.'",
        "'speaker_13': 'Yes, I'd like to say a few words. You know, first of all, I'd like to thank everyone for coming out tonight and responding to this situation. I look at all of that. We look at languages as, you know, business friendly.'",
        "'speaker_13': 'And I'm actually Mr. Johnson, I know very well. I know the family. But the thing about it here, I'm just trying to find out where do we go from here? I mean, have we sat down as individuals and tried to speak with each other?'",
        "'speaker_13': 'I mean, we have businesses all over the city of Long Beach. Is it really that bad that we really can't sit down with each other and try to find a peaceful way of working with these individuals? You know, we can't and we just can't.'",
        "'speaker_13': 'But I think that in this situation, I'd like to know where do we go from here? If we deny this tonight, is that it? That they will never get another chance to be able to. Because I would just like to know and I would just really like for Mrs. Yancey and Michael's Bar that I really think that'",
        "'speaker_13': 'it's time for you guys to really kind of sit down and really come to some form of, you know, an understanding that if there's going to be one, yeah, you must respect the neighbors. That's anywhere. Not only just I mean, I mean in the streets, everywhere else you go, because people do really seriously, they want to have'",
        "'speaker_13': 'a peaceful, you know, be able to sleep at night. They want to be able to do this. They don't want to have to go through that. But I would just like to see us be able to maybe some might come to some form, you know, a conclusion that we can sit down and maybe come to some type'",
        "'speaker_13': 'of, you know, a better understanding with each other, because I'd like to see everybody's business thrive, but it is what it is. And I just would hope that, you know, we could get along, you know, as friendly neighbors.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_0': 'Thank you. But I'm going to go back to Councilmember Turanga and we're going to go to a vote. Oh, actually, did you know what, Councilman Price?'",
        "'speaker_3': 'I want to echo what councilman has just said. I think that's really important. I represent a district that has a lot of restaurants that are right alongside residential communities, Belmont Shore. And now we have some restaurants and establishments on Broadway.'",
        "'speaker_3': 'And this is an issue that comes up for us all the time. And one of the first things that I always look for is what efforts has the business owner made to try to mitigate and try to address the issues?'",
        "'speaker_3': 'So, you know, I'm with Councilman Andrews. I would hope that this wouldn't be the final step, that that maybe there would be some dialog down the road. But at this point, it seems like the situation is such that if things continue to go the way that you all think they're going to go, it's going to impact your'",
        "'speaker_3': 'quality of life in a negative way. And so we like to see, you know, in our office and I'm sure in all the offices, people come to the middle and do what they can and not be, you know, to be neighborly and be good community partners.'",
        "'speaker_3': 'And that's always what we're looking for when we have hearings like this.'",
        "'speaker_0': 'Thank you. And finally, Councilman Ringo.'",
        "'speaker_10': 'Before I continue my final final comments on this, I'd like perhaps the city attorney to describe next steps. What is the process from here on out in terms of what what is the meaning of this motion.'",
        "'speaker_12': 'Before you this evening? Is the application for the entertainment permit. If denied by the Council, pursuant to our municipal code, the owner of the establishment will be prohibited from reapplying for a one year period.'",
        "'speaker_10': 'Thank you. So basically what we have at this point is that we're going to have one year of a moratorium, if you will, of being able to provide any kind of entertainment in this establishment. But there is an opportunity as well to improve those relationships with the neighbors.'",
        "'speaker_10': 'It's beginning to hear. Okay. To make amends or to work with the community, to try to work with them, to come to a to a that's a center so that you can thrive in your business because we all want businesses to thrive.'",
        "'speaker_10': 'There's no question about that. We had a bad start. I would say that there's an opportunity to do a do over, start again, meet with the neighbors and speak with them. And and if there are some issues or concerns in the future, there's an opportunity to open that door and to have open and free discussions as to'",
        "'speaker_10': 'how they can be a. I think that what we're trying to do at this point is to address a current issue so that to bring it up to the forefront so that we can address them in the in the back.'",
        "'speaker_10': 'So I hope that this is an opportunity for you and for the poor, the neighbors, or those affected by the by the business to get together and work things out. So I'm hoping that this would be the beginning of a better relationship.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. And there's a motion on the floor to deny the entertainment permit that's before the council has a hearing. So, members, please go ahead and cast your vote.'",
        "'speaker_1': 'Motion carries seven zero.'",
        "'speaker_0': 'Motion denied. Thank you. We want to thank you all for for coming out tonight. And now we're going to be moving on. Real briefly, through the consent calendar, which is 210, item 12 and the record of public comment.'"
    ],
    "Moratorium and Study on Conditional Use Permit Exemptions for Alcohol Related Uses.": [
        "'speaker_0': 'Thank you. Now we're going to take 25 before moving on to the rest of the regular agenda.'",
        "'speaker_1': 'Item 25 Communication from Councilmember Richardson. Councilwoman Gonzalez. Councilmember, your UNGA recommendation to adopt the order declaring a moratorium against the issuance of a new exemptions from the SEAL requirement for alcohol related uses and direct the Department of Development Services and the Planning Commission to undertake a study pursuant to Longreach Municipal Code to determine whether or not the'",
        "'speaker_1': 'city's current zoning regulations related to SIP exemptions are appropriate or need further review and or modifications.'",
        "'speaker_0': 'Thank you. There's a motion by Councilmember Richardson. I'll turn it over to him. Which with the second by Councilwoman Gonzales.'",
        "'speaker_11': 'Thank you, Mr. Mayor. So. Currently the CFP process is one that enables us to bring in uses that might have an impact on our communities, such as alcohol, trucking, things like that, and provides a public avenue for folks to vet and evaluate those impacts in in the in year over the over years of having this contemporary process'",
        "'speaker_11': '. A number of exemptions to that process have come into place that have created sort of a patchwork of holes in this ACP process. So so although there are there are a number of exemptions that that might have made sense on a case by case basis.'",
        "'speaker_11': 'But my concern is that we haven't taken a holistic approach at these exemptions. For example, there's an exemption for a department store or florist that sells accessory sales of alcohol. So that would be an exemption if a florist were to sell hard alcohol, for example, that's exempted from our conditional use permit process to evaluate whether or not'",
        "'speaker_11': 'that that could potentially have an impact on the community. And the zoning code gives no specific explanation as to why these uses are not required to go through a public vetting process prior to commencing the sale of alcohol.'",
        "'speaker_11': 'And the code currently doesn't distinguish between the sale of beer and wine and the sale of hard alcohol, is there? Is there a specific difference between the two? So in my research and in speaking with the city manager and city attorney, I wasn't I wasn't comfortable with the explanation for these these exemptions as they are.'",
        "'speaker_11': 'And I'd like for us to take a look at these so that we have a fair, clean process on how we administer conditional use permit. Now, to be clear, there are a number of exemptions that make a lot of sense and that we utilize all the time.'",
        "'speaker_11': 'One of them one of them specifically is the one on on restaurants that serve food. That's an exemption that I'm not saying that we need to review. There's another one that's specifically related to grocery stores, specifically grocery stores.'",
        "'speaker_11': 'And that's something that my motion I'm asking that that not be included. What I'm talking about is everything else, all of these things. There are department stores, there are pharmacies and florists that have that are exempt from this process.'",
        "'speaker_11': 'And I want to hit the pause button on that exemption. For a period of three months so that our staff can take a look at it and come back with one comprehensive look at the entire exemption process. So the moratorium would be on all of those exemptions except for like grocery stores, like outright grocery stores and restaurants'",
        "'speaker_11': 'that serve food. The entire policy is under review, but the exemption is just for those two. So that is my motion.'",
        "'speaker_0': 'Okay. There's a motion and a second. Councilman Kanjorski, want to speak to your second?'",
        "'speaker_3': 'Thank you. I want to thank Councilman Rex Richardson for bringing this forward because I think it's a really good review to be able to look at. I think it's it's time that we give the process a little bit more in-depth of a review, and I think it's vital for certain communities.'",
        "'speaker_3': 'I know in the first and the ninth and some other communities that have been inundated with other issues related to violence, related to alcohol consumption, I think we just had, you know, the a good example here on our very first hearing and how it can affect the community so much.'",
        "'speaker_3': 'So I just want to thank the councilman for bringing this forward. And I look forward to the review and to see what it brings back to us and what we can do going forward.'",
        "'speaker_0': 'Thank you. Get him to go to the speakers list. Councilman Mongo.'",
        "'speaker_4': 'If I could ask city staff, I know that the trend is towards department stores that actually include grocery, for example. There are targets that sell. A large section of their store is actually for grocery. So what percentage of a store would need to sell grocery?'",
        "'speaker_4': 'And or are we saying that it's based on square footage of the store? Is it based on sales of the store because certain types of stores aren't going be able to spend? Maybe they spend 50% of their square footage on grocery, but the price of electronics far exceeds the price of grocery.'",
        "'speaker_4': 'And therefore the sales wouldn't support that in terms of counting of those grocery. So what what would you term as grocery?'",
        "'speaker_12': 'Councilwoman, I'm going to turn this over to our director of development services, Amy Bodak, who who's been working on this.'",
        "'speaker_1': 'Councilmember Mongo and City Council. That's clearly something that we're going to look at. But it's and there are other jurisdictions that have a higher threshold of exemption, as well as a lower threshold of exemption. But I think the issue that we're looking at is standalone grocery stores versus general merchandizing stores.'",
        "'speaker_3': 'That also carry groceries.'",
        "'speaker_1': 'So I think that's going to be the distinction that has blurred over time in our definition of a grocery store. There are certain grocery stores that are not able to get a CPA exemption because they're frankly too small.'",
        "'speaker_3': 'Our current regulations are at 20,000 square feet. So, for example, you know, a fresh and easy would be required to get a cup. They would not be allowed to get this exemption. So I think we need to do.'",
        "'speaker_1': 'Some work on the definition.'",
        "'speaker_3': 'Of grocery store as well as that square footage threshold.'",
        "'speaker_4': 'Great. Thank you.'",
        "'speaker_0': 'Thank you. I may go to the city attorney and then to Councilmember Andrews.'",
        "'speaker_12': 'Me or members of the council. Councilmember Richardson, I think if this were to pass this evening, as as the motion has been made, the moratorium would go into effect immediately. And I was wondering if the three months could be stretched to maybe four months, because since it goes into effect immediately, it'll be three meetings before the actual'",
        "'speaker_12': 'moratorium ordinance will come back to you and the study session two planning commission, etc..'",
        "'speaker_11': 'Sure. Just to be clear, the reason I said three months is I want this I don't want this moratorium in place just for the sake of having a moratorium. I want to allow you to do this review because I think it's important.'",
        "'speaker_11': 'And the sooner we get this completed, the sooner we can remove that moratorium. So if you if if you guys are comfortable with four months, I'm okay with former.'",
        "'speaker_13': 'Yes. Thank you. Yeah. Councilman Richardson, I think this is an excellent idea because the fact that first I was a little concerned because especially when you all of a sudden you are exempt the grocery stores because of fact, I think everyone that does not have a grocery store in their area, I'm sure that they would love to'",
        "'speaker_13': 'get one. And by you doing what you just did, I think this would be a great idea, at least gives them a possibility and understand that they could come into those neighborhoods and knowing that they wouldn't be penalized because of, you know, the liquor situation being a grocery store.'",
        "'speaker_13': 'So thank you very much for bringing this item to the board.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_4': 'I'd actually like to ask a question of one of my colleagues on the council. It. There are often times where we can research things while the status quo is in place. I know that in other cases we've put moratoriums on and I don't know that I heard that the city staff was asking for it.'",
        "'speaker_4': 'But I know that Vice Mayor Lowenthal has done moratoriums in the past to do study sessions. Is there a significant benefit to doing the moratorium, or would we be able to maintain the status quo while still doing the research?'",
        "'speaker_9': 'So just purely from my experience in issues that we've dealt with and brought forward, the moratorium has been helpful because then there isn't a flood of applications, flood of activity. There isn't an attempt to game. The system in that short time period.'",
        "'speaker_9': 'And not to say that that would happen, but it does obviate the possibility of that happening. So I found it to be helpful, but that's purely from our experience.'",
        "'speaker_4': 'I'm from city staff. How many requests do we have pending that would be put on hold? Should we move with this tonight? How many businesses would be impacted that are currently in the that we know are coming forward with this?'",
        "'speaker_1': 'Right now, we have no applications on file that I'm aware of as of yesterday that would be pending. But there is an expectation of probably two coming in the next six months or so. And would they.'",
        "'speaker_4': 'Be exempt to the moratorium based on the conditions set forth by Councilmember Richardson?'",
        "'speaker_1': 'Would they be exempt from the moratorium? No, they would not be.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Okay. Thank you, Councilmember Austin.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I'd just like to thank Councilmember Richardson and Gonzales for bringing this forward. As you know, particularly in North Long Beach, the issue of over proliferation of liquor stores and liquor is is has been an issue.'",
        "'speaker_5': 'And, you know, we tried to address that by bringing forth the alcohol nuisance abatement order, which has been largely successful. And we did so out of response to our constituents, our constituents who are saying that there are too many liquor stores and liquor is too accessible in North Long Beach.'",
        "'speaker_5': 'And so this moratorium, I think, allows us in last hour to kind of recalibrate our our position and and allows us this council to take a more active role and take a closer look at such licenses. I want to say that that I do do appreciate the fact that you have exempted the grocery stores, because I think'",
        "'speaker_5': 'that that is a it's an obvious that, you know, you you can you can you can buy liquor in a grocery store. But, you know, you can also go there and get healthy food options like food, fruits and vegetables and and other household needs for for for consumption.'",
        "'speaker_5': 'And so it just makes sense and it makes it very convenient for for residents to do that. And so with that, I'll be supporting this motion.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Councilman Mango Councilmember Austin, would you be open to taking. Oh, you're not on the amendment, but perhaps coming together on a substitute motion that really goes to what you said, which is to to exempt all organizations that may bring forth a request that have healthy food choices available to them in their store.'",
        "'speaker_4': 'I mean, while I recognize grocery stores. Primarily sell grocery. They also sell office supplies and other things. Would you be open to the idea of exempting everyone who sells grocery?'",
        "'speaker_5': 'I don't think it's up to me to be open to the idea. I think we have three council members who have made a motion.'",
        "'speaker_4': 'I was asking if you'd support a substitute motion.'",
        "'speaker_5': 'I think you should. I like. I like the.'",
        "'speaker_4': 'I originally thought you'd made the motion when I started my sentence, so maybe I can go back on.'",
        "'speaker_5': 'I didn't make the motion. I, I, I was speaking in support of the existing motions.'",
        "'speaker_4': 'Councilmember Richardson, would you be open to that friendly amendment?'",
        "'speaker_11': 'I think what this does is and so my answer is no, because I think the entire policy is going to get a good work over by city staff and like we want to be intentional about like we're hitting the pause button if we say.'",
        "'speaker_11': 'No one's included in the in the moratorium. Then what's the point of having the moratorium?'",
        "'speaker_4': 'Well, you have some exemptions already. Why would it change for the percentage of grocery they sell?'",
        "'speaker_11': 'I don't know that like. I think there's a logical argument to a restaurant with food, right. There's a there's a number of restaurants ongoing that are located in the city. But I just can't, like, think about a florist that would need to sell.'",
        "'speaker_11': 'Gray Goose. I don't understand that.'",
        "'speaker_4': 'So let me help you with that. Actually, my family used to own a basket company, and we used to sell to florists. And so graduation is coming. And upon graduation from colleges and universities, oftentimes with your bottle of champagne, along.'",
        "'speaker_11': 'With an issue, there's no distinction between a hard alcohol and a soft. I've been doing a lot of research and talking about this. I would say I. I support my motion in its current form, but I'd love to continue the conversation.'",
        "'speaker_11': 'Our city staff is is evaluating this.'",
        "'speaker_4': 'I just want to warn my colleagues that I have concerns for sales in the coming months because of a moratorium, specifically the only category. Well, there's one category that's artificially inflated, but with the exception of the one category that's artificially inflated, the only other category by which we meet our sales tax revenue percentages without leakage is is'",
        "'speaker_4': 'liquor. And so we are going into tough budget and economic times. And so while I appreciate that, we do need to look at this and I think that it needs a very serious look. I also am concerned about the viability of some of the flower shops that have contracts with one 800 flowers or FTD or any of'",
        "'speaker_4': 'these organizations. People want to send out graduation things. May is coming. There are wedding gifts that come with balloons that are tied to champagne bottles and the such. And I just don't want to have a disadvantage to our Long Beach stores that have national contracts because of a short term moratorium.'",
        "'speaker_4': 'And so I would hope that we could look at the ordinance without burdening our grocery stores and our flower shops that have not. I have not heard a complaint yet about the matter. And that does not mean that it's not.'",
        "'speaker_4': 'Broken. There are still things to look at, but I would hope that we wouldn't put ourselves in a fiscal standing like that. To look at a lot. I think that as we look at it, if we find certain categories that we want a moratorium on any given Tuesday, we could bring them here.'",
        "'speaker_4': 'So because of that, I won't be supporting the current motion, but would be open to any of my colleagues putting in a substitute that had a little bit more fiscal.'",
        "'speaker_11': 'Concern in council member. I think the residents of North Long Beach in areas with significant impacts from liquor would have wished the city council would have hit the pause button many, many years ago.'",
        "'speaker_0': 'Okay. I'm going to the speaker's list. Councilman Gonzales.'",
        "'speaker_3': 'I would also agree that, you know, I think when we're looking at this, I don't think it's to be anti-business. I think it's to be pro our residents and also looking at what's best for them versus just looking at it more in a fiscal lens.'",
        "'speaker_3': 'And so I think that when we look at this, it's really for the impact of our communities. And so I would certainly support the the policy. But I would also ask I just want to ask Amy really quickly.'",
        "'speaker_3': 'So we have a couple of things we're going to be scrutinizing a little bit deeper in this. So the definition of a grocery store and what were the other did you had mentioned something else.'",
        "'speaker_1': 'Certainly over time, as Councilmember Richardson said, there has been a blurring of lines between a general merchandizing store like a target and a grocery store.'",
        "'speaker_3': 'And even the the definition of a grocery store has changed as.'",
        "'speaker_1': 'Smaller format neighborhood markets.'",
        "'speaker_3': 'Have come into play. So we do really need to look at the overall definition of what a grocery store is versus a department.'",
        "'speaker_1': 'Store versus a general merchandizing store.'",
        "'speaker_3': 'And then really try to determine what square footage is we.'",
        "'speaker_1': 'Should be using in applying.'",
        "'speaker_3': 'These exemptions. We are assuming that that there would be a willingness by the Council to support.'",
        "'speaker_1': 'Some exemptions for.'",
        "'speaker_3': 'Those uses.'",
        "'speaker_1': 'We're just going to try to have to find that sweet spot for you.'",
        "'speaker_3': 'Thank you for the clarification.'",
        "'speaker_0': 'Thank you. Councilwoman Pryce.'",
        "'speaker_3': 'Thank you. Miss Bolduc, what response would you have, if any, to some of Councilmember Councilwoman Mango's concerns regarding this impacting some of the smaller alcohol vendors that might have general merchandizing attached to them? And is there something that you might be able to recommend that would hit the spirit of this agenda item, but not impact those businesses'",
        "'speaker_1': '? Well, those businesses are already in place, and so they are not actually impacted by this exemption at all. The folks that would be impacted by this ordinance or.'",
        "'speaker_3': 'Moratorium would be those who are planning.'",
        "'speaker_1': 'To come into into the the.'",
        "'speaker_4': 'City.'",
        "'speaker_3': 'We know of of two that would fit into the general grocery.'",
        "'speaker_1': 'Store category. We're not aware of.'",
        "'speaker_3': 'Any florists that.'",
        "'speaker_1': 'Are coming in.'",
        "'speaker_3': 'But we we would have had quite a.'",
        "'speaker_1': 'Number of concerns if the restaurants were not excluded from the moratorium.'",
        "'speaker_3': 'You know, that would have a debilitating.'",
        "'speaker_1': 'Effect on business districts. But since the current motion, as it currently stands, does not affect restaurants, we're we're pretty comfortable with the the recommendations.'",
        "'speaker_3': 'So it doesn't affect restaurants. And we're not going to do an exemption for grocery stores. So we're good to go.'",
        "'speaker_1': 'It does not affect restaurants, and we are not exempting any grocery store that currently exists.'",
        "'speaker_3': 'That is less than 20,000 square feet.'",
        "'speaker_1': 'Already has to get a copy no matter what. So we are aware of a couple of those that are coming in. They are not affected by the moratorium because they are less than.'",
        "'speaker_3': '20,000 square feet.'",
        "'speaker_0': 'Councilmember Richardson.'",
        "'speaker_11': 'And I just wanted to just underscore that point again, and I think Ms.. Bodak nailed it. Existing flaws, like, let's say Valentine's Day was coming up, those guys would not be impacted. It's literally a very narrow window of.'",
        "'speaker_11': 'This is in case this is so that we can hold off, hit the pause button and look at the whole policy in entirety. And we can say with certainty who gets exempt? Why is it based on square footage?'",
        "'speaker_11': 'Is it based on a percentage of sales? What is it? This is an opportunity to do that. But no one currently in existence is impacting.'",
        "'speaker_0': 'Okay. Thank you. And Councilman Mongo. Then we're going to a vote.'",
        "'speaker_4': 'Amy, with the two that are in the hopper, be able to apply now and then be approved upon the the conclusion of this. So I know went from three months to four months. So would they be able to apply and then wait in pending so that at the four month mark they could go through with their approvals'",
        "'speaker_1': '? Certainly we would accept the application. We would look at the rest of their application, but would not move forward at.'",
        "'speaker_3': 'All with any portion of their application that involved this.'",
        "'speaker_4': 'Exemption. That makes me more comfortable. Thank you.'",
        "'speaker_0': 'Okay. There's a motion on the floor. Any public comment on the item? Please come forward.'",
        "'speaker_6': 'Good evening, mayor and council members. My name is Rick Guyton. I'm a representative of the United Food and Commercial Workers Local 324. We represent 24,000 men and women who work in the food and drug industry. And I just want to I'm here on behalf of my members who support this moratorium.'",
        "'speaker_6': 'We work in grocery stores, and they also live in the community. We see so many of the communities that our members live in where the communities far exceed the permits given out. And it's it's a real tragedy to see what's happening in our communities.'",
        "'speaker_6': 'This is a responsible thing for this council to do to go take this moratorium, look at what exists currently, what makes sense going forward. I know our members support it and we applaud this council for taking this action.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Rick. Any of the public comment. Seeing none. Members, please go ahead and cast your vote.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Next item.'"
    ],
    "Contract and Appropriations for the 2014 Urban Area Security Initiatives Grant.": [
        "'speaker_1': 'Item 14 Report from Disaster Preparedness and Emergency Communications, Fire, Health and Human Resources and Police recommendation to execute a contract with the City of Los Angeles to receive and expand Department of Human I'm sorry. Department of Homeland Security Grant Fund for 2014.'",
        "'speaker_1': 'Urban Area Security Initiative Grant in the amount not to exceed 5,489,000 and increase and increase appropriations in the General Grant Fund in the Department of Disaster Preparedness and Emergency Communications. Fire. Health and Human Resources. Human Services and Police and Fire.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'There's been a motion in a second by Austin and Andrews. Any public comment? Please come forward.'",
        "'speaker_8': 'Very good you suggest. We're talking about sizable sums of money here. And given the recent release of information from the wallet report that. Essentially says that Long Beach is has the second worst management in the country. I think it makes sense to ask for a amend this request and ask for a dollar amount sufficient.'",
        "'speaker_8': 'So the city can hire. A master. To oversee. The management of the city for at least the next six months. To make sure this money is well spent. I think the message will not be lost on the federal authorities.'",
        "'speaker_8': 'They don't like wasting money. And to, on its face, turn over large amounts of money. Where you've got malfeasance management. Even if we were the fourth worst in the country. It's a good business decision to. For them to hedge their bet.'",
        "'speaker_8': 'You can make the case. I think we should be able to get a good master for this city if we pay them at least. The same is where we are now. Blowing in the wind when we pay our city manager.'",
        "'speaker_8': 'Although quite frankly, I think I'd be willing to spend a little bit more. To get more confidence. So it makes sense. And I would hope this is a council. It it's not going to cost you anything to ask for it.'",
        "'speaker_8': 'The least they can say is no. And it will instill in them a little bit of confidence to say it will. Jesus, at least these people recognize they have a problem. It's not that they don't know. All right.'",
        "'speaker_8': 'They recognize they have a problem. They're in a quandary. How to fix it. And maybe with these additional funds. We can fix that problem faster than the projected date that I see is now is probably August or September.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Any other public comment? CNN members, please cast your vote.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Next item 16.'"
    ],
    "Youth Jobs Program Funding Agreement with County of Los Angeles.": [
        "'speaker_1': 'Item six Report from Human Resources Recommendation to execute all documents with the County of Los Angeles to receive 380,000 to operate a youth job program citywide.'",
        "'speaker_0': 'There's been a motion in a second by Andrews and Durango. Councilmember Andrews.'",
        "'speaker_13': 'Thank you, Mayor. This is a great often for the Los Angeles Board of Supervisors, and I truly appreciate an excellent and Eric Serrano and the Pacific Gateway. You know as well as I also you don't want those involved in getting their funds to our youth for job programs, which, you know, it's very important, you know, as a'",
        "'speaker_13': 'teacher and sometimes, you know, interacting with a Long Beach youth every day. And I cannot express how important programs like this contribute to the well-being of our youth. You know, I'm truly committed and support this item and any other item that can create jobs for our young residents.'",
        "'speaker_13': 'Like I said before, jobs really can stop a bullet. Thank you very much.'",
        "'speaker_0': 'Thank you. So, you know, public comment and public comment, please cast your vote.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Next item.'"
    ],
    "Use Agreement with Los Angeles County Flood Control District for Wrigley Greenbelt. ": [
        "'speaker_1': 'Item 17 Reports from Parks, Recreation and Marine. Recommendation to execute a use agreement with the Los Angeles County Flood Control District for the construction, maintenance and operation of Wrigley Greenbelt District seven.'",
        "'speaker_0': 'There's been a motion by Councilmember Turanga and Councilor Andrew that Councilmember Frank is going to be the first of that motion. And then Councilmember Andrews, any public comment saying that, please cast your vote. Oh, Councilman Franco, did you want to comment, please?'",
        "'speaker_10': 'Thank you, Barry, because remember, Andrew's has quick fingers. Is the happy feet. First of all, I want to say thank you to the Parks Recreation Department and the Public Works Department for working on this project that the community is very excited by what's happening here to include walking paths, vistas and other enhancements.'",
        "'speaker_10': 'And obviously, I also want to thank our partners in the L.A. County Department of Parks Recreation as well. Thank you.'",
        "'speaker_0': 'Thank you. There's been a motion and a second by Councilmember Ranga and Councilor Andrews. Please cast your votes.'",
        "'speaker_1': 'Councilwoman. Motion carries eight zero.'",
        "'speaker_0': 'Next item.'"
    ],
    "Alamitos Bay Marina Rebuild Project: Contract Amendments, Loan Acceptance and Appropriation Increase.": [
        "'speaker_1': 'Item 18 Report from Parks, Recreation and Marine and Financial Management. Recommendation to execute these the 10th Amendment to contract with Bellingham Marine Industries for Phase six and seven. Of the Alamitos Bay Marina Rebuild project for a revised contract amount not to exceed 66 million.'",
        "'speaker_1': 'Execute the Second Amendment agreement with concept Marine Associates for a total amount not to exceed 6,573,000. Execute all necessary necessary to complete phases six and seven include the Harbor and watercraft revolving fund loan of 16 million and increase appropriations in the Park, Recreation and Marine Department by 17 million.'",
        "'speaker_1': 'District three.'",
        "'speaker_0': 'Thank you. There's been a motion by Councilman Price and a second by Councilmember Austin. Councilwoman Price.'",
        "'speaker_3': 'I wanted to get a staff report first and then I was going to make some comments regarding what a wonderful job our staff is doing on this.'",
        "'speaker_0': 'Absolutely. Mr. West.'",
        "'speaker_12': 'Thank you, Councilmember. Mayor. We are very, very excited to bring forward to tonight based on two and three with the opportunity to complete the work in the Alameda Space Marina. The people behind me have done a lot of work in this.'",
        "'speaker_12': 'Our Marine bureau manager, Vito Halloran, as well as our Parks and Rec director and Marine Director George Champion and our finance director, John GROSS. So I'm going to turn it over to George for the quick staff report.'",
        "'speaker_8': 'Thank you, Mayor.'",
        "'speaker_11': 'And members of the city council and city manager. I'm going to turn this over to Leader Hallinan, who's been doing a lot of work, and I'd like her to do the presentation on this. She'll give you a brief background on what's been done so far.'",
        "'speaker_1': 'If I can give you a quick background on what's been done so far. So far we've rebuilt Basin one, five and four. Right now we're in the process of last April you approved a portion of Basin two and that includes 160 slips.'",
        "'speaker_1': 'What we're proposing to do now is the rest of the basin to add a portion of dredging in Basin three. What this will accomplish is it will accomplish us allowing us to to dredge more of what needs to be dredged within the permit expiration date of our dredging permit.'",
        "'speaker_1': 'And it will. We are in the process of relocating 293 vessels that will come back into basin to basin to at the completion will have 515 vessels and that will only leave us with the completion of Basin three, six and seven.'",
        "'speaker_1': 'So what you see before you is a deeper loan that we received in November for the completion of Basin two. And then you also see before you the funding that we that we need from our fund balance in order to do the dredging for Basin three, in order to accomplish what we need to accomplish.'",
        "'speaker_0': 'Thank you, gentlemen.'",
        "'speaker_3': 'Thank you. I want to start by commending our city staff, especially Olivia Hallinan. She is amazing and I know firsthand the incredible amount of work that she puts into making sure that the boat owners are kept apprized of the developments of the construction and that she's responsive to the needs of the the very large group of boat'",
        "'speaker_3': 'owners that we have active in our community. So I want to I want to thank you for giving a personal touch to the residents and the boat owners in our community. It really it means a lot to me, and I know it means a lot to my residents as well.'",
        "'speaker_3': 'So thank you for that. And then I want to thank John GROSS for a moment, too, because I'm going to ask him a question in a minute. But staff has done an incredible job at trying to be creative with funding sources for this major project, and that's especially appreciated at a time when we are facing some serious'",
        "'speaker_3': 'constraints on the available moneys that we have to work on projects in the Tidelands area and the loan as an example of some of the creative work done by our staff, our Parks Rec and Marine Department and trying to bring some revenue, some money source to these projects to complete Basin two and to complete the dredging in'",
        "'speaker_3': 'Basin three. So I appreciate that. I want to ask Mr. GROSS for an update on the the possibility, the bond possibility that we've discussed and see if you can give us an update in terms of what the future looks like for us in that regard, especially in regards to the necessary completion of basins three, six and seven'",
        "'speaker_8': '. Thank you. We are working as a team and that's what it takes to get this done between the two departments, parks and Financial Management. At this point, with the lack of low oil revenues, we have turned our attention to see if a bond issue supported by the Marina Fund and not using any additional tidelands funds may be'",
        "'speaker_8': 'available to complete the water site. Improvements for the ABM rebuild as of today. We work on it every day and we are continuing to move on a potential bond issue that will, if we can sell it, if it will work out, we'll complete the rest of the water site improvements with a single additional financial transaction, a bond'",
        "'speaker_8': 'issue not requiring any additional tidelands money. We do not know yet whether we will be successful. We will know that over the next few months. But we're hopeful that we will be able to complete financing of the ABM, rebuild water site improvements with a additional bond issue supported by the Marina Fund and slip these.'",
        "'speaker_3': 'And would you be expecting that as soon as you know that you would bring that information to council? Because that is going to impact our prioritizing of Tidelands dollars, given the criteria that we've already approved as a council because of the public safety issues associated with the current docks at this.'",
        "'speaker_8': 'Yes, we will. But I think it's important to say that at this at this stage, we believe that the that financing appears to be viable. I can tell you that we actually won't know till we sell the bonds, and that will be after we come back to council as soon as we can for permission to try to'",
        "'speaker_8': 'sell the bonds. And that's when we know we'll know whether we will be successful. At this point, we are very hopeful so that we anticipate coming back in the next several months.'",
        "'speaker_3': 'Thank you very much. I'll be moving to approve this item, and I thank you again for your work.'",
        "'speaker_12': 'Mr. Mayor and council members, I also want to recognize Mr. Jerry in the audience. The chairman of the Green Advisory Board has been very, very helpful and instrumental in this as well.'",
        "'speaker_0': 'Thank you. And thanks again for everyone, for all their hard work. Is there any public comment on the item? Good to hear.'",
        "'speaker_8': 'Very good, Hugh Clark as the address as well as follow this. Project since its inception. I joined with the Council Third District in their praise of the. Director of Parks, Recreation, Marine, and particularly the Marine bureau manager. Had she been aboard when this started, we wouldn't be here tonight discussing it.'",
        "'speaker_8': 'It would already be finished. Period. Having said that, I want to make sure a couple of things are a couple of things. First of all, in terms of the bond rating that we're going after, I again suggest that we would inherently intensify the propensity of getting a better bond rate if we were able to demonstrate.'",
        "'speaker_8': 'That though we may be the second worst managed city in the country. We have recognized our problems. And that we have spent the dollars amounts sufficient to hire a federal master to oversee the city. Until we have at least this project completed and or the new mayor and possibly a new city manager in place.'",
        "'speaker_8': 'Second of all, I want to get into I attended the last planning commission of the Marine Advisory Commission meeting, and I listened to the very good explanations. One of the things I want to make sure of, and I have no question relative to the integrity of the Parks Department or the manager or the Marine Bureau, I do'",
        "'speaker_8': 'have serious concerns relative to the integrity of the Tidelands Group and the city manager. I want to make sure that any monies, particularly contingent funds, do not suddenly are not suddenly swept away and used for projects within the Tidelands area.'",
        "'speaker_8': 'And I'm specific and concerned about the Leeway Center based upon the information a part of that MCC meeting. The dock may be repaired, but there's nothing going to. The existing structure will remain as it is. There will be no molestation of that at all.'",
        "'speaker_8': 'When time comes, that will come under review again. However, I want to make sure that there's no money quietly siphoned off. To undertake that project using the same logic that was used to fund other projects. Well, it was approved in a general budget without any specifics.'",
        "'speaker_8': 'So I want to make sure I'm going to put my foot on the neck of that and watch that. But I really do think it makes sense. To hire that, use those moneys, hire that federal math master to over city, over see the city.'",
        "'speaker_8': 'And we could possibly get an even lower rate than we think we get. Now, what would they be able to get now is just good business sense to not do it. It's sort of dumb, in my view. Thank you.'",
        "'speaker_0': 'Thank you. The main motion and second, no other public comment. Please cast your votes.'",
        "'speaker_1': 'Motion carries eight zero unanimously.'",
        "'speaker_0': 'Thank you. Next item.'",
        "'speaker_1': 'Item 19 Report from police recommendation to receive and file the application of Potholder Cafe for an original application. Application of an ABC license at 2246 Lakewood Boulevard District four.'"
    ],
    "Ordinance Amendment on Dog Beach Regulations. (District 3)": [
        "'speaker_1': 'Item 23 report from Parks, Recreation and Marine. Item 22 recommendation to declare ordinance amending the Long Beach Municipal Code related to the dog exercise area on the beach. Read the first time and lead over to the next regular meeting of the City Council for Final Reading District three.'",
        "'speaker_0': 'There's. Let me. Let me. Let's go off the motion real quick. Hold on a second. Okay. Okay. As a catch one price. You want to make the motion? Okay. I'm gonna turn this over to staff just for a brief report.'",
        "'speaker_12': 'George Chapman.'",
        "'speaker_11': 'Thank you, mayor council members.'",
        "'speaker_8': 'This is an area of the dog beach that was expanded recently from 2.9 acres to 4.1 acres. We did have a permit before from the Coastal Commission for this area. This would just update that permit to include the entire area of the 4.9 acres.'",
        "'speaker_8': 'So it was a recent increase.'",
        "'speaker_11': 'In the size of the dog area. And so we'll also be putting some delineate in that dog area that some art pieces that we should be installing fairly soon in the dog beach area.'",
        "'speaker_0': 'Thank you. Councilman Pryce.'",
        "'speaker_3': 'Q I want to thank the staff. This is a very exciting project for us. We love having a dog beach. Our residents really enjoy having the opportunity to be able to have a space that they can take their dogs to because otherwise they would not be able to have their dogs on the beach.'",
        "'speaker_3': 'So the fact that we are putting some resource and thought into this particular service for the residents of the city of Long Beach and also visitors is very exciting. I want to thank the Parks Rec and Marine staff for working on this project.'",
        "'speaker_3': 'I know this is an item that we talk about at our monthly meetings and I'm glad to see that it's moving forward. So thank you.'",
        "'speaker_0': 'Thank you. And this is also my my dog's favorite place probably in the city is the dog beach. So love it. Any public comment?'",
        "'speaker_8': 'Please come forward. Very good. You click as it has two items on first of all. I'm dead set. I think it makes absolutely no sense to spend money on art. Work down in an area like that would simply get graffitied over in trash, period.'",
        "'speaker_8': 'There's no. Oh. What has to do is look at the look at the underside or look at any building along the along the bike path or the underside of the Belmont Pier. And you'll see how destructive it is of graffiti lady.'",
        "'speaker_8': 'A leading it is on the demarcations, I suppose I suggested to the county meeting. I think that best it. Would not cost that much money to mark it off. But just simply put tube made maybe out of styrofoam and a rubber large fire hydrants.'",
        "'speaker_8': 'What better for and for marking a dog park period clearly recognizable by the dogs.'",
        "'speaker_0': 'Thank you. Okay, thank you. And the other public comment saying none. Please cast your vote.'",
        "'speaker_1': 'Motion carries eight zero 23. Item 23 Communication from City Attorney Recommendation to Declare Ordinance Establishing a Small Business Recruitment, Retention and Growth Pilot Program Read and adopted as read citywide.'"
    ],
    "Ordinance on Animal Regulation Amendments.": [
        "'speaker_1': 'Councilwoman Mango. Motion carries eight zero 24. Item 24 Report from Parks, Recreation and Marine and the City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code related to animal regulation read and adopted as read citywide.'",
        "'speaker_0': 'Thank you. There's been a motion and the second vice mayor Lowenthal.'",
        "'speaker_9': 'Thank you, Mr. Mayor. I wanted to ask Mr. Stephens a question. We've had some further conversations with stakeholders, and there's a clarification I'd like to ask regarding the exemption for breeders. Under that exemption, we've we've been made aware of a particular contractual agreement between breeders and, say, someone who purchases a purebred animal.'",
        "'speaker_9': 'And under that contractual agreement, I believe it's referred to as a breeder line or breed line perhaps. And we can have Councilmember Richardson expand on that deal. My understanding of what's been described to me and my knowledge of the ordinance before us, our exemption would cover that.'",
        "'speaker_9': 'And so if I could have staff. Discuss that. And elaborate on it. I would appreciate that. And perhaps, Mr. Mayor, if Councilmember Richardson can articulate better. What I was trying to articulate.'",
        "'speaker_0': 'Just also, just for the public, there will be public comment. So as soon as this is completed, just after. I thank you.'",
        "'speaker_11': 'Thanks, Vice Mayor. I think so. I've done some diligence since last week too. This week to better understand how this impacts purebred dogs and purebred animals. That may not be a show dog, but might potentially be a show dog or be a part of a line, a specific line of purebreds that breeds show dogs or whatever the'",
        "'speaker_11': 'purposes. And a lot of times the breeders my understanding is the licensed breeders, a lot of them like have a contractual or contractual agreement with those folks that they sell their dog to, that those dogs should not be spayed or neutered because they are part of a certain line.'",
        "'speaker_11': 'Now, I would imagine this is a very narrow group of group of professional trade. So I wanted to I wanted to just sort of have a better understanding on that. And thank you, Vice Mayor, for for helping to walk me through that.'",
        "'speaker_11': 'And I would hope that they are included in the exemption for under the definition of the exemption for breeder.'",
        "'speaker_9': 'Thank you. And, Mr. Mayor, would you mind if staff addressed the issue? As I read it, it would be would be exempt. The owners would be on the breeder to provide that documentation to us.'",
        "'speaker_8': 'Mayor and members of city.'",
        "'speaker_11': 'Council, in my understanding and.'",
        "'speaker_8': 'Ted can can weigh in on this as well as when you purchase a purebred dog, you do get the AKC papers and with those AKC papers that you are part of the exemption. If you want to breed that dog, you you should have the AKC papers, too, to show the lineage of that dog.'",
        "'speaker_8': 'Right.'",
        "'speaker_9': 'Thank you, Mr. Stevens. Did you want to add to that?'",
        "'speaker_8': 'Yeah. Yeah, I believe that. And my conversations.'",
        "'speaker_5': 'With the local Kennel Club is that there is a lot of paperwork involved and a lot of time and effort that goes into making sure dogs are purebred in the lineage.'",
        "'speaker_8': 'And so.'",
        "'speaker_11': 'It would be my understanding that.'",
        "'speaker_5': 'Those offspring would have the paperwork that would make them eligible.'",
        "'speaker_8': 'For the exemption.'",
        "'speaker_9': 'Okay. And if I can ask staff to make sure that we have that as a issue that may come up and consider that and and acknowledge I'm acknowledging that that is part of the exemption. And so I'd like you to be sure that you have that as part of your process going forward in setting up.'",
        "'speaker_9': 'The requirements are not the requirements, but the process to fulfill the requirements.'",
        "'speaker_11': 'Vice Mayor I guess.'",
        "'speaker_8': 'We could probably work with the city attorney to make sure that's in the language.'",
        "'speaker_9': 'Okay. Thank you. And that's it for me, Mr. Mayor. I've made the motion.'",
        "'speaker_0': 'And the councilman.'",
        "'speaker_4': 'I'll withdraw my comment. It was only if there was a just a misunderstanding with what we thought the original intent was. But I wasn't the second or so. I wasn't sure if I could. Join of the friendly council Boston.'",
        "'speaker_5': 'Oh. With work drama comments in a la public comment person.'",
        "'speaker_0': 'Okay, great. So I'm going to move on to the public comment. If you have a public comment, please come forward to the mic. Please come all the way forward to line up behind Mr. Good Hill.'",
        "'speaker_8': 'Very good to clear. See you. Just as I mentioned the first time this subject came up, I strongly believe that we should not restrict this to our four legged friends. If we're going to spay and neuter. Extend it to all.'",
        "'speaker_8': 'The two legged, which are more problematic, quite frankly, than most of the four legged. And I think it will benefit the city tremendously. Thank you.'",
        "'speaker_0': 'Thank you. If we're going to have if we're going to speak, please come forward, ladies. Come all the way forward and just line up. Okay. Thank you. Please. And make sure everyone just introduce yourself for the record.'",
        "'speaker_1': 'Okay. Good evening. My name is Geneva Coates. I'm the secretary for the California Federation of Dog Clubs. We represent thousands of dog owners throughout the state. And the dog owners of the state of California have some grave concerns regarding your proposals tonight.'",
        "'speaker_1': 'For many decades, the city of Long Beach had a total ban on breeding before it implemented a limited permit system to allow breeding. The process is so convoluted and expensive that obtaining a breeding permit here remains an impossible dream.'",
        "'speaker_1': 'If a law that prohibits breeding was effective, then after decades of such a law, the City of Long Beach should be a poster child for shelter success. Now your city is considering another failed policy. A mandatory spay and neuter law.'",
        "'speaker_1': 'Our group is opposed to mandatory sterilization of pets, regardless of exemptions. And I think it's worth noting that while our group does represent purebred dog breeders and dog clubs that are consisting of purebred dogs, we also recognize that not just purebred dogs have a need to maintain all their body parts.'",
        "'speaker_1': 'We also recognize that there are dogs that hunt, dogs that guard property, guards that serve the blind. Those are very often crossbred dogs, dogs that serve in companion events. But we are opposed to the mandated sterilization of pets, regardless of exemptions.'",
        "'speaker_1': 'We're opposed to high fees and excessive restrictions. And some of the reasons include the most important reason. Because spay neuter mandates.'",
        "'speaker_4': 'Do not solve any problems. Such laws create more problems.'",
        "'speaker_1': 'Every place they've been tried. The ASPCA has done extensive studies on all the areas that have implemented spay neuter laws and their position paper. They state that the ASPCA is not aware of any credible evidence demonstrating a statistically significant enhancement in the reduction of shelter intake or euthanasia as a result of the implementation of spay neuter law'",
        "'speaker_1': '. Another point that I wanted to bring up. I know you all received a letter from AKC from Sheila Garvey. Sheila Garvey informed you all that the AKC would not want to consider bringing back the Eukanuba shows to Long Beach in the event of a spay neuter law this past year.'",
        "'speaker_1': 'And I know that you're also aware that in the past years, when these shows have been held here, the revenues per show have been in the area of around $21 million. So that would be a big loss to your city.'",
        "'speaker_1': 'We also recognize that mandatory sterilization laws are very costly. For the city to enforce requires more manpower. There are many existing laws that.'",
        "'speaker_4': 'Do cover dogs that are roaming.'",
        "'speaker_1': 'And causing problems in the community.'",
        "'speaker_0': 'Thank you, ma'am. I miss all of. Thank you so much. Next speaker, please.'",
        "'speaker_1': 'Good evening, mayor and city council members. My name is Diane Amendola. I sent you an email about a month and a half ago regarding this. I was asked not to come and talk to you earlier because an acquaintance of mine said that her husband was going to talk to you and everything would be settled.'",
        "'speaker_1': 'Well, they know very well that I oppose mandatory spay neuter laws. I support education of your populace so that they understand how to keep the dogs from having litters that are unplanned. My family's always had purebred dogs and we have not spayed or neutered them, but we have not had litters.'",
        "'speaker_1': 'We understand what fences are about. We understand what reproduction is about. I'm astounded that you've going to hit that you're proceeding to pass this ordinance of mandatory spay neuter, which will see Eukanuba Dog Show go elsewhere, I guess.'",
        "'speaker_1': 'Long Beach $21 million is nothing to you to earn in a week. I thought it was a lot of money.'",
        "'speaker_4': 'It's just not accurate. If you're talking about economic impact versus revenue, those are just not the same. But well.'",
        "'speaker_1': 'I got this information from your tourism bureau, and I thought that they knew what they were talking about. You know, more than they do. Please give the second part of your ordinance that would force pets shops. To offer unregulated rescue pets for sale instead of pets from license inspected sources with health guarantees.'",
        "'speaker_1': 'I oppose this. This is a poor idea, which is. Encourages the importation of dogs from outside the United States for the rescue retail trade. And if you haven't noticed, rescues do sell the animals. And I've been involved in rescue.'",
        "'speaker_1': 'Yes. We do have to get a little bit of money for the dogs to cover the expenses that they incur. However, no one regulates them. And many of the important many rescues are importing dogs from other regions of the country, as well as from as far away as Mexican, the Caribbean, Taiwan, Europe and Asia.'",
        "'speaker_1': 'This is a completely unregulated cottage industry, and you're not addressing that at all. The dogs and puppies obtained from such ventures, often from unscrupulous foreign puppy mills or dogs, are kept in bad conditions. These dogs are often sick and have been known to suffer from rabies and bring rabies here.'",
        "'speaker_1': 'Just check with your health department if you don't. Do not believe me. These. The pet shop trade has proven by the insurance companies that take care of those dogs that those are the most regulated. Far more regulated than rescues.'",
        "'speaker_1': 'And they they suffer from far fewer illnesses, as the insurance companies will attest to. I'm sorry you're considering this. I don't know what more I could say to ask you not to. So thank you for listening and. I think I sent you some information about the universities are all telling us it's unhealthy to spay and neuter our'",
        "'speaker_1': 'dogs before maturity.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'My name is Ann Taft Miller. I live in the third district. I have lived there for almost 30 years and I am hoping that you will consider other options and other viewpoints than what has been, you know, seems to be the flow that is going on here.'",
        "'speaker_1': 'My training in graduate school, as well as my profession, required me to analyze data here regardless of my own opinions. It made me look at. Specific information, that is, and even soft data. And when? So as since this is ingrained in me, I did get on the Internet.'",
        "'speaker_1': 'I did look to see if there has been any appreciable or any statistically.'",
        "'speaker_2': 'Or any.'",
        "'speaker_1': 'Even a direction that was showing that mandatory spay neuter has been beneficial to communities. And I have not found that. And I did find what somebody else said, which was the ASPCA does not support this. Even though data from our American Veterinary Medical Association has been presented as to the positives about this.'",
        "'speaker_1': 'What was omitted was that the American Veterinary Medicine Association does not support mandatory spay and neuter. I don't know why we're going this direction. The the recommendation is that this will be funded on the backs of the 33% of the dogs in this community that are actually licensed.'",
        "'speaker_1': 'You are quite you. In order for you to have a neutral impact on our city budget. I do not understand this. I do appreciate the fact that you have looked at trying to bring two sides together and to look at it passing such an ordinance.'",
        "'speaker_1': 'My dogs would be covered. However. A personal note is that my dog has been diagnosed with Ms.. So cancer, which veterinary oncologist have specifically stated is related to early spay and neuter? My girlfriend's dog died of bladder cancer.'",
        "'speaker_1': 'Which was associated with early spay and neuter. My dog was spayed at five months. Her dog was neutered at 11 months. Why are you practicing veterinary medicine? I am very passionate and I am sorry. It's frustrating to me that you are moving in this direction when in fact we should be going.'",
        "'speaker_1': 'You know, every argument that has been given, you know, for this ordinance has been covered by licensing fields and breeders permits. I don't understand it.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_1': 'Hello. Can you hear me? Ahead.'",
        "'speaker_4': 'We can. Okay. My name is Vicki Rhodes, and I am appalled that this.'",
        "'speaker_1': 'Council is even considering.'",
        "'speaker_4': 'This measure. It has been a failure everywhere.'",
        "'speaker_1': 'It has been tried. If you look at cities that have taken a much more progressive and much more.'",
        "'speaker_4': 'Open minded approaches such as the County of Ventura. You will see that they did and chose to go with an educational program. They approached their populace for education. They approached them with affordable means of getting their animals spayed or neutered.'",
        "'speaker_4': 'A lot of people simply can't afford it, but they want to have pets and they want to be good pet owners.'",
        "'speaker_1': 'You also have the kind.'",
        "'speaker_4': 'That are just completely irresponsible and let them run loose. The mandatory spay and neuter is not going to address any portion of those problem areas. You have 70% of your.'",
        "'speaker_1': 'Population of pet.'",
        "'speaker_4': 'Owners already not complying with your laws. So the 33% are going to shoulder the burden. The other thing that I would like to.'",
        "'speaker_1': 'Remind you of is something that Thomas.'",
        "'speaker_4': 'Jefferson said.'",
        "'speaker_1': 'And he said not to consider laws and civil mandates just for.'",
        "'speaker_4': 'The good that you think they will.'",
        "'speaker_1': 'Do. You need to consider.'",
        "'speaker_4': 'Them for the harm that they can do.'",
        "'speaker_1': 'This is something that you are.'",
        "'speaker_4': 'Considering that can do.'",
        "'speaker_1': 'Tremendous harm. You are deciding.'",
        "'speaker_4': 'Without any medical background or any veterinary knowledge.'",
        "'speaker_1': 'That this is what you are going to force.'",
        "'speaker_4': 'Upon the populace.'",
        "'speaker_1': 'Now I consider myself a good pet owner and a good citizen.'",
        "'speaker_4': 'And I to do what's right.'",
        "'speaker_1': 'For my dog.'",
        "'speaker_4': 'And my dog will be covered under one of those little slippery things that you.'",
        "'speaker_1': 'Call an exception. But the truth is, everybody deserves the right to discuss with their veterinarian.'",
        "'speaker_4': 'Or to be knowledge knowledgeable within that.'",
        "'speaker_1': 'Discussion about what is best for their pet. This is not in the best interest of your pet.'",
        "'speaker_4': 'This is not in the best interest of me and my family who love those little animals and they get attached to them. I invest time and money and it gets spent in this city. I am willing to.'",
        "'speaker_1': 'Support whatever program.'",
        "'speaker_4': 'Because I want to comply and I want everyone to be able.'",
        "'speaker_1': 'To comply. It needs to be fair.'",
        "'speaker_4': 'This is neither fair. It is not healthy. And I don't see why you feel that you have the right to do this. Additionally, if you want to contact some counties like Ventura that did go with the educational route, you will see that within a year their.'",
        "'speaker_1': 'Admissions into their.'",
        "'speaker_4': 'Shelters and clinics dropped by 40%.'",
        "'speaker_0': 'Thank you very much. Time's up. Make speaker, please.'",
        "'speaker_4': 'Happy Saint Patty's Day, Mr. Mayor. Members of the City Council. My name is Connie Koehler. I am the legislative liaison to the AKC for the soft coated Wheaten Terrier Club of America, my national breed club and a great Irish breed, and also the immediate past president of the soft coated Wheaten Terrier Club of Southern California.'",
        "'speaker_4': 'And I would like to talk to the economic impact of the loss of AKC Eukanuba National Championship to the City of Long Beach and Councilwoman Mongo. I do understand the difference between economic impact and revenue. Professionally. Previous speakers have stated that according to Long Beach Area Visitors and Convention Bureau, that 28,000 visitors from all 50 states and'",
        "'speaker_4': 'multiple foreign countries with an economic impact of 21 million, was the result of.'",
        "'speaker_3': 'The 2010.'",
        "'speaker_4': 'Single year agency show season that was at the height of the Great Recession. May I remind everyone that the contract that AKC makes with the city is for five years? So that is potentially a loss of 105 million or more over that five year period.'",
        "'speaker_1': 'To Long Beach.'",
        "'speaker_3': 'Business.'",
        "'speaker_4': 'This includes hotels, restaurants, retail merchants, car rentals, Long Beach Airport, etc., etc. and many employ hourly, lower income workers who spend their own income in the community, affecting yet more businesses in Long Beach indirectly. Now then there is the issue of local AKC shows.'",
        "'speaker_4': 'And by the way, AKC has gone on record online on their website.'",
        "'speaker_1': 'Saying, and I quote.'",
        "'speaker_4': 'From today's release of cases Taking Command, their government relations newsletter quote, AKC has informed city officials that we will no longer consider Long Beach as a site for the AKC Eukanuba National Championship, which had previously been held there from 26 to 2010, unquote.'",
        "'speaker_4': 'According to AKC event operations, last year's entries for local AKC shows at Queen Mary Park were 6509 dogs. They are principally from two weekends in June. Great Western Terrier Association, which includes national and local breed clubs, specialty show shows, including My Own.'",
        "'speaker_4': 'And the following weekend, the Kennel Club of Beverly Hills and Long Beach Kennel Club. Similar events. The economic impact if those clubs decide to withdraw as a result of the passage of your ordinance exceed.'",
        "'speaker_3': 'Could exceed.'",
        "'speaker_4': '$1,000,000 and could be upwards of 3 to $4 million annually if the clubs decide to go elsewhere. It will not be this year, but in subsequent years. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Hello. My name is Kimberly Buchanan, and I again urge you to vote no on this proposed ordinance. As I stated last week, I'm a business owner and homeowner. I currently live in District five. I've lived in Long Beach since 1988, have volunteered much time at Long Beach Animal Control and currently assist with several rescue organizations.'",
        "'speaker_4': 'Last week we heard.'",
        "'speaker_1': 'A lot of.'",
        "'speaker_4': 'Really sad stories about dogs on streets, dogs being euthanized in our shelter. Our group received the Animal Control Statistics statistics through December 5th of 2014. And I agree that it is shocking, shocking that the numbers have dropped so dramatically just a few years.'",
        "'speaker_4': 'That's all it takes. This is in large part due to the dedication and hard work of so many supporting groups and individuals who work tirelessly for the animals. The euthanasia stats that we got were approximately 4400 dogs that were impounded.'",
        "'speaker_4': 'We don't know if that actually includes the four other contracted cities. It may not sure. But as I look at the statistics, I have to wonder how animal control can improve any healthy, adoptable animals should be able to find a loving and permanent home out of 968 dogs that were euthanized in that time, 477 of them had'",
        "'speaker_4': 'serious health or behavior issues, so they were essentially non adoptable. 307 had minor health and behavior issues. What minor is, we don't know. Not sure what that is. Don't know if these dogs were made available to the public, if they were treated, if they had any training, for some reason they were euthanized.'",
        "'speaker_4': 'But we don't know why. Finally, out of 968 dogs, only 126 were euthanized due to time and space. Amazing. 126. Too many, of course. But what was it about those 126 dogs that they didn't get adopted? One more statistic we see is that there are 696 dogs relinquished to the shelter by their owners.'",
        "'speaker_4': 'Does animal control counsel these people when they try and release their dogs and try and find ways for them to keep them rather than releasing them? Those are the questions I would be asking, not what the reproductive status is.'",
        "'speaker_4': 'By approving this ordinance, you are taking a broad brush approach to an issue that has many facets that deserve more careful consideration. Since a councilman supporters seem to feel that this is the next step in reducing euthanasia. I would beg you to put the information online so everybody can see what the results are, just like other major'",
        "'speaker_4': 'municipalities do. So we can see exactly what the effect is once this does pass. If it does pass. We have an estimated 110,000 dogs in the city. 90% are already altered. We only have a 30% licensed compliance, so difficulty in enforcing existing laws.'",
        "'speaker_4': 'I do not believe this broad, sweeping ordinance will achieve the desired effect. Please vote no. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. Go ahead, cut off. We have our last public speaker. I'm going to cut off the speaker's list, the lady in the back there, so she'll be the last speaker.'",
        "'speaker_12': 'I'm going to be very quick because I spoke to you at length last week. My name is Judith McMann. I'm a lifelong resident of Long Beach. I've lived in the fifth District on my own home for the last 40 plus years.'",
        "'speaker_12': 'And I have three dogs, two of whom are spayed. One of whom is intact and will remain intact. I fall under one of your exemptions. Regardless, he will remain intact. He's never been out of my yard. I have a lock on my yard.'",
        "'speaker_12': 'He's not going anywhere and he's not going to touch any other target unless I say he's going to. I just had a couple of questions about this ordinance itself. I happen to be an attorney as well, and I do read the law.'",
        "'speaker_12': 'I have a couple of questions which I'm hoping this council can answer for me. As I read this, it says Unaltered dogs and cats are prohibited. That means prohibited in the city of Long Beach, I presume does not say residents, dogs and cats who live in Long Beach are prohibited.'",
        "'speaker_12': 'It says dogs and cats, period, are prohibited. I know a lot of people that come here for dog shows. They're not going to take the chance of bringing an altered, unaltered animal in this city, period. End of subject.'",
        "'speaker_12': 'They're not going to do it. The other question I had, unless I'm totally mistaken, this city currently requires licensing of animals at the age of four months. This law says that at six months they must be spayed or neutered.'",
        "'speaker_12': 'I'm wondering what happens in the meantime if I license a puppy, an altered puppy at four months, and then I have to spay and neuter it by six months? Do I get a refund on what I've paid for the difference in license fees?'",
        "'speaker_12': 'That makes no sense to me. Absolutely no sense to me. Basically, that's all I have to say. Thank you very.'",
        "'speaker_0': 'Much. Thank you very much. And I had closer speakers list. We have one more. Is that okay? Okay. I'm going to close the speakers list after you came in. Thank you. Go ahead.'",
        "'speaker_12': 'Hi. My name is John Zapp. I'm a resident of the fifth District.'",
        "'speaker_6': 'I lived there for 30 years. I'm I'm also the owner of two dogs, two of whom compete in agility and are the top two of the top dogs in the country in agility and our breed. I've been the past president of my dog club.'",
        "'speaker_6': 'I've been past president of my agility club, and I'm the current vice president of my obedience club. So I know a few things about dogs and about caring for dogs and raising dogs. I'm opposed to the mandatory spay neuter law, not because it's going to affect me directly, because my dogs are going to be exempt under the'",
        "'speaker_6': 'way the ordinance is currently written. But I'm opposed to that. For all the other reasons that you have.'",
        "'speaker_12': 'Heard tonight that you heard at our last meeting last week. But I'm not here to express my opposition.'",
        "'speaker_6': 'To that so much anymore, because I suspect that, as we were told when a group of us were meeting with members of you, with the Senate and your staffs, as we were told that it was a done deal two months ago, I suspect.'",
        "'speaker_12': 'It's going to be a done.'",
        "'speaker_6': 'Deal again tonight. But I am here to express my personal disappointment in not being a participant in the discussions that led to the creation of this particular ordinance, the people who were most involved in dogs on a daily basis, who compete with dogs, who know dogs, who have bred dogs, who have held these contracts, written these contracts'",
        "'speaker_6': ', who have like me, walked through shelters, pulled dogs. And in my case, I have fostered seven dogs, all of whom I can say have been placed in really wonderful homes. We didn't provide any input into this. We weren't part of the group that helped craft this ordinance.'",
        "'speaker_6': 'We were not in we're stakeholders, but we weren't at the table as as.'",
        "'speaker_12': 'As Councilman Andrew.'",
        "'speaker_6': 'Said earlier this evening to the young lady and the group from the Wrigley District, telling them perhaps over the next period of time, you can work together to try to come together. We didn't get that opportunity. We didn't get that chance.'",
        "'speaker_12': 'And now there's going to be an ordinance that's going to be in place.'",
        "'speaker_6': 'I'm going to comply with it.'",
        "'speaker_12': 'I'm exempt from it. One of my dogs is currently neutered. The next the next one, the other one will be spayed as soon as we come back from Nationals.'",
        "'speaker_6': 'However, for the 70,000 dogs in this community that aren't neutered, aren't spayed, I'm not sure how that group is going to come together with and and comply with this ordinance.'",
        "'speaker_12': 'They're not complying with the licensing ordinance now.'",
        "'speaker_6': 'It's it's a been a divisive experience and I'm sorry for that. I just wish that the council would, going forward, pull together the stakeholders and see if we can't create some sort of better thinking. Thank you.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_3': 'My name is Elizabeth Orrick. I'm the national manager of Puppy Mill Initiatives for Best Friends Animal Society. And I'm just here on behalf.'",
        "'speaker_1': 'Of Best Friends and our 300,000 members to.'",
        "'speaker_3': 'Thank you for considering the retail pet sales ordinance and for really taking a.'",
        "'speaker_1': 'Positive, proactive approach to.'",
        "'speaker_3': 'Making the City of Long Beach more humane for people and animals. And I just want to briefly remark on something that a previous speaker said about how the existing pet stores.'",
        "'speaker_1': 'Are supplied by breeders who are.'",
        "'speaker_3': 'Licensed and regulated. So the USDA is the one who regulates commercial breeders. And the the minimal standards of animal.'",
        "'speaker_1': 'Care allow for a breeder to have.'",
        "'speaker_3': 'No limits to the number of dogs they have. Some of these facilities have over a thousand.'",
        "'speaker_1': 'Dogs with very few, very few people to care for them. There's no limits to how often the dogs can be bred or how young or old the dogs.'",
        "'speaker_3': 'Can be when they're bred. There's no requirements.'",
        "'speaker_1': 'For veterinary.'",
        "'speaker_3': 'Care, daily exercise, human contact. And the most shocking thing is that these dogs are allowed to be confined to cages that are have wire bottoms, which are very uncomfortable, tiny, cramped cages stacked one on top of the other.'",
        "'speaker_3': 'And they only have to be six inches larger than the dogs. And those dogs are allowed to be kept in those cages.'",
        "'speaker_1': '24 hours a day, seven days a.'",
        "'speaker_3': 'Week for their entire lives, without ever being taken out for one single moment to stand on solid ground, feel the sun on their backs, get out of dark barns, get, get out of the elements.'",
        "'speaker_1': 'This is the life of the breeding.'",
        "'speaker_3': 'Dogs who are supplying puppies for local pet stores, and that's unacceptable. So the status quo, which is what you're trying to address, needs to change. That's why.'",
        "'speaker_1': '75 other communities throughout North America.'",
        "'speaker_3': 'Cities, counties now the state of Maine are all passing these ordinances because they realize that this is not appropriate. So we applaud.'",
        "'speaker_1': 'You for taking this.'",
        "'speaker_3': 'Approach, for making Long Beach a more humane city. And I want to thank you.'",
        "'speaker_0': 'Thank you. And our final speaker.'",
        "'speaker_3': 'Thank you. Thank you for affording me the time.'",
        "'speaker_1': 'I have a little thing going on here, but I did want to address you. I would like to address some of my concerns that came out of last week's meeting. First of all, I would like to comment on Councilwoman Mongo statement during her remarks at the last council meeting where she quoted I quote her I am a'",
        "'speaker_1': 'proponent of strong compliance policies. Councilwoman Mongo, I would like to know how you plan to mandate such strong compliance with this ordinance. The City of Long Beach is already looking at budget difficulties. This budget recommends a minimum allocation for compliance, which includes enforcement and public education.'",
        "'speaker_1': 'How will that be possible? With only a projected increase in licensing fees expected to balance the cost? How will it affect the budget if the compliance and licensing is not what you expect? Statistics speak for themselves from cities all over California and across the United States, that when an ordinance such as this is implemented, compliance goes down'",
        "'speaker_1': 'and costs go up. It is it is realistic to base. Is it realistic to base your budget on 100% compliance with only part time inspectors? With these questions in mind, I would like to request that the Director of Animal Care Services include program transparency with up to date shelters, data statistics posted on a website just as Los'",
        "'speaker_1': 'Angeles City Animal Service does, posting their animal control statistics monthly. Secondly, when our group began meeting with each of your office, I found it interesting and one of our very first meetings almost four weeks ago with Mr. Brock Howard.'",
        "'speaker_1': 'Vice Mayor Lowenthal is chief of staff who expressed his indifference in our meeting with him regarding this ordinance and remarked, and I quote, This is set in stone. Now, that was four weeks ago before any of the testimony at these council meetings took place.'",
        "'speaker_1': 'But after November 18th Council meeting, I ask you, how can that be? Am I to understand that you're all going through the motions here and we have just been wasting our time offering you facts, statistics, position letters from all the major organizations that should have been included in some type of stakeholders meeting for input before this important'",
        "'speaker_1': 'issue was voted on. May I suggest that you delay the vote on this second reading in order to build a comprehensive study, which can include all the stakeholders from both sides giving their opinions on the pros and cons of this issue.'",
        "'speaker_1': 'This was an idea mentioned to us when we met with both Austin and councilmen Austin and Durango, and I suggest I support this idea. I would like to thank you, Councilman Austin. Your remarks last week showed you really you really had a grasp of the problems with this ordinance.'",
        "'speaker_1': 'Lastly, I would like to mention thank Dr. Larry Cosman for representing the Southern California Medical Association at last week's council meeting. Although Dr. Cosman was only here present as an observer for his organization, the Southern California Veterinary Medical Association has expressed no position on mandatory spay and neuter.'",
        "'speaker_1': 'But I am aware that there are many interested members of the Southern California Veterinary Medical Association who are presently involved in this discussion and who are concerned with the outcome here tonight. Thank you.'",
        "'speaker_0': 'Thank you. With that, I'm to go back to Councilwoman Mongo.'",
        "'speaker_4': 'First, I want to say that I always appreciate those who come and meet with our office. I take emails personally, I take meetings regularly. I'm out in the community at sometimes a dozen events a week where people approached me on any item before the council.'",
        "'speaker_4': 'Ted, do you want to give a little bit of input on the stakeholder group that weighed in on the writing of the ordinance that this council asked you to ensure that it was written and or any individuals that contacted your office where they all heard.'",
        "'speaker_4': 'Mr. Stevens?'",
        "'speaker_6': 'Yeah.'",
        "'speaker_5': 'I'm sorry. Still getting over a cold? Yeah.'",
        "'speaker_8': 'In addition to.'",
        "'speaker_11': 'All the groups.'",
        "'speaker_5': 'That were actually that were in support of the mandatory spay neuter, I did reach out to or spoke to the Long Beach Kennel Club representatives that came to the meeting in November. And I did speak with them and I did share them.'",
        "'speaker_8': 'What we were proposing and made.'",
        "'speaker_5': 'Sure I swayed it all of their.'",
        "'speaker_11': 'Concerns as they were the group that contacted me and reached out to me and and.'",
        "'speaker_5': 'Spoke to me at the last meeting. So I did speak to them. I did speak to several other agencies on their laws and what worked and what didn't work. And so that's that was the basis of it.'",
        "'speaker_4': 'So if any member of this group that felt that they were not included had reached out to you and and as our motion had said, that was in public and posted many times, had voiced interest in being a part of the process.'",
        "'speaker_4': 'They were included.'",
        "'speaker_5': 'Yes. I didn't have any other people reach out to me.'",
        "'speaker_4': 'Okay. Additionally, I want to set a few facts straight. Nothing is a done deal and nothing is set in stone until five members of this body have passed it. And I think that that's evidenced by the dialog that Councilmember Austin and I had last week, and that earlier this evening I was leaning towards voting no.'",
        "'speaker_4': 'And the comments of my colleagues and members of the public had changed my mind. I have a very heated item going on in my district right now that I inherited from a prior council, and I'm looking at it very diligently to ensure that we are we are getting all sides to the point that unaltered dog licenses cost'",
        "'speaker_4': 'more than spend neutering. Let me also say that. As a council member, we receive if you saw the stack of paper I had here earlier tonight, those were all public comments on a particular item in my district. And I read them all, all of them.'",
        "'speaker_4': 'And I write notes on things that we want to write back. And obviously with the hundreds that we receive, we can't write back to every single person individually. And most specifically, I try to take my time to write back to the people who are most informed, because a lot of the complaints we get.'",
        "'speaker_4': 'Are just based on things that are not factually correct. And so it's it's hard as a councilmember to try to correct the record all the time and remind people of what the facts are. So let's go through a couple of books.'",
        "'speaker_4': 'One, the cost of unaltered dog licenses cost more than spay and neuter and your pet. So if you an unaltered dog license at $95 for four years, you're in for approximately $400. The cost of spay and neuter and is less than that.'",
        "'speaker_4': 'Most dogs live beyond four years of age. Additionally, there are spay and neuter vouchers, etc., etc., etc.. And so in addition to that, Councilmember Austin and I have talked about the mobile spay and neuter clinic and other opportunities to ensure that certain parts of the community don't have access to the shelter where you buy licenses and you'",
        "'speaker_4': 'become compliant. And so we're working on making sure that the north side of town and the west side of town have events in their community where they can buy licenses and or have access to those vouchers. Second. The spay and neuter ordinance as written is budget neutral.'",
        "'speaker_4': 'Since we are allowing individuals who currently have an unaltered license to maintain their current unaltered status, there is no revenue decrease expected. And so from their. There have been complaints in the community that we are increasing the dog licensing fee by 40%.'",
        "'speaker_4': 'Let's talk about that, shall we? A dog license fee in Long Beach is a mere $20. We are increasing the fee to $24. That is less than a venti cup of coffee at McDonald's. I think they're 425. And so if the organizations and individuals who want the privilege of having a dog aren't willing to pay for the'",
        "'speaker_4': 'cost of that organization, we have bigger issues. Right now, Animal Control Services is a budget deficit annually. I know you sent over the numbers, Mr. Stevens, but what is the subvention rate of animal control services? So subvention rate is if it costs $100,000 to run the department and we only bring in $40,000 in revenue, it's only supplemented'",
        "'speaker_4': '40%. And departments like this should be prevented 100%. We don't want to lose the service, and we absolutely cannot increase redemption fees because the cost of redemption fees are deterrent for individuals picking up their animals. They just abandoned them when they see what they have to pay.'",
        "'speaker_4': 'And Mr. Stevens has done an excellent job of, in some cases, waiving those redemption fees to ensure those pets get back to their owners. But if you could tell me what the current subvention rate is or what the revenue the costs are from the email that you sent me.'",
        "'speaker_4': 'I can pull it up if I have to.'",
        "'speaker_9': 'Thank you, Councilmember Mongo Councilmember Austin.'",
        "'speaker_5': 'I don't I don't have the exact percentage on me, but it's.'",
        "'speaker_8': 'Little it's under 50%. Okay.'",
        "'speaker_5': '40, 45%.'",
        "'speaker_4': 'So less than 50%. That means that our contract services are license fees and our redemption fees don't even cover 50% of the cost to run our organization. And so this small amount of revenue spike in the short term will make that difference.'",
        "'speaker_4': 'For compliance. And I am I am one of the council members that stands most firmly against increasing taxes. I also am one who believes, and you'll see this in the coming months, as we're discussing right now, our parks.'",
        "'speaker_4': 'I'm also one who believes that those who use those services are the ones who should pay for the most, because our general fund dollars, the tax dollars brought in from sales tax revenue and property tax really need to go to streets, sidewalks, trees, the things in the community that are used by everyone.'",
        "'speaker_4': 'And so even some have brought to my attention that park usage is equal for taxpayers of Long Beach and people who come from other communities whose taxes pay for other parks. We're looking into that. We're looking at those options because in the next two years, we are facing a budget deficit.'",
        "'speaker_4': 'Additionally. I am open to discussing options of what we can do on rating systems or requirements for our rescues. I do know there is a huge difference in the quality of rescues in our community. Having worked for Animal Control, L.A. County.'",
        "'speaker_4': 'I've worked with dozens and dozens and there's a huge variance. So please reach out to my office and get on the calendar and we can discuss some options. Same with puppy mills. Ted, do you want to address for me quickly that licenses are at four months and the Spain and neutering is at six months and how we'",
        "'speaker_4': 'came up with a way around that so we wouldn't have to do a refund. Do you want to share that?'",
        "'speaker_11': 'I believe we would probably propose.'",
        "'speaker_5': 'We would be proposing a temporary fee similar to what Orange County uses. They allow puppy licenses at the same rate as an unaltered license. And then so we could propose that in the fee schedule when this takes effect in October.'",
        "'speaker_4': 'Because I'm definitely not in favor of refunds. It's it's a process that takes a lot of staff time that should be spent on animals. Additionally. We do not base the budget on 100% compliance. We base the budget on revenue trends.'",
        "'speaker_4': 'And so that's not a part of it. And then and finally, I want to say something about an issue that I've spent hours of my life on in the last week. There are too many individuals that speak for the AKC because there are people who come before us today that say they're not going to come back.'",
        "'speaker_4': 'And there are people who call me and say that they are. There are people in the organization who say that they were never going to come back anyway. They outgrew us and they moved to Miami for five years.'",
        "'speaker_4': 'And when they were considering coming back to the West Coast, we were not even in their consideration. There are others who said that and I quote, Because you have written in the breed ordinance and the exceptions as you have, you are still in consideration.'",
        "'speaker_4': 'And so it's really difficult for us as a city to have so many different people speaking for an organization. If the president of this organization would like to give me a call, my chief of staff will give them my personal cell phone number.'",
        "'speaker_4': 'In the same way that I've spoken with the president of the Convention and Visitors Bureau. And their staff has reached out numerous times over the last week to get the record straight and to have AKC provide in writing what they had specifically said.'",
        "'speaker_4': 'I see that you said that some things on the website. I'd be more than happy to have my chief of staff. She's right here in the front row. Find out more. But we've spent hours on the phone. I mean, just trying to weed through the individuals who call and say they are affiliated with your organization.'",
        "'speaker_4': 'So for the sanctity of your organization and ensuring that you have the right people speaking on your behalf, we need to work through that process. So thank you for everyone's comments and feedback. I really appreciate it.'",
        "'speaker_9': 'No, thank you. Public comment is complete for this item right now. Okay. Thank you. Councilmember Mongo. Councilmember Austin.'",
        "'speaker_5': 'Thank you, Vice Mayor. And, yes, we we debated this this issue pretty profusely last week, and I was reminded in public comment regarding a little earlier about my vote. And this evening, I won't be voting in support of this because I did make a lot of arguments.'",
        "'speaker_5': 'To the contrary last week. I do think the exemptions are fair and they they they do so some show some sensitivity to many of our responsible pet owners. But I think the smartest, most fiscally responsible approach would be to focus on education and registration, since 90% of our registered dogs here in Long Beach are spayed or neutered'",
        "'speaker_5': '. It shows that our system is actually working. I would much rather commit resources to create seasonal job opportunities for college students to canvass and assist our city in increasing our registration numbers. I think the mandatory spay neuter ordinances draconian is a draconian leap for the city of Long Beach, and I'm not convinced that our existing ordinance is'",
        "'speaker_5': 'really broken. The data, in fact, I think shows significant improvement. And I think this council and the many activists here on both sides of this issue should be complimented for your involvement over the years on this issue. Accessibility to animal care services is still a major issue for majority of the residents in the city of Long Beach'",
        "'speaker_5': '. This ordinance does nothing to address that district's one district's two District six District seven District. Eight District nine residents are not don't have access to animal care services. And I think if we were to. To address that in a comprehensive way.'",
        "'speaker_5': 'We could do a lot to to minimize our numbers in terms of euthanasia and in having, you know, our dogs and cats actually picked up from animal care services. One of the speakers addressed the transparency issue and council members, Vice Mayor Lowenthal.'",
        "'speaker_5': 'I would I would really love to see in this this ordinance or something come forward from this council. If not today, I'm sure something will come forward very soon, some greater transparency. You know, how many how many dogs are in cats we rescuing, how many are surrendered, how many strays are picked up, you know, and what are'",
        "'speaker_5': 'we doing in terms of euthanasia? And I think that transparency is merited in this regard. I mean, and more importantly, I would love to see a monthly report from Animal Care Services to to measure the real efficacy of what I presume will be this this this new ordinance, if passed.'",
        "'speaker_5': 'You know, I want to be able to measure, you know, where we are today and where are we going to be six months from now, where we are a year from now, should this pass? And so I'm going to tell you right now, I'm very much interested in greater transparency in that regard.'",
        "'speaker_5': 'I'm great. I'm very much interested in making animal care services more accessible to the rest of the city. But what I just said, like six council districts are geographically, um, I guess handicapped from, from, from, from such services and so to, to make this leap to it, to a mandatory spay neuter in law.'",
        "'speaker_5': 'I mean, it makes people feel good. It makes a certain segment of activists feel good, but I don't think it is a smart policy. And so with that, I will be voting no.'",
        "'speaker_9': 'Thank you, Councilmember Austin. I appreciate your comments and your position on this. You've been consistent and I do appreciate that. I do want to reiterate to anyone that's interested and certainly watching at home, as colleagues like to say, this isn't a panacea.'",
        "'speaker_9': 'It's certainly one of the many tools that we would like to implement here in our city to support our education and outreach efforts. If this were a panacea and certainly viewed as such, I would have brought it forward five years ago when I brought my animal care reform package forward.'",
        "'speaker_9': 'And so this is one of the last tools that we had identified as a possibility for our city after having implemented all of the others. And to your great suggestion, Councilmember Austin, I do all of that information is available.'",
        "'speaker_9': 'I don't know that we as a council have ever asked our animal care team for a monthly or a annually or even every six months type of report. But as someone who's been very interested in this issue, I've received those numbers because I've asked for them so that I can track the issue we've been able to.'",
        "'speaker_9': 'State what our percentages are in terms of the reduction in euthanasia, in terms of the reduction of the number of animals that are collected year over year. Because it's something that I personally been interested in. And so I've received that information because I asked if this council is interested in that.'",
        "'speaker_9': 'Certainly, I think would not only be amenable, but be happy to provide that by way of an annual report. I do think it's part of an annual report of types that I have seen, but it may not be in the format that you're looking for.'",
        "'speaker_9': 'I have seen those numbers and I think they're publicly available. And so I do believe we are transparent in that because we're proud of the work this animal care department has done. We have come a long way from when we used to be called animal control, and I could not be more proud of the city for that'",
        "'speaker_9': 'department's work. Mr. Keisler is not here today, but he was a big part of bringing forward the reform and the change with our city manager and every member of this team. And now Mr. Stevens, along with Mr. Chapman's leadership, is part they are part of that.'",
        "'speaker_9': 'And so. Watching the evolution of this department. It does. It makes me very proud. We have a long way to go. And that's why we have to be relentless in looking for tools to ensure that we take the most humane approach possible.'",
        "'speaker_9': 'And with that, I think my second Councilmember Urunga on on this item. And I think we're ready for a vote.'",
        "'speaker_1': 'I spent a lot of. Motion carries seven one.'",
        "'speaker_9': 'We took item 25, correct?'",
        "'speaker_1': 'Yes.'",
        "'speaker_9': 'And so we are on to new business. Is that correct? Yes. Okay. May I call on Councilmember your.'"
    ]
}