{
    "Donation to YMCA of Greater Long Beach and Kahlo Creative LLC using Ninth Council District Funds.": [
        "'speaker_1': 'Communication from Councilman's and House recommendation to increase appropriations by 1000 to provide a donation to the Long Beach Architecture Week to support the absolute best of Long Beach 2022 Fundraiser Event. Item 16 Communication from Councilwoman Zendaya's Recommendation to increase appropriations by 2500 to provide a donation to the downtown Long Beach Business Alliance to support a partnered event'",
        "'speaker_1': 'with East Village Earth Day. An Item 18 Communication from Vice Mayor Richardson recommendation to increase appropriations by 2200 to provide a donation to YMCA for Greater Long Beach and Carlo Creative LLC.'",
        "'speaker_0': 'The motion or second. Second, please. Any public comment?'",
        "'speaker_1': 'There's no public comment on these items.'",
        "'speaker_5': 'Okay. Casper votes.'",
        "'speaker_3': 'I can't. My screen is not working. I can't vote right now.'",
        "'speaker_0': 'And I don't think we'll come in until.'"
    ],
    "Resolution to Add Modified Summer Camp Programming Fees to Master Fees and Charges Schedule.": [
        "'speaker_1': 'Councilwoman Price. Motion is carried.'",
        "'speaker_0': 'Think you are hearing 14?'",
        "'speaker_1': 'Report from Parks Recreation and Marine recommendation receive supporting documentation into the record, include the public hearing and adopt a resolution amending the master fees and charges schedule to add to modified summer camp programing fees. District three. There is an oath required for this item.'",
        "'speaker_1': 'If the witnesses can stand to you and each of you solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_0': 'I did.'",
        "'speaker_2': 'Mara, I'd like to introduce.'",
        "'speaker_1': 'Our Parks and Recreation director Brant.'",
        "'speaker_2': 'Dennis and Janice McMullen, our financial services.'",
        "'speaker_1': 'Officer, to do.'",
        "'speaker_2': 'A presentation on this item.'",
        "'speaker_6': 'Thank you, Linda. So honorable mayor and members of City Council, we're bringing before you today two fees to add to the master fees and charges schedule for the Parks, Recreation and Marine Department. The proposed fee changes establish a fee range for modified summer camp programing.'",
        "'speaker_6': 'The department proposes a fee range for two day camp programs, which are one modified summer camp programing fee for camp only. For a fee range of $30 to $114 per child per week. And two modified summer camp programing fee, including before and after care for a fee range of $50 to $149 per child per week.'",
        "'speaker_6': 'The fee range will give the department flexibility to adjust day camp fees as needed. As programing returns to pre-pandemic levels. The proposed fee ranges for modified summer day camp programing are lower than pre-pandemic day camp fees for regular specialty and aquatic day camps.'",
        "'speaker_6': 'We're excited to bring again once we're excited once again to bring day camps to youth ages five through seven this coming summer. I'll now pass it off to Community Recreation Services Superintendent Joy Warren.'",
        "'speaker_1': 'Thank you. Modified summer camp programing offers in-person camp during the summer for youth ages 5 to 12. Summer camps will operate weekdays from 9 to 4 and from 7 a.m. to 6 p.m.. For those enrolled in Extended Care, modified summer camp programs were created in 2020 during the pandemic to offer youth programs which complied with health protocols'",
        "'speaker_1': 'prior to the pandemic. The department offered both free drop in and fee based options for youth in the summer. In 2020, newly implemented health protocols, strictly regulated group ratios and program capacities that were difficult to implement in a drop in style environment since the day camp program structure implemented many of the protocols in the health orders.'",
        "'speaker_1': 'The department converted all free youth drop in programs into day camps at a reduced fee. This strategy increased the number of day camp programs from 9 to 23 and ensured that there were low cost options for Long Beach families to participate in safe and structured recreational activities for youth.'",
        "'speaker_1': 'In 2022, the department plans to provide fee based day camp programs to 12 sites and allow for the return of free drop in programs. The department proposes to implement a fee range for modified summer camp programing fees, which allow the flexibility to adjust camp fees for a phased in approach to increasing fees as the programing returns to'",
        "'speaker_1': 'pre-pandemic levels. The proposed fee range is lower than the Commission approved general fund portion of modified summer camp programing fees. I'm sorry. On March 17, this action will approve the same rates for the Tidelands area.'",
        "'speaker_6': 'So this concludes our presentation.'",
        "'speaker_0': 'Okay, great. Councilman Price. Councilman. Awesome.'",
        "'speaker_4': 'A second. Just wanted to know, do we have a list of parks that will host the summer day camp?'",
        "'speaker_0': 'And a rhythm. Good.'",
        "'speaker_1': 'We have we have 12 sites and those are at Bayshore, Belmont, Bixby, Eldorado, West, Helton King, PanAm. Silverado Stearns Veterans Park, Wardlow and Whaley Park.'",
        "'speaker_4': 'Okay. And will our program still be going as well?'",
        "'speaker_1': 'We do have be safe. Okay. For the.'",
        "'speaker_0': 'Summer. Thank you. Come on, Mango.'",
        "'speaker_2': 'Yes. What is the cost of supplying this program? What's the subvention rate? What are their sources of revenue besides fees?'",
        "'speaker_1': 'Well, we have the general fund and the tidelands fees for the source of the budget. And it's cumulatively about I'm not sure we can get those numbers about 460,000. And then we do have additional support from CDBG for scholarships.'",
        "'speaker_2': 'What is the cost per child per week? How much is the subvention? So if an average summer program costs $250 a week, it says that it's aligned with the YMCA programs in the area. I don't know what those are.'",
        "'speaker_2': 'And then my my question would be, what does it cost us to provide the program? And a lot of that is dependent on the staff to youth ratios and what we're doing with that based on. Are we out of COVID or are we doing full capacity?'",
        "'speaker_1': 'We haven't done a cost per camper analysis yet, but we do have other costs that are not covered by the fees. For example, field trips, shirts, any supplies that the families are charged on top of the weekly count fee.'",
        "'speaker_2': 'So one of the things that I think is really important when we bring forward fees is for us to tell people what things really cost. We don't want to create a false expectation that there's always going to be general fund money, which is made up of sales tax and property tax and other areas to supplement youth programs'",
        "'speaker_2': '. And so in the past, we've been in a place where we have had maybe Councilman Price can remember, but eight or nine afterschool programs, but the revenue did not cover it. And so instead of charging the parents what the program costs, we just cut programs.'",
        "'speaker_2': 'And in talking with parents, they would have rather paid for the cost of the program to be able to sustain it. So I hope that by the time that these fees come out that we let parents know the total cost of this program is actually closer to 250 per kid per week.'",
        "'speaker_2': 'But due to great opportunities through CDBG grants and port funds or whatever the funds are that will be using the cost to parents this year is a very low price of whatever number you end up coming up with.'",
        "'speaker_2': 'I just think it's really important that people know what the cost of things are because those same costs are then compared to other programs. So then people will say, Well, why is the Junior Lifeguard program this price? But the after school programs that price and why is the general fund money being put towards this program or that'",
        "'speaker_2': 'program? So if if we could encourage that in the posting, that would be appreciated.'",
        "'speaker_1': 'Thank you, Councilwoman.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Customers in the house.'",
        "'speaker_2': 'Thank you. Thank you for that presentation. These are amazing programs for our youth. These programs provide safe spaces for kids to have fun and opportunities for them to explore creative activities and sports that they mean. Leader continued to enjoy and play.'",
        "'speaker_2': 'With that being said, it is crucial to make sure that all of our youths have access to these type of opportunities. I know that these programs are often costly, and though in Long Beach we do our best to minimize the costs for families.'",
        "'speaker_2': 'I know that for many the cost is too much and it becomes a barrier. So I find it immensely important to go over any programs that are available for low income families because in Long Beach, coming from a low income family should not be a barrier that robs a child from these life changing opportunities and life shaping'",
        "'speaker_2': 'opportunities as well. On that note, me staff highlight what we are doing as a city to support our low income families and to support parents who may be not be able to afford these summer programs.'",
        "'speaker_1': 'Thank you, Councilwoman. Yes. We actually have a variety of free programs that are available for families. One, we are we are resuming the free drop in programs that are available at all our 24 sites, which is known as Summer Fun Days, and that's free to families.'",
        "'speaker_1': 'And it offers supervised activities for free from 12 to 5. In addition to that, we also have our mobile recess program that's going out to neighborhoods specifically that don't have easy access to our park programs. And then we also have our BCC programs that we mentioned earlier.'",
        "'speaker_1': 'There are also a number of family events like movies in the park concerts that we have to provide families. And then for those that do want this, the de camp experience, we offer scholarships for families.'",
        "'speaker_2': 'Thank you. I thank you very much for that. Mary, you brought up some excellent points. And I think that one of the things that's really valuable to also share is the opportunity for people who could pay full price, even though the price of the program is discounted, to have an opportunity to donate to Partners of Parks so'",
        "'speaker_2': 'that there will be more money available for the financial aid. Just something to think about, especially if you tell someone, you know, the price of this program should have been $350, but due to grants and other things, you're only going to pay $60 a week.'",
        "'speaker_2': 'If you'd like to make a donation to help financial aid participants in future years, please put it here. Thank you. Great work.'",
        "'speaker_0': 'Comment.'",
        "'speaker_1': 'There's no further comment on this item.'",
        "'speaker_5': 'Scattered votes.'"
    ],
    "Presentation on Cambodian New Year.": [
        "'speaker_1': 'Councilman Allen. Councilman, the death. Motion is carried.'",
        "'speaker_0': '17.'",
        "'speaker_1': 'Communication from Councilwoman Sara recommendation to request City Council to receive and file a presentation and recognition of Cambodian New Year.'",
        "'speaker_3': 'Thank you. So I'm really honored to be able to present on the Cambodian New Year. So with that, I will start with Page and I'm to my to those in our audience as well as Happy Cambodian New Year.'",
        "'speaker_3': 'I want to first think I'll be TV for their hard work and support in putting together this video presentation. And I want to thank Mia Lath Chan with Sam Lehman and the venerable Gerrit Chi for being in the video.'",
        "'speaker_3': 'And I think at some may most me some may know that the Long Beach has the largest Cambodian community in the United States. And I just want to thank those who are here today as well for being present.'",
        "'speaker_3': 'And I believe I'll make some comments later. But with that said, I'd like for us to play the video and then open to public comments and then my colleagues. Simply pull that date and I'm coming. Hello. Happy New Year.'",
        "'speaker_3': 'I'm honored to present this year's 2022 Cambodian New Year presentation, where we interview Cambodian leaders from across three generations to learn why the New Year is important to them and the Cambodian community in Long Beach. Cambodians, Thai, Laotians and Burmese celebrate the same new year called Sankranti, a three day festival that takes place in the mid-April.'",
        "'speaker_3': 'That is the most important holiday. This year the festival begins on April 14th, 15th and 16th. Not only is the new year a time to mark the beginning of a new year, but it's also an opportunity to pass on knowledge to our tradition, to younger generations.'",
        "'speaker_3': 'I hope you enjoy the presentation.'",
        "'speaker_0': 'Cambodian New Year is the biggest celebration for our Cambodian people. It is a festival of unity. It all started when people who work for the Royal Palace had knowledge of astrology, and so they did the calculation and determined that April is the time for the celebration.'",
        "'speaker_2': 'Cambodian is an agricultural country, so the people work the land throughout the year and so forth to give them the time to celebrate. It's always at the end of the harvest. Cambodian New Year about family. It's about tradition where men and women would dress in their best attire, especially women and their silk and their white lace and'",
        "'speaker_2': 'attend a temple, and to reconnect with family and friends where they haven't seen each other in a while. When people think about Cambodia, they think about the recent darkness that we went through. But I think Cambodian New Year is a time where we get to celebrate all the things that are good and beautiful about being Cambodian.'",
        "'speaker_2': 'My favorite activity during the celebration is eating, of course. I feel like this is the time when everyone passes out their best beefsteak and papaya salad recipes and definitely my favorite due of the first night of Cambodian New Year.'",
        "'speaker_2': 'I would set up a table where there's lots of fruits and flower surround with my ancestors pictures and candles, and it's a way to remember our ancestors the way we celebrate, not just with the living, but also remember those that have given us life.'",
        "'speaker_0': 'My motto on New Year's Day Usually morning begins with what we call merit making. We sit at home. People are bringing food to offer for the monks, you know, to perform good deeds as a as a family. That is why it's important to.'",
        "'speaker_2': 'Cameron and Clark audience is an art form that's over a thousand years old during the Korean empire. The Kings would host monsoon or prayer ceremonies with dancers as offerings to ask the gods for rain and blessings for the New Year.'",
        "'speaker_2': 'It's important that we have it today because during the four years of the Khmer Rouge genocide, only 10% of artists survived. When people watch the dance performances, I hope that they feel a sort of peace and healing and some hope for the future.'",
        "'speaker_2': 'We are resilient, but we contribute a lot to the development of the Islamic community itself. So I think it's important for us to continue to share that.'",
        "'speaker_0': 'I would like to wish all people adoring the Cambodian New Year to have prosperity, happiness and good health and longevity for all the people. Thank you. Madam. Quick, do any public comment on the.'",
        "'speaker_1': 'There are four speakers on this item. Mariko can't sit this one. So Tia Pi and South Sun can.'",
        "'speaker_2': 'Hello, Mayor and city council members. My name is Mariko Kohn. I am a board officer of Cambodia Town Inc and the former executive director of Pacific Asian Counseling Services. I have been a strong advocate for Cambodians in Long Beach, especially funding for mental health services and public health services for the past six years.'",
        "'speaker_2': 'I'm here to speak in favor of our 17, which is a recommendation to file in recognition of Cambodian New Year. It adds specificity to the 2020 designation of Cambodian Heritage Month by the city. It continues the history of recognizing the Cambodian community and traditions, starting with the Honorable Don Nob and vigorously continued by Board of Supervisor Janice'",
        "'speaker_2': 'Hahn. Since she was elected in 2016. On Sunday, April 3rd.'",
        "'speaker_0': 'Of.'",
        "'speaker_2': 'This year, Cambodia Town Inc co-hosted the 14th annual Cambodian New Year Parade and Culture Festival with Councilman Supernova. I want to give a special shout out to him because he kept his pledge to support the parade even though his district was changed by redistricting.'",
        "'speaker_2': 'So I want to say thank you, sir. The success of this year's Parade and Culture Festival emphasizes how important Cambodian New Year is to this community. People of all ages came. There were thousands. The parade had over 35 groups and 50 booths in the festival.'",
        "'speaker_2': 'It was focused on Cambodian culture and arts. It was also very inclusive. So there were diverse ethnic groups in the parade and at the festival. Honestly, people loved it and they all came up to us later and said, Please do this again soon, but we do have to wait one year.'",
        "'speaker_2': 'So we also, the Cambodia Town Inc diligently invited many community leaders and electeds, just like we do every year. I want to give our thanks again to council member supermodel Susie Price, who was there, and our Austin City prosecutor, Doug Hubert.'",
        "'speaker_2': 'Assembly member Patrick O'Donnell. Signal Hill Council Member Ed Wilson. Linda Chico from Supervisor Honda office and Fong Lee from Congressmember Lowenthal, as well as Bill. A wave.'",
        "'speaker_0': 'Of.'",
        "'speaker_2': 'Cambodian New Year is one of the most important spiritual and cultural events for this community. The theme for this year's parade was Legacy of Kami Anger and unity. That is very powerful. Given the anti AAPI hate we experienced during the pandemic.'",
        "'speaker_1': 'Times expired.'",
        "'speaker_2': 'Okay. Thank you. Well, I have one more sentence, but thank you. Good evening, honorable mayor, member of the City Council and elected official. My name is City Assan and I am the chairperson of Cambodia Town in Happy Cambodian Heritage Month and Happy New Year, Year of the Tiger.'",
        "'speaker_2': 'So as an Asian I'm Carl to everyone here tonight from the east. From the very beginning, Cambodia town has worked tirelessly with other Cambodian community based organization and friends to preserve and to promote my art and culture. We work hard to unify our community by hosting the annual Cambodian New Year Parade and Cultural Festival in Cambodia Town'",
        "'speaker_2': 'District and My New Year celebration at Eldorado Park in Long Beach. This past Sunday, April 3rd, we brought back the annual Parade and Culture Festival to the Cambodian town district. After a two year absence due to the pandemic, several thousand revelers came to join in the celebration.'",
        "'speaker_2': 'The event provided an opportunity to folk to reconnect with family and friends, and they have missed seeing in person since the start of the pandemic in 2020. I would like to take this opportunity to thank the following for their participation in this year's celebration.'",
        "'speaker_2': 'Councilman Darryl Super NULL. Councilwoman Suzy Pride Council Councilman Al Austin City Prosecutor Doug Cubert. Assembly Member Patrick O'Donnell. Councilman Edmondson of Signal Hill. Los Angeles County Supervisor Janice Hahn represented to her Linda Chico, Congressman Alan LoBiondo, Representative Fong Lee and Sheriff Alex Villano you over the proposal to file a presentation in recognition of Cambodian New Year?'",
        "'speaker_2': 'This is in line with our mission. Therefore, on behalf of Cambodia town in I fully support this recommendation proposed by Councilwoman Soli Sato. Thank you.'",
        "'speaker_0': 'Honorable Major Council members. My name is occupied in the Indigenous. I'm on the Council of Cambodia in. Susannah George. My. Happy my new year. Thank you to Cambodia town and council member for co-hosting a pivotal and impactful 14 annual Cambodia Town Parade and Cultural Festival on April 30,000 people.'",
        "'speaker_0': 'Including elders, children, youth, family, community based organization, local businesses, the resident of Long Beach and even people from out of state and countries gather to honor this year's theme of my and Korean legacy and unity. And to celebrate my New Year and Heritage Month, we would like to recognize many government officials who came, including Assembly Member Patrick'",
        "'speaker_0': 'O'Donnell, Long Beach City Prosecutor. Mr. Doc Hubbard. Los Angeles County Department Sheriff Alex Wheeler. New Area Council Councilwoman Suzy Pry Council Woman Council Member Laura Supernova. Linda Chico representing Los Angeles County Supervisor Janet Hahn. Councilmember Al Osbourne. City of Seattle Hills member Wilson and Mr. Fong Lee, who represented Congress Member Alan Lowenthal.'",
        "'speaker_0': 'Your participation and support reflect the community interest, equitable leadership. And commitment to ensure cultural equity, diversity and inclusion, community support, embracing all diverse community and culture, including my New Year. We hope that all City Council members will join us at the 15 annual Cambodia Town Poet and Culture Festival next year.'",
        "'speaker_0': 'Susan George Moorhouse. I'm grand. Happy. My life. Burmese. Sinhala. All. Sri Lanka. Nepali. Thai. Bangladeshi born Mangal in Bengali community in Assam and Tripura in India between April 13 to 16. Thank you.'",
        "'speaker_2': 'Well.'",
        "'speaker_7': 'Oh, my. Good evening, everyone. My name. He sighs and can. I am here today. We are tomorrow and available from different temples throughout the city. Language and behalf of all women and girls who like to say thank you.'",
        "'speaker_7': 'Everyone, especially council woman Sully. Settle for a reuniting. Come on in New Year, as you saw in this picture. It is very important holy day for Cambodian in Southeast Asian community. And we all appreciate the city's support and continue to that this holiday.'",
        "'speaker_7': 'And I would like to play for you people. The car, but then the car. Yeah, but, uh. Yeah, the guy. And then the guy under the bed. Bye bye. And then starting lie down for one. And I know they're great.'",
        "'speaker_7': 'So, my dear, that was a great night and all how I know. So my ideas are mine but not all how I know they could. I saw them, I guess. And I think like. Uh. Um. Uh. To. Uh.'",
        "'speaker_7': 'To.'",
        "'speaker_1': 'That concludes public comment.'",
        "'speaker_0': 'Victory Richardson.'",
        "'speaker_3': 'Yes. So I just thank you so much for those who attend came to speak and share your comments. I want to express my appreciation for everybody who has been part of helping to ensure we uplift the Cambodian community's tradition in celebrating the new year.'",
        "'speaker_3': 'And it's a time, as stated in the video and as stated in various theme, it is about unity. And I look forward in our pathway towards there in the ways that we can work together as a community and as a city to celebrate our annual tradition.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_5': 'I'll just add my my thanks to Councilwoman Ciro for bringing such a great video and presentation and to everyone who spoke today. Jumping. I'm so happy New Year to you. Look forward to continuing to celebrate your tremendous culture here in our city of Long Beach.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Compliments of the house.'",
        "'speaker_2': 'Thank you, Mayor. Thank you, Councilmember Sara, for this great presentation today. I think that that's one of the beauties that we have here in the city of Long Beach is being able to celebrate our diversity and what a beautiful tradition to celebrate.'",
        "'speaker_2': 'I'm really happy to be in be able to celebrate Cambodian New Year's. So happy Cambodian New Year to everyone.'",
        "'speaker_0': 'You. Thank you, sir. There's no additional comment. Correct. Okay. Well, thank you. We're going to go ahead. And do I believe a photo complimentary? Did you want to?'",
        "'speaker_3': 'Yeah, I was wondering if we as a council member can join the community who came up for the item to take a group picture? I believe there's a few resolutions presented from the mayor's office, so I was wondering, we can do that really quick.'",
        "'speaker_3': 'If you guys could come over just to do a quick because I know that I and those that came for the item maybe can come forward. And as the whole council, if we can go forward and just take a group picture because.'",
        "'speaker_0': 'We're going to do consent. -12 and eight, though.'",
        "'speaker_1': 'We need a vote on this item first and then I'm sorry. We need to cast our votes on this item.'",
        "'speaker_0': 'Yes. Okay.'",
        "'speaker_1': 'Can you activate it? Yeah. Councilman Austin. If you can cast your vote. Thank you. Motion is carried.'",
        "'speaker_5': 'All right. Now we're going to take the the consent calendar one through 13, except eight, 11 and 12. Okay. It's been moved and seconded as a public comment on the consent.'"
    ],
    "Business License Appeal by JP23 Hospitality Company.": [
        "'speaker_5': 'Thank you. With item eight, please.'",
        "'speaker_1': 'Report from Financial Man Financial Management Recommendation Refer to hearing officer the Business License Application Denial Appeal by JP 23, Hospitality Company located at 110 East Broadway Avenue, District one.'",
        "'speaker_5': 'Okay. Let's go to staff report, please.'",
        "'speaker_1': 'Good evening, Mayor and members of City Council. The Department of Financial Management determined it was appropriate as well as required per our duty given by the Long Beach Municipal Code to deny the business license for JP 23 Hospitality, Inc.'",
        "'speaker_1': 'The business owner followed the process afforded within the Long Beach Municipal Code to appeal. The action before you is for the City Council to consider whether to hear the entire case or refer it to a hearing officer also allowed within the Long Beach Municipal Code.'",
        "'speaker_1': 'It is staff's recommendation that you refer it to the hearing officer selected by the city clerk's office. And that concludes my report. Both myself and Deputy City Attorney Art Sanchez are available for questions.'",
        "'speaker_5': 'Thank you. We're going to go to public comment. We see 11 speakers, so we got to 90 seconds. So could Steven Tillet, Jacob Pusey, Carla Curtis, Melander come forward. I'll read the next few just so they can be ready.'",
        "'speaker_5': 'Samantha Perez. Anthony Hale. Eric Williams. Gurjit Badel. Michelle C, Jackie Cordova, Perla de and Zwei Roybal. So starting with Steven Tillett, you have.'",
        "'speaker_0': 'Four men, okay. Good evening. Members of the council. I would say, Mayor, but so why I'm here. My name is Stephen Killing. I'm the executive director of a nonprofit called Elad, which stands for Effort, Love, Action and Determination.'",
        "'speaker_0': 'I'm originally from New Jersey. Ten years ago, I met Mr. Keller. And ever since I've met this man. Things have changed. Not just for myself, but almost everybody around him. What he's able to do in a community. To help that community.'",
        "'speaker_0': 'Is who he is. Now, I know that you guys don't know him personally. And what he's entrusted me with as the executive director of a nonprofit is to be able to reach out to different communities. Sort of like a liaison.'",
        "'speaker_0': 'And I do this for him without pay. And I do this because Mr. Pools and Carlos, one of our biggest donors. With the caveat that we do work in the areas where he has businesses. So what we do is we come in and we attempt to make a relationship with all of you, with the police, with the'",
        "'speaker_0': 'Recreation Department, which we have reached out to a friend of mine. Her name is Ashley Gazette. I'm sure some of you probably know who she is, and she can vouch for the fact that months ago we reached out in order to try and help, because Eli's focus is the youth of the communities.'",
        "'speaker_0': 'We believe in helping the youth in the different communities. So with time running out, I'd just like to say, I don't know what your process is, but I do know who this man is. And I can tell you he is exactly the type of business owner that you want in your community.'",
        "'speaker_0': 'He is exactly the type of man that you want to have a business because he does ingratiate himself into the community. That's part of the family.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Thank you. Next is Jacob from DeKalb.'",
        "'speaker_0': 'Hi. Good afternoon, city mayor. Mayor Garcia. City Councilman. City Councilwoman. Thanks for giving me an opportunity to speak on behalf of the 70 employees of JP 23. My name is Jacob Carver. I am the founder of JP 23 Hospitality Company.'",
        "'speaker_0': 'Being born and raised in Montreal, Canada, it was always been my dream to open an entertainment venue in the city of Long Beach. Four years ago, that dream became one step closer. I saw potential in a rundown location that was closed for many years.'",
        "'speaker_0': 'Here I am for nearly four years later, surviving and trying to hold on to that dream. I spent nearly $3.5 million in that location, and many 18 hour days have passed. For the past four years, we in the restaurant industry, if you don't mind, or if my staff stand up all the 70, that's just a fraction of'",
        "'speaker_0': 'the people that work at JP 23. Now we at we probably endured one of the we probably one industries that were hit the worst during the pandemic. At what one point I was given, I was going to pull the plug on the whole project and I decided to go through with it.'",
        "'speaker_0': 'Now here I am confused why I was having difficulty entering delays and trying to get my business license first and then now the entertainment permit. This is an entertainment venue and I can't operate without an entertainment permit. Why?'",
        "'speaker_0': 'We were denied a temporary entertainment permit as the municipal code allows us to have. So now wait. Why? Okay. Hardworking people that include. Why are we going to the snap? How to stop a finger, get rid of all these jobs, of all these hardworking people that include single parents, students, all walks of life.'",
        "'speaker_1': 'Sir, your time has expired.'",
        "'speaker_0': 'I just ask for this hearing to be heard in front of city council instead of the public officer just to have a fair chance at us. Thank you. Thank you so much.'",
        "'speaker_5': 'Thank you. Curtis Millender. After. Curtis is Samantha Perez, then Anthony Hill. Curtis.'",
        "'speaker_0': 'Good evening, counsel. My name is Curtis Melander. Really quick. I met Jacob ten years ago. And Jeff, I know he's been a big factor in my family's life as well as mine. So I know all his employees and everybody else.'",
        "'speaker_0': 'He's a big service to everybody. So I just want to, you know, make sure to accept that we get a fair shot. So thank you.'",
        "'speaker_5': 'Thank you. Next to Samantha Perez and then Anthony Hill and then Eric Williams. I'm say Samantha, not here. Okay, Anthony Hill, you're up. Okay. Anthony Hill. Not here. Eric Williams.'",
        "'speaker_0': 'Hello. Good evening. I'm Eric Williams. I bring a lot of entertainment to JP 23, and I'm an artist myself. I've made records with Dr. Dre and everybody back in 87. So. That Dr. Dre shook night area that's overweight that's just in the past now that the puffy era the the the type of business the type of entertainment'",
        "'speaker_0': 'he's trying to bring is this clean rap, this clean R&B. And that's what we've been doing lately. You know, is is has been not one problem. And I've seen I don't been through the the ship ignite the death row era.'",
        "'speaker_0': 'I didn't seen all of it. But this guy JP 23 that the club is bringing clean entertainment and that's all I have been since I've been going up there. So just like the other guy say, I just want him to get his shot because I it's been it's been it's been okay since I've been seeing it.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Thank you. Next is Gurjit Ba Dal, then Michelle C, then Jackie Cordova.'",
        "'speaker_0': 'Good afternoon, City Council. My name is Gurjit. I'm actually a dear friend of Jacob. I've known him for about nine and a half, ten years. Also, just like you can tell, he's a very supportive friend. Also, I eventually started working with him.'",
        "'speaker_0': 'He helped me start a marketing company in the past year during COVID. I also had a hard time with COVID, with my personal business. I was a wedding photographer and that went under and Jacob supported me and helped me put me back on my feet.'",
        "'speaker_0': 'So I'm very grateful to him in that aspect. But over the last year and a half, working with him and seeing him, how he is with the staff, his family, you know, he is a very caring person, does care about his business, puts his all into it, is very transparent, who has his heart on his sleeve, knowing'",
        "'speaker_0': 'what's going on. I also like to say that, you know, we're a community and a lot happened in the past few years with COVID. We should look at supporting the businesses and businessmen, putting money into Long Beach if you know, there's some process that wasn't done the way that was supposed to or not.'",
        "'speaker_0': 'I know Jacob's done everything in his power to try to get the the licenses and whatnot. But, you know, as you can see, many businesses have gone under during COVID. I want to say that we are a community.'",
        "'speaker_0': 'We should help each other. And, you know, instead of trying to stop his business and operation, we should advise and let him know the right processes and what you guys would like us to do to help get this business back to the track that we're looking to.'",
        "'speaker_0': 'All we're trying to do is bring, you know, beautiful entertainment and a beautiful bar to the city of Long Beach. So I hope that you guys would give him a fair chance. Thank you.'",
        "'speaker_5': 'Thank you. Next as Michelle sees and Jackie Cordova and then pro.'",
        "'speaker_2': 'Hello, everyone. My name is Michelle Castillo. I am from the Hashemite Nation. I come representing my elders, my Hashemite elders, and also my tongva elders. Just a reminder that you are on Tongva land. And I'd like to acknowledge my ancestors.'",
        "'speaker_2': 'We are community. This. These women behind me. Our community. The men with us are true community. I am a land protector, a sacred site protector and ocean protector. And I stand with missing and murdered indigenous women. What's going on with JP 23?'",
        "'speaker_2': 'They made a mess in Orange County, California, in Fullerton. Rape people were drugged. People are getting beat up at that club and now they're coming into precious tongva land. Hashim Inland, the land of my ancestors. And the same mess that happened in Fullerton is going to happen in the city of Long Beach.'",
        "'speaker_2': 'And I'm just here again representing the elders of Long Beach and asking you to please deny their license. All my relations.'",
        "'speaker_5': 'Thank you. Next is Jackie Cordova, then Perla de Way, Red Ball.'",
        "'speaker_2': 'Thank you. Good evening, Community. I am Jackie Cordova. I am a mother of Santa Ana. I am here for our daughters. I'm here for the protection of our women and children. I am here as a voice for the missing and murdered indigenous women of this tongva nation.'",
        "'speaker_2': 'For several months, we have been standing up and raising attention to the 40 plus allegations of sexual assaults, drugging, kidnaping and rape stemming from JP 23 Urban Kitchen Restaurant Bar in Fullerton. Our latest protest was held at the Fullerton Police Department for their lack of safety concern for our safety.'",
        "'speaker_2': 'We stand with the victims. We believe them. We give them courage to come forward. April is Sexual Assault Awareness Month, an annual campaign to raise public awareness about sexual assault and educate communities and individuals and how to prevent sexual violence.'",
        "'speaker_2': 'We demand an end to rape culture. We came tonight to warn Long Beach about JP 23, hospitality company trying to establish business. We demand safety for our children, for our businesses and our communities. We urge you to fully investigate these applicants as they come forward.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you. Next, this property.'",
        "'speaker_3': 'Good evening, Long Beach. My name is.'",
        "'speaker_2': 'Burleigh.'",
        "'speaker_3': 'I also am a mother in Santa Ana on August 2nd, 2021. Our news broke out that a 22 year.'",
        "'speaker_2': 'Old student.'",
        "'speaker_3': 'Was brutally raped.'",
        "'speaker_2': 'And left naked in.'",
        "'speaker_3': 'A parking structure down the street from JP 23. She had only been a JP 23 and didn't have that much to drink, so it was suspicious as to why she couldn't remember anything. I decided to pull up to the first rally that was outside.'",
        "'speaker_3': 'As a mother of a 25 year old young woman who has also been a victim of.'",
        "'speaker_2': 'Sexual assault.'",
        "'speaker_3': 'And a mother of a Navy veteran. I understand this kind of violence. So I'm here to warn Long Beach about what's about to break out if you allow this man to open business. 40 plus people have come forward, women that have had half a drink at his bar and not remembered where they have been.'",
        "'speaker_2': 'People that have walked into a room.'",
        "'speaker_3': 'Full with condoms and tampons and pads and.'",
        "'speaker_2': 'Undergarments. So I am pissed.'",
        "'speaker_3': 'But my anger is not just mine. My anger comes with 500 years of age.'",
        "'speaker_5': 'Thank you. Robert Gribble, our final speaker.'",
        "'speaker_2': 'Hello. My name is Jos Wrobel Castle. My traditional name is out there. We all wish we were. It means one that people know before they meet her. The reason I bring up my parents and my last name, my mother is Roy Rosemary Roybal.'",
        "'speaker_2': 'My father is Richard Dean Cassell. The reason I bring them up is because they met here in Long Beach many, many years ago. I'm here to stand together and in support of the 40 women. Are survivors. I'm a mother.'",
        "'speaker_2': 'I'm a daughter. I'm a big advocate for my w. I have a tattoo on the side of my head to let women know that I am a safe place for them. And so I am standing here for that reason tonight to use my voice as an entertainer.'",
        "'speaker_2': 'As an entertainer, as a mother, as a daughter, as a sister, as an ex-wife. And as a grandmother, I stand in support of these women. And I ask you to please reconsider this, because if this has happened in Fullerton, I can guarantee that it will probably happen here as well.'",
        "'speaker_2': 'And we don't need bad business like that, especially if I'm going to show up in the entertainment business and accidentally bump elbows with folks like that. It's not a good idea. So I ask you, on behalf of the women that have survived this and other women that haven't come forward to please stop the madness and google my'",
        "'speaker_2': 'w if you guys want to know what it is. Stands for murdered missing indigenous women. And it also covers our children and our men.'",
        "'speaker_5': 'Thank you, Councilwoman Zendejas.'",
        "'speaker_3': 'My name's Samantha.'",
        "'speaker_1': 'Perez. Sorry, I was. Do I still have time to talk?'",
        "'speaker_3': 'Were you seen around?'",
        "'speaker_5': 'Okay. Yeah. Okay. I think you're on the list.'",
        "'speaker_1': 'Yeah, I'm definitely on the list.'",
        "'speaker_2': 'Go for it.'",
        "'speaker_3': 'Okay. So my name is Samantha Perez.'",
        "'speaker_2': 'I'd like to.'",
        "'speaker_1': 'Just give a.'",
        "'speaker_3': 'Little quick background. I started working at JP 23 in Fullerton. I just want.'",
        "'speaker_2': 'To you know, I'm a woman. I'm also a mother.'",
        "'speaker_3': 'I started working at JP 23 in Fullerton when I was 21. He gave me an opportunity. I was a college student. I worked there for probably about four years. I paid my way through college working there.'",
        "'speaker_2': 'And no.'",
        "'speaker_3': 'Debt, which is always nice and flash forward to graduating going into a different sort of industry. Human Resources. I now came back to work for JP 23 because this is a family owned establishment and it's unfortunate. I worked at other bars in Fullerton and it's unfortunate that this happens in college towns, but it has nothing to do'",
        "'speaker_3': 'with Jacob as a person. It has absolutely nothing to do with our bar. We employ 60% of women. He makes sure every night that we're getting walked to our car by bouncers. I it's okay. I don't want anyone to assume anything based off.'",
        "'speaker_2': 'Of what you've.'",
        "'speaker_3': 'Heard, because I am a woman and I have a child, and it has absolutely nothing to do with that. It has everything to do with the city and the way that all of the bars are necessary. If I would have anything to do with the bars, it has in my opinion, it's unfortunate that college towns that this'",
        "'speaker_3': 'happens, but that somebody who's just a really terrible person and has horrible morals that is going to take advantage.'",
        "'speaker_2': 'Of all women.'",
        "'speaker_3': 'We do our best as a woman. I've done my best to make sure that all of the women in our establishment are safe. So I won't tolerate that. This is my main goal. Even in Long Beach. I do want smart and sorry I'm a woman.'",
        "'speaker_3': 'I'm going to make sure that, you know, all the women stay safe. Leaving are that woman. Thank you. Thank you.'",
        "'speaker_5': 'All right. Thank you very much. Councilwoman Zendaya's, you have the floor.'",
        "'speaker_2': 'Thank you. My smear. Obviously, I am not in the business of denying, you know, business license to people. You know, one of the things I pride myself in is to uplift our businesses that are in existence. I want to thank everybody who who came out to to do their public comments.'",
        "'speaker_2': 'I really appreciate that. But I really would like to ask city staff if you could just go step by step on telling us or identifying why this business was denied. And also, if you could also clarify what this is for today.'",
        "'speaker_2': 'Today we are we are making a decision whether to refer this to a hearing officer. And if you could please, you know, reiterated in your words, please.'",
        "'speaker_6': 'Council member. Yes. This evening. The item before you this evening is to refer recommendation of staff is to refer the item to a hearing officer to hear the item. The denial of the business license. If council chooses to do that, then it would be sent to a hearing officer to be heard.'",
        "'speaker_6': 'A decision would be rendered by the hearing officer which could or could not come back to council, depending on whether it's appealed by either the applicant. So that's what's before the city tonight. If the city were to choose not to send to a hearing officer and and hear it as a council body, you could do that.'",
        "'speaker_6': 'But that would not happen this evening. It would be rescheduled at a future date.'",
        "'speaker_2': 'Thank you. Can you give us I know you can't give us too much information, but can you give us what has led to this decision to deny the license? Oh. Or is that part of because it's not part of what we're talking about in the item tonight.'",
        "'speaker_6': 'So Councilwoman, to answer your question, the I guess basis for the denial of the business license application for GP 23 Hospitality Company was based on violations of the municipal code and I don't want to get too specific, but operating without permits issued to the city I guess is at best basic, as I can put it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes. Thank you, vice mayor. I just think tonight's item is pretty simple. It's just a referral to the business appeal to a city hearing officer who will then make the recommendation to the city council. All right, that's that's the way I'm seeing this.'",
        "'speaker_1': 'This location, JP 23, was in my district before redistricting, and I also live very close to JP 23. And I know that we have received well over 100 emails regarding this this location. And it's a lot. It was a lot.'",
        "'speaker_1': 'So I know that District one is now handling that regarding, you know, just just different various complaints, which are is concerning and also the fact that, you know, I'm a big supporter of businesses. There's no one that's a bigger supporter than me.'",
        "'speaker_1': 'And but, you know, there are rules that have to be followed. Everyone should be abide by the rules. And having proper permits and and things like that are seemed like pretty easy to do and all the businesses I've owned in the city.'",
        "'speaker_1': 'So I don't know why this this operator hasn't done that, but nevertheless, I think it's going to be I look forward to hearing seeing the recommendation from the city's hearing officer. And I also appreciate everyone that spoke tonight to.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_6': 'And if I could just clarify that it would be sent to a hearing officer. The clerk maintains a list of independent hearing officers, and it's selected randomly. So it's not a city employee who's a hearing officer just for the public.'",
        "'speaker_6': 'It is a hearing officer that is selected to hear the matter and then would render a decision.'",
        "'speaker_1': 'Thank you for that clarification.'",
        "'speaker_5': 'Thank you, Councilman Austin.'",
        "'speaker_4': 'Thank you. I was away when this item was was presented in the restroom, but I wanted to just just get a sense of what the process is. So to go to an independent hearing officer, the hearing officer will make their recommendations.'",
        "'speaker_4': 'Will it come back to the city council?'",
        "'speaker_6': 'Thank you. Councilmember The answer is it could come back to the hearing, to the if it's appealed, if the decision of the hearing officers appealed, then it would come back to the city council.'",
        "'speaker_4': 'Okay. And maybe I just need a little bit more because, you know, I've been downtown. I've seen this business obviously operating for for some time now, a few months. And, you know, I do respect the the investment that anybody puts into our city.'",
        "'speaker_4': 'I want to want to kind of I don't know if we need to do that tonight, but at some point kind of walk through, you know, how somebody can can invest as much money as they have and then get to this point right.'",
        "'speaker_4': 'Where the city is potentially.'",
        "'speaker_0': 'So just just briefly.'",
        "'speaker_6': 'Councilman Aspen, I just wanted to clarify. So what is before you tonight is decision whether or not to refer this matter to a hearing officer. Ultimately, the city council is the trier of fact in this situation and in its referral of the hearing to a hearing officer.'",
        "'speaker_6': 'That hearing officer will conduct the hearing. They were rendered decision, I believe it's 15 days following the termination of the hearing. That decision will be put on council's agenda and counsel will have an opportunity to review the findings of the hearing officer and its decision and make its own decision based on its review at that time.'",
        "'speaker_6': 'So I just want to make sure that's clear regarding the business and the amounts that have been expended and all and and the councilman's point about, you know, how would you get this situation? I don't want to get into the specifics of that because I think it does go to the merits of the matter that is being'",
        "'speaker_6': 'appealed by the business.'",
        "'speaker_5': 'Thank you. Okay. So we've heard from city staff the recommendations in front of us is to begin the process by sending it to the hearing officer. Whatever that decision is, can be appealed back to the city council. So there's still due process here.'",
        "'speaker_5': 'My I encourage the operator through this process, be a good neighbor, build goodwill, get in front of the community and help build support to help make your case here. Because I think there's a lot to be said about investment here, but quality of life is incredibly important.'",
        "'speaker_5': 'Members, please cast your vote.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Agreement with Los Angeles Dodgers Foundation for Youth Baseball and Softball Program.": [
        "'speaker_5': 'Nine zero. Thank you. 11.'",
        "'speaker_1': 'Report from Parks Recreation Marine Recommendation to authorize City Manager to execute an agreement with the Los Angeles Dodgers Foundation to accept grant funding in an amount not to exceed 53,790 for the Dodgers Dream Team Program.'",
        "'speaker_5': 'Thank you. Thank you. Just. Mr. Modica, I'm not sure what what that was. I just heard something in speaker. Mr. Modica, just a brief staff report on the update on RBI. We don't need a lot of time on this.'",
        "'speaker_5': 'Yes.'",
        "'speaker_6': 'Brant. Dennis. Yeah. Thank you, Vice Mayor. We're really excited as a department to continue our partnership with the Los Angeles Dodgers to their foundation. So tonight, we're asking for approval to accept their support in the amount of $53,790.'",
        "'speaker_6': 'Beyond that, they do also provide a lot of other in-kind support for our program. We're excited because it really does introduce or give opportunities for nearly 930 kids to be introduced to baseball, primarily in the T-ball and coach coach pitch levels.'",
        "'speaker_6': 'But the funding helps offset the costs to support 77 teams at 24 different park locations with 12 to 15 players per team. And again, it's just a real great opportunity not only to continue our partnership with the Dodgers, but to spark an interest from young kids in our community for the great American support of baseball.'",
        "'speaker_5': 'Thank you. You have a list, the parks with the program?'",
        "'speaker_6': 'Yeah, I can I can.'",
        "'speaker_5': 'Just read them off.'",
        "'speaker_6': 'Quickly. 24. Sure. So I think they're not phonetic order. So the parks include Bixby College Estate, Shabazz, Cherry, Coolidge, Drake, Eldorado, Hartwell, Holton, MLK or King Park, MacArthur McBride or Zorba Pan-American Ramona Scheer Park Seaside Park Signal Hill Park Silverado, Somerset Stearns Veterans Wardlow and Whaley and in particular some of the larger park programs.'",
        "'speaker_6': 'And do include Hampton Park, where we have about 110 kids involved in nine different teams, just as one example.'",
        "'speaker_5': 'Fantastic. Thank you. Any public comment on leaving?'",
        "'speaker_1': 'No public comment on the side.'",
        "'speaker_5': 'Of seeing nonmembers. Please cast your vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_5': 'Thank you. We'll go to number 19, please.'"
    ],
    "Presentation from Long Beach Center for Economic Inclusion.": [
        "'speaker_1': 'And we still have item 12 of the content calendar as well.'",
        "'speaker_5': 'I know we're going to go to 19/1 and then we're going to do 12.'",
        "'speaker_1': 'Item 19 Communication from Vice Mayor Richardson, Councilwoman Sarah Member Councilmember UNGA Recommendation to receive and file a presentation from the Long Beach Center for Economic Inclusion on their progress and activities in their first two years of operation.'",
        "'speaker_5': 'Thank you. So I wanted to invite Long Beach Center for Economic Inclusion here to our Long Beach City Council for an update on their progress over the past two years. And while they make their way forward for the presentation, I just want to say we're incredibly proud of the impact that they've had and they'll share more details'",
        "'speaker_5': '. But it's been, you know, over $2 million the port deployed into our communities to make a real difference in people's lives. And at the end, we're going to recognize Julie Lee, who's played a major role in the Long Beach Food Support Network.'",
        "'speaker_5': 'And so that's it. We're going to pass it over to Julie. Excuse me, Jimmy. Vivian Juliano. Julie's over there. Vivian. She Miyama. Thank you.'",
        "'speaker_2': 'Thank you, Vice Mayor Richardson. And thank you to the city council, her city officials and the members of the public here today. Hi, I'm Vivian Chumo, Jamar, and I'm the vice chair of the Long Beach Center for Academic Inclusion.'",
        "'speaker_2': 'And I'm going to maybe share a little bit more about our managing director, Arthur Ashe in Tech. But also I wanted to make sure and behalf of the Board of directors that we thank you for your support through the past two years.'",
        "'speaker_2': 'From the blueprint of the Economic Development Commission to Lombard Center for Economic Conclusion was formed. And so in the past two years we have been very busy even during COVID and to Northridge and talks going to share more about the work that we've done, but a little bit more about to do it.'",
        "'speaker_2': 'She's our managing director for BCI. She's also recently been been named the national CEO and president for London's The Center for Island History through to new US leadership. In the past 17 years, she has worked with LISC, L.A. local initiatives to support cooperation.'",
        "'speaker_2': 'She's also worked with the West Angeles CDC as the executive director. And maybe many of you heard about $250 million funding that came to our region through Wells Fargo. That, to know, was very instrumental in bringing that to our region as a seasoned executive director, economic development practitioner.'",
        "'speaker_2': 'She's worked in only not only nonprofits, but also private for profit for profits. She has a lot of strength in bringing communities together, advocacy, and she has worked specifically in real estate development and neighborhood revitalization. So through that work, she's been able to focus on affordable housing, she's focused focus on commercial development, entrepreneurship, and she has managed'",
        "'speaker_2': 'an asset portfolio of about 150 million over at West Angeles CDC. So not only did she manage that, but she grew that portfolio. And one other accomplishment I was on the board of was the Angelo CDC. And when she was able to bring to the community there a it was a 24,000 square foot commercial office project, the'",
        "'speaker_2': 'West Angeles Plaza. So as you can see, she is able to not only collaborate but also to bring resources to a community. Her awards can range free to many. But I want you to know that she serves on the Federal Home Loan Bank in San Francisco.'",
        "'speaker_2': 'She's also been on the Affordable Housing Council with the state of California. She serves on advisory boards not only for Southern California Edison, but Union Bank of California. And she also has worked with the Housing Commission, which is with the state of California to new was a graduate of M.I.T. She's a graduate of UC Berkeley.'",
        "'speaker_2': 'She we are very proud and honored to have her to be our managing director. And also, I want to thank Vice Mayor Richardson. During the time in the past two years, he's worked very closely with our board, as well as worked with the City Council on not only the everyone in, but the economic and equity initiatives that'",
        "'speaker_2': 'are bringing our city forward. So thank you very much for your support. Please join me to Noah and share more about the work of ABC. I think it's clear. Thank you so much to Viviane, who is the vice chair of the Long Beach Center for Economic Inclusions Board of Directors.'",
        "'speaker_2': 'I'm Tina THRUSH, intern and just so proud that the board asked me to not only come and join their ranks of the board, but to assist as their managing director. Today, what I'll be providing is just a brief overview of some of the accomplishments of the Long Beach Center for Economic Inclusion.'",
        "'speaker_2': 'And you'll get to see that that work is not done by one but a group of people, including our board of directors and our staff. Some of you may know a few years ago the city partnered with various council members here to make sure that we had an everyone in implementation plan that built upon the city's blueprint'",
        "'speaker_2': 'for economic development. You'll see here several reports that are listed there. And we're happy to say that not only did we meet with the community, engage with city stakeholders, as well as those from across the region to identify strategies around economic inclusion.'",
        "'speaker_2': 'Next slide from there. The Long Beach Center for Economic Inclusion was born focusing on issues of small business and entrepreneurship, workforce and youth development, housing and homeownership, as well as economic resiliency and connectedness. We wanted to make sure through our work that we serve those communities that have historically received a little less investment than other parts of'",
        "'speaker_2': 'the city or were in need of additional support for a variety of reasons, not the least of which included being low and moderate income communities. Those listed there include the north, central and west part of Long Beach. So over the last couple of years.'",
        "'speaker_2': 'Next slide. More than $2 million in resources have been leveraged to ensure that the Long Beach entire community had access to those. The pictures that you see listed here represent some of the activities of BCI. So how does that work get done?'",
        "'speaker_2': 'Next slide. With the help and support of our Board of directors at this moment, I'd like to ask our board of directors to please stand and be recognized. We have the Honorable Yvonne Benitez, Johnathan Chief Coleman, Sharon Diggs Jackson, Carl Kemp, Suni Chang, Eric Romero and Vivian Shimura.'",
        "'speaker_2': 'A round of applause for our board of directors. These folks have worked tirelessly, some of which we've started with the organization and getting it going. We also want to thank our staff who are here as well. Emily Kazim We have Jeff as well.'",
        "'speaker_2': 'Many of you know, please stand and Julie Leigh as well. Next slide, please. So I was hoping the vice mayor would talk about a number of our programs, but we're really excited about the small business work that we're doing.'",
        "'speaker_2': 'And I want to point out our CEO Small Business Forum that we held in 2021, focusing on entrepreneurs here in Long Beach, making sure that they're able to really get through during this tough time during the COVID pandemic and to create a peer network among them.'",
        "'speaker_2': 'We have also created several other networks for restaurant owners, owners and other support for small businesses throughout the city. We also next slide have our financial literacy programs. This program we're really proud to have partnered with Farmers and Merchants Bank on providing services in both English and Spanish, as well as stipends for those who were able to'",
        "'speaker_2': 'complete the program so they could really establish a credit, a bank account to get on the road to homeownership. Next slide, vaccine and COVID education. We know that parts of our city and some of our residents were falling behind and accessing the vaccine.'",
        "'speaker_2': 'And we took effort to make sure that community members had access to that next slide. This year, in 2022, we're very proud to announce a partnership with Wells Fargo, which we call the Black Wealth Initiative, really a response to the need to increase homebuyer education and access to employment resources in our city.'",
        "'speaker_2': 'We've already started hosting our first home buyer education class that sold out and look forward to additional work later this year. So next slide, where's I close for today? When you think about where you were during the pandemic, what were you doing?'",
        "'speaker_2': 'How were you supporting your community? One of the things that Lisa I can be proud of is that we pivoted our programs to make sure that everyone was fed. We led a collaboration of more than 25 local nonprofits and organizations, secured more than 600,000 of fresh food and produce and serve more than 4500 households.'",
        "'speaker_2': 'That network, we believe, served about 25,000 people, about 5% of the Long Beach population. And we helped those organizations access resources. Today, we're very proud to say that the leader of that work within I with Julie Lee. Yes.'",
        "'speaker_2': 'Julie Lee, a force for good during a time when people needed it most, brought her experience of more than 30 years to BCI and helped to lead this coalition. We list some of the organizations here who applaud and stand with BCI under Julie's leadership today.'",
        "'speaker_2': 'We look forward to working with this council to be able to recognize Julie for her heroic efforts and work during the pandemic and making sure that all of Long Beach was fed. Thank you. I'll turn it back over to the vice mayor.'",
        "'speaker_5': 'All right. Let's hear it again for Long Beach Center for Economic Inclusion, Inclusion and their brave board of Directors. Councilmember Turanga.'",
        "'speaker_6': 'Thank you, Senator, for including me in this. I think it's a wonderful program. You do a lot of great work. And I was out there for some of those food distribution events that you had out there, and the response was just absolutely wonderful to see a lot of people that were in need and to get the free'",
        "'speaker_6': 'food that they had. And you have a wonderful board Director-General, many of them very committed individuals who are basically all about Long Beach and thank you for all the work that you do and thank you for your leadership.'",
        "'speaker_5': 'Fantastic. Thank you, Councilwoman Ciro.'",
        "'speaker_3': 'Thank you. Yes. So I just want to congratulate you on two years, especially when you started I think you started during the pandemic. So just really hit the ground running and really doing what's true to your mission. And I'm looking forward to the ways that to seeing the work on the ground and this recovery period, because if'",
        "'speaker_3': 'you made it through and did great work during the pandemic, I can't wait to see what you all do in this process of after the pandemic. So just, you know, very excited to hear about the Black Wealth Initiative.'",
        "'speaker_3': 'I think it's very much needed in light of the conversations that we've had. And this is one I think, Julie, I've seen her at all of these food giveaway events and also doing digital divide work, I think bridging the digital divide, getting the word out with the cities program.'",
        "'speaker_3': 'So thank you very much. Looking forward to the work ahead.'",
        "'speaker_5': 'All right. Thank you, Councilwoman Zendejas.'",
        "'speaker_2': 'Thank you. Very smart. Your congratulations. I just couldn't be more proud of you guys. The thing is, everyone in implementation plan is based on a concept that, though shouldn't be new, is new to us. And congratulations on everything that you've been doing with it.'",
        "'speaker_2': 'It is it embodies the concept of inclusion and a power of the power that exists that when when something is created with such a powerful concept behind it, where it really focuses on everybody being able to thrive, I also valued the opportunity to discuss and receive this presentation on the on the operation of the center, because it'",
        "'speaker_2': 'is important that we all know what is going on behind the scenes. We are see you guys out in the community Bitcoin as the results showing us the numbers, the data and all the progress that you've made in these short two years just gives me so much hope for what this program can do in the next five'",
        "'speaker_2': 'years. So I know that we're in good hands and we're in good hands because this this this organization is powered by so many amazing people that really care about the future of Long Beach. And for that, I thank you.'",
        "'speaker_5': 'Thank you, Councilwoman Allen.'",
        "'speaker_1': 'Yes, I thank you, Vice Mayor, for bringing this item forward. And thank you, Mr. Mueller, for your awesome presentation. It's definitely great to learn all the incredible work that the Long Beach Center for Economic Inclusion has been doing and just how many resources were provided during especially during the pandemic.'",
        "'speaker_1': 'It's it's just incredible to see all the work that you have done in two years. And the the center is just literally hit the ground running and in definitely serve so many of our underserved neighborhoods in Long Beach.'",
        "'speaker_1': 'You already know this to know about organizations like the center really make a difference in our communities and and have a positive impact on all of our residents. So just thank you again for your presentation. Thank you for being here.'",
        "'speaker_1': 'And just thank you for all of your hard work.'",
        "'speaker_5': 'Thank you. Councilman Price.'",
        "'speaker_3': 'Thank you. And I wanted to thank you, too, for the presentation and the opportunity to see everybody that's working on the board and behind the scenes. I learned a lot tonight from the presentation. There are a lot of people involved in this effort that I didn't know were involved in this effort.'",
        "'speaker_3': 'I've had the privilege and the honor to work with Julie Lee, of course, in her work at UCO, and she's fantastic. And so and I welcome you to your new position. That's pretty awesome. Your new title, I guess.'",
        "'speaker_3': 'I don't know. It's is sort of a new position.'",
        "'speaker_2': 'Leadership role. Well, that's welcome. Yeah.'",
        "'speaker_3': 'I don't know what to call it, but. But there was a nice introduction of yourself. Welcome and thanks for the presentation.'",
        "'speaker_5': 'Fantastic. Thank you. We do have one public comment, so I can say if you want to come forward now.'",
        "'speaker_2': 'Hm.'",
        "'speaker_0': 'So I can be District six resident. Big fan of the work that's coming out of LPC. I, um, I partnered with a couple of, uh, religious entities during the COVID response to the Food Support Network that they have.'",
        "'speaker_0': 'So, uh, they help feed a lot of hungry people during the, this last year and, uh, a lot of communities that wouldn't have had access to a lot of the, you know, those boxes without the aid of ABC.'",
        "'speaker_0': 'I so appreciate her value their work. As my Councilperson reiterated, I'm much excited about the Black Wealth Initiative. I saw the, uh, good opportunities that are coming along with the relationship the LPC has with with Angela's and excited to see the first time homeowners that come out of this that are locally here in Long Beach.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_5': 'All right. Thank you. So we're going to invite the group up. And if the council wants to come down, we have a recognition for Julie Lee and I'll just say thank you to two years in. Right. You answered the call.'",
        "'speaker_5': 'You stepped forward at a very difficult time. And I'll tell you, the sky's the limit. Continue. You stepped up when the city called and said, we need a community development corporation to step forward and meet all of these needs in our city.'",
        "'speaker_5': 'And you stepped forward to do so. And so I can't wait to see what the future holds. So thank you so much. And we have this proclamation for you now. Thank you. Members, please cast your vote.'",
        "'speaker_1': 'Councilman Santo has.'",
        "'speaker_5': 'Councilman Zandi has.'"
    ],
    "Contract Amendment and Extension with United Storm Water, Inc. for Storm Drain Maintenance and Repair. ": [
        "'speaker_1': 'Motion is carried.'",
        "'speaker_5': 'Thank you. Number 12, please.'",
        "'speaker_1': 'Report from Public Works recommendation to authorize City Manager to execute all documents necessary to amend contract number 3435 to with United Storm Water Inc for routine storm drain maintenance and repair and extend the term of the contract to September 30th 2022 citywide.'",
        "'speaker_5': 'Thank you there staff report here.'",
        "'speaker_6': 'Eric Lopez and give a very brief staff report. Thank you, John. Vice Mayor, members of the city council, we're looking for authorization to extend the time on one of our agreements with United Stormwater. United stormwater does maintenance for us.'",
        "'speaker_6': 'They do repairs, modifications as needed, emergency response and other services needed for our citywide storm drain system. The the staff is currently going through a process of a new RFP for a long term agreement, but we need some additional time in order to be able to continue to provide some of these services in the meantime.'",
        "'speaker_6': 'That includes an assessment report.'",
        "'speaker_5': 'Council member supernova. Thank you. I'd like to move to approve the item as written with the caveat that Public Works provides oversight to ensure the contractor is fulfilling the terms of the contract specific to a storm drain that runs adjacent to the Long Beach Community Garden and El Dorado Nature Center from Spring Street on the north to'",
        "'speaker_5': 'Willow Street on the southern end. Thank you. Thank you. Any public comment on this item?'",
        "'speaker_1': 'No public comment on this item.'",
        "'speaker_5': 'Okay, members, please cast your vote.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Support for Assembly Bill 1621 on Unserialized Firearms.": [
        "'speaker_5': 'Thank you. We have item two, please.'",
        "'speaker_1': 'Communication from Councilwoman Sarah Chair, Public Safety Committee Recommendation to request City Council to approve the Motion of the Public Safety Committee of on February 25th, 2022 to support Assembly Bill 1621 to enact legislation relating to unsterilized firearms.'",
        "'speaker_5': 'Thank you, Councilman Zoro.'",
        "'speaker_3': 'Thank you, Vice Mayor. So, yes, so back in February 25th during Public Safety Committee, we made a motion to support this legislation. But at that time, it was an intent bill. And I wanted to make sure we had it amended to be policy before bringing it forward to council today.'",
        "'speaker_3': 'And it was amended back on the 26, which and that is why it's here today. And so when I think, you know, the police will be PD for doing a presentation on those guns as well as the increasing violence or increasing gun violence.'",
        "'speaker_3': 'And I think that this item is timely given that President Biden's just announced a ban just yesterday on unlicensed kits to manufacture the ghost gun, which I believe. I am wondering if we can have Mr. Curley explain how how this work with this ban, federal ban, and how would it work with our state legislation?'",
        "'speaker_3': 'And also how would that impact are the local feasibility that was just passed last week? And so I'm wondering if you could answer those question.'",
        "'speaker_6': 'Absolutely. Thank you, Councilwoman. So essentially, the state bill that is the core focus of this item would expand the definition of what constitutes a firearm in terms of what's required for, you know, having a serial number, tracking purposes and regulation.'",
        "'speaker_6': 'The federal rule that was announced yesterday by the president does very similar thing in terms of essentially requiring background checks and serial numbers for kits that are used to be able to create firearms. The main difference, of course, though, is just essentially a jurisdictional issue.'",
        "'speaker_6': 'So the federal rule would apply to the ATF, whereas the state rule or law, if it were passed, would apply to state level local law enforcement as well. But at this point, they are complementary in terms of their policy approach to addressing the issue of ghost guns.'",
        "'speaker_3': 'Thank you. Well, then, I think with that being said, I really like staff to take it into consideration with the federal ban that was just done, the announcement on the ban by the president as well as the state bill.'",
        "'speaker_3': 'And we can take that into consideration as we're thinking about a local feasibility study on how that would be impacted, because I am just concerned that we may spend all this time to do a local study when we and then come to find that the federal as well as the state ledge could just really supersede all of'",
        "'speaker_3': 'that. So thank you very much. And yes, thank you.'",
        "'speaker_5': 'Thank you, Councilmember Durango.'",
        "'speaker_6': 'Thank you, Councilmember, truly for bringing this forward because we're so sorry that presentation that we received at the Public Safety Committee was very enlightening, very educational, very informative. And we know that this has reached the federal level. I think it speaks volumes about what is out there and the dangers that these guns pose.'",
        "'speaker_0': 'For our.'",
        "'speaker_6': 'Local community. So I'm very glad to support this item.'",
        "'speaker_5': 'Councilman Price.'",
        "'speaker_3': 'Thank you. And Councilwoman Zoro, thank you so much for bringing this item. What a great idea for us to take up. And I'm so grateful that we're doing that tonight. I think it's very timely. I think the purpose of last week's item was to kind of.'",
        "'speaker_2': 'Look at what.'",
        "'speaker_3': 'Local ordinances.'",
        "'speaker_2': 'We could and put into our municipal code that would strengthen the municipal code in regards to ghost guns specific.'",
        "'speaker_3': 'To misdemeanors. So I agree with you. I think if there is some state.'",
        "'speaker_2': 'Legislation that supersedes, then obviously the municipal code would be moot.'",
        "'speaker_3': 'But my understanding of the state legislation is that right now is that it doesn't incorporate some of the enumerated actions that we deemed would potentially be a misdemeanor if committed in the.'",
        "'speaker_2': 'City of Long Beach.'",
        "'speaker_3': 'Such as possession of parts and things of that nature. So I look forward to the report coming back. And I think this is this is a fantastic item. I would like to.'",
        "'speaker_2': 'Offer a friendly.'",
        "'speaker_3': 'That we direct staff to.'",
        "'speaker_2': 'Support the federal.'",
        "'speaker_3': 'Efforts to stop ghost guns.'",
        "'speaker_2': 'Introduced by President Biden earlier this week.'",
        "'speaker_3': 'As part of.'",
        "'speaker_2': 'Our efforts to.'",
        "'speaker_3': 'Really take a look at ghost guns.'",
        "'speaker_5': 'It's been often.'",
        "'speaker_0': 'When we.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_3': 'So actually because it's a federal legislation, I like to for it to go to the Fed large committee if that's possible. So I don't know it's to make up.'",
        "'speaker_5': 'Oh it's the so you're accepting the friendly by but alternative to say to send it.'",
        "'speaker_3': 'To go to the fat ledge.'",
        "'speaker_2': 'Committee.'",
        "'speaker_4': 'Okay Councilman Austin so I'm glad to see this item here. And I think this reinforces our conversation from a week ago where we were having the same conversation about the same issue of ghost guns. They are creating quite a challenge and in our community they are public safety challenged in a big way.'",
        "'speaker_4': 'And so I commend Councilmember Ciro for for bringing this item this week. Again, we had a conversation last week. Councilmember Price brought something last week as well. And it just this is a double down effort. And I think this sends the right message to the residents of Long Beach and anybody that comes in Long Beach that, you'",
        "'speaker_4': 'know, goes guns won't be tolerated, gun violence won't be tolerated in our city. So I'm happy to support this item. And I agree we should be having a full court press on this from the federal level, from the state level and the local level to keep our residents safe.'",
        "'speaker_5': 'Thanks. All right. Thank you. Councilwoman Day has.'",
        "'speaker_2': 'Thank you. Thank you. Council member Sara for bringing this item forward. Ghost guns are dangerous. They they increase the level of unsafe D.'",
        "'speaker_3': 'In our city and our.'",
        "'speaker_2': 'Neighborhoods and make it more challenging to address since they are on serialized weapons. So thank you very much for bringing this item forward. And I do feel and agree with those who spoke before. It is a very timely to coordinate this with the with the state and federal regulations that are happening.'",
        "'speaker_2': 'So think.'",
        "'speaker_5': 'Thank you. And before we go back to Councilman Ciro, just at my support for the item, I like everything I heard here today. I think we're in a good place. So we're talking about, you know, we're acknowledging the legislation happening in the state, acknowledging what President Biden is doing.'",
        "'speaker_5': 'And we have a local effort we discussed last week. So it's thorough, happy to support it.'",
        "'speaker_1': 'Councilman Allen Yeah, I agree with everything you just said. Vice Mayor in supporting from the federal to the state, I think this is a is a huge problem. And anybody, you know can purchase these gun kits and get their hands on these kits, people that have serious criminal backgrounds, people involved in domestic violence.'",
        "'speaker_1': 'I mean, even kids can get their hands on these these kits. And and a person who comes from a law enforcement background, these are really dangerous. And so I appreciate what we're doing and all my colleagues and all their efforts and support this wholeheartedly.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Thank you. Any public comment? Let's see. We have one tonight, I can say.'",
        "'speaker_0': 'Thank you. I just want to speak in full support of Assemblyman Mike Gibson's bill. I think that in support of the AR chair and vice chair, uh, the public safety committee for bringing this up, I think that, um, the government is, is kind of reconciling with the conversation about the plague of ghost guns.'",
        "'speaker_0': 'I mean, we had a very tragic mass murder here in the city of Long Beach, October 29, 2019. That was in effect due to go scans, uh, here on seventh. And, um, and, um, and, and temple, you know, it was a, it was a Halloween party that I was on my way to attend.'",
        "'speaker_0': 'And a childhood friend of mine was murdered as a result of ghost guns. So for me, this strikes very near and dear to my heart. A lot of the gun violence that we're currently engaged in currently is being engaged with in the streets right now is essentially people buying these kids off of the Internet and finding a'",
        "'speaker_0': 'way, a loophole to, uh, you know, of our municipal code to get around and establishing, you know, contact with these, with these items and murdering people because they know they can get away with it because there's no serial number.'",
        "'speaker_0': 'I mean, there was a shooting just today in New York in the subway, and they're still trying to figure out how that firearm was allowed. And I'm pretty sure, you know, I don't want to speculate, but I'm pretty sure that two was a ghost gun.'",
        "'speaker_0': 'And so, you know, I know we're in the implementation process of, you know, with with with the law about how we're going to engage with this. But I think that most people that have these items are, in effect, stone cold out to be murderers.'",
        "'speaker_0': 'I'm a legal gun owner myself. I have multiple firearms. And I have to go through a very lengthy background check in order to go through that process. So not to outdoors. I mean, certainly no, uh, local business. But with that said, no one's dealing with this within themselves with these ghost guns.'",
        "'speaker_0': 'And we're just going to see in the next 5 to 10 years, it's going to be an epidemic, much the same alignment of the opioid crisis that we're currently dealing with. So I appreciate the counsel for stepping forward and getting ahead and making this happen.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Thank you. Members, please cast your vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_5': 'Thank you. Now we're going to go to Na Na Na agenda. Public comment. We have three speakers Ray Lawson, Rafael Pimentel and Tatiana Jensen.'"
    ],
    "Grant Application and Acceptance for El Dorado Duck Pond Restoration Project.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_5': 'Thank you. Number 23, please.'",
        "'speaker_1': 'Report from Parks, Recreation and Marine and Public Works recommendation to adopt a resolution to submit a grant application for the Land and Water Conservation Fund program for the El Dorado Duck Pond Restoration Project.'",
        "'speaker_5': 'It follows the motion in second. Any public comment?'",
        "'speaker_1': 'No public comment.'",
        "'speaker_5': 'Members, please. Councilman Mongo.'",
        "'speaker_2': 'Did we have a staff report on this?'",
        "'speaker_0': 'We have one, if you'd like one.'",
        "'speaker_2': 'Maybe a short staff report. This is a pretty big project and we're really, really proud of the work that Public works and Parks and Rec have done. The escalating costs due to inflation have really burdened this program. But I want to appreciate both Parks and Rec director Dennis and Eric Lopez for their continued commitment to the wildlife'",
        "'speaker_2': 'rest, the wildlife preservation at the center, and the additional resourcefulness that they have had to find to make this a reality. I look forward to the presentation.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_6': 'Eric, if you can briefly go through the report. Thank you, Tom. Uh, vice mayor, members of the city council where we are here. To provide a brief update of the Duck Pond project. The project will include a lot of different improvements to improve water quality, ecological function and end the habitat by restoring the pond liner, enlarging the'",
        "'speaker_6': 'wetlands and four bay, removing invasive species and replanting with California natives. The scope of work includes draining down the pond, removal of sediments. Some are a lot of size demolition, a lot of old concrete that needs to be replaced.'",
        "'speaker_6': 'Utility relocations. Construction of the new for being wetlands areas. Replacement of pumping and filtration systems. And we will do the landscaping and a lot of accessibility improvements in the area as well. We have a partner at the Long Beach Water Department that's providing funding, support and support with pursuing additional grant opportunities, and we want to thank them'",
        "'speaker_6': 'for that support as well. The big one of our one of the big parts of our project is to be able to take water from the pond, treat it, filter it, and then re-use it to help irrigate the adjacent golf course.'",
        "'speaker_6': 'That will also help reduce our dependance on potable water for irrigation purposes, which is another huge benefit of the project. The the the actual construction will be impactful. We will have we will need to relocate existing wildlife, both native and non-native.'",
        "'speaker_6': 'There will be temporary impacts, but the long term benefits will outweigh those temporary impacts. And we are working closely with our team biologists, with our community partners, with our different department partners to ensure we do this as carefully as possible, and also in coordination with our folks at Fish and Wildlife who are permitting the project.'",
        "'speaker_6': 'Our did permit the project and who will be part of the process as we go through this. Our funding, our total project costs are estimated at 9 million. We are currently seeking authorization to pursue another grant for a total of $3 million.'",
        "'speaker_6': 'The different funding sources that are contributing to the project include Missouri Measure W grant funding, general capital funds and a water department contribution. Our timeline. We are on pause right now because of nesting. We were trying to get a head start, but we noticed nesting activities on site.'",
        "'speaker_6': 'So we stopped. We paused. We worked with our regulatory agency partners and we are waiting to be able to continue construction later this year. The target to restart is September and our target to complete the project is November of 2023.'",
        "'speaker_6': 'And that concludes the presentation.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Councilman Schubert on. Thank you. So I don't know if you covered it. So the construction will likely start this September and take just over a year to complete. Okay. Thank you. All right, Councilman Mongo.'",
        "'speaker_2': 'Thank you. I think this is a really important time to show our our appreciation for staff. This is this just isn't a replacement project. When I was elected, we talked about the pond needs to be fixed. And fixing the pond as it is is one thing.'",
        "'speaker_2': 'We're substantially changing the way that the pond functions and serves the residents and the ability for it to be a real environmental impact to our community by restoring reclaimed water during the day. I also think it's a great opportunity to plug.'",
        "'speaker_2': 'As a kid, I've always gone to the duck pond and now here I am in my forties and we're finally restoring it. But as a kid, I didn't know that you shouldn't feed bread to the ducks, because when you do that, you're really ruining the liner and all the components of the pond.'",
        "'speaker_2': 'And so no matter what pond, you're out within the city of Long Beach. And I see Councilman Austin looking at me. He's really passionate about pond pumps as I am. We have to keep those pond pumps functioning and we need to ensure that parents know not to feed the ducks anything but duck food.'",
        "'speaker_2': 'So thank you for everyone for their participation in this project. We're really excited to get it started and I look forward to it being followed through to completion by the new council member over the Duck Pond Councilmember Supernova.'",
        "'speaker_2': 'But I'll be standing there and supporting all the way along. Thank you.'",
        "'speaker_5': 'Thank you, Councilman Sabrina. Thank you. As we were speaking, just got an email from Jill Brennan, who I know from years ago on the Sustainable City Commission. And she's asking questions of an article that just appeared in the grunion.'",
        "'speaker_5': 'And her question is, what is public works expertize on bird issues and whatnot? So I think I'd like to mention.'",
        "'speaker_0': 'That oversight.'",
        "'speaker_5': 'Is being provided here by the State Department of Fish and Wildlife. So if you'd like to comment and I add to that, I think that's an important issue we need to put out there.'",
        "'speaker_6': 'Absolutely, Councilman. And we also have a project biologist from Alassane Associates as part of the team that has relationships with the state agencies and that will help with some of that coordination. So our team does have expertize with wildlife and bird management through the project biologists from LSA Associates.'",
        "'speaker_2': 'And Mr. Lopez, what person what amount of money is being spent for wildlife preservation and support? I don't think people know how expensive it is to preserve the wildlife and how much the city of Long Beach cares about the birds and ducks.'",
        "'speaker_2': 'Swans?'",
        "'speaker_6': 'Yeah, Councilwoman, it's actually substantial. I don't have the exact figure, but a big part of the budget involves wildlife. Not just monitoring, but also the relocation cause. I would need to get that to you.'",
        "'speaker_2': 'I remember being surprised it was such a large number, but relocating turtles and ducks and swans and fish and all of that is very, very expensive. So people often come to the council and say, you don't do enough for the animals and the birds.'",
        "'speaker_2': 'This is a huge amount of money that we're spending to support the wildlife. And I appreciate the number of advocates that have come forward and appreciated that. And I think it's important for the community to know. Thank you.'",
        "'speaker_5': 'Councilman Austin.'",
        "'speaker_4': 'Thank you. And I'd like to just say I'm thrilled to see this this item come forward as chair of the Budget Oversight Committee. The duck pond issue seems to come up year after year. And I applaud my colleague, council member Mungo, now superstar, for their advocacy on this.'",
        "'speaker_4': 'Obviously, I have a duck pond in a great District eight chair park. But that kind of begs the question in terms of, you know, how many times do we really have in the city and what are we learning from El Dorado that we can apply in other areas of the city and other scenarios?'",
        "'speaker_6': 'Council And that's a great question. Not to duck the essence of the question, but we do have a number of bodies of water in our parks and we really see this project as a tremendous opportunity. Once the duck pond, as it's known reopens, is to reeducate our community.'",
        "'speaker_6': 'We're also in discussions with a lot of neighbors who care about the duck pond to create a friends of the Duck Pond organization and have docents that would be scheduled, particularly on weekends, to give guided tours, point out the different wildlife that does inhabit the area.'",
        "'speaker_6': 'And I know Animal Care Services has been working with public works to help address the relocation of there's quite a number of water turtles in the duck pond, I think over 500. So we'll be relocating some of those into other bodies of water in Eldorado Park.'",
        "'speaker_6': 'But there's also the opportunity for individuals that might want to adopt a turtle. So that will be available also. And Councilman, if I may, to just add to that, we do consider this an innovative project. It is something new and different, and we are looking forward to learning from it so that we can use this as a'",
        "'speaker_6': 'model potentially for other areas of the city where we have similar issues. So Measure W and other grant funding out there is available to do these types of creative, creative projects. So I just wanted to highlight that as well.'",
        "'speaker_4': 'Thank you. And I have been a councilmember in the district for, you know, almost ten years. I can tell you that the maintenance a lot of folks don't don't know what it requires to to maintain a pond and keep it, I would say, clean or even the algae levels, you know, maintain.'",
        "'speaker_4': 'But the pumps, it's the maintenance is ongoing. And then some of the things that you find inside of those those ponds at some point are can be quite alarming. And so, you know, it's almost like I feel like we almost need need to have somebody, you know, monitoring these ponds, you know, 24 seven to ensure that, you'",
        "'speaker_4': 'know, the ducks are being, you know, not being fed things that they shouldn't be fed, which I know is not realistic. But signage and more public education around how we manage these ponds, I think is very, very important.'",
        "'speaker_4': 'But happy to see this this item come forward and look forward to the restoration. Thank you.'",
        "'speaker_5': 'Thank you. Any public comment on this item?'",
        "'speaker_1': 'No public comment on this. All right.'",
        "'speaker_5': 'Members, please cast your vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_5': 'All right. So now we have our ending public comment. Any member of the public like to address the council? We have one. Dave Shukla. Please make your way to the front. Yeah.'",
        "'speaker_0': 'Good evening. Good to see you all again after our annual ritual of exotic fossil fuel machines driving around in circles. Um, I have some comments on agenda item number 21, which I can email you, but specific to last week's, uh, meeting.'",
        "'speaker_0': 'It was kind of disheartening to hear that we'd need yet another study session on surf after the first one was so uninformative. Uh, it read more like a, uh, like an argument for for why, uh, the city should try and lobby against the A.B., uh, 1873, I think it is.'",
        "'speaker_0': 'Rather than dealing with the realities of not only organics diversion, but the fact that a lot of cities may just not kind of pursue the credits since they have other obligations to their own population. So the economics of the facility, in addition to the fact that it's aging, creaky, um, and less toxic sludge, is good for us'",
        "'speaker_0': '. I mean, I don't know why we want to breathe in things like dioxins, um, along with all the other cumulative impacts in that site, uh, on the air as well as on the soil and water. Um, you know, facilities kind of, uh, kind of like a white elephant, you know, it's, it's something that had made sense and'",
        "'speaker_0': 'does make sense from a certain point of view for a certain group of people, but not for the entire city, let alone for how to deal with waste, especially nutritive. Nutritive, waste. Uh, used in compost. I'd like to see a realistic plan now that there are green beans in certain, you know, for certain restaurants already, I'd like'",
        "'speaker_0': 'to see a realistic plan for green beans. Uh, for for residents. Um, you know, I'd like to see more soil, not oil myself. Thank you.'",
        "'speaker_5': 'Thank you. That satisfies public comment. Thank you for attending. This meeting is adjourned.'"
    ]
}