{
    "ABC License Application and Protest for The Breakfast Bar 4th Street.": [
        "'speaker_0': 'Vice Mayor Andrews. Motion carries.'",
        "'speaker_2': 'No problem, sir.'",
        "'speaker_0': 'All right. Motion carries item 18.'",
        "'speaker_2': 'Yes. Please release me. Item.'",
        "'speaker_0': 'Item 18. Report from police recommendation to receive the application of the breakfast bar fourth Street for an original application of an ABC license at 3404 East Fourth Street submitted public notice of protest to ABC and direct city manager to withdraw the protest if ACP is granted.'",
        "'speaker_0': 'District three.'",
        "'speaker_2': 'And Councilwoman Price.'",
        "'speaker_1': 'Thank you very much. I'm glad to see this business coming to the third district. The business is the breakfast bar. It's coming to fourth streets and fourth Street and they have applied for an ABC license. I'm I support them very much with all the fantastic success that they've had at their downtown location.'",
        "'speaker_1': 'I know they're going to be a huge district, district three location for people to enjoy. I do want to clarify a few things on this application. We are conditionally approving the ABC license tonight on the premise that the owners will complete the SIU process.'",
        "'speaker_1': 'I don't know if there's any staff here, but if they are approved for the SIU process and the ABC license will be approved as my understanding, and I see Miss Tatum shaking her head in the affirmative. That is correct.'",
        "'speaker_1': 'Councilwoman Price, I would just offer a couple of distinguishing comments. Typically, a restaurant, unless it has a full service bar, is allowable for what we call a conditional use exemption. And because they have not yet formally submitted, I'm not sure what the status of their proposal is.'",
        "'speaker_1': 'Right. Okay. Thank you. So for anyone who's excited to go there and and partake in beverages, that may not happen until the CFP process is complete. That is correct. Thank you. I urge my colleagues to support this item.'",
        "'speaker_2': 'And, Councilwoman, you like to speak on that? Yeah. Fine, fine. Could you please. There any public comment on this item? If not, will you please cast your vote?'"
    ],
    "Donations to Long Beach City College Foundation for Long Beach Reads One Book Event.": [
        "'speaker_1': '3640.'",
        "'speaker_2': 'That's ZIP 32 or 36, which was 36.'",
        "'speaker_0': 'Item number 36 Communication from Councilwoman Mongeau. Councilman Austin Councilwoman Price Recommendation to increase appropriations in the Special Advertising and Promotion Fund Group in the City Manager Department by 1500 to provide donations to the Long Beach City College Foundation to support the citywide Long Beach Reads one book event held on March 19th, 2020.'",
        "'speaker_6': 'Councilman Mangum Thank you. I'm very blessed to hand over the microphone for just a few minutes to two of the committee members who have worked so diligently on this project, and the new appointed executive director of the Long Beach Community College Foundation.'",
        "'speaker_8': 'Thank you, Councilman. Council member. Sorry, Honorable Vice Mayor. My name is Susan Redfield, and many of you may remember Long Beach reads one book that ran out of the Long Beach Public Library Foundation. It stopped six years ago.'",
        "'speaker_8': 'I wanted to bring it back. And Long Beach City College agreed to sponsor it. And we are doing that this year. Long Beach reads. One book is back. The program is to encourage everyone to read the same book.'",
        "'speaker_8': 'This year's book is George Takei's graphic novel memoir about his experiences as a young boy in the Japanese-American internment camp and later his experiences as an actor on the movie the TV show Star Trek. And later as a gay Asian man and how difficult that challenge was.'",
        "'speaker_8': 'The book is appropriate for middle school and up. It's been vetted by our Long Beach Unified School District. My ten year old granddaughter read it in 2 hours, absolutely loved it, and sent a video to Mr. Takei about how good it is.'",
        "'speaker_8': 'It touches many values and themes that are important to us. We have five high schools reading the book right now and we have it. I wanted to confirm that I'm doing this right. Five high schools, librarians, librarian book clubs.'",
        "'speaker_8': 'Our city is known to have 145 book clubs, and they've been told about this program. The goal is to get everybody to read the book and then to come and hear Mr. Takei speak at a free an event that will be free for all students with a small suggested donation.'",
        "'speaker_8': 'But it's really a free event for Mr. Takei to speak on the campus of Long Beach City College a week from Thursday, March 19th. I think that's it.'",
        "'speaker_6': 'Thank you so much, I. This agenda item under advisement of the city attorney commits three councilmembers to each, giving you a $500 commitment from each of our sappi funds. And I would ask any other council member that is open to joining me.'",
        "'speaker_6': 'I would be happy to take a friendly amendment if you're open to making such a donation as well.'",
        "'speaker_2': 'Anyone else. Okay. Mr. Armstrong. Which? Usain Bolt.'",
        "'speaker_6': 'So prices next.'",
        "'speaker_2': 'Oh. That's one place.'",
        "'speaker_1': 'I wholeheartedly support this item and thank you for everything that you do and I'm happy to be contributing to the allocation. So thank you.'",
        "'speaker_2': 'As well.'",
        "'speaker_3': 'Thank you, Vice Mayor, Councilwoman Mongo, thank you for the invitation to join in. And Susan, I know we spoken about this. And, you know, I'm a big fan from, you know, I wasn't alive when the Star Trek show was out.'",
        "'speaker_3': 'But I do know Mr. Sulu and I know about this book. So you can count me in. So you can accept this as a mr. Sulu else's name on Star Trek. Anyway, thanks. Come on.'",
        "'speaker_6': 'I'm so thankful.'",
        "'speaker_3': 'I know my stuff.'",
        "'speaker_6': 'I'm thankful to the Trekkie in the ninth District and your commitment.'",
        "'speaker_3': 'Oh, this is a you know, I'm offering. Absolutely. I'm happy to support it. And like we talked about, the more we can make sure that we advertise this at the Obama library so people know about it, this free event of the better.'",
        "'speaker_8': 'Library and all the other libraries as well.'",
        "'speaker_2': 'Thanks so much.'",
        "'speaker_7': 'Thank you. Thank you, council members for bringing this item forward. We wholeheartedly believe in reading across every single age group and sharing and participating in as many book clubs as possible. So you can count us in for 500 as well.'",
        "'speaker_7': 'And again, a great book. I mean, I think it's a great book on so many levels and I really look forward to to finishing this. So thank you so much.'",
        "'speaker_2': 'Thank you, Councilwoman. And there's.'",
        "'speaker_1': 'Thank you. Ditto with all of my colleagues have said congratulations and I'm very happy to support this. I encourage everyone to participate and everybody, you know, reads a book because I think it also builds community. And I think that that's very important, especially when you have a shared common interests like this, and especially if you have a'",
        "'speaker_1': 'fun act for live action kind of book in all different levels. So thank you and I look forward to supporting you and spreading the word about this as well. Thank you.'",
        "'speaker_6': 'Do I hear a friendly amendment for the council colleagues not mentioned on the agenda? Item two also commit 500 from their SFP. Is that the friendly? Yes. Yes. She each said they they each said they supported you. I just want to make sure it was heard.'",
        "'speaker_3': 'Yes. Yes.'",
        "'speaker_6': 'Okay. So that makes it 30 $500 on.'",
        "'speaker_3': 'You guys got that? I move that we include Supernanny ranga to.'",
        "'speaker_2': 'I second that.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'I'm I'm happy to.'",
        "'speaker_3': 'I'm not going to do that. Okay.'",
        "'speaker_2': 'Way to go, Rick.'",
        "'speaker_6': 'I mean.'",
        "'speaker_3': 'You know, to the, you know, that motion that was drawn.'",
        "'speaker_6': 'I was going to say, when's the next time Rex is absent from council?'",
        "'speaker_2': 'That's what's.'",
        "'speaker_6': 'Thank you for your support. And I appreciate those who are able to come together. I mean, it's very tricky to be able to get council members to agree in advance because of the Brown Act requirements. I met with County Council, our city.'",
        "'speaker_6': 'See? Now look at me. I'm at my work job, the city attorney to figure out how that works. And so hopefully in the future there'll be a mechanism where we wouldn't have to gain compliance in advance, but there has to be a mechanism where if we all wanted to pitch in on something, that that would be possible'",
        "'speaker_6': '. So thank you for opening the door to figuring out what that looks like in the future. For those of you who didn't know, today's recognition of the women's suffrage was a case in which there was originally an intent by one or two council members that were looking to donate.'",
        "'speaker_6': 'And then we said, let's bring it to the full budget oversight committee and find a way to give as a whole to the organization. So that worked out. But this is seed money and so we look forward to being self-sustaining next year.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'May I ask a quick question? May we say that this is a partnership with the city of Long Beach then?'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_6': 'We're your sponsor. Thank you, Mr. Parker. The recognition that comes with a donation of that magnitude. Thank you.'",
        "'speaker_2': 'And before you leave, Mr. Perkins, you want to.'",
        "'speaker_5': 'I just clarifying that it was 30 $500. We have CD 1 to 3. Five, six and nine. Eight, nine?'",
        "'speaker_2': 'Yes. Okay, fine.'",
        "'speaker_6': 'Thank you. Thank you.'",
        "'speaker_2': 'That was the quickest money I've ever seen.'",
        "'speaker_6': 'Oh, that's not true. I remember the Budget Committee meeting this year. It was a last minute swap in your district.'",
        "'speaker_2': 'She's good.'",
        "'speaker_6': 'I don't forget. All right. Thank you.'",
        "'speaker_8': 'Thank you very much. And we hope to see you all there on March 19th.'",
        "'speaker_2': 'Fine, thank you. I'm fine now. Could we have any further comment on this item? CNN. Cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Exclusive Negotiation Agreement for Concessions at El Dorado East Regional Park.": [
        "'speaker_2': 'I think, you know, we're comfortable in Mongo. Did you want to move up 3 to 5.'",
        "'speaker_6': 'Please?'",
        "'speaker_0': 'I'm 32.'",
        "'speaker_2': 'That's.'",
        "'speaker_0': 'Report from Economic Development. Parks, Recreation and Marine recommendation to execute an exclusive negotiation agreement with Little Brass Cafe and the Grand Food and beverage for the maintenance and operation of concessions at El Dorado East Regional Park District five.'",
        "'speaker_6': 'Thank you. I'm really excited to hear an opportunity for those of you who don't know, 80% of the park land of the city is in my district. And while council members come forward on an annual basis in the budget process to ask for amenities for their parks, it is difficult for me to ask for amenities for all'",
        "'speaker_6': 'of my parks. And what I'm also working so hard to make sure that all the equity of the city is as represented. And so through that process, we started discussing what can we do for the parks to sustain themselves?'",
        "'speaker_6': 'And I'm excited to hear what the partnership between economic development and Parks, Recreation and Marine brings forward. And I think that in kind of setting the stage for those of you who don't know, our park has many, many individual visitors, but it also has lots of group events and functions and park permits are pulled.'",
        "'speaker_6': 'And so through this process, I hope to also find a remedy for some of the challenges that come with the number of park permits either pulled or permitted on a on a weekly basis. So I look forward to this opportunity with that city manager, please.'",
        "'speaker_2': 'Thank you again. First and second on. Is anyone. Okay, then does anybody come in on this item?'",
        "'speaker_0': 'There's no public comment on this item.'",
        "'speaker_6': 'I think public comment could come after the presentation. Oh, there's no one that signed up. Great.'",
        "'speaker_2': 'Okay, good. Good.'",
        "'speaker_4': 'Well, Councilmember and Vice Mayor, we would like to give a presentation. There's been some misinformation kind of circulating online, so we do want to take some time to really explain what this is, what it isn't, what the goals are, and what you're going to see over the next six months as we do an exclusive negotiating agreement with'",
        "'speaker_4': 'two firms to really test what's possible and whether this is going to be a very good fit for the park or not. So I'd like to turn that over now to John Keisler and Steve Scott to walk us through the presentation.'",
        "'speaker_9': 'Okay. Thank you, Tom. Good evening, Vice Mayor and members of the City Council. The item before you tonight is to enter into an exclusive negotiation agreement or DNA with Little Brass Cafe and the grand food and beverage, both from Long Beach.'",
        "'speaker_9': 'But before jumping into the specifics of the year, and I want to first provide a little background. So Eldorado East Regional Park is one of the gems of the city's park system. With close to 400 acres of natural beauty, the park offers something for just about everyone as parks and recreation professionals are.'",
        "'speaker_9': 'Objective is to provide our community with opportunities to be active and enjoy the outdoors. In the over 170 parks and open spaces that we have here in Long Beach. And the primary goal of this opportunity is about further enhancing our park visitors experience when they come to the regional park.'",
        "'speaker_9': 'We want our visitors to thoroughly enjoy their time with us in hopes that they come back for many happy returns in the park, but we don't presume to have all of the answers. So this Parks Concession and catering opportunity cast a wide net to see what concession offerings may exist out there.'",
        "'speaker_9': 'We didn't want to limit any innovative ideas, so we tried to keep the opportunity flexible in terms of proposed concepts. And through this effort, the city is looking to reactivate three existing vacant buildings to help better serve our park visitors.'",
        "'speaker_9': 'Because we are very early in the process, the action tonight will provide the necessary time for a thoughtful and collaborative approach to any park concessions. So a little bit about the park itself. Each year, El Dorado East Regional Park plays host to close to 1 million visitors who are there to enjoy the many great amenities that the'",
        "'speaker_9': 'park has to offer, such as walking, running and biking paths. Fishing and archery offer opportunities, a large and small dog dog park, bike rentals in the carousel, and train ride opportunities in the El Dorado frontier. This is in addition to our reserved picnic areas and overnight campgrounds in the park and of course, the Nature Center south of'",
        "'speaker_9': 'Spring Street. The park is also home to a number of special events throughout the year, from cultural celebrations to charity runs and walks in large company or family picnics just to name a few uses. Each year we issue over 600 permits for these events and smaller, smaller gatherings.'",
        "'speaker_9': 'So the goals of this opportunity are many, but none more so than trying to enhance the visitors experience when they come to the regional park. As previously mentioned, we use the solicitation as an opportunity to find out what new services are offering.'",
        "'speaker_9': 'Offerings are out there that can help us reactivate the unused park facilities and potentially generate additional revenue to the city. And it's important that these goals are balanced with the need of preserving the existing natural and idyllic park elements and do not negatively impact how visitors are currently enjoying the park.'",
        "'speaker_9': '180 day negotiation period will allow us the time to work towards ensuring that the progress in each of these areas is made. So just very quickly about the three existing vacant facilities, you'll see those on the aerial map before you.'",
        "'speaker_9': 'We have a which is an area to between Spring and Waterloo and then to facilities in the northern part or area three of the park. So going through each one of those very quickly are the first in area two is.'",
        "'speaker_9': 'Near the overnight campground. And it is a concession building that is close to 370 square feet and has previously been used as a concession building. Anticipated uses of this building would include such things as food and beverage, retail or other related opportunities that would help support the park users such as the overnight campers.'",
        "'speaker_9': 'Next slide. The second facility is the Golden Grove Concession Building. This building is the larger of the two concession buildings nearing close to 500 square feet. It is adjacent to the very popular Golden Grove Reserve picnic site. This would be a good area for such things as food and beverage, retail and other opportunities.'",
        "'speaker_9': 'And then lastly, what we're calling the lakefront in Area three. This is a thousand square foot building adjacent to what's commonly referred to as Alamo Lake, which was previously used as the park ranger station. And because this facility is more of an office.'",
        "'speaker_9': 'Facility or office setting see things such as office space or storage or even event planning and management would be good fits for this facility. So that very quickly is just some history about the park and a little bit about the opportunities goals.'",
        "'speaker_9': 'And I'm now going to hand it off to John who will speak to the the process utilized an exclusive and exclusive negotiating agreement.'",
        "'speaker_6': 'Could we first dove into. I know there's been a lot of misunderstanding online about the word retail. We're not planning to put in any big store or chain or anything else you're talking about maybe perhaps selling water and Eldorado Park or Eldorado Park hats or something.'",
        "'speaker_9': 'Things that could help enhance the park user's experience. And so something ways that they're already using the park, things that would help enhance that experience. And so you gave a couple of perfect examples. You know, other things could be, you know, things such as.'",
        "'speaker_9': 'Each monocular is for birdwatching or things like that. And those are what were envisioned when this opportunity.'",
        "'speaker_6': 'Well, I appreciate that because the misinformation out there that we're going to open like a yoga store in the middle of the park where there's going to be mats and yoga pants and things like that. For sale to the public is just a complete misinformation that has no factual basis.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Vice Mayor and members of the City Council. So I'm going to finish up with a little bit.'",
        "'speaker_9': 'About the actual process.'",
        "'speaker_4': 'And the council member touched on this first. First, we always want to identify the opportunity objectives. And in this case, the opportunity here is the existing footprint.'",
        "'speaker_9': 'So this the sites that Steve just mentioned.'",
        "'speaker_4': 'You know, we wouldn't exceed the existing.'",
        "'speaker_9': 'Footprint of those sites and we would look for ways that we could we could better activate those.'",
        "'speaker_4': 'Buildings. So what we do in economic development is we typically will engage a.'",
        "'speaker_9': 'Local broker who has.'",
        "'speaker_4': 'Contact with potential.'",
        "'speaker_1': 'Vendors.'",
        "'speaker_4': 'Or tenants that that could provide the services.'",
        "'speaker_9': 'They were able to to market this site.'",
        "'speaker_4': 'And this opportunity to approximately 200 potential concessionaires. And and that was over a period of about 30 days. So this was an initial outreach just to see who might be interested and what their qualifications might be, what ideas that they had.'",
        "'speaker_4': 'And from those 200 concessionaires that were reached, there were a number of on site tours.'",
        "'speaker_9': 'Review of the of the opportunities with the commercial brokers that.'",
        "'speaker_4': 'We had engaged from the city. And we ultimately received.'",
        "'speaker_9': 'Two proposals.'",
        "'speaker_4': 'From local businesses who are interested in proposing for the sites. Now, of course, during that 30 day period, there were a lot of unanswered questions. Ultimately, to really delve into a business plan, potential vendors would need to take a look at the engineering, what the building's conditions are, what kinds of investment might be needed to to activate'",
        "'speaker_4': 'those buildings. And so that takes time. And so what we're asking tonight is ultimately for the city council to allow us.'",
        "'speaker_1': 'To move forward.'",
        "'speaker_9': 'To to work with those two proposers.'",
        "'speaker_4': 'Who we, our committee, believe were qualified, but needed some additional time to develop some really sustainable and successful proposals.'",
        "'speaker_9': 'This typically takes about 180 days. That will allow for us to also.'",
        "'speaker_4': 'Conduct some survey. Of course, existing park users.'",
        "'speaker_9': 'Are.'",
        "'speaker_4': 'Our first customers. We want to make sure that we understand what their needs and priorities are. We also want to review the sustain, you know, the suitability.'",
        "'speaker_10': 'Of those proposals.'",
        "'speaker_4': 'So all the things that were just mentioned by the council member, the concerns that we've heard from the public. We want to incorporate those into our evaluation of the final proposals. And then ultimately, if we are.'",
        "'speaker_10': 'Able to.'",
        "'speaker_4': 'Find a really.'",
        "'speaker_10': 'Successful.'",
        "'speaker_4': 'Solution, we would bring that proposed solution forward to the Parks and Rec Commission, who.'",
        "'speaker_9': 'Oversees our.'",
        "'speaker_1': 'Parks.'",
        "'speaker_4': 'And also we would bring that recommendation to the City Council for final approval.'",
        "'speaker_9': 'And if if we're able.'",
        "'speaker_4': 'To to reach an agreement. So so ultimately, what this step.'",
        "'speaker_2': 'What this.'",
        "'speaker_4': 'Action is tonight is not an.'",
        "'speaker_10': 'Approval of of.'",
        "'speaker_4': 'Any vendor.'",
        "'speaker_1': 'Or any.'",
        "'speaker_4': 'Terms for proposed use. This is not an approval of a business plan. In fact, this is just the approval for staff to move forward to conduct these surveys, to do some due diligence.'",
        "'speaker_9': 'To take a look at what the potential park users.'",
        "'speaker_4': 'Want.'",
        "'speaker_10': 'To.'",
        "'speaker_4': 'See out there, and then to bring back in the next hundred and 80 days or less, we hope some ideas for the Parks and.'",
        "'speaker_1': 'Rec Commission.'",
        "'speaker_4': 'And then ultimately something that everybody can stand behind to the city council at the end of the period. You know, the goal ultimately is, is to really activate our existing buildings, our existing resources, in a way that provides better services and amenities for park users, and hopefully do that in a financial, financially.'",
        "'speaker_1': 'Sustainable way so that.'",
        "'speaker_4': 'There's not any additional cost to the city or the taxpayers. So with that, I'm actually going to wrap up my part of the presentation and we'd be happy to answer any questions.'",
        "'speaker_6': 'Thank you. I appreciate this proposal. For for those of you who don't know, we're undergoing $7.5 million in improvements to Eldorado Park this year. A lot of those have been pieced together over time from different grants and opportunities.'",
        "'speaker_6': 'But there's still another 20 to $30 million of need at the park. And these three facilities are on the list of need. And I don't know that there will be a time where it makes sense to make such an investment in these buildings.'",
        "'speaker_6': 'I think the better use of the funds is for improving our bathrooms and our lakes and our ponds and our pump systems and the irrigation and our sports fields and other things that are at Eldorado Park. And so for that, to be able to take the burden off of the city to find a way to solve these'",
        "'speaker_6': 'issues would be great. I think that the community input I've received, as you may have noticed, I was surprised that we didn't have public comment or individuals signed up. I've talked to dozens and dozens of residents on this item and.'",
        "'speaker_6': 'I think that the two things that I find very, very important is that we want to preserve the park and to do that. Potentially one of these facilities could be a part of that process. Many know that there is a process to get a permit and you go to the Parks and Rec department and you pull a'",
        "'speaker_6': 'permit. But a lot of our park users who are required to have a permit do not have a permit. There have been safety concerns in the past. We didn't know who were using certain areas. And many individuals don't pull a permit because they don't leave the park in a appropriate manner when they leave.'",
        "'speaker_6': 'They leave behind trash and debris. Whether it's an event or a family party. There are issues with some of the vendors that bring bounce houses in. We do our best to enforce the rules, but if there isn't a consistency of a vendor over time, they have less of an incentive to really preserve and protect our park.'",
        "'speaker_6': 'And so for those reasons, I think it'd be great if I saw one of the. Slides, discussed events and reservations. We already have so many events that happened in the park. If many of them could be kind of funneled through one of these vendors who we have one consistent, ongoing vendor that our special events department would work'",
        "'speaker_6': 'with, then we don't end up having things such as golf carts left on the bike path and other things we've experienced in the past that have been really a deterrent to a positive park experience. If we had one vendor in the park that rented all the bounce houses, we have complaints sometimes about loud noise.'",
        "'speaker_6': 'If perhaps you want to have noise or music in the park, you have to write your sound system from the vendor in the park and the system doesn't go above the decibels allowed in the park, things like that.'",
        "'speaker_6': 'And I recognize a lot of these asks are are going to need to take place over time. And so I'd be very supportive of hearing some kind of pilot program for this summer that eventually could talk about a bigger investment.'",
        "'speaker_6': 'Because when you walk the buildings and the current condition they're in, we're talking about thousands, if not tens of thousands or hundreds of thousands of dollars in investment to repair these buildings. And so I want to make sure that we have the right fit with the right vendor who's really open to embracing the park and all that'",
        "'speaker_6': 'it's capable of becoming. So thank you for bringing this forward. I hope my colleagues will support it.'",
        "'speaker_2': 'Thank you very much, Councilwoman Jenny Piper, coming on this. I see. No further comment. Please cast your vote. You.'",
        "'speaker_1': 'Low on mango.'",
        "'speaker_2': 'One girl kept on mango.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Withdrawal of Alcohol Beverage Control Protest against Brite Spot Restaurant.": [
        "'speaker_2': 'All right, please. Now we move to item number 26, please.'",
        "'speaker_0': 'Item 26, Communication from Councilwoman Zendejas. Recommendation to withdraw the protest filed with Alcohol Beverage Control against Bright Spot Restaurant located at 412 West Pacific Coast Highway.'",
        "'speaker_2': 'Yes, Miss. Councilwoman, in that.'",
        "'speaker_1': 'Thank you. I strongly believe that the continuing. To pass this local business from obtaining its ABC license is not in the best interest of our city and our residents. The ability to sell alcohol is absolutely a privilege, but it's also a key component to many successful establishments.'",
        "'speaker_1': 'And I really believe that the bright spot is once again worthy of this public trust in in this regard.'",
        "'speaker_2': 'Yes. Okay. Thank. I do have any. See, I have a first year secondary product coming in is fine. Okay. Would you please cast your vote inside of.'",
        "'speaker_0': 'Councilman Andrews motion carries.'"
    ],
    "Resolution to Ratify Local Emergency and Health Emergency Declarations for COVID-19.": [
        "'speaker_2': 'I think we're asking to move number 39 up. So these individuals, I think, are waiting on that. Can we move that 39, please? Item 39.'",
        "'speaker_0': 'Item 39 Report from Health and Human Services. Recommendation to adopt resolution to ratify the City Manager's Proclamation of Local Emergency and ratify the Long Beach Health Officers Declaration of Local Health Emergency regarding the serious and imminent threat of an outbreak of novel coronavirus citywide.'",
        "'speaker_2': 'Ask you, Councilman Richardson.'",
        "'speaker_3': 'Let's hear from staff.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. Members of the city council. So we do have a fairly lengthy presentation for you. It is something we've been paying a lot of attention to. COVID 19 is something we've been following ever since December when it first came out in China.'",
        "'speaker_4': 'And your city team has been incredibly proactive. There's been an enormous amount of staff resources, especially in the last week and a half, devoted towards this. So we would really like to help explain what it is that we're doing, give you a lot of information about the virus itself, the medical information.'",
        "'speaker_4': 'We'd like to go into all of the kind of disaster plans that we put in place. We practiced for this. We have a system in place for any kind of what we call all hazards type approach, and we are putting that all together to be able to prepare our community for COVID 19.'",
        "'speaker_4': 'So you'll hear tonight from our health director, Health and Human Services Director Kelly Collopy, and from our health official, Dr. Anissa Davis. It's very rare that a city has a health officer is only three cities in the in California that have a health officer.'",
        "'speaker_4': 'And we're very lucky to have one. And so with that, I will be turning over the presentation to our Director of Health and Human Services, Kelly Collopy.'",
        "'speaker_10': 'Good evening, everybody. Uh, honorable vice mayor and city council members. The Health and Human Services Department has really been taking a strong stand around COVID 19. Tonight, we'll be sharing information on the COVID 19 status on the city of Long Beach and its efforts to plan, monitor and respond.'",
        "'speaker_10': 'Dr. Anissa Davis and I will share these efforts. However, we're not just talking about the efforts of the health department, but we're really talking about a coordinated and committed cross-agency team. They're all giving their all every single day to ensure that our city is prepared for COVID 19 response and that our city communities and individuals are safe'",
        "'speaker_10': '. With that, I'm going to turn turn the time over to Dr. Davis to talk about the virus and the preventative measures.'",
        "'speaker_1': 'Good evening. So just to tell you a little bit about coronavirus disease, 2019, otherwise known as COVID 19. Coronaviruses are a large group of viruses that are common among animals and humans. In rare cases, animal coronaviruses can be transmitted from animals to humans.'",
        "'speaker_1': 'This novel coronavirus that causes COVID 19, is a newly discovered coronavirus that has not been previously detected in animals or humans. The source of the virus is not yet known. So recently. Yesterday, in fact, there were three positive cases announced in the city of Long Beach.'",
        "'speaker_1': 'All of these cases were travel related to locations with community spread. Two of the cases were associated with international travel, and one case was associated with domestic travel. These lab results of these three positive cases are considered or known as presumptive positive until they're confirmed by the CDC.'",
        "'speaker_1': 'We're also monitoring ten students and two staff from Cal State Long Beach, who attended a conference in Washington, D.C.. And we're monitoring dozens of people who have traveled to China, Iran or who have been on local cruises. So how does COVID 19 spread?'",
        "'speaker_1': 'COVID 19 is spread through droplets from coughing and sneezing from close contact, such as touching and shaking hands and contact with infected surfaces or objects, or touching your eyes or your nose or your mouth with unwashed hands. The most common symptoms of COVID 19 are fever, shortness of breath and cough.'",
        "'speaker_1': '80% of infected individuals have mild to moderate symptoms. It feels like they have a really bad flu. 15% have more serious illness and 5% can become critically ill. In order for COVID to be diagnosed. Currently, a health care provider needs to assess patients and consult with the health department on whether testing is indicated by the CDC.'",
        "'speaker_1': 'So right now, the Long Beach Health Department has to approve all testing that happens on Long Beach residents. To determine if a person is at risk and qualifies or would be appropriate for testing. We ask about recent travel contact with other people who have COVID 19 and risk respiratory symptoms, and we put all that together to decide'",
        "'speaker_1': 'if testing is needed. Most people will recover on their own. There are no specific treatments such as vaccines or medications for COVID 19 at this time. So how can the community prevent the spread of COVID 19? We recommend washing your hands with soap and water for at least 20 seconds.'",
        "'speaker_1': 'Avoid touching your eyes, your nose and mouth with unwashed hands. Avoid close contact with people who are sick. Cover your cough or sneeze with a tissue and then throw the tissue in the trash. Stay home if you're sick and clean and disinfect frequently touched objects and surfaces and basic disinfectants will kill coronavirus.'",
        "'speaker_1': 'And this slide just illustrates some of the education we provide to the community in this instance regarding the best way to wash your hands. We're doing all of this because COVID 19 causes more severe illness compared with the flu, and because older adults and those with underlying medical conditions tend to have more serious illness and poorer outcomes'",
        "'speaker_1': 'from COVID 19. As the city health officer. I declared a local health emergency and the city declared a local emergency because of the increased resources necessary to be prepared and to respond to COVID 19 cases in Long Beach.'",
        "'speaker_1': 'The emergency declaration allows us streamlined access to extra staffing and goods and services.'",
        "'speaker_10': 'So the Long Beach Department of Health and Human Services is the leading is a lead for the public health emergency response with support of so many of our partner agencies. The department began preparing for COVID 19 in December when it first hit the national radar, and it's been in planning since that time.'",
        "'speaker_10': 'Internally, our lead response team includes our city health officer, the Public Health Emergency Management Team, and the Communicable Disease Control. Our Public Health, Nursing, Environmental, health and clinical services teams have also stepped up to support the effort. At the risk of COVID and Long Beach has increased, the team is tracking federal, state and local guidance, training health'",
        "'speaker_10': 'providers, educating and communicating with public monitoring, self-quarantined individuals, consulting with health providers, city agencies, educational institutions and the community, and coordinating with providers to determine if testing is called for. It really is a full out press. Notre Dame is going to share a little bit about what just one case requires.'",
        "'speaker_1': 'So for one case, we have to trace everywhere that a person has gone since they've been symptomatic. This might include a flight that they were on. Who's sat next to them? It might include an Uber where they worship or were who they live with, possibly their school or their dorm.'",
        "'speaker_1': 'Basically, any congregate setting that this person has been in. And then once we identify those places, we have to find all the people that they've come into contact with at all these different places, get in contact with them, interview them, and then make recommendations.'",
        "'speaker_1': 'So basically interview them. Find out how close of a contact they had with the source patient if they have symptoms or not, what their underlying medical conditions might be. And then we make recommendations on testing, isolation, quarantine based on all of those scenarios.'",
        "'speaker_1': 'And it can be up to 100, 150 people or interviews per case of COVID 19 that is diagnosed. And then when the actual case, who's positive is in isolation because it's not really known when the infection is over, we have to do serial testing.'",
        "'speaker_1': 'So we might be testing them every other day for several days, two weeks. So we're going either to their house or having them come here and testing them. And so it's a huge resource intensive resource demand, and it's diverts a lot of our staff from other health programs, especially our clinical staff, and then a lot of non-clinical'",
        "'speaker_1': 'staff as well to perform these duties.'",
        "'speaker_10': 'The city's all Hazard Isthmus management team, commonly referred to as the IMT. Was activated on March 5th in response to the emergency declarations. This team, which is led by fire and police departments, include members of multiple departments who are working around the clock to plan for and manage all aspects of this incident and to ensure we are'",
        "'speaker_10': 'prepared citywide. Over 50 staff have participated in this effort to date. Each day the IMT reviews current information to determine if any changes are coming, sort of depending on where we're seeing around the community. What we're seeing in surrounding jurisdictions and if any changes are required of the planning or recommendations or guidance.'",
        "'speaker_10': 'So it's an ongoing, ongoing effort. The IMT has responded to many city incidents in the past, and we're well trained and coordinated to respond to COVID 19. We're also very thankful for all the city's past investment of time and focus to ensure that the city has this this really great resource in that to be able to really'",
        "'speaker_10': 'be prepared in this case. The Joint Information Center, which is otherwise referred to as the GIC, operates as part of the IMT and includes the CIA, the city's PIO, a communications team from across the city departments. The GIC was activated on March 6th and have been working every day from morning and well into the night with 15'",
        "'speaker_10': 'to 20 people there literally monitoring the world to address potential impacts to our community. They're also developing and disseminating communications for various channels. A lot of social media. Dispelling rumors by providing facts and updates. Engaging with newspapers and media.'",
        "'speaker_10': 'Responding to community questions and concerned. When you walk into the room, it's literally abuzz. The list that you see on this slide is really all the things we've taken, all the steps we've taken to date in terms of guidance and education.'",
        "'speaker_10': 'And I'll be going through providing a little bit of information for each of these. The first is our health care. So we're really focusing on the safety of our health care workers across the city. When we think about who are great workers are we're thinking about our early childhood care centers, our daycare providers, the our educational institutions'",
        "'speaker_10': '. And we're really focusing in this case on the health centers and the medical staff associated with those organizations. We're also talking about local hospitals, urgent cares and the skilled nursing facilities who are working with our older adult residents.'",
        "'speaker_10': 'The we've been making daily calls and conducting ongoing in-person meetings with dozens of health care institutions, including acute care, urgent care, skilled nursing facilities, student health centers. And we're just making sure that they have the most up to date guidance.'",
        "'speaker_10': 'We've had two trainings at the Department for Health Care. Providers are coming in and we're training them. We have a website section specifically for providers on the COVID 19 website. We're sending out provider health alerts regularly, and we're triaging patients who may require testing.'",
        "'speaker_10': 'So the hospitals and providers are calling us. We're having conversations with them about whether the testing needs to occur or not. We're spending a lot of time making sure that the community is well-educated and understand what the issues are.'",
        "'speaker_10': 'So we've created the website Long Beach to go back to COVID 19, which is the central hub for all up to date information. We've also implemented a telephone line to respond to community questions and concerns. It's very specific to COVID 19.'",
        "'speaker_10': 'We continue to push out significant amounts of information across all different platforms. We have various graphics that are provided in several languages to help people understand the symptoms and also what steps they can take. We've also developed and disseminated videos to help deliver safety messages and to provide guidance.'",
        "'speaker_10': 'We have posters and if you're going online, you can see billboards across the city and electronic signs. We're in close contact to the news media to make sure that they're getting the right information out. We've livestream a press conference developed and disseminated educational information through the go a lot of each newsletter and been doing presentations we've done'",
        "'speaker_10': 'to community presentations so far and others are lining up quickly. We're focused very closely on our staff. We want to make sure that our staff are safe as well. So with that, the our our department has been working very hard to ensure that we're really make that that the staff understand the steps to take, that they have'",
        "'speaker_10': 'guidance, the staff are healthy and that they're supported. They've developed workplace safety measures and employee communications. To date, they've trained staff on personal protective information or sorry, personal protective equipment, which is otherwise known as PPE, including creating a video to help the ongoing training.'",
        "'speaker_10': 'They have developed guidance for when people walk in, they place additional hand sanitizers in city buildings where lots of or you'll find a lot of public interfacing. There are also signs throughout now the restrooms and the eating areas about hand-washing and illness prevention tips.'",
        "'speaker_10': 'They're also upgrading the cleaning and sanitizing of the public spaces in the city buildings. I've developed many different communication opportunities, the multifaceted approach. Some of these are in place already. The other ones are coming up. So I won't go through all of them.'",
        "'speaker_10': 'But you'll see there are many, many different ways that we are interacting with city employees so that they have updated information and they know the different steps to take. The communications to date include two bulletins to city employees.'",
        "'speaker_10': 'We provide a guidance to employees. There is a procedure, policy and procedure in the city. Policy Procedure 6.7, which is the Communicable Disease Prevention Program, provides a lot of guidance and steps for our employees. We've launched the city Internet website for employees, supervisors and managers, and the administrative officer meeting, which will be conducted tomorrow, will be training'",
        "'speaker_10': 'our ACOs in steps in how to work with other folks. In providing guidance to local businesses. This is all available on the websites. There is a specific link on the website for four different businesses food facilities, childcare providers, ticketed events so they can click there.'",
        "'speaker_10': 'We've also, the Environmental Health Department established a phone line dedicated to COVID 19 that's very specific for business questions. Airport is installed signage throughout the airport. Their hourly disinfecting and cleaning the the public areas. Providing information on social media outlets and on the website about the airport efforts and making sure that they're linking anybody to our website'",
        "'speaker_10': 'to make sure they have the most up to date information. And they're coordinating very closely with their airport partners who are communicating to us that they've stepped up their cleaning protocols in all of their respective locations. Work with the port and the cruise lines is really held with the Coast Guard and the CDC quarantine station, which has'",
        "'speaker_10': 'jurisdiction on international waters. The city health department and the incident management team has been coordinating closely with the CDC in the case of any medical illness, including suspect COVID 19. We're supporting in terms of if someone needs to go to a hospital, we support with the transportation, the connecting to medical services and others, as well as the'",
        "'speaker_10': 'testing and getting the information to the CDC. The Coast Guard has directed that cruise coming from ships coming from China will not disembark locally. And any crew members who may be ill are reported to the CDC and they go through the quarantine station there.'",
        "'speaker_10': 'Their state guidance developed by the Department of Public Health on on mass gatherings and large events. The guidance is really sort of. It increases protections and that it does it over time. It sort of says in this situation, it is where we are now, sort of be thinking about if you need to be if you need to'",
        "'speaker_10': 'be canceling events, be thinking about where people are coming from. Make sure that you're messaging people who are ill, that they should remain home. Make sure that if you're holding events, that there's plenty of things with soap, a lot of hand sanitizers and tissues, so that you're providing all the opportunity for people to stay healthy as the'",
        "'speaker_10': 'situation. If the situation and as the situation increases, what we may see is that these guidelines will increase as well. So guidelines increase protections and possibly closures based on different exposure levels. Many places are canceling events outside of the guidelines.'",
        "'speaker_10': 'At this time, we're not recommending cancelation, but this may change as the situation evolves. There's also guidance for schools and essentially in the current where we do not have any community community transmission, we would treat as as a person in a school who has who has been either traveled to one of the areas in the last 14'",
        "'speaker_10': 'days or been in close contact with someone for COVID 19, that we'd ask that they stay away from school for 14 days, just as we would for anybody in the community. We ask the school, develop a plan to communicate with the school community and to really encourage all students, families and staff to take preventive actions if there'",
        "'speaker_10': 'are two or more cases of community transmission. Now we ask that teachers and staff self screen and that they don't work. They don't go to work if they have an upper respiratory infection, infection or other symptoms, that the possibility of limiting visitors to campus and staggering larger communal activities such as assemblies, lunchtimes, recess, those kinds of things'",
        "'speaker_10': '. Um, in terms of school closures, you're hearing a lot about school closures around if there's one or more cases in a single school, then we ask that the school district work very closely with US public health officials to determine whether the closing that one school may be warranted.'",
        "'speaker_10': 'If there are one or more cases in multiple schools, then we'd ask that the school district work closely with us to determine the next steps and whether it makes sense to close which schools to close and and for how long.'",
        "'speaker_10': 'Upon any closure, school must have communication plans available for staff and community and consult with public health to determine when the school can reopen and when students can be allowed to return. Schools should do everything possible to ensure students and staff privacy to help prevent discrimination or unnecessary stigmatization.'",
        "'speaker_10': 'There's a real focus on older adults. We've held two meetings with health care facility staff, many of whom came from skilled nursing facilities that are serving older adults. We're providing CDC guidance for health care workers and facilities to the different facilities around the city.'",
        "'speaker_10': 'We're responding to skilled nursing facility questions, and we're supporting decisions that they're making sort of wherever we can support them. That is what we're in the process of doing. And then we're developing more general messaging for older adults in their community.'",
        "'speaker_10': 'You may also hearing be hearing a lot more about the possibility of COVID among people experiencing homelessness. The Homeless Services Division is working closely with the IMT and our Public Health Emergency Management Team to address the risk among people experiencing homelessness.'",
        "'speaker_10': 'The outreach teams are taking out all the fliers, having conversations with people, really letting them know what the symptoms are and then what to do if they start experiencing them. We have developed protocols for isolation and quarantine. Should we have a suspect case within an encampment?'",
        "'speaker_10': 'We've also identified locations for temporary housing individuals who otherwise don't have a place to self-isolate. The clinic at the Multi-Service Center is prepared to triage and support to determine if testing is needed moving forward. The NSC will provide maps for those demonstrating flu like symptoms while they're accessing services, and we're posting preventive measures at the NSC as'",
        "'speaker_10': 'well as providing them to all of our partners in the continuum of care. So the situation is ever changing as you've heard through this presentation. Recommendation, you know, if as things escalate, if they escalate recommendations for closures, cancelations, different policies, things like that may change.'",
        "'speaker_10': 'And so what we are reporting today is the status today. And we will be in constant communication with you and with our community as our teams prepare for the situations as they arise. So in the end, you know, we are we're encouraging kindness during this time.'",
        "'speaker_10': 'Well, our health care network really is working hard to make sure that everybody is healthy in the community. One of the most important things that we can do is to support each other. If you have family and friends that are elderly or they have underlying respiratory conditions, we encourage you to give them a call check in.'",
        "'speaker_10': 'You know, you just being on the phone, video chat, whatever it is, is really helpful. And also, just we encourage kindness. You know, one of the key factors. Kindness is one of the key factors in not spreading fear.'",
        "'speaker_10': 'Fear leads to misinformation. Fear leads to conclusions that may not be accurate, neither of which are helpful in this situation. So we ask that everybody be kind to each other. There's been quite a lot of stigma put on some of our community members who are perfectly healthy just because they came from a certain community or they look'",
        "'speaker_10': 'like a certain community or have a certain background or or they've traveled recently. And we want to make sure that that is not what we're being what's being held up now. And stigma is really not helpful to the health and support of our community at this time.'",
        "'speaker_10': 'So it does take all of us to stop the spread of this, the spread of this virus. And it really will take all of us to make sure that our information is accurate and that we're supporting our community.'",
        "'speaker_10': 'So with that, I turn I turn the presentation over to Tom Modica.'",
        "'speaker_4': 'Thank you, Kelly. So as you can see. An incredible amount of work has happened in a very short amount of time to respond to this. I do want to talk a little bit about a couple of other things that are going on, including the emergency declaration.'",
        "'speaker_4': 'That's why we're here tonight. This has not been done in recent memory where we have the you know, the acting city manager declared the emergency under the code and then we bring that to you within seven days for ratification.'",
        "'speaker_4': 'So that is why we are here tonight. Under our code, we need to return every 14 days with that reaffirmation of the declaration. You do have the ability to waive that if we're in a more sustained area and you want to have a different schedule.'",
        "'speaker_4': 'But right now we are planning to come back every 14 days. What an emergency declaration allows us to do is it allows us to purchase quicker. We can waive certain internal rules as appropriate. We can hire quicker, bring on the staffing that we need, both city staff, and if we need some supplemental staff from, you know, from'",
        "'speaker_4': 'other firms. And we can. We also are sending a flag to our state and federal governments that we want to be eligible for reimbursement, that we are going to need some financial assistance. We are tracking specific costs associated with COVID 19.'",
        "'speaker_4': 'Right now, the financial impact is unknown. And I'm letting you know that we normally try to budget and plan in an emergency. We really just the primary mission is to is to solve the crisis. And so we are spending we are figuring those out.'",
        "'speaker_4': 'And I will come back to you with a recommendation that might result in release of emergency reserves or other types of reserves. And we will bring that back to you as we know more. And right now, we are at and we are hoping there's going to be monetary assistance, but that is unclear.'",
        "'speaker_4': 'We have had a federal bill passed. At this moment, we're going through that. It does not look like a huge sums of money. Moneys are coming to local jurisdictions. There may be some, but it is not enormous amounts.'",
        "'speaker_4': 'But we are closely following that. And so another thing that's happening is longer term planning, which you heard all right here, is really kind of the operational what is happening on a day to day basis and planning out, you know, seven days, 14 days ahead.'",
        "'speaker_4': 'But we also need to be thinking long term if this becomes a sustained scenario, we need to have what we call our continuity of government planning underway. These are things like how do we continue critical functions, the continued function of the Long Beach government?'",
        "'speaker_4': 'What about critical supplies and economic activity not just for the city organization but for the city as a whole? All departments are reviewing and updating their continuity of operations plans. We call those coop planning, and we're also starting to see some future financial impacts that may last for a while.'",
        "'speaker_4': 'Our hotel tax might be affected. Our oil prices we've seen oil prices take a significant dip in the last couple of days. The port relies on on shipping in a lot of the activity that is being sent over or a lot of the goods that are normally coming from China are not coming because their workers are not'",
        "'speaker_4': 'in their factories. I believe they're down approximately 10%. If the cruise line industry is disrupted, we rely on that cruise line revenue, airport revenue as well. And then, of course, you know, if any spending habits change in the general fund, that might be affected.'",
        "'speaker_4': 'In terms of the organization, I want to let you know that COVID 19 is at the highest priority in the organization right now, and we have the best people working on it. We have the right resources, but that also will result in a delay and reprioritization of other work and staff.'",
        "'speaker_4': 'And so I'd like you to know that that is happening. We are trying to still meet needs. We know we still need to continue our critical services. But we are reorienting and spending an enormous amount of time on preparation.'",
        "'speaker_4': 'We are asking for understanding from you as our policymakers and also from the community that some things may take us a little longer to get to. Staff fatigue will at some point become an issue. This the team is very upbeat and they're working really hard.'",
        "'speaker_4': 'But at some point you you start to see the stress that it takes to keep this level of engagement up. And so we will need longer term staffing, maintenance plans. There's still a lot of unknowns that we don't know that we need to react to, and we're going to have to adapt to those as they come up'",
        "'speaker_4': '. And we will be making the best decisions based on the information available. And while that sounds simple, we're just not going to know everything to make every decision exactly 100% correct every single time. And so we will do our very best to make those decisions using the information that we have.'",
        "'speaker_4': 'The response has really been phenomenal and I am incredibly proud of our team's response. The communication has been incredibly quick. It's been proactive and coordinated so that we're getting accurate information out in a way that is very well coordinated.'",
        "'speaker_4': 'Our incident command structure has been established and has been highly productive. The dedication and commitment of the team has been impressive and a lot of them are here tonight. But there are many, many more that couldn't be with us tonight.'",
        "'speaker_4': 'We have significant coordination and collaboration and partnerships with our major entities. Our executive management is highly engaged. Our department directors and our executive team get together every single day to talk through some of the things that we need to do to be able to do and to plan and prepare.'",
        "'speaker_4': 'There are tough questions being posed and the team is asking those tough questions so that we can we can confront those issues and plan for them. We are scenario planning for multiple potential eventualities. And I also just really want to thank you for all of your support.'",
        "'speaker_4': 'We have very, very strong support from all of our elected leaders, from the mayor to the entire council. I do want to note that the mayor, council member, Urunga and council member Austin could not be here tonight. They had other commitments, but they are very much plugged in.'",
        "'speaker_4': 'We talk all the time on the phone. They they know what is going on in in in the city. And they're very much supportive and we appreciate their support. And so with that, we do have our experts standing by if there are any questions.'",
        "'speaker_4': 'And thank you for allowing the length of the presentation. I know it's a lot, but there's a lot to say. So thank you very much.'",
        "'speaker_2': 'Thank you, Tom. Excellent report, both you. Very good. Now we have a few here, and the guys would like to ask some questions. Councilman Richardson.'",
        "'speaker_3': 'Thank you, Vice Mayor. So, Tom, thanks for prioritizing this the way that you have. It's important that people know that the safety of residents, of our residents comes first. I have a number of questions, but I just want to say this is one of those moments where we're proud to have our own public health department here in'",
        "'speaker_3': 'the city, and we're also proud that we're not a contract city, that we can coordinate with our own police department and fire department and be able to be more nimble and respond. So I just have a few questions, and these are questions that have come up in the public and sort of, you know, our staff will quickly'",
        "'speaker_3': 'Google something or they'll look at what public health department has put out to find the answers. So my first question is, are we planning to have some level of training for outward facing staff like city council staff that can, you know, get them prepared or put the hotline in their email subject line, you know, what?'",
        "'speaker_3': 'What are we doing? What is going to do or whoever to train some of our staff?'",
        "'speaker_4': 'Yes. So we've put out a lot of information to employees so that we are arming all 6000 of our employees with information. One just went out about half an hour ago about things that they need to know about coronavirus.'",
        "'speaker_4': 'We'd be certainly welcome to do additional training for those, especially in the council office, who get a lot of phone calls so we can come to the Chiefs of Staff meeting and provide that training.'",
        "'speaker_3': 'Okay, great. Also, I know that you've through an emergency, you've set up your incident command. So who's who's the incident commander on this incident?'",
        "'speaker_4': 'So health is the lead and so they are. When you look at an incident like that, it's not always going to be your police in charge of your fire or public works situation. Independence of health is the lead in terms of the IMT structure.'",
        "'speaker_4': 'We have police and fire both jointly leading that effort. They are the most practiced at incident command. There's a specific structure you use when you get into an incident like this to to make sure you're doing everything in a coordinated fashion.'",
        "'speaker_4': 'So it is health with police and fire supporting and the entire team helping out.'",
        "'speaker_3': 'So it's commanders. Kelly, great. Kelly, the incident commander. Thank you.'",
        "'speaker_10': 'Doctor Davis is the instructor.'",
        "'speaker_4': 'Davis under excuse me, Dr. Helicopter. I know you wanted to name Dr. Davis.'",
        "'speaker_3': 'Okay. Dr. Davis, my neighbor. Great. All right, I know where to go. All right. So I notice that there when we look at what happened in Washington, a lot of the fatalities were seniors and mostly at one convalescent home.'",
        "'speaker_3': 'Do we have a good list of the convalescent homes we have here in Long Beach?'",
        "'speaker_10': 'We do have a good list, yes. And when we are connecting to all of them, providing guidance and support.'",
        "'speaker_3': 'Great. I have a number of them. My district is just curious about that. I know that that it's shown that young people have been real resilient to this. I haven't seen very many cases where young people has our school district handling it.'",
        "'speaker_3': 'So you guys in communication.'",
        "'speaker_1': 'Are and and they are planning and we're in very close communication with the school districts and with our local colleges.'",
        "'speaker_3': 'Okay. Is there someone what about private the private schools and the private childcare area? Area schools, should they coordinate with us?'",
        "'speaker_1': 'Yeah, we're working on that as well too. It's a little bit less centralized. I just want to speak to the senior population. We've actually had an ongoing relationship because of new other types of novel multi-resistant organisms that happen in health care facilities.'",
        "'speaker_1': 'So we've actually been working really closely. We have a close like a coalition with our sniffs that we had for skilled nursing facility, got it ready for over a year. So this was easy to kind of just continue the education and outreach because we already had established a relationship.'",
        "'speaker_3': 'The name is pretty ironic given what we're dealing with. Okay. If we know somebody, a senior in the neighborhood, should we just go do a welfare check or should we call the hotline? If we wanted to check on a senior in the neighborhood.'",
        "'speaker_10': 'I think you could you can reach out, do you know, find out how they're doing. It could be by telephone or or other ways where, you know, if they're ill, you don't want to walk to the front door necessarily.'",
        "'speaker_3': 'But I was wondering was there was the practice is to call the hotline, call non-emergency? Can you do a welfare check on this person?'",
        "'speaker_10': 'You'd have a just sort of checking into the neighbor. Or do you think that like you consider there there may be an issue and that we want to have somebody go and check.'",
        "'speaker_3': 'You and I know let's just someone you is a neighbor thing you know so if.'",
        "'speaker_1': 'You.'",
        "'speaker_3': 'Call them in your neighborhood.'",
        "'speaker_1': 'Right. So you're going to your neighbor's house if you want to just stand about six feet away from them. Okay. And with you, check them out. They're not sniffling. They're not sneezing or coughing. Right. Go ahead and engage a little bit further.'",
        "'speaker_3': 'Okay. Got about 30 more seconds and get another question in. So I notice I go to the grocery store, I'm noticing people are buying up all the water and hand sanitizer, but the soap is all still there. No one's buying.'",
        "'speaker_3': 'So everyone's eyes energizer and water. Are we is our water demand? Our water is pretty safe to drink in Long Beach and I can't say that enough, but we engaged the water department to tell people you don't have to buy the water off the shelves.'",
        "'speaker_3': 'You can probably just you know, if you want to just stockpile water, you can use the Long Beach water. We engaging with the water department to get the message out.'",
        "'speaker_4': 'Yes, we're talking to them. We can certainly enhance that message, though. That baffles me as well.'",
        "'speaker_3': 'Thank you. I think I think I'm good.'",
        "'speaker_2': 'Thank you very much. That's a comfortable price. Grace Pierce.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'Thank you for the thorough presentation, as thorough it is as it was. Still have questions. We've had lots of people contact our office. My phone has blown up over the last three days. Let me ask just two clarifying questions for our hospitals and our health care facilities.'",
        "'speaker_7': 'Those are governed by the county, correct?'",
        "'speaker_10': 'So the they're the private nonprofit hospitals, very current. So we only have one county clinic that is actually governed. All the licensing is done at the state level.'",
        "'speaker_7': 'So I ask because I had people calling me asking us to enforce, you know, the number of mask and everything else at our hospitals. And I'm just curious the the city's role in that conversation, because I've heard that that standard has rolled back some of the standards because there's a lack of resources.'",
        "'speaker_1': 'Right. So we're I would say we're the coordinator, so we're or a liaison with our area hospitals and we liaison with the area hospitals, the state, the federal government and our regional partners. So there's a lot of different avenues where personal protective equipment or PPE, including mask, comes from.'",
        "'speaker_1': 'It is in short supply. So there's a lot of different avenues that supply different parts. And so we just help coordinate that. So we're definitely prioritizing our health care facilities. So it's a lot of conversations, hard decisions and trying to link the facility with the right avenue, whether it's the Strategic National Stockpile or our regional partner or'",
        "'speaker_1': 'the state, because there's cash is sort of everywhere. Okay.'",
        "'speaker_7': 'And when we talk about resources, like if there's a shortage, it's not necessarily that the funding isn't there yet. It's just that there's a shortage.'",
        "'speaker_1': 'There is an actual shortage. Many of these things are made in China. So there's a supply chain issue there. They're not making it. And then what they are making, they're keeping for themselves because they were the epicenter of the outbreak.'",
        "'speaker_7': 'I don't know. And this might be an economic development question. I don't know if we have paper companies in the in the city of Long Beach or any companies in Long Beach that maybe could quickly kind of try to assist.'",
        "'speaker_7': 'That wasn't I wasn't planning on asking that question. But as we're having the conversation, I was like, that might be interesting.'",
        "'speaker_1': 'Would be there's lots of regulations.'",
        "'speaker_7': 'On how that's helpful. So I guess the other question that came up is outside of quarantining people in their home, quarantining people in hospitals, a facility like ours where we are, we employ 6000 people, not all in this building are we looking at local other places to do quarantine if that becomes a crisis.'",
        "'speaker_10': 'City has identified three quarantine sites in city. If someone does not want to quarantine at home, so certainly someone can quarantine at home. But if they choose not to, then we are working on we have identified three other sites as possibilities if we get to that situation.'",
        "'speaker_7': 'Okay. And now down to the individual. So I'm not going to call anybody out, but there's somebody that I know that lives with someone who has a high fever and a cough and they refuse to go and try to get medical assistance.'",
        "'speaker_7': 'Are there phone apps? I know that they can call in. I mean, some people aren't calling in. Some people just kind of refusing to go through that process. Are there simple ways that they can have an online doctor or somebody else visit them?'",
        "'speaker_1': 'So we recommend if they have a provider that they call the provider, if they have symptoms, we actually don't want sick people. If they don't really need to go to the doctor, to go to the doctor just to try to keep pass to prevent spread.'",
        "'speaker_1': 'So definitely video. There's video health and there's telehealth.'",
        "'speaker_7': 'Are there those services say they they don't have a regular provider like. Is there a way for the city to promote those types of services to say instead of just calling? Because I also have heard, you know, you hear lots of horror stories and it might just be one, but one story was somebody called our hotline and'",
        "'speaker_7': 'had, you know, that they had just traveled from Korea or somewhere and they were told to check in with their provider. They called our health department and they said, Oh, you're fine. And maybe they were fine. But I just want to make sure that we have as many options as possible for somebody that really feels like they'",
        "'speaker_7': 'need to be seen to to be seen without feeling like they're discouraged.'",
        "'speaker_1': 'Right. So we we can do some more messaging around that. We are doing a lot of training. We have a lot of people who are talking with our community members. So we try to give the best advice. That's also, you know, working with what they desire and what their goals are.'",
        "'speaker_7': 'It would be great to see some more messaging around the different ways to do that. Give me one 1/2. So Kleenex versus elbow, have we changed or is that four? Is that always that? I forget used to be like cough into your your elbow.'",
        "'speaker_1': 'Kleenex would probably be number one. You can throw it away. Elbow would be number two. Just wanted to double check. It's like.'",
        "'speaker_7': 'Is that changed recently?'",
        "'speaker_1': 'The big thing is just trying not to do it right into your hands. Right, right, right, right, right.'",
        "'speaker_2': 'And you can.'",
        "'speaker_7': 'Oh, my time is up.'",
        "'speaker_8': 'Yes, I will keep it up.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Yes, you can go out and. Or you. He came back. You could.'",
        "'speaker_3': 'Yeah. Just queued up just talking to these last two questions and.'",
        "'speaker_2': 'Keep on.'",
        "'speaker_3': 'Going. Okay. So cert emergency response team. Are we doing a primer? We Telenor. We got hundreds of cert trained folks. I'm one of them in the city who probably want to, you know, roll up their sleeves and get get engaged and they.'",
        "'speaker_3': 'So Mr. City Manager, we thought about doing a primer, sending some communications out to cert to make sure they know what to do.'",
        "'speaker_4': 'Yes. So we will certainly do that. So we're we didn't talk about some of the other communications that we're doing. We're looking at in this first tranche was really getting prepared, was really putting out current information as the team's able to transition to putting out a lot more information do we're going to know we're going to get'",
        "'speaker_4': 'requests from different community groups to come talk to them. We're looking at things like telephone town halls so that we can reach thousands and thousands of people on the telephone all at the same time engaging those types of groups.'",
        "'speaker_3': 'I would love to do it. And telephone town hall on this. This is great. And then the last thing I'll say is I've been hearing about all the major impacts of the economy, particularly tourism. I'm curious to know what the impact is with our convention center.'",
        "'speaker_3': 'And is there anything that we could do from, you know, assuring people that things are okay or, you know, I don't know. I'm not sure. But is there anything that we could be doing to help support our convention center?'",
        "'speaker_4': 'So, yes, we are in constant contact with the convention center. They have had certain events canceled, just like nationwide, where the the promoter has decided not to do it. And those tend to be ones where they're bringing people in from all over the country, including overseas.'",
        "'speaker_4': 'They've also had very successful conventions continue to be held at the convention center. So I think you heard, Kelly, at our current phase, we are not saying that all major events need to be canceled. You know, that might change in the future.'",
        "'speaker_4': 'And we are seeing certain ones change, but that'll be all situational dependent. Our convention visitors bureau is they for example, on over the weekend we had that, you know, potential with the cruise line industry where 4500 people were, you know, still on their boat and 4500 people were coming on to their boat.'",
        "'speaker_4': 'The Convention and Visitors Bureau was a huge help in getting people into hotels and accommodating all of all of that group. So they are letting us know we're going to be sitting down with them more and talking about what can we do to be to be supportive.'",
        "'speaker_4': 'Just internally, we're like we just had a, an item at the convention center internally staff. We decided to keep it. We weren't going to cancel anything. We had all of our management team and we said we're going to go and be at the convention center because we think that that's important.'",
        "'speaker_3': 'Okay. So okay, great. Well, thank you all. I think, you know, in watching how the cities respond to crises, Dr. Davis, incident Commander Davis, I think you've been very calm and clear. Vice Incident Commander Modica I think you've been very calm and clear and it's been really good and paying attention.'",
        "'speaker_3': 'Thank you so much.'",
        "'speaker_2': 'Councilwoman Soprano.'",
        "'speaker_3': 'Thank you, Mr. Vice Mayor. I just wanted to clarify an issue that Tom Mulcair brought up and that this is ratifying an emergency order. That's the process we're in tonight. And that required a supplemental agenda item on Friday, and that requires three signatures from council members.'",
        "'speaker_3': 'So I'd like to thank my council colleagues who joined me on Friday. That's Councilwoman Pryce and Vice Mayor Dave Andrews for allowing us to do this tonight. I also like to mention a couple of folks as part of the team, and the first is Jake Heflin.'",
        "'speaker_3': 'I don't know if any of you saw the videos, but that was amazing. Jake, thank you for that. I know Jake's background and he has this experience actually in Native American communities. So, Jake, you did a just a great job and thank you also for those you don't know.'",
        "'speaker_3': 'We do have an employee in the city of Long Beach whose title is Communicable Disease Controller, and her name is only Holman. She's a fourth District resident. Don't worry, Emily, I'm not going to ask you to get up the podium tonight, but she has graciously accepted our invitation to speak at our regularly scheduled community meeting for the'",
        "'speaker_3': 'fourth District. And that will be two weeks from tomorrow night, March 25th, at the Los Altos Library at 5 p.m.. So thank you.'",
        "'speaker_2': 'Thank you, Councilman. You know, Councilman Pearce.'",
        "'speaker_7': 'Thank you. I was going to follow up on the economic question, so thank you for asking the questions about the Convention Center. I, I think that I've had a lot of questions with our debate around not canceling events, but planning events.'",
        "'speaker_7': 'And so I know that some of the reports have come out that the cases in China have started to taper off. What do we tell our folks are like, should I plan an event that's in three months? What's the city's role going to be?'",
        "'speaker_7': 'If we do permits, they raise money and they have to cancel. Are we thinking economic development and ways to assist organizations that might be doing big events?'",
        "'speaker_4': 'So that's still in the pending column. So we we are looking yeah, we are looking at events of we look at them first from a safety perspective. So is it safe to do it? So in a lot of these we don't look at the financial perspective.'",
        "'speaker_4': 'We say is is it a safety thing? So we we are going to have some decisions coming up about, you know, certain events that are planned. Of course, the event promoters at any time can decide what they want to do with their event.'",
        "'speaker_4': 'But the city at some point may need to make decisions whether, you know, whether we're going to allow those events to continue or not. And so, again, as of today, we are we are not at that point, given what we know.'",
        "'speaker_4': 'But those are questions we'll be working with our city attorney to and an economic development. If there's anything we can do.'",
        "'speaker_7': 'Great. And if we get some guidelines as to are you considering planning an event, here's what you should consider. Here's what the process might look like with our economic development team. I think that that would help a lot of the big events because we're we're going into summer, we're going into the biggest event season where our downtown'",
        "'speaker_7': 'is typically packed, our waterfronts typically packed. And I think there's a lot of concerns I'm not going to suggest this today, but I think it's really important that we recognize that there are cities this week that have put on eviction moratoriums because people have been quarantined.'",
        "'speaker_7': 'I think Italy put a was something that you homeowners pay a mortgage a mortgage moratorium because they are having such economic impact. So just things down the road to think about. And, you know, I think everybody the full team, I know that it's taken a lot of work.'",
        "'speaker_7': 'I know that the port, when I think about economic development, obviously if things are stopping coming from China, one of our biggest exporters, that's something I'm very concerned about. And if you have one last comment on that, I'd like to hear I know that it was in the presentation, but just how do we feel?'",
        "'speaker_4': 'So I can't really speak to the forecast. We do know that there as I think the port reported today or yesterday, that it's been about a 10% decline in actual output when you look from year last year to year this year.'",
        "'speaker_4': 'And a lot of that has to do with that. There just isn't production in China right now. They they really are in a phase where they are shutting down. It depends on how soon they're going to get back to that and how whether they're going to be shipping the materials again.'",
        "'speaker_4': 'You know, we look at that from a financial standpoint a couple of different ways. One is the impact on our economy. One in every five jobs is related to the port. So that's something we pay attention to. The port does have very significant cash reserves.'",
        "'speaker_4': 'So from a financial perspective on the port, they would be okay. And then we also look at it from a tidelands perspective because they do transfer 5% of their gross to Long Beach, but that would be or two to the city.'",
        "'speaker_4': 'But that would be a future impact that happens in about a year to two years from now.'",
        "'speaker_7': 'Right. Thank you. So thank you, everybody on the team that's been working on this. And I think that any of us council members here would have gladly signed on for an emergency item to be heard. So really appreciate all the efforts.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'Thank you. Fine. I do have any public comment on this item. CNN.'",
        "'speaker_0': 'There is one public comment on this.'",
        "'speaker_2': 'Item that come up.'",
        "'speaker_0': 'Wesley Kocher.'",
        "'speaker_3': 'Hello, counsel. So I just wanted to speak on the coronavirus a little bit. I know that you guys said that we've declared a public emergency, but for us at Cal State, Long Beach, life life seems to have continued as normal.'",
        "'speaker_3': 'We've been told to stay home if we're sick or wash our hands if a little bit more. But it's not really something you'd expect from a public health emergency. And Tim says we've had a phenomenal response in China.'",
        "'speaker_3': 'They've crippled their economy. They have armed guards outside of apartment buildings doing temperature checks. Italy has also been on quarantine, and I'm not suggesting that we should do anything that dramatic. I'm just saying that we should be offered a chance to protect protect ourselves by making California State University Long Beach online only until the end of the'",
        "'speaker_3': 'semester, like many other universities have done. Universities like Harvard, USC and Stanford. Now I understand why a lot of us aren't taking this super seriously. And I wouldn't blame you because we only have, what is it, three infections and no deaths.'",
        "'speaker_3': 'So while that might not seem super serious, I would just point out to you that the United States has only tested less than 5000 people, while South Korea has tested 140,000. In Italy, over 10,000. We're a port city and an airport.'",
        "'speaker_3': 'And so while it is largely possible that this virus may just be a slightly worse version of the flu, it is also quite a large possibility that it may be super serious. So in the event of that possibility, I would just like to go on record here in Long Beach and for my fellow 40 Niners and just'",
        "'speaker_3': 'say that me, Leslie, Utah, I warned you guys when it comes to senior centers, I work at a skilled nursing facility and we're doing temperature checks at the door, which I think need to be taken a little bit more seriously because while while we have implemented them, there are people giving other people passes and stuff.'",
        "'speaker_3': 'And I'm I'm not going to get too much into it, but I just want to say that I hope that we will take this more seriously. And thank you for listening to me.'",
        "'speaker_2': 'Hmm. Thank you. Anyone. Speakers. So, you know, would you please cast your vote? Now we move to item 27.'"
    ],
    "Donation to Beacon for Him Ministries using Second Council District Funds.": [
        "'speaker_0': 'Item 36 motion carries item. 36 has been heard in a 37 communication from Councilmember Pearce. Recommendation to increase appropriations in the general fund group in the city manager department by 1500 to provide a donation to Beacon for Him Ministries and the annual It's a drag to give event that took place on December 13th, 2019.'",
        "'speaker_2': 'Any public comment?'",
        "'speaker_6': 'I guess I have a small question. I didn't notice this when I read the agenda before, but it took place in the past. Do we typically. Is there a policy about this, Mr. Modica?'",
        "'speaker_4': 'I don't recall one. So I don't I don't know if it's sort of of the project.'",
        "'speaker_6': 'I just I had noticed that before.'",
        "'speaker_4': 'I don't recall.'",
        "'speaker_2': 'Any public coming. Please cast your vote.'"
    ]
}