{
    "Charter and Non-Charter Commission Appointments.": [
        "'speaker_0': 'Was here for our hard working Kiwanis. One more time. Okay. So next, we're going to take up our charter, our commission appointment. So we'll move two items, 26 and 35, which will be hurt together. And I'd like to recognize first our personnel and service, civil service committee chair Al Austin for appointments to our Charter Commissions for Harbor'",
        "'speaker_0': 'Planning and the Citizen Police Complaints Commission.'",
        "'speaker_7': 'Thank you very much, Mr. Vice Mayor.'",
        "'speaker_0': 'I like the way you need to read the item. The clerk Can we just move in? Okay. All right, go ahead. Continue.'",
        "'speaker_7': 'So, a little earlier today, our personnel, the Civil Service Committee, made recommendations for appointments to the civil to the Harbor Commission, to the Planning Commission, and I believe to the Citizen Police Complaint Commission reappointment as well. You got to bear with me.'",
        "'speaker_7': 'Get into my agenda items. And so the appointments the man made recommendations to appoint Bonnie Lowenthal, former city council member, former state assembly member, a longtime public servant in this city, and somebody I believe is very worthy of an appointment to the Harbor Commission, as well as former city council member Frank Callanan, who who's also been nominated'",
        "'speaker_7': 'and recommended by the Civil Service and Personnel Committee to also be on the Civil Arms Harbor Commission, as well as are before I go to the post through the Planning Commission. It's also are we looking at the appointments of the PCC?'",
        "'speaker_7': 'Desmond Fletcher. Confirmation for Desmond Fletcher. And there was one other. Re-appointment of Richard Lindemann to a second term on KPCC, two miles and Evan to the At-Large second term on KPCC, as well as Christian Cooper, to an appointment as a third district resident to the Citizen Police Complaints Commission.'",
        "'speaker_7': 'These were all made, voted on and recommended by the Personnel and Civil Service Committee with glowing recommendations. And again, I think the mayor has done himself with glowing appointments. I'd like to make a recommendation, a motion to approve the committee's recommendation and allow for comments of our.'",
        "'speaker_9': 'Guests that include Adam as well. This list that we approved last.'",
        "'speaker_1': 'So these are these.'",
        "'speaker_0': 'Are no longer the same prime minister.'",
        "'speaker_10': 'Again.'",
        "'speaker_7': 'These are.'",
        "'speaker_0': 'Those lists.'",
        "'speaker_7': 'That went through the Personnel Civil Service Committee. And so that's my recommendation. I move to to approve.'",
        "'speaker_0': 'Thank you. So, Councilmember Pierce, I have you queued up on a motion. I believe Councilman Austin intends to make the motion on the charter commission appointments. You want to. Tells me you want to. Okay. So it's been moved by Councilman Austin.'",
        "'speaker_0': 'Next, we'll hear from Councilmember Pearce.'",
        "'speaker_9': 'I just want to say that I think that these are great commission appointments. Earlier today, we had the opportunity to discuss the Harbor Commission and the Planning Commission. And it's great to have commissioners that have led that have experience leading that care not only about industry, the environment, but our neighborhoods.'",
        "'speaker_9': 'And I'm really honored and hope that my colleagues will support me and my other colleagues in appointing some great commissioners to our city. Thank you.'",
        "'speaker_0': 'Fantastic. Next, Councilwoman Price.'",
        "'speaker_8': 'Thank you. I, too, want to congratulate all of the appointees this evening. I especially want to recognize one of my predecessors, Frank Colonna, who will be resuming in his service in a more public light Frank. Many people don't know because he's very, I think, very humble and well-meaning and really cares about the city.'",
        "'speaker_8': 'But ever since he left the city council, he's been very actively involved in improving our city on the Rivers and Mountains Conservancy and has helped with so much of our efforts with wetlands and the Colorado Lagoon and all the things that are so important to many parts of our city.'",
        "'speaker_8': 'And he does that kind of under the radar without much fanfare because he loves the city. So I'm looking forward to having him working with us as a member of the Harbor Commission. And same with Assemblymember Lowenthal. Commissioner Lowenthal.'",
        "'speaker_6': 'What what should we. There's so many titles that we're going to need that we're going to need out our all the former vice mayor.'",
        "'speaker_0': 'But.'",
        "'speaker_8': 'Yes, and, you know, we I think all of us enjoy a very good working relationship with our harbor commissioners. They help educate us on the issues that are facing the industry and the changes in the industry. So I look forward to that continued relationship with both of you and to all of the commissioners.'",
        "'speaker_8': 'Welcome and thank you for your service.'",
        "'speaker_0': 'Thank you. Councilmember Urunga.'",
        "'speaker_10': 'Thank you, Vice Mayor. I was a member of the Civil Service and Personnel Committee earlier today that made the recommendation to here today. I said a lot of great things, man. And you all should have been here, man.'",
        "'speaker_10': 'That was awesome. So I'm not going to repeat everything I said and those of my colleagues, but I will say that I, as a former employee of the city of Long Beach, I worked with for these two individuals, Frank Luna and Buddy Lloyd, that when they were in the city council and it was a pleasure to work'",
        "'speaker_10': 'for them at that time. And this is an honor for me to be here in the days to approve and and push forward your names through these commissions. So congratulations and looking forward to working with you in the future.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_11': 'I, too, and extend my congratulations to each of you. It's awesome that all of you have extensive backgrounds. I've been doing a little bit of research and all of you, and it's just incredible the amount of talent that we have in Long Beach now representing us.'",
        "'speaker_11': 'And it's awesome more even more awesome to have someone from the first District representing our harbor commission, which is exciting. And also to you, Frank as well. I know we spoke as well over the weekend and I'm also very excited for you to join our harbor commission and I look forward to working with all of you in'",
        "'speaker_11': 'so many different facets. Congratulations again.'",
        "'speaker_0': 'Thank you. Next, we have Councilman Andrews.'",
        "'speaker_12': 'Also, I'd like to congratulate each and every one of you and good luck. I don't know what you're getting into, but still good luck.'",
        "'speaker_0': 'Thank you. Councilmember Supernova.'",
        "'speaker_1': 'Thank you. And congratulations to all the nominees. I know you'll do a great job. Also want to make special mention of Richard Lindemann re-upping on the Citizen's Police Complaint Commission. If that name is familiar. He ran against me in 2015 and I nominated him for that commission.'",
        "'speaker_1': 'So it's a special individuals volunteer to serve under those circumstances. So thank you, Richard.'",
        "'speaker_0': 'Councilmember Elanga.'",
        "'speaker_10': 'I would I would be remiss if I did not also congratulate all the other appointees. Hey, you know, Frank and Bonnie, you're so overwhelming that I forgot to also congratulate the other appointees to the various committees. And I know you'll do a good job.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Mongo.'",
        "'speaker_5': 'I just want to I just want to thank everyone and remind the community watching at home that we still have commission seats available and that this is a not only a great honor, but a great responsibility. And we appreciate those who have agreed to step up because many others often say, no, there is a lot of scrutiny'",
        "'speaker_5': 'and there's a lot of requirements. And so not only do we appreciate that you have already given so much of your lives to public service, but here you come again on another round of giving back. And so thank you so much for what you do.'",
        "'speaker_5': 'It really is a thankless job. We appreciate you.'",
        "'speaker_0': 'Thank you. And I'll insert my comments here. So I'll say to Bonnie and Frank, congratulations and welcome to both of you. The vote hasn't had. Yeah, but I think you'll be okay. You know, as you know, from current vice mayor to two former vice mayors, I got to say, you know, you know, you're making it look good'",
        "'speaker_0': 'here. What you're doing since leaving the vice mayor seat. So I'm really proud of both of you. I do want to say, before we open up the public comment, I want to congratulate all of the new appointees that were mentioned.'",
        "'speaker_0': 'And we will have two separate votes on the rest of the folks that are coming up. But before we go to public comment, I'd like to invite both Frank and Bonnie up. They'd like to just introduce themselves for folks who may not have but may not know them.'",
        "'speaker_0': 'I know we all know them, but to the folks watching, they may want a new introduction to our and to new harbor commissioners.'",
        "'speaker_5': 'Thank you so much for your comments, for your welcome and for your understanding of our past service. Service in the First District, in the state assembly, on the school board. The harbor is very special to me. I think the harbor accounts for one out of three jobs in the Southern California region.'",
        "'speaker_5': 'So the work that we do is going to be very critical for economic development, for the future of this entire region. And I just want to tell you that I've really never left the city family. I may not be on your side of the dais, but, you know, once you're on the council and once you work for'",
        "'speaker_5': 'this city, the passion really remains. So I thank you. I look forward to working with you.'",
        "'speaker_0': 'Thank you, Mr. Coloma.'",
        "'speaker_1': 'Thank you, vice mayor. I also want to thank Mayor Garcia and all of you for all the support that you've given not only now, but as we've worked together in the past few years on a lot of things.'",
        "'speaker_1': 'You know, one thing, it's always nice to come back home and Long Beach is such a great city and our port is just an enormous resource and we all rely on it. It feeds families, puts Rousseau for people's heads, provides the kind of goods and services that the entire country depends on.'",
        "'speaker_1': 'And so we have a lot of work ahead of us, but at the same time, we need to really stand tall and proud of the kind of port that we have from when it first started. And it was just a glimmer maybe 50, 60 years ago.'",
        "'speaker_1': 'And you look at it now and it's thousands of jobs and billions of dollars of of our economic vitality. So I want to thank you all. I'll do the best job I can for each and every one of you, as well as our residents of the city, and look forward to working together.'",
        "'speaker_1': 'This is a great opportunity and I'm so excited about doing it and very privileged, by the way, for your support. It's it's really an honor.'",
        "'speaker_0': 'Thank you. Thank you for those comments. So according to our city attorney, we're going to do one public comment for everyone. So I'm gonna go ahead and move forward with all the rest of the commissions that we have here.'",
        "'speaker_0': 'So well, now we're here are charter appointments. So to the Economic Development Commission, we have Steve Goodling, who's no stranger to to city hall. Steve Goodling has been the president and CEO of the Long Beach Convention and Visitors Bureau for the past 16 years.'",
        "'speaker_0': 'In that role, he's helped strengthen the local, local and regional economy by generating more than $300 million annually and supporting nearly 7000 local jobs. He's been involved in numerous economic development projects, including $45 million redesign of the Long Beach Convention and Entertainment Center complex, the grand opening of Pacific Ballroom at the Long Beach Arena, the terminal modernization'",
        "'speaker_0': 'of the Long Beach Airport, and many high profile special events and and conventions. And we have one additional one I'll take a moment to recognize Councilwoman Gonzales. She has a statement to make.'",
        "'speaker_11': 'Yes, I will recuse myself. I know Adam is my partner in life and so I have to do that. And his family is all right here celebrating him today. So I will leave the room.'",
        "'speaker_0': 'No peeking. Thank you. So next we have an appointment to the Long Beach Transit Board of Directors, which is Adam Corio. Adam is a council district. One resident and is currently working is currently the economic development manager for the downtown Long Beach Alliance, where he works to support job creation efforts by attracting and expanding and retaining business'",
        "'speaker_0': 'in the downtown core. Adam is also president of the Long Beach Commercial Real Estate Council and was previously an advisory board member at BRP Inc. In addition, Adam has more than ten years of experience in the competitive advertising industry in developing and executing marketing strategies for numerous successful brands.'",
        "'speaker_0': 'So I want to. So we have a number of commissions here. Let's just give a round of applause to everyone here. Steve Goodling, Adam Carillo, all the appointments that are being made tonight. So at this point at this point, we're going to.'",
        "'speaker_0': 'Councilman Pierce, I see you queued up where you queued up to speak. Okay. Thank you. So next, we're going to go to public comment here. So the interesting public comment on any of their appointments, please come forward and you have 3 minutes.'",
        "'speaker_0': 'Any public comment?'",
        "'speaker_1': 'I filled out a card.'",
        "'speaker_0': 'Oh, no, no. This is public comment on this item alone on the appointments. Please come forward, Will. So I see three people. Four. Okay. Go ahead. Proceed, sir.'",
        "'speaker_1': 'Good evening. City Council Vice Mayor Robert Fox and executive director of the Council of Neighborhood Organizations for the City. We applaud the recommendation of Miss Lowenthal and Frank Colonna, who I've known for 37 years. Great people. They serve the city of Long Beach magnificently in all capacities.'",
        "'speaker_1': 'You couldn't get a better recommendation anywhere. And it brings me to my point. I was reading the city charter because this issue came up for me about appointments of commissioners, and it just says that you have to be a resident of the city of Long Beach.'",
        "'speaker_1': 'That sounds great, you know, but it doesn't say anything about time. Now, I know that Frank's been here all of his life since 1954, so that's not an issue for me. But when you're having a commission appointment, I wonder if we should take a study on the city charter and think about how long would it be reasonable'",
        "'speaker_1': 'to live in the city of Long Beach before you are appointed to a commission or to a committee? Or to be elected to City Council for run for city council or to run for the mayor. I thought with a few friends of mine and the presidents of neighborhood associations and we came up with different figures two years'",
        "'speaker_1': ', three years, five years, whatever, but at least there was some time. And the reason for this is we want people who are familiar with the city of Long Beach have some provenance here and have some history. So they have some context to make reasoned judgments about.'",
        "'speaker_1': 'So rather than opposing anybody, I would just like to request perhaps that the Council bring into consideration a study on the city charter and perhaps come up with a recommendation in the future about how long someone should be in the city of Long Beach before they are recommended to a commission.'",
        "'speaker_1': 'And I hope that makes sense to you all. It certainly was sort of common sense to us. Thank you so much for your time.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Good evening, council members. My name is Christian Cooper. I am a third district resident in Long Beach for seven years. And I want to thank Mayor Garcia for this appointment to the Citizen Police Complaints Commission and the City Council for the consideration.'",
        "'speaker_1': 'I also want to acknowledge my mom and dad are here, Cathy and Grant and my partner Corey. So I want to thank them for being here. And this is my 10th year of practicing law, and I went into the law to serve the community.'",
        "'speaker_1': 'I work for Public Counsel, which is the Legal Aid nonprofit in Los Angeles. And I've been there for seven years, and I've really been looking for a way to increase my participation here in Long Beach. And so when I got a call from Tyler in the mayor's office asking if I was interested in this appointment, I said'",
        "'speaker_1': ', absolutely. This is my first choice when I was, you know, looking at all the different opportunities to serve. And I really look forward to putting my background and experience to use and working hard for the Citizen Police Complaints Commission and for the city of Long Beach.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening. Warmed Lisowski. Long Beach Citizens for Fair Development. I wanted to continue on with the first gentleman, said the city code section 502 regarding residents for commission says that the at the time of his or her nomination an election should be illegal legally registered voter of the city and should have been a bona fide resident of'",
        "'speaker_2': 'the city for at least 30 days. Bringing this up specifically regarding the Planning Commission nominee. Sure. He's a great guy. He looks like he's done a lot of good work with the unions. But according to the Long Beach Report and the mayor's office statement, he's just recently moved to the city of Long Beach.'",
        "'speaker_2': 'So echoing what the first gentleman said, there probably should be a longer time than the Coates calls for the 30 days. Also notable is that a political action committee that Mr. Lafargue was on the leadership of gave a substantially large donation contribution of $40,000 to the mayor's measure A and B fund for for the passage of the'",
        "'speaker_2': 'tax measure. So I would like to point out this reporting done by a large report and note that this nomination, although some folks.'",
        "'speaker_1': 'Have asked.'",
        "'speaker_2': 'For a copy of the nominating documents to verify that Mr. Lafargue is a Long Beach resident, a bona fide Long Beach resident, we have not received that and the timing is questionable. It's certainly not the type of service that Mr. Colonna or assembly person Lowenthal have given to the city of Long Beach.'",
        "'speaker_2': 'So I think this council should consider possibly delaying that approval for that particular planning commission spot, because we should have the best people on the planning commission, the best possible commissioners, not one that possibly has moved to Long Beach in some type of political arrangement, quid pro quo or whatever the facts of the case may bear out'",
        "'speaker_2': '. So that's our recommendation. Thank you.'",
        "'speaker_0': 'Thank you. Next week it was.'",
        "'speaker_6': 'Good evening, commissioners. My name is Michelle Grubbs. I'm the vice president of.'",
        "'speaker_11': 'Pacific Merchant Shipping.'",
        "'speaker_6': 'Association, and the PSA represents the customers and tenants at the port. As a follow on to what the gentleman just said earlier is.'",
        "'speaker_11': 'I'm here to support the nominations of.'",
        "'speaker_6': 'Frank Colonna and Bonnie Lowenthal, because we do have the best. We are lucky to have these two people that are willing to serve and have served for decades. We are pleased to be here to support them, and we know.'",
        "'speaker_11': 'That their heart's in the right place. They care about the residents and the.'",
        "'speaker_6': 'City of Long Beach. So look forward to it. Thank you.'",
        "'speaker_0': 'Thank you, Michel. Next speaker, please.'",
        "'speaker_1': 'Very good here. I echo the comments that are made by a number of people relative to making sure that we have people that have a thoroughly understanding of Long Beach and that we do not appoint somebody that. Instead, in lieu of people that have extensive records of knowledge and understanding and character that's consistent with the city and'",
        "'speaker_1': 'not do essentially what our mayor did last week famously captured on television as giving gave the middle finger, verbal middle finger to the concept that the residents of Long Beach are entitled to. Officials that are not corrupt. Period.'",
        "'speaker_1': 'And I to read that report and the the oh the stench from that. It's a continuation of a continuum of that epidemic of corruption that the mayor has endorsed and embraced, as we saw last week and about six weeks ago.'",
        "'speaker_1': 'So again, I echo the comments of the other individuals relative to selecting only those who have established an extensive record of knowledge and understanding. And residents within this city for any city commission or any city position. Thank you.'",
        "'speaker_0': 'Thank you. And so that concludes public comment. Any hour is able anyone else in line for public comment, please stand now so we can close speaker list. All right. Thank you.'",
        "'speaker_5': 'Hi. My pen is an artist and he was painting outside one day, probably 15 years ago. And Francona walked up to him and asked him about his bicycle because he needed to you know, it was a it was a beta.'",
        "'speaker_5': 'So Francona, I remember him from my friend, practically homeless artist that needed help with the bicycle and he assisted him in that issue. So people like that I can deal with and I when he's at some commission and I see that that's the man that how my friend probably 20 years ago that's important to me so I'",
        "'speaker_5': 'just wanted to point that out. And thank you, Bonnie Lowenthal, also for all the work with the murals at the park. Thank you.'",
        "'speaker_0': 'Thank you. And so that concludes public comment. Before you read, I'll just say again, once again, congratulations to all of the appointees, you know, the folks in the audience. You raise concerns. But the reality is this is this every appointee on the agenda is qualified per hour charter.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_10': 'City Attorney Yes, they will. And they will take an oath and we will process them accordingly.'",
        "'speaker_0': 'And how long does it take to get up to speed and take and actually get seated in their seats?'",
        "'speaker_10': 'That that would depend on the process. And when they can complete their ethics training, take the oath, pass and take the background, etc.. So it depends on when we can get it all scheduled.'",
        "'speaker_0': 'Great. I, I know that everyone that's appointed, they step up because they want to do the right thing and they want to do the right thing for their city. No matter if you've been here a long time or if you're making a commitment to purchase a home, invest, engage here.'",
        "'speaker_0': 'So I have the best intentions to every single one of the commissioners. Look forward to working with them on all the commissions to make sure that we build the best deal that we can possibly have. Councilman Alston.'",
        "'speaker_7': 'Yes, thank you very much. I appreciate everybody's comments. I'd also like to just recognize the fact that the fact that these are new commission appointments. There were several people that were served in service of our city that are now outgoing commissioners.'",
        "'speaker_7': 'And I think we should show them the same level of respect to thank them for the service that they put forth on behalf of the city of Long Beach as well. So and one in particular was our current planning commission chair, Denita Van Horn, who was a is a make district resident and who has served our city'",
        "'speaker_7': 'for many years in that capacity. And I wanted to just personally say thank you to her publicly. Thank you.'",
        "'speaker_0': 'Thank you. So at this point, we can go ahead. And members, please cast your vote. And we're voting on Mr. City and we can vote on all of them together now. Right.'",
        "'speaker_1': 'That's correct. I'm 26.'",
        "'speaker_0': 'Fantastic.'",
        "'speaker_6': 'Motion carries.'",
        "'speaker_0': 'Thank you. Quickly, we're going to take a photo with all the commissioners. If you can just join us on the steps. We'll take a quick vote council. If you'd like to join us, now would be the time.'",
        "'speaker_2': 'I don't even remember a lot of myself.'",
        "'speaker_8': 'Okay. So we have substantial.'",
        "'speaker_0': 'But yeah, it's not that many of us.'",
        "'speaker_8': 'Or do you want to come up here?'",
        "'speaker_1': 'Yeah. It's not that, you know, I don't feel like doing it.'",
        "'speaker_0': 'Let's just get on the steps.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_5': 'You know, people are people. And I know right under that where we drive. Good to see you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_10': 'That. I thought you would like that.'",
        "'speaker_6': 'Yeah. Yeah. Congratulations.'",
        "'speaker_0': 'All right. Thanks a lot to all our commissioners. We're going to proceed with the meeting. A city attorney says we still need to take one more vote on item 35. So, Madam Clerk, please bring up I'm 35 so we can vote on that.'"
    ],
    "Appeal on Conditional Use Permit for Bail Bonds Business at 1420 East Pacific Coast Highway.": [
        "'speaker_0': 'Thank you. So at this point, we're going to move forward with hearing number one. Madam Clerk, would you please introduce the item?'",
        "'speaker_6': 'Item one is a report from Development Services. Recommendations to receive supporting documentation into the record conclude the public hearing except categorical exemption and consider the appeal from Sue New and deny the appeal and uphold the Planning Commission's decisions to approve a conditional use permit permitting the operation of a bail bonds business at 1420 East Pacific Coast Highway'",
        "'speaker_6': 'in the Regional Highway Zoning District District six and authors require.'",
        "'speaker_0': 'Thank you. I hand it over to Mr. Modica.'",
        "'speaker_1': 'If the clerk can do the oath, please.'",
        "'speaker_6': 'Anyone wishing to speak on this item, please stand and raise your right hand. You in each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_10': 'Thank you, Mr. Vice Mayor, for this item. The staff report will be given by Linda Tatum, our planning bureau manager.'",
        "'speaker_8': 'Good evening, Vice Mayor Richardson, members of the city council. I'm here with Gina Cassius. She's the project planner on this case, and she will be supporting in the this evening's presentation. This item before you is a public hearing to consider an appeal of a planning commission, approval of a conditional use permit to allow a bail bonds operation'",
        "'speaker_8': 'at 1420 Pacific Coast Highway in the Highway Commercial Zoning District. This slide just gives you a vicinity map of the area. It shows the location of the site, which is highlighted there at the red with the red arrow.'",
        "'speaker_8': 'And it's on the south side of Pacific Coast Highway at Gundry Avenue there at the south west corner. The site is currently developed with a multi-tenant shopping center and a car wash, and the car washes from the views of the center that you see here.'",
        "'speaker_8': 'The car washes over to your right or west of the actual building. And it is the physical wash itself is located behind the building. The next slide. Oh, I'm sorry. If you could go back on the prior slide.'",
        "'speaker_8': 'If you see a red arrow there to the left of the site, that is the location of the proposed bail bonds operation. Would also like to share with you some slides of these around the area. These are photos of the adjacent area.'",
        "'speaker_8': 'To the north is Long Beach City College and directly behind the site is the Whittier Elementary School to the south. And there's also a an adjacent motel and I'm sorry, the Motel six. And there's also a CVS to the West Side.'",
        "'speaker_8': 'Just talking a little bit about the current zoning of the site and how we how those see you p that's currently being applied for applies. Right now the zoning code does not call out a bail bonds operation as a permitted use.'",
        "'speaker_8': 'And the way the zoning the city zoning code is structured, if a use is not called out, it is expressly prohibited. However, in this case, because the bail bonds operation is a financial institution, there is a category called all other financial services that are not specifically listed.'",
        "'speaker_8': 'So under that provision, the code requires a conditional use permit for this type of operation, and that's the basis for the conditional use permit hearing before the planning commission that was undertaken previously. Next slide, just to give a little bit of history and background on the Illinois bail bonds.'",
        "'speaker_8': 'They've operated for more than 20 years at a location here in downtown Long Beach, Ocean Boulevard. They're adjacent or directly across the street from City Hall. Now they are licensed by the California State Department of Insurance. And it's one of those very unique uses that does not a handful of uses in the city do not require a'",
        "'speaker_8': 'city business license. And a bail bonds operation is one of those that is completely regulated by the state, the Department of Insurance. So there is no city approval. However, they are subject to the city's land use controls, and that's why they are required to get a copy.'",
        "'speaker_8': 'Just a little bit regarding their operation. We know that they've been in business. It's one of the largest bail bond industries in the the United States. And they've been currently at that location on ocean for more than 20 years.'",
        "'speaker_8': 'But just talking a little bit about other bail bonds operations in the city, because they do not get a city business license, we don't have an exact count or how many are operating in the city. We know that just by a website search that there are probably approximately 30 that say they serve the city of Long Beach'",
        "'speaker_8': ', but we don't know how many of those are physically located in the city since the city does not have a license for them. Also, just a little bit of background about the the the project when it came into our city and we reviewed it, the things that we were looking for were compatibility of the site with the'",
        "'speaker_8': 'adjacent neighborhood and those kinds of considerations. So as a part of that, the applicant reached out to the neighborhood and we did get a letter of support from the neighborhood association. The Central Neighborhood Advisory Committee provided a letter of support for the project to the to the city staff.'",
        "'speaker_8': 'Next slide. So the item was heard by the Planning Commission in a public hearing on July and June 1st, 2017. And during that Planning Commission item, there were a couple of individuals that came to speak against the project, and we also had a letter of support from the neighborhood association.'",
        "'speaker_8': 'We also received a another a couple of letters of support from I'm sorry. The letter of support was from the neighborhood organization and two individual spoke against the project. However, at the Planning Commission, they deliberated on the item.'",
        "'speaker_8': 'They spoke to the applicant to get a better feel for the nature of the operation. The applicant, Elwyn Bale, Bonds's representative, spoke that the the business essentially operates like an insurance office. They don't they don't exchange funds there.'",
        "'speaker_8': 'It's all done electronically. And they their position is that they operate more like an insurance office than anything else. What we do know is that the nature of their operation, when someone is arrested, they operate as a bail agent, essentially.'",
        "'speaker_8': 'And the the family member or whomever comes to represent the the person who's been arrested provides a surety or a bond to ensure that the arrested person is available for the trial. So in that sense, the staff nor the police department had any concerns about the nature of the operation.'",
        "'speaker_8': 'And once Planning Commission asked many questions of the applicant to get a really good feel for the operation, and also based upon some of the very specific conditions of approval that were put on the project. And those were the city standard conditions of approval for any type of operation where we asked them to make sure that the'",
        "'speaker_8': 'property is maintained, that it is always clean and neat and does not create any impacts. We also added several special conditions of approval to the project and those included enhancing the exterior lighting on the project to eliminate the entry, the parking lot in the rear, any rear exits to the to the business.'",
        "'speaker_8': 'We also asked them to install security cameras with a 24 hour video feed that would go directly to the Long Beach Police Department. We also established another condition of approval to prevent loitering or any noises on the site during the hours of operation of the bail bonds.'",
        "'speaker_8': 'And of course, another condition that we thought was appropriate was just making sure that they didn't use any advertisements that created noise or any type of disturbance to the surrounding area. So after planning commissions, deliberation and the consideration of the conditions of approval, the Planning Commission voted 5 to 0 to approve the project subsequent to the Planning'",
        "'speaker_8': 'Commission approval on June 1st. We did get an appeal of that decision by Mrs. Sue New, who expressed her concern that the perception of the area as being a high crime area, and she thought that the bail bonds operation would contribute to a negative image.'",
        "'speaker_8': 'However, staff did do research on the area prior to the approval or recommending approval. We determined and through coordination and getting data from the police department is that the location of this site is not within a high crime area and that dispelled our concerns.'",
        "'speaker_8': 'So based upon the fact that it was not high crime and that we put appropriate conditions of approval to ensure a fairly safe and secure operation. The staff recommended approval to the Planning Commission. The Planning Commission concurred and they approved the conditional use permit.'",
        "'speaker_8': 'So in closing, I would just like to note that we did receive a letter from the applicant in support of the project, and that letter was provided, I think, to the City Council in your packet, but I wanted you to be aware of that.'",
        "'speaker_8': 'You may have a copy already. And with that, I would like to close by recommending that the City Council deny the appeal that was filed by Mrs. C sue new on this project and recommend that you adopt the the approved the categorical exemption for this project in compliance with the California Environmental Quality Act and that you approve'",
        "'speaker_8': 'conditional use permit number 17 03-38. That concludes staff's presentation and we're available if you have any questions on the project.'",
        "'speaker_0': 'Thank you. That concludes Mr. Monaco staff's comments.'",
        "'speaker_1': 'Yes, it does.'",
        "'speaker_0': 'Okay. So at this point, we're going to invite the applicant forward as the applicant here. I. Thank you. And according to our city attorney, you have in a reasonable amount of time to make a case. So let's call it 10 minutes.'",
        "'speaker_1': 'Thank you and good evening, Vice Mayor and members of the City Council. My name is Mike Recuperar. I represent Aladdin Bail Bonds. At first like to thank staff and the city for working with us over the last year on this project.'",
        "'speaker_10': 'And thank thank the leadership of the city of Long Beach and Councilman Andrew's office for working with us, encouraging us to do outreach to the local community. We met with the CDC and had a really constructive meeting with them.'",
        "'speaker_10': 'The.'",
        "'speaker_1': 'Bail bond industry is misunderstood. And all of the comments that you will get from people who believe that is going to draw crime.'",
        "'speaker_10': 'To their neighborhood.'",
        "'speaker_1': 'Are frankly misplaced. It is an insurance.'",
        "'speaker_10': 'Transaction where the loved one is coming in to bail out someone who is incarcerated. And so it is not a place of loitering and it is not a place where headhunters like you see on TV work.'",
        "'speaker_1': 'In fact, a land bail bonds doesn't hire, doesn't.'",
        "'speaker_10': 'Have headhunters or fugitive recovery agents, as they're called in the state code. And so there is a misinterpretation that from what you see on TV and frankly, what you see in other parts of the city is going to happen here.'",
        "'speaker_10': 'The other, there are approximately 20 other bail bonds facilities, none of which have a use permit in the city of Long Beach. And you will see that some of their guerilla marketing and advertising techniques.'",
        "'speaker_1': 'Are less than desirable.'",
        "'speaker_10': 'ALLEN Bail Bonds is the largest bail bond company in the United States. They have about 50 locations throughout the Western states, and they have a high degree of professionalism, as you would expect in an insurance transaction. So we are here to answer any questions that you have, but I want to thank you for your time and your'",
        "'speaker_10': 'consideration.'",
        "'speaker_0': 'Thank you. So now we'll invite the appellants to the front with a similarly reasonable amount of time. So no more than, say, 10 minutes. Please come forth. Give us your name and proceed.'",
        "'speaker_5': 'Good evening.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_6': 'Good evening, council members. My name is Sunil and I am an owner of the Quadriplegics. This one street down from this proposed business on 17th and Gundry is about 20 feet away. It's very close, I would say. I actually put an appeal on Exhibit H and I would like to kind of recap what I see in the'",
        "'speaker_6': 'exhibit. The neighborhood, as is, has a reputation as a high crime area and the presence of this bail bond company, but only enhance and reinforce the reputation now. And the perception of a safe neighborhood is a major selling point for a rental business such as mine to get business.'",
        "'speaker_6': 'And this high criminality image will lower the brand of this area, which currently is actually much lower than elsewhere in the city. It will make it more difficult for small business owners like ERs to survive and. I would like to appeal that the council member denied this bail bond company and not drive us out of business.'",
        "'speaker_6': 'Otherwise we may have to resort to leaving the area. On the point that the Neighborhood Advisory Committee has supported this business. I can say that I did not get any notice from them about this business until I got a letter from the city about this motion of having the business in the area.'",
        "'speaker_6': 'So I really denied that I had any interest that they are representing me at all. And my greatest fear about this presence of business is that other business of the similarly nature.'",
        "'speaker_5': 'Will.'",
        "'speaker_6': 'Be encouraged to open their businesses here.'",
        "'speaker_5': 'And it would definitely. How do you see? Cost the value of my resale value of my property due to plummet.'",
        "'speaker_6': 'That's my concern. I hope.'",
        "'speaker_5': 'You will.'",
        "'speaker_6': 'Be able to put yourself in my shoes and empathize my situation, because the reason I had invested in this building is to take care of my retirement. As well as to provide decent housing.'",
        "'speaker_5': 'For the neighborhood. So I hope you.'",
        "'speaker_6': 'Will consider that. And.'",
        "'speaker_5': 'Be able to.'",
        "'speaker_6': 'Empathize my situation. Thank you.'",
        "'speaker_0': 'Thank you. Is there a second appellant? No. Okay. So we'll invite the applicant back to rebut if he chooses to. So the rebuttal is no longer than 3 to 5 minutes.'",
        "'speaker_1': 'Thanks, Mr. Vice Mayor. Thank you. I think we heard from staff that indeed this is not a high crime area, despite the fact that one individual considers it to be. And second of all, with the the concern is that.'",
        "'speaker_10': 'This is going to become a.'",
        "'speaker_1': 'Area where you're going to get a lot of bail bondsman moving in. I would suggest that's probably not the case for a lot of reasons. But I think it's also important to remember that of all the bail bondsman in the city of Long Beach, this is the only one that's coming before you currently for a use permit'",
        "'speaker_1': '. To the best of my knowledge, we're trying to.'",
        "'speaker_10': 'Do things right, and staffers conditioned this project to work in a professional manner. And so I think that deserves some recognition. Thank you.'",
        "'speaker_0': 'Thank you. So that concludes the hearing. Now we'll take it back behind the rail. Councilmember Andrews.'",
        "'speaker_12': 'Yes. I don't have very much to say about this. I would like to ask the young lady if that's okay. What do you.'",
        "'speaker_0': 'Yes, you have the floor. Yeah.'",
        "'speaker_12': 'I just want to ask one question. Do you live in the area? I'm sorry. Do you live in the area?'",
        "'speaker_5': 'Yes, I.'",
        "'speaker_12': 'Do. Okay. You live in there? You have property in the area?'",
        "'speaker_6': 'Yes, I have a property in the area I have a vested interest in.'",
        "'speaker_12': 'Do you live in the area? Do you have property in the area? Yes, I do. You live in the area? Yes. Okay, fine. Thank you. Thank you. Okay. That's that'll.'",
        "'speaker_1': 'That's all I have to say.'",
        "'speaker_12': 'To my colleagues. Will you support me on this issue, please? Thank you. To Peru.'",
        "'speaker_0': 'Thank you. Any public comment on the side?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Please come forward. Before you proceed. Is there just two or is a third person that needs to speak? Please line up. Please. Mr. Goodhue, are you in line? Okay. So, Mr. Good, he was the last speaker. Thank you.'",
        "'speaker_0': 'Please proceed.'",
        "'speaker_2': 'Hi. Warmed Lisowski along with Citizens for Fair Development. Just as a point of order, I wanted to read your agenda here at the top. It says Ordinance C, 7594 provides that hearing shall be set at 5 p.m. each Tuesday.'",
        "'speaker_2': 'Such hearing shall be held at a specific time for which they are set regardless of otherwise order of business. This hearing should happen at 5:00. Anyways, getting back to the SO Lobby Citizens for Fair Development. I would like to offer our support, our moral and ethical support to the appellant.'",
        "'speaker_2': 'Let's be honest, Bell Bonds is not an insurance business. Bell Bonds is a predatory industry. In fact, the California legislature is moving to basically abolish the bail bond system. If we look at the July 13th, 2017 Los Angeles Times headline from George Skelton, it says Our current bail system is indefensible.'",
        "'speaker_2': 'The bill that aims it needs work. Okay, the bill that aims to fix it needs work. But point taken that the current bail system's indefensible. So the way that the city issues conditional use permits it's suspect it's unfair in this situation you've got a resident small business owner versus a multimillion dollar self-professed the largest bail bonds company'",
        "'speaker_2': 'in the country in front of this council. Who's going to win that battle every time? Of course, the multimillion dollar company is going to and the small business owner resident will lose this issue. So we just wanted to point out the fact that we're supporting this opponents and the way that conditional use permits are issued by the'",
        "'speaker_2': 'Planning Commission and this council are clearly unfair and weighted towards larger business. Thank you.'",
        "'speaker_0': 'Thank you. Next week, please.'",
        "'speaker_1': 'Good evening, ladies and gentlemen. My name is Chris Goshen, and I'm the owner of the car wash that's on the same shopping center as the alarm bell bond. And I'm here to give my 100% support to the bail bond.'",
        "'speaker_1': 'As you heard from the bail bond, they are the their reputation is great. They've been a great, great standing in the city of Long Beach. They've been here for 20 years. And I think it's it's a great business for the area.'",
        "'speaker_1': 'They have a great structure. And when they come.'",
        "'speaker_0': 'In, they do things right and.'",
        "'speaker_1': 'They do things clean. And and it's great for the neighborhood. Also, I believe that they are open very late or 24 hours a day. And I think it's good to have somebody there 24 hours a day because it's not a high crime area, but sometimes the homeless people at night in the area.'",
        "'speaker_1': 'And it's good to have somebody there that monitors.'",
        "'speaker_0': 'The area and there's.'",
        "'speaker_1': 'You know, some things going on. They can call the police. Also, the business before this bail bond was the hair salon and they had ten chairs there, about seven or eight for four barber shop and four or five as a hair salon for ladies.'",
        "'speaker_1': 'And sometimes on weekends or Friday, Saturday, Sunday, the place was really busy and there was no other parking for anybody else, nobody else for the carwash or the subway or anybody else. So I know that bail bonds usually do two or three.'",
        "'speaker_0': 'Transactions a day. So it's a.'",
        "'speaker_1': 'It's a it's good for the other businesses that people can come in and park in that shopping center. So 100% support the Aladdin Barber Thank you.'",
        "'speaker_0': 'Thank you. Seeing no further help Mr. Good you come forward.'",
        "'speaker_1': 'Very good. You quickly. It occurred to me that there might be a conflict of interest. A little conduct conundrum, if that's the word. While we're fortunate and having on this council and employed by this city, an overwhelming majority of people are overwhelmingly honest, straightforward, and would never need a bail bondsman.'",
        "'speaker_1': 'However, that cannot be said for all that work in this building, some of which are not here tonight. So I'm wondering whether or not there's a conflict of interest in this city, in this form. Voting one way or another on this.'",
        "'speaker_1': 'And that just struck me as I sat here. Overwhelming majority of people are honest. Obviously, as referenced earlier, we have a mayor that. Takes it gave the middle finger last week on national broadcast nationwide that he doesn't believe.'",
        "'speaker_1': 'That the people of this city are entitled to a corruption free government. So I suggest this measure puts the city in a position of facing somewhat of a conundrum and whether or not it should even be dealing with this or how to deal with it.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. So that concludes public comment. So at this point, members, please cast your vote.'",
        "'speaker_6': 'Right now, I'd just like to correct for the record.'",
        "'speaker_8': 'The recommendation that I earlier indicated misspoke. The project number. The project number. The correct project number is C up 17 dash 006.'",
        "'speaker_0': 'Thank you, Linda.'",
        "'speaker_6': 'Motion carries.'",
        "'speaker_0': 'Thank you. I'll take a moment just to do some housekeeping. First, I want to. Mr. City Attorney, do we need to report out from the closed session earlier?'",
        "'speaker_10': 'There was no reportable action. Closed session?'",
        "'speaker_0': 'Fantastic. Thank you. Secondly, I'd like to just acknowledge that our mayor is not with us tonight. He's he's in New York City with 40 mayors as a part of our Bloomberg and Harvard Leadership Institute. And I'm excited to see what great ideas comes back for our city.'",
        "'speaker_0': 'So he's not with us tonight. So you've got me tonight. So we'll move forward with so the next hearing, let's open up hearing number two and it will be continued. So that motion will just be to continue to date certain.'"
    ],
    "Naming of Cesar Chavez Community Center Facility in Honor of Ruth Ricker.": [
        "'speaker_0': 'Thank you. So we're going to take up item number 28 next.'",
        "'speaker_6': 'Item 28 is a communication from Councilwoman Gonzalez, Mayor Garcia and Councilmember Urunga. Recommendation two Request that the Housing and Neighborhoods Committee consider.'",
        "'speaker_11': 'Renaming the Senior.'",
        "'speaker_6': 'Meals Program at Cesar Chavez Park. The Ruth Reichl Senior Meals Program.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_11': 'Yes, I would like to first thank Mayor Garcia, who is not here, but Councilmember Suranga as well, for joining me on this item. As many of you know or may have known in previous meetings and discussions, we've talked about Ruth Recor.'",
        "'speaker_11': 'She was a strong and passionate person whose advocacy changed the lives of many, not only here in Long Beach, but really across Southern California. She long advocated to see the affordable housing was in place for many seniors as well as the senior meal program.'",
        "'speaker_11': 'I would often spend many times with her at the coffee shop right next to Village Treasures. Now Dollies, that was her favorite spot. And we would talk about the senior meal program. And when she passed away, I thought, what a perfect program to reinstate at Chavez Park, but what a perfect person to name it after.'",
        "'speaker_11': 'I also want to acknowledge Don Darren, our who is here from our senior advisory commission and Barbie as well, and many of the community members who have long supported Ruth in her life and also afterwards. I would also like to acknowledge her amazing family here.'",
        "'speaker_11': 'Juanita Ricker, who is Ruth's daughter, Jason Ricker, her son Macksville, of course, owner of Village Treasures on Broadway, Carolyn Christian Hines, Gayle Wilson, Julie Nemechek and Wynn Collins. I want to thank you all for being here and supporting her.'",
        "'speaker_11': 'And so, with that said, this program is currently in place at Chavez Park and it is serving many seniors in our area, especially those who happen to be of incomes that are lower income. And with that said, I want to just thank everyone for being a supportive as possible with this.'",
        "'speaker_11': 'I ask my colleagues to be all be supportive of this as well. But the contributions of Ms.. Ricker on behalf of older adults across the city of Long Beach should not go unnoticed. She was truly, truly a community leader who fought for the reinstatement of this program.'",
        "'speaker_11': 'And now here we have it. So thank you very much.'",
        "'speaker_0': 'Thank you. Next, we have Councilmember Elanga.'",
        "'speaker_10': 'I mean, for support of Councilmember Gonzalez's motion. And I hope that this moves forward. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Angie.'",
        "'speaker_12': 'Yes. Also, you know, as chair of the Housing and Labor Committee, you know, I will be very, very excited and happy to have this. You know, when we do bring it up to make sure that this, you know, go into full operation.'",
        "'speaker_12': 'We want to thank you guys for being here to support this item. Thank you again.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_9': 'Yes. I also want to thank my colleague for bringing us forward. I had the opportunity to meet Ruth on several occasions and so it's great to be able to name something that brings such value to our community. And so thank you very much.'",
        "'speaker_9': 'Great job.'",
        "'speaker_0': 'Thank you. And I'll just I'll just add what an honor this is for your mother and congratulations to you and your family. And you have my complete support. And thank you, Councilmember Gonzalez and our mayor and councilman, your angel, for taking a lead on this.'",
        "'speaker_0': 'And I do encourage the whole council to support this. Is there any public comment on this item?'",
        "'speaker_1': 'Good evening, Don. Darn. Our vice mayor and council members. I just wanted to make a couple comments regarding Ruth. She was on the Senior Citizens Advisory Commission with me. She was the little girl that I tell you. She had a lot of spunk and energy and she come up with all kind of ideas and she'd make sure'",
        "'speaker_1': 'they followed up on. And that just explains the kind of person she was and why we should be honoring her with this. We're so glad to have this this senior meals program going. And I think I hope it's going to continue because we need support on this.'",
        "'speaker_1': 'And I'm so glad that we're going to honor her with this name. Also, we were talking about having a tree planted in her honor and also in the Chavez park there. But I just wanted to make a point of of what a grand lady this is and her her the children that she's raised.'",
        "'speaker_1': 'They're great people. You just can't believe what a wonderful family this was. No. As I see her leave this earth as she did. And I really admired her. And I just want to support this. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. Good evening.'",
        "'speaker_1': 'Counsel. Name's Jason Berger. I'm son here of my sister.'",
        "'speaker_0': 'And I just want to thank you.'",
        "'speaker_1': 'Thank you, leader. I know one mother put a lot.'",
        "'speaker_0': 'Of work in with with you.'",
        "'speaker_1': 'And Mayor Garcia, and so I just really want to thank you for that and no vanity at all. But that you know, and you know, I'm as humble as my mother. We're all as humble as she was. So we just appreciate the thought.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. And makes me the boss.'",
        "'speaker_1': 'Good afternoon. I also knew Ruth not very well, but at every committee community event she was there. Our Wilmore Heritage meeting. She would show up at the for the need or whatever it was need to be supported. She was a lady with a lot of class and greatly missed.'",
        "'speaker_1': 'And I wholeheartedly support this. And I mean, we should be outside of the statue, but a tree.'",
        "'speaker_10': 'Definitely should be at Cesar Chavez. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'Rabbi Pete from California, greater vote, Republican like local Republicans, but more Republican. So that's good. She has a good name, it seems like I don't know her, but she had to have had a good name in order to be there, unlike some other people that shouldn't even be here.'",
        "'speaker_2': 'Who's asking? Councilman Woman Anything about what I don't want to hear about? Nothing, she asked, respectfully.'",
        "'speaker_0': 'That's off topic, brother.'",
        "'speaker_2': 'Hey, this is the topic. This is a good one.'",
        "'speaker_0': 'Been on time.'",
        "'speaker_2': 'I'm on topic. I'm talking about the name and this is topic and I'm here. Listen, you guys are here to listen. You guys are getting paid by the people, so I don't need my conversation guide. I'm a tell you what's on topic.'",
        "'speaker_2': 'It would be off topic if she would resign and she wasn't here. That's what I'm saying. That's the.'",
        "'speaker_0': 'Last time.'",
        "'speaker_2': 'What do you mean? Warning.'",
        "'speaker_0': 'You need to stay on topic. This is not general public comment.'",
        "'speaker_2': 'So hey, I don't already mixed. I'm talking about this and now you're going to tell me what to say? Is that what you're going to do? Can you give me my time back? You want to play hardball first?'",
        "'speaker_2': 'You told me I couldn't do something that the man said was legal. And. Okay, going here, you're going to start telling me stuff that I can do and I can't do. Just off winging it, because that's what you did.'",
        "'speaker_2': 'Now you're going to stop me. Yeah. Now she's glad because I'm not on her and I'm talking to you now. But like I said, she shouldn't be here. I'm sick of seeing.'",
        "'speaker_0': 'Her for your time. Sorry. So. So we'll take it back behind around Councilwoman Gonzalez.'",
        "'speaker_11': 'Or city attorney, would you like to go first?'",
        "'speaker_10': 'Thank you. Councilmember Gonzalez, the the issue, I think, has become this is a new thing in naming a program, and it's as part of a park program. It probably should also include a referral to the Parks and Rec Commission for their discussion and whether and how.'",
        "'speaker_1': 'You decide.'",
        "'speaker_10': 'That. But I would hope that you would amend your motion to send it to Parks and Rec Commission also.'",
        "'speaker_11': 'Absolutely. We will definitely do that. And since this is a the first time that we've done this, I appreciate the amendment. And I would just say that just to have the last word about Ruth, because this is really about Ruth, is that she was a very forward thinking person.'",
        "'speaker_11': 'And I know that she would be very happy if we that we're obviously reinstating this. I want to once again thank the family for being here. I know that she lives definitely in each of you and her humbleness and her gratitude for community.'",
        "'speaker_11': 'And thank you again.'",
        "'speaker_0': 'Thank you so much for the public comment. Members, please cast your vote.'",
        "'speaker_6': 'Motion case.'"
    ],
    "Review of City-Wide Park Programming and Policies for Equity and Efficiency.": [
        "'speaker_0': 'Thank you. Next, we'll have item number 29, please. Congratulations. We'll have item number 20.'",
        "'speaker_6': 'Notice item 29 is communication from Councilwoman Gonzalez, Councilman Andrews, Councilmember Urunga and Vice Mayor Richardson, recommendation to request the city manager to work with Parks, Recreation and Marine. And report back to the City Council within 120 days with an overview of citywide park programing and with a plan to incentivize the use of underutilized parks that do not'",
        "'speaker_6': 'overburden community organizations.'",
        "'speaker_0': 'Thank you, Councilman Zollars.'",
        "'speaker_11': 'Yes. I have a PowerPoint to join us, but I want to thank everybody here for their time, for being very patient. I know this has been a.'",
        "'speaker_6': 'Very slow moving.'",
        "'speaker_11': 'Meeting, but I appreciate everyone's time here. First, I'd like to thank my colleagues for joining me on this item Vice Mayor Richardson, Councilmember Andrews and Councilmember Saranga. Before we start our brief presentation, I want to make sure that everyone understands that tonight's item is not as it's been referred to.'",
        "'speaker_11': 'It's not a veiled attempt to attack the municipal band. In fact, many of our communities want the municipal band in our in our in our neighborhoods. In fact, one of my community members, our community groups had asked when the municipal band would come back and return to Drake Park.'",
        "'speaker_11': 'We had hundreds of people last year that really enjoyed it and we would have hoped to have had it at future events. However, we were told that we.'",
        "'speaker_6': 'Wouldn't receive.'",
        "'speaker_11': 'One but once every four years.'",
        "'speaker_6': 'So this item.'",
        "'speaker_11': 'Is more so an item that will look at equity in all facets, both citywide assets, park programs, etc.. It's also an item that will not talk badly or attack our city employees or anyone who works in our parks.'",
        "'speaker_11': 'As an eight year employee myself of the City of Long Beach.'",
        "'speaker_6': 'Three of which have been elected, five.'",
        "'speaker_11': 'Working alongside many of these parks staff members. I've seen firsthand the outstanding work of these employees, what they do and the attention they put into serving our children and our parks every single day. As a now an elected member of the City Council, my duty to every resident in the city as it is a steward of our'",
        "'speaker_11': 'resources, is to sit down and the diocese to ensure that I challenge thought and to ensure that equity is at every conversation, especially in the way we're distributing our funding and our park programing. Tonight's item represents months of research and data collection.'",
        "'speaker_11': 'My amazing staff who is.'",
        "'speaker_6': 'Sprinkled around here, there's Andrew and.'",
        "'speaker_11': 'Christian and Jennifer and Corey.'",
        "'speaker_6': 'And we work together to actually go through every.'",
        "'speaker_11': 'Single page of the.'",
        "'speaker_6': 'Parks program and.'",
        "'speaker_11': 'Guide and ensure.'",
        "'speaker_6': 'That all of our.'",
        "'speaker_11': 'Communities were represented. And as you'll see here, we've done a lot of brainstorming, but we're looking to have this information come back in the next 120 days as we work together as a city on Park Equity. So first we'll go over let's get my ID.'",
        "'speaker_11': 'So here it begins. So it's important to understand that we're talking about equity, as we will talk about later in this presentation, the city of Long Beach has multiple documents and master plans that speak to the need for more active programing in Central Northwest and in downtown Long Beach.'",
        "'speaker_11': 'Yet we continue to allow these programs to only exist in on the east side of the city. Now, how do we do that? How do we know that this is the case? We'll go on to slide three. So these are.'",
        "'speaker_6': 'The two programs we went.'",
        "'speaker_11': 'Through extensively, went through page by page. This will just be a slide. This is our first one that actually addresses contract classes. It represents the vast majority of park program programing in the city of Long Beach. I cannot make up the data.'",
        "'speaker_6': 'All we did is we put.'",
        "'speaker_11': 'This information and put it into an Excel spreadsheet. And as you can see, we decipher are divided it in per district. So as you can see here, there are classes that are only promoted in detail through the quarterly recreation connection, which is mailed to every household in Long Beach.'",
        "'speaker_11': 'However, this guide does not represent a fair and equitable distribution of these classes. As we go on to Slide four and five, my staff also took every class that was offered in both the spring and summer guides, which represents a total of six months of park programs.'",
        "'speaker_11': 'We separated the data into age categories preschool. For an adult 50 plus. We then calculated the hours a week. Each park was programed and arranged them by council district and as you can see, north central and west Long Beach are at a severe disadvantage.'",
        "'speaker_11': 'Again, we just transferred the data. And I want to be clear that these are solely the contract classes at park facilities. So contract classes are small business owners that want to work at our parks and they're then offer a they're asked to they ask the public basically to pay a small fee in order to participate in these'",
        "'speaker_11': 'classes. And this doesn't take into account the teen senior center hours, which represent the normal operating hours of our community centers and are loosely structured. We have a lot of senior hours there about, you know, from 10 to 2 or 10 hours, and those are all throughout the city.'",
        "'speaker_11': 'It also doesn't reflect the specialty classes such as the nature center or the cultural center, which are limited in scope as they are sporadically located around the city. Now onto Slide six. And if the realization of inequity in north, central and west Long Beach was not apparent enough, we wanted to walk through some direct scenarios that further'",
        "'speaker_11': 'detail the issue. So Slide seven Aquatic Classes. I know aquatics has also been a large issue as well. A lot of individuals have said, you know, we only have three pools Belmont, MLK and Silverado. However, among the three pools which are distributed equally around the city, we don't distribute the classes equitably either.'",
        "'speaker_11': 'In fact, in the spring 17 guy, the temporary Belmont Pool represents 74% of all the aquatics classes the City of Long Beach promotes. That is more than both MLK and Silverado together. As we go on to Slide eight, some individuals have made the argument that East Long Beach has more programing because they have more park space to'",
        "'speaker_11': 'program. But that's also inaccurate. College of State Parks, for example, is on the eastern border of the city of Long Beach. It is 2.3 acres in size, including a community center, and has 50 hours of weekly contract class programing.'",
        "'speaker_11': 'In summer 2017, as compared to Cesar Chavez Park on the western side of Long Beach, it is 32.9 acres with a community center and represents 0 hours of weekly contract class programing. Onto Slide nine. Other examples of it equity are based in where we place programing versus where the need is for those that program, those programs.'",
        "'speaker_11': 'For example, in 90813, we've seen in many media reports, which covers portions of central and west Long Beach. There is an average of about 16 to 18% unemployment. Recently, the mayor had talked about 4.4% as a citywide number.'",
        "'speaker_11': 'This is clearly 12 to 14 percentage points higher than the rest of the city. However, all of the adult career enrichment classes, which include resume writing, how to utilize LinkedIn and others, are housed in Eldorado Park, where unemployment is an average of 3 to 4%.'",
        "'speaker_11': 'Onto the next slide. A few years ago, our Health and Human Services Department did a community assessment. This detailed further this detailed report further communicates the need for healthy and active programing in north, central and southwest Long Beach.'",
        "'speaker_11': 'We've also had information relative to life expectancy, and life expectancy is a big map and it details quite a stark statistic all around the city. Our own research shows that the life expectancy when you live in north, central and southwest Long Beach is anywhere from 5 to 7 years less than those living in East Long Beach and'",
        "'speaker_11': 'south east Long Beach. Activating our parks in an equitable way will go a long way to combat these staggering and staggering statistics. Now, the solutions part. Basically what you see here and what I've shown, I know it's very stark and I know we we don't like to see these details often, but it has to be said.'",
        "'speaker_11': 'I mean, the inequities are there. We often have many plans that tell us that these inequities are here, that we have plans that tell us that there's high unemployment rates, high obesity rates among children, high poverty levels among some families.'",
        "'speaker_11': 'I know in the Washington neighborhood, in my district specifically, families are about 40% of families are living under the poverty line. Yet we don't have the park programing to supplement and to support those those programs. So knowing that these inequities are a huge issue throughout Long Beach and as we move forward with crafting a way to correct'",
        "'speaker_11': 'these issues, I want to go over some solutions that we have identified. First, as I mentioned, we need to utilize existing master plans that the City Council has approved as a foundation for how we program our parks. For example, see x three study, which shows us the areas of greatest need as it relates to healthy eating and'",
        "'speaker_11': 'obesity. Perhaps in those areas we can have classes on food and community gardening the Livable Westside Plan, which seeks to enhance the community's physical environment and improve accessibility and connectivity to the rest of Long Beach. The Downtown and transit oriented development pedestrian plan, which talks about how we can access transportation in dense areas and how to get'",
        "'speaker_11': 'individuals out of their houses to be more active. Yet no programs in downtown the bicycle master plan, which creates the infrastructure for people without a car to get to and from every corner of the city, including our parks and of course, My Brother's Keeper, which speaks to the need for more programing for our boys and young men'",
        "'speaker_11': 'of color to help address the issues of violence. Unfortunately, and I know many of our community partners who are here like Central Char Wilmore, North Pine, so many of them have been working so very hard. And unfortunately, there are challenges still in some of our districts.'",
        "'speaker_11': 'And I'm glad that some of my council colleagues don't have to they don't have to deal with some of the issues that we've had to deal with in the First District. Unfortunately, we've had a historic issues with gang violence in Drake Park, Seaside Park, some of our West Side parks.'",
        "'speaker_11': 'So this is just to be able to say, look, we have these issues. We know that there are challenges. We're working very hard as a community. Let's work together to fill in the gaps. Let's work together to look at our citywide assets and see how we can fund them equitably, inappropriately.'",
        "'speaker_11': 'So the solutions I'm going to provide today include and I also want to thank as well our Parks and Rec Commission. I actually spoke with three commissioners over the last couple of days. They had been very open to these suggestions and I know a lot of them had these issues as well.'",
        "'speaker_11': 'They had issues and concerns. For the first solution I'd like to propose is the multiyear permits for annual events. For example, the Wilmore City Heritage Association has transformed themselves from a neighborhood group to a501 C3 in order to support park programing.'",
        "'speaker_11': 'They have raised over half a million dollars in the past five years to program Drake and Chavez Park with annual events. That is a huge yes. That is a huge undertaking for a community group that has most of them have full time jobs.'",
        "'speaker_11': 'And however, they must apply for a fee waiver every single year for every event when they're really doing the city's work. So we should look at multiyear permit agreements similar to what the Coastal Commission offers the Grand Prix.'",
        "'speaker_11': 'I think instead of coming each year they go, they have this multiyear agreement that makes a lot easier on both sides. So waiving park fees, we should also look at the possibly waiving fees for these community groups who are vetted out and specifically want to program the parks that our city is not focused on programing.'",
        "'speaker_11': 'This is a great supplement to providing equity in programing and we should not create roadblocks for these organizations if they're doing our work. Secondly, the mobile rec program, I know we've talked about it in prior discussions. Another solution we could explore is revamping this program so we can proactively program are smaller parks that do not have community'",
        "'speaker_11': 'centers or restrooms, which I know is an issue. Thirdly, that the plans, as I mentioned, we have to update some of our plans. We need to update the open space and recreational element of the general plan in our prime, our Parks and Recreation and Marine Strategic Plan.'",
        "'speaker_11': 'We have not been updated since the early 2000s. I think they can provide clarity to a lot of these issues as well. And so the amended motion, I know this is a lot, but I want to thank you again for being very patient, is to request the city manager work with our Parks, Recreation and Marine as well'",
        "'speaker_11': 'as our Parks Commission Department and on this item and return to the City Council within 120 days. Detailing the following We need an overview of citywide park programing hours and funding expended in each location basis of prioritization for programing in each area.'",
        "'speaker_11': 'An Overview of current park programing participants based on zip code. Currently, we are not tracking where these individuals are going, where they're coming from. It would be good to to have that information, policies and processes that can be reviewed outlining clear rules for citywide park entertainment so that it either includes each region of the city or provides'",
        "'speaker_11': 'the additional funding in lieu of for the areas that did not receive the benefit of the Citywide Park Entertainment overall suggestions for more equitable park programing from our Parks Department and our Commission, and a timeline for updating both the open space and recreation element of the general plan, as well as the Parks, Recreation and Marine Strategic Strategic'",
        "'speaker_11': 'Plan. In addition, I had also mentioned sending to the Parks Commission the issue of park fee waivers, and that is it. So I will just say in closing, I again want to thank our Parks Department. I know that this is a huge undertaking that I'm asking for, but I also do believe in inequity in all parts of'",
        "'speaker_11': 'our city. I know our parks commission. Also works very hard ensuring that they're looking at this with a wide lens as well. But I think this is something we can all work on together. I don't I know that it is just not fair.'",
        "'speaker_11': 'It's not fair when we have these issues in some of our communities and we go outside and there are no park programs to be found. But yet we have high unemployment, we have high obesity rates. We have high issues with poverty and people that are jobless.'",
        "'speaker_11': 'My community.'",
        "'speaker_6': 'Actually, my staff, about a couple.'",
        "'speaker_11': 'Of years ago, we walked to the Washington neighborhood twice. This was not an election year. We walked it twice and we wanted to see what people wanted out there. And the two number two things were jobs. And they wanted park programs.'",
        "'speaker_11': 'It's vacant, it's barren. There's nothing to do for these kids. And we need to be able to do something for them or for seniors as well, for everyone. And so I asked the council, my colleagues, to be as open minded as possible.'",
        "'speaker_11': 'This isn't an attack against anyone. This isn't a place for us to be defensive or to be. Take this personal. This is really just looking at this with a very wide lens and making sure that we're taking care of the whole city, not just a few of us.'",
        "'speaker_11': 'So thank you.'",
        "'speaker_0': 'Thank you. So we'll go to Councilmember Yolanda.'",
        "'speaker_10': 'You don't speak to your second vice mayor?'",
        "'speaker_0': 'Yeah, I speak to her later. Okay. Got to. Sure. This meeting.'",
        "'speaker_10': 'Thank you. Thank you. I want to thank Councilwoman Gonzalez. She did an excellent report, did her research and and did a collected data, which shows where we're at in terms of the city and programs within our parks. One or the other the other concerns that we have is obviously it's been a big issue for a number of'",
        "'speaker_10': 'years that the city of Long Beach does just doesn't have enough parks. Period. And with that, we also have that program. So it's a it's a it's one of those issues that, you know, without Knope, without parks and no programs.'",
        "'speaker_10': 'And yet when we do have the parks, we don't have the programs. So we still need to have a long way to go in regards to equity in terms of programs. One of the other things that that concerned me a lot and it didn't come in your presentation, but you might want to also include that, if you'",
        "'speaker_10': 'don't mind me making an addition to your motion is that communication is the biggest part of it. I mean, in my community, you know, I have a very diverse community. I mean, it's if you look at my at my district, you'll see that I have three, maybe even four distinct communities in in my district from upper middle'",
        "'speaker_10': 'class, working class to middle class. And along with that, I have, you know, very fluent English speaking communities and those that are bilingual and those that are monolingual Spanish, monolingual Tagalog or monolingual Hmong or other Southeast Asian languages.'",
        "'speaker_10': 'And that's where the I think the biggest problem is, is that we're not communicating with our residents in terms of even if when we do have programs, do they know about it? And if they don't, what are we doing to make sure that that communication that is that that is being communicated to them?'",
        "'speaker_10': 'So I started at the city council two years ago, three years ago, and we brought forward a language access program that we wanted to get funded and we were having issues with that. Well, now we're seeing that without language access, we're actually suffering the community is suffering from being left out of the information loop as to what's'",
        "'speaker_10': 'available and what is not. So language access has to be a very important component as well in this in this study and all that, the city manager staff will look at language access issues when we're talking about the communications that we're setting out there and programs that are available.'",
        "'speaker_10': 'And that and that, again, brings the other component, because you can't have one without the other. If you're going to have language, access, communications and making sure that people get the information we need, language access programs, people with bilingual skills, and people who can communicate with the communities in Tagalog, in Spanish, in Hmong or and other Southeast'",
        "'speaker_10': 'Asian languages. You want an informal community, you want a healthy community. Then we have to do it in all languages and making sure that all sections and all members of our communities are treated equally in an equitable way.'",
        "'speaker_10': 'So that's my my $0.02 into this report. I want to thank again I want to thank Kazimir Gonzalez for bringing this forward, because it is an issue and it's just not just about one program or two, and it's just not about one side of the town, one side of Long Beach versus another.'",
        "'speaker_10': 'It's about all our communities and it's about all of us being on the same page when it comes to services for all of Long Beach. And the way we're going to do that is by making their sales access accessible to every part and every segment of our community.'",
        "'speaker_10': 'So again, I want to thank Gonzalez and Richardson for putting this forward. Thank you, Councilwoman Malone.'",
        "'speaker_5': 'Yes, I appreciate the item and look forward to hearing the input from the data. I think that something that we should be mindful of is that the district lines can occasionally change. And I know that in other items that we've looked at in the past, some things that we've come up with our zip codes, which is where'",
        "'speaker_5': 'a lot of the data is available through. So I think zip codes are great. But if we wanted to aggregate data, I'm not sure that aggregating on park programing by zip code of where events happen is as effective as the participants by where they come from.'",
        "'speaker_5': 'And then too, perhaps if we were to aggregate into some other kinds of districts, I know when we were discussing previous items, we talked about code enforcement districts. So code enforcement districts don't change. They've been significantly similar to what they are for 60 years and they're definable through a mechanism that people really understand.'",
        "'speaker_5': 'An example of this is last week at my community meeting some. Individuals had heard about the meeting and we were addressing a specific neighborhood and the neighbors don't know what district they're in until an election year. And so I hope that in looking at any of the distribution of things, that we come up with a more reasonable'",
        "'speaker_5': 'area because when things are on dividing lines between districts and they're counted in one versus another, we have to recognize that these parks, they don't belong to districts, they belong to all the residents. And oftentimes I will go into Eldorado Park and I'll be talking with the coaches of the North Long Beach Pop Warner Group, because that'",
        "'speaker_5': 'is where the park space was available that week and that's where they come to. And so I think that if possible, in any place that we are discussing distribution, my council district, if you'd be open to aggregating that data by code enforcement district, I think it would give a clearer picture and I think it would still accomplish'",
        "'speaker_5': 'what you're looking for in that it's dividing the city into three areas that are really more geographically acceptable than, say, for instance, the fifth District, which makes up multiple zip codes. But if I were to address a90815, well, that is in the fifth District, it's mostly in the fourth District.'",
        "'speaker_5': 'And it can get a little confusing, especially on the east side. So just something for consideration. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. And I appreciate the item. And I think it is worthy of our attention. Any time you talk about equity and I appreciate the data and the work that went into the presentation, I would just say in terms of this item and this issue, I work toward equity every single day.'",
        "'speaker_7': 'I too represent a very, very diverse district, not just in park programing or park development, but in public works resources and everything else that we we do as a city. We have to be thoughtful and mindful of that.'",
        "'speaker_7': 'And I think at least I can speak for the city council member, me and my staff. We we are on that. And it's it's part of our guide every single day and has been for the last five years.'",
        "'speaker_7': 'I like to look at Long Beach as one Long Beach. And, you know, it was once characterized and it has been characterized often as a tale of two cities. I think my district is a microcosm of that characterization, but I want to offer, I think, a little bit more of an optimistic lens regarding our park programing in'",
        "'speaker_7': 'our Parks and Recreation Department. You know, we were here just a couple of weeks ago. Parks and Recreation Department has been lauded and recognized nationally and is recognized nationally. And no matter where and what part of the city you live in, I think our young people grow up with great experiences in our parks.'",
        "'speaker_7': 'I have a number of questions and I'm sure that could be disputed no matter what. You know, there are there are challenge parks. There are there are parks that are program. There are parks that are more passive. There are different types of parks in this and different ways to define our parks.'",
        "'speaker_7': 'And they offer different types of experiences for different people. Neighborhood parks there, you know, larger parks. We have regional parks. And when we talk about the geographic equity in terms of parks per residence, there are areas that are far more dense, like the first district that has far less parks space, you have more broader geographic.'",
        "'speaker_7': 'And we we have to define ourselves in districts, districts like the fifth District or third district that have more sparse geographic space where your parks are larger. I'm proud of the work that we are doing in North Long Beach.'",
        "'speaker_7': 'We are in my district alone. We are developing over 40 plus acres of green space as we speak. You know, Molina Park, three and a half acres, phase two of Davenport Park, five and a half acres. The forest wetlands, another almost 38 acres.'",
        "'speaker_7': 'That's green space that will be enjoyed for for many, many years, decades and decades and decades after we are all gone from this dais, this work that that's worked, the city council and the city should be proud of today.'",
        "'speaker_7': 'I know Councilmember Urunga was able to get grants to develop the Willow Springs parks, and that's another, you know, 30, 40 acres. That's significant. Those are those are those are areas of the city that have been ignored. Those are areas of the city that will probably have park programing impacts in the future.'",
        "'speaker_7': 'Those are areas of the city that are going to have park maintenance impacts in the future as well. And so I'd like to have that considered in this study when it comes back. I have a few questions for city staff as well.'",
        "'speaker_7': 'And let me just say, in terms of when we talk about equity and programs, I am one who supports 100% US improvement on what we have. Right. I think we should always be doing that. We should always be looking for continuous improvement as a body, as a city.'",
        "'speaker_7': 'And so I commend Councilmember Gonzalez for bringing this forward. But oftentimes, it's as a budget oversight committee member and as a city councilmember who's been here for five years. And I can tell you, the very first year I got here, we were 17 and a half million dollars upside down.'",
        "'speaker_7': 'I oftentimes on talked about that. We have a very different budget outlook today, looking looking forward. We were told that we were headed for some tough times. But this is math to this. We don't we we don't we can't add without taking away.'",
        "'speaker_7': 'Right. And so that that will be the mature adult conversation that this this in challenging conversation that this council, this city council will have to face when when this issue comes back. And we really break this data down as well.'",
        "'speaker_7': 'And so I'm looking forward to that as well. But for I'm not sure if anyone from Parks and Recreation is here. I have a few questions. And if you can answer these questions tonight, that's great. And if not, you can add them to the for the study and get back.'",
        "'speaker_7': 'But this in this item has inspired a lot of thought for me just over the last couple of days as as I was reading the item, I wanted to. Staff to explain the difference between contract classes, which are listed in the reconciliation guide that was referenced in the item and programing that is provided by Parks and Recreation'",
        "'speaker_7': 'staff. Is there a very distinct difference?'",
        "'speaker_6': 'Good evening, Vice Mayor, members of the Council, thank you for bringing the item forward and the staff looks forward to looking at and working with our commission, who's very dedicated to the programing that we provide in the community, to come back with this report.'",
        "'speaker_6': 'Yes, there is a difference between the contract classes, which is what was looked at this evening and our overall general programing. So as Councilwoman Gonzales explained, our contract class program is our way as a city of supporting small businesses.'",
        "'speaker_6': 'For example, a yoga instructor who does not have the financial wherewithal to have their own brick and mortar facility to do yoga, will come to the city and ask if they can do their classes and run their business in a city facility.'",
        "'speaker_6': 'So we facilitate that through our contract class program. The city works out an agreement with those instructors. They charge a fee to the community to take the class. And then the city receives a percentage of that fee for overhead, for maintenance of the facility, for wear and tear based on the use of that facility.'",
        "'speaker_6': 'So our contract class program is the majority of what is in what's called our record recreation collection brochure because that overhead fee is also we do the registration for the program for the class and we take in all the fees for the class.'",
        "'speaker_6': 'And so that overhead is charged. But that's a piece of what we do. We also have an quite robust list of programs and services that we provide throughout the city. We have 26 community centers that are staffed, and we provide programs, afterschool programs, seniors, youth sports team programing.'",
        "'speaker_6': 'Our summer day camps are summer free lunch programs. So there is a number of other.'",
        "'speaker_5': 'Programing that goes.'",
        "'speaker_6': 'Alongside of what was listed this evening that we provide to the.'",
        "'speaker_8': 'Community at large.'",
        "'speaker_7': 'And thank you for that. And are there any incentives currently in place for contract, quote, class providers to provide workshops at parks with fewer classes?'",
        "'speaker_6': 'Yes. So we do not solicit contract class instructors, and we have not had to solicit instructors for many years because we have on a regular basis proposals coming into our office. And the proposals generally come in with an identified location if that location is either busy or doesn't accommodate the type of class.'",
        "'speaker_6': 'Our first recommendation is those areas that we currently do not have classes. We have tried in the last couple of years to strongly suggest those areas where we do not currently offer classes. And in the last year, we have incentivized instructors to offer classes on the west area of the city where we have a few, only a'",
        "'speaker_6': 'few contract classes. And so there is an overhead fee that is charged per participant. And so for new instructors who are willing to offer classes in.'",
        "'speaker_8': 'Those areas, we.'",
        "'speaker_6': 'Will waive that participation or that overhead fee so that we can hopefully incentivize instructors to branch out from what they're comfortable with and use other areas of the city. But at the end of the day, for these instructors, it's a business decision and they are looking to put their classes.'",
        "'speaker_8': 'Or run their business where they believe there.'",
        "'speaker_6': 'Is a demand for those businesses.'",
        "'speaker_7': 'Okay. I mean, I mentioned earlier, a little earlier about new park space being developed. Do you know off the top of your head how much new park space is currently under development in the city of Long Beach and by acre and percentage by zip code?'",
        "'speaker_7': 'And I know that a lot. If not, I would love to get that information at some point.'",
        "'speaker_6': 'I don't know. Off the top of my head, we have a lot of.'",
        "'speaker_8': 'Development going on throughout the city.'",
        "'speaker_6': 'We do have a, you know, obviously our soccer.'",
        "'speaker_8': 'Fields that are under development, some new.'",
        "'speaker_6': 'Parks that are coming up. So that is something that we can come back to.'",
        "'speaker_8': 'To you in the study.'",
        "'speaker_6': 'Based on the both district or zip code.'",
        "'speaker_7': 'And we have in the last, say, three, three years where we develop new park space through the you know, the new parks that have been developed.'",
        "'speaker_6': 'Yes.'",
        "'speaker_8': 'You're going to test my knowledge for three.'",
        "'speaker_6': 'Years and I'm a year and a half in. So, again, we've got two forest wetlands under construction right now. We have our new soccer fields that Admiral had at Seaside. We opened Gum Beaner Park recently. We've got the Red Car Greenway that we are just about to start the.'",
        "'speaker_8': 'Third phase of, and we completed the.'",
        "'speaker_6': 'Second phase last year. So we've had multiple openings throughout the city in the last three years. We've done a lot of park development and and in. Restructure.'",
        "'speaker_7': 'Investment in my family is actually a field as we speak right now. And that's a great new part. Absolutely. I can tell you right now, if you go out there, there's probably 200, 250 people enjoying that park. And it's not necessarily program, but there are many coaches and there's a lot of community out there on a daily'",
        "'speaker_7': 'basis that's a great resource for our community. And you know, in terms of programing needs in the future, when we talk about all of this new park space being developed, how will that impact programing in the future?'",
        "'speaker_6': 'That is going to be a discussion that we're going to have to look at as we continue to open new parks. Obviously, we want those parks activated at a certain point in time. When the recession hit, budgets across the city were reduced hours along with them.'",
        "'speaker_6': 'Yet we have continued to open new spaces and will continue to do that. So we are going to be looking at and that's one of the reasons why we had the Peps program come earlier. We need our community partners to help activate.'",
        "'speaker_6': 'We won't be.'",
        "'speaker_8': 'Able to do that all on our own. We don't have.'",
        "'speaker_6': 'The financial resources. A lot of the programing that we offer, our youth sports program, our afterschool program.'",
        "'speaker_8': 'Our day camps are free programs.'",
        "'speaker_6': 'And so to offer those free programs, resources are needed to go alongside that.'",
        "'speaker_7': 'So I think the number is 170 parks in the city of Long Beach.'",
        "'speaker_6': 'Yes. And counting.'",
        "'speaker_7': 'And how many of those parks are actually programed?'",
        "'speaker_6': 'Well, we have 26 community centers that are staffed so that we have our general programing that take place at those community centers.'",
        "'speaker_8': 'And then through things like our youth sports.'",
        "'speaker_6': 'Programs.'",
        "'speaker_9': 'Or other types.'",
        "'speaker_6': 'Of programing, we staff our nature center, for example, or the cultural center. And some of our specialty centers are pools. So we have a number of sites that are staffed.'",
        "'speaker_7': 'Okay. So I'm going to wrap my comments up. I'll just say that in terms of equity, when I took office, we didn't do movies in the park north of the Alamo. We added movies in the park at Grace Park.'",
        "'speaker_7': 'We added movies in the park at the Carlitos. We added movies in a park at Davenport Park in an effort to be more equitable with our resources and to reach more people. And in my district in North Long Beach.'",
        "'speaker_7': 'Secondly, we also, because of this issue of equity, there were there was a meeting over summer nights lights program in Central Child was very involved in that. That was happening at King Park and Silverado Park and Drake Park.'",
        "'speaker_7': 'And I was wondering, what about North Long Beach? And so at the time, Steve Councilmember Steve Nyland, I made an issue of it. We said, hey, we need to, to do something creative with our budget to to address summer programs in North Long Beach.'",
        "'speaker_7': 'And so from that we were able to add similar programs. Is now the be safe program of it at at Schiller Park and it out in park. A short time later that that program was adopted and is now something that is I think, far more equitable and distributed throughout parks throughout our city.'",
        "'speaker_7': 'So I just want to say that this is a worthwhile conversation. I'm looking forward to getting the information back in and digging really deep into this this issue. But I think our Parks and Recreation Department should be lauded for the work that you continue to do and will continue to do.'",
        "'speaker_7': 'Our employees are phenomenal and the programs reach so many people. I'm always if there's something that we good at in the city of Long Beach, it's good. We're good at park programing. And so I think we should not walk away from this discussion with our heads down, but.'",
        "'speaker_7': 'But with our heads high. And with that, I said. And lastly, if I can do one thing in the next three years on the city council, you know, I'd like to get a beach in a district.'",
        "'speaker_0': 'When Councilman Price with sea.'",
        "'speaker_10': 'Level rise, you probably will.'",
        "'speaker_0': 'Sea level rise is coming today to.'",
        "'speaker_8': 'Say, Councilman Arango, that was excellent.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_6': 'Thank you. So thank you very much.'",
        "'speaker_8': 'To my colleagues for bringing this item forward, and I really appreciate the presentation. I have to say that sometimes the way items are triggered or talked about in the media or social media before they get discussed can inflame passions that perhaps wasn't intended in the item.'",
        "'speaker_8': 'So I read this item and on its face I thought, you know, this is a great item and the presentation. And I thought it was a great item, but there were a few, you know, social media posts and articles in the paper that I thought maybe weren't as productive to the conversation.'",
        "'speaker_8': 'So I'm very grateful for this discussion. And we are one amazingly beautiful city with lots of different, diverse neighborhoods, and that's why all of us are here. You know, many of us could have chosen to live other places, and we live here because of the diversity.'",
        "'speaker_8': 'And I love that. And I also so I want to thank you. That was a really great presentation, very thorough. I'm grateful. Like I said last week with the with the mayor's clean item that there was so much thought put into the agenda item.'",
        "'speaker_8': 'And I'm thankful for Councilwoman Gonzalez that staff. Gave her item support because having staff support on an item that's important to your constituents is really important on staff, looks at your items and is supportive of the approach you've taken.'",
        "'speaker_8': 'It really, I think, helps have a productive discussion. So I'm grateful for her because it seems like she has a lot of support from staff in terms of moving forward. I like the questions that Councilman Austin asked because I think there's a real difference and it wasn't totally clear to me during the presentation.'",
        "'speaker_8': 'In terms of the fee based courses. And then I know that the city offers a lot of programs like afterschool care and like. Senior programing and things like that that maybe we don't have and a lot of the districts and that data wasn't included in the report so or in the presentation so I would love when the'",
        "'speaker_8': 'report comes back to find out what afterschool you know three years ago I brought an item to council asking for a report back on what afterschool programs we have in the city. And we still haven't gotten a response on that because I know that there was some transition with our youth commission, but that's information that I think'",
        "'speaker_8': 'is relevant. We want to ensure that every child in the city, regardless of what zip code they live in, has a path to success and has the support and the foundation to be able to thrive. And so afterschool programs really do provide that opportunity.'",
        "'speaker_8': 'And if they don't have afterschool programs available in your in your local park, then you have to obviously pay for those as as my family and many other families do in order to be able to accommodate the schedule of working parents.'",
        "'speaker_8': 'So I think it's important to find out what kind of afterschool programs does the city offer and are there areas where we're not offering them that maybe we could? I'd be interested in that. The other is senior programing.'",
        "'speaker_8': 'I know that Councilman Supernanny and I took some of our divide by nine money and put it aside for senior programing because we didn't have any senior programing in our area. So we set aside about $50,000 to try to sponsor some senior programs and tried to turn the lawn bowling center, which isn't really a senior center, into'",
        "'speaker_8': 'our makeshift senior center. That was our creative way. No realizing how limited the general fund dollars are. That was our way of trying to figure out a way to have some programing for our seniors. So I'd love to see what senior programing we have available in the city as well and where those are distributed and where there's'",
        "'speaker_8': 'opportunity for for expansion of those programs. I also think that it's important, you know, there were some some comments made. And again, I think sometimes, like I said, sometimes how things are promoted before a meeting or on social media have a way of leading us down a divisive road and pitting districts against each other.'",
        "'speaker_8': 'And I and I hate for that to happen. You know, for example, there was a comment about how budgets are allocated and how the BMC, you know, makes recommendations. And, you know, I'm a member of the BMC and I will say last year alone we allocated the only part programing recommendation we made was for the Be Safe'",
        "'speaker_8': 'program, which is a fantastic program and one that I'm happy to support. So I think we should be really sensitive and mindful of the hard work that we're all doing this. We aren't a city that's divided. I know technically were divided by districts, but really were when there there's a success in one area.'",
        "'speaker_8': 'It makes the city better overall and our parks are fantastic resource for all of us. They provide fair access to everyone and if they don't, we should be working hard to make that happen. That's very important. I mean, who wouldn't support more concerts in the park and more programs for us to be able to take advantage of'",
        "'speaker_8': 'our park assets? I look forward to working with my colleagues as we begin the budget season in the coming months and prioritizing and planning for where we allocate our dollars. I think supporting neighborhoods and neighborhood programing is important.'",
        "'speaker_8': 'I also think this is probably part of a much larger conversation regarding other city resources too, and how we allocate those and where we can work together on that. I think residents across the city, as well as residents from other cities, come to Long Beach.'",
        "'speaker_8': 'For the programs that we have here, we have amazing events that are deeply rooted in culture and in history and sometimes even in recent trends. And I would love to continue those and be able to expand on them and set those as a priority for the different areas, depending on what it is that the residents in those'",
        "'speaker_8': 'areas want. So I think we provide great classes already, contract classes. We provide great services that are funded through our general fund that are offered in parts of the city. We provide concerts that are offered in parts in the city and events that I truly hope can be expanded for every district in the city and for every'",
        "'speaker_8': 'community. And I thank everyone who came out tonight, and I thank my colleagues for this very well thought out item. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_9': 'Thank you. And thank you to my colleagues. I think most of my colleagues actually touched on a lot of my my talking points. I wanted to say how much I appreciate those that brought this forward, particularly Elena. I know that it was probably six years ago we started Long Beach Rising, which was a civic engagement program, you'",
        "'speaker_9': 'know, focused on bringing in residents and educating folks on how they should get engaged in our local government. And one of the big topics was equity. And one of the first maps that was really striking for people was park space.'",
        "'speaker_9': 'And I think what we've what we've heard today is, one, is it doesn't just dictate where park programs are, that we are fortunate on the east side to have bigger spots of park space. In my district, I have three pocket parks, you know, Miracle on Fourth Street.'",
        "'speaker_9': 'We've got the arts park and now we've got the park on the promenade. And so I think it's a really exciting time that we've made the conversation to where it is today. We couldn't have had this conversation, I think, without all the work of our residents and our colleagues here talking about equity.'",
        "'speaker_9': 'I did really appreciate your presentation and answered a lot of questions that I had. I would like to just echo a couple of things. One is making sure that we are tracking not only the programs that are contract programs, but where are we providing services for our constituents through the city?'",
        "'speaker_9': 'I think one of the great things that we also have is that we have long polling, which, yes, I have been long bowling three times. It is free. Your first three times. Guys, you should go. I've also been many times to the pool.'",
        "'speaker_9': 'And so how are we diversifying our assets across the city to say this is where we go to swim, this is where we might go to lawn bowls because it's a special day. What are we putting on the west side?'",
        "'speaker_9': 'What are we putting on the north side to say, let's have another attraction where people are going to want to come to this park to come do something they can't do somewhere else. And so I'd be interested to kind of look at the programs we have.'",
        "'speaker_9': 'And when we're talking about capital improvement and we're talking about infrastructure investments, are there opportunities in the next ten years to try to think outside the box about how we put something citywide and not just, you know, where our bigger slots of property are?'",
        "'speaker_9': 'And then I go the same thing I said the the weeks prior, just looking at identifying new funding sources, which I know we'll have that topic through our budget cycle and also bringing up sponsorships as well. But really great job presenting all the data today.'",
        "'speaker_9': 'Appreciate it. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Lupino.'",
        "'speaker_1': 'Thank you. First, I'd like to commend Councilman Austin. He framed this perfectly when he said equity is something we deal with daily. For those of us who have the privilege of representing diverse districts, that's that's just what we do on a daily basis.'",
        "'speaker_1': 'Here's a fascinating slide. I don't know if our technicians have the ability to bring it up, but the one on life expectancy, if you show that slide, I represent the fourth district, which is primarily made up of zip codes 90815 and 90804 on life expectancy.'",
        "'speaker_1': 'One five was the highest. Oh four was was not the highest. So this is something we work out continually. And first, I'd like to commend Parks and Rec for the great job they do in making this equitable in terms of the parks.'",
        "'speaker_1': 'And thank you for the parks commissioners who are here tonight. So, for instance, we have Whaley Park, which Maria, I won't put you on the spot, but I think it's the most popular in terms of programs across the board, if you can imagine that that's in the shadow of the YMCA and the 49 year camp.'",
        "'speaker_1': 'So that geographic area is incredibly popular. I can't imagine taking programing away from that. We have a couple of municipal band concerts at Whaley. We don't have them in other parks, but Parks and Rec has has helped me out there.'",
        "'speaker_1': 'We have symphonic winds performing next week at or Isabelle along with the movie in the park. They'll be at Stearns performing. We have a lunch program at Stearns. I have a lunch program at or Zorba. I see a Rotarian in the audience and we actually have a luncheon next week at Rotary Park.'",
        "'speaker_1': 'If you don't know where that is, that's on PCH between cherry and wine aperol. So I think just with the way we strive every day for equity, these are the types of things we can do. The only.'",
        "'speaker_0': 'Area I want to.'",
        "'speaker_1': 'Challenge, Councilman Austin, is if if we to improve these areas, we have to take from somewhere else. I'd like to start off this discussion. Like, let's just do the improvements. Let's see if we can leave every thing in place and get very creative and see if we can add programing without taking it elsewhere.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'I think that we've had a really set of great comments, too. And I do want to if Parks and Rec is up for a couple more questions, address a couple of things that I know have become an issue not just at our parks, but also at our beach space.'",
        "'speaker_5': 'I know we had parks squatting and programing being provided outside the purview of the city. And I know that you've done a lot of work already in cleaning up people's ability to use the park and informing them of the process.'",
        "'speaker_5': 'So that, for instance, if you're an accountant, you can't just show up at the park and run an accounting firm similarly to if you're a yoga instructor. There's a process and a procedure that engages our community in that.'",
        "'speaker_5': 'Would you like to share a little bit about that? Because I don't know how much of it is still around and if that should be included in the project as well.'",
        "'speaker_6': 'We have actually been working with our city attorney's office in the last year to look at.'",
        "'speaker_8': 'The issue of.'",
        "'speaker_6': 'Commercial operations in the parks. And so how do.'",
        "'speaker_8': 'We allow, for example, the.'",
        "'speaker_6': 'Contract class instructors to go through that process.'",
        "'speaker_8': 'And to be able to legally provide.'",
        "'speaker_6': 'Their businesses using park space? On the flip side of that, we.'",
        "'speaker_8': 'Are constantly challenged with others who do.'",
        "'speaker_6': 'Not go through the process. We don't have monitors out in the field.'",
        "'speaker_8': 'We don't have the luxury of having that number of staff to be making sure that all of those activities that are taking place.'",
        "'speaker_6': 'Are sanctioned and licensed to the city. Yet we get.'",
        "'speaker_8': 'Complaints on a regular.'",
        "'speaker_6': 'Basis from folks who feel or think or believe that they are related to city services.'",
        "'speaker_8': 'And then we also have injury claims and things like that on our parks.'",
        "'speaker_6': 'By these I would.'",
        "'speaker_8': 'Call them maybe rogue service providers.'",
        "'speaker_6': 'So we've worked very hard over the last year to address a lot of that and clean some of that up and to try and convince folks to come through the process so.'",
        "'speaker_8': 'We know who's out there and what they're doing. And when we get calls.'",
        "'speaker_6': 'The other calls we get are from our residents. For example, some of our some of the robust fitness providers that are not sanctioned through the city will show up in an area with loud music and whistles.'",
        "'speaker_8': 'And things that if I.'",
        "'speaker_6': 'Am to try and get the boot camps going and we get the complaints from the residents and these aren't.'",
        "'speaker_8': 'Things that we have sanctions or programs.'",
        "'speaker_6': 'So we are trying.'",
        "'speaker_8': 'As best we can to balance that activity.'",
        "'speaker_5': 'And then we worked really hard this year on a partnership opportunity where organizations such as the organizations. Mentioned on the slides could partner with Parks and Rec to provide the programing as is needed. And so far, we're moving strongly in that direction with that fold into this pretty well.'",
        "'speaker_6': 'Absolutely we are.'",
        "'speaker_8': 'And as I said earlier, we need the partnerships. We need community organizations that are willing to come forward and partner and help us activate the parks and provide some of the programing.'",
        "'speaker_6': 'Especially as.'",
        "'speaker_8': 'We are looking at the next coming years where we may not have the financial resources to do that.'",
        "'speaker_5': 'And then to kind of ping off of councilman, councilman super knorr's comments about don't take anything away. I'd like to add a comment that we kind of need to start from a standpoint of what do the people want.'",
        "'speaker_5': 'Councilman Gonzalez talked about walking her community. And I know that's something that Councilman Superman and myself that we do regularly to get people out to community meetings and host those regularly. And we have to be honest with ourselves.'",
        "'speaker_5': 'Some of the programing doesn't work, whether it's not a match for the community, whether the demographics have changed, and millennials are interested in different types of things. I remember watching Park Activation when Pokmon Go was all the rage.'",
        "'speaker_5': 'No one talks about Pokmon Go anymore, especially not our vice mayor, who used to play it all the time. And so.'",
        "'speaker_0': 'I still do.'",
        "'speaker_5': 'And still does. But we as a city also have to look at not putting rules in place that are forever, almost any law that we discuss. If you want to pass a law, perhaps we discuss that there's always a sunset date of either a program or a law or any of these things, because we need to be'",
        "'speaker_5': 'challenged as your elected officials and whoever comes after us to address and understand the community. And it's dynamic and it's changing. So I appreciate the comments about seniors. I think that this does talk to a bigger, overarching citywide discussion because while some communities might not have a be safe program, other communities might not have leagues, other communities'",
        "'speaker_5': 'might not have sun hours or after school librarian help. And so it's really about a whole city view of what is everywhere and what does that look like and what non-profits can provide those services or local businesses that are doing it through the contracting.'",
        "'speaker_5': 'So I look forward to this coming back. I do want to also ask, I know that Nick is no longer here from workforce development, but we talked a little bit about in the program I'm sorry, in the presentation, Councilman Gonzales addressed some of the classes that are offered at the Eldorado Community Center for Reemployment.'",
        "'speaker_5': 'And I think that there was no real part of that that addressed the amount of programing that's offered on Atlantic at our actual workforce development center, because a lot of workforce development doesn't happen just in our parks, but it happens in our libraries and it happens in our workforce development center.'",
        "'speaker_5': 'So we're going to look at that. I hope that the city staff will look at it all encompassing, not just at facilities that are called underneath the parks umbrella. So I look forward to the report. I recognize that it is a stringent timeline.'",
        "'speaker_5': 'So I hope that we can, if we have to choose between expediency and accuracy, I hope that we move towards the accuracy, but not so far that this gets left behind. It needs to come back in a timely manner, that we can address it through a process before our budgets could even tighter.'",
        "'speaker_0': 'Thank you, Councilman Andrew.'",
        "'speaker_12': 'Yes, thank you very much. First of all, I think Councilman Juan Gonzalez would bring this item forward because the fact that looking at the statistics up here on the board, you know, I see a lot of things that would kind of sad me also because the fact it seems like sometimes we talk about I would always look'",
        "'speaker_12': 'at what our Long Beach is, one long beach, no matter what, you know, area it is in the city of Long Beach. And a lot of our kids, I want them to feel free to be able to go to any park, not just talk about central, north, south, you know, because the parks is for everyone.'",
        "'speaker_12': 'And I think in my district, in not only my I think when every district, the parks are the kids, I think Lifeline, if you're not working too in the summer, where do you go? And I would really like to see the parents get involved also, because the fact that there's so many things that we can do in'",
        "'speaker_12': 'our lives. But I think it's going to take a family, you know, participation in that. Just don't send your kids to the park, be a part of the park if you're not working. And we do have any programs.'",
        "'speaker_12': 'And I want to thank our park director. I know she has a big job when she says 100 somewhat. Parks I didn't know we had that many. I thought we only had four because that's what I have in my district.'",
        "'speaker_12': 'But, you know, and but like I said, don't take anything away because that's what it's all about. I think all of us grew up and, you know, Parks and Recreation. And I want to thank you guys so much, especially you talk about Chick fil A.'",
        "'speaker_12': 'You know, that's my gold mine in my district. But, you know, there's so many other things that I would really like to get involved in. But I don't because I talk about equity, you know, we talk about fairness.'",
        "'speaker_12': 'But then again, our kids, they don't even look at it. They just want to have some place to be a part of something that really keeps them active. Because if you don't, you know, we have to sit Friday night, you know, night lights and all of that.'",
        "'speaker_12': 'But yet and still, when the parents even send their kids to the park, they look about safety, they look about something to do. And that goes memory. I said, a tired kid is a good kid. Send them to the parks.'",
        "'speaker_12': 'But you know, most of this when I end up thinking about all of this, when we all really comes to a fruition, I heard our you know, said when he said he'd like to be able to get a I think ocean at a beach, well you way behind because when I go home and wake up tomorrow, I'm'",
        "'speaker_12': 'just looking for some Thailand right in the sixth district. And then then I'll show you what a party look like.'",
        "'speaker_0': 'And that's why I want the beach so I can get the diamonds. All right. Thank you, Councilmember Peterson.'",
        "'speaker_9': 'Oh, that's funny. Yeah, I wanted to. There are two things that I wanted to bring up that I didn't bring up earlier. I mentioned the fact that we have some passive parks in my district. So the Arts Park and also Miracle on Fourth Street are two parks that have a gate and that are locked often.'",
        "'speaker_9': 'And Emery, you know how many hours we've tried to spend, figure out how to program those parks in a way that's responsible and and respect of of the neighborhoods. And so in this report, I'd really like to see if there's some way that we can identify how we activate those parks or what a pilot program might be'",
        "'speaker_9': '. Because I know my staff has spent tons of hours with the Arts Council, with the Dolby, with everybody pulling together, M.O. use to activate those parks. And so I want to thank all of those partners that are stepping up, but also recognize that if we're going to take the responsibility to create park space, it should be our'",
        "'speaker_9': 'responsibility to have that park space opened. It's very frustrating, you know, to walk to Miracle on Fourth Street, to find it closed one day when it's in the middle of the day. Second, as you brought up a comment around the fact that a lot of these small businesses use our parks because they don't have a storefront maybe'",
        "'speaker_9': 'to do their yoga or Pilates. And that brought to mind for me, community benefits, which we often say if we provide a business, some kind of resource from the city, that in return they give something back. And so I'm curious if we could explore for every hundred and 50 hours that a yoga instructor has a paid class'",
        "'speaker_9': ', you know, on one part of town that they, you know, be asked or if there's an incentive program to say that you then do 5 hours of a program in a park that doesn't have programing, because if we are in fact providing them a community benefit by providing them a space and access to our residents, maybe that'",
        "'speaker_9': 'is a way where we can try to say, you might have an assumption about the other side of town, or it might be 15 minutes drive for you versus across the street from your house. But trying to build that community across the city, maybe there's some thinking outside the box that we can do on that.'",
        "'speaker_9': 'So thank you.'",
        "'speaker_0': 'Thank you. And so I imagine Councilwoman Gonzalez wants to close it out when I'm at my comments here. Before you do so, first, I want to thank I want to just thank the whole council first for the tone tonight.'",
        "'speaker_0': 'I think this was a good example to set for the city. And I think we can all learn from how we took on this conversation tonight. Well, thank Councilmember Gonzalez and her staff for a really impressive presentation and councilmembers Andrew and Ranga for signing on.'",
        "'speaker_0': 'I think park staff know it's a tough conversation sometimes when people are looking at your work, but that's a part of our public policy in serving the public. We have to sometimes have those conversations. Last night I had my district nine harbor crews.'",
        "'speaker_0': 'We, you know, go down to the port and about 150 residents get to go out and tour the port. And it was talking with the resident. I won't I won't name who it is. But, you know, we were having a conversation about the Long Beach City Council and how the job, you know, what kind of job we're'",
        "'speaker_0': 'doing. And something stuck with me. And what that was, was this resident. She said the city council spends too much time fighting over the things that don't that aren't as important and not enough time fighting on the things that are fighting about the things that are really important.'",
        "'speaker_0': 'And I thought about that, you know, thought about all the time that we spend discussion so many different things in our city and how it is. It would be good if we took a step back and really thought about our role as council members citywide and what we can do to really change our system and leave it'",
        "'speaker_0': 'in a better position than when we found it. This is a difficult, difficult conversation, but in my opinion, it's a part of a larger shift that's happening in our city, in our city hall on culture shift. Janine talked about Janine and Lina talked about Long Beach Rising.'",
        "'speaker_0': 'Last year, we established an officer equity in the budget to take on conversations that place a lens of equity or context, the need on our decision making. And this won't be the last conversation. This is Park Equity. We can have conversations about transportation, transportation, equity, health equity.'",
        "'speaker_0': 'And that's just the nature of our city. We have a very diverse city and we have to be about the business of equity. Equity means making decisions based on a context of need, and our history tells us that, you know, maybe we haven't we could do a much better job at considering need to make decisions about resource'",
        "'speaker_0': '. Allocations. You know, typically when I get that book in the mail, I used to rarely peruse that book. And now I have a two year old. And we open up the book for the first time last year and realize every single part program you're in, you're getting in the car and taking a ride to Eldorado Park for'",
        "'speaker_0': 'a majority of the contract classes. You know, I got to tell you, I have a car and I'm willing to take that time and go to do something simple as kids love soccer, which is a great program, by the way.'",
        "'speaker_0': 'You know, we get in the car and we take that trip. Not everyone has the means to take that trip. And I think we do need to do a better job at looking at the how we leverage these contract classes.'",
        "'speaker_0': 'Because I got to tell you, kids are interested in soccer all over our town, not just at, you know, one park. So, you know, so, so so that's that. The other thing I would say is that. Sometimes it takes a long time to bring the attention to a certain issue.'",
        "'speaker_0': 'And when it's just like one council member championing that issue, it's even harder. But when the city city council gets behind a set of principles or values a lot easier, the concept of Be Safe came up earlier and I was a part of those conversation in that fight to expand Be Safe.'",
        "'speaker_0': 'It was modeled after some night lights program and talking with central char and, you know, city of Long Beach. And it took a long time. But what people forget is that it took about three cycles to be safe before it actually made it into the budget.'",
        "'speaker_0': 'Structurally, it was, you know, every year was funded either through one times or figured out some way to do it. And if we agree that everyone is entitled to quality public services, quality of life in their neighborhoods, then we can sort of approach the conversation that way.'",
        "'speaker_0': 'And it's not in my opinion, it's not really about parks. You know, this is a you know, this is a conversation that will allow us hopefully to think about not just slicing up that pie. It's always like what part of the proposed slice of the pie do we get?'",
        "'speaker_0': 'I think it's about growing the pie, having a conversation about growing that pie and making sure that everyone has an opportunity to eat. Not necessarily. My slice of the pie isn't as large as it needs to be. We have to grow that pie.'",
        "'speaker_0': 'Next what I will say. She says she. What do you want? Your slice, Stacey? She wants total influence on her pie. Pie. I think we all want a little time to sprinkle on top with.'",
        "'speaker_10': 'Sea level rise.'",
        "'speaker_0': 'Sea level rise. You are so. So the other thing is I think we have to be honest about a conversation about the status quo in the future. Now, a lot of times we have conversations about how we make decisions and is based on this is how we've always done things.'",
        "'speaker_0': 'And if we were future focused, we ought to think about who who actually has a role or right to determine the liberty of their future, whether they have a have or whether they have the right to talk about the condition of a neighborhood moving forward.'",
        "'speaker_0': 'If we continue to grasp that the past and the status quo, we'll never actually address the systems of inequity. So I think Parks is a great first step to, you know, to start talking about equity and letting folks see that this is not about you versus me.'",
        "'speaker_0': 'This is about one city. And if we can get behind that sense and sense of principles and values that say all of our all of our neighborhoods have value, that your quality of life, no matter what neighborhood you live in, has value, then frankly, I think we'll leave the city in a better position.'",
        "'speaker_0': 'A couple things I wanted to just add in. You know, from a place of just strategy, I think that and we've talked about this councilmember, we we probably should you know, our Office of Equity, although new, is doing some amazing work at identifying what cities are doing to address equity.'",
        "'speaker_0': 'And I think as a part of this conversation, we need to make sure that we add in to the recommendation for the Office of Equity to take a look at two things. One, looking at a park equity lens that other cities have considered or think about what that tool might look like to help guide our decisions.'",
        "'speaker_0': 'And then secondly, I think we need to think about language access. So the Parks and Rec brochure, although it's expensive, we send it out. We should think about how we, you know, Spanish or a link to Spanish combined Tagalog, you know, the four languages that we we agree on as a city that we're going to disseminate information'",
        "'speaker_0': '. And so we definitely need to look at that. And so those are those are my comments on the bank, everybody. And Councilwoman, if you wanted to close this out and I will be the time.'",
        "'speaker_11': 'I just wanted to thank the Council for the open mindedness. And I look forward to our new discussions. And again, thank you to the community and our commission staff as well as our park staff for indulging me over the last couple of days over this great item.'",
        "'speaker_11': 'So thank you.'",
        "'speaker_0': 'Thank you. So now is the time for public comment. As any of any members of the public would like to speak on this issue, please come forward with way to do so. Please give us your name. You have 3 minutes.'",
        "'speaker_1': 'Good evening, counsel. My name is Bill Thomas. I'm with the.'",
        "'speaker_0': 'Just. Just a moment, folks.'",
        "'speaker_1': 'Restart my time.'",
        "'speaker_0': 'Just. Yeah, please. We're going to hold off. So let's be respectful of the speaker and then I'm counting. One, two, three, four, five, six, seven, eight, nine, ten, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20. So if we do 3 minutes, this is an hour of public comments.'",
        "'speaker_0': 'We're going to go down to 2 minutes on this unless everybody just says absolutely no. Is everybody pretty cool that we go down 2 minutes so everybody gets a chance to speak? I see. Thumbs up. Great. So you have 2 minutes.'",
        "'speaker_0': 'Thank you. You have the floor council.'",
        "'speaker_1': 'My name is Bill Thomas. I'm with the third district. I'm going to try to fight dog fast. I'm here to support Parks and Rec and all of the efforts they do. I'm particularly familiar with their effort with a very tight job on an expensive project called Municipal Band that is only six weeks out of the summer and'",
        "'speaker_1': 'worked on all year long by a lot of people. The best thing I can offer to this council is my experience in supporting the municipal band. For the last three years, the publicity or social media, as people have said here, was totally inaccurate on a number of points.'",
        "'speaker_1': 'So I thought just explaining the involvement of myself and a group called the Friends of the Municipal Band, well, how it how things transpired and why we are not involved this year in the program we started 19 2014 and we our objective was try to get an increase to six weeks.'",
        "'speaker_1': 'We helped in 2015 to raise funds and talk about how to what do we do to get six weeks. We find out we had to send our money through partners of Park with a 10% service fee to handle it.'",
        "'speaker_1': 'The money we raised at the end of 2015, thinking it was going to the $30,000 we committed to raise for the six week, got pulled off at the end of 2015. So we started over with Community Foundation and we did raise the $30,000 and we did make a contribution this year.'",
        "'speaker_1': 'We did nothing because we didn't want to interfere with the project the Partnership Park has done. That's been very good so far this year. Amazingly, a number of the businesses that I raised money from last year came along and wanted to put.'",
        "'speaker_1': 'Money yet. I said, Why don't you make the donation to the community foundation and we'll see if we can make that contribution for 2018. And I have left the employer the employer the. I was one of the founding members, but left the friends of the band because I felt my services were not needed this year.'",
        "'speaker_1': 'But I'd like to have them have the thank you.'",
        "'speaker_0': 'So that was okay. I was counting the three, I thought, too, but thank you for your time to talk to me. Absolutely. Thank you. Next, discipline batter with no need to say the man is not in jeopardy. Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_1': 'Honorable Vice mayor and council people. I appreciate you taking the time today discussing this measure at length. I will tell. I do enjoy. I am. My name. My name is Ben Goldberg. I'm the current chair of the Parks and Rec Commission.'",
        "'speaker_1': 'And so we will be the ones looking at these items that you've put forth if the measure passes, which I assume it will. I did want to mention I did appreciate specifically and I did appreciate actually all of your work, and I appreciate Councilwoman Gonzalez reaching out.'",
        "'speaker_1': 'I was one of those three that she spoke with in the last few days to kind of clarify the original press out there, certainly frame this a lot differently than what it ended up being. So I'm pleased with what what I've heard from all of you.'",
        "'speaker_1': 'I just wanted to mention I liked Al Austin specifically when he mentioned what things were like five years ago, because that's when I was I was on the commission. I've been on the commission for seven years now on parks, and I've been in the commission system for about 15 years.'",
        "'speaker_1': 'And I do remember tearing up tremendously when we were so strapped for funds that we were looking at closing centers that were serving a lot of the areas that were reflecting on right now that are underserved on in these contract classes.'",
        "'speaker_1': 'And it was an act of mercy with the city manager as well as Mayor Foster, who was able to find the necessary funds to keep those programs going. I bring this up as kind of a aside. We're certainly going to look at all the things that you're mentioning, and we certainly enjoy taking the direction from the council'",
        "'speaker_1': ', which is what we do. But I just want to mention that, you know, we were looking for water when we were having a drought and we were under budget on that and we couldn't even water the parks we have.'",
        "'speaker_1': 'So every time we talk about opening a new park, I cringe. I start to see some of the hairs come up on the back of my neck because I know that we don't have the money for the water for that park no matter what, how we open it or how we landscape it.'",
        "'speaker_1': 'So anyway, I just wanted to again thank you for bringing the measure forward. We look forward to helping city staff to get that report back to you. But, you know, again, if money was no object, we agree 100%.'",
        "'speaker_1': 'Let's open up a new beach for Councilman Austin and let's bring snow to every district and let's have a good time with it. Thank you.'",
        "'speaker_0': 'Thank you, Mayor. Be please.'",
        "'speaker_5': 'Hi. A lot of people.'",
        "'speaker_6': 'Don't understand the west side that we.'",
        "'speaker_5': 'Don't have access with. There are two bridges there, very scary.'",
        "'speaker_6': 'And the Children's Commission, the.'",
        "'speaker_5': 'Mayor's Commission for Children, meets on the east side. As far as I know, when my son was on it, I had a tumor and I couldn't take him and he couldn't get transportation to represent the West Side. And there was a meeting in the evening.'",
        "'speaker_5': 'So that's probably why you don't know about the children's programing results and the bathroom in City Hall. The disabilities bathroom is broken. So if a lady in a wheelchair goes in the stall, she can't shut the door. And we had the Mayor's Commission on Disabilities do a walk through of Cabrillo High School in Kid Park, because I've'",
        "'speaker_5': 'never seen a handicapped or disabled special needs child at the Boys and Girls Club in the West Side. So my intuition sent me down here and I asked for a walk through. We did a surprise walk through and it would be USDA denied.'",
        "'speaker_5': 'They said, we can't have the services that we need. So what we need is a crosswalk on work between the Boys and Girls Club and Cabrillo High School, which has the best air conditioning and serves the most disabled special needs students.'",
        "'speaker_5': 'The curve does not go in a cut so that a wheelchair could even get over the curves on Commission on Disabilities that lives on Canal Street, could not access the front of Curiel High School, which has to do with MLK Park, where I won't even walk down Oak Park.'",
        "'speaker_5': 'There's too much danger. The reason why we need these programs is so we're not creating a hotbed for criminals to kids tell me they go across to the park and just talk about how they're going to rob somebody's house.'",
        "'speaker_5': 'And that's why I'm creating relationships with other districts to make them realize we need these programs so that I can call the cops and next door we can talk to each other because they're committing the crime and driving back to the west side, I see it.'",
        "'speaker_5': 'I call the cops and they never. So that's why we need to get programs that kid.'",
        "'speaker_0': 'Thank you for your time next week a please.'",
        "'speaker_1': 'Thank you very much. Council District three Lena. Thank you for a great presentation. You educated me tonight on this thing that I was always skimming on. Just is kind of like you said, Susie. I just read it on social media, but thank you for the clarification.'",
        "'speaker_1': 'But the reason I'm speaking is because, again, for the LGBT issue, I'm probably the only voice in here that's going to speak up on that. So I am and I'm glad you hear me because we are deficient in LGBT programing in our city, in our parks.'",
        "'speaker_1': 'I am not a parent, but if I was, I have to send an LGBT trans child out to the mountains for programing. So we need to. Why we're embracing youth and we're looking at everything. Now is a great time for you to reach out to LGBT parents or parents of LGBT children to find out what kind of'",
        "'speaker_1': 'programing we can be that will be inclusive within the city by establishing LGBT programing, whether it's for seniors, adults, children that's run through the city or contract services that really set us apart from all other cities. We would establish a new level of community engagement with all our citizens.'",
        "'speaker_1': 'So when I ask you to kind of look at that, what are you.'",
        "'speaker_5': 'Going to look at everything now?'",
        "'speaker_1': 'Because I'm speaking on behalf of those parents that are not here. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, Genevieve Peters. And having taught in this community since 1990, also getting my teaching credential at Cal State, Long Beach. I absolutely love this idea. So thank you so much. This is amazing. Now, the thing that I didn't hear and the thing that obviously our concerns for students and children in the community is there are pockets'",
        "'speaker_6': 'that are very unsafe. And let's be honest, unfortunately, there are areas that business owners or yoga instructors don't want to go because, one, they probably aren't going to get the business. Or two, they're they're scared. They're afraid. So I think we have to we have to address that.'",
        "'speaker_6': 'We have to address that situation, because I think it's a fabulous idea in theory. And I think every park should be able to welcome the citizens of that area and offer these amazing programs. I think that two questions that weren't answered is why okay.'",
        "'speaker_6': 'And what is the crime statistics in those areas of those parks that aren't being utilized? Because I think if we address that and we get some equity with the crime situation, then I think you're going to have people because I have had children, students come to my class and say, you know, Miss Peters, when I went past'",
        "'speaker_6': 'the park, I saw a dead body. This is true story. I'm not making this up. Okay? Now, these are kids that want to go into the park, but they're afraid. They've been run by drugs, they've been run by criminals, they've been run by homeless people.'",
        "'speaker_6': 'So let's be serious, okay? And let's take you of those pockets so that those parks are actually something that people want to go to. And I think once we do that and then instead of just waiting also for businesses to come to you, how about going solicit businesses that are actually in line with that particular community?'",
        "'speaker_0': 'So thank you. One one good tactic to make a park safe programing next speaker, please.'",
        "'speaker_6': 'Hi, everybody. My name is Evangelina Ramirez. I was living next to the Drake Bar for 17 years and now I'm living at District Six and next to MacArthur Park for six year. And knowing those areas is really, really important.'",
        "'speaker_6': 'And I support that recommendation because we have a lot of moms that they have kids if we want to keep our kids, I've got rocks and gangs and all this kind of stuff. They need to be busy and the way they need to be busy is having those programs and those parks in their communities.'",
        "'speaker_6': 'Inside their communities is hard for a mom having two or three kids carrying them in the bath to go to other parks in the money that they have to spend because it's $1.25 for it in this hard for them.'",
        "'speaker_6': 'That's why I feel like it's important. Having those programs inside of our communities is really, really important. If you want to really, really work with all kids, they are the future and then one day they are going to be there or they are going to be in jail, or they are going to be on the streets.'",
        "'speaker_6': 'But if we want to see them being in programs. Being in places like this one, we well, we have to offer them those parents in those parts. That's that's was my my life practically. We had a lot of programs at the Drake Park many years ago.'",
        "'speaker_6': 'My kids, they were going to those programs. Now they are successful. They are at the university. In the end, for me is something good and I want to see those things for other moms in my community. That's my message and I support this recommendation.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Hello. Good afternoon. Liana Gonzales, my council member. Thank you so much for bringing this up. It needs to be addressed. It's been sidetracked for far too long. And thank you for that and thank you for the council members that supported her in this equity.'",
        "'speaker_1': 'Our parks need more equity. During my daytime job, I'm telling you, I go through each and every one of your districts, and I will tell you that the third district has got a lot more going on than, let's say, districts on the west side just the way it is.'",
        "'speaker_1': 'Okay. We need to correct that. Even the city manager, Mr. West, I had talked to your office once or twice about having connecting Drake Park to Cesar Chavez. I brought this up a couple of times. PD is behind it.'",
        "'speaker_1': 'They love the idea, being able to patrol that back nuisance area and not gather cars 24 seven and it will instead of having the community across a freeway onramp and offramp, now they've got access and continuing to help offset some of the health issues that are going on.'",
        "'speaker_1': 'So I look forward to talking more with the council office and the rest of you. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Oh, he got my speech. But anyway, thank you, Linda Gonzalez, because you brought this to the table is very important. But about the ritual is not about the party. It's all about people, you know, about people. And this one is I live here in Long Beach, like 30 years living here in Long Beach and living almost in'",
        "'speaker_6': 'the same district. Isabel, one district for Grenfell, for Lumbee City is a lot or would it be overcrowded? The parks to remedy that situation. We have police, but not enough and, you know never really never buildings and then they don't people they have no programs they have no programs and their children, they have no plans after the'",
        "'speaker_6': 'school. Then what is the future? Yeah, well, they are going to live a very short time. That's why we need programs for the young people. We knew the programs after school and and also that the parks is not around.'",
        "'speaker_6': 'The parks have other people. But anyway, the park, they knew like they knew many, many these. But I see like many council they no support of this program that they know about. This one is they are not these are not champion in poverty is one listed forget it neglecting.'",
        "'speaker_1': 'For for.'",
        "'speaker_6': 'For Long Beach. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Hi there. I just want to thank you, Vice-Chair Richardson for, for what you said about the tone of the meeting. I think it even changed a lot of what I was going to say because my my passion is with the Long Beach Municipal Band.'",
        "'speaker_5': 'I was glad to hear that you say it's not in jeopardy. As Councilperson Price said, there was a lot of inflammatory statements in some of the Facebooking and articles that went on, and it might be good to have staff maybe refrain from using some of that inflammatory language in their Facebook pages because then the rest of us'",
        "'speaker_5': 'wouldn't get so upset. The municipal ban, of course, has been around for a long time. It's a very, very successful program. I appreciate actually what Roberto said as well about communications. When the band does go play in some of those other parks, like Drake, like it's about to and veterans.'",
        "'speaker_5': 'Better communication of what's going on is absolutely, positively necessary. I work with the Friends of Long Beach National Band. I worked with Parks and Rec before that for the Municipal Band, so I'm very familiar with everything that goes on.'",
        "'speaker_5': 'I would hope that perhaps our friends group could work with Mr. Andrews Council District to try to help promote that veteran's concert. So that way we have a lot more people there than we did at Craig Park last year.'",
        "'speaker_5': 'And I would be happy to make to reach out tomorrow evening and see if we can put some discussions together. Definitely all neighborhoods have value and I would love to see more contract classes as well. And that might be also something about communications that perhaps in the First District and all those districts, maybe they don't know that'",
        "'speaker_5': 'contract classes are actually available. And you might actually have a lot of instructors who would love to do something like that. So again, it's about getting more of the word out. I will come back to talk again about the municipal band, if there are any issues, shall we say, that come up.'",
        "'speaker_5': 'But I hope that we can continue to have the wonderful band that we do have that serves about 10,000 people a week among all the parks and also continue to see if we can manage to have them go to more parks in the future as well.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Thank you. Thank you. Next speaker, please go ahead. Got it.'",
        "'speaker_1': 'I've been the lead volunteer at Law three, this park for the Municipal Band Conference for at least 27 years. And we could be 28 or 29. But time flies.'",
        "'speaker_0': 'When you're having fun.'",
        "'speaker_1': 'I chose this attire tonight because this is what the public has seen me in in the last three weeks at law for this park and are going to see me that way for another three weeks, a lot through this park.'",
        "'speaker_0': 'And to that extent, I want to tip my.'",
        "'speaker_1': 'Hat to Marie.'",
        "'speaker_0': 'And her underling, Gladys Kaiser, for having come through with.'",
        "'speaker_1': 'The volunteer T-shirts this year. She did yeoman's work. I also want to thank.'",
        "'speaker_0': 'You folks and the mayor.'",
        "'speaker_1': 'For he here and the city manager for providing us with six concerts this summer. I'm used to contract seasons lasting eight weeks, but six is better than four.'",
        "'speaker_0': 'Also give you a.'",
        "'speaker_1': 'Brief history lesson.'",
        "'speaker_0': 'Former Councilman Verbinski, who.'",
        "'speaker_1': 'Portrayed himself as a great egalitarian.'",
        "'speaker_0': 'Created a lot of pressure in his day to move municipal band cart around other places.'",
        "'speaker_1': 'The results were abject failure. The people just didn't show up. Also.'",
        "'speaker_0': 'Another Ray Ragi Ray garbage in her first term behind that rail.'",
        "'speaker_1': 'I stood here at this podium and challenged the entire council to personally donate funds to the municipal band. My wife was still.'",
        "'speaker_0': 'Alive at that point and we were each giving $100 a year to.'",
        "'speaker_1': 'The band. Ray responded by saying, I'll give $1,000 a year for the rest of time and I'm on the city council. So how about it? How many of.'",
        "'speaker_0': 'You are willing to step up? In fact, I'll make you an offer you should refuse for any one of you who is willing to write a personal check for a thousand or the band. I'll match it. I don't care if all all nine of you do it, I'll match it.'",
        "'speaker_0': 'And also. Thank you. Good news. Good news. I appreciate it.'",
        "'speaker_1': 'Will be two additional counter to life.'",
        "'speaker_0': 'Thank you so much for your time. We are willing to hear all this. Thank you so much. And we will have our next speaker, please. Thank you.'",
        "'speaker_6': 'Good evening, everybody. First, I want to thank you.'",
        "'speaker_5': 'All for your time. I know it's it's a hard job to sit through this and listen to.'",
        "'speaker_6': 'All the comments. So we appreciate your attention. So my name is Nicole, and I'm the community organizer.'",
        "'speaker_5': 'At Building Healthy Communities Long Beach, one of the community organizers.'",
        "'speaker_6': 'And I'm speaking in support of the equitable, equitable distribution of.'",
        "'speaker_5': 'Public programing throughout the city of Long Beach.'",
        "'speaker_6': 'Watching the presentation in those numbers was very disappointing and sobering to me. And according to the.'",
        "'speaker_5': 'Long Beach Club website, the Long Beach Parks, Recreation.'",
        "'speaker_6': 'And Marine Department is supposed to serve the community.'",
        "'speaker_5': 'With recreation programs and services.'",
        "'speaker_6': 'It was pretty clear that from tonight's tonight's presentation that the community wasn't being served in that center. West and north Long Beach are being neglected. I worked closely with help on Youth Counseling Care and.'",
        "'speaker_5': 'Wyatt, who also spoke about programing this evening.'",
        "'speaker_6': 'On training called People's Planning School. During this training, residents engaged in a curriculum where they learned about city planning and organizing, and at the end, they had to create a project. They decided to do a project on mentoring and tutoring because there were no opportunities in Martin Luther.'",
        "'speaker_5': 'King Park for the.'",
        "'speaker_6': 'Youth to engage in tutoring programs. The participants of the People's Plan in school have invested hours to create this mentoring and tutoring program, but it shouldn't all be on the burden of these community organizations to do this work.'",
        "'speaker_6': 'It's also been difficult for them to reserve space.'",
        "'speaker_5': 'In the park to do their programs and building other communities. Long Beach has also had that problem as well. And shouldn't we shouldn't have to go through hoops to do the programing that we want to do. I had a lot more that I.'",
        "'speaker_6': 'Wanted to say, but I will end it there. Thank you for your time.'",
        "'speaker_0': 'Thank you for your time. Next speaker, please.'",
        "'speaker_2': 'Okay. My name is Robert Pete May, California grader. Okay. The thing I have to say, you talked about equity and everything, but I don't see equity when I go back to item number 12. And I see you're talking about, oh, $500,000 in Workforce Innovation and Opportunity Act funds for Pacific Gaming to implement a Workforce Navigator program, English'",
        "'speaker_2': 'language learners and Immigrant Workers. No, no, no, no, no. Okay. What I'm talking about, Mr.. Mr. Vice Mayor, why are you leaving when I'm talking to you? Okay. You're the vice mayor. You're supposed to be listening. Can I get my time back?'",
        "'speaker_2': 'Come on.'",
        "'speaker_0': 'You can have the time back. Okay.'",
        "'speaker_2': 'Check this out. You're always doing something out of a manual. Never do anything for black folks. And you're supposed to be black. That's the thing is is. Listen, as far as America, you point, if you want, I'll deal with you later.'",
        "'speaker_2': 'Ain't nobody ever asked you for nothing. At any rate. At any rate, the thing is, is America for Americans? And as far as equity, you got you talking about two separate. It is two separate cities because you are always trying to do for illegals and other people and and you may yeah this respectfully I was.'",
        "'speaker_1': 'We have to.'",
        "'speaker_2': 'You got to let her talk. Just take your time. Can I have.'",
        "'speaker_10': 'My time back? Me, sir.'",
        "'speaker_0': 'Is this a sitting topic? And is this off topic and irrelevant?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Sir. I'm sorry. This is the second time tonight. You can speak on the next item when you're done on this item. Thank you.'",
        "'speaker_2': 'You've got your vertical on one side. But anyway, no deal. You.'",
        "'speaker_0': 'I mean.'",
        "'speaker_1': 'Can we get a little more on it? I mean, if he stays on topic.'",
        "'speaker_0': 'I'll give you another 45 seconds. If you stay on topic, sir.'",
        "'speaker_2': 'On top of you what I did, this is if.'",
        "'speaker_0': 'I really just not want to do it. So legally, do I have to let this guy speak?'",
        "'speaker_1': 'Yes, he has an opportunity to speak.'",
        "'speaker_0': 'Although I'm city attorney. Do you have an opportunity to speak if you stay on topic, but we're not going to continue to disparage people's documentation status. Things about that chair sir, please address me. Address me. Thank you.'",
        "'speaker_2': 'Cannot rebut what you say. Continue to say stay on topic. You could just say anything would is it.'",
        "'speaker_10': 'Serves no time to ask questions you can't you have your 45 seconds to speak.'",
        "'speaker_2': 'With my 45. So that's 30. I want 45. Okay, there we go. Now, you ain't gonna be bullying me anyway, so. Okay, you talking about. Okay, you got that be safe program for Sheriff Park. We got the police station in Share Park.'",
        "'speaker_2': 'Why? We need to be safe. That's wasting money, number one. Okay. You mentioned leaving the city better than you found, not bringing communism. And that missed call that's back there. We ain't going to be better. You get rid of her.'",
        "'speaker_2': 'It'll be better. Now, you talking. We're talking about this. I'm talking about. You said no. Those making decisions based on me. Well, then stop helping illegal aliens and help America help them. People in the middle of the streets.'",
        "'speaker_2': 'I'm. Yeah, we got 8 seconds. I'm finished. We can help them. Help Americans in the veterans in everything and stuff. Skinning and grin and try and help it.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please. And great job making America great. Next speaker, please.'",
        "'speaker_5': 'Dr. Kathleen O'Brien 539 Daisy And I was really worried that I was going to be too bitter, but I'm not really worried anymore. Okay. Thank you, Vice Mayor and City Council. And thank you to Parks and all the rest of the staff that's here.'",
        "'speaker_5': 'The first thing I would like to do is to thank you all for everything you do all the time, because I know you are very, very patient and I would not be able to be as patient. And the second thing I wanted to say is that I do appreciate budgets.'",
        "'speaker_5': 'I understand that Parks has and has got a lot to do and to take care of, and that's not my issue. I really admire a lot of the things they do. Certainly our program is great. And you have my letter.'",
        "'speaker_5': 'I sent a letter to your district office about my concerns as a WCHA member, but I want to talk about myself as a person, and I'm the granddaughter of immigrants. I was lucky that my mother was educated. She took me to the see the New York City Ballet and it changed my life.'",
        "'speaker_5': 'That's all I want for our neighborhood is that they have the opportunity to see things that they would not otherwise see. We have to bring them there however we do it. It's not fair to them. Otherwise I can go across the city to El Dorado.'",
        "'speaker_5': 'They can't necessarily do that, and I don't want them bused to that Paris theater one time in their life. I want them to be able to take it for granted that they can come to our park and see quality.'",
        "'speaker_1': 'Paid.'",
        "'speaker_5': 'Union musicians or theater people and think that it's just ordinary and that they can just go there without any kind of controls or embarrassment or anything. And you know, if you've been in our neighborhood, they do not feel welcome everywhere.'",
        "'speaker_5': 'You know that.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Hi. My name is Kelly Carroll and I am a resident of the First District and involved with the North Pine Neighborhood Alliance. And I also have worked in the community with a nonprofit, and there's two points that I want to make.'",
        "'speaker_8': 'And the first being is, is that there's been some comments made in regards to events and nobody showed up. And so then we just have to abandon it. And I work for a nonprofit that's been in business for 113 years.'",
        "'speaker_8': 'And if we decided after the first event that we did in Long Beach that it only made $25,000.'",
        "'speaker_5': 'To save lives, that it needed to go away because we didn't get enough people. We dug deeper.'",
        "'speaker_8': 'And we got more people in the community and we got more people involved. And we do that everywhere we go. And we now have for this particular event over 5000 events in the country. And so I see it as something that it just has to keep trying.'",
        "'speaker_8': 'And so having people yes, it was maybe dismal attendance at.'",
        "'speaker_5': 'Drake, but when you only do it once every four years, nobody knows it's there.'",
        "'speaker_8': 'So communication's going to be really huge as well and really letting people know that it's there.'",
        "'speaker_5': 'My other point is being a.'",
        "'speaker_8': 'Resident in the community is, is that I do want to see things there.'",
        "'speaker_5': 'I want to see things.'",
        "'speaker_8': 'For my neighbors that I work really hard to represent as well in the neighborhood alliance. And I want to see things that they can benefit from and the kids not playing in the alley by the dumpster and that they have somewhere to go and that they have programs that they can play with.'",
        "'speaker_8': 'And if you don't believe that they do that, come on over to Lily, way in between Pine and Pacific and you can see the kids there. So I just want to end with saying thank you to all of you.'",
        "'speaker_8': 'Thank you to Councilwoman Gonzales for bringing up this concern. And Vice Mayor Richardson and I appreciate all of your attempt.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Hi, I'm Carol Sergi. I also live in the First District and I'm part of North Pine Neighborhood Alliance. And I just have a few important comments. And one is that everybody should be able to have green time every day.'",
        "'speaker_5': 'We have a lot of parks. We have wonderful parks where we we live. Cesar Chavez, Drake Park, Admiral Kidd, it's another park. I was able to do a neighborhood leadership program last week. We did a lot excuse me, last year, a public safety fair.'",
        "'speaker_5': 'And there were so many children there and it's such a wonderful park. And I can't imagine that we don't have more programs for for all these kids and families. A lot of the children there come to the park because they can't play outside their homes because it's too too dangerous.'",
        "'speaker_5': 'Their parents won't let them go outside. And I think that's something that when we say that children can can go to afterschool programs in other parts of the city, the families can't afford the programs. And they they're not able to get their children to these programs.'",
        "'speaker_5': 'But we have a great this is an opportunity to show the great city that we are and we can use creativity to promote. The programs that we have. And and and makes me even better. So I thank you.'",
        "'speaker_5': 'And I can't wait to see what's going to come next.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_1': 'Hi. Yes, my name is Holly Stewart. I live in the first district over here in Walker building. I spoke here before I use Chavez Park. I go down there sometimes I lift weights and do things like that. I find no problem there.'",
        "'speaker_1': 'So I but when I hear people in this say they're afraid to come down here some, I understand it. I'm not afraid to go down to Chavez Park. I'm not afraid to go to Jerry Park or anywhere else.'",
        "'speaker_1': 'But I do. Grew up on Alvarado Park in Denver, nice big park. And I go over by the big swimming pool over there and I go down to beaches and I see a lot of people there, but I don't see them come over to my neighborhood.'",
        "'speaker_1': 'For some reason, it's assumed that people in my neighborhood can go all these other places, but people, they don't want to come down here. Why not? Well, maybe we need to get more and more equity in our parks so that people feel free to come down here to take advantage of the things that are at Chavez Park'",
        "'speaker_1': '. It's a beautiful place Drake Park can be at. I think it's already okay. It could be a whole lot better with some more stuff there. What it is when you talk about equity is making sure that our city is a place where I can feel safe going anywhere in that city and participate.'",
        "'speaker_1': 'And the people from all those other parks can come down here in the First District and the West Side and feel safe. And I don't know why they shouldn't, because to me, if we all live as one large family and we get to know each other, then we really love each other.'",
        "'speaker_1': 'We can do that. We can accomplish those things. But but we have to take has set up the situation where it'll work. And one of them is equity. If somebody said, well, people are worried about this or that, if they come down to that park, well, we will turn that around.'",
        "'speaker_1': 'But we can do it because that's what we're all about. You're city council, we're people. The city we live in all different places and we want it to work. And if we do that, then we can get equity.'",
        "'speaker_1': 'There is a way to get the way it is to spread the things around. I didn't come here from downtown area to say, take a step away from the east side of the north side, anywhere else. My thing is, there's enough in this city for all of us.'",
        "'speaker_1': 'So thank you very much. And I think you are doing a good job. And Linda Gonzalez is my councilwoman and I've met some of the others. I think it's beautiful.'",
        "'speaker_0': 'Thank you to the next speaker, please.'",
        "'speaker_1': 'Good evening, Don Don, our first district resident. And also I'd like to commend my council member and her staff. They've done a terrific job. A lot of research. And she articulated everything so well. It was just terrific. And I like to commend her as well as I'd like to put a plug in for the Parks Recreation Marine'",
        "'speaker_1': ', the employees at every park, every building you go to, they're just terrific. I've never heard complaints about them. Maybe there are some, but I've never been able to find them. And the prime staff, the same way they're leading from the top and they're doing a great job.'",
        "'speaker_1': 'I wouldn't want that job. Parks, Recreation, Marine. You think I would think of all that involved? It's unbelievable. But they're doing a terrific job. Just like anything, you can always do better. And that's what we're here to try to help do.'",
        "'speaker_1': 'And in all due respect, Councilmember Austin, it isn't always the case that something added require something deducted. I think we can work things out and do things without taking something away from something else. The seniors, as a senior, as a commissioner on the seniors commission, I would like to point out that this is the fastest growing segment'",
        "'speaker_1': 'of our population. I mean, the first concern doesn't should not be the millennials. You got more people downtown in senior category than anything else. They have trouble with transportation. They can't get to different places. I've been trying to have a roundabout bus.'",
        "'speaker_1': 'I would take them to places, but that's I don't know. And in a feeding program, we've got language problems, too. I mean, there's one senior building, an eight story building that's three fourths of them are Korean language. Another building, three or four or some or all of them speak 11 different languages.'",
        "'speaker_1': 'So that's that's an issue we have to address to transportation and equity and all kind of respects. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Oh, it started already. First, I want to. I live.'",
        "'speaker_11': 'In District.'",
        "'speaker_6': 'One and I want to say thank you to Lena, our councilwoman Lena Gonzalez, for a.'",
        "'speaker_8': 'Thorough presentation.'",
        "'speaker_6': 'I have something written here. So Long Beach is one of the most diverse cities in the nation. And yet, when I see 100 Days of summer website, I see a handful of images displaying our diversity out of the 100 plus images on its site.'",
        "'speaker_6': 'And these images are representative of its programing. A large portion directed and catered to three districts, District 45 and eight, where the bulk of Long Beach summer events more than 50%. Three out of nine districts host most of Long Beach summer events and concerts.'",
        "'speaker_6': 'Not surprisingly, these districts have the more affluent neighborhoods in our city. And so I ask why? Why are some districts not being afforded the recreational and educational opportunities when programing should and can be more equitably distributed? What is the criterion for programing?'",
        "'speaker_6': 'How are funds allocated to serve all of Long Beach and not a selected few? As a community member of District one and a business owner in Long Beach. I am frustrated and angry with how little attention parks programing in less affluent areas receive while others burst at the seams with the level of support in events like 100'",
        "'speaker_6': 'days of summer, Long, Long Beach, Park and Rec's mission is to provide leisure programs and services through people, places and partnerships to residents and visitors which enhance neighborhoods and improve quality of life in Long Beach course services to provide recreational opportunities to meet the diverse needs of the community.'",
        "'speaker_6': 'But where these programs and opportunities for District one and underserved areas. There is a plethora of studies and research demonstrating the importance of music and recreational programs for our children. So I won't quote any here, but I am here to fight for more equitable programing, for more recreational opportunities for all of Long Beach.'",
        "'speaker_6': 'My dad in a well who's here, would like to attend a cool concert summer event program, just like those who walk over and even reserve their spot at the park week after week. The owners should not be left to the neighborhood.'",
        "'speaker_6': 'Associations like City Heritage Association to bridge bridged the gap without any funds from Park and Rec. The Olive. I'm sorry. Parks and Rec is funded through city funds, sponsorships and donations meant to serve all of Long Beach, not a select few.'",
        "'speaker_6': 'So I stand here today to challenge you to review the inequities in undeserved districts that we're facing.'",
        "'speaker_0': 'Thank you so much. Our next speaker, please. Our last speaker.'",
        "'speaker_6': 'Good evening, Vice Mayor, members of the city council. My name is Jessica Quintana and I'm the executive director of Central Asia and also an eighth District resident. I just to also want to congratulate our councilwoman, Lena Gonzalez, for being a champion in bringing this forward.'",
        "'speaker_6': 'In regards to Park Equity, and I know it was discussed earlier about a lot of other equity issues, but I think that there's a place for conversation. You know, currently in the Office of Equity at the Long Beach Health Department, which I soon hope to be part of that equity discussion.'",
        "'speaker_6': 'You know, the organization in Summer Night Lights was brought up many times. And so, you know, as we're talking about the parks and this was activated in 2000, you know, when we're faced with high crime, poverty, the schools were shut during the summertime.'",
        "'speaker_6': 'We had homicides on the Santa Fe corridor in around King Park. Drake Park was on fire. You know, it was important for us to really, as a nonprofit organization, is to take action and work with some of the resources and leverage those resources in our community.'",
        "'speaker_6': 'Since then, we have brought you know, we talk about communication and really knowing what our community partners are doing. We have spend over $2 million in parks program in summer jobs, providing 11 $12 an hour jobs at the parks for our students.'",
        "'speaker_6': 'You know, so I think, you know, when our councilwoman brought this, you know, to the to the council, it wasn't about taking away from another park to give another park. I think her intention was, you know, we need to have the same thing.'",
        "'speaker_6': 'We need to look at how do we create more robust, safe parks for everybody in our community? You know, it's the resources. You know, it was great to see summer night lights and really work with the collaboration with our city and turn in to Be Safe initiative.'",
        "'speaker_6': 'And I want to tell you that, you know, working with Parks and Recreation and working with Murray and her team, you know, we've been able to activate a lot of programing at Advocate Park at Silverado Park, but it's working with her staffing to ensure that it's happening.'",
        "'speaker_6': 'Can we do better? Is there a better permitting process? Absolutely. You know, but it's took in seven years, if you can imagine when we first started Summer Night Lights to be safe now, you know, so we talk about, you know, equity and equity lines.'",
        "'speaker_6': 'We deal with that every single day in our communities, in our Latino communities after. In American communities, as you've seen today, we had ignorance here today. Every single day we're faced with those equity issues. And so, you know, I know there's big conversation about equity and equity lens, but it all depends on whose eyes are you seeing'",
        "'speaker_6': 'that from and who's at the table and who's at the car. And, you know, folks need to participate in those those conversations. And so, you know, our recommendation is, you know, Parks and Recreation as we grow, grow and grow and that's wonderful.'",
        "'speaker_6': 'We're getting where acquiring more park land. But the programing is going to be.'",
        "'speaker_0': 'Spent on how.'",
        "'speaker_6': 'To keep up.'",
        "'speaker_0': 'We went 3 minutes, if you can conclude.'",
        "'speaker_6': 'I would conclude that as we have other funding measure A as we're getting collectives, marijuana collectives, that the tax on those collectives go to these type of programs. Because what I can tell you, keeping our young people away from those collectives have been very difficult.'",
        "'speaker_6': 'So as we're trying to change them for work experience and jobs and career development and going to college is very hard.'",
        "'speaker_5': 'Thank you. So fantastic recommendation.'",
        "'speaker_0': 'Thank you. So thank you all for for coming out. And that concludes public comment. So at this point, members, please cast your vote.'",
        "'speaker_6': 'Motion carries.'"
    ],
    "Report on Residential Parking Requirements, Garage Permits and Clean-Up Day.": [
        "'speaker_0': 'Thank you. So let's move forward with item number 27. Please.'",
        "'speaker_6': 'Item 27 is communication from Councilwoman Price, Councilwoman Gonzalez and Councilmember Peers recommendation to request the city manager to report back to council within 90 days on current city ordinances regarding residential parking requirements for garage use.'",
        "'speaker_0': 'Thank you, Councilman Price.'",
        "'speaker_8': 'Thank you. This item actually has come to us as a result of a parking study that was commissioned by the Belmont Store, Belmont Shore Parking Commission. And they came back with a series of recommendations. And this is one of the recommendations that staff has communicated to the residents they would be supporting.'",
        "'speaker_8': 'So I'm not sure I know there's someone here from Public Works, but the item pretty much speaks for itself. It's trying to encourage people to clean out their garages so that they can park in their garages. We have a lot of parking impacted neighborhoods, and the goal is just to try to encourage and streamline the permitting process'",
        "'speaker_8': 'so that people who want to remodel their garages so that the modern cars can fit. And some of these homes were built in the twenties and thirties. They can't fit their cars in there. So we want to make sure that we provide an environment that allows for that to happen and support our neighborhood organizations who are working'",
        "'speaker_8': 'on efforts to do community cleanups and things of that nature. And since staff is supporting this recommendation, I ask my colleagues to do so as well.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_9': 'Yes. I want to thank my colleague, Councilmember Councilwoman Price, for bringing this item forward. I think it's important, you know, that we are enforcing the rules that are on the books. And if we're not enforcing them, we should, of course, revisit them and make sure that we're adjusting as needed.'",
        "'speaker_9': 'And so I'm thankful for this item as being in a parking impacted district. I also want to say that while we're looking at the permitting process to try to assist people that are going through this process, they were also included in the report to establish a process for those who might be able to prove financial hardship by'",
        "'speaker_9': 'giving them more time to adjust the situation, whether it's, you know, rebuilding their garage or cleaning out their garage, that we include that in the report as well. I know I've had a couple of calls into my office from constituents that have had that issue, but I do ask my colleagues to support us in this item.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. So the scene is open. Any public comment on this item saying no members, please cast your vote.'"
    ],
    "Approval of Consolidated Plan and Action Plan for Federal Housing and Urban Development Grants and Amendments.": [
        "'speaker_6': 'Motion case.'",
        "'speaker_0': 'Thank you. Item 30, please.'",
        "'speaker_6': 'Item is the report from Development Services recommendation to approve the 2018 through 2022 five year consolidated plan and Fiscal Year 2018 Action Plan for the Community Development BLOCK Grant. Home Investment Partnership Grant and Emergency Solutions Grant Funds City Wide.'",
        "'speaker_0': 'Thank you. Staff and Property.'",
        "'speaker_1': 'Development Services Director Amy Burke.'",
        "'speaker_8': 'Mr. Vice Mayor, members of the City Council, thank you very much. We are here today for your annual hearing on the CDBG action plan, but we're also here today for your annual your every five year report on the CDBG CDBG consolidated plan.'",
        "'speaker_8': 'I will need to get up and get the clicker. So hold on 1/2. If you could have the slide advanced, that would be great. One more before that. Thank you so much. Thank you. Okay. So we're here to talk about the federal funding program, CDBG home and the Emergency Solutions Grant Program.'",
        "'speaker_8': 'Those three programs come through development services and they are administered through our grants administration division. And I wanted to talk to you about what the consolidated plan is, how it relates to our housing element, etc.. So the chart behind you and for the audience shows that we're here today to discuss the consolidated plan in the annual action'",
        "'speaker_8': 'plan. But we feed into that information from our housing element and from our recently adopted assessment for for Fair Housing, which was also a federal housing and urban development requirement. CDBG funding has declined significantly since our high of almost $14 million in funding back in 2003.'",
        "'speaker_8': 'We get roughly 5.3 to $5.6 million a year right now, and that's what we will be getting for our fiscal year 18. We as this chart shows that we will be getting 5.5 million in CDBG, $491,000 for ESG, which is, again, the emergency services grant, and about $2.1 million for home for a total entitlement of 8.177.'",
        "'speaker_8': 'We are an entitlement city, which means that it is not a competitive process for us. And so we do have the ability to receive this money directly from HUD. Here is your CDBG eligible areas. Last a few months ago and we spent some time talking to you about our assessment for fair housing and racially and ethnically concentrated'",
        "'speaker_8': 'areas of poverty. Those areas are in black throughout the CDBG eligible areas, and then the areas within red are those areas where we're going to be focusing our new place based neighborhood improvement strategy areas. This place based neighborhood improvement strategy area is a new CDBG initiative.'",
        "'speaker_8': 'They are trying to focus our dollars in very specified areas to enhance our abilities to make noticeable improvements in the quality of those neighborhoods. Again, this slide shows you how we are required to include our five SFH goals into the Consolidated Plan.'",
        "'speaker_8': 'These are directives by HUD, and so we don't have a lot of opportunity to be creative in how we administer our consolidated plan. We are required to go through a HUD planning process. We are required to do an analysis based on census and the American community surveys.'",
        "'speaker_8': 'We're supposed to do social service records and consultation with agencies, a robust public input process define where gaps and services are defined, the eligibility for funding based on HUD rules, and then actually try to work through all of these processes to determine how to best spend our limited resources.'",
        "'speaker_8': 'So we went through an eight month public participation process that included door to door outreach, particularly in those recap areas. We had a multi-lingual housing and community needs survey. We did that both online and through hard copies. We had that in the four language access languages.'",
        "'speaker_8': 'We had workshops and community meetings, housing resource fair and a community forum. We did consultations and focus groups. We did a version of participatory budgeting in the recap areas. And then we had two public hearings and a study session at our Long Beach Community Investment Company, which is designated by the City Council for determining the use of'",
        "'speaker_8': 'the funding received by HUD grants. Couple of images of some of our community input process. And then here are the five community, the five priority areas that we're required to be focusing on in conjunction with our assessment for fair housing.'",
        "'speaker_8': 'Housing needs, homeless needs, economic development, community facilities and infrastructure. And then community services needs. We also have five common plan goals again affordable housing, homelessness, supporting activities that assist with basic needs and eliminate blight and or strengthen neighborhoods.'",
        "'speaker_8': 'Expanding economic opportunities. And then promoting fair housing choice. All of these go into our considerations as we are working through this process. So again, it's a combination of public input directives from HUD, our own research and analysis, and then the results of our assessment for fair housing.'",
        "'speaker_8': 'So in fiscal year 18, we are looking at allocating dollars to those five goals, and that is in your presentation as well as in the PowerPoint presentation behind you. We're going to continue to fund, for example, the Multi-Service Center in the same level that we are funding it right now.'",
        "'speaker_8': 'We're continuing programs like our Security Deposit Assistance Program, which actually helps people who may be able to afford rent but cannot come up with a security deposit. So we fund this program through the health department and through the Multi-Service Center.'",
        "'speaker_8': 'We spend money on emergency shelters, rapid rehousing, street outreach. We also spend dollars on new construction, acquisition and rehabilitation, particularly through our home dollars that we receive as well. You're probably familiar with our home improvement rebate program that we have the $2,000 home rebate program.'",
        "'speaker_8': 'We're proposing a new home improvement loan program in a $10,000 amount because the $2,000 just doesn't stretch far enough. The graffiti removal program would remain funded. We would continue to fund the Neighborhood Resource Center, the Neighborhood Leadership Program, which also gets outside resources, senior services, afterschool and weekend recreation programs.'",
        "'speaker_8': 'Code enforcement is a significant user of CDBG dollars. And when we spend money on code enforcement, that is only in those CDBG CDBG eligible areas. We're also funding the Sidewalk Improvement Project as part of our obligations. We have a tree planting program and then this targeted placemaking program is really in those place based neighborhood improvement areas that'",
        "'speaker_8': 'HUD is directing us to spend our resources in now for economic development. We are proposing we worked with the Economic and Property Development Bureau to come up with some ways to spend our dollars on economic development and there to continue to support the SPDC, the Small Business Development Center at Long Beach City College, providing a new line'",
        "'speaker_8': 'of credit loan program as well as a business revitalization program, specifically along corridors. And then number five is we are obligated by HUD to enter into contracts to promote fair housing choice. And so we do have an annual contract for Fair Housing Services and we do an RFP for those services.'",
        "'speaker_8': 'Right now, Fair Housing of Long Beach is providing those services for us. So with your consideration tonight, we would be approving the five year consolidated plan, the one year action plan for the $8.8 million in budget that we would be receiving from HUD.'",
        "'speaker_8': 'We would be submitting this report to HUD by the deadline of August 15th. If they certify it, it would be effective October one, and then our program year would begin October one as well. That completes my staff report.'",
        "'speaker_8': 'I and my staff are available to answer any questions. I want to point out that Alem Hagos and Liz Salcedo did an amazing amount of work on this and the assessment of fair housing over the last year in doing community outreach and putting together all of the prioritization areas and then, of course, complying with brand new HUD'",
        "'speaker_8': 'directives on very short notice. So with that, thank you for your consideration.'",
        "'speaker_0': 'Thank you. And before we go to the Council for comment, would you mind elaborating more on the new targeted program? I want to understand what that is.'",
        "'speaker_8': 'So HUD is basically suggesting that we go back to the the old concept of a neighborhood improvement strategy area. They're calling it place based initiatives. But what they're saying is that they want you to aggregate your resources in geographically concentrated areas that would be allowed to take advantage of naturally occurring improvements in those areas and then throwing'",
        "'speaker_8': 'additional resources into those areas to create more evidence of positive change.'",
        "'speaker_0': 'So can you be specific.'",
        "'speaker_8': 'In the areas or in.'",
        "'speaker_0': 'What like what tangible things are included in this? What, ten tangible activities.'",
        "'speaker_8': 'So what tangible activities? So some of it can be for those areas. Some of them may not have very strong leadership, very strong neighborhood leadership. So focusing on working with those neighborhood groups, defining what those neighborhoods need, some of them have commercial corners in there.'",
        "'speaker_8': 'So it might be a massive facade improvement program, specifically along that commercial corridor for that portion of the town. It could also be enhanced code enforcement if that's what that specific neighborhood needs. So it does depend on each of the neighborhoods and how we focus those resources in those neighborhoods.'",
        "'speaker_0': 'Thank you. I think I'll have more questions later, but we'll go to the council. Councilmember Pearce.'",
        "'speaker_9': 'I think you staff and thank you, Amy, for the good presentation. Can you elaborate a little bit of how the outreach and how you outlined it in here, but just how it's different this year versus previous years?'",
        "'speaker_8': 'Yes, we went door to door, which is something that we don't normally do. So we actually did fliers door to door specifically in those recap areas, which are the dark outlined areas and black trying to get people who typically do not participate in surveys or community meetings to get their feedback and interest.'",
        "'speaker_8': 'And so there was a lot of knocking and walking that we did. We also did a YouTube video. I'm not sure how many likes we have on it, but it was an additional attempt for us to try to communicate in a different way.'",
        "'speaker_8': 'And we had those videos translated as well, traditional community meetings. We did some forums, a resource fair.'",
        "'speaker_5': 'Where we brought other.'",
        "'speaker_8': 'Interested parties to participate and use that opportunity to educate people on what we were trying to do. And then, as I said, the online surveys and then the in-person surveys as well.'",
        "'speaker_9': 'Great things I really enjoyed whenever we met this week, hearing the stories from staff and how much they enjoyed going door to door. I know that none of these areas are in my district, but I think of those opportunities as a great opportunity to partner with the council offices so that we can help walk and talk and'",
        "'speaker_9': 'get some of our residents engaged in and knocking and talking to their neighbors as well. Can you answer for me? Do the changes to the subsequent one year action plans impact the five year consolidated plan?'",
        "'speaker_8': 'No. The five year consolidated plan is the umbrella plan. And then our one year plan has to be consistent with the five year plan.'",
        "'speaker_9': 'And is a five year plan of our subject to change in that five years, or is that just.'",
        "'speaker_5': 'It is.'",
        "'speaker_8': 'Actually even our one year plans are subject to change. So we do have amendments, I believe, proposed for this year, for this action item related to some of our other older action plans. If we make a change to funding for any of our action plans, we are now required to amend those action plans instead of just carrying'",
        "'speaker_8': 'over any excess revenue that we used to have. So in our action tonight, we are actually asking you to amend the 2016 and 2017 action plan as well as for specifically for infrastructure purposes.'",
        "'speaker_9': 'Great. Thank you so much. And now looking at 418 action plans, I know how much this council has talked about supporting activities and homelessness. And so it's great to see, you know, our action plan focused on that. So I appreciate that.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Andrews. I'm sorry. Okay, Councilwoman. No, go.'",
        "'speaker_5': 'It it's been a while since we first started talking about this. I know that I had the opportunity to sit down with Miss Bodak on almost a year ago when you were working on this project and gathering the data and the input on the targeted placemaking, how many specific designated areas off the map would that $700,000 go'",
        "'speaker_5': 'to do? Does the grant decide that it's a lower number of higher concentrated placemaking, or are you trying to spread it out more? I only ask because there's a lot of dialog about activating our corridors and I noticed a lot of these areas are along some corridors and some of my colleagues had asked for corridor activation type'",
        "'speaker_5': 'ideas for the upcoming budget and perhaps this could meet those needs.'",
        "'speaker_8': 'Understood. Certain neighborhoods are going to benefit more than others on corridors, for example, the one in the very far northeast corner of the city, we are mostly looking at economic development along that corridor. We don't see other opportunities.'",
        "'speaker_8': 'That's the very red one at the very top of the map. So I say east, I meant west. I'm from the East Coast. So the one on the very top of the map, that one we view as being a prime example of where we can focus some dollars on economic development for those corridors because it's a very'",
        "'speaker_8': 'stable neighborhood otherwise. But the business district up there is is wanting investment and there is the ability for us to make some targeted improvements up there. We don't envision that the $700,000 will be spread evenly. We do think that there will be different needs for those different areas and that we'll be responding to those needs appropriately.'",
        "'speaker_5': 'And I also noticed the concentration of boxes on the Anaheim corridor is that another area where placemaking would be ideal.'",
        "'speaker_8': 'In Anaheim and PCH or the other two East-West corridors that we're looking at as well. And one of the red areas, the place based neighborhood improvement area, does cover the Washington neighborhood from. Home to PCH along Pacific Avenue.'",
        "'speaker_8': 'Yes.'",
        "'speaker_5': 'So could you give a couple of examples of the types of things you'd be doing in these neighborhoods?'",
        "'speaker_8': 'So for something like that neighborhood, we might be focusing a little bit on corridor improvements along Anaheim, but we also might be focusing on some fair housing issues in the neighborhood itself. So it will depend on the geography of the neighborhood and the needs within those each individual neighborhoods as to how we we target those investments.'",
        "'speaker_8': 'We may, for example, contribute to park development. We may try to focus on a key acquisition of a piece of property that that might assist us in park acquisition or park development. It just depends, again, on the neighborhood.'",
        "'speaker_8': 'And then will that be.'",
        "'speaker_5': 'Braided with the funding over goal four, which is the business revitalization program so that you really love Regina for $1,000,000?'",
        "'speaker_8': 'We hope so, yes. So we do have the business improvement, economic development focus as well. So if there's a way for us to combine, for example, the letter of credit and a facade improvement program and sending somebody to the Small Business Development Center for additional business training, we can leverage different resources also from different agencies to try'",
        "'speaker_8': 'to make improvements in those areas and at the speeds.'",
        "'speaker_5': 'Of those pay as you go. So if you refer 15 people, they send you a bill or you giving them an outright 110 hoping that we utilize it, we.'",
        "'speaker_8': 'Actually give them an outright 110, but they are required to provide a certain number of trainings and technical assistance classes over the course of the year, and they're required to report to us quarterly on those activities in exchange for that flat rate.'",
        "'speaker_8': 'So we negotiate that in advance and they have trainings and offer one on one assessments and consultations throughout and they do have benchmarks that they do have to meet.'",
        "'speaker_5': 'I'm very supportive of SPDC. I appreciate the work that they do with the businesses. I would say that the trend nationally is towards outcomes, not ours, and that we probably need to be looking at that as well. It's great to say they've provided 70 hours of X, Y or Z, but what are the outcomes that we are'",
        "'speaker_5': 'looking for as a city? And no matter how many hours it takes for them to accomplish those, whether it be less or more, yes, that trend is coming. So I appreciate that. Thank you so much.'",
        "'speaker_8': 'It's been a long haul.'",
        "'speaker_5': 'To get here. Congratulations and thank you for the work that your team has done.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_11': 'Yes, thank you. To Amy and Alim and and Liz, I really appreciate this work as well. And I am glad that we are focusing on corridors that like Anaheim and PCH that we've long worked on together. I know, Amy, we had a discussion about us CDBG funding, and I had asked about whether, you know, in Anaheim and'",
        "'speaker_11': 'PCH, historically, a lot of the business owners are not able to fund and front the the funding to be able to pay for their storefront and then get reimbursed. So is there a way that the city is able that we are able to front that that money for a business signage program?'",
        "'speaker_8': 'Right. That question is still being discussed between Alem and our Los Angeles region. Great. So we don't quite have an answer for you yet.'",
        "'speaker_11': 'Okay, perfect. I'm glad we're we're at least thinking about. Yes, I think that would be great if we are able to do it. But I know that there's sometimes some hurdles we have to go through. Right. Thank you.'",
        "'speaker_11': 'Okay. And then in terms of I'm looking at the consolidated plan priority areas and I see under housing needs, which I know in some areas of my community, I see in there rental security, deposit assistance. Is that just for individuals experiencing homelessness or are we looking that at that kind of broadly?'",
        "'speaker_8': 'It is for individuals who are experiencing homelessness or may be experiencing homelessness. It does include the ability to refer folks like college students who may be, you know, bouncing around from apartment to apartment. They actually would actually qualify for that.'",
        "'speaker_8': 'And we've had discussions with Cal State, Long Beach, as well as the Multi-Service Center on how to direct kids in need who may be able to hold down a job and pay rent. But they're just not able to come up with that first month, last month security deposit situation.'",
        "'speaker_8': 'So it is definitely income based and you do have to demonstrate that you do have the ability to continue to pay rent once you are in a in an apartment.'",
        "'speaker_11': 'Okay, great. Thank you. That clarifies my question. And thank you for the work. This looks fantastic. And I look forward to working with you again on on future discussions on this. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Super.'",
        "'speaker_1': 'Thank you and thanks for the report, Director Buddha. I just have a question, if we could from, from the presentation on the 418 action plan activities. The number for code enforcement. Could you just give a very brief delineation of what that looks like?'",
        "'speaker_8': 'So the one we are requesting budget of $1.159 million for code enforcement. Code enforcement is funded by CDBG. A portion of the staff is funded by General Fund. And then there's a small portion of staff that is funded by the prep inspection program.'",
        "'speaker_8': 'So we are not able to increase the number of staff who are funded by CDBG. Without getting into issues of supplementation. We can't supplant the general fund in any of our expenses. So we are not able to reduce our general fund and increase our code enforcement to cover additional costs.'",
        "'speaker_8': 'So we're very careful about that proportionality between General Fund and CDBG. Our CDBG funded folks only work in CDBG eligible areas.'",
        "'speaker_1': 'Okay. Thank you. Also on on the funding for the Multi-Service Center, is is that a flexible number or is is that kind of locked in at this point?'",
        "'speaker_8': 'It is as high as we can go without cutting other services. We have a category called public service, and we are limited by HUD regulations to only funding 15% of our total entitlement for those things in that category.'",
        "'speaker_8': 'And we are somewhere hovering around 14.91%. And so we don't have the ability to increase that without cutting something else.'",
        "'speaker_1': 'Okay. Thank you. And I know you're 292 page report is an E version here. What about the presentation? Do we have an electronic version of the of the slide show?'",
        "'speaker_8': 'Yes, it is actually attached to the led to start item for this item and it's available through the city clerk's web page. And I can certainly make it available.'",
        "'speaker_1': 'Okay. Thank you. I'm not quite through the 290 pages yet, so I'll get there.'",
        "'speaker_8': 'Thank you. The council meeting is still going on right now, so.'",
        "'speaker_1': 'You don't have to tell me.'",
        "'speaker_0': 'Thank you, Councilman Andrews.'",
        "'speaker_12': 'Yes, fine. First of all, I want to thank Amy and our crew, which has done a fantastic job, because the fact that, as she noticed, you know, I'm just constantly in whenever I get a chance, I'm going to drop by and see Mrs. Moore.'",
        "'speaker_12': 'That because the fact that I know what she and her staff does and I just like to listen to her talk about it because it makes me feel excited because I know they're doing something in my area, but want to think that like, you know, just one thing I'd like to ask you, Mrs. Amy, is that, you'",
        "'speaker_12': 'know, you said that $2,000 for businesses and it's from 2000 to 10000, it's $2,000.'",
        "'speaker_8': 'We currently have a rebate program right now for $2,000. We are looking to create a brand new program that would increase it to $10,000.'",
        "'speaker_12': 'That's that's the one. Yeah. Thank you so much. Because that's but the same project, right? Yes. Thank you so much. Yes.'",
        "'speaker_0': 'Thank you. Gasoline place.'",
        "'speaker_8': 'I just had a question about this map. That's up. Can you just tell me what's what is that property on the southeast side of it is this sea tip wetlands. We do not really address that. Okay. According to HUD's data, it is a CDBG eligible area.'",
        "'speaker_8': 'Hmm. Okay. Those birds are innocent. We. We do not know how that happened, but they are on our map. Okay. That's what Jack and I were looking at the map thinking as. Are we reading it correctly? Is there an area that we didn't know about?'",
        "'speaker_8': 'Okay. It's a racially and ethnically challenged, concentrated area of poverty, according to HUD. Thank you. We have not found that one wetland plant that is suffering yet.'",
        "'speaker_5': 'So that sounds good. Thank you.'",
        "'speaker_0': 'Thank you. So I just have a couple a couple of things. So, Ms.. Barack, we brief monthly and I enjoy those briefings on Joy, our conversations. And, you know, I've been following this, but apparently I haven't been filing that close enough because of a couple of things.'",
        "'speaker_0': 'So, one, I didn't know about some, you know, two specific things that I think I probably should have known coming into tonight. One is the specific strategies and tactics associated with the with the budget. I would have loved to, like, have some time to talk with you about those tactics that are in, you know, page seven or'",
        "'speaker_0': 'I don't know which side that is page seven on the handout and page eight, because, frankly, a lot of these programs are, you know, good, successful stuff. But I would love to just better understand how they work together to improve, you know, these these corridors, the corridor, this highlighted in the northwest portion of the map.'",
        "'speaker_0': 'So that does have two active neighborhood associations who meet monthly are really engaged. I would love for them to, you know, be able to weigh in specifically those two neighborhood associations on this. And then secondly, like, you know, just south of there, south of Artesia, we've got an all hands on deck approach.'",
        "'speaker_0': 'And I'm saying that you know this, but the public may not, but we've got an all hands on deck approach to clean up those motels because the recent homicide and luxury in the history of human trafficking and it just stands out to me that we are literally a block north, you know, a block north of that.'",
        "'speaker_0': 'And if we had had this conversation sooner, I would have probably said, hey, we need to look at how this can be a part of a larger strategy for clean up the motels and the human trafficking on that corridor.'",
        "'speaker_0': 'So, you know, secondly, I would kind of like to know if we did and I know this is and we joke P.B. late, this is your attempt to be like, I'll give it to you with not fully participatory budgeting but you know, we'll agree to disagree is fine.'",
        "'speaker_0': 'But I would say my question is that we do any specific outreach with those neighborhood associations adjacent and they'd I'd like to know which residents like how much of the total surveys came from residents in that neighborhood. How was how much was this informed by that engagement?'",
        "'speaker_0': 'Is that an answer we have handy?'",
        "'speaker_8': 'I do not have the survey addresses with me on where the survey results came from, but we can certainly get those for you. I will say that I'm not sure that the discussion with the motels and the human trafficking would have actually been CDBG eligible.'",
        "'speaker_8': 'I do take responsibility for, frankly, forgetting about that one place based and neighborhood improvement strategy area up in your district. I literally completely forgot about it as being an eligible place best air area, and it is my responsibility to brief you on those things.'",
        "'speaker_8': 'Having said that, I do believe that that corridor is in need of economic development. We have done additional facade improvement work, as you know, up there. We've also granted a few $2,000 facade grants to new businesses just north of Artesia.'",
        "'speaker_8': 'And we'd like to continue that trend because there are still vacancies up there and business owners that are wanting to come in there, we can get you the information on the specific neighborhoods that we did brief. And if you want specific names, we can try to get you those as well.'",
        "'speaker_0': 'I would I would just say that. I would like some time to talk about this with you, given that, you know, largely this is in north, west, central Long Beach. I feel and, you know, this is a five year strategy, a five year plan.'",
        "'speaker_0': 'I feel like we need to have some time to make sure we're all comfortable and on the same page, given how much of a focus we placed on Long Beach Boulevard with human trafficking and the issues there and you know, the liquor stores, it's all been hand in hand with your office.'",
        "'speaker_0': 'So my question for you is we're on a timeline to get this submitted to HUD by August. We've discussed that timeline. Do we have any time to make some changes to this?'",
        "'speaker_8': 'I think that would be very difficult unless it was changes that were made and re recirculated to the public. These documents have been out in draft form for a number of months and we've had two public hearings and a study session at the Long Beach Community Investment Company, where they've had robust discussions about where the money should'",
        "'speaker_8': 'go as well. As I said though, earlier, the dollars and how they are implemented on the place based neighborhood improvement strategy areas get defined based on availability of dollars and then also based on additional input with the communities.'",
        "'speaker_8': 'We do not have those strategies laid out right now, and so I'd be a little bit reticent about delaying this discussion because we we have completed all the community outreach and do have all the data that was based on HUD's requirements in order for us to move forward.'",
        "'speaker_0': 'So I get that I want to be sensitive to that deadline. What flexibility do we have? I don't like when the council get something and it's like, you got to pass it now. No time for changes. So what changes can we actually make without running afoul of the deadline?'",
        "'speaker_1': 'I mean.'",
        "'speaker_2': 'The document is due regulatory.'",
        "'speaker_1': 'On August 15 and. I think the breakup of the place was neighborhood improvement strategy. It's not fully defined, so we can always come back and talk in terms of allocating resources and programs. But as far as this document is concerned, we might have a couple of weeks before we really need to submit it to heart because there'",
        "'speaker_1': 'are other paperwork we have to take care of before submitting it on August 15.'",
        "'speaker_0': 'Okay. So here's what I would ask. You know, I would like to specifically the question of the boundaries. Do we have was that something we established on these placement targets or was that.'",
        "'speaker_1': 'The.'",
        "'speaker_0': 'Boundaries of data? Like what was the criteria to establish.'",
        "'speaker_8': 'That the red boundaries we established based on public input and areas of need and resources.'",
        "'speaker_0': 'Okay.'",
        "'speaker_8': 'And any periods or defined.'",
        "'speaker_0': 'Are already defined for the red areas, is what I'm concerned about. I'd like to be able to weigh in on that.'",
        "'speaker_8': 'Yes.'",
        "'speaker_0': 'And so if we had a conversation between now and placing it back on the agenda in August, do we have time to have a limit conversation about the red areas? And you know, and I don't want you know, I don't want if other council members are comfortable with it in their district, that's fine.'",
        "'speaker_0': 'I'm just not comfortable. It was in my district. So. So I think I would like to have that question answered before we submit this to to to the feds.'",
        "'speaker_8': 'And the answer is yes.'",
        "'speaker_0': 'Okay. So what I'd like to do if the council is open to this. I would love to continue this to, you know, council meeting on August 9th for to complete it and then. Ms. BODAK I'm willing to get together this week if we need to, to talk about I need to better understand it, the criteria and the'",
        "'speaker_0': 'strategies around that, that red area, because it's a major it's a major sore area for North Long Beach, given the recent homicide. Given the history of prostitution, gang activity on that corridor adjacent to another city, we've had a bunch of circumstances where a crime happens in one city and someone may flee into the other.'",
        "'speaker_0': 'There's a where, you know, we have a joint task force with, you know, Compton Lynwood to address some of this stuff. And I feel I don't feel completely comfortable yet. So, you know, so if that is possible, I'll offer that as a, you know, friendly to the maker of the motion.'",
        "'speaker_0': 'Ms.. Pearce.'",
        "'speaker_8': 'May. May I make a suggestion? Yes. Due to the timing that we have to comply with, we could remove that area, adopt the rest of the document as it is, and then come back and do an amendment to the document at a later date.'",
        "'speaker_8': 'Throughout this, you're.'",
        "'speaker_0': 'Comfortable approving the document with or without the corridor there. So how is it we can amend it later before the deadline, but we can't take some time with it. I don't understand.'",
        "'speaker_5': 'Why it would.'",
        "'speaker_8': 'Be amended after they have certified it, so we would be able to do additional community outreach. I don't feel comfortable coming back to you August 8th without having gone through additional research and additional community outreach and having detailed discussions on whether the goals that you're trying to reach are even eligible for this funding source.'",
        "'speaker_0': 'So, so, so here's the issue that I have. And, you know, here's what I'm going to do. I'm going to allow this to sort of move forward. But the issue I have here is when something comes from the council and there's no flexibility to make changes, and I think that's unfair to the public that we're held accountable'",
        "'speaker_0': 'to. And and frankly, you know, if we're talking about expanding it to include something and not taking out what was already circulating in the community, I don't see how the community would be shorted if they say, hey, we advocated for this corridor, but we said we're going to keep that, but maybe extended a few blocks to make'",
        "'speaker_0': 'sure there's some intersectional ism, you know, with with the strategies that happen. To me that makes sense. And I don't think it's a tough argument to to a community to say, look, we're doing this, but the council expanded its scope.'",
        "'speaker_0': 'So is that something we can do at the dais today expanding? Yes. I would like the.'",
        "'speaker_8': 'Area.'",
        "'speaker_0': 'Of the red boundary south toward to be able to look at the CDBG, CDBG areas, those motels and the strategies adjacent to that. That's something we can do on the floor without doing something that's already there.'",
        "'speaker_2': 'We really walked.'",
        "'speaker_1': 'Through the neighborhoods. We are talking about the north part of this corridor. But how far south are you suggesting to the Alamo? Well.'",
        "'speaker_0': 'I mean, you know, honestly, I don't want to say limited, but there's a lot of activity in LA of these one of our even south of even north of the Alamo, frankly. But what I what what I would suggest is in my recommendation.'",
        "'speaker_8': 'I want to just make it clear that we are we still have CDBG money for the other areas. We are not.'",
        "'speaker_1': 'It's not.'",
        "'speaker_0': 'Other funding. It's a strategy. And when we go out to the public and we say that the public is backing this, I want to feel comfortable standing by it. We don't have a lot of sources of funding limited to these areas.'",
        "'speaker_0': 'We don't have access to redevelopment anymore. We don't have access to Tidelands. There's almost no funding to be creative about our solutions. So this is more important than most people understand. Four counties like North Long Beach. So what I would do here's what I'm going to suggest.'",
        "'speaker_0': 'We move forward with this as is unless, you know, someone wants to kind of chime in in support of this, maybe we look at an addendum to add some include a couple of areas because frankly, I just don't know that we would have a coordinated strategy, city strategy, a block away from an important coordinated city strategy that'",
        "'speaker_0': 'addresses some of the similar things, which is blight, activating certain area, dealing with the condition of people who live in a certain condition. And so that's that's where I'm coming from. But I see that there are other people queued up here.'",
        "'speaker_0': 'So we'll continue the conversation. Councilmember Bianca.'",
        "'speaker_10': 'Thank you, Mayor. Well, the concern that I have with this whole whole the report is that, you know, I haven't really had a chance to review it, digest it and really understand it. And in regard to that map right there, I can't really tell.'",
        "'speaker_10': 'In my in my district where the borders are. And secondly and most importantly for me. I'm colorblind.'",
        "'speaker_1': 'You get rid to take two.'",
        "'speaker_10': 'Different types of red. You got a thick creating a thin red that's black or white or whatever. I can't tell you the color. So, like, you are pleased. Please deal with my frustration because like you, it's a real disability.'",
        "'speaker_10': 'And when I'm not given an opportunity to really evaluate it and look at it and digest it and determine where are those areas and borders that we're talking about. And when you're talking about Mozart, I didn't even know how south, how far south you're talking about, Rex.'",
        "'speaker_10': 'But you were north for for whatever it is. But, you know, I basically bottom line, I just haven't had a good opportunity to review this with my staff or with anybody, any anyone else concerned in my community to look at this.'",
        "'speaker_10': 'I feel like Rex does in the sense that if we move forward with this, you know, you want to feel comfortable that when I'm asked, you know, what did you do? What did you have for CDBG monies in your in your district?'",
        "'speaker_10': 'I won't I don't have an answer because I don't know. And I'm very I'm in dark on this right now. And I would have loved to have had a prior type of orientation on it to share these these concerns with with staff so that I can have a better understanding as to what what these borders are.'",
        "'speaker_10': 'So I'm going to make a the motion to please hold this over for until October 9th.'",
        "'speaker_0': 'You said an amending motion.'",
        "'speaker_10': 'In August that. Well, you said amending motion.'",
        "'speaker_0': 'Is that a friendly to make a motion or a substitute motion?'",
        "'speaker_10': 'Because you were the one you were the one saying that.'",
        "'speaker_1': 'You.'",
        "'speaker_2': 'Do the things you're willing to do to do.'",
        "'speaker_0': 'So that's a friendly to the making of the motion. No, not at all. I'll get the first meeting in August so it wouldn't need to be re agenda as it is continuing. Right. We can continue to a date.'",
        "'speaker_0': 'Certain is that. Are you open about making the motions open to that next speaker please.'",
        "'speaker_5': 'Councilwoman Mongo So I'm compassionate to the idea that it's hard when things come back with a short deadline. I get that. Vice Mayor, you and I spoke about these funds last year at the end of budget, at which time eight months ago, Ms..'",
        "'speaker_5': 'Bodak and I sat and started the discussion and dialog related to this. And one of the things that I want to be careful of is the raw community input process that was done by the staff. And so I think that I would like to be respectful of their input and data.'",
        "'speaker_5': 'I'm happy to add to it, but I definitely don't want to take away from it. So, Ross Bodak, if we approve tonight, what is on there? Could we add another zone at a future date that would allow you to continue forward with the process without limiting your abilities?'",
        "'speaker_8': 'Yes.'",
        "'speaker_5': 'Okay. So. I. I. Councilman Pearce, you took the friendly before. So do you want another friendly or would you prefer me make a substitution? No, I don't. Okay. So my friendly would be that we make a motion to approve the substance of the community input the components that are required for HUD, the legal register, regulations that are'",
        "'speaker_5': 'binding, and that we ask development services to bring back to the Council an additional area to be considered at a future date. Hopefully, if you can get the input in time August 11th, but that we would still I'm sorry, August 10th, eighth, eighth, August 8th.'",
        "'speaker_5': 'Thank you. Tuesday, August 8th. There is a great opportunity the Tuesday before in neighborhood night out to potentially gain some of that input because the community will be activated and available. And so hopefully that would be possible. But I also don't want to one, miss out on a deadline or to rush an important process that I know'",
        "'speaker_5': 'you've been working on for eight months. So my friendly would be to approve the report as it stands today with an expectation of an amendment to this council. Quickly, hopefully. August 8th.'",
        "'speaker_9': 'I accept. That's wonderful. I think I accept that. Definitely I do. You know, I want to recognize that. I think it was last week we had a briefing to discuss. I'm sorry. I'll accept it. And then any other comment, Stacy, before that?'",
        "'speaker_5': 'That's all. I don't want to hold up any of the others. And as stated by Ms.. Bodak, just because those areas are highlighted doesn't mean all the funding goes to those areas. And I do respect that. Vice Mayor Richardson wants to highlight another area as a part of a greater citywide strategy.'",
        "'speaker_5': 'But to do that appropriately, I worry that it might take longer than the deadline, but I'm opening that window that it's possible that work for everyone.'",
        "'speaker_0': 'In the city staff. I'm comfortable with it. If we can have that discussion before, that's something we can do.'",
        "'speaker_8': 'I don't know if we'll be able to come back by August 8th in either situation.'",
        "'speaker_0': 'So let's keep let's keep going in. This could keep the conversation going. Councilmember Patricia, next.'",
        "'speaker_9': 'Yeah, I wanted to, you know, set the friendly with the recognition that you guys have been doing. The you guys have been doing the work. You've had the meetings with us. Hold on. I'll wait for everybody.'",
        "'speaker_6': 'It's okay.'",
        "'speaker_9': 'Sorry, ma'am. It's okay. I know it's an active topic, which I think demonstrates that sometimes we have briefings with staff and it kind of comes in and it's like, this is what we're doing. And not to take away from all the work that staff has done in your leadership, with your staff and direction that you've given them'",
        "'speaker_9': '. But when there's areas like vice mayor, as mentioned, that we clearly care deeply about, sometimes there is a there's trying to understand where do we have input early on in the process and where are we best partners with you?'",
        "'speaker_9': 'And so and able to be that best partner with you early on will keep us from feeling like we now all of a sudden, oh, there is a decision that we could have had an input on earlier. And so again, really echoing that, particularly with with strategies like this, that we really need to be partnering ahead of'",
        "'speaker_9': 'time. And so I'll accept definitely the the friendly. But you know, I think the vice mayor and everybody else's has done a lot of work on this. So as much as we can get approved right away and make those amendments and that we are constantly having those conversations on, are there other amendments and things that we can'",
        "'speaker_9': 'be looking at to make sure it's aligning with other strategies that we're already working on and that we feel comfortable with so we can go back to our constituents. So, yes, thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. And Ms.. Burdick, if you have already explained this and I missed it, please forgive me. But the addendum or amendment process that you were speaking to, can you walk us through what that that is and how that looks like with what that would look like in terms of a timeline?'",
        "'speaker_7': 'We would I'm inclined to support the friendly on the floor that that would allow us to approve this document this evening or the plan this evening and then move forward with that. But I'd be full, a lot more comfortable if I knew what the process was.'",
        "'speaker_5': 'Right.'",
        "'speaker_8': 'So we would like to be able to submit this to HUD and then work closely with you and the vice mayor and any other council members that are interested in re addressing this. We would actually have to have a public hearing to do an amendment and it would be actually be called an amendment to the con plan'",
        "'speaker_8': 'and our 2018 action plan. If you notice on your recommendation tonight, as I said earlier, there are two amendments to the other action plans because we are moving budget from one item to another and that's considered an action plan.'",
        "'speaker_8': 'So it is procedural for us to do that. It's not too difficult. It's just a little bit time consuming, particularly when there is neighborhood outreach. I do want to address one question that was asked earlier. We did reach out to College Square and Star King neighborhoods in particular and did get survey results back from them.'",
        "'speaker_8': 'So that does.'",
        "'speaker_6': 'Those were the two groups that we were working.'",
        "'speaker_8': 'With in that northernmost area.'",
        "'speaker_7': 'Okay. And the last part is, obviously, there are areas that I'd like to see addressed in my district that I think would be great, particularly in those red zones in terms of neighborhood space, placemaking. And there was a I think I lost my thought.'",
        "'speaker_7': 'There's talking going on there area. What do you want to do? Just go to school. Okay.'",
        "'speaker_0': 'I mean, we all have areas that we'd like to address.'",
        "'speaker_7': 'But again, I'm looking at that and having a better understanding and getting a better understanding this evening. I think it would be good. And I would also just say that dealing with the unknown variables in Washington, D.C., dealing with HUD today, I don't think it would be wise for us to to push the envelope.'",
        "'speaker_7': 'Dealing with the unknown here. And I don't think I need to speak about what that is in the administration. Remember, Ben Carson is the guy who's going to ultimately approve this.'",
        "'speaker_0': 'Thank you. Before we get to Customs, I have a question. So in terms of the process, we're an amendment process, and I'm inclined to go that direction if if it makes sense. But have we considered what it takes to actually get an extension from her?'",
        "'speaker_0': 'What is that process?'",
        "'speaker_8': 'We actually tried to get an extension last year on our assessment for fair housing and.'",
        "'speaker_0': 'And they didn't go well.'",
        "'speaker_8': 'We did not get an extension for our employees.'",
        "'speaker_0': 'Not looking.'",
        "'speaker_1': 'Good.'",
        "'speaker_8': 'And that was in December of 20 1716, excuse me. So it was a different administration and we still did not get the.'",
        "'speaker_0': 'I get it. I get it. Okay. So next we have Councilmember Braga.'",
        "'speaker_10': 'To follow up on. That is the amendment that we would make if we were to go ahead and say, let's move forward and we had an amendment, when would that take place or what would be the the timeline on that?'",
        "'speaker_8': 'When we felt that we have addressed all of your questions, we would schedule an amendment to come back to city council.'",
        "'speaker_10': 'But it's got to be before August 15th.'",
        "'speaker_8': 'It will not be before August 15th.'",
        "'speaker_10': 'Okay. So then there's there's an opportunity then for us to readdress our concerns or to express our concerns and added to the document as an amendment when it's to the original document. Yes. Okay. Because I do have obviously questions, as Councilmember Austin mentioned to you, I have concerns about the outreach in my West Palm Beach area as'",
        "'speaker_10': 'well. I mean, so it's like I mean, we all have these little pockets of neighborhoods and associations and and community based organizations that have not did not reach out to me saying that we were reached out about this these these CDBG funds.'",
        "'speaker_10': 'And so, like, I was not aware that there was anything going on, but yet because I was not aware, I wasn't able to reach out to them and say, this is coming up, please respond and and participate in this evaluation.'",
        "'speaker_10': 'So if we can do this, I mean, we're sort of backtracking a little bit, but I would rather backtrack a little bit and get it right and move forward and get it wrong.'",
        "'speaker_0': 'Thank you, Councilmember. So now before we wrap this up, so just to restate, so we're moving forward with the document today. We will ask for staff to begin a discussion around an amendment relatively soon, let's say within the next six months request an amendment.'",
        "'speaker_0': 'You think that's realistic?'",
        "'speaker_8': 'It will be far sooner than six months.'",
        "'speaker_1': 'Yeah. We will be engaging.'",
        "'speaker_5': 'With your.'",
        "'speaker_0': 'Office. We should rush it. We should do sincere. We shouldn't rush it. We should do some sincere engagement. I don't think we're asking you to go double the size of everything we have on there. What we're talking about here is some adjustments, right?'",
        "'speaker_8': 'Understood.'",
        "'speaker_0': 'Some adjustments. Look at maybe some input or value that we could add from the council's perspective. And I'm very comfortable with with that amendment process. So so it has my support. So as any public comment on this on this item.'",
        "'speaker_0': 'Seeing no members. Please cast your vote.'",
        "'speaker_10': 'Before we get we had a city attorney.'",
        "'speaker_0': 'It seems only want to restate.'",
        "'speaker_10': 'Emotionally the the motion as I understand it with a friendly from the fifth councilmember from the fifth district is that.'",
        "'speaker_0': 'All our CDBG we.'",
        "'speaker_10': 'Would adopt the motion as staff recommended and adopt and and bring back a proposed amendment. And as you would the vice mayor just stated, within a time reasonable time frame, including public outreach.'",
        "'speaker_0': 'All right, members, we thank you both. Thank you.'",
        "'speaker_6': 'Washing cars.'",
        "'speaker_0': 'Thank you.'"
    ],
    "Contracts for As-Needed Citywide Fencing Services.": [
        "'speaker_1': 'All right. We are.'",
        "'speaker_0': 'On to what item on on next.'",
        "'speaker_1': 'Year?'",
        "'speaker_0': '31 item 31, please.'",
        "'speaker_6': 'Item 31 is a report from financial management. Recommendation to award three contracts for.'",
        "'speaker_11': 'As needed.'",
        "'speaker_6': 'Citywide fencing for a total annual aggregate amount not to exceed 1 million for a period of three years citywide.'",
        "'speaker_0': 'Thank you. As a staff report.'",
        "'speaker_1': 'Yes. One from business licenses. Good evening, honorable vice mayor and council members. The item before this evening is requesting approval to enter into contracts with various Ensign companies for as needed, permanent and temporary fencing services. These services include furnishing materials, parts and labor for as needed installation of permanent and temporary fencing, removing of old fencing and altering'",
        "'speaker_1': 'or repairing existing fencing. A throne. The local fencing vendor will service the temporary fencing needs of the city. And quality will be the primary vendor for all other fencing services, as will be awarded as a secondary vendor for permanent fencing services.'",
        "'speaker_1': 'The award represents the combined annual requirements as estimated by various city departments authorizing multiple contracts with ensure that the city departments are able to receive service for repairs and large scale fencing project projects in a timely fashion. The approval of this recommendation will also provide for continued support to our local economy by assisting in the preservation of'",
        "'speaker_1': 'employment for 12 full time employees residing in Long Beach. That concludes my presentation. I'd be happy to answer any questions you may have. And Vice Mayor, I apologize. I didn't introduce Mark. Admiral, our purchasing agents. Thank you, Mark.'",
        "'speaker_0': 'Thank you, Mark. Thank you. As any public comment on this item saying that members, please cast your vote.'",
        "'speaker_5': 'I mean, yes.'",
        "'speaker_0': 'And Stacey's a yes.'",
        "'speaker_1': 'Often. Yeah.'",
        "'speaker_6': 'Wishing case.'"
    ],
    "Rainbow Harbor Sewage Evacuation System Repair and Upgrade Project Contract Award.": [
        "'speaker_0': 'Thank you. Next we have item 32, please.'",
        "'speaker_6': 'Item 32 The Report from Public Works. Parks and Recreation is Marine recommendation to water contract to pass to sack plumbing company for the Rainbird Harbor Sewage Evacuation System Repair and Upgrade Project. For a total contract amount not to exceed 1 million District two.'",
        "'speaker_0': 'Councilman Pierce, care to speak your motion speaks that report, please.'",
        "'speaker_1': 'Tom Modica This is the project to.'",
        "'speaker_10': 'Essentially.'",
        "'speaker_1': 'Upgrade our sewage system down in.'",
        "'speaker_10': 'The marinas. It says a critical system that is at its point where it needs to be replaced. So we've been out to bid a couple of times. We're lucky to have a really good contract here and looking forward for approval from the council.'",
        "'speaker_0': 'Thank you. Public comment on this item. Single member. Please cast your vote.'",
        "'speaker_6': 'Oops.'",
        "'speaker_0': 'Well, a motion fail. Let's do that again. I think we broke the Internet.'",
        "'speaker_8': 'Okay. All right.'",
        "'speaker_1': 'All right.'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'Let's just do a can we just do a hand vote? All in favor. Raise your hand, please.'",
        "'speaker_6': 'Any oppose motion carries.'"
    ],
    "Bellflower Boulevard Improvement Project Contract Award and Funding Increase.": [
        "'speaker_0': 'All right, let's reset the screen, please.'",
        "'speaker_6': 'It's two nine.'",
        "'speaker_0': 'And bring up item 33, please.'",
        "'speaker_6': 'Just for the 30 3 a.m..'",
        "'speaker_5': 'Quick read 30.'",
        "'speaker_6': 'Item 33 is a report from Public Works. Recommendation to Award a contract to SIEGEL Contractors for Street Improvement on Bellflower Boulevard between Pacific Coast Highway and Atherton Street for a total contract amount not to exceed 1.9 District three and four.'",
        "'speaker_0': 'Councilman price care if this item.'",
        "'speaker_8': 'Is there. Staff report.'",
        "'speaker_1': 'Shawn Crombie Good evening Mayor Council. I'm 33 six to work construction to sequel contractors in the amount of 1.965 million. The project will rehabilitate Bellflower Avenue between Pacific Coast Highway and Atherton Street. Protected bike lanes will be added as part of the project and we're funded with 397,000 and bicycle grant funds.'",
        "'speaker_1': 'I'm available to answer any questions that you have.'",
        "'speaker_0': 'Thank you for coming on side of me.'",
        "'speaker_8': 'I have a question. Would you be willing to reconsider the green on the bollards? White bollards? Maybe. Now it's green. Purple. I had to ask you on the record.'",
        "'speaker_1': 'Green ballots are the choice to represent bike lanes, and this area is going to have bike lanes on it. So green is what the standard would be.'",
        "'speaker_8': 'I'm hearing that's a soft.'",
        "'speaker_5': 'No.'",
        "'speaker_1': 'Very soft.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'All right. Kate Lewis next. Councilmember.'",
        "'speaker_1': 'Oh, yes. If Mr. Crombie would like to explain and we've had this conversation, so I know what you're going to say, but for my constituents and I think a lot of them are probably still watching tonight. If they're wondering how the separation, the bike lanes work at the driveway of the YMCA and the restaurant, and then across'",
        "'speaker_1': 'the street, the medical building and the gas station, there's actually no separation of the bike lane at that point. Cars will be able to cross over. So really, the the bike lanes, the protected bike lanes stops at Dalton Creek, which is the border between the third and the fourth.'",
        "'speaker_1': 'That's correct. The protected bike lanes do have brakes at intersections and at all crossing driveways. And so that would be the case here. It would stop short of the intersection. Okay.'",
        "'speaker_0': 'Thank you. Thank you, Councilor Mungo.'",
        "'speaker_5': 'I want to thank the public works department. I know that the bike lanes in my district are also not as popular. And to Councilman Price's comment about the color of them. I will say that I did a little bit of additional research after the green was so firm from public works and all the ones that are in'",
        "'speaker_5': 'L.A. that are white. They look terrible. They actually don't maintain very well. They're the worst looking bollards you've ever seen. The green actually maintain their color better even against fading. And people who do hit them, which we're glad they hit those instead of the biker.'",
        "'speaker_5': 'So while Green can be alarming, then there are there are other setbacks. The only thing I would recommend is that they're not as close together as they are right now, even when I'm biking inside them, which I've done now a few times to get to dinner and kind of experience it, I don't know that the density of'",
        "'speaker_5': 'every however many feet apart they are is as necessary. If we could spread them out a little further, we'd save some funds and perhaps not be as alarming to the drivers.'",
        "'speaker_1': 'I would say that.'",
        "'speaker_7': 'We're refining the design of the of the protected.'",
        "'speaker_0': 'Bike lanes, looking at things like spacing to.'",
        "'speaker_7': 'Try to make it more.'",
        "'speaker_1': 'Appealing.'",
        "'speaker_0': 'Thank you, Councilmember Super. Now, once again.'",
        "'speaker_1': 'Thank you, Mr. Crump. I would hope that public works can reach out to Cal State Long Beach. I know they have some construction projects that are about to start. One is a sewer project on Earl Warren Drive that will redirect busses in this area.'",
        "'speaker_1': 'So I think that's your standard operating procedure, is to reach out to the university and make sure your construction projects don't conflict.'",
        "'speaker_0': 'Okay. Any public comment on this item saying members, please cast your vote.'"
    ],
    "Long Beach Blue Line Signal Prioritization Project Contract Award and Funding.": [
        "'speaker_6': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item number 34, please.'",
        "'speaker_6': 'Item 34 is reported for public works. Recommendation two What a contract to Aldridge electorate for Long Beach Blue Line Signal Prioritization Project four Total contract amount not to exceed 2.3 mil. District 126789.'",
        "'speaker_0': 'Thank you. And I made a motion so I can speak up on this one. You know, I'm really excited about this one. We get not just synchronization of the blue line, but we get Atlantic Avenue all the way up to the 91 from downtown, all the way up to 91, seeing signal synchronization that's going to do so'",
        "'speaker_0': 'much to improve the flow of traffic on Atlantic Avenue and for the blue line. So good job, city staff. Councilwoman Gonzalez.'",
        "'speaker_11': 'Yeah, same thing. Great job. This is just more improvements, more efficiencies. It's wonderful.'",
        "'speaker_0': 'Thank you. Thank you. And you know, if you want to have a brief, brief staff report, please. Are we good? Okay. Councilman Pierce.'",
        "'speaker_9': 'Super exciting, I believe is going to shave off like 10 minutes of a trip from downtown, which is huge. So just rah rah.'",
        "'speaker_0': 'Yeah, fantastic. Great. Well, thank you so much. Is there any public comment on this item? Senior members, please cast your vote.'",
        "'speaker_6': 'Anyone keeping track. Wishing Karis.'",
        "'speaker_0': 'Thank you. And so I believe that it satisfies our agenda. So now we have our second public comment period. Members of the public would like to address the body. Please come forward. You have 3 minutes sing. No public comment.'"
    ]
}