{
    "Donation to Care Closet LBC and Budget Transfer from Citywide Activities to City Manager.": [
        "'speaker_2': 'Fantastic. Thank you. Let's take on the fund transfer items. 18, 27, 28 and 31.'",
        "'speaker_0': 'Item 18 is a communication from Councilman Austin. Recommendation to increase appropriations in the general fund group in the city manager department by $5,000 to provide a donation to care closet LBC. Item 27 Communication from Councilwoman Zendejas recommendation to increase appropriations in the General Fund group in the City Manager Department by $2,000 to provide a donation to the'",
        "'speaker_0': 'Long Beach Blues Society. Item 28 is a communication from Councilwoman Zendejas. Recommendation to increase appropriations in the General Fund group in the City Manager Department by 2500 to provide a donation to L.A. Wine Fest. An item 31 is a communication from Vice Mayor Richardson, Councilwoman Zendejas and Councilwoman Allen.'",
        "'speaker_0': 'Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $1,500 to provide a donation to the College Square Neighborhood Association in the amount of $1,000 and love beyond limits in the amount of $500.'",
        "'speaker_2': 'Thank you for moving in. Second, is there public comment?'",
        "'speaker_4': 'If there are any members of the public that would like to speak on item 1827, 28 or 31? Please line up at the podium. If there are any members of the public in the room, please raise your hand by dialing Star nine now.'",
        "'speaker_2': 'Thank you. Please come forward. You recognized.'",
        "'speaker_5': 'Hi. Gentle counsel people. My name is Bridget Jones. I am the PTSA president at Wilson High School and most recently, Golden Oak Service Award recipient, which is an award given to people who donate a significant amount of their time to work the welfare of youth in schools.'",
        "'speaker_5': 'I only say that to just give some background. I'm actually here on behalf of the L.A. Wine Festival. I also am the event coordinator for that event. I am imploring, begging and will get on my knees for other districts to through nine to please contribute to that event.'",
        "'speaker_5': 'It is an event that encompasses all nine districts. As far as volunteers and businesses are local businesses, we are a event that want to be a staple to the city, just like the Grand Prix. This is our third year.'",
        "'speaker_5': 'We have a record of having at least 3500 visitors that encompasses residents and tourists, which is boosting economic development within our city. We want to encourage that. We want to encourage people to not be afraid to come out and fellowship with one another.'",
        "'speaker_5': 'So I beg that those funds are relief and that other districts contribute to that event as well. I think I spoke to Mr. Richardson. I've sent emails to all of the districts and I beg you, beg you, please contribute.'",
        "'speaker_5': 'Because the city fees rose 40% from last year. It was a phenomenal event if you've ever been there. And it just really encompasses what we are as a city. We foster businesses and encourage them to grow. And it is a great networking event.'",
        "'speaker_5': 'We didn't have any problems with the police or any belligerence or anything like that. So I implore you, other districts to please release, approve and relief funds, hopefully in the amount of $1,000 per district to just help us out to make that a staple in this city.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'It's than I can say, sixth District speaking in support of Mr. Duke Gibbons of the care closet. I think I don't know if you've been living under a rock or oblivious to the work of the man, but he's doing exemplary work in the streets.'",
        "'speaker_3': 'A son of the sixties might like myself, but, you know, he's ventured to other parts of the city with his work. But, you know, it's it's amazing to see someone, a native of this city, create an opportunity for a lot of the houseless population to have dignified work and opportunities for themselves.'",
        "'speaker_3': 'And living adjacent to Pacific Avenue. I know that they have that contract now and they've been helping a lot with it. So I just want to thank the councilman on the eighth District office for helping with that. And I also wanted to come and speak in support of Ms..'",
        "'speaker_3': 'Malika Chris of love without limits. It's very few people who are really engaging with our youth and coaching and counseling them with recognizing some of the rigid, you know, hardships that a lot of the communities that our youth are at risk opportunity youth are coming from.'",
        "'speaker_3': 'And she's now based in the central facility at Kings Park. I think so, our councilwoman. And, you know, they're doing phenomenal work with the people and a lot of the other public schools in the area. So I just always am in favor of showing love and light to those that are really impacting the community that I come'",
        "'speaker_3': 'from. So thank you.'",
        "'speaker_2': 'Thank you. That concludes public comment.'",
        "'speaker_4': 'That concludes public comment for these items.'",
        "'speaker_2': 'Thank you. With our roll call vote, please.'",
        "'speaker_0': 'District one, district two.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District High.'",
        "'speaker_5': 'School.'",
        "'speaker_0': 'District six I. District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District eight. High District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Motion is carried.'",
        "'speaker_2': 'Thank you. Let's handle general public comment.'"
    ],
    "Food Safety Program Overview and Recommendations.": [
        "'speaker_4': 'That concludes public comment.'",
        "'speaker_2': 'Thank you. Now we'll move forward with item 19, please.'",
        "'speaker_0': 'Communication from Councilwoman Allen Councilman's and Diaz. Vice Mayor Richardson Recommendation to request city manager to work with the Health and Human Services Department to provide an overview of the food safety program, education and enforcement at food facilities.'",
        "'speaker_2': 'Thank you, Councilwoman Allen.'",
        "'speaker_6': 'Yes, thank you, Vice Mayor. I brought this item in response to some concerns that I have heard raised by restaurant owners in my district and which I know they have also been echoed elsewhere in the city. There are 2200 operators in our city and that's a huge number.'",
        "'speaker_6': 'These operators are small business owners, families, community partners. They are also donors who support youth sports leagues, neighborhood associations and their innovations in food and their continued presence in Long Beach are helping drive the city's economic and the tourism resurgence.'",
        "'speaker_6': 'Over the past two years, restaurants and caterers in Long Beach and across this country has suffered challenge after challenge. And it's become apparent that there is a disconnect here. So I would like us as a council to ask the health department to update us on their processes, especially with sidewalk vending and food truck regulatory processes starting.'",
        "'speaker_6': 'We must reassure the brick and mortar operators that fairness is is top of mind. We also ensure that fairness is the starting point for inspections and for regulations for both brick and mortar and for the mobile food facilities.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Sara.'",
        "'speaker_0': 'Yes. I just want to add my support to this item. This is a great item, Councilwoman Allen, and thank you for council members and Dana and vice mayor for signing on. I just want to reiterate how important it is to make sure there is clarity around the education and process, as we do want to consider how we're'",
        "'speaker_0': 'doing and ensuring everyone has the appropriate information to do business because that's really what we want to make sure we do, is ensure our businesses are successful, that they're not limited or hindered by some of these process if we are able to make them available and clear, especially for our sidewalk vendors as we're going to be moving'",
        "'speaker_0': 'through with our state legislation process and other ways that we're going to try to make sure we support their business as well as our brick and mortar. So just support this item. Great item.'",
        "'speaker_2': 'Thank you, Councilwoman Zendaya's.'",
        "'speaker_5': 'Thank you and thank you to Councilwoman Allen for bringing up this very, very important item. I think it's very important that we really look at how we can help our brick and mortar businesses that that are serving food.'",
        "'speaker_5': 'I think that in the last few years, it has been really hard, and that's only an understatement. And if you're a business owner out there, a restaurant in this town there, you know that that is very true. And one of the things that I think is important is for all of us to be on the same page'",
        "'speaker_5': 'and understand that there's certain things, certain processes that that our brick and mortar businesses have to go through. And with those processes can be then one of the things that's very important to me and why I support this item very much is that a lot of those fees sometimes hurt our businesses instead of helping them.'",
        "'speaker_5': 'And one of the things that we really want to do is be able to help these businesses, especially because if they thrive, all of our communities thrive. So very, very happy to support this side of things. Councilwoman.'",
        "'speaker_1': 'Thank you. You have emotion and a second believe there's no additional comments.'",
        "'speaker_4': 'If there is a.'",
        "'speaker_1': 'Common.'",
        "'speaker_4': 'Yes, there are any members of the public that would like to speak on item 19 in person. Please line up at the podium there. Any members of the public that would like to speak on item 19 in Zoom, please use the raise hand feature or dial star nine.'",
        "'speaker_4': 'No. In person.'",
        "'speaker_3': 'You know, I'm going to have to give Mr. Supernova's props, because I think that that nine one vote sorry, eight one vote that we had the other day was prophetic. We're going to have issues. City of Los Angeles is already starting to hunker down on the health and sanitary conditions of a lot of the vendors.'",
        "'speaker_3': 'It doesn't really make sense. I pay for a city license, a business license. I operate a storefront. I don't think it's fair for a lot of us in terms of preparation. What we have to deal with in comparison to the lack of those type of standards being applicable to people just because they're outside.'",
        "'speaker_3': 'I think that I want to be fair and courteous to the communities that those come from. But, you know, speaking from personal experience, you know, my grandmother almost died from a E.coli experience that she had with a sidewalk vendor.'",
        "'speaker_3': 'And so it's not to say or to cast that a shadow or a cloud on everyone. But, you know, I know if there's no operator health person going to every single thousands of people who are operating throughout the city and inspecting if they have a side thing or, you know, if they're up to standard.'",
        "'speaker_3': 'So there needs to be some type of byline that we can all bridge about because when liability is concern, I'm sure the city knows that it always lands in the lap of, you know, the general fund. So hopefully we can come to some agreement about what sanitation looks like for food preparation.'",
        "'speaker_3': 'And you know what? What's the future to be? Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Cipriano.'",
        "'speaker_2': 'As long as Mr. Can for a reference meeting, I thought I should go ahead and speak. I know we have staff here, so if I could ask a question about health inspections now. It's my understanding that the health guidelines are established at the state level.'",
        "'speaker_2': 'If there's that if there's a training component locally, would that not have to be state driven? And if there's not an answer for that because you haven't looked into this yet, I completely accept that. But to my way of thinking, I didn't understand how a local health official who is burdened with making inspections would have the time'",
        "'speaker_2': 'or the authority to train individual operators in restaurants.'",
        "'speaker_0': 'Good afternoon, counsel. I'm from. My name is Morgan Warfield. I am with the Environmental, Health, Health and Human Services. I'm the operations officer. Thank you for having me here. The training does come from the state, either from California, Department of Health or sometimes from FDA.'",
        "'speaker_0': 'We have a standardization that is overseen by FDA. We also provide training every time that we have interaction with our food establishments, either it's from the owner or from the manager or any of the employees within the establishment.'",
        "'speaker_2': 'Okay. Thank you for that. And that's my understanding that what training comes about, then it's incumbent on the operator of the restaurant to go ahead and train staff. So based on that and the fact that I have not received any complaints from restaurant tours, that I will not be in support.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. There is a motion and a second. Members, please go and cast your votes.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'Oh, I'm sorry. We actually need to do roll call. We have two folks that are virtual. So remarkable.'",
        "'speaker_0': 'District one. Right. District two i. District three. My district for NE District five. By District six I District seven, my district eight, our district nine high. Motion is carried eight one.'"
    ],
    "Disbursement of Direct Relief Grants for the LB Recovery Act.": [
        "'speaker_1': 'Thank you. Next, we're going to do item 21, please.'",
        "'speaker_0': 'Report from City Manager Recommendation to authorize City Manager to disburse direct relief grants for the Long Beach Recovery Act program citywide.'",
        "'speaker_1': 'We have a motion in a second, but I want to let this staff give us a presentation on this. Meredith Reynolds are especially happy the city manager can give a presentation.'",
        "'speaker_0': 'Community. Mayor, Member City Council. Tonight's item for you is an administrative item really focused on the ability to distribute our direct grants as a part of the Long Beach Recovery Act. The Long Beach Recovery Act that was adopted by city council in March 16th of 2021, provided for a variety of these programs that allow for direct relief'",
        "'speaker_0': 'grants for businesses, for arts groups and several others at that particular time. That did not include the adoption of that plan, did not include some of the administrative actions necessary to actually physically distribute those grants. So that is what is before you this evening in particular, the directory of grants were posted in previous months and the some'",
        "'speaker_0': 'of the business grants just closed on Monday. And we have some additional nonprofit grants that are closing in a month. And so this provides the opportunity to be able to distribute those swiftly to those who have who have been applied and who have been selected.'",
        "'speaker_0': 'So there's no fiscal impact associated with this action. This is an administrative action allowing us to distribute those grants. I'm here for any questions. Should you have them? Thanks very much.'",
        "'speaker_1': 'Let's move, Richardson.'",
        "'speaker_2': 'Thank you. This is an incredibly important I know a number of folks have signed up for these relief grants. Congratulations to the whole team and the economic development team for going out and doing the outreach so that people can get these grants in their hands.'",
        "'speaker_2': 'So are we talking about all of the grants are finally ready to direct relief, like the restaurant, the personal service and fitness, the small business relief grants?'",
        "'speaker_0': 'Vice Mayor That's correct. So the direct relief grants include a variety of those that you mentioned, and shortly they will also include the nonprofit grants as well as the arts grants.'",
        "'speaker_2': 'Okay. So the small business are ready to go, the restaurants and the bars, and then afterward will be the nonprofits and some of the others. How far along is the the difference in time.'",
        "'speaker_0': 'From the difference in time? The nonprofit grants were just extended by a month to give folks more time to those close. June 15th and the arts grants have a variety of deadlines here and the coming month.'",
        "'speaker_2': 'Thank you. Well, this is certainly well received. We look forward to getting these resources out to help support our recovery. Thanks.'",
        "'speaker_1': 'Councilman.'",
        "'speaker_0': 'Screw you, Mayor. I just want to thank Miss Reynolds for going into this role so quickly and being able to get this process set up and disbursing it as quickly and as organized as possible, given the time limit and the amount of process it takes.'",
        "'speaker_0': 'So and I look forward and receiving an update because we know this is a special one time fund that we don't get and we look to seeing. I look forward to seeing the impact that we have in our recovery efforts.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_1': 'Thank you. You're probably coming here.'",
        "'speaker_4': 'If there are any members of the public that would like to speak on item 21 in person, please line up at the podium in Zoom. Please use the raise hand feature or dial star nine now in person. Your time begins now.'",
        "'speaker_3': 'Soon I can face six district residents. I would love to know what respect to the nonprofits. What are the current deliverables for one, and what does the audit look like? Because to my understanding, I have no disrespect intended, but you know, I don't necessarily agree as a taxpayer that the federal war chest should be distributed out to'",
        "'speaker_3': 'people who aren't doing work in the communities. And a lot of these nonprofits, when COVID happened, suddenly emerging communities and speaking towards a neighborhood that they weren't president up until, you know, billions of dollars of federal money became available.'",
        "'speaker_3': 'So I'm just lacking the understanding of how can we as a city discern who is doing the work and who is and how can they prove it? And the second part that I would like to ask, especially with respect to nonprofits, is, you know, the fiscal language.'",
        "'speaker_3': 'A lot of people are familiar with people who are doing service in communities and as a result, they get left behind. I'm speaking specifically towards people who don't have five own fees, who operate in community. So I just would like to understand how is the city bridging the gap of disbursing funds that makes no impact on our'",
        "'speaker_3': 'general fund to these types of providers who are operating in a community who don't have five agencies, because there's a lot of organizations in neighborhoods and communities that don't have the fiscal sponsor who's going to tax you ten, 15% in hand.'",
        "'speaker_3': 'And everyone else goes through or they don't have access to these right in these rooms. And as a result, they they miss out on doing more impactful work work that they are already doing anyways just for the fact that they don't have capital investment from the federal government.'",
        "'speaker_3': 'So if it's possible, is there, is there some opportunity that we can just create some type of small pipeline towards the communities that organizations in community that aren't? 501c certified? That would be great because if we can if we can have thousands of people working as food vendors with no paperwork, I'm sure we can figure out a'",
        "'speaker_3': 'way to do something similar towards our community providers. Thank you.'",
        "'speaker_4': 'That concludes public comment.'",
        "'speaker_1': 'Thank you. Just for also wanted just to thank the staff. I know this has been a lot of work in putting this all together and just grateful this money's been been organized well and going out. There's emotion and a second.'",
        "'speaker_1': 'Please do the roll call vote.'",
        "'speaker_0': 'District one.'",
        "'speaker_5': 'I'm.'",
        "'speaker_0': 'District two I. District three.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'District four. All right. District five. District six, i. District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_7': 'High.'",
        "'speaker_0': 'District nine.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'Motion is carried. Eight zero.'"
    ],
    "Resolution and Appropriation for Airport Revenue Bonds and Terminal Area Improvements.": [
        "'speaker_1': 'Thank you. We're going to move on to item 24.'",
        "'speaker_0': 'Report from financial management in Long Beach Airport. Recommendation to adopt a resolution authorizing the issuance and sale not to exceed 130 million of senior airport revenue refunding bonds. Series 2022a and B and Senior Airport Revenue Bonds Series 202 to C districts four and five.'",
        "'speaker_1': 'I have a motion but customer support on a second by Vice me Richardson. Is there any update on this from staff? We do have a staff report, if you'd like to hear it. I will turn it over to our financial management team and to airport.'",
        "'speaker_1': 'Thank you. Members of the Council. Kevin Roper, financial management director, joined by Cynthia Lewis, finance and administration manager for the Airport and Financial Management's Commercial Services Manager, Amanda Hall. The update is that if the interest rates that prevailed yesterday are still at the same level a week from today when the bonds are scheduled to be sold, then'",
        "'speaker_1': 'we'll be looking at the two series of refunding bonds generating about $15 million of debt service savings through lower interest costs over the remaining 18 years of life of the bonds being refunded about $833,000 a year in interest savings, which would be of great benefit to the airport fund.'",
        "'speaker_1': 'Now, of course, interest rates can move between yesterday and next Tuesday, especially as we've seen over the last few months. But that's the latest numbers on the refunding part. There's also a new money component series 2020 to see for the airport revenue bonds.'",
        "'speaker_1': 'That is to generate $30 million to go to pay a portion of the costs of phase two of the Terminal Airport Improvement Project. And those bonds would be 25 year bonds, as opposed to the 18 years remaining on the two bonds being refunded.'",
        "'speaker_1': 'Again, if interest rates yesterday prevail on one week from today, the all in interest cost for those 25 year bonds, the new money component would be about 4.78% versus a little over 4% for the shorter term refunding bonds.'",
        "'speaker_1': 'With that, Miss Lewis, Ms.. Hall and I are prepared to answer any questions. I can't remember. Did you have any comments?'",
        "'speaker_2': 'Yes, I do have a question and thank you for the report. Are there I've tried to follow the market here on this and it seems like the airport is looking very good in recent weeks. So congratulations on that.'",
        "'speaker_2': 'Are there other factors besides the interest rates that that factor in here?'",
        "'speaker_1': 'Certainly the health of the airport and the resumption of passenger and placements helps. The two rating agencies from which the airport and financial management sought ratings on this bond issue have affirmed the airport's ratings at a minus for Fitch and A3 for Moody's.'",
        "'speaker_1': 'Those are identical rating levels, and so those are unchanged from the last time the airport issued debt and the last time the rating agencies examined the credit worthiness of the airport. And so those ratings are being used to take into account all aspects of an airport's operation.'",
        "'speaker_2': 'And those are the reports I read. And I thought that that was an assessment that the airport is healthy and and going in the right direction. So thank you for that.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'Second.'",
        "'speaker_1': 'Do we have any public comment on this?'",
        "'speaker_4': 'If there are any members of the public that would like to speak on item 24 and person please on up at the podium in Zoom, please use the race name feature or dial start line now. See none that concludes public comment.'",
        "'speaker_1': 'Making them before we just go to a vote, I just wanted to again just commend the team at the city and broadly the airport team. I just think all the moves are making over at the airport are are really great.'",
        "'speaker_1': 'And this is obviously helps build on on the important work that we have there ahead of us. So thank you very much for everything. Please go out and cast your vote.'",
        "'speaker_0': 'District one.'",
        "'speaker_5': 'Hi.'",
        "'speaker_0': 'District two.'",
        "'speaker_5': 'Okay, whatever.'",
        "'speaker_0': 'District three.'",
        "'speaker_5': 'Hi.'",
        "'speaker_0': 'District four I. District five.'",
        "'speaker_5': 'By.'",
        "'speaker_0': 'District six i. District seven I. District eight, district nine i. Motion is carried.'"
    ],
    "FY 2022 Second Budget Appropriation Adjustments. (Citywide)": [
        "'speaker_1': 'Thank you. Next, we're going to do item. Let's do the. Actually, why don't we do the 522 budget adjustments, which is 23.'",
        "'speaker_0': 'Item 23 Report from Financial Management Recommendation to approve the Fiscal Year 2022 second Departmental and Fund Budget Appropriation Adjustments Citywide.'",
        "'speaker_1': 'Mr. Modica. A grace can provide a staff report.'",
        "'speaker_5': 'Yes. Good evening, everyone. This is graphene budget manager. Are you all able to hear me?'",
        "'speaker_1': 'Yes.'",
        "'speaker_5': 'It's wonderful. This is the second department in fine budget appropriation adjustment report for FY 22. We do these periodic budget adjustments that we bring to council to reflect adjustment or technical corrections, changes in revenue or operating conditions that require appropriation adjustments to what was adopted.'",
        "'speaker_5': 'So this is the second letter, and it contains mostly various costs that are offset by enterprise fund operating revenues, funds available or other fee revenues, costs that are offset by grants or reimbursement revenues or other technical adjustments. So that concludes my staff report, and I'm.'",
        "'speaker_0': 'Available to.'",
        "'speaker_5': 'Answer any questions.'",
        "'speaker_1': 'Thank you. Any public comment on this?'",
        "'speaker_4': 'If there are any members of the public that would like to speak on item 23 in person, please line up at the podium in Zoom. Use the raise hand feature or dial star nine now. Seen on that concludes public comment.'",
        "'speaker_1': 'Thank you. Moving on to we're going to go and jump now to ordinance 25, please.'",
        "'speaker_0': 'We need to do a roll call.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_0': 'We're talking about district one, district two, I District three. I district for my district five.'",
        "'speaker_5': 'All right.'",
        "'speaker_0': 'District six, I. District seven. I. District eight. District nine.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Motion is carried.'"
    ],
    "Ordinance Amendment on Cannabis Retail Storefront Licenses and Social Equity Program.": [
        "'speaker_1': 'Thank you. Now we'll move to the first reading of the equity social equity piece, cannabis.'",
        "'speaker_0': 'Item 25 Report from City Manager Recommendation to declare the ordinance amending the Long Beach Municipal Code relating to the regulation of cannabis, retail, storefront business licenses and the cannabis social equity program. Read the first time and later for the next regular meeting of City Council for Final Reading and adopt a resolution authorizing the City Manager to establish'",
        "'speaker_0': 'a request for proposals for cannabis retail storefront business licenses for the cannabis social equity program citywide.'",
        "'speaker_1': 'Thank you. There's a motion in a second, Councilmember Austin.'",
        "'speaker_7': 'I'd just like to get up, make sure that. That the changes that were incorporated last week are in here and hear from the city attorney on those. Those are changes of the city manager.'",
        "'speaker_1': 'Yes, we can have Emily Armstrong and Art Sanchez go through in a.'",
        "'speaker_3': 'Summary of what those major changes are that.'",
        "'speaker_1': 'We got from the council at the last meeting.'",
        "'speaker_0': 'Yeah. Good evening, Mayor. Members of the city council. So tonight we're bringing back the equity dispensary ordinance and resolution. So council at the May 10th meeting, directed staff to amend the ordinance to include restricting the equity dispensary RFP process to equity applicants verified on or before May 10th of 2022.'",
        "'speaker_0': 'Prioritizing any equity applicant that had previously been awarded to move forward with obtaining a dispensary license back in the 2010 and or 2017 lottery process, and requiring that all equity businesses maintain equity ownership for a minimum of ten years before they can transfer ownership to a non equity business.'",
        "'speaker_0': 'So that is the summary of the changes before you tonight, and I'm happy to answer any questions. Thank you.'",
        "'speaker_7': 'Thank you. So last week, I think we were poised to pass a pretty, pretty significant item in terms of one that we've been working on for for quite some time. We heard from the public and we incorporated some changes based on public comment and thoughts from the council.'",
        "'speaker_7': 'I'd like to have Mr. Mayor hear from my colleagues and in public comment. I'm inclined to support this and move this item forward. I think is it's time. You know, we've spent a lot of time on this. We've had a robust community process.'",
        "'speaker_7': 'And, you know, we met the mark in terms of expanding. I think this item meets the mark in terms of spanning retail cannabis establishments for social equity specific candidates in our city. So with that, I'd like to hear from my colleagues and from public comment, but encourage us to support this item tonight, same time.'",
        "'speaker_1': 'Thank you, Councilwoman Allen.'",
        "'speaker_6': 'I yes. I also just want to say thank you for all of your hard work on this. When I read this, you did just an amazing job and incorporating all the conversations and everything we asked for in this item.'",
        "'speaker_6': 'So I just want to say thank you. I think it's important that we stand by all of the applicants in the process that are already in the process. And I think that this program is going to be stronger for the changes that we made.'",
        "'speaker_6': 'And I look forward to seeing equity operators operating the city real quickly. So thank you very much.'",
        "'speaker_1': 'Thank you. Is there any public comment.'",
        "'speaker_4': 'If there are any members of the public that would like to speak on item 22 and person, please line up at the podium in Zoom. Please use the raise hand feature or dial star nine. Now I'm sorry, this is item 25.'",
        "'speaker_4': 'In person. You'll have 3 minutes.'",
        "'speaker_3': 'My name is James Mark. I've been in a situation to see what has been occurring from both sides of the field. I mean, I've been working with the ABC for a few years now and the past 18 months, the two years, and creating their recommendations of what social equity looks like and being from the community most impacted'",
        "'speaker_3': 'by the war on drugs, most definitely working with my community to receive social equity. And for the past year, says Emily, Armstrong has been the city's new cannabis program manager. She's been nothing short of devious, mischievous and misleading.'",
        "'speaker_3': 'And from far from equitable, in her dealings with the black community, I was a part of the creation of the social equity presentations that were presented to you on Ms.. Emily with the ABC over the past 20 months to two years, and she has not given the black social equity entrepreneur the same grace and courtesy again.'",
        "'speaker_3': 'Your recent hirings that Ms.. Ebony has just hired in the Office of Equity speaks great volumes that cannot be expressed in the form of words, but as a real life, real time testament again to her lack of cultural competency for the most harmed and impacted by the war on drugs in the city of Long Beach.'",
        "'speaker_3': 'Emily's episode ways have been very conniving and again misleading to the city council. Last week she made representations to the council and the city itself that there is a $3 million come from social equity, which she's not disclosing that house path funds have been dispersed in the in the past where administration and consulting agencies hired by the'",
        "'speaker_3': 'city have served no purpose to not one black social equity article world, but they were able to siphon funds away for services that were not rendered. Again, we are requesting a full audit towards every means of funding that was appointed or supposed to be allotted to assist black social equity entrepreneurs in moving this process forward.'",
        "'speaker_3': 'Also, we want a fully drawn out report of how those funds, the $3 million in the pipeline for social equity planning on being expended also for the records. I'm not a social equity applicant, but I remain fully engaged and will continue to support to finances with the attainment of legal council, outside social equity experts, resources, the foremost'",
        "'speaker_3': 'power of influence and every effort to receive just that equity along with the dismissal of Emily Armstrong from their position as someone who represents the black social equity entrepreneurs and its interests and its entirety. Thank you, Counsel.'",
        "'speaker_5': 'Well, great evening, everyone, with giving all glory and honor to God. My name is Marian Burrell and I am a social equity applicant within this program. I'm equity applicant number seven. So that means that I've been here for quite some time.'",
        "'speaker_0': 'I can tell you that I have helped the city.'",
        "'speaker_5': 'To implement different programs in place as seeing where the disconnect is and where we are now. I can tell you that I'm not too happy with where we are. I'm one of the applicants who were awarded one of the location grants to be able to get a facility.'",
        "'speaker_5': 'But I can tell you that I've been begging the city for years, though they had millions sitting in their bank. My facility now is in your district, District six, and I'm looking to operate a dispensary, but there's a 200 gap within the buffer of other dispensaries.'",
        "'speaker_5': 'And so I would like that buffer to be set down so that.'",
        "'speaker_0': 'Equity.'",
        "'speaker_5': 'Applicants can have an opportunity to participate within this industry. As you may have read from something that she wrote, there's only about two square miles that we have within the city to erect an equity dispensary. And so that doesn't give us much opportunity to actually participate.'",
        "'speaker_5': 'Now, for the money that actually was awarded the grant funding, it wasn't easy, as I said, to get the city to do it. And glory to God. It was only because of him and him forcing their arm to have to give out $1.6 million within months.'",
        "'speaker_5': 'And were we able to recommend to her that she give it to us so that we actually have an opportunity to participate in this game? Prior to us receiving our locations, there was only one applicant throughout years of this program being in place that has actually received licensing.'",
        "'speaker_5': 'So that speaks volumes. So I do back what James and Mark's ask and removing Emily from her position now because after conversations I see that she lacks the empathy and the understanding regarding social equity, regarding the war on drugs and what it has done to our people.'",
        "'speaker_5': 'Thank you. I'm Jillian Xavier. And to echo what LBC says, LBC stands for a land based social equity entrepreneur. Here's what's happening. Going forward. Anything happening with social equity? We want to be at the table. You have to have us here.'",
        "'speaker_5': 'We've been here since 2018. Emily Armstrong is trying to strong arm us manipulators, tie us with these invisible chains. Slave free days is over. You're supposed to help us get into the business. You're not supposed to strong arm us and tell us where we supposed to sell our business.'",
        "'speaker_5': 'I want to recommend that you immediately dismiss her. I'll have an investigation done on her because, you know, we have emails from other equity applicants where you're telling them nobody is above me. I make the decisions on who gets the grants.'",
        "'speaker_5': 'The very cocky. Right. You make the decisions. You're not for us. Look at her. She doesn't. Social equity. Nothing says she's privileged. You need to bring somebody that look like me. Look like you. You know, indigenous person, a Latina.'",
        "'speaker_5': 'Valencia. Anybody besides somebody that has no empathy for us. You can't do that. Listen, you're going to D.C. today where you're not going to D.C. because we're not going to give you your vote because we've been here since 2018 and we can't get into business because this woman has our hands on us.'",
        "'speaker_5': 'It's racism. Your ancestors.'",
        "'speaker_3': 'That.'",
        "'speaker_5': 'Walk in behind you, too, like Robert. They had a knee in our neck as well. They killed us still. How are you going to put her in charge of social equity? She doesn't understand the struggle. You hear what I'm telling you.'",
        "'speaker_5': 'So you're not going nowhere when I vote for you. Get rid of her. And then we got your back.'",
        "'speaker_1': 'Next week, replace.'",
        "'speaker_3': 'Gavin. Good evening, Mayor and City Council. I've been a social equity applicant. November 2018, I believe. I want to start off. I just want to elaborate on my five year residency point from last week. Currently, what is being proposed is a five year residency requirement.'",
        "'speaker_3': 'I believe this does not take into account the gentrification that has occurred in the city over the last 5 to 15 years. Ten years of residency is a better indicator of who has actually lived in disproportionate areas in the city of Long Beach.'",
        "'speaker_3': 'Just for your information, the City of Los Angeles has DCR social equity applicant eligibility criteria includes a ten year residency requirement to determine who is a social equity applicant. If the ordinance is not going to reflect the ten year residency requirement, at least the scoring system for the eight social equity dispensaries should provide additional points for those'",
        "'speaker_3': 'individuals that have lived in these areas for ten years or more. Thank you. Good evening. My name is Demetrius Woodard. Once again, the original lottery winner back in 2010 with my brother Christopher. Our work to Larry Balls. Back then, the fees were 14,000, 14,000 plus per per application.'",
        "'speaker_3': 'So it was roughly around $28,000 back when our very own mayor was confident of District one Rec for the chief of staff for Steve Neal. I talked my brother, my family into doing this back in 2010. To be is a good opportunity.'",
        "'speaker_3': 'You know, if it's legal, there's some that the city was offering, you know, let's do this thing right. But it was when we did this right is when everything took a turn for the worse for me and my family.'",
        "'speaker_3': 'We were raided. We were arrested. We were jailed. We were prosecuted. We were name drug kingpins of the city of Long Beach for participating in a legal marijuana operation. So we thought until the council decided to change their mind and changed the changed the law on that 5.87 back in those days, I am excited that the process'",
        "'speaker_3': 'will move forward for people that was in these lotteries and move forward in 2010 and 2017. A Lotteries, they are like what? I said I'm I'm kind of emotional. I took a toll on my family when it came raided my brother's house.'",
        "'speaker_3': 'It was nothing but my sisters and my nieces there. Not one male, not one boy. You get a welcome with guns pointed at women and children. My brother's a black man. He the gun collector. I collect cars, he collects guns.'",
        "'speaker_3': 'But when you are a person of not of color and you have two guns, you have the right to bear arms. When a black man has more than one gun. If child endangerment, that's what we get charged with.'",
        "'speaker_3': 'We get charged with child endangerment for guns that was never even open and out of the box. Once again, my name is Demetrius Woodard you may know me at the major incredible Woodard are original lottery winners back in 2010 and we remain to be moral citizens and love and the city of Long Beach my name is Dimitri'",
        "'speaker_3': 'Garwood Witter and I am Long Beach. Yeah. Hi. My name is Spencer Cruz, and I was a part of your Long Beach Collective Association back in 2017, and I felt like you guys had directly attacked a bunch of people after the lottery came about.'",
        "'speaker_3': 'And one of my my delivery was pretty much set down, and I had to sell because of the ongoing issues that I had, which were court case after court, case after court, case after police officer pulling me over as a police officer and pulled over, pulled over constantly.'",
        "'speaker_3': 'And I had damages with the city that I've failed to get any type of, uh, reciprocation from, from Charles Parkin's office directly, which I have asked numerous times for. And I just feel like it's like you guys keep doing this ongoing bias towards the city, people who have lived here for 20 years plus, and it's like constantly'",
        "'speaker_3': 'just stealing money from us. So I really hope you guys get this together because I'm really sick and tired of spending money here for no reason.'",
        "'speaker_4': 'That continues. That concludes public comment.'",
        "'speaker_1': 'That concludes public comment. I have a motion and the second I have any more comments from the council. Then we can have the roll call, please, Madam Clerk.'",
        "'speaker_0': 'District one and District two by district three i. District four. I District five. I. District six. I. District seven. By District eight. District nine.'",
        "'speaker_2': 'All.'",
        "'speaker_0': 'Motion is carried.'"
    ],
    "Support for Goods Movement Workforce Training Facility Funding in State Budget.": [
        "'speaker_1': 'Okay. We're now moving on to review the two new business items. Next, which will be 30 and 32. Item 30, please.'",
        "'speaker_0': 'Communication from Vice Mayor Richardson councilman's and ask Councilmember your UNGA recommendation to add language to the 2022 to 2023 state legislative agenda in support of the proposed 110 million allocation for goods movement workforce training facility located at the San Pedro Bay Port Complex.'",
        "'speaker_1': 'Rosemary Richardson.'",
        "'speaker_2': 'Thank you. First, I want to thank Councilmember Durango for partner me with me on this motion. I know that it's sort of timely and the May revised just came out and our state legislative agenda is coming back to the council soon.'",
        "'speaker_2': 'So this was incredibly timely to get this in front of the city council. In the state budget, there's proposed a major investment into the San Pedro Bay Port Complex, and it's for a goods, goods movement, workforce training facility.'",
        "'speaker_2': 'And we are the largest combined sea port complex in America and we have no training facility. So it's incredibly important that we as a city and as a port complex and as a state, continue to invest in the training well-being of our workforce.'",
        "'speaker_2': 'This is $110 million investment from the state in the governor's budget. It is not guaranteed. So we need to do our part to make sure that we advocate to protect those those funds. And it's a part of a larger $2.3 billion.'",
        "'speaker_1': 'Package for our ports.'",
        "'speaker_2': 'It's a significant, significant investment. And it's important, again, toward creating a resilient workforce and accelerating our are the jobs available in our port, particularly with the challenges ahead. And so I'm glad to bring this forward tonight and I encourage in I.'",
        "'speaker_2': 'Thanks so much.'",
        "'speaker_1': 'Thank you, Councilman Ringo.'",
        "'speaker_3': 'Thank you, Mary. I want to thank Councilmember Vice Mayor Richard you for bringing this forward. I think it's very important that we.'",
        "'speaker_7': 'Maintain a very effective and trained.'",
        "'speaker_3': 'Workforce. This is one of those occasions where it's a win win for everybody, and I'm glad to have to support it.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Allen.'",
        "'speaker_6': 'Yes. I also want to thank Vice Mayor Richardson and Councilwoman and de Haas and Councilmember Urania for bringing this item forward. I think that it is vital that we provide training for goods movement workers as we roll out new equipment and technologies in this space.'",
        "'speaker_6': 'Zero emissions equipment requires new skills, infrastructure and maintenance and training. Our workers in these skills of tomorrow will speed up deployment of zero emission and higher efficiency goods movement equipment. So I'm very happy to support this item.'",
        "'speaker_1': 'Thank you. Councilwoman Price.'",
        "'speaker_5': 'Thank you, Mr. Mayor. And this is a fantastic item and I'm glad to support it. I have publicly supported this and talked about it on multiple occasions. I think as we look at the transition in our goods movement industry and where we're headed as a nation in areas of technology and improvement to some of our efficiencies, having'",
        "'speaker_5': 'a facility like this is huge to get everyone trained up and skilled for the next level of technology and deliverance of services. So I think this is fantastic. I also want to just highlight the fact that that I think that it's very, very important.'",
        "'speaker_5': 'We have our Port Transportation Infrastructure Committee now. We did have a presentation from the port at one of our last meetings, and Dr. Hossa Garber talked about this facility and the excitement around this facility. I know Councilwoman Zendejas and Councilman Mongo were on that call and we got a little bit of a preview and very exciting.'",
        "'speaker_5': 'So I was happy to have been able to talk about the facility a bit there and all the great things that we're seeing for not just the workforce, but obviously the the efficiency of our port as well as the job stabilization and retention of our port.'",
        "'speaker_5': 'So this is a great item. I'm happy to support it. Thank you, Vice Mayor, for bringing it.'",
        "'speaker_1': 'Thank you, Councilmember Austin.'",
        "'speaker_7': 'Yes, obviously, this is a this is an item, I think, that we have collectively as a city council have gotten behind and pledged our support for already. I.N.S. See our government relations director here. I wanted to ask the city manager in if.'",
        "'speaker_7': 'Do currently have an item in our state ledger agenda. I don't have it in front of me. And I've been on the State Ledger Committee for for several years now. Do we already have an item that actually speaks to this?'",
        "'speaker_7': 'And I know this particular item is is us basically cheerleading in there an initiative that the governor has already put forth? And so our support of the state legislative committee or the city council would be to the legislators asking them to support this as well.'",
        "'speaker_7': 'Is that what this actually does?'",
        "'speaker_1': 'Yeah. So in terms of the agenda itself, as part of the priorities for this year, our focus statements, we do have a general statement in there around supporting port infrastructure specifically related to.'",
        "'speaker_3': 'You know, clean.'",
        "'speaker_1': 'Infrastructure and workforce development opportunities, but not specifically this project. So this would allow us to include this specific project. And then at this point in the process, we would be working directly with our delegation and the Budget Committee chairs, most likely to advocate for.'",
        "'speaker_2': 'This project.'",
        "'speaker_1': 'To remain in the budget.'",
        "'speaker_7': 'So my question is, do you foresee that anybody in our state led delegation would have an opposition to the governor's proposal to give 140 $110 million to the port?'",
        "'speaker_1': 'Do I see any of our delegation members.'",
        "'speaker_7': 'Receiving no resistance from our state legislators?'",
        "'speaker_1': 'No. I imagine that they would be supportive. I don't know for sure. All of our delegation members, but I know they're aware of the project and supportive of the port's efforts. So this would be to make sure that the rest of the legislature that's negotiating the budget.'",
        "'speaker_7': 'Prioritize this as well. Well, I'm happy to support this again. I think we've supported this year after year after year in our state legenda in a general sense, this specifies that and happy to communicate this to our state legislators.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'I want to thank the Council for their strong support here. And yes, we have generally been supportive of infrastructure. I think it's important to note the original and the original proposal was 150 million and then it went down 210 million based on discussions.'",
        "'speaker_2': 'So this is really about getting into the conversation and make sure we protect the investment so we actually have the adequate resources to deliver the facility. So thanks everyone. Look forward to an IBO. Thank you.'",
        "'speaker_1': 'Thank you. Is there a public comment on this.'",
        "'speaker_4': 'That there are any members of the public that would like to speak on item 13 person? Please line up at the podium in Zoom. Please use the raise hand feature or dial star nine now. In person.'",
        "'speaker_3': 'Good evening, Mayor Garcia, members of the council. My name is Rob. No, tough. I'm the policy director of the Los Angeles County Federation of Labor, where we proudly represent over 800,000 hardworking women and men across all industries in Los Angeles County, many of whom work and live right here in Long Beach.'",
        "'speaker_3': 'In answer to your question, Councilmember Austin, there are actually some legislators who are opposed to this. I don't want to put anybody name out there, but in conversations we've had, there actually are people who are opposed. And we really appreciate the strong support from this council tonight.'",
        "'speaker_3': 'As all of you are aware, the economic activity generated at the port is responsible for one in nine jobs in Southern California. And to put an even finer point on that statement, the overwhelming majority of the jobs at the port are good union jobs that allow workers to keep a roof over their heads, put food in the'",
        "'speaker_3': 'fridge and come home safely to their families at the end of a hard day's work. The jobs obviously include Long Shore, but they also include construction and trucking, all of which require good, honest work and all of which offer an opportunity into the middle class.'",
        "'speaker_3': 'But in order to fulfill that vision and to showcase the true potential of the port as a hub of good, unionized job creation, we have to focus on preparing the next generation of our workforce by training with the necessary skills to succeed, which is exactly what this facility aims to do if done right.'",
        "'speaker_3': 'This training facility at the port can serve as a regional asset that upskill those workers who are stuck in debt and minimum wage jobs. And if done right, this training facility at the port can target and train traditionally at risk populations like women, people of color, and our immigrant brothers and sisters.'",
        "'speaker_3': 'And lastly, if done right, this training facility can prepare or will prepare the workforce of tomorrow by training them to use new zero emission technologies that preserve our environment, while also adding to the ranks of the robust unionized workforce down at the port.'",
        "'speaker_3': 'As Councilmember Allen said. So as they say, the future begins today and it begins by securing the proposed $110 million in funding as currently allocated by the governor's budget. For these reasons, we're fully supportive of tonight's motion, and we'd like to thank Vice Mayor Richardson for bringing this forward, as well as the support of council members it'",
        "'speaker_3': 'would. UNGER And then the House for also signing onto this item. Thank you for your time. Thank you. Dave Chappelle, Third District. Just like to echo the previous speakers comments that if done right, this could be quite a asset.'",
        "'speaker_3': 'I'd like to speak in support of it with obviously a certain emphasis on not only zero emissions technologies and other ways to decarbonize the footprint of port operations, but also to preserve the current and hopefully expand the health and safety provisions as well as the current workforce kind of standards that the people who have jobs currently in'",
        "'speaker_3': 'our ports have had. I've had friends who haven't seen daylight from from inside a container ship for the better part of the past ten months because they've been busy dealing with the backlog. A lot of these workers, frankly, are concerned about automation.'",
        "'speaker_3': 'They're concerned about a lot of the plans it has and having a investment in the workforce itself and in maintaining, as we just heard, the current level of jobs and perhaps even expanding them is going to be a vital part of our economic recovery, not only in the short term, but in long term kind of regional dynamics'",
        "'speaker_3': '. Thank you.'",
        "'speaker_1': 'Thank you. Let me let me just add before we vote, this is actually a fantastic proposal. I want to also just think the both the ports on the port of Long Beach side and the Port of Los Angeles that have actually been working on this on this proposal for a while.'",
        "'speaker_1': 'And I just want to thank our Port of L.A. partners. I know this also would not be possible without them. For those that are also unaware, the facility itself is also scheduled to also not just provide all these great services, but it's actually believe half of it is on the port of Long Beach side and the other'",
        "'speaker_1': 'half is on the Port of L.A. side. And so it really is going to be a joint facility and even an even in location. And I want to thank the port team for their incredible work and really the governor for really leading this effort in making sure that the funding was and has been in place.'",
        "'speaker_1': 'And great that we're going to be supporting this officially office as part of our state package as well. So thanks to everyone involved and particularly all the workers who've been advocating for the facility as well. And with that will do a recall.'",
        "'speaker_0': 'District one. My district, too.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'Mr. three. I. District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District five. I. District six. I. District seven. I. District eight. All right. District nine.'",
        "'speaker_2': 'All right.'"
    ],
    "Accept Funds from South Coast Air Quality Management District and Increase Appropriation in Legislative Department.": [
        "'speaker_0': 'Motion is carried.'",
        "'speaker_1': 'Thank you. Next up is item 32.'",
        "'speaker_0': 'Communication from Vice Mayor Richardson, Councilman Diaz, Councilwoman Allen, recommendation to request city manager to execute all documents to accept funds from the South Coast Air Quality Management District and increase appropriations in the General Fund Group and the Legislative Department by five $5,026.25 to fund board support offset by the FY22 revenue received.'",
        "'speaker_1': 'Vice vaccinate Richardson.'",
        "'speaker_2': 'Sure. Thanks. So annually there's a transfer from HMV to the City of Long Beach to account for the cost of my board. A And this is. This represents that transfer. Thank you.'",
        "'speaker_1': 'Is there a second on this motion? Councilman Ringo.'",
        "'speaker_3': 'All this support.'",
        "'speaker_1': 'In any public comment on this item?'",
        "'speaker_4': 'If there is any members of the public that would like to speak on this item in person, please sign up at the podium in Zoom. Please use the race hand feature or dial star nine now. See none that conclude by becoming.'",
        "'speaker_1': 'Thank you. We'll do a roll call vote, please.'",
        "'speaker_0': 'District one. I District two i. District three.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'District for.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five. High District six. High District seven. High District eight. High District nine. High ocean is carried.'"
    ],
    "Resolution to Support Union Elections for Starbucks Workers.": [
        "'speaker_1': 'Thank you. We're going to go ahead and go back now to item 29.'",
        "'speaker_0': 'Communication from Councilwoman Allen, Councilwoman and has Vice Mayor Richardson recommendation to request city attorney to prepare a resolution to support fair and free union elections for Starbucks workers in Long Beach.'",
        "'speaker_1': 'Councilman Allen.'",
        "'speaker_6': 'Yes. Thank you, Mayor. I want to start by clarifying that we submitted this item on Friday prior prior to the vote totals being announced. And the Starbucks and Belmont Shore is still in the process now are preparing a union election.'",
        "'speaker_6': 'And we want to support them and we want to support all the workers across our great city. So now to get now to the to the good part, I want to say congratulations to the Starbucks at Seventh and Redondo on their unanimous ballot last Friday.'",
        "'speaker_6': 'Just great job. I know that we have Mads and Taylor here and some others are here. So thank you for being here tonight. I just want to say that your courage in defying an international corporation who has already deployed harmful and possible illegal union busting tactics is commendable.'",
        "'speaker_6': 'Our community and our council stand up for workers and for local protections. And your example will hopefully inspire workers across the city and across the region. I just want to say thank you to Vice Mayor Richardson and Councilwoman Zendejas for joining me on this item.'",
        "'speaker_6': 'I know both of you have always supported a worker empowerment. I also want to challenge our entire council to support the fundamental rights of workers to organize. With the unanimous vote on this item. I'm happy when we get to support people empowering themselves, empowering their families, and empowering their communities.'",
        "'speaker_6': 'And I am definitely personally energized by all the work that's been done by the organizers and this item. I submitted covers, but everything I submitted covers most of my thoughts. And. But it doesn't start here. A union is a tool by which workers can directly hold their distant corporate leaders accountable for good working conditions, equitable pay and'",
        "'speaker_6': 'treatment. And it directly is a tool of democracy and the empowerment of people locally. So to the brave Starbucks workers from Long Beach and Lakewood in the audience tonight, thank you for your courage and thank you for your example.'",
        "'speaker_1': 'Thank you, Councilwoman. Vice Mayor Richardson.'",
        "'speaker_2': 'Sure. Thank you. That was beautifully said, Councilwoman. I agree. I think all work has dignity and something I believe. You know, I've seen what it's like to have, you know, a parent, you know, raising a household parent with a good union job while still seeing what it's like to have a parent who works fast food.'",
        "'speaker_2': 'My mom worked at Arby's when I was in high school, and it's a big difference. And the reality is, you know, that job my mom had earlier in life as a welder on the assembly line, that job, those exist to the same sort to the same extent.'",
        "'speaker_2': 'You know, my mom had a GED when she got that job. And so there is a shift into service based work. That's the majority of our workforce now. And for someone, you know, we think of these Starbucks jobs as, hey, these are just college students are going to work here for a few months or work through a'",
        "'speaker_2': 'summer. It's just not the reality. You know, folks are baristas for for, you know, quite some time until they find a better circumstance or some people do it because they love it. But if you believe that all work has dignity and you believe that we have fundamental rights of organizing and this is a no brainer, this is'",
        "'speaker_2': 'you know, when you're down in your economy, one of the things that's always worked is being able to form a union and advocate for yourself, particularly in a downturn in the environment of an economy. And that's what this is really about.'",
        "'speaker_2': 'So I'm proud of those workers for stepping up. I know that there was, you know, a lot of controversy and pressure, but you stepped up and you advocate it for yourself and you have improved the profession and the industry because of your courage and leadership.'",
        "'speaker_2': 'And so I personally just want to say thank you. There's a Starbucks in every council district in Long Beach. And I'll tell you, you know, I like independent coffee, but I like it to be the coffee. But when you open up a Starbucks and I know those are good union jobs, I'm going to support that Starbucks as'",
        "'speaker_2': 'well. So you actually help Starbucks as well by taking this step. And so thank you so much. And I encourage and I vote.'",
        "'speaker_1': 'Thank you, Councilwoman Sato.'",
        "'speaker_0': 'Yes. I want to just thank Councilwoman Allen for uplifting our Starbucks workers who've been is the firs who are really the trailblazer in forming a union at Starbucks. You know, as a former labor organizer, I can certainly attest to how scary and how much courage and faith it takes to know that not only do your coworkers, you'",
        "'speaker_0': 'have to have your coworkers support, but the public support, too. And so this is a great item to show that the council also stand with them and they stand for work and that we stand for workers. Right. And the ability for everyone to have a safe working condition or condition, equitable treatment and fair pay.'",
        "'speaker_0': 'So I ask and I agree with Vice Mayor Richards and I have a Starbucks. No way. They don't have a Starbucks in my district anymore. Yeah, it's in the council district seven now, but there is one that does happen in my district.'",
        "'speaker_0': 'I do hope that it leads. They follow the path as well. So thank you. That's great. Thank you.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_7': 'Thank you so much. Certainly support this. This is a very easy item to get behind. For the last three decades or more, I've committed my my work, my professional work, but also my activism to organizing and supporting collective bargaining.'",
        "'speaker_7': 'And so in this particular day and age, Starbucks and other industries are now going to be unionized because people recognize the importance of having collective strength and a collective voice in a democratic process. And so I am very, very elated for the workers at Starbucks.'",
        "'speaker_7': 'I salute you, the brave individuals who stepped forth to do this. And I believe that you'll see a bold wave of support and other organizing efforts happening throughout Southern California as a result of the work that's happening here at our Starbucks here in Long Beach.'",
        "'speaker_7': 'So congratulations and certainly support this. I support, you know, fair elections and the opportunity for workers to organize without interference or reprisal or any sort of coercion from from from management. Thank you.'",
        "'speaker_1': 'Thank you. Come to me, Ringo.'",
        "'speaker_3': 'Thank you. And thank you, Councilmember Allen, for bringing this forward. And congratulations to the store workers at the store in Redondo and Seventh. I had an.'",
        "'speaker_7': 'Opportunity to meet with them before they.'",
        "'speaker_3': 'Took the vote. Certainly I was there to encourage them and thank them for their courage. It's not easy to take that type of a chance while you're still employed. We know what the ramifications have been in the past and that certainly is a bold.'",
        "'speaker_7': 'Move on their part.'",
        "'speaker_3': 'There now appears to be a groundswell of other stores trying to get that kind of union representation. And I wish them all well. And with my new Starbucks in my new seventh District, I am certainly hopeful that they will also follow suit.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_1': 'Thank you, Councilman Price.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I appreciate all the comments tonight. And this item. I especially like the comment by Councilwoman Allen and Councilman Austin regarding a free, fair and just election process and free from any retaliation or retribution. I've been public employee union member for over 20 years.'",
        "'speaker_5': 'My mother retired as a 40 year member, as a union employed with L.A. Unified School District. And I think the process should always be fair. It should not be interfered with, and people should have a right to advocate for better conditions.'",
        "'speaker_5': 'So thank you for bringing this item and for the update regarding the Belmont Shore location. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo. I'm sorry customers that they have said. Did you have your are you queued through the system? Okay. Just just cue on the on the phone system if you can, ideally. But that's okay. Go ahead.'",
        "'speaker_1': 'Councilman's in the house and then Councilman Mongo.'",
        "'speaker_5': 'Thank you, Mayor. I just also want to lend my congratulations to the Starbucks workers. So very proud of you. I really do believe that it is essential for us as city leaders to unite and work to ensure that folks are guaranteed safe working conditions and a living wage.'",
        "'speaker_5': 'Equitable pay and treatment should no longer be an exception, but rather the standard for everyone. I applaud all the brave workers who have united to have United in this effort. And in their workplace to make sure that they give them better and better working conditions.'",
        "'speaker_5': 'I strongly support this item and I strongly support all workers who wish to uphold their right to unionize. So I'm with all of my colleagues here today to say congratulations and keep up the good work. I know that that particular Starbucks has a special place in my heart because I used to live right around the corner from'",
        "'speaker_5': 'it. And I'm really, really hoping that the three Starbucks that are in my district will follow suit. That will be a very good day for me. So thank you very much. And congratulations again.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'Thank you. I want to echo the comments of my colleagues, especially about a fair and just election process. And then I also just want to shed some light on a particular but already gives that may not be of real value to a majority of Starbucks employees, but I hope that should they move forward with the unionization, that'",
        "'speaker_5': 'they don't just advocate for the needs of the many, but the few that work there as well. As an older mom, I've been in many support groups with moms who have tried to get pregnant. And one of the things that they talk about is the extreme, the high costs of the in-vitro fertilization process.'",
        "'speaker_5': 'And a lot of the costs are out of reach for families. And so moms have chosen to go back to work at Starbucks part time because Starbucks gives a very, very robust and supportive mother program for IVF and they pay for it.'",
        "'speaker_5': 'For those moms that I know, that's not typically something unions really push for because there are so few women that it is a value to. But I know that to the women who have had that opportunity, it's just something that I hope that the employees keep in mind as they move forward, that that there are very unique'",
        "'speaker_5': 'benefits that they've received through the years. And I hope they continue to advocate for those unique benefits in addition to or not at the risk of the bigger picture. Thank you.'",
        "'speaker_1': 'Thank you. Before I call public comment, let me just go ahead and just add first. I think, you know, I think the election that just happened obviously here in Long Beach in Lakewood are just incredible testament. Most importantly and almost completely fully to all the workers at these stores and the workers that are organizing across across the'",
        "'speaker_1': 'country. There's no question that the organizing that's happened has, I think, just been very inspiring to the community for certainly has been to me just to witness how the organizing happened, the backup and support they got from so many members of the community and really being able to also share kind of the experiences that led the workers'",
        "'speaker_1': 'to really demand the dignity in the workplace and benefits and fair pay and the conversation that's happening across the country, particularly around Starbucks and so many other large corporations in the country. I'll also just add as a reminder that if we want to continue to improve any workplace, the best way to do so is to form a'",
        "'speaker_1': 'union. If you want to make sure that you move forward rights at the workplace, whether they're for LGBTQ people, whether they're for women, whether they're for for folks of all ages. The best way to do so is for the workers to form a union.'",
        "'speaker_1': 'And so any time you have an organized workforce in place, you almost always have a more just workplace for those that are there. And so a huge congratulations to the workers. I look forward to this being an inspiration.'",
        "'speaker_1': 'The work that the workers have have started across the city and more broadly across the country. And I just want to congratulate them as well. And if there's any public comment, we'll take that as well.'",
        "'speaker_4': 'If there are any members of the public that would like to speak on item 29 and person, please line up at the podium. 30 members of the public that would like to speak in Zoom. Please use the raise hand feature or dial star nine.'",
        "'speaker_4': 'In person. You have 3 minutes.'",
        "'speaker_3': 'Bay District six resident I appreciate the comments of the Council, Mayor. With respect to unionization, efforts for Starbucks and the fight for workers is a fight for all. I think we all can recognize that for the most part.'",
        "'speaker_3': 'However, I would be remiss if, as both as a taxpayer in the city and as a worker in this city, that I couldn't use this very odd opportunity to reference the ongoing workers fights with the city of Lumberton itself.'",
        "'speaker_3': 'I'm speaking specifically towards the court case of the black city workers. What Medina or Twine represent representing them? I mean, it's kind of odd the idea that, you know, we're in support of workers in the private sector, but not in support of workers in the public sector.'",
        "'speaker_3': 'Black city workers are for those that are watching. You know, they have a class action lawsuit against the city of Long Beach right now. You know, I'm related to one of those people connected in that lawsuit right now.'",
        "'speaker_3': 'And so, you know, there's the L.A. Times wrote an expos about this just last year. And this is an ongoing lawsuit I'm sure everyone in this room is very familiar with. And, you know, just as much as we want you guys to come out and support in the private sector the efforts of unionization and that work, we'",
        "'speaker_3': 'also want to see the support going on with the fact that black workers in the city have been under, looked at, overlooked in promotion efforts and haven't been allowed to rise in the ranks as their white counterparts. You know, 58% are sorry.'",
        "'speaker_3': '65% of all black city workers and the city of Long Beach make under $60,000. There's there's there are price unions that are racial, not just gender rights, but racial. And until it's reflective of more positivity, relation to black advancement in the city, I mean, it's, it's, it's highly hypocritical to hear from the city as a whole.'",
        "'speaker_3': 'And so I just hope that we can do better for, you know, workers in the private sector. And I hope that we can do better for black workers here in the public sector. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_3': 'Hi there. My name's Tyler. I'm the lead organizer from the legal location and a resident here in Long Beach. I, first of all, want to thank you all for your kind words around this resolution. It means a lot to me as somebody who has had to face an extreme amount of union busting in my store while also'",
        "'speaker_3': 'supporting little Long Beach location. I really need the to pass. This has to go. We need it because it needs to stand as the shining example, both for Lakewood, for when we start organizing other stores, as well as every other store in the rest of the state, as well as the rest of the country.'",
        "'speaker_3': 'Starbucks has spent an uncanny amount of money hiring littler Mendelson, an absolutely terrible lawyer firm with a long history of union busting. And they have sidestepped the law as many times as they've been possible and have been met, obviously, with the resistance to that.'",
        "'speaker_3': 'However, the company has refused to obviously sign the fair and free election principles that we very, very need them to sign. It is integral. So again, thank you for your kind words, but this fight needs to go as big as we can make it as well.'",
        "'speaker_3': 'So passing this is integral. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good afternoon, honorable mayor and City Council. I'm Natalie Gonzalez, president of the Long Beach City Employees Union. I am a local Long Beach, 1930 and District two resident. I want to thank Councilwoman Allen and Vice Mayor Rex Richardson and Councilwoman Sun has for championing this resolution and supporting workers rights to organize here in Long Beach and the'",
        "'speaker_5': 'right to fair and free union elections. Organizing is a very work of democracy. We know that unions play a pivotal role in our communities, economy and in the quality of life for working families. Unions help workers and their communities retain the value of their labor, set boundaries with their employers, and maintain worker protections and safety.'",
        "'speaker_5': 'Quite frankly, it pays to have a union in your workplace. And so with that, a mighty congratulations to Starbucks Workers United who organize their workplace in the face of an employer who has not hesitated to retaliate against union organizers again and again.'",
        "'speaker_5': 'And yet they persisted. They succeeded. Their efforts will reverberate through our Long Beach community. I want to wish Starbucks workers united good luck in negotiating your first contract. It is a grueling process, and so I encourage you to stay vigilant and to fight for every inch Long Beach City leadership and your city employees stand behind you.'",
        "'speaker_5': 'I am excited that Long Beach City Council supports our workers so strongly. It matters. I, for one, look forward to the same kind of energy as we enter our union contract negotiations next year. But for now, this moment is for the workers.'",
        "'speaker_5': 'Congratulations. Starbucks workers throughout Long Beach and the surrounding communities to the amazing baristas fighting the good fight. Keep it up. Keep going. And we're with you in solidarity. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_3': 'Once again, good evening, mayor garcia. Members of the council. Rob no tough policy director, los angeles county federation of labor. And I'm here to speak on behalf of President Ron Herrera. When we just say that Long Beach is a union town and nobody who works full time should have to live in poverty or close to it.'",
        "'speaker_3': 'And that's what today is really about. When we talk about these brave baristas like Tyler and everybody else that he works with, they should be commended for what they're doing because it's a historic and heroic effort that they're really taking part on.'",
        "'speaker_3': 'And let me explain why. When we talk about baristas and we talk about service sector workers in general, the public oftentimes abides by allowing, assuming that they should be receiving low wages, barely above minimum wage. And despite this body really fighting to raise the minimum wage several years ago, which should be obviously commended, it's still not enough'",
        "'speaker_3': '. And what Tyler and their coworkers are doing is to make sure that they are really making forcing all of us to really challenge and rethink norms about why shouldn't a barista be able to have a living wage job?'",
        "'speaker_3': 'Why shouldn't they be able to have life saving benefits? And why shouldn't they be able to have a dignified job? So again, we applaud them for challenging norms because they're making us think beyond this. And it doesn't just start with Starbucks, but it actually moves beyond to Amazon workers and to other workers in our service sectors who'",
        "'speaker_3': 'we vitally depend on. As everybody here said, all work has dignity. So why shouldn't they receive dignified wages and a dignified lifestyle on the job? So with that said, the work is still going to be challenging. I appreciate everybody, everybody's support for a fair and free election, but we're already seeing a lot of dirty tactics being played'",
        "'speaker_3': 'by Starbucks, where they're offering new raises and benefits to the nonunion sites and saying, we can't do that for our union sites. It's already happening. So we would as we venture into the next grueling part of this, which is actually securing a real contract, that's where the rubber is going to hit the road.'",
        "'speaker_3': 'And we look forward to the support of this body because when we talk about equity and we talk about trying to transform society, it all begins in the workplace. If you want to see immigrants rights, join a union negotiating or collective bargaining agreement, if you want to see racial justice, join a union, negotiate it in the workplace'",
        "'speaker_3': ', and negotiate a collective bargaining agreement in your workplace. It all comes full circle in the workplace. So we appreciate everybody's support. We urge you all, obviously, to vote yes on this item and to the workers at Starbucks. Welcome to Union Town.'",
        "'speaker_1': 'Thank you. Before we take a vote, we just need one minute because we've lost audio or the connection with our three members that are calling in. Is that right?'",
        "'speaker_0': 'Yes. Our team is working right now to establish a connection. I believe people can hear us in the zoom. I'm not sure if we can hear them. Mary, can you still. I think we need to reestablish the audio connection if we can.'",
        "'speaker_1': 'Justin So we're going to reestablish the connection, then we'll go to the vote as soon as we get that established. Can any of the council women hear or speak right now? Not yet. Okay. So I'm just being I'm being told that the reconnection might take a minute or two.'",
        "'speaker_1': 'And so per the attorney, we actually have to pause until we get the connection on the audio. Is that correct? That is correct. Under the new.'",
        "'speaker_3': 'Rules for three, maybe 361, we were required to suspend the meeting until it's.'",
        "'speaker_1': 'Restored. Okay. So we'll go ahead and suspend the meeting till it's restored. And maybe, maybe what we'll do is we'll just take a two minute recess, apologize, everyone, but we'll take the vote as soon as it's restored.'",
        "'speaker_5': 'All right, Mary. When you think about the.'",
        "'speaker_1': 'If any other council women can hear us, can you please acknowledge?'",
        "'speaker_5': 'Yes, I can hear you.'",
        "'speaker_3': 'Thank you, Mary.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'I think that we have restored the connection. Is that right? Okay. We're going to go ahead and restart the meeting. We've restored connection. And so with that, I'm calling the meeting back to order. I believe we first need to do a roll call of the meeting and then we'll go into the roll call of the vote.'",
        "'speaker_0': 'Madam Clerk councilman's in Dallas. I sent Councilwoman Allen a present. Councilman Price. And then councilman super now. Councilwoman Mango.'",
        "'speaker_5': 'Here.'",
        "'speaker_0': 'Councilwoman Sara present. Councilmember Durango.'",
        "'speaker_3': 'Present.'",
        "'speaker_0': 'Councilman Austin. Your Vice Mayor Richardson. Mayor Yeah.'",
        "'speaker_1': 'Thank you. And now we will take the vote, which will also be a roll call.'",
        "'speaker_0': 'District one, district two I. District three.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'District four. District five.'",
        "'speaker_5': 'By.'",
        "'speaker_0': 'District six. I. District seven. I. District eight. By District nine.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Motion is carried. Eight zero.'"
    ],
    "Supplemental Memorandum - Agenda Corrections and Additions.": [
        "'speaker_1': 'Thank you. Now we're moving on to item 22, which is the charter committee recommendation.'",
        "'speaker_0': 'Report from city manager recommendation or request the mayor to convene the Charter Amendment Committee of the City Council within 30 days to discuss placing a city charter amendment before the voters to merge the existing water, sewer and gas utilities into a single publicly owned utility citywide.'",
        "'speaker_1': 'Mr. Modica. Yes. So this is the very start of a process that's going to have a lot of discussion. We are proposing that you begin the process of a charter amendment to explore this concept of moving together to a different utilities that are in two different departments into one consolidated.'",
        "'speaker_1': 'We have a short presentation for you. We will be getting much more into the detail on this when we start having the Charter Amendment Committee hearings. But I will turn it over to Chris Gardner to walk us through it.'",
        "'speaker_2': 'Thank you, Tom. What we're proposing tonight is a concept that the leaders of the utilities have contemplated for over 75 years the consolidation of the water, sewer and natural gas utilities within one city department. Tonight's vote would formally start the lengthy public process to consider putting this concept before the Long Beach voters in November of this year'",
        "'speaker_2': '. Today, the city charter separates the operation, management and oversight of the natural gas utility from that of the water and sewer utilities. Article 14 governs the water utility and Article 15 governs the gas utility. In California, Long Beach is the only large city with multiple utilities that separately operates, manages and oversees the utilities.'",
        "'speaker_2': 'Some examples of cities with consolidated utilities taking full advantage of economies of scale and flexibility. Resource sharing include. Los Angeles. San Francisco. San Diego. Pasadena. Glendale, Burbank. Anaheim, Riverside and Palo Alto. Two important actions that brought us to this point tonight.'",
        "'speaker_2': 'The Board of Water Commissioners last week unanimously approved a request of the city, the city council, to consider seeking voter approval of a charter amendment to consolidate the city's utilities. Secondly, the staff has successfully completed the necessary meet and confer process with the impacted labor associations.'",
        "'speaker_2': 'If eventually approved by the voters in November, the charter would be changed to create a single article in the charter governing water, sewer and natural gas service. It would move the gas references of Article 15 into Article 14, which governs the water department, and would thirdly provide that the utilities would be all overseen by the existing five'",
        "'speaker_2': 'member Board of Water Commissioners, likely renamed as the Board of Utilities Commission. As mentioned earlier, tonight's vote would be only the first step of several before any final decision is made to place this concept on the November ballot.'",
        "'speaker_2': 'Tonight is an action to refer this to the Charter Amendment Committee for consideration. The committee would convene two public hearings, one in mid-June and one in mid-July, at which time staff will provide a much more detailed presentation and at which time the public can participate and provide input.'",
        "'speaker_2': 'After the second hearing, the City Council would then vote in August regarding the possible placement of the utility consolidation on the November 8th ballot for the voters to make the final determination. That concludes my report. I'll be happy to answer any questions.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. I need a motion in a second on this item, please. I do have Councilman Pryce.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I'm happy to motion it. And I do have a couple of questions for Mr. Gardner. So, you know, we've gotten a lot of public input over the last week on this item. And can you talk a little bit about the cost?'",
        "'speaker_5': 'Are there efficiencies to be had with this? And can you expand on those?'",
        "'speaker_2': 'Certainly, there's any time you could mine the utilities. What you have to do is respect the differences because there's obviously differences between water and natural gas. But you also want to take full advantage of the like services and operations that we have.'",
        "'speaker_2': 'So we both have many operations that are duplicative. We have pipeline replacement. We have engineering. We have accounting, admin, human resources, payroll, all duplicated between the two different departments. And so the idea, as with every other major city in California that has dual utilities, we combine the two under one roof and take advantage of those economies of'",
        "'speaker_2': 'scale. And with that, you would save money and do things much more efficiently. We would have similar policies to that. We have different policies between gas and water. You would have the and I'll talk a little bit more about this later on when we go through the process, but you'll have much more transparency with the board of'",
        "'speaker_2': 'Commissioners taking a look at a utility focused take on everything related to the utilities.'",
        "'speaker_5': 'Okay. So is there going to be a cost saving?'",
        "'speaker_2': 'We had an independent study done in 2020. It was done by a company called Beebe, and he headed by Marci Edwards, who you may be familiar with. She was the city manager of the city of Anaheim. She also led the utilities, the consolidated utilities in Anaheim and Los Angeles.'",
        "'speaker_2': 'Her group did a study, and they estimated the first year about two and a half million dollars in savings escalating to about six and a half million by year five. Now, obviously, that that there's a lot of work has to be done before those savings can be materialized.'",
        "'speaker_2': 'But it was very encouraging.'",
        "'speaker_5': 'We increase that? Do we expect any increase in costs in while we build up the process to have cost efficiencies realized.'",
        "'speaker_2': 'We shouldn't from the standpoint that the the demand for services stays the same between the gas and water and sewer utilities. But we would certainly try and resource things. So we would be taking a look at doing what water does.'",
        "'speaker_2': 'Will we do? I'll make sure that gas follow suit and vice versa. And so there may be areas where we could expand, if appropriate, is a way that we could improve services to the customers. We would expand, but for the most part, we'd be looking at being more efficient and trying to reduce costs.'",
        "'speaker_5': 'Okay. Are there any job losses associated with this consolidation?'",
        "'speaker_2': 'No. What we've promised to the labor unions is that no one would lose their job. Any current city employee through this consolidation, what we'd be looking at doing is reducing any positions over time through through normal attrition. So just like today, when we have a vacancy that materializes because of a retirement or a transfer or someone goes'",
        "'speaker_2': 'to another job, we take a look at that position. We decide whether to fill it as it was filled before, repurpose it or eliminate the position. And so we would do the same thing over time, but no one would regard.'",
        "'speaker_5': 'Okay. Thank you. And in regards to the timing of this, you know, some folks have reached out, whether accurate or not, but but tying this proposal and the timing of it to the measure and lawsuit, is there any correlation at all between the two?'",
        "'speaker_2': 'No. As as I've said, we've looked at this and talked about it for at least four years. Seriously. It was looked at probably about ten years ago. I know it was looked at 20 years ago. Has been talked about for 75 years.'",
        "'speaker_2': 'This is something that we've wanted to do for many, many years. It's just a quirk that the city charter has it under two different governance. And so it made it much more difficult to combine the two. But we've been working with the city manager and his team to try and make this happen.'",
        "'speaker_2': 'So it has absolutely nothing to do with the measure in lawsuit.'",
        "'speaker_5': 'Okay. And then just finally, I know it's mentioned in the agenda item itself, but what are we exactly voting on tonight so that it's clear?'",
        "'speaker_2': 'So this would just be an item for the city council to refer this to the Charter Amendment Committee for consideration. And then the Charter Amendment Committee would take it up and decide whether to have the two public hearings in June and July.'",
        "'speaker_2': 'And then from that point, the amendment committee would take it to the city council in August for a final determination whether to place it on the ballot in November. So this is tonight's really just the first step.'",
        "'speaker_5': 'Okay. And so ultimately the consolidation issue is not going to be decided by this council. Ultimately, if it goes through the process, it'll be decided on by the voters.'",
        "'speaker_2': 'Absolutely. It's a charter amendment.'",
        "'speaker_5': 'Great. Thank you so much, Mr. Gardner. Appreciate it. Thank you, Mr. Mayor. Thank you.'",
        "'speaker_1': 'Thank you for having motion by Councilwoman Pryce. And consider your anger comes from your anger.'",
        "'speaker_3': 'Thank you, Mary. And I want to thank you, Chris, for bringing this forward. It's been a long time coming. As a former city employee who used to work in civil service, I was always wondering why did I have to conduct two different tests, which is basically the same for two different departments?'",
        "'speaker_3': 'And that really brings up the issue about consolidation re necessary and where they both basically do cross each other in regards to the work that they do. You left off customer services, the service reps who do the exact same work.'",
        "'speaker_3': 'So I see that the time is well, there's never a good time. I mean, timing is everything. But, you know, there's always an opportunity for bringing this forward. And I think it is about time that we are looking at this consolidation.'",
        "'speaker_3': 'I'm glad to support it. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks. I just want to note and thanks for brief my office a number of times and I got the answers to a number of my questions. I'm glad to hear that the current workforce won't be laid off as a part of this process.'",
        "'speaker_2': 'That's important and I think efficiencies are certainly important. I will raise today what I raised with you in our discussion is that as we do see savings, it's important to understand how you plan to reinvest those savings. Are we going to put more money into ensuring that our our infrastructure is strong in the utilities?'",
        "'speaker_2': 'Are we going to put money back into the pockets of ratepayers? Are we going to invest in community benefits? San Francisco does the community benefits program and their utility and the number of other municipal utilities sort of reimagine what their commitment to the community is.'",
        "'speaker_2': 'And it's not just providing utilities. Sometimes it's job pipelines, training pipelines into STEM jobs for schools and education. So if we have savings, we should think about how we can completely re-imagine the role of this this new department.'",
        "'speaker_2': 'So I look forward to additional conversations at the charter committee. Thank you. Thank you. All right. So is there any public comment on this item.'",
        "'speaker_3': 'At this time, if you'd like. On this item, Governor Richardson.'",
        "'speaker_5': 'I could as well, but I didn't do that.'",
        "'speaker_2': 'Okay. Yeah, you just got to hand it over to me right now. Council Member.'",
        "'speaker_5': 'No, I actually want to add to the comments that you made about the event that I spoke with Chris Gardner last week. And one of the areas I see of opportunity is that with this consolidation, when development is happening in our city and any user added or new construction is added.'",
        "'speaker_5': 'I would love to see a program where now that gas and water are consolidated. We want people to conserve water and we want people in low income communities to have low gas and water bills. And one of the ways that we can support that is by metering every unit.'",
        "'speaker_5': 'When you meet your every unit, you're incentivizing everyone to. Be be cautious of the utilization and usage. And so with that, I just hope that when we find these things, we'll find those apexes where it makes a lot of sense to reinvest in our low income communities and in the renter population and invest in so that the'",
        "'speaker_5': 'landlords are really in a position to make those allowances available, to add those additional opportunities at each facility so that renters can own their own destiny and not be on the food, water and fuel meter. So I look forward to that opportunity as well and I'm very supportive of that.'",
        "'speaker_5': 'I'm glad we're finding a way to save money and save resources while still maintaining our workforce and reducing the burden on our employees of overtime so they can spend quality time with their families.'",
        "'speaker_2': 'Fantastic. Thank you. Councilmember Sugano, I think you just said one question for Mr. Garner. An article over the weekend stated that the commission would be called the Public Utilities Commission, and that's not what was indicated in your presentation.'",
        "'speaker_2': 'Has that decision been made or is that still up for grabs or what's the latest that's still up for grabs? I think there may be some confusion with the California Public Utilities Commission, so we want to be careful about that.'",
        "'speaker_2': 'So we have to consider that when we do the naming of the commission. So that's certainly up in the air and open for suggestions. Okay. Thank thank you. Thank you. That satisfies council comment. Is there any public comment.'",
        "'speaker_3': 'At this time? If you'd like to speak on this item, please line up and from the podium. And if you're in the Zoom meeting, please use the recent feature or they'll start now and that will begin with in person.'",
        "'speaker_3': 'You have 3 minutes so I can face six district residents with respect to Mr. Garner's presentation of the three cities that he mentioned. There is not a single study that statistically proves what he's talking about. Consolidation and economies of scale do not.'",
        "'speaker_3': 'There is no proof that a consolidated public utilities has been led to cost saving, and there's no studies in the public, to my knowledge. We don't want monopolization of our public utilities. There needs to be an independence and disconnect between them.'",
        "'speaker_3': 'There's a reason that that was in the charter. When this comes to the ballot, I will vote against it just like many people will. If we live literally 20 miles away from the DWP gangsters and the transparency, the countless tens of millions and hundreds of millions of dollars that they've cost the city of Los Angeles and countless'",
        "'speaker_3': 'lawsuits, I don't know why we would see the model of that Chinatown and Cadillac Desert and all the pop culture references to why this is a bad idea and then say, hey, let's do that here. Like it. It doesn't work.'"
    ],
    "City Charter Amendment to Merge Water, Sewer and Gas Utilities. ": [
        "'speaker_3': 'It doesn't work. The stats the statistics show that it doesn't work. There is no proof that it leads to cost saving. When you consolidate in this in this had this hybridization of the utilities, when you consolidate them in, it actually works against, you know, there's momentary cost increases that then become perpetual.'",
        "'speaker_3': 'That's what the studies show. What consolidation? They don't actually show that things become cheaper. I can there's much scientific research that supports what I'm saying. San Diego, San Francisco and Los Angeles have all had top executives plead guilty to federal cases with respect to the transparency that comes with the consolidation of public utilities.'",
        "'speaker_3': 'So I think we should just keep it independent. I think that we should have a gas department. We should have a water department and electricity all separate. Thank you.'",
        "'speaker_2': 'Thank you. Next. Peter, please.'",
        "'speaker_3': 'Dave Shukla, resident of Third District and Ratepayer, on record for the past 25 years for the electricity account at 6333 East Eliot Street. I guess my comments are a bit different. I am curious to see this process play out.'",
        "'speaker_3': 'Specifically one that takes to the voters, uh, the seeming option of combining these two utilities without mentioning a third. And that's electricity. Uh. I'm. I spent a good deal of the past four and a half years trying to not only build out but use the nonprofit, the Long Beach Alliance for Clean Energy to advocate for the city'",
        "'speaker_3': 'taking control of its electricity destiny. Specifically, as we know, in the very short term, we have to stop utilizing oil and gas as a society that's just like coal or nuclear is something that isn't worth all the attendant costs.'",
        "'speaker_3': 'Now, there's been a lot of questions about taking on some of the less savory aspects of the way that the utilities in this environment the past 30 years concomitant with climate change. Why is it that you haven't hired a city management fellow that can hang with me on climate in the past five years from.'",
        "'speaker_3': 'I mean, what is this place? Constantly a waste of my fucking time to. For the record, I think electricity should be included as a potential utility for consolidation. One of the things that I tried to do in the city for the past two and a half years and I haven't been able to get it in front of'",
        "'speaker_3': 'the city manager or the city council is, you know, this issue of community energy, unlike the last speaker I do know of the tremendous progress that these entities, these little servicing entities have made, uh, for not only decarbonizing, uh, electricity, but also lowering costs.'",
        "'speaker_3': 'Marine clean energy has shown year after year with publicly available, you know, integrated resource documents of the kind which you don't seem to be able to provide. For what goes on in the city. They've been able to show that they can do it.'",
        "'speaker_3': 'Why the fuck can't we tell them? Now I could directly to Chris. We're John GROSS or Bob Dole, who? Both. All three of them signed on to this ridiculous. Oh, wait, let's wait a year to talk about electricity.'",
        "'speaker_3': 'Let's wait a year to talk about electricity. Honestly, I mean, I don't know what Edison's credit is. They're going to take away the rooftop solar. They're going to take away the incentives where they're going to move their headquarters.'",
        "'speaker_3': 'You know.'",
        "'speaker_2': 'Thank you, Mr. Shukla. That's for 3 minutes. But I'd like to know. All right, Mr. Schickel, thank you. That was 3 minutes. Is there any further public comment?'",
        "'speaker_4': 'That concludes public comment.'",
        "'speaker_2': 'Thank you. We'll take you back behind the rail. Councilman Austin.'",
        "'speaker_7': 'Thank you. So my question regarding this and it was prompted by by public comment, I know we currently have a water commission and this this for for the governance. Can you explain how the governance will work? Is that going to combine water and and and energy to enterprise funds to be governed by one one commission?'",
        "'speaker_7': 'Is that clear?'",
        "'speaker_2': 'Yes. So certainly today the water commission oversees the water utility and the sewer utility, and they have since the 1980s and the water commission has been existent for 90 years now. What the idea is under this consolidation is the gas utility would also fall under the commission, but we would rename it from the water commission to probably'",
        "'speaker_2': 'the Utilities Commission, so they would oversee rate setting budgets. Now, just like water does today, rate setting and budgets still have to come back to the city council. So that does not go away. So eventually all gas, water, sewer rates and budgets still have to come to the city council.'",
        "'speaker_7': 'And that Segways to my next question. You know, in the in the item, it speaks to consolidation, potentially realizing some some oil significant efficiencies right over time. How. How will the rate payers benefit from that? Can you just explain that?'",
        "'speaker_2': 'Well, right now, our costs for water and sewer are cost base. So anything that I can do to reduce costs benefit the customers, either through a combination of lower rates or reinvestment. In the utility, we have over between the three utilities.'",
        "'speaker_2': 'We have over 4000 miles of pipeline. So we have to reinvest in that customer service improvements. Someone mentioned the conservation programs. So we can reinvest those savings into those areas. Vice Mayor Richardson talked about the hiring process. One of things that we're working on right now is with city h.r.'",
        "'speaker_2': 'In civil service is some of the programs that he directed me to in san francisco. We're looking at that right now with the h.r. in civil service. So we would just reinvest that money. It could result in cost savings to the customers directly through lower rates also.'",
        "'speaker_7': 'Thank you. And from a labor standpoint, do you foresee any any wrinkles with any of our labor groups between the departments? Are they represented by different groups, the same groups.'",
        "'speaker_2': 'That are represented by the same groups? And so we offered meet confer to all the associated labor groups. We had one take us up on it. We completed that meeting for process this week. And so it was very, very successful in all the groups to understand what we're trying to do and they're comfortable with it.'",
        "'speaker_7': 'Thank you. This has my support.'",
        "'speaker_2': 'Thank you. Thank you. Let's have a roll call vote, please.'",
        "'speaker_0': 'District one. District one I, District two.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District three high district four i. District five.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'District six. I. District seven. I. District eight. High District nine.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Motion is.'",
        "'speaker_2': 'Carried. Thank you. Ordinance 26, please.'",
        "'speaker_0': 'Recommendation to declare ordinance approving resolution number WD Dash 1441a resolution of the City of Long Beach Board of Water Commissioner's establishing the rates and changes to be charged for water and sewer services. Read and adopted as read citywide.'"
    ],
    "Ordinance Approving Water and Sewer Rates and Charges Effective June 1, 2022.": [
        "'speaker_2': 'Thank you as the emotions are second here. You know this isn't the item on the screen. Can we pull up item 26 on the screen? There is motions that can police. Thank you. Any public comment on this?'",
        "'speaker_4': 'If there are any members of the public that would like to speak on item 26 in person, please line up at the podium in Zoom. Please use the raise hand feature or dial star nine now. See none. That concludes public comment.'",
        "'speaker_2': 'Thank you. No staff report is requested here. Councilman Austin, Miranda, anything?'",
        "'speaker_7': 'Well, I want a staff report. I think this is very good news that we need to make sure that our public knows about.'",
        "'speaker_2': 'Mr. Gardner, will the staff report? Certainly. So as you know, with Measure M in the court settlement, there were three components. One was a refunding of $9 million within 30 days to the water fund. Our water board took the action to return that money to the ratepayers as quickly as possible.'",
        "'speaker_2': 'We did that through a approval of a $100 per customer credit. Another component of that is we were told to we will receive $21.8 million back from the general fund within six months, hopefully sooner. And our board last week approved returning that money also to the rate payers.'",
        "'speaker_2': 'And so that will be done on the basis of meter size. And so larger customers will receive a larger credit. Smaller customers will receive a smaller credit. That will probably take place sometime in the July time period. The third and final component of the settlement or the lawsuit was we need to remove from our budget in error'",
        "'speaker_2': 'rates anything related to measure. M So right now in our rates, we collect money that goes towards the measure. AM Transfer to the general fund. With the lawsuit, we that has to stop. And so we're taking that component out of our rates going forward.'",
        "'speaker_2': 'And so that would be the equivalent of reducing our rates by 2.54% going forward. So that will be from I think it's April 25th. It'll go into effect June 1st and it will go through the end of the year.'",
        "'speaker_2': 'Then when we do our budget for FY 23, we will obviously have no measure m costs associated in our revenue collection. So the rates will reflect that. Great. Thank you. Can't say enough.'",
        "'speaker_7': 'Yeah. Thank you, Mr. Gardner, for that detailed explanation of this item. You know, obviously, we come to the to this with mixed emotions, but we're doing, I think, the right thing by my returning. Turning the money back to the ratepayers.'",
        "'speaker_7': 'And so, you know, the courts have decided and we're moving forward accordingly. I think this is a responsible move on behalf of the water commission. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember, you want to go further? All right. I don't see any hands, virtually anything. Okay. I'll just say I concur here, and I think timing is incredibly important. And at least we have resolution to this controversy before we move forward with a major change to both of the utility departments.'",
        "'speaker_2': 'So I think I think timing is key here. Thank you so much. And may public comment on this.'",
        "'speaker_4': 'If there are any members of the public that would like to speak on this item in person, please line up at the podium in Zoom. Please use the raise hand feature or dial star nine now. See. Now, that concludes public comment.'",
        "'speaker_2': 'Thank you. Let's have a roll call vote.'",
        "'speaker_0': 'District one, district two I, district three.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five I. District six I. District seven I. District eight.'",
        "'speaker_7': 'Hi.'",
        "'speaker_0': 'District nine.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Motion is carried.'",
        "'speaker_2': 'All right. Now we'll move to general public comment. Any members of the public would like to address the city council. Now be the time. All right. Seeing none. Right here. Okay. Come on. Forward. All right. Thank you. You have 3 minutes.'"
    ]
}