{
    "Authorization for Intermittent Closure of Certain Neighborhood Streets for Outdoor Activities and Economic Recovery.": [
        "'speaker_0': 'Hey, thank you. We are now moving on to item number. Let's see which ones next year we do. I am 21. Thank you.'",
        "'speaker_1': 'Report from Public Works. Recommendation to approve intermittent closure of certain neighborhood streets to vehicular traffic for increased outdoor activities citywide.'",
        "'speaker_0': 'Thank you. I'm going to go ahead and first get the report from Public Works and then I have some comments. And I know we have some council members that are queued up as well. So Mr. Modica.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Members of the council, we will have a report from Craig Beck, our director of Public Works.'",
        "'speaker_6': 'Thank you. Good evening, Mayor. Members of the council, we have an opportunity tonight to review a new program. It's really put in place to help support the safer at home order by providing additional activity areas within the public right of way.'",
        "'speaker_6': 'So the program that we're calling Long Beach Open Streets is really kind of twofold focus. One is to work within our neighborhood, our residential neighborhoods, to allow us to close some streets that will promote activity within that neighborhood.'",
        "'speaker_6': 'Essentially, when we talk about these type of street closures, it would be closed to through traffic and available only to local traffic. So the residents that live within that street segment, we wouldn't allow any permanent structures to be placed to ensure that there was safe access for our emergency vehicles.'",
        "'speaker_6': 'But really, it would become a safer activity zone for the residents living there. The other program that we're supporting is really in our business communities and we want to ensure that all of our businesses have the greatest opportunity for success as they reopen after the impacts of the of the COVID virus and the closures to in-store dining'",
        "'speaker_6': '. So by adding both PARKLETS and some street closures, we've been able to maximize areas for residents to come and enjoy those businesses at safe physical distancing. So attached to this item tonight are a number of street segment locations that focus on our neighborhood street closure program.'",
        "'speaker_6': 'What is an included tonight and I wanted to share with everybody is that there is also a lot of work happening to create parklets within the right of way in support of these businesses. So we started in the initial pilot rolling out three of those locations.'",
        "'speaker_6': 'There's a number of locations that will be added this week, and we continue to work with the bids and different businesses to expand this effort. In all, our hope is that this temporary program will help provide areas for physical distancing, which will assist the city as we move forward, adhering to our current safer at home order and'",
        "'speaker_6': 'as that order gets changed in a few. That concludes the staff report, and I'm available to answer any questions you may have. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Beck. Appreciate that. Good report. I just want to add a few things, and I, I think I have almost entire council queued up. So I'm going to go down that list in just a minute. I want to thank you all for working so, so quickly.'",
        "'speaker_0': 'And I know the team is. There's a lot going on in public works right now, and it's great to see so many streets that can really begin to create opportunities for residents. But also the Parklet program. I know we have already a few and I think there's a significant amount on this list, which I really appreciate and'",
        "'speaker_0': 'other than a lot of hard work that's gone into it. Just a couple. I already see someone queued up to make it to make a motion, but I just have a couple also questions and or additions to this.'",
        "'speaker_0': 'What I'd like to see, Mr. Beck first is actually, why don't I do this so the council can bring some of these items up anyway. So let me let me let them do that and then I'll fill in at the end if there's any additional comment.'",
        "'speaker_0': 'So I believe, Councilmember Pierce, you have a you have a motion to the motion. I'm sorry. A motion on this item. I believe you're the first one here. And there's a second by councilmember and there's a second by Councilmember Richardson.'",
        "'speaker_0': 'So why don't I let you go first, Councilmember Pierce?'",
        "'speaker_2': 'I appreciate it, Mayor. I want to thank the staff for working on this. I know that we did a lot of work not only in your department, but also with the city attorney's department. And my district is one of the densest districts that really has the bikeable streets, a lot of that and also several business corridors.'",
        "'speaker_2': 'And so I want to ask for the public a couple of questions. When we first started talking about closing down the streets, I think there was a lot of media excitement around it. I also think a lot of us saw photos of business corridors that were shut down in other cities and corridors like Fourth Street or Pine'",
        "'speaker_2': 'or streets that people immediately thought of as being streets that could be closed down. I love the Parkland ideas and I like the proposals that I've seen. I support them. But if you could share with the public why it is that we're not recommending closing down, say, fourth Street fully.'",
        "'speaker_2': 'If you could just share that fact.'",
        "'speaker_6': 'Certainly. Councilmember Pearce, I think what we're here tonight to talk about is our neighborhood closures and in why what we're characterizing as a neighborhood street is a low volume street. Many of the streets that go through our business corridors are what would be characterizes in arterial street or would have a significant traffic load on that street.'",
        "'speaker_6': 'Those streets we want to handle in a different manner. We want to look at that as we would any special event for a street closure. And for example, if Fourth Street was selected or if Fine Avenue was selected, we would go through the special event process.'",
        "'speaker_6': 'We would meet with the stakeholders. We would talk about how that activation was going to occur, the frequency of closures, what the traffic impacts would be to the adjacent streets. So it's a different way of handling those particular arterial closures.'",
        "'speaker_6': 'Right now, we do believe that we can move forward with this temporary Open Streets program in our low volume or neighborhood characterized streets to provide this open space. I hope that addresses your question.'",
        "'speaker_2': 'Yeah, it does. And one more. I know that what's in front of us is the neighborhood low volume, but I'd like to ask one more question. If a street like Fourth Street wanted to close it down and we know that some people want this, some people don't.'",
        "'speaker_2': 'I'm again asking questions for clarity sake. If it was a special events process, right. So say Fourth Street wanted to do it every Saturday. Would it be expected and stop assuming that that that bid would then be responsible for all the special event permits and all the costs that come with that?'",
        "'speaker_2': 'Or is there a program that the city might be exploring that would waive some of those fees or make it more cost effective than having police and fire and everybody else?'",
        "'speaker_6': 'Councilmember. It really depends on the type of activity that would occur within the closed street under the special event permit program. We are working to expedite that process. Since you're talking specifically about Fourth Street, I do want to share that the team is working closely with the Fourth Street bid and businesses there, and we've actually been able'",
        "'speaker_6': 'to develop an approach that would allow the Street to continue to support through traffic, but also achieve some of the open space goals of providing both flex space and dining space along Fourth Street. So we're excited about excited about this alternative approach and look forward to bringing that forward with council support this evening.'",
        "'speaker_2': 'That's wonderful and I fully support the approach tonight. I have had lots of conversations with neighbors that live on the streets that we've proposed. People are very, very excited about it. I think they're also excited about seeing how some of the streets connect.'",
        "'speaker_2': 'So I like what you guys have done in Alameda speech and really support this and really excited to be able to think of this as two different options for how we support people socially distancing, but also support people being active on their bikes or walking.'",
        "'speaker_2': 'And so I just want to thank you guys so much for the efforts and look forward to seeing it and fruition. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Richardson. Councilman Richardson. Let me move on to the next person. Go ahead.'",
        "'speaker_3': 'Okay. Yeah, this system is muting me. I would just ask that the clerk stop automatically mutiny. You did? I am. You did a moment before I was called on so quickly, I just wanted to say thanks to Craig.'",
        "'speaker_3': 'We've done some, some pretty cool things in terms of re-imagining how we use our streets for parklets. We really were trailblazers, blazers there and then beach streets and then, you know, open city events we've done around activate uptown and closed down Artesia Boulevard.'",
        "'speaker_3': 'So I'm really I'm really supportive of this program, particularly in areas that that haven't had a lot of open space. This is a way to expand some of those opportunities. I want to just take a moment and say, I know that we have these two streets with less listed in the ninth District.'",
        "'speaker_3': 'But with Craig, I want to add two streets into the mix, that Linden Avenue between South Street and Harding Street, Myrtle Avenue between South Street and 72nd. That would be in addition to the Harding Street closure. That's right.'",
        "'speaker_3': 'By the Highland Park Street skate park that I'm really excited about, as well as a baseball that runs right by Ramona Park. So those are all really, really exciting opportunities to see what can be done in terms of reimagining how we use our streets.'",
        "'speaker_3': 'Thanks a lot for those two in the mix. Thanks.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_2': 'Mr. Mayor, I want to thank Public Works as well, as well as our mayor for introducing this concept to us. And I know that the Third District has a few parklet concepts already at play and some in the works, including items presented in tonight's agenda item.'",
        "'speaker_2': 'The question I have for Mr. Beck is, are we still operating under the premise that this will be a temporary repurposing of the streets?'",
        "'speaker_6': 'Councilmember Price Yes. I should have mentioned that in my presentation. But right now our plan is that this would be in place through October. And the idea with October is that it would align with the change of Daylight Savings Time.'",
        "'speaker_6': 'So when we go back to Standard Pacific Time, we would end the temporary street closure program. I do want to add and point out that part of the action this evening is to provide the city traffic engineer with the ability to make adjustments as necessary.'",
        "'speaker_6': 'We know all the different street segments have a little bit of some unique characteristics. And one size isn't going to fit all across the entire city. So providing that flexibility to make adjustments as we move forward, as issues come up or elements change is part of our request this evening.'",
        "'speaker_2': 'That's very helpful. And I know that we had received that information and staff briefings, but I wanted to make sure that the public knew about that as well. Having said that, and you spoke to it perfectly, because we have different characteristics and traffic volumes and traffic patterns in different parts of the city in the Belmont Shore Business'",
        "'speaker_2': 'Corridor. We I am not supportive of any street closures beyond what's been proposed, but I do appreciate that our traffic engineer is really working with us to identify additional areas where this concept can be implemented in some form.'",
        "'speaker_2': 'So while we might not do full street closures, we do appreciate the opportunity to incorporate the Open Streets concept into our existing infrastructure. So I want to thank you for your flexibility and for allowing us to find what works in our districts based on the input that we receive from our businesses and in my case, residences that'",
        "'speaker_2': 'directly abuts the businesses. So thank you.'",
        "'speaker_0': 'Thank you, councilwoman. Next up is council member or Durango?'",
        "'speaker_3': 'That name again.'",
        "'speaker_0': 'Your anger.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'It came out a little weird. Thank you. Mayor of this is a wonderful concept. I think it's going to be very helpful for businesses to get back on track, as well as being creative and innovative and trying to get businesses back up and going in Long Beach.'",
        "'speaker_3': 'In regards to those areas as defined in District seven, I'm in agreement with what's being presented there. However, I would like to amend one and add two more if I can. The Street Sign on 37th currently states at 37 Street, west of Atlantic Avenue to the alley.'",
        "'speaker_3': 'I'd like to expand that to 37th Street from Cherry Avenue to just west of Atlantic on the alley. So if we can do that. I also want to add Hill Street in West Long Beach from Santa Fe to Webster.'",
        "'speaker_3': 'That is a red light between Oak Park over Hudson. Hudson Park. And we just added a new walking path there. So it's an opportunity to connect that with with that street action as well. And also one more thing is that the expansion of the parklet that's right there on Willow between Daisy and Magnolia, I don't have the'",
        "'speaker_3': 'addresses in front of me at this point, but I think that Mr. Mr. Beck has those addresses of federal employee where he knows exactly what I'm talking about. So those would be my my amendments to the current plan.'",
        "'speaker_3': 'And again, I want to thank public works for this unique idea and you, Mayor, for pushing this forward as well.'",
        "'speaker_0': 'I thank you, Councilmember. Councilman Austin. Councilman Austin.'",
        "'speaker_3': 'Yes. Thank you very much. I very much appreciate this concept. The office has worked pretty fast to put this together. And this was, I think, just introduced maybe two or three weeks ago. Also to have this these options in front of us are very much appreciated.'",
        "'speaker_3': 'In my district. We want to continue to. Build a great, livable community where residents can have walkable, bikeable access to businesses along our our corridors. And so what you see in front of you are streets that are the run along Atlantic Avenue in that area, support the businesses there.'",
        "'speaker_3': 'And then also in the Virginia Village area. And then there's one residential street that I'd like to also amend and actually remove after hearing from a number of residents who are concerned about this specific avenue from this road to country club drive.'",
        "'speaker_3': 'We want to remove that from the list, understanding that that street is already part of our bike boulevard. We already have, you know, active transportation infrastructure laid down there. So it's a it's already a bikeable pedestrian area. So that said, we're going to we ask that I'm supporting the four streets that you see Khadijah Clayborn, Plymouth Street'",
        "'speaker_3': 'and Platt Street for right now. Just wanted to know from our public works director what sort of flexibility we have beyond tonight with these what these plans should we hear from residents or other business groups with ideas throughout our districts?'",
        "'speaker_3': 'Is that is there any options in front of us?'",
        "'speaker_6': 'Councilmember Austin. I think right now what I'm hearing is that we have the list that was proposed and worked through some of the offices. And tonight we're making some adjustments to that list. A part of the action would allow the city traffic engineer to make segment adjustments.'",
        "'speaker_6': 'So if something needed to be extended a half block or one way or another, it's that's part of the action or if we needed to change the hours. But as far as adding new street segments, that's not currently part of what's on the table right now, that those new street segments would then have to come back to'",
        "'speaker_6': 'council.'",
        "'speaker_3': 'Okay. And then also in the staff report, it says that these segments will be closed from 9 to 5 p.m.. Can you explain what the reasoning behind that is? Why the time and why 5 p.m. and not 9 p.m.?'",
        "'speaker_6': 'Certainly. So again, not trying to say one size fits all, but we were we wanted to give at least a guideline. So currently the city does closed Bayshore Avenue in the third district in the summertime, certain times of the year from 9 to 5.'",
        "'speaker_6': 'And so we just echoed that same time frame for the proposed street closures in other areas of town. With with adoption tonight, the city traffic engineer can make adjustments if certain neighborhoods want to go longer or start later.'",
        "'speaker_6': 'Those are things that we can accommodate. But that was just the guidance that was provided.'",
        "'speaker_3': 'Well, I think it would be really more operational if we gave our business districts a little bit of a little bit more latitude on that. And so, however, that can be incorporated in this motion to approve this this document tonight.'",
        "'speaker_3': 'I'd like that to happen. I'd like to have or specify that our business districts at least have a voice in this process, but also can work with the the local businesses to determine at the time that that that works best for them because 9 a.m. might not fit.'",
        "'speaker_3': 'Like you said, one size may not fit all. Maybe a lunch time or 11 a.m. to 9 p.m. might make work in some areas. And so I'd like for us to have that flexibility to be able to do that.'",
        "'speaker_6': 'Certainly understand. We'll work with your office and Bixby Knolls Business Association to address those questions.'",
        "'speaker_3': 'All right. Thank you so much. That's all that I have. I look forward to approving what the recommended changes.'",
        "'speaker_0': 'Thank you all. Vice Mayor Andrews.'",
        "'speaker_3': 'Yes, thank you very much. I want to thank credit unions team for putting this together. You know, I think the problem is adamant too closely to allow the outdoor activities, you know, such as walking, cycling and skating. But the myth that inception that this idea was to promote outdoor dining and I was under that impression as well'",
        "'speaker_3': '. But you know what? Recommending for the six six District six closure when that what I expect I'm looking forward to doing it for our on time. You know and you know, since, you know, since everyone is adding strength, I would really like to add on Willow from Magnolia to Pacific.'",
        "'speaker_3': 'And if we can't and if we can't, then I'd like to discuss this at some other time later. So those are some of the things, Greg, I would like to see if possible.'",
        "'speaker_0': 'Thank you, vice mayor. Next up is Councilman Supernova.'",
        "'speaker_5': 'Mayor, can we just have Craig Beck respond to that quickly, please?'",
        "'speaker_0': 'To wit, to vice mayors request.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'That's about right.'",
        "'speaker_6': 'So just Vice Vice Mayor Andrews, I just wanted to clarify, if you the request is to close, Willow, that we would want to work with your office. That would have to go through a special event permit because it is an arterial street.'",
        "'speaker_6': 'Tonight, we're focused on the low volume streets. So happy to work with your office and have that conversation. But I just want to differentiate between the item tonight and how we would process arterial streets.'",
        "'speaker_0': 'And Mr. Beck, I'm going to have some come at the end about some arterial streets and how we move forward on that. So that will hopefully cover vice mayor and his request. I think he actually said Pine not well or I could have misunderstood.'",
        "'speaker_3': 'Yeah. When we look up, I might add, to what happened at Magnolia to Pacific Avenue.'",
        "'speaker_0': 'Yup. So the Wrigley. The Wrigley. The Wrigley Village.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Yeah. Yeah. I'll come in and out at the end. Vice Mayor.'",
        "'speaker_3': 'If I'm a.'",
        "'speaker_0': 'Customer or not.'",
        "'speaker_3': 'Thank you. I have some comments related to the group. We live on the beach. They posted some lengthy comments and comments for reference. So pages 81 through 83 and they're submitted by Scott Jones and Richie Brand. We loved Long Beach prior to getting to that.'",
        "'speaker_3': 'I just want to mention one st and for Craig back, I think we put this in an email, but 23rd Street between Lakewood Boulevard and Clark, that would be subject to approval from the Long Beach Fire Department. They use that street for access to Lakewood Boulevard from both the training center and station 17.'",
        "'speaker_3': 'So to the We Love Berkeley comment. They actually develop their own initiative. I called Play Streets 18 months ago and it's very similar to Open Streets. And when they saw open streets, they saw all the parallels and wanted to bring their thoughts to the table or wanted to offer help.'",
        "'speaker_3': 'I think they've done events in six different council districts over the last 18 months. So when they saw this, we were trying to set up that meeting between public works and we love language and it just didn't happen.'",
        "'speaker_3': 'This council item came up very quickly, so they were a little disappointed they didn't get a chance to weigh in. So maybe I should make this in terms of a friendly amendment. And if the director of public works sees this as workable, that we just ensure that we live, have language, has a seat at the table to'",
        "'speaker_3': 'provide input, and they can be a part of this moving forward and throughout the process because I think they could do a lot to get the communities involved with the program and really that's it. So I think if the it how how would you like to handle this in terms of a friendly amendment that that we have'",
        "'speaker_3': 'language that representatives can be involved in and whatever is ideas upfront and organizing this throughout the process.'",
        "'speaker_0': 'Think you can our superman. We can we can have staff reach out to we live Long Beach to initiate that conversation. So thank you for that. Councilman in the house.'",
        "'speaker_2': 'Mayor. First of all, I wanted to thank Craig for and all the rest of the city staff that worked so hard on this, putting together this program. I think it's a great idea, specially for our neighborhoods who are in you know, in my district, most of the neighborhoods are dense with a lot of apartments.'",
        "'speaker_2': 'And so this is just super exciting to provide a space for children and youth, to be able to come out and enjoy the day and just really enjoy being in their neighborhood. So I thank you for that. I've seen programs like this work in other cities, so I'm really looking forward to seeing this work in our cities'",
        "'speaker_2': '. So thank you again for this and I'm excited for my residents that will be able to enjoy this.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'Thank you. Can you hear me, Mayor?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Wonderful. So I have some concerns about this. I also spoke with Long Beach board member today, and I hope that it was just a coincidence that and they were very coy and not naming names, but they said that they'd given their presentation to a councilmember.'",
        "'speaker_2': 'It wasn't me and that they'd been working on this with the city for a long time. They even said that they met with public works and when I read the proposal, I have some serious concerns because the proposal says Monday through Sunday 9 to 5, which is pretty much any and all days of the week and.'",
        "'speaker_2': 'It doesn't say anything about frequency or times or any of those things. So on residential corridors, this can be great, but it really needs the input of the neighbors on those streets and it really needs the input of the communities that will participate and support it.'",
        "'speaker_2': 'So since this item was introduced by Public Works and Daryl already kind of commented that they've provided some input, maybe public works can comment on if Play Streets had any. Give into your ideas of where this came from.'",
        "'speaker_2': 'And potentially, if we could lean on both them and I would say these streets are successful a lot of times because of special events. Portia De and her team do an exceptional job with community outreach. And what I feel was kind of rushed in this case, and I recognize that part of it was that the reopening schedule'",
        "'speaker_2': 'kind of caught up to us a little faster than we had anticipated. Is the community outreach part of the council agenda item kind of just through the responsibility of community outreach on a program where we had no information about the real vision?'",
        "'speaker_2': 'I hadn't seen the We Live Long Week presentation. All I had seen was the presentation from public works at council, which really focused on commercial corridors and then kind of said, okay, council offices. We picked these streets. But the reason those streets were packed in the stuffing with public works was really based on city traffic and through'",
        "'speaker_2': 'streets. But really, what really makes the place streets are open streets or whatever you want to call it, idea. Valuable is the people that live on those streets. They have families who will support the set up of the barriers.'",
        "'speaker_2': 'Share the info with neighbors. So at the time, there are many streets in our district already throughout COVID who have kind of had a soft a soft closure of their streets on certain days for kids to caravan around as kind of an agreement by neighbors to kind of give that opportunity.'",
        "'speaker_2': 'And and for us to know and partner with those individuals the same kind of individuals who already host neighborhood events of ice cream socials and pancake breakfast and all the things that are encouraged through the spirit of organizations like Neighborhood Associations and their host organization, Partners of Parks.'",
        "'speaker_2': 'And we live Long Beach. That's what makes it very successful. So I would say there are additional streets I would identify that could be very helpful. What are the neighbors on those streets didn't want to be included because of the vagueness of the agenda item.'",
        "'speaker_2': 'There are streets like the one I live on that said, Hey, we want to do this on Friday evenings only, and I don't know that the item and agenda would be able to give that level of specificity. So I would love to see that at a one month point, we kind of check back in the list of'",
        "'speaker_2': 'who's doing what and why and where or what with each council office and potentially bring back an agenda item that could add additional streets. I think other concerns from neighbors, I specifically heard from a neighbor today who said, you know, I live in zipcode, blah, blah, blah, blah, blah.'",
        "'speaker_2': 'And we have a very, very low case of coronavirus. If you publicize that, our street is going to be closed. Our concern is that if not enough streets are closed throughout the zip code that so many people will come to our area, that the social, the physical distancing ability will be diminished and therefore the risks would be'",
        "'speaker_2': 'increased. So these are all things that I think are really important for us to discuss at the council. So my recommendation, well, I'm okay with leaving in the streets that are there. I am not okay with us moving forward on actually choosing and closing the streets until I've had the opportunity to have a community meeting with the'",
        "'speaker_2': 'neighbors on each of those streets. So and then I would love to kind of modify Councilman Supernova's request for input from we live Long Beach to State. If we live Long Beach could do a call to action to their neighborhood leaders that were already interested in doing these kind of things and then provide the city a list'",
        "'speaker_2': 'of who those might be and their selected times. For instance, if it's Karen Street and they want to do things to do a Sunday roll where every Sunday from 4 to 6, all the neighbors would try to walk the whole neighborhood together.'",
        "'speaker_2': 'If they want to do a sun roll on Karen Street or whatever other street that it really comes from the community because that's where the value is. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo. I think we've gone through the council already. I have some comments here at the end for also just just to add, so we think we have the listening public, which she's done a great job.'",
        "'speaker_0': 'I obviously know that you've been under a lot of pressure to get this done expeditiously just because of the nature of the COVID 19 crisis. And so right now, you're balancing a lot of a lot of requests. And you been working with the council offices.'",
        "'speaker_0': 'I appreciate that. I want to just also make a couple more broader comments before we vote on this list. And I have a couple of additions that I've chatted with council members on is we are. My first question, Mr. Beck, is I know you also have a lot of Parklet requests.'",
        "'speaker_0': 'Those are being processed as we as we as we speak. Is that correct? I want to make sure those are also being processed and we're moving forward with those and coordinating those with the business districts or the neighborhoods.'",
        "'speaker_6': 'Yes, that is correct. And there's a number of different locations that we've been in contact with, both the businesses and the bids as we're ready to move forward. I think I mentioned in my opening comments that we should see another 6 to 10 get implemented later this week.'",
        "'speaker_6': 'Signs will be going out tomorrow for no parking as we install those parklets on Thursday and Friday.'",
        "'speaker_0': 'Gretchen, can I just ask that just from the public perspective? Can you and I'm not sure if people through social media or other ways with public works department can put out or those parklets will be or where this next group of parklets are appearing.'",
        "'speaker_0': 'It'd be great for the public to know as well just to help those restaurants and to the people know as well. I'm not aware of what the list is and I love to know. I think the public should know as well.'",
        "'speaker_0': 'That would be great. And let me get a couple quick questions. Thank you. A couple of quick point questions. Customer Austin brought up Claire born in Bixby Knolls, which I'm glad is on the list. This is the the street that's also called.'",
        "'speaker_0': 'I just want to make sure they see it's a cardboard drive east of Atlantic two alley. Is that the alley by Long Beach Creamery? Because I know that they had reached out to them just confirming that to be the case.'",
        "'speaker_0': 'Mr. Beck.'",
        "'speaker_6': 'Yes, I believe it is. This is a concept that's been floated by the business district for some time, a concept called Clear Born Commons, which would ultimately close a segment of the streets and activate it for supporting those businesses.'",
        "'speaker_6': 'So we've been working through different designs, and I think this gives us an opportunity to really deploy those those ideas on a temporary basis. And then as we learn what works and what doesn't, modify them into potentially a permanent solution at that location.'",
        "'speaker_3': 'Let me just point of order for a clarification. And Claiborne is off of the Atlantic, and that is not where the Long Beach Creamery is. But I am certainly open to adding the Claiborne from Long Beach Boulevard. West to the alley.'",
        "'speaker_3': 'To the alley, right? Yep.'",
        "'speaker_0': 'Okay. That was my clarification, because I think there may be some confusion there. So I agree with Councilmember Austin on that. So let's make can we. Mr.. Mr.. Back I just want to make sure that that that piece of cardboard, remember, is Boulevard west of the alley is also included in the list.'",
        "'speaker_0': 'So thank you for that. Thank you, Councilman, for that clarification. Then let me turn to downtown. A couple things I would like to add as well is I want to make sure there was a request to do some closures on Linden between First Street and Broadway.'",
        "'speaker_0': 'That was something that came through. I talked to Councilmember Pierce about this as well. So we're both supportive of that. So if you can and I understand, Craig, that some of these what I what I'm doing is we're adding these four so you can move forward.'",
        "'speaker_0': 'It may not be feasible. There may be issues that come up. I understand you may have to work with the businesses, but if want to assure that these requests are on the table, so it gives you the flexibility to work with them and the councilmember.'",
        "'speaker_0': 'So I just want to include Linden between First Street and Broadway. Also want to include I know that there's a fire department issue currently with the promenade, but we we need to move forward with the promenade and hopefully with that it will get resolved.'",
        "'speaker_0': 'And so the promenade corridor between first and third streets is built literally for this type of expansion. And so also asking, I know the fire chief and others around this line to please, let's resolve that issue so that those promenade restaurants that really made an investment in that area and want to expand have the ability to do'",
        "'speaker_0': 'so. And so I'd like to see the promenade on that on this list as well. And I've discussed that also with the councilmember. I also want to add, and I've discussed this both with councilmembers one and two, I'd like to I know that I'd like to add Pine Avenue and north of Broadway, between Pine Avenue, north of'",
        "'speaker_0': 'Broadway, all the way to seventh as an option. Also, I understand it's a more complicated closure, and that could need a permitting process that's separate of this process. But I just want to get everybody to begin working on that.'",
        "'speaker_0': 'And the council members are very interested in that, as well as some of the small businesses that have many of which were affected on the obviously by some of the looting that that had happened. And so they're really asking for some support here, and I want to support those businesses as well.'",
        "'speaker_0': 'So if you can add Pine to that list, I want to clarify. Councilman Ringa mentioned, I think 15, 16 and 15, 18 on Willow. And I think that's those are in front of the Long Beach beer lab. I think he's talking about two parklets there.'",
        "'speaker_0': 'Just to clarify, Mr. Beck, that we want them. That's a great local small business that we want to move forward on and include those as well. Also, we have just to clarify for Vice Mayor Andrews, he's interested in activating portions of Pine Avenue between Willow and PCH.'",
        "'speaker_0': 'That's obviously the that's Wrigley Village. And he just like he'd like to implore that you work with that business corridor and businesses to find some parklets or street closure opportunities for those businesses. At least that's the way the vice mayors communicate it to me.'",
        "'speaker_0': 'So I'd like to add that also as a as a note and then more, more, more broadly, I want to just add something that I know vice mayors are reaching out to me to include also is if we can please work directly with our Cambodia town, they're really looking for some opportunities, if possible, to do something.'",
        "'speaker_0': 'I know Anaheim is a complicated street, but if there's a parking lot opportunities or a side street opportunity to do some kind of parklet work or street closure, I think Cambodia Town would really appreciate some of these proposals as well.'",
        "'speaker_0': 'So those are the those are the additions that I want or clarifications I wanted to make. And I just want to also just Councilman Pierce, just from emotion perspective. I want to make sure that the traffic engineer has the ability not just to adjust the street boundaries, but like was mentioned, I think, by Councilman Austin, that if'",
        "'speaker_0': 'if, if, if staff in working with a council office or a business district wants to make a street closure longer to support the businesses that they have the ability to do so. And I think that the traffic engineer and public works also need the ability to add additional street segments as identified by public works in conjunction with'",
        "'speaker_0': 'either with the neighborhoods and the council office. So I want to make sure that obviously any new street closure gives getting input from the council office to make sure that it's supported. But I want to give staff the flexibility to do that, or we're going to be back here every week with more streets.'",
        "'speaker_0': 'And so and inclusive of that, we can do the month report. I think that Councilman Mongo mentions that we come back a month from now and put it all together. So that is my thoughts. Councilor Pearce, I know you and I discussed some of these for the motion and I'm turning back over to you.'",
        "'speaker_2': 'Thank you, Mayor, and thank you, everyone. And I support everything that's been talked about. And as I was clarifying in my previous comments about business corridor versus neighborhood corridors, if we're going to expand and have the conversation about what streets we can add today so that we don't have to come back at a later time, I want'",
        "'speaker_2': 'to accept the motions that are on the floor, the friendlies that have been made. And I also want to add two things. One is I have some streets that I'd like to add for the public record that.'",
        "'speaker_1': 'Should staff be able.'",
        "'speaker_2': 'To get to them. I understand that you have a limited amount of resources to close streets down, but might as well add them today instead of coming back. One is St Louis from fourth to fifth, which is right off of Retro Row.'",
        "'speaker_2': 'The other is Garvey to 10th to 11th. The street that the mayor mentioned, taking it from ocean to Broadway on London. That's where the neighborhood has their arts festival. They used to close it down once a month already.'",
        "'speaker_2': 'So this adds that ability as well, support the extended time and making sure that you're working with the neighborhood on what the appropriate time should be. But extending it to 9:00, of course, the promenade. And one thing on the promenade, I've sent one email and I know things have been busy and it hasn't been a priority, but'",
        "'speaker_2': 'there's slivers of greenspace on the promenade where a lot of. Activity that is not wanted or welcomed is happening. I know that one of them is like a little dog. I'm not sure if that is space. That could be revision for the long term.'",
        "'speaker_2': 'And this is a different conversation, but no, that I fully support moving some of that that area and we can have a conversation down the road. But to open up the promenade, especially in front of what is in the ordinary and right there there's two green spaces that.'",
        "'speaker_1': 'It's just it doesn't.'",
        "'speaker_2': 'Welcome a lot of people to have outside dining there.'",
        "'speaker_1': 'And then the other thing that I.'",
        "'speaker_2': 'Would add is part of the Broadway conversations that we've had in the past. Part of the visioning for Broadway have been these parklets. I know that the black bar that's there and I know there's a new coffee shop closer to Alamitos.'",
        "'speaker_2': 'Both of those are spaces that have been interested in outside dining. So putting that on this list so that down the road they could also be included in that Parklet program. I think it really adds to the final touch of a Broadway show that's on the streets.'",
        "'speaker_2': 'The second part is I want to address just briefly, you know, the comments about organizations and how they would interact with public works. My office did work to try to make sure that we activated some streets. I know that different organizations had different ideas.'",
        "'speaker_2': 'As long as public works can make sure that the neighborhood associations are, you know, if there's a group like we love language that wants to come in and activate a street, it just needs to be done with the associations that are there and the residents that live on that block.'",
        "'speaker_2': 'Definitely. My office has supported putting together an item that would bring more funding to activate some of those streets. We've held off on that because of COVID. So I think this is a very great first start and. Appreciate all the input that everybody's had.'",
        "'speaker_2': 'So with that, I say we vote.'",
        "'speaker_0': 'Thank you. There's no public comment. Please go ahead and call the roll call.'",
        "'speaker_1': 'District one, district two I. District three i. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five. I. District six.'",
        "'speaker_3': 'High.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Ocean carries.'"
    ],
    "Rebuild Long Beach Relief Fund for Damaged Small Businesses.": [
        "'speaker_0': 'Thank you, Madam Court. That concludes I'm 21. To item 14, please. Next.'",
        "'speaker_1': 'Communication for Mayor Garcia, Councilwoman Zendejas. Councilmember Pierce. Vice Mayor Andrews. Councilmember Richardson. Recommendation to request city manager to establish a rebuild Long Beach Relief Fund to assist Long Beach small businesses with repair and loss recovery from damages sustained during the evening of May 31st, 2020.'",
        "'speaker_0': 'Thank you, Madam Court. I want to just first mention, this is not this is often something that a lot of us have been discussing council members, business associations, different philanthropic groups out there. There's a lot of interest in how we really support the businesses that were affected on May the 31st.'",
        "'speaker_0': 'We know that businesses were affected in different ways. Some may have been vandalized, whether it was graffiti or etching on a glass or even a broken window, which were, you know, smaller acts, obviously, of vandalism to much more extreme types of damage.'",
        "'speaker_0': 'I mean, you saw obviously in some cases, storefronts having major damage. You saw in some cases major looting that happened in some of these businesses where much of the inventory was gone. And in one case in particular, you saw a major fire that really destroyed one business, both the structure and the what was inside.'",
        "'speaker_0': 'And so what this motion is asking for us today is just to look comprehensively at creating a new fund to really assist all of these businesses. I think as a city, we have to be committed to every single business that was affected on May the 31st.'",
        "'speaker_0': 'They all deserve our support. They all are having been invested here in Long Beach, and I want to make sure that they all have support from the city in some way. Now, we know, obviously, that these are these recovery programs can be complex, where we know that a lot of these businesses, for example, will have different types'",
        "'speaker_0': 'of insurance programs that cover much of their cost. Others may not have the same access or may have a high deductible. Others may just have storefront damage. Their needs need some support with storefront. I also heard from some businesses, for example, in Cambodia, Town and North Long Beach, that they just wanted that want support with costs that'",
        "'speaker_0': 'they had to put to protect their business, to put up a plywood, which wouldn't be more than a few hundred dollars. So there's a variety of types of support. And while I know there are some really great efforts happening in some of our business corridors, some of our business improvement district, in fact, have set up their own'",
        "'speaker_0': 'funds. And there have been some philanthropic efforts as well. Those we support, those need to continue. But this is a city effort and this effort is, I think, us putting our commitment on the table that we're going to help all of these businesses.'",
        "'speaker_0': 'I know that there is a list that's being put together by economic development and working with all the bids and the businesses to see what is out there and who and who we can support. But this is can really also be a combination of resources.'",
        "'speaker_0': 'I think first and foremost, we're talking about grants. And so we're looking at staff to identify resources that we have for direct grants from the city. We're looking at loan programs, obviously donations. It's all laid out in the recommendation, but we want to make sure that the community gets support that they need to restart quickly and open'",
        "'speaker_0': 'up. And so just thank you for that. I know that obviously we have a lot of support for this item. I'm from from the council and we appreciate that. And I want to turn this over for to make the motion.'",
        "'speaker_0': 'And Vice Mayor Andrews just cued up first. So Vice Mayor Andrews. Vice Mayor Andrews.'",
        "'speaker_3': 'Yes. Yes. Thank you, man. Thank you very much. You know, first of all, I want to thank you for leading this discussion. You know, you know, having lived through three major, you know, protests in the city of Long Beach, this is unfortunately not for the first time I see the sixth District broken and looting.'",
        "'speaker_3': 'I have faith that we are resilient. Resilient and together we are strong beach. You know, I'm proud to have already begun working with diplomacy ship Dallas Small Business Repair. And anything we can do to levy assistance is greatly appreciated.'",
        "'speaker_3': 'And I want to thank you, gentlemen, for leading this.'",
        "'speaker_0': 'Vice mayor with that emotion also. Yes. Okay. Can I get a second, please? On on that motion.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Okay. I just needed to go into the queue system, please. Second by Castro. Richardson. Castro? Richardson. Any comments?'",
        "'speaker_3': 'Sure. Yeah. Use my kids in the background. So. So. A couple of things. So first, I believe that this is this is really a chance to acknowledge that a lot of our programs really haven't worked for some of the businesses that were impacted on these corridors.'",
        "'speaker_3': 'Know some of the shopping centers that were hit. We've gone out and done outreach to see if they would like to improve some of their signs or some of their windows with the, uh, some of the CDBG funding that's out there.'",
        "'speaker_3': 'And it's hard to get their attention. Folks are busy. I think this is an opportunity to say, you know, why we have everyone's attention last and the last can be fixed. A lot of these things can be replaced.'",
        "'speaker_3': 'But how can we get get the captive audience of these businesses and help them improve some of their signs and some of their windows? Paint the buildings. It'll go a long way for the corridor, but what I'm really hoping for is out of this program, we can address some of the some of these buildings that their windows'",
        "'speaker_3': 'are broken. But they haven't been able to tap into the resources that we have for them already. So while we have their attention, we should really take advantage of this opportunity to improve some of these corridors. And with that, I'll second the motion.'",
        "'speaker_0': 'Thank you, Councilmember. Councilman Pearce.'",
        "'speaker_2': 'Yeah, I totally support this effort. I just want to say how much I appreciate having your leadership on it. We had a agenda, something similar last week and pulled it because we know that if the whole city is really working on it and if you're focusing on it, that these businesses are going to be able to benefit'",
        "'speaker_2': 'so much more. There's a lot, like you mentioned, businesses that have small graffiti and things like that. And so we'll make sure that our District two team is reaching out to the businesses in our district and connecting them with economic development.'",
        "'speaker_2': 'And many of the bids are listening. You know, I hope that they outreach, too, and that we can have a wider effort than just having another fund in the city that might not be tapped. Because I know sometimes that tends to be one of the challenges.'",
        "'speaker_2': 'So appreciate this item.'",
        "'speaker_0': 'Thank you. It's a member, Councilman Austin.'",
        "'speaker_3': 'I fully support the item. I think all of my sentiments have already been expressed. Thank you all council members for bringing this forward. I think this is a welcome gesture from the city of Long Beach. My my only concern is how we prioritize the resources or maybe possibly limited resources we have to to support businesses and what'",
        "'speaker_3': 'we can do to develop, you know, I guess a a a system of that that is fair for for everyone to participate. So those are my comments. I look forward to support it. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. And that's.'",
        "'speaker_2': 'Thank you, Mayor. First of all, thank you very much for letting me join you on this item. I know that the First District was hit very, very hard. But thank you to your team for putting this item together and working really hard on this to support our small businesses here.'",
        "'speaker_2': 'You know, these small businesses were already struggling before COVID. And, you know, this this destruction that happened just made things even worse after COVID hit. So I think it's really important that we show our small businesses that we care about them and we really want them to thrive in our in our city.'",
        "'speaker_2': 'And by providing not only opportunities to to to micro loans is a good thing, but I think that even better than that is providing them with opportunities for grants. And I'm very happy to be able to be maneuvering some resources to be able to cover grants for those in in in need right now for the small businesses'",
        "'speaker_2': '. And I will be together with my office working on putting together a little workshop so that all the businesses that were affected citywide, you don't have to be in the first district. But we're working on putting that together so that everybody knows the step by step thing, you know, that they will be needing to take in order'",
        "'speaker_2': 'to take advantage of these opportunities. And I look forward to supporting this item.'",
        "'speaker_0': 'Thank you. Next up is I think that it's everyone on the list here to speak. So, Madam Kirk, any public comment?'",
        "'speaker_1': 'There's one public comment for this item.'",
        "'speaker_4': 'Victor. Lucy, you have 3 minutes.'",
        "'speaker_3': 'You all just spent all that time about looting, about throwing up businesses. But the major issue is. That the city of Long Beach does not respect Black Lives Matter. Spent all this time deliberating about small businesses, small businesses looting.'",
        "'speaker_3': 'Why were the people out in the streets? Because OB and the police are brutalizing us. And y'all don't hear the message. Countless citizens spoke to God about the terrorism of the Arab, how we want to defund the police.'",
        "'speaker_3': 'But you also spent all this time whining about small business, this small business that. I understand why all this happened. Get to the root of the problem. The root of the problem is too much money goes to our big PD.'",
        "'speaker_3': 'We are going to be fun to elbow deep. Are you of my time? Thank you. I want to.'",
        "'speaker_0': 'Go ahead and call the roll call. Vote, please.'",
        "'speaker_1': 'District one. District two, my district three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. District five. I. I. District six.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District nine. My motion carries.'"
    ],
    "Reopening Plan for Youth Sports Activities in Parks.": [
        "'speaker_0': 'Thank you. Item number six, please.'",
        "'speaker_1': 'Communication from Council on Mango Councilwoman Zendejas, Councilman super novice Mary Andrews recommendation to discuss and enact related strategic planning initiatives with youth sports leagues in preparation for re-opening our parks to youth sports activities.'",
        "'speaker_2': 'Thank you. I appreciate everyone who signed on to this item. As many know, our youth sports programs are many nonprofit organizations and some are many businesses. They employ people who are coaches or referees, and they also have many, many volunteers and parents that participate in keeping the kids out and about and engaged in athletics, which keeps them'",
        "'speaker_2': 'healthy and strong. So we need to have a focus on ensuring that we are prepared to take on the challenge ahead of allowing multiple sports who are typically spread over a year to really prepare to come back and potentially play simultaneously.'",
        "'speaker_2': 'An example of this is some of our sports fields overlap each other and we wouldn't be able to in some facilities throughout the city, host both soccer and baseball at the same time. But there are adjustments that can be made throughout the city to make those types of things possible.'",
        "'speaker_2': 'So when and if sports can come back, we are prepared to give all youth the opportunity to get out there and practice their skills so as they move through and participate in their school sports, they have those knowledge, skills and abilities and talents to really help them through and keep them engaged in their schoolwork.'",
        "'speaker_2': 'So I really appreciate the youth sports directors that have reached out with you on better understanding your goals. And I think it's important to have a formal process where Parks and Rec really sits with the directors and casting directors that know and understand the complexities that can come about as we roll out the new requirements, which organizations'",
        "'speaker_2': 'are really prepared to do to meet that challenge and for them to be able to share ideas with people that aren't yet getting that kind of guidance from their national association?'",
        "'speaker_1': 'Councilman Supernormal.'",
        "'speaker_3': 'Thank you. And if that was the motion, I'd like to second the motion and just add to it that I fully support this and thank Councilmember Mongo for bringing it forward. We have the good fortune of having some baseball leagues in the fourth district, Durant Park Post, Long Beach League, Whaley Post, Long Beach Pro Baseball, and then'",
        "'speaker_3': 'where the North has a number of volleyball teams. Our council district has invested a lot into these facilities. We support them tremendously, and we'd really like to see them get going once again. Also to reiterate what Councilman Mungo stated, and that is these organizations can bring their own protocols to the table.'",
        "'speaker_3': 'So let's make sure we we listen to them as we move forward. Thank you.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_2': 'Thank you so much. I appreciate I appreciate bringing this item forward. And I have kids who are in their youth programs in the city, both the city sponsored ones and also club ones. And I really do think we need to sit down and figure out how to work on protocols that make participation in these activities safe and'",
        "'speaker_2': 'feasible for our youth. I can say that as a parent of two children who have been out of school now for since March and entering into the summer, there is a lot of downtime for them. And I think team sports and sports activities that we're able to reintegrate into our daily lives will assist them tremendously in getting'",
        "'speaker_2': 'outdoors, exercising, staying healthy, making good choices, interacting with people outside of the technology world that they're most of them are operating in. And so anything that we can do as a city to help partner with these organizations to allow for safe reopening and participation, I would support and I appreciate Cassell and Mongo bringing this item forward.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilmember Austin.'",
        "'speaker_3': 'Thank you. I just want to add my my my support to this item. Obviously, youth sports are extremely important and I really think it's part of the DNA of this city. So when we get back to functionality, we should have a plan to ensure that that our youth are safe, their parents are safe, and that they are'",
        "'speaker_3': 'having an enriched activity, whatever sport they are playing, either super active sports or not. And so I think there are also a lot of national organizations that are connected to many of these sports organizations that they can draw upon information as well.'",
        "'speaker_3': 'Our staff can draw upon information as well. But I do like the idea of working with local youth organizations, sports organizations throughout the city to to be engaged in the process, at least as as important stakeholders in the process.'",
        "'speaker_3': 'So congratulations. I really like this item and plan on supporting it.'",
        "'speaker_0': 'Council member Adam Quirk. Any public comment?'",
        "'speaker_1': 'Yes. We do have public comment on this item.'",
        "'speaker_4': 'Joel Davis. Um, you have 3 minutes.'",
        "'speaker_3': 'I may regret not to thank you for hearing this agenda item and allow it. My name is Joel. There's a current president of one of our youth organizations. We provide baseball to our youth athletes. I'm here speaking on behalf of multiple youth, baseball and softball leagues in the city limits.'",
        "'speaker_3': 'First, I'd like to acknowledge and show my sincere appreciation for the city Long Beach, the Health Department, and Parks and Rec Department. The magnitude of handling a pandemic, it's incalculable, and I believe we are all doing a great job at that.'",
        "'speaker_3': 'So thank you. I would also like to specifically acknowledge our Parks and Rec staff. They've done a tremendous job keeping us informed and prepared to get back to the field and the kids given. Recently, a task force of Long Beach baseball and softball presidents developed a plan that would allow for baseball and softball to resume and operate'",
        "'speaker_3': 'safely within all current published city health guidelines. Additionally, each league has submitted site specific safety resumption plans for each park and facility plan. Our reports show that baseball and softball, by its nature, along with these guidelines, is the ultimate social distancing sport.'",
        "'speaker_3': 'We also recognize that there are priorities to the reopening of the economy. We unfortunately do the necessary way to reopen slowly to provide for safety. We are having this conversation at the end of our traditional seasons. We are asking that a definitive decision is made for our traditional spring sports who are still holding on.'",
        "'speaker_3': 'In fact, based on polling, 75% of our parents who were surveyed that they would have their youth athletes play over the summer and or the fall. If it is not until the fall, the parks will see a significant impact.'",
        "'speaker_3': 'We ask that IT solutions develop that provides all athletes of all sports in Long Beach the opportunity to play the game they love as soon as the UK is granted. We are aware that this will cause not only a large impact on our parks, but the staff to oversee them.'",
        "'speaker_3': 'The park's facilities are already highly utilized and this will cause further complications. For example, Hartwell Park is home to five baseball leagues and three soccer leagues, one of which is an adult league. We believe there are ways to decrease the impact and are willing to be a part of that discussion.'",
        "'speaker_3': 'These leagues serve youth from all over the city. We hope that as a city we can work together to find solutions. We are ready and willing to participate in preparing a strategic plan that will get our youth back to the sport they love and are willing to work collaboratively between the youth sports organizations and the Parks and'",
        "'speaker_3': 'Rec staff to find creative ways to make that happen. We were at that point. A hard decision needs to be made regarding the remaining time over the summer. We could play before fall. Sports are set to begin. If the decision is no, then we are ready to work towards a plan for the fall and the future season'",
        "'speaker_3': '. We do hope there is time to play and we are ready and willing and we do have a plan set in place to prove that. Thank you again for your time and thank you for your service.'",
        "'speaker_4': 'Thank you. Next we have Victor Boosie. You have 3.'",
        "'speaker_3': 'Minutes. Oh, I get it. So right now. I keep saying to do find from the Long Beach Police Department that means policing is not the answer to our schools and communities pressing needs, including jobs, housing, homelessness, health and immigration.'",
        "'speaker_3': 'We want to divest from the police and redirect the resources so that black, indigenous and people of color can live successful lives, reimagine community safety without police terror, and grounded in restorative justice and black empowerment. Idea of my time.'",
        "'speaker_4': 'Thank you. That's the end of public comment for this item.'",
        "'speaker_0': 'Thank you. Councilman's in the house.'",
        "'speaker_2': 'Yes. Thank you, Mayor. First of all, I wanted to thank Councilmember Longo for bringing this item. I think it's incredibly important that our kids have much safe, much needed safe access to these recreational opportunities as possible, especially right now.'",
        "'speaker_2': 'I also think that it's very important for us to consider how impactful this could be for so many families that have limited access to childcare due to COVID 19. I'm so happy to support this item that has the chance to improve the lives of so many residents in this way.'",
        "'speaker_2': 'In addition to what my colleagues have said, I think it's also important that when city staff is working with with the leagues to create this opportunity, that they really consider equity and how this impacts the kids across our city.'",
        "'speaker_2': 'I'm thinking specifically of the neighborhoods on the West Side and the downtown and central Long Beach that could really benefit from this kind of programing. So I'd just like to ask staff to please keep those residents in mind when you're working on items like this.'",
        "'speaker_2': 'I'd also like to just really quickly use this opportunity to remind our community that as we continue to reopen in ways that are safe, we are still seeing a lot of COVID 19 transmission in Long Beach. Our hospitalizations especially have increased over the last four weeks.'",
        "'speaker_2': 'While we feel comfortable taking these steps safely. This is this is all dependent on each one of us continuing to take all the precautions we need to in order to protect the most vulnerable members of our community. Thank you again, Councilmember, for bringing this item forward, and I am happy to support this item.'",
        "'speaker_0': 'Thank you. I have Councilwoman Mango. Let me let me go first, then I'll go back. Go ahead, Councilman. Councilman Mongo. Okay. I don't hear Councilwoman Mongo. Let me let me make a comment and then I'll go back to Councilwoman Mongo.'",
        "'speaker_0': 'She can need her phone there. Maybe. I'm Mr. Modica. Are you there? I want to. I want to make sure also, because I think a lot of us have heard about youth sports and about obviously the enormous need for them city wide, but also just the unknown for parents.'",
        "'speaker_0': 'It's so hard to kind of plan. Obviously, summers and leagues and and schedules without knowing and having kind of definitive answers. The right. Now, as of today, the decision on whether a kind of organized sport league is going to happen is up to the state of California.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_5': 'Yes, that's correct.'",
        "'speaker_0': 'And so I know I've had a couple of questions and folks reach out and say, hey, Long Beach should allow some of these leagues like soccer or baseball or others. And what we've shared is what we know, obviously, with the health department has shared with us, which is they are not legally permissible right now under the state's'",
        "'speaker_0': 'health orders. And that doesn't mean, by the way, that that can change. You know, we've been we've been advocating for the state to give us clarity so that we would get an idea about what's ahead. Because there hasn't there has been very little clarity on kind of on on sports and youth sports.'",
        "'speaker_0': 'Is that right, Mr. Modica?'",
        "'speaker_5': 'Yes. So under the current stay at home order from the governor, team sports of any kind is not allowed. So they're still prohibiting gatherings which include team sports. Just last week, they released some guidance on camps in summer camps.'",
        "'speaker_5': 'So if there are very small group camps, we just got some clarity that those can operate as long as they're small staff ratios, small groups that don't interact with other groups. You know, these are things like four two, one, 621 and in some cases up to 10 to 1.'",
        "'speaker_5': 'So that's currently allowed, but not youth sports. And we think this item is going to be helpful so that we have a chance to talk to all of our youth sports so that if and when we get that, go ahead and and we can do it safely with our health officers direction, we would be able to move'",
        "'speaker_5': 'forward.'",
        "'speaker_0': 'Great. Thanks so much for that. That's great. Thank you. And Councilman Mongo on yet?'",
        "'speaker_2': 'Yes, I was here in my speaking just so I could hear you, but you couldn't hear me. Thank you. I just want to again thank my cosigners. I appreciate Rosalind Sunday House's comments. And in preparing the item, we were thinking about the whole city and preparing the city wide.'",
        "'speaker_2': 'We're really fortunate to have such a collaboration among our leaders. And then I also just wanted to give a big thank you to everyone on the city team who did what I believe to be a remarkable job in blending our summer engagement programs from the drop in and the standard camp.'",
        "'speaker_2': 'For this to be a blended program where more of our our our participants citywide can be involved on a more reasonable basis. So bringing the the melding and merging of those two programs, I really think was innovative. And I know that it's hard to find a silver lining in such difficult times of COVID.'",
        "'speaker_2': 'And so these are these ideas that are coming in from the staff and the community and can really change the way we provide government. And I think that this is a great example of that. Also encourage our team sports to think through that.'",
        "'speaker_2': 'And again, I think my cosigners and all my councilmembers are supporting.'",
        "'speaker_0': 'Thank you, Councilwoman. We're going to go ahead and go to a vote. Roll Call.'",
        "'speaker_1': 'District one. I district to. At District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five. I. District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District nine. High ocean carries.'"
    ],
    "Ordinance on Short-Term Rentals.": [
        "'speaker_0': 'Thank you. Moving on to the next item that motion carries, that was item. Now we're going to go to item ten. Madam Kirk, did you have an announcement before we go? Item ten.'",
        "'speaker_1': 'This is a reminder to all the public speakers. Please stay on topic to the item that you are addressing. We will be cutting off public speakers who are not speaking on the topic or the item that they have signed up to speak on.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay, please. Item ten.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to declare ordinance amending Title five of the Long Beach Municipal Code related to short term rentals. Read the first time and lead over to the next regular meeting of the City Council for Final Reading and adopt a resolution to submit the ordinance amendments to the California Coastal Commission citywide.'",
        "'speaker_5': 'Thank. Thank you, Mayor. This is city attorney Charlie Parker, and I will turn it over to Monica Kalina, deputy city attorney for the staff report.'",
        "'speaker_2': 'Good evening. At sample recall this matter is before you on January 19th and again on May 19th of this year for the City Council's direction on May 19th, we have prepared a further revised ordinance regarding regulations on short term rental.'",
        "'speaker_2': 'Under the revised ordinance, all unhosted as cars would be prohibited citywide, although hosted ACR would be permitted subject to the regulations contained in the ordinance as directed by Council. City staff will work with hosting platforms and other regulatory agencies, including the city's health department, to develop cleaning and sanitizing protocols specific to the operations of NCR, with an'",
        "'speaker_2': 'emphasis on standards for Unhosted speakers, should the Council later amend the ordinance to permit such operations as per the direction of Council? Unhosted ACR will be prohibited for at least six months and will remain prohibited until city staff present the report to the Council to reconsider amending the ordinance to permit the operation of Unhosted, ACR and Council'",
        "'speaker_2': 'requests and approves such amendment. It is important to note that the provisions related to the petition process to prohibit Unhosted esprits within a census group have been completely removed from the proposed ordinance because Unhosted speakers would no longer be authorized at this time.'",
        "'speaker_2': 'It should also be noted that unlike most ordinances adopted by the Council, which become effective in 30 days, this ordinance will not become effective for 120 days, which will give staff the time necessary to develop appropriate administrative guidelines to ensure a smooth rollout of the new regulations.'",
        "'speaker_2': 'Although not specified in the ordinance, any operation of a hosted ACR would be subject to all relevant Long Beach, COVID 19 health orders and any related protocols, as is currently the case with other business activities in the city.'",
        "'speaker_2': 'Finally, as with all ordinances that have city wide effect, this ordinance will not become effective in the coastal zone areas of the city until it is first certified by the Coastal Commission as being compliant with the city's local coastal program.'",
        "'speaker_2': 'Thank you. And that concludes my report and we are available for questions.'",
        "'speaker_0': 'Thank you. I have emotion. Councilmember Pierce, I think you're going to have Councilman Price. It's either the second or the second. Got some repairs?'",
        "'speaker_2': 'Thank you. I want to thank staff for their work on this. I know that it's been several years. I appreciate that the process.'",
        "'speaker_1': 'Is has been laid out, as you mentioned.'",
        "'speaker_2': 'That this would come back in six months, that the staff could come back to the council with the report and at that time evaluate whether or not to an unhosted. And I also want to clarify that I've had conversations with city staff today around the health orders and recognize that those health orders are temporary and recognize that'",
        "'speaker_2': 'the city staff supports this motion today so that they can be able to move forward to bring on the consultants and start the hard work that we've been waiting on. So I really appreciate everyone's efforts and I ask for a yes vote today.'",
        "'speaker_2': 'Thank you. Price point. Q I support this item as well. I do have an email from a constituent that I wanted to get further clarification on, and it involves large scale special events. I think we discussed it in the January meeting.'",
        "'speaker_2': 'Tom Massa, Deputy City Attorney, to clarify for us a little bit of what her understanding is of what the ordinance would allow in terms of large scale special events.'",
        "'speaker_5': 'Councilmember.'",
        "'speaker_2': 'This is I believe we have staff from development services on the line for that question.'",
        "'speaker_5': 'Yes. Lisa Powell Development Services will answer the question.'",
        "'speaker_1': 'Good evening. Members of the council. Yes, the.'",
        "'speaker_2': 'Um. Currently, there are the large scale.'",
        "'speaker_1': 'Events, but those events will be won't occur until the ordinance becomes effective. And there are guidelines are the health health protocols and guidelines will allow such events.'",
        "'speaker_2': 'Okay. But that's going to be the second phase, which would come after six months when we have a discussion on the topic about on posted, correct?'",
        "'speaker_1': 'No, it would come after the four months when the ordinance becomes effective, as long as the health protocols and all of those sorts of things are put out by the health department would allow such events.'",
        "'speaker_2': 'Okay. And can you describe for me a little bit what what those events would look like? What are the parameters of such events?'",
        "'speaker_1': 'So those events will be required to get what is called an occasional event permit. They would have to describe the event, how many people they anticipate having, and they would be tracked as to the limit of how often that they could occur.'",
        "'speaker_2': 'And would there be a discretionary process as to the granting of permits for each of those events?'",
        "'speaker_1': 'At this point in time, very visioning that that occasional event permit process will follow the same process that is used for occasional events that go on on public property. And and this is Linda Tatum. I just wanted to weigh in and describe that process slightly.'",
        "'speaker_1': 'That is, that process is issued its through the special events in the city manager's office, but it's also reviewed by the business license office and it's brought it to other departments such as development services. My understanding also the police department, so that based upon the nature of the event, appropriate security or precautions or conditions put in place'",
        "'speaker_1': 'to ensure that there is no negative or to minimize any potential public impacts.'",
        "'speaker_2': 'So is there any noticing requirement for that? Ms..'",
        "'speaker_1': 'Tatum There is no noticing requirement, but those are what we call the ops. They are limited to six events per year per address.'",
        "'speaker_2': 'Okay. And so those EPS would be granted if all of the departments that are reviewing it recommend they be grants granted under the circumstances.'",
        "'speaker_1': 'Yes, they all get to weigh in and it is required that they be that all of the concerns that those various department reviews recommend are appropriately addressed.'",
        "'speaker_2': 'Okay. Because my concern is obviously and I share this with a constituent who reached out to me special events in residential neighborhoods where there's a lot of density and parking impacts that I'm sure this is not what's envisioned in this provision.'",
        "'speaker_2': 'But if you read the four corners of it, it doesn't preclude EPS in specific neighborhoods, for example. So I just want to make sure that obviously the intent of this is to minimize impacts on residential communities, the intent of all of this legislation that we've talked about at length.'",
        "'speaker_2': 'And so that that would be something that would be taken into account as part of the intent of allowing staffers in the city.'",
        "'speaker_1': 'That is correct.'",
        "'speaker_2': 'Okay. Thank you. I support moving forward tonight. Thank you. And I second things about you.'",
        "'speaker_0': 'Next up on the list is Concern Mango.'",
        "'speaker_2': 'Yes, I appreciate the discussion. I heard Councilman Pierce's comment related to the governor's order. I just thought it was important to kind of outline what that order is and staff are. Is your understanding of the governor's order that he believes or the state believes that?'",
        "'speaker_2': 'Unhosted. Short term rentals are actually safer than hosted. Therefore, the unhosted are currently allowed and hosted are not.'",
        "'speaker_5': 'This is Tommy. So correct. The current health order does not allow for hosted stars where somebody is in your home and there's the ability to interact and touch items that the person would also touch. It is currently allowing for unhosted.'",
        "'speaker_5': 'That just came out. We also do see changes to the health order regularly. So this is the first one that we've seen on this year and I would expect that to adapt and change over the next couple of months, if not earlier than that.'",
        "'speaker_2': 'So this just kind of goes to my previous point that I didn't feel that the comments made by Councilman Pearce last meeting really aligned with what I had understood with the health concerns. Specifically, I mentioned that a lot of the short term rental platforms have requirements and guidance for cleaning.'",
        "'speaker_2': 'And while hotels also of requirements and guidance for cleaning, the difference, I feel, at least in my reading of the information, is that if a short term rental unit deemed by those rules, they would be suspended from the platform.'",
        "'speaker_2': 'And we don't currently inspect on a room by room basis, city wide the standards. And while I recognize that a lot of the major brands have those standards rolling out, we really rely on community members to inform us when businesses aren't abiding by the coronavirus initiative.'",
        "'speaker_2': 'And I know, Mr. Modica, you and I spoke earlier in the week about a couple of reports of violations. And it's always important to remind the community when hearing items like this that if they know of violations to the ground virus standards, that there's a number that they can call 562570.'",
        "'speaker_2': 'Which one is it, Mr. Mullica?'",
        "'speaker_5': 'It is 2633. That's 5702633 is the code enforcement task force.'",
        "'speaker_2': 'And expression is once this is approved by council, does this need to go to another commissioner body or is it a go once development services is.'",
        "'speaker_3': 'Comfortable?'",
        "'speaker_1': 'Once the ordinance is approved by the city council, the next step is that four month period for staff to begin the implementation procedures and to bring the consultant online. But the next step is that the because the item is or it requires an amendment to the city's local coastal program.'",
        "'speaker_1': 'This entire packet would have to go to the Coastal Commission for for review and approval.'",
        "'speaker_2': 'And what is the wait time on something like that.'",
        "'speaker_1': 'The the time period for council to respond. It varies anywhere from three months to 12 months. It really depends upon the council's. The Coastal Commission's staffing at any point in time. However, what staff would propose to do would be to submit it to the Coastal Commission immediately after council's ratification, so that during that four month period, while'",
        "'speaker_1': 'staff is ramping up, preparing the administrative regulations and getting the consultant on board, we will have already submitted it to the coastal so that so that there we don't waste additional time or we get at least a four month lead time for the council to review it and get back to the city.'",
        "'speaker_2': 'Ms. TAYLOR. But we need to then go back to the Coastal Commission again. If the Council decides to expand this to. And hosted in the fall?'",
        "'speaker_1': 'That is correct. Any time we change any of the city's zoning code provisions that would apply in the coastal zone, they do need to be ratified by the Coastal Commission.'",
        "'speaker_2': 'Okay. So I feel like the wording and dancing around of the way in which this has taken place in terms of using the stay at home order to kind of state that that was the reasoning behind going with hosted and hosted.'",
        "'speaker_2': 'All of that to me just doesn't seem like really in alignment with the current. Data that's coming from the state. And so I would hope that we would then reconsider and join them together, even if it meant starting both of them six months from now instead.'",
        "'speaker_2': 'Because what I see now is an additional staffing process and an additional delay that will happen in going to the Coastal Commission twice. So that would be my thoughts on the item. And so I'm not supportive of the way that it is today.'",
        "'speaker_2': 'I'm just from a procedural reason. I think that it doesn't it also strips neighbors of income that they've relied upon for quite some time. And the two neighbors that I talked to, that coast stars in in our communities, they are on hosted stars and that helps them pay their mortgage and when they're not there.'",
        "'speaker_2': 'And so that that's just a concern for me that we're taking away the income of people in our communities during the time when they've needed this kind of income to kind of get them through. Well, business is not that great.'",
        "'speaker_2': 'One of them specifically is an employee of the convention center, and it doesn't have any hours right now. And so it's it's just a big concern that we're taking away people's income and approving a C.R. clause that's not even currently allowable by the state.'",
        "'speaker_2': 'So I wish it could have gone a different way. Again, I support Councilman Price's. Information related to what we can do to restrict and ensure that the communities are safe and that these are good players. And we've talked to do that for months and months.'",
        "'speaker_2': 'It's just unfortunate that we've split it this way. So I won't be supporting Adam tonight.'",
        "'speaker_0': 'Thank you. Councilmember Price.'",
        "'speaker_2': 'Thank you, Mr. Meyer. Mr. Miller, I appreciate those comments. Councilwoman Mango, a couple of things on that. This is an issue that, like you, many of us have worked really hard on involving our residents and trying to get feedback.'",
        "'speaker_2': 'We're trying to do the way it's I don't know the wording it use. But look, this way, I think is what you said. The way the reason for this is because we are trying to support the numerous residents who have hosted stars and many of them are seniors, and they depend upon the income that they get from'",
        "'speaker_2': 'renting out a room or renting out a back house or renting out some portion of their property as a hosted ACR. We're trying to support them and we're trying to support them while we explore the options and the practices and procedures and work with the providers to hone in and figure out what works best for our city'",
        "'speaker_2': 'in terms of future enforcement. So I do support moving forward with that piece of it. As a council member who represents the coastal district, I know I can speak for myself and Councilmember Pearce. The fact that it has to go to Coastal Commission for ratification is not at all a concern that I have or I think Councilmember'",
        "'speaker_2': 'Pearce has. Coastal commissioners focus has always been access to the coastal zones. So us allowing additional access through additional short term stays and hotels and anything that allows for access in the coastal zone is not going to be an issue that I anticipate.'",
        "'speaker_2': 'We're going to get a lot of resistance from, from the Coastal Commission and I don't expect the process to be so burdensome that we have an efficiency argument to make because of the nature of the task in regards to this particular ratification request.'",
        "'speaker_2': 'So, you know, sometimes when we're talking about working with Coastal Commission and getting approval from Coastal Commission, we want to make sure that we're efficient in our ask so that we include as much as we can in the ASC so that they can evaluate something in its totality.'",
        "'speaker_2': 'In this circumstance, we're trying to approach this prudently and we're trying to approach it in phases. And I think that that's not something that's going to have a negative impact on the ultimate ratification decision by Coastal Commission, because ultimately the goal is to enhance access to the coastal areas.'",
        "'speaker_2': 'But we're doing it in phases because that is what works for our city. So I would urge council to support this item. I do believe that I do anticipate that we will move forward with allowing the UNHOSTED, but we'll have to take a look at the number.'",
        "'speaker_2': 'We'll have to take a look at the conditions. We'll have to take a look at some of the practices that have been in play for the first six months where we have the hosted scars. And I think those experiences and those opportunities that we have will better inform the decision in terms of what we allow at the'",
        "'speaker_2': 'next time we vote on this in six months. So I'm supportive of it. I do appreciate that this allows also our residents who live in highly impacted residential communities with parking impacts and such, to have an opportunity to see how we are able to enforce the first phase of this ordinance, which is the hosted stars, because enforcement'",
        "'speaker_2': 'is going to be a critical piece and I think residents will be much more likely to embrace this program if they see that the city has an enforcement mechanism in place, an enforcement mechanism in place that they can deploy as needed.'",
        "'speaker_2': 'And having the six months will allow us to develop that infrastructure in the city so that we're able to follow through and execute that in the way that we're promising residents, where sometimes we promise them enforcement, but we really don't have the enforcement infrastructure set up, so we can't follow through.'",
        "'speaker_2': 'This phasing allows us to do so. So while I appreciate that there are some residents who depend on short term rental income. That's a little bit disappointing for me to hear because they're relying on income based on. An operation that currently is not allowed in the city.'",
        "'speaker_2': 'So I think if you're relying on income doing something that's prohibited in a city, you kind of take the risk that at some point what you're doing is not allowed and may not be allowed to continue. My hope would be for those folks that they would partner with us so that we could move towards phase two and'",
        "'speaker_2': 'they can have compliance with what the city ordinance will be because if they've been relying on income running and hosted us here. They're running an operation that's not allowed in the city. So you kind of you take that with some risk.'",
        "'speaker_2': 'So hopefully the six months departure and allowing us to say is in will allow them to also participate and make sure that they are one of the ones that gets licensed when the time comes. But I think the comments are very, you know, very, very thoughtful.'",
        "'speaker_2': 'And I think they do take into account a category of folks who rely on income but rely on income for prohibited activity. And so hopefully as we go into phase two, they're able to recoup that income in a way that is legal and lawful through the city.'",
        "'speaker_2': 'So I would ask my colleagues to support this motion.'",
        "'speaker_0': 'Thank you. Councilman Muggeridge, you back up again. Is that a second Q or no? Councilman Mongo.'",
        "'speaker_2': 'Yes. I appreciate that. I guess a lot of these individuals started before we had banned short term rentals. And then when we did, we kind of talked about. And allowing certain organizations to continue to operate until we got some things in order.'",
        "'speaker_2': 'And we as a city have kind of had to take a lot of time because this is an evolving market that we don't know a lot about. And I do appreciate that there are less than there are hosted.'",
        "'speaker_2': 'There are less posted. Participants in the city than Unhosted. I also have heard from a lot of people who felt that after the meeting two times ago when we spoke about this, that we were on a track where Councilman's and De Haas had really taken the lead on lifting it to 1000 within the city.'",
        "'speaker_2': 'And they had hope in all of these things. And then. The city changed direction. And I know that the whole world has kind of been on its head, but I guess that that's why my discussion related to I'm at the last meeting kind of talked about well.'",
        "'speaker_2': 'Homes that are safer. And that's just not what has come about. And again, I recognize, especially in our communities that hosted our really the primary, but then students are also now not in school, so they don't need those.'",
        "'speaker_2': 'So I think a lot of things have changed. I appreciate your feedback and I will reconsider and think it over for a few minutes before I thank you.'",
        "'speaker_5': 'So, Mayor Council, this is Tom. If I can add one thing. Councilman Austin Mayor when I get a second, if you can add if I can add some clarity.'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_5': 'So one thing that we talk about in our lingo is hosted versus UN hosted and the state order actually talks about occupied and unoccupied. So I just wanted to make sure that that was clear. What the state order for COVID is trying to do is prevent people coming together in a shared space.'",
        "'speaker_5': 'So that would prevent people from coming into your home, from being in any place where you as the resident are interacting with them. It would allow a hosted STR where there's no interaction, where it has a separate entrance, where it has, you know, if it's a duplex, if it's in your backyard.'",
        "'speaker_5': 'So I just wanted to make sure that was clear. Those would still be allowed under the health order, even though they're hosted. They're just they're unoccupied. Same thing as if the resident were to leave and not be there.'",
        "'speaker_5': 'That is then considered an unoccupied unit rather than occupied. Thanks.'",
        "'speaker_2': 'Thank you. That helps a lot.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_3': 'Oh, yes. Thank you, Mr. Mayor, and I appreciate the conversation. I definitely appreciate all of the very detailed work put into this item by our city staff. I appreciate the process that we have gone through to get to this item coming before us this evening.'",
        "'speaker_3': 'It has been many, many months and, you know, a lot of back and forth between the stakeholders. I'm not sure that we were able and have been able to get to a place where people can 100% agree on the approach moving forward.'",
        "'speaker_3': 'But I do appreciate the efforts and the level of compromise that has gone into getting us to where we are. I will have to agree with Councilmember Mongo. I do believe that the dynamics have changed, obviously considerably. COVID 19 has really forced everyone in every situation really rethink our matters.'",
        "'speaker_3': 'I'm concerned with, you know, Long Beach. I'm concerned about what is the best move for our city in terms of, you know, a total strategic thought on this. I want to know, how are we set up to enforce this this ordinance of citations and whether or not we're creating a situation where we're now encouraging property owners in'",
        "'speaker_3': 'our city to have invested in our city, to go now underground in terms of subleasing their they're their spaces. And so I'm a mom, although, like I said, I'm appreciative of the process. This doesn't feel like it's it's 100% right.'",
        "'speaker_3': 'And I do have my concerns. I'm likely to support the item before us this evening because I think, you know, six months from now coming back to talk about the Unhosted platform uses is is. It's something that we have to do.'",
        "'speaker_3': 'We definitely have to do that. And so I just wanted to share my concerns just initially in my comments. Thank you.'",
        "'speaker_0': 'Thank you. Please go ahead and do any public comment. Madam Kirk.'",
        "'speaker_6': 'We have one public comment.'",
        "'speaker_4': 'Victor Boosie, you have 3 minutes.'",
        "'speaker_3': 'So. The two boozy cold nights at a away. So you all just spent all this time talking about process. All this work went into FDI, short term, short, short term rentals. Now it's Airbnb. Call it what you want.'",
        "'speaker_3': 'It's a $38 billion company. You're putting all this effort in for more capital when the capital needs to go. One place economy. Housing is a human right. People shouldn't be making money off of housing again. Housing is a human right.'",
        "'speaker_3': 'So you guys spent all this time and effort. For Airbnb, a $30 billion company. But work on all these rules so people could make more money off of human rights. That's disgusting. Literally disgusting. The money should go to de-fund BTD.'",
        "'speaker_3': 'That's it. We're coming for your jobs. Either resign, retire, or get voted out. De-Fund the idea of my time.'",
        "'speaker_4': 'Thank you. That's the end of public comment for this item.'",
        "'speaker_0': 'Okay, thank you. With good Casper votes. And a reminder as we do that that item will be back in six months for additional obviously council dialog on so. Madam Court.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District two District three I District four.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five. I. District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven. By District eight.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'District nine. I ocean carries.'"
    ],
    "Support for Assembly Bill 1196 on Carotid Artery Restraint Ban.": [
        "'speaker_0': 'Be. Thank you. Let's see, try to do some of the council items first here that we had a request for. Let's go ahead and do item 15 than 18 because I think our council items.'",
        "'speaker_1': 'Communication from Councilman Austin, Councilwoman Price, Vice Mayor Andrews. Councilmember Richardson. Recommendation to request City Council to support Assembly Bill 1196.'",
        "'speaker_0': 'That's when Austin.'",
        "'speaker_3': 'Thank. Thank you, Mr. Mayor. I'm having a little bit of technical difficulties here, but I'd like to thank my colleagues, colleagues Price Council Member Price Andrews and Council Member Richardson for signing on to this item of. In normal circumstances, an item like this would go to our state led committee.'",
        "'speaker_3': 'But in light of the moment that we are in, I think it's important for us to, like many other police agencies across the city, across the state, to reexamine in-country, to reexamine the use of force tactics by a police department.'",
        "'speaker_3': 'I'd like to thank our police chief and a lot of his power, who proactively announced last week that the police department would immediately suspend the use of the carotid artery restraint. Several other police departments throughout the state have taken similar actions recently.'",
        "'speaker_3': 'It's now time for language to go on record. The support of Assemblymember Mike Gibson's legislation, HB 1196 to ban the use of this tactic by police officers statewide. Karadzic. The carotid artery restraint, also known as the sleeper hold, applies pressure against the carotid artery.'",
        "'speaker_3': 'They have blood flow to the brain, which can render the person unconscious and can aggravate underlying health conditions that an officer may not be aware of. While the federal government is also moving forward to ban chokeholds, I have joined in Assemblymember Gibson's call for other states and Congress to move forward with California's lead on ending this tactic'",
        "'speaker_3': '. And I would also just point out that an L.A. Times article review of the California Department of Justice records from 2016 to 2018 on the law enforcement throughout the state reported injuring 103 people using carotid restraints during those two years.'",
        "'speaker_3': 'Two, three, two people were actually killed and 91 were left unconscious. Blacks make up 23% of those injured by neck restraints, while comprising only 6.5% of the state's population. My council colleagues, I think this is a no brainer.'",
        "'speaker_3': 'I ask for your unanimous support of this item, and I also would just again thank our council member, Richard Richardson, who was a chair of our state led committee, for signing on to this and allowing us to skip the state legislative process in committee.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'Thank you, Mr. Mayor, and count on Councilman Austin. Thank you for bringing this item forward. This is absolutely lutely the right call to support this legislation, and I'm grateful to the assemblyman for bringing it forward. This is there are so many use of force options available that are less torturous, less cruel and and less harmful.'",
        "'speaker_2': 'And I am grateful that our police chief was proactive in making declarations regarding this type of use of force. And I'm hopeful that other police chiefs in the region and throughout the state will follow. But I think having this legislation in place is a clear signal to everyone that we're talking about a necessity of use of force'",
        "'speaker_2': '. There are certain use of force practices that are more harmful and more dangerous than others and frankly, more cruel when we're talking about depriving someone of air. And we're we're talking about the area of the body that's so prone to injury.'",
        "'speaker_2': 'So I'm I'm very happy to sign on to this item as chair of the Public Safety Committee. I know we're going to be talking about some of our use of force options and practices and adopting new best practices as we move forward.'",
        "'speaker_2': 'And certainly looking at how our use of force practices impact different communities and in this case, impact black communities more than any other race. And I think it's very important to call that out. And I thank you, Councilman Austin, for bringing this forward.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Council. Woman Council member Richardson. No, I'm sorry. I'm sorry. Council members and de Vos, then councilor anger.'",
        "'speaker_2': 'I absolutely agree with my colleagues. This is absolutely the right decision for this. I'm also very grateful to Chief Luna for taking the proactive steps of eliminating the method, this method in Long Beach. But that's just one long overdue step.'",
        "'speaker_2': 'And so but it but a very welcome one. I believe we need to rethink the ways that our law enforcement officers are permitted to use force. And I look forward to working with my colleagues to reexamine the way that we conduct policing in Long Beach.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'That's we, Ranga.'",
        "'speaker_3': 'Thank you, Mayor. And I totally agree with all the comments of the councilmembers, but in a very short way. It's time. The time has come to get rid of this. Abusive force of use of force to control and apprehend individuals.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Casa Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Just a few a few points. First, thanks to Councilman Austin for reaching out. We do have a state legislative process. We have a meeting coming up next week. There's a number of bills that will be tracking with respect to use of force reparations, the repeal of Prop two or nine.'",
        "'speaker_3': 'We've invited the chair of the Black Caucus, Shirley Weber, to come and be a guest on our state legislative committee. But I think it makes sense, given that this legislation was sponsored by a local city council, our local assembly member, Mike Gibson, that represents North Palm Beach.'",
        "'speaker_3': 'The city takes this immediate opportunity to be on the record in support. I know that when you take a two off, off the table, broadens the conversation and sort of creates the conversation about what do you do if you don't have this tool?'",
        "'speaker_3': 'And that's the conversation that we need to be having here locally. I support this this activity, this action and state legislative committee will will also be taking this on. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Pierce.'",
        "'speaker_2': 'Thank you. Echo the comments that I appreciate you guys bringing it forward to the council quickly and making sure that we can give the support. And obviously, I think we've all had lots of conversations with the city staff, the police chief and with the public about trying to make sure that our police department is one that doesn't'",
        "'speaker_2': 'use excessive force. And this is obviously one of those actions. I look forward to community members. I want to just mention the framework and the process that's there and making sure that community members are engaging in the open sessions that are public now, and particularly around the public safety piece and the police section, so that we can'",
        "'speaker_2': 'have a full conversation about what, as Councilmember Richardson said, tools are there. What do our police officers do? What is the training? And how can we make sure that we are limiting excessive use that might do damage to our residents, whether they're they're black or not?'",
        "'speaker_2': 'And so I fully support this and really appreciate you guys bringing this forward and look forward to the next conversation.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Vice Mayor Andrews.'",
        "'speaker_3': 'Yes. First of all, I want to thank our councilman also for bringing this item forward. I think I definitely think that's the direction that we should be going into. And thank you again. Quentin is for it.'",
        "'speaker_0': 'Thank you. That concludes council comment. I know that the police chief wanted him some comment as well, Mr. Learner.'",
        "'speaker_6': 'Thank you, Mayor. Members of the City Council, thank you for recognizing the work of the men and women of the police department and the fact that we issued a special order back on the 9th of June to suspend the use of the carotid restraint.'",
        "'speaker_6': 'Also want you to know that our work is not going to stop there as we re-envision how it is and what it is to work with our partners in the community. I also want you to know that we issued a special order today that puts more management controls on no knock, no knock search warrants that went out'",
        "'speaker_6': 'today. We haven't put that out yet publicly, but it will be probably by tomorrow. We're also working on an early intervention system that helps us identify any potential problematic employees. That will be very helpful to us at all.'",
        "'speaker_6': 'And I just wanted to comment that when you look at a lot of of the reforms that are suggested, either at the national level, either by Congress or at the state level, and others others that are talking about it, your police department is already way ahead of the curve.'",
        "'speaker_6': 'And there's a whole list of things that we do specifically in the training realm that we've been doing for several years, such as number one in our use of force policy. And the overarching message is that we have an absolute reverence for human life under any circumstances.'",
        "'speaker_6': 'That special order went into effect as of this January, and it is consistent with what you hear over and over in the state. Things like we look at my. All of us in here really quick. Or we're talking about, one, a duty to intervene, which is talked about a lot that's already in our policy mandatory that we'",
        "'speaker_6': 'de-escalate whenever possible. And our officers do that over and over again, that we give verbal warnings. And even to the extent that use any use of force is proportionate to the situation that we're in and also that. When host use of force that the officers are absolutely required to provide medical aid.'",
        "'speaker_6': 'That's really important. The training that you hear about over and over, whether it's crisis intervention, training, training on de-escalation, training on implicit bias, procedural justice, the use of body worn cameras, those are all things your police department has been doing now for several years.'",
        "'speaker_6': 'And I just want to conclude by saying that what we're doing is working. Is it perfect? Well, I have a deputy chief right now assigned to review a lot of our use of force policies and everything that we do to make sure that we are meeting our community standards.'",
        "'speaker_6': 'And the standards are laid out across the country. And just to give you an example, in 2019, when you look at our uses of forces compared to our arrest and our total stops are our percentage was 1.67 ratio per every arrest we made.'",
        "'speaker_6': 'That means that our officers were doing an amazing job in very difficult circumstances, specifically when they're dealing with people in crisis, either mental illness or substance abuse, and only 1.67% of the time they use force. Maybe someday we'll get that to zero.'",
        "'speaker_6': 'But that's why we've got a lot of work to do. So with that, I'll conclude my comments. Thank you very much.'",
        "'speaker_0': 'I think you also have a controversy here and I think just keyed up also.'",
        "'speaker_3': 'Thank you. I want to have the chief let him have the last word. But I'll just say very briefly that from as mentioned, Mike Gibson representing Carter Long Beach to Austin, thank you for bringing this forward to our police chief.'",
        "'speaker_3': 'It's just very gratifying to see Vimy Ridge take the lead on this issue. Thanks.'",
        "'speaker_0': 'Thank you, Madam Cook, to be a public comment on this item.'",
        "'speaker_1': 'There is one public comment on this item.'",
        "'speaker_4': 'Victor Boosie, you have 3 minutes.'",
        "'speaker_3': 'Vegetables in line 0808. This is my zip code. It's not that the police are ineffective. Many communities, they are harmful. The history of police policing in this country come from slave catchers. It's more than brutality. It's more than reforms.'",
        "'speaker_3': 'In stark contrast, the drug war, the prison complex, all these things combined bring injustice to black people, especially here in Long Beach. You're talking about Mike Gibson. Mike Gibson was the Linwood cop. The Linwood Police Department had to be disbanded because they were so corrupt and crooked.'",
        "'speaker_3': 'What did Mike Gibson do in that police department? What did he do for not be a bad apple? Who did he read out? Nobody. So you're telling me a former cop from a shady. Police Department is the one who is going to give me a reform.'",
        "'speaker_3': 'No, I am not taking it. Reforms don't work. Video footage, whether from body cameras or other sources, wasn't enough to get justice for Philando Castile. Samuel de Bois, Walter Scott, Tamir Rice and far too many black folks are police violence.'",
        "'speaker_3': 'Reforms are not the problem. The police are the problem. It's time for something new. Community groups in the sixties also demanded civilian review boards better trained in community policing. What happened since the sixties? It took till 2021 to defend it.'",
        "'speaker_3': 'It took from 2020. But you often see that black lives are sacred. Forget that we don't want your reforms. We want to defund our DPD. That's it. Those are the demands. Understand the demands. We get to take your money.'",
        "'speaker_3': 'We're here to take your jobs. This is over. We demand justice for all black people in Long Beach. That will bring up all marginalized people in Long Beach. This have gone and not gone far too long. It needs to end.'",
        "'speaker_3': 'The people are in the streets. Listen to the people in the streets. Too much violence has been borne on decade after decade by police, and the best reforms do nothing to help us. We are still dying in the streets.'",
        "'speaker_3': 'Black Lives Matter. We would not be protesting for all these years. It's been going on over and over and over again. And every time there's a reform, that's it. It gets co-opted, it gets retired, it gets overturned depending on who's in office.'",
        "'speaker_3': 'Anything on the federal level can't state. The only thing I can think is taking money away from the police department. That is the only reform that works is to defund the police. That's it. Defund Albee P.D.. Don't give me talking about chokeholds.'",
        "'speaker_3': 'Are you serious? Now you're banned. Chokeholds. So before this, it was okay to choke a black man to death. Are you kidding me? Is that the reform that you have for me as a black man? To have a black man on the city council?'",
        "'speaker_3': 'That's all you guys got?'",
        "'speaker_4': 'Well, thank you. That's a conclusion of public comment for this item.'",
        "'speaker_0': 'Okay. Thank you. Please go ahead and call the roll call.'",
        "'speaker_1': 'District. One eye to eye. Three.'",
        "'speaker_2': 'Eye.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five by district six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Ocean carries.'"
    ],
    "Funding Allocation and Direction for Restart Grants to Businesses Damaged by May 31st Events.": [
        "'speaker_0': 'Okay. Item 17, please.'",
        "'speaker_1': 'Communication from councilwoman and House Councilman Supernormal Vice Mayor Andrews Councilmember Turanga. Recommendation to transfer one time district priority funds to the Small Business Restart Grant Program.'",
        "'speaker_0': 'Not from us.'",
        "'speaker_2': 'Thank you, Mayor. First of all, I'd like to thank my colleagues for their work in bringing this item forward. This is one of several items on tonight's agenda that aim in assisting our small businesses, which I think demonstrates our commitment to making sure that we are doing all in our power to assist them through a very difficult'",
        "'speaker_2': 'time. I'm excited that these resources can go towards grants that do not need to be paid back as well. I think it's important that we do our best to create opportunities and local interpersonal can take advantage of what without having to worry about consequences or or down the road.'",
        "'speaker_2': 'So I'm very grateful for the chance to help and be part of the solution. And I look forward to continue steps to protect our residents, our businesses that have been mostly impacted. I would like to make one amendment to the portion of the language, if I may, to the fourth District should read it increased appropriation in general'",
        "'speaker_2': 'funds approved in the Economic and Development Department by 25,000, offset by the fourth Council District one time district priority funds transferred from the city wide activities departments to be used for fourth District Council District Restart grants for two businesses damaged by the event on May 31st.'",
        "'speaker_2': 'Thank you. And I. I hope I could get your support.'",
        "'speaker_0': 'Then by Air Andrews and then rank. I just go one after the other.'",
        "'speaker_3': 'Yes. Okay, fine. Thank you very much. Okay. First of all, I want to thank Councilwoman Cindy and our economic development department for helping bring this item forward. This item is truly putting your money where your mouth is. In the sixth district, we have already funded the boarding up Mobil 15 businesses.'",
        "'speaker_3': 'We have created a database and a go fund me effort the community and have started. We have what are our business corridors to talk to business owners and help them file police reports online and help them with the CBG rebate applications.'",
        "'speaker_3': 'With this transfer of dollars, we're going to help our small businesses get the additional support they need. And thank you very much for bringing this forward.'",
        "'speaker_0': 'Now some of your anger I mentioned. Go ahead. After Vice Mayor.'",
        "'speaker_3': 'Thank you, Mayor. My son Andrew said it all perfectly and totally in agreement, the way he put it. And more than anything, I was inspired by the community's reaction on June 1st. And this is one step in the healing process, and I hope that we can do more.'",
        "'speaker_3': 'Thank you. Okay.'",
        "'speaker_0': 'Let's do public comment, please.'",
        "'speaker_4': 'We have one public comment. Victor Boosie, you have 3 minutes.'",
        "'speaker_3': 'Again, we're here talking about small businesses. Why were those small businesses affected? What happened? The glands over the root cause. It's foolish. Nothing will be solved. Who doesn't like small businesses. I love going down to the park and spending money and feeling like a good American, no doubt.'",
        "'speaker_3': 'But I also don't like to get terrorized by the police. All of this time is being dedicated to small businesses and nobody is talking about the root of the problem. The only thing I'm hearing about reforms from shady cops.'",
        "'speaker_3': 'Nobody's listening. Nobody was out in the street. Nobody saw what happened Sunday. You guys are still talking about small businesses and making small businesses whole. How about making Long Beach whole, making Long Beach hold for the people, for the community, for the most marginalized of us?'",
        "'speaker_3': 'Listen to the people. We were out in the streets telling y'all to be fun to LBB. But all I hear is talking about small business. Small business. Small business. Forget about all that noise. All this time has been dedicated to small business and profits and all.'",
        "'speaker_3': 'I hear the refrain about not putting a book on the neck of a black man. And I'm supposed to be happy about that? No, I'm angry. I'm very angry. The people out there angry won't be too angry once I listen.'",
        "'speaker_3': 'We're doing this to try to get you to listen. I spent, like, 3 hours on the phone to tell you the same thing over and over again. The fund will be p d. Do you hear us? I see you.'",
        "'speaker_3': 'You hear us? You've been outside your house. Do you hear us? We're not giving up. The Long Beach is out here. We're looking for your. We are organizing in the streets, we will not give up.'",
        "'speaker_1': 'So, Mr. Boucher, please stay on topic. DPD Mr. Boosie, please stay on topic.'",
        "'speaker_3': 'I am on topic. I'm definitely on topic. Don't try to silence me, please. One public comment. Let me go on. What are you talking about? Stay on topic. I am on topic. I used my time.'",
        "'speaker_4': 'Thank you. As a conclusion of public comment for this item.'",
        "'speaker_0': 'Local police.'",
        "'speaker_1': 'District one. I am district two. I. District three I want district four i. District five. I. District six.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_3': 'All right.'"
    ],
    "Report Back on City's Plans and Impacts Related to CRC's Potential Bankruptcy.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Item 18.'",
        "'speaker_1': 'Communication from Councilwoman Zendejas, Councilmember Pierce, Councilmember Urunga, Councilmember Richardson, recommendation to request reports back in 14 days from city manager, financial management and energy resource departments on the city's plan to manage the California Resource Resources Corp. potential bankruptcy filing.'",
        "'speaker_0': 'The House.'",
        "'speaker_2': 'Thank you, Mayor. I'd like to thank our city staff for all their hard work over the last few weeks. From our city manager and his team to all of our fantastic department heads. That and their staff at Long Beach has been able to work through some very serious challenges due to incredibly important and unnecessary work in the'",
        "'speaker_2': 'last three months. So thank you. Thank you very much. A few weeks ago, staff gave a troubling but necessary overview of the severe budget shortfalls we we are going to be having to address. In the spirit of this, I think it's a good idea for us to hear a report on other potential liabilities for our city's finances'",
        "'speaker_2': '. I'm specifically specifically imagining the expected bankruptcy filing of California Resource Corporation and the potential impacts of this with regards to the operations that they have here in our city of Long Beach. My intention is to bring this item was to use this as an opportunity to check in on other aspects of the city's finances and me and'",
        "'speaker_2': 'many of their other finances that may have been affected by the COVID 19 pandemic, including historically low prices of oil. And any effects of this we may see reflected in the city's islands fund. I'm hopeful that this is the information that will be give us a fuller picture of where our city is financially as we go into'",
        "'speaker_2': 'some very difficult budget conversations. For the next fiscal year. In conversation with Tom, he has conveyed that this potential impact of CRC bankruptcy is is likely less severe than we had originally feared, which gives me a little bit of relief.'",
        "'speaker_2': 'But let's, let's, let's let our city staff fill in and let us, you know, present us with a good report on this. And I urge my city council colleagues to please support this item.'",
        "'speaker_0': 'Council member Pearce.'",
        "'speaker_2': 'Thank you. I want to thank council members and De Haas for bringing this forward. I know that I, I too have concerns. I understand there are three different ways.'",
        "'speaker_1': 'That bankruptcy could.'",
        "'speaker_2': 'Happen. And so I'd like to just hear from staff a quick.'",
        "'speaker_1': 'Public conversation.'",
        "'speaker_2': 'About what's happened with CRC, what they think will happen. And then I'd like to ask.'",
        "'speaker_1': 'Council member Van de Haas.'",
        "'speaker_2': 'If she's okay with giving staff 30 days instead of 14 days. I know that we've asked for a lot of information on this item. So, Tom Modica, if you could give just a brief glimpse at what we're looking at here.'",
        "'speaker_5': 'Yes, thank you, Councilmember. So I'm not sure Bob Dow is on the line, but I can go ahead and start. So we have been following this very, very closely. CRC is the operator of the city's oil field, so it is a city run oilfield that is held in trust by the state.'",
        "'speaker_5': 'And so they are the the company that operates it for us. There are you know, there's a difference in that. And so, you know, we are not always we are not tied to their financial performance. From our financial standpoint.'",
        "'speaker_5': 'We are essentially looking at the price of oil and we do get a share of revenue based on the price of oil. So we can certainly talk about this and bring back a report to council any time any of our partners that has to do with the city operations in financial trouble.'",
        "'speaker_5': 'We follow that very closely. They're not allowed to talk to us about their bankruptcy and their financial challenges. We do believe this would be more of a restructuring where they would be able to maintain control of the oil field and all the environmental responsibilities and all all of the things that comes along with that.'",
        "'speaker_5': 'Thank you for the additional time. We can certainly get back to you quickly on some of the technical aspects of of bankruptcy and what that might mean. But we would require some additional time to really dove into the where the funds have gone historically and what that looks like.'",
        "'speaker_5': 'That should really be part of the budget process and we can provide those reports. So Bob, Dow, if you can add a little bit that I may not have made it clear enough. Thanks.'",
        "'speaker_3': 'Sure. Thank you. Tom, can you hear me?'",
        "'speaker_5': 'Yes.'",
        "'speaker_6': 'Okay. So, yes.'",
        "'speaker_0': 'I mean, the CRC is the contractor for the unit.'",
        "'speaker_3': 'And as such, they they basically really own nothing. The state and the city and the unit own all the assets there.'",
        "'speaker_6': 'So as the operator.'",
        "'speaker_0': 'It's our assumption that.'",
        "'speaker_6': 'If they decided to restructure, they.'",
        "'speaker_3': 'Would go with a Chapter 11 type of bankruptcy filing.'",
        "'speaker_6': 'And then there would be a trustee assigned to to the bankruptcy.'",
        "'speaker_3': 'And the first thing they would look at is the agreements that the contractor has with the city and the state and which is predominately governed by the contractors agreement. And we believe that there's still a lot of value in that agreement.'",
        "'speaker_0': 'So it's very.'",
        "'speaker_3': 'Likely that the trustee and the bankruptcy trustee would agree to continue to operate that.'",
        "'speaker_6': 'So then all terms and.'",
        "'speaker_3': 'Conditions in that agreement will be followed explicitly, and any deviation from that would not be something that they would allow.'",
        "'speaker_0': 'So in this case.'",
        "'speaker_6': 'Everything would operate status quo while they restructured their debt. But every operational.'",
        "'speaker_3': 'Aspect, from the environmental to the safety to the governing of all the documents would be.'",
        "'speaker_6': 'In place as they are today. So it's really a very simple.'",
        "'speaker_3': 'Type of arrangement, but it could be complex on.'",
        "'speaker_6': 'Other aspects of their operations.'",
        "'speaker_3': 'Throughout the state. But in this case, it's very simple.'",
        "'speaker_2': 'Thank you staff for that quick report. I'll close out my statements by saying I think it's important that we understand the financial situation, what the impacts could mean to Thailand, to a general fund, and that we also.'",
        "'speaker_1': 'Take a moment to.'",
        "'speaker_2': 'Recognize that we have said as a city that. That structural racism is something that, you know, affects people in our city on every aspect. And environmental racism is one of them. And the conversation around oil is one of them.'",
        "'speaker_2': 'I'm not saying this is the item to just say, let's get off of going, but I think that this is an item that will allow us to really better understand as the city council, what our oil revenues go to, how it's structured, and what happens whenever the price of oil drops down and just having a bigger, longer'",
        "'speaker_2': 'conversation about this.'",
        "'speaker_1': 'And so I think council members in Davos for.'",
        "'speaker_2': 'Having me sign onto this item and hope you guys support it. Thank you. Councilmember Pierson Yes. Now that I feel a little bit more comfortable with my concerns, I think that we can definitely extend it for a 30 day report.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_3': 'Dr. Richardson. Thank you, Mr. Mayor. Just a few thoughts. So we've been looking at this situation. We thought about moving an item a couple of weeks ago. With all this taking place. So we sort of fell back on it.'",
        "'speaker_3': 'But, you know, I'm particularly concerned about, you know, the impact here of CRC bankruptcy and how it could affect not just payments, appliances, how we balance our our general fund. And a lot of our core essential services are directly connected to public.'",
        "'speaker_3': 'Also know that if you know the type of the type of bankruptcy that the ICRC may engage in will may have an impact on the state oil trust fund. And so my understanding is they applied for about a half of $1,000,000,000 worth of funding.'",
        "'speaker_3': 'And if they receive that funding, they can go with Chapter 11 instead of Chapter 13. And Chapter 13 will require liquidation and would require the city of Long Beach to step up and take over some of the operations in the in the interim, which may require us to leverage the state oil trust fund.'",
        "'speaker_3': 'And so at this point, as far as I know, that there's been a conversation at State Ledge over the last few years about increasing the cap on the state oil trust fund is located in the state treasury. Tom, are you able are you or Tyler able to give a status update on where we are with the state'",
        "'speaker_3': 'oil trust fund?'",
        "'speaker_5': 'Yes. Tyler Kerley can give an update.'",
        "'speaker_6': 'Yes. COUNCILMEMBER So this is the third year that we worked with Assemblymember O'Donnell's office to push legislation to try and lift the cap on the oil trust fund. The last two years, the bill has failed to make it through the Appropriations Committees.'",
        "'speaker_6': 'So the first year was the Assembly. The second year didn't make it through the Senate appropriations. And this year, because of COVID and kind of realignment of priorities, as well as, of course, the $54 billion deficit that the state is facing, the bill did not move forward, passed the Policy Committee on the Assembly side.'",
        "'speaker_6': 'So we look forward to and welcome, you know, working with you in the state led committee to strategize, moving forward into the next legislative session how we can prioritize this this issue further.'",
        "'speaker_3': 'Sure. And I'll just say this. I know that we are able to engage in Sacramento, sometimes working through the big mayors, sometimes working through the governor's office. But I think the strategy of just moving it through Assembly Member O'Donnell, through the legislature, it hasn't worked and it's time to change strategies.'",
        "'speaker_3': 'So I think maybe we think about some of the other legislators. We have our senators, some of our other assembly members, because this could potentially if, you know, if we just have to think about worst case scenario and the worst case scenario.'",
        "'speaker_3': 'Chapter 13. The last thing I want to see is that there's not enough funding the state oil trust fund to support Long Beach and other cities that are going to be impacted by some of these bankruptcy at this moment.'",
        "'speaker_3': 'So I would say that we need to be a bit more assertive and change our strategy in terms of who carries this bill. And it's been three times and we need to change our strategy. Thanks a lot. I'll keep I'll keep an eye on this.'",
        "'speaker_3': 'But again, I'm concerned about this moment. Thank you.'",
        "'speaker_0': 'Thank you, the customary Rango.'",
        "'speaker_3': 'Thank you, Mayor. And I totally support the 30 day extension of getting the reports back. It's so important. And it's a fluid it's a fluid issue. So literally and figuratively that we need to get it right and we can't do anything until we know exactly the direction that's here CSC is going to be taking.'",
        "'speaker_3': 'So looking forward to getting the report back and then taking it from there. Thank you.'",
        "'speaker_0': 'Adam Courtney Public comment.'",
        "'speaker_1': 'There are two public comments on this item.'",
        "'speaker_4': 'The first speaker we have is Laurie Smith. You have 3 minutes.'",
        "'speaker_2': 'Right. Hi. Thank you. I'm a resident of 90803 in Council District three. And I first want to just commend the city council members and the House for bringing this item forward and for. Councilmember Richardson's very astute comments as well as Councilmember Pearce.'",
        "'speaker_2': 'This is for the protection of public interest. And I just want to expand upon two areas of the staff report. First is Long Beach history of the land sinking, sinking due to the oil production. And the second is the decreasing need for oil production.'",
        "'speaker_2': 'So in the forties and fifties in Long Beach, we had the drastic land subsidence issues. Due to oil production. And I want to make sure that we all understand that that means that the land sank, it went down and we live at the ocean.'",
        "'speaker_2': 'So in the fifties, the land sank up to 24 to 29 feet due to oil production. That's feet that's not inches. So in the staff report, it states that 1961 that the land subsidence issues were under control, meaning that they figured out how to stop the city from sinking.'",
        "'speaker_2': 'So in addition to city council requesting this report, I would like to make sure that they look at the what the cost is for maintaining water injection to assure property owners that if companies like CRC abandon the wells, we need to make sure there's enough money in the funds and for how many years to maintain water injection'",
        "'speaker_2': ', which is what led the land to be kept at proper levels. So you need to know that the mechanical integrity of water injection and monitoring that system will. We need to make sure that it's going to be able to continue.'",
        "'speaker_2': 'We know that it's going to be needed after oil fields are no longer use in order to prevent future damage to city property and our homes from the land sinking. So the other thing we're not talking about is a dismal future of oil production.'",
        "'speaker_2': 'The president of the company stated that his company is suffering from transitory events, from the pandemic, and the price war between Russia and OPEC are to blame. But what he's failed to address is that oil consumption is being phased out in the world.'",
        "'speaker_2': 'And we see that very clearly here in our city, where the city is buying alternative fuel cars for the departments. The metro system is turning away from gas powered vehicles. And gas is just not the future. It's not the future for the transportation sector, which makes up 69% of the oil market.'",
        "'speaker_2': 'And it's not the future for the industrial sector sector, which makes up the other 25% of the market. An example of this is our East Alamitos Electric plant. It is no longer going to be gas powered, so it appears oil production will never be at the same level that we've known.'",
        "'speaker_2': 'And it would be prudent for the city to prepare for this new reality. The world is turning away from oil and gas, and it behooves the city to plan for oil production decreasing and make sure that that the CRC is actually.'",
        "'speaker_4': 'Thank you. We have Victor Boosie next. You have 3 minutes.'",
        "'speaker_3': 'We're sitting here talking about oil. Oil? So this company. Has the power to go into $5 billion worth of debt. Who made the contract with this company? Where are the people that are going to be held accountable? I will definitely be keeping my eye upon this.'",
        "'speaker_3': 'Like the previous citizen said, oil is not the future. We should not be looking towards oil. Sadly be the way Long Beach moves forward because at the bottom of all this. Is profit. Profits over people. The land is literally sinking under our feet.'",
        "'speaker_3': 'So a tiny few could make profits. Profits over, people will stop. Deep Fund help the idea of my time.'",
        "'speaker_0': 'Thank you. That concludes public comment. Please call.'",
        "'speaker_1': 'District one. A district to. I. District three. I. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five. I. District six.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District eight. District nine.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Contract Award and Appropriation Increase for Police Records Management Software System.": [
        "'speaker_0': 'Thank you. I think the last item before we get to the some of the more the staff ones and other with interest of the questions here, let's go to item nine.'",
        "'speaker_1': 'Report from police and technology and innovation. Recommendation to award a contract to Central Square to provide. Implement and maintain a police records management software system or a total contract amount not to exceed 2,452,691 citywide.'",
        "'speaker_0': 'Okay. Can I get a motion in a second, please? Catherine appears.'",
        "'speaker_2': 'Thank you. I'd like to hear a staff report before I ask questions.'",
        "'speaker_5': 'Sure. We will have Lia Ericsson, our technical innovation director, and help lead that staff report. I will say that this is a very good investment. This is money that has already been set aside that the council invested in.'",
        "'speaker_5': 'There is a federal mandate to be able to do this type of system to increase our performance or increase our reporting. And this will really help us with transparency of data. So I'll turn it over to Leah, please.'",
        "'speaker_1': 'Good evening, Mayor, and members of City Council. Before you is a recommendation for the city manager to enter into an agreement with Central Square Technologies for purchasing and implementing an upgrade to the police department's record management system or arm's.'",
        "'speaker_1': 'Yara MMS is a mission critical application that stores and retrieves police records. The Arms is the authoritative source of data and reporting for the Long Beach Police Department. The current ARMAS application has been in place since 2012. The impetus to upgrade is twofold.'",
        "'speaker_1': 'First, the current AMAs environment is running on aging technology that is reaching end of life. And second, new reporting mandates set forth by the U.S. Department. Department of Justice will go into place in January 2021. Current reporting standards are limited to nine crime offenses, whereas the new reporting standards account for 52 different offenses.'",
        "'speaker_1': 'These new offenses are in keeping with modern law enforcement challenges such as animal cruelty, hacking and identity theft. In addition, the new reporting standards will allow for granular incident data, such as time to be captured as discrete data points.'",
        "'speaker_1': 'This is counter to the current method of reporting in which most data points are contained within a narrative format. The city's current arms is unable to conform to the standards required by the DOJ. A full arms system upgrade will be required for the city to conform to the DOJ's reporting standards.'",
        "'speaker_1': 'Migrating to a more modern platform platform will bring additional benefits to the police department in the city of Long Beach. Specific examples include lessening reliance on paper processes. Police intends to digitize processes like traffic collisions that are currently conducted via paper.'",
        "'speaker_1': 'The net effect will be less time to complete processes due to digital workflows and more timely access to granular data for reporting. Improving customer experience for the public. This shift to digital processes, granular data capturing an authoritative reporting platform will better serve the public who seek police records.'",
        "'speaker_1': 'For example, the police department processes on average 13,000 requests for traffic collision reports. The process to intake, retrieve and produce these reports is largely manual and paper driven. The public and staff alike can expect a more streamlined process as a result of the upgrade, with shorter response times to record requests.'",
        "'speaker_1': 'Reducing reliance on third party applications is another benefit due to data sprawl and a legacy system. Please staff can currently rely on a bevy of applications to access their data in modern Iot. Ms. are a must serve system will serve as an authoritative single source of data and reporting tool.'",
        "'speaker_1': 'And lastly, enhancing reporting through better data. By having more granular data, the city will be able to readily produce detailed crime reports based on metrics such as the demographics of victims and or offenders offense occurrence by the time of day and or offenses, including the use of a weapon.'",
        "'speaker_1': 'City manager Tom Modica said this is better transparency. Central Square was selected as the firm to provide a modern arms after the conclusion of a competitive procurement process. Proposals from five qualifying respondents were considered by a multidisciplinary team from the Technology Innovation Department and Police Department.'",
        "'speaker_1': 'The selection committee selected Central Square based on technical, product capability, cost and references. The total requested contract authority is 2.5 million and reflects the requisite cost to fully fund the project for two years, including purchase of hardware, software, licensing and maintenance.'",
        "'speaker_1': 'The request a contract term is one year with four optional one year renewals. The request. The contract authority includes the upfront cost, the one time upfront cost for the project of 1.8 million. Which includes the hardware, software, licensing and maintenance, a 15% contingency and an annual maintenance cost of about 380,000.'",
        "'speaker_1': 'In year one with annual increases of 5% in subsequent years. In addition, the recommendation includes a one time appropriation in the Department of Technology and Innovation for 100,000 for as needed professional services to lend technical aid. Given the project's aggressive implementation schedule to meet the new DOJ reporting deadline.'",
        "'speaker_1': 'As City Manager Tom Modica mentioned, the project will be primarily funded by a one time appropriation of 2 million. The general fund group in the police department that was set aside for this purpose by city council and a 500,000 DOJ grant appropriated to the group General Grants Fund Group.'",
        "'speaker_1': 'Ongoing annual maintenance costs will be paid by TDI and recovered from the police department via the annual TID MRU. This concludes my report and I'm joined by subject matter experts from police and technology innovation. We'd be happy to answer any questions you may have.'",
        "'speaker_0': 'Thank you, Councilman Pearce.'",
        "'speaker_2': 'Yes, thank you. Thank you, Lia. And for those listening at home. Leah is our director of I.T., who is going to be managing this project. I've got a couple of questions for Tom Modica. If you could outline who's involved in this, you know, understanding first what exactly is required by the DOJ, by what dates.'",
        "'speaker_2': 'And if we feel like we're going to meet those expectations or if we could delay this item. I know the answers, but I want you to just say it for the public. And then understanding how police and I team or the I.T. team work together.'",
        "'speaker_2': 'If you could go through the 2 seconds.'",
        "'speaker_5': 'Sure thing. So the DOJ requirement is that we have a system in place that meets their expectations by January 21. So we quickly put this together and put the funding in place that the Council put in last year.'",
        "'speaker_5': 'We are here to bid that project out. Even a week delay is going to impact us in their ability to deliver this project. And frankly, this project is going to be a very, very difficult to hit that deadline, even if we don't have any delays in terms of the project structure, the way that we run technology projects'",
        "'speaker_5': 'in the city, as we lead those through the Tech and Innovation Department. They then reach out to all the different subject matter experts throughout the city that need to be a part of that system. That's one thing. And here it's primarily the police department, because this is the system that captures all of the police reporting that is'",
        "'speaker_5': 'done on every single day, whenever there is incident reports or anything else that will go into this system. And then this is the system that we help to provide crime data and all those types of things that we want to know what's going on in our community.'",
        "'speaker_5': 'The project lead is tech and innovation, and they have a number of staff that that are dedicated to this project working with the contractor and then with police for technical assistance.'",
        "'speaker_2': 'Thank you for that, Tom. I really do appreciate that that you listed out the fact that this is really about onboarding a new system and that the system is about transparency.'",
        "'speaker_1': 'I know that in my.'",
        "'speaker_2': 'Four years on council that it has been very difficult when we've requested data to get data and to get it quickly. And so would this new system allow us to pull.'",
        "'speaker_1': 'Data more quickly and more information than we.'",
        "'speaker_2': 'Currently can?'",
        "'speaker_6': 'Councilwoman or council members and Mr. Mayor, Robert Luna here speaking up to answer that question. When we understand the requests coming in, we do our best to fulfill them. At the end of the day, the system that we're going to have is going to make it much easier for us to deliver information out to the public.'",
        "'speaker_6': 'Right now, the system we use is antiquated. A lot of times there's requests coming in or it takes actual people to start doing hand searches for a lot of the information. And I know there's a high level of frustration from many people out there.'",
        "'speaker_6': 'This system will completely change and revolutionize the way we provide information, specifically crime data out to the public. They're going to know more than they've ever known. We're going to be putting straight out to them with a lot of detail.'",
        "'speaker_6': 'So that's why we're recommending for this item to go forward.'",
        "'speaker_2': 'Thank you so much for that, Chief. I really appreciate it. And I just I got.'",
        "'speaker_1': 'A whole bunch of emails, calls.'",
        "'speaker_2': 'Text messages about this. So that's why I want to make sure that the public understands that this is a system that is going to allow us to get what we've been talking about, which is transparency and access.'",
        "'speaker_1': 'So I have.'",
        "'speaker_2': 'To make sure I ask all my questions. Tom Modica We talked in support of this item. We have the framework, which is really where we're going to address policy, recognizing that this is just putting in place a mechanism to get data and that the money has already been spent for this.'",
        "'speaker_2': 'This is not us asking for the money right now is saying that we've already allocated it and we have to do it in accordance with the DOJ. But next, as we go through the process of.'",
        "'speaker_1': 'Listening, I would like to.'",
        "'speaker_2': 'Make sure that I publicly ask for a public study session on police records and the state law and what we can do locally and what we can't do locally. So that's as part of our reconciliation. I would like to make sure that we have that public opportunity to really understand state law, what the boundaries are, and what'",
        "'speaker_2': 'we as a city can do to help our police department and our public. And so with that, I look forward to hearing other people's thoughts on this and might have missed a question or two. If I do, I'll come back up.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman. I do have I do have a shit on the floor by now by Councilwoman Mongo and council councilman's in Dallas. Is that a motion or just or you skipped the speech. He also mentioned has.'",
        "'speaker_2': 'It was muted. I was cued up to set it up. But if that's already been taken, I just I support this item. I support anything that promotes transparency. And I think that this is going to be great. And I'm very happy to have Lia being the lead on this.'",
        "'speaker_2': 'So thank you. Your.'",
        "'speaker_0': 'Councilwoman Mongeau. I'm sorry she made the motion, Councilman. They had second thoughts. Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor. And then I'll be quick. I like a lot of the discussion that I've heard already. I think it's important to note that, you know, I've advocated a number of people, advocated for a modern 21st century police department.'",
        "'speaker_3': 'And part of that means moving away from paper records to digitize records in a way that is consistent with national standards, allows a bit more transparency, access to data so we can make data driven decisions in terms of, you know, based on what's what's being reported.'",
        "'speaker_3': 'I think this you know, this this arm, this it's long overdue. I support moving forward with this. And I also want to recognize, I think with, you know, more folks paying attention to local processes, sometimes we do have to slow down and explain what things are.'",
        "'speaker_3': 'I like the idea of the suggestion of bringing forward a study session about record retention and what that looks like. There's been a lot of questions about, you know, the city clerk's process of of being consistent with state law on the destruction of records across all departments.'",
        "'speaker_3': 'And I think, you know, I think a study session would go a long way. Again, to update the council on what those laws are and what our practices are, and put us in a position to think about whether we want to make the investment into more records, retaining records for a longer period of time because of the'",
        "'speaker_3': 'cost associated with that. So all of these things are connected. And I think and I like the thoughtful nature of how everyone sort of framed. We all need to move to digitized data. We all need to support this, this and this so we can make better decisions moving forward.'",
        "'speaker_3': 'Thanks a lot.'",
        "'speaker_0': 'Thanks, Councilmember Ringa.'",
        "'speaker_3': 'He told this reporter with this item. The only question I have is knowing that technology is. Fragile. How long is this technology going to be available for and are we looking at another upgrade two or three years from now?'",
        "'speaker_3': 'All technology has a shelf life and it's unfortunate, but, you know, there's always new technologies coming around. I just wondering if this investment is the right investment we want to make. Obviously it is. But I'm just wondering what's going to happen two or three years from now when we're looking at technology advancing and having higher and better'",
        "'speaker_3': 'protocols for the retention of data?'",
        "'speaker_1': 'A councilmember.'",
        "'speaker_3': 'Go ahead. I'm sorry.'",
        "'speaker_1': 'Oh. Burying a body. Our business information services manager will answer that question.'",
        "'speaker_6': 'Thank you, Councilman, for the question. We have specked this out for a five year run, so we have sufficient hardware, software, licensing and warranties to support this application for a minimum of five years. Not to say that the application cannot expand.'",
        "'speaker_6': 'The software and hardware are architected in such a manner that we can continue to add to it, as opposed to have to rip it out and replace it going forward.'",
        "'speaker_3': 'The response.'",
        "'speaker_0': 'Gonzales Did you get a response you needed? Oak Country Council member Austin.'",
        "'speaker_3': 'Thank you. So my question and first of all, I completely support all transparency and upgrading our technology. I think that is really going to be part of our future, something that we can can ill afford to overlook. My question is more about the timing and potential opportunities and this question maybe for the manager.'",
        "'speaker_3': 'I'm not sure if our government relations staff is on deck when there's a lot of activity happening at every level of government, state government, as well as federal government. There is a call decrying greater transparency, more accountability and policing.'",
        "'speaker_3': 'I was just curious to know whether or not we do, we forecast or might there be opportunity for federal money to come in and and pay for something like this as opposed to us doing it today? And this just a cautious question.'",
        "'speaker_1': 'A Council council member Austin. I'm actually part of the project is covered by a DOJ grant. 500,000. In addition, some of the expenses for the feasibility study was also covered by a DOJ grant. And so the the remainder of the project is covered by a local share, which is consistent with, with other systems across the country.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Public comment, please.'",
        "'speaker_6': 'We have two public comments.'",
        "'speaker_4': 'Our first speakers launched in.'",
        "'speaker_3': '3 minutes ago.'",
        "'speaker_2': 'But I'm.'",
        "'speaker_4': 'Laurie Smith. You have 3 minutes.'",
        "'speaker_2': 'Is this for? Item number 20.'",
        "'speaker_4': 'No, this is for.'",
        "'speaker_2': 'Yeah. I'm for item number 20.'",
        "'speaker_4': 'I'm sorry. Victor Boosie, you have 3 minutes.'",
        "'speaker_3': 'All right. We're talking about software and Long Beach PD. Let's not forget about Tiger techs. I remember Tiger Techs. And the way Long Beach PD were hiding messages, disappearing messages. We can't trust Long Beach PD. They are not to be trusted.'",
        "'speaker_3': 'Luna is not to be trusted. All those people in the Long Beach Police Department are not to be trusted. What kind of public servant uses Tiger text to hide what they're doing? Shady people hide what they are doing.'",
        "'speaker_3': 'Period. Point blank. I oppose. Item nine is a request from of PD for over $2.4 million in software to provide, implement and maintain a police record. More money for BP is not I repeat, is not the answer. More money to police is not the answer and is not the solution of the problem of police violence.'",
        "'speaker_3': 'This is not an area of debate. Black people are dying in Long Beach at a high rate. No more funding for arbitrary contracts. We must defend black lives again. We must defend black lives. We must use funds to reinvest in our community, especially Black Long Beach communities.'",
        "'speaker_3': 'The most marginalized of us deserve that. We must strengthen our civil services such as parks, housing, library services in Long Beach. We want to defund the police. We can't trust these fools with technology. The shaming the tiger takes proves it is no institution that was there to serve the public.'",
        "'speaker_3': 'Would you something like Tiger attack. Come on, now. Idea of my time.'",
        "'speaker_4': 'Thank you. That concludes public comment.'",
        "'speaker_0': 'Thank you. Roll call, please.'",
        "'speaker_1': 'District one. I just district to. I. District three. I am District four. I am District five. I. District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District nine. Thank you. Ocean cares.'"
    ],
    "Resolution to Transfer Harbor Fund Revenue to Tidelands Operating Fund.": [
        "'speaker_0': 'Okay. Thank you. Great. Now we're gong to go to the rest of the meeting items. Item number eight.'",
        "'speaker_1': 'Report from Financial Management Recommendation to adopt resolution requesting that the Board of Harbor Commissioners approve the transfer of 5% of fiscal year 2020. GROSS operating revenue citywide.'",
        "'speaker_0': 'In motion in a second, please. But you're in a second place council. Yes. I said most of my concern. Richardson. Second, my councilman's in Dallas. Madam Court. Public comment.'",
        "'speaker_4': 'We have one public comment. Victor Boosie, you have 3 minutes.'",
        "'speaker_3': 'The Fund 0btdiu of my time.'",
        "'speaker_4': 'Thank you. That was the conclusion of public comment.'",
        "'speaker_0': 'Rock over, please.'",
        "'speaker_1': 'District one. High district to my district through.'",
        "'speaker_2': 'I. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I. I.'",
        "'speaker_1': 'District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District nine.'"
    ],
    "Ordinance on Commission Compensation Amendments.": [
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Thank you. I 11, please.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code relating to Commission compensation read and adopted as read citywide.'",
        "'speaker_0': 'The emotion that comes from a Richardson second. I can't remember your anger. Public comment, please.'",
        "'speaker_4': 'We have one speaker. Victor Boosie, you have 3 minutes.'",
        "'speaker_3': 'They find out. Dee dee Dee. When I keep saying it, I'm going to keep repeating it. So you all get the message. This is a call for everybody. Next meeting. Call in. Oh, then what the people are saying d find out the p d.'",
        "'speaker_3': 'I yield my time.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Roll call the police.'",
        "'speaker_1': 'District one. District two. I district three. I district for.'",
        "'speaker_3': 'The.'",
        "'speaker_1': 'District five by District six.'",
        "'speaker_2': 'By District seven.'",
        "'speaker_3': 'By District eight. Merrick.'",
        "'speaker_1': 'District nine.'",
        "'speaker_3': 'All right.'"
    ],
    "Ordinance to Extend and Modify Expiration Period for Certificates of Appropriateness. ": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': '12 please.'",
        "'speaker_1': 'Or from Development Services recommendation declare ordinance amending the Long Beach Municipal Code relating to the extension of the expiration period for certain certificates of appropriateness and modifying the expiration period for future approvals. Read and adopted as read citywide.'",
        "'speaker_0': 'I got a motion and it's actually a motion by I think it's Vice Mayor Andrews. And I got a second. Second my customers and day has. But a comment.'",
        "'speaker_4': 'We have one public comment from Victor Boosie. You have 3 minutes.'",
        "'speaker_3': 'Again. We're here to be that.'",
        "'speaker_4': 'I'll be pleased to talk to the item.'",
        "'speaker_3': 'I used my time.'",
        "'speaker_4': 'Thank you. Conclusion of public comment.'",
        "'speaker_0': 'Please cast your votes or call.'",
        "'speaker_1': 'District one I district to district three. A district court.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District one. I. District six. District six.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District nine. My version carries.'"
    ],
    "Ordinance to Extend and Modify Expiration Dates for Subdivision and Entitlement Approvals.": [
        "'speaker_0': 'Okay. Item number 13, please.'",
        "'speaker_1': 'Report from Development Services. Recommendation to declare ordinance amending the Long Beach Municipal Code relating to the extension of the expiration date for certain. Subdivisions and entitlement approvals and modifying the expiration period for future approvals. Read and adopted as read citywide.'",
        "'speaker_0': 'Okay. I see a motion by Councilman Richardson and a second by Vice Mayor Andrews. Our comment is.'",
        "'speaker_4': 'We have one comment from Victor Boosie. You have one minute or 3 minutes.'",
        "'speaker_3': 'Defund the PD because a lot of times lives matter. I yield my time.'",
        "'speaker_4': 'Thank you. As a conclusion of public comment.'",
        "'speaker_0': 'Hiroko.'",
        "'speaker_1': 'District one. I district to. I'm District three. A District Court I District five i. District six.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'District nine.'",
        "'speaker_1': 'High emotion carries.'"
    ],
    "Local Emergency Status and Possible Termination due to Civil Unrest.": [
        "'speaker_0': 'Next item, please. I think that was 13. Let's see, item. 19.'",
        "'speaker_1': 'Communication from City Attorney Recommendation Review the need for continuing the local emergency proclaimed by the Director of Civil Defense on May 31st 2020 and ratified by the City Council on June 5th, 2020. And determine whether to terminate the local emergency at this time.'",
        "'speaker_1': 'And if the conditions so warrant adopt a resolution terminating the existence of a local emergency related to civil unrest citywide.'",
        "'speaker_0': 'Can I get a motion? I think a motion by Vice Mayor. I'm sorry, but a motion by Councilor Richardson, second by Councilmember Ringa or Mr. Walker. Did you have a staff report on this or no?'",
        "'speaker_5': 'Yes, we did. So, Mr. Mayor, members of the council, we declared this emergency on May 31st and we committed to you. We would review it at every single council meeting to see if it was still needed. At this point, we are recommending that you terminate the local emergency.'",
        "'speaker_5': 'We have been very, very busy over the past two weeks. There continues to be significant First Amendment protest activity. I think we're at 44 protests that we have been working on and facilitating. But at this point, we do believe that the emergency has passed and we are recommending that you sunset that and we can answer any questions'",
        "'speaker_5': 'if you have them.'",
        "'speaker_0': 'Okay. I have a motion in a second. Do either of you have any questions or. No?'",
        "'speaker_3': 'That's a statement, Mr. Mayor. I'm happy to support this motion. I think in this moment, we've seen a number of peaceful protests over the last few weeks. And there's really I don't see the justification for continuing the emergency.'",
        "'speaker_3': 'I know we have a work cut out for us, but we should continue to preserve and protect First Amendment rights. And so I think the appropriate action for me is to go ahead and sunset the emergency and get the word.'",
        "'speaker_3': 'Mayor. Yes, go ahead. I want to echo the comments made by Councilmember Richardson. I think that what I've seen the last couple of weeks is very peaceful protests, no violence. I think it's done time with this type of sunset, this.'",
        "'speaker_3': 'At the same time, I think we we are listening and we're continuing the conversation. And I'm very pleased to see that the discussion and the dialog is taking place and it is where it should be. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Yes, I support the motion and signed on to our second motion, but I'll just add just a couple of comments. I think it's time to move on. And I think, you know, the we have moved from a place of of anger and rage to a place of of commitment and and peaceful protest.'",
        "'speaker_3': 'And and I think people in the city of Long Beach, particularly, should feel like they've been heard. The actions thus far of this council, we need to move to a place of healing and action for our community. So thank you.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_2': 'Thank you, Mayor. I agree and support this motion. I did have one question. Just when will we be getting the police data from the 31st?'",
        "'speaker_5': 'The two from four that we had talked about is going to be released by tomorrow.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_0': 'Vice Mayor Andrews.'",
        "'speaker_3': 'Yes. Thank you. You know, I support the motion and we're moving forward, but I think we should look at the fireworks and discuss that as a local emergency. Thank you.'",
        "'speaker_0': 'Thank you. That concludes council comments during public comment.'",
        "'speaker_4': 'We have one comment from Victor Boosie. You have 3 minutes.'",
        "'speaker_3': 'So I was down there during the protest when everything happened. And yes, it was a civil unrest. Yes, there was rioting. But again, nobody was addressing why we were rioting, why there was civil unrest. MLK said it, Martin Luther King said it.'",
        "'speaker_3': 'Y'all know this quote. Writing is the language of the unheard. Y'all ain't listening. I sat here for over 3 hours. And I didn't hear anything about attacking the systematic racism and injustices. That's the LBB PD perpetuates upon black people.'",
        "'speaker_3': 'Nothing is addressed. There will be another civil unrest if the politicians in this country don't listen. We're trying to talk to you. All right now. Listen. Listen to the people in the streets defund our DPD. I yield my time.'",
        "'speaker_4': 'Thank you. As a conclusion of public comment for this item.'",
        "'speaker_0': 'We'll cover, please.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_2': 'I. District three.'",
        "'speaker_1': 'I district for.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. I. District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Ocean carries.'"
    ],
    "Confirmation of Assistant City Manager Appointment.": [
        "'speaker_0': 'Thank you. Next item 20.'",
        "'speaker_1': 'Report from City Manager Recommendation two confirmed the appointment of Linda Tatum to the position of Assistant City Manager effective June 20th, 2020 citywide.'",
        "'speaker_0': 'Mr..'",
        "'speaker_5': 'Very, very, very happy to be here today and to bring this item to you. So we conducted a selection process to pick our next assistant city manager. This is an incredibly important position. It's in our charter, and the council has a role in confirming the city manager's appointment.'",
        "'speaker_5': 'And so I am recommending that we appoint Linda Tatum. I could go on and on about Linda. She has been fantastic here in the city and has had over 30 years of very diverse experience doing huge projects in the region.'",
        "'speaker_5': 'And she's a planning expert and professional as well as a very, very solid administrator. She's going to do great things as our assistant city manager, and I ask for your support.'",
        "'speaker_0': 'Thank you. That was item 22. I see a motion back by Councilmember Richardson, a second by Councilmember Price. Councilman Richardson.'",
        "'speaker_3': 'I wanted to chime in and just offer my adulation and strong support to to Ms.. Tatum, who will be our next assistant city manager. She in my work as president of SCAD, we know the city's web strong reputation for planning standpoint.'",
        "'speaker_3': 'Ms.. Tatum has a has an incredible reputation as an administrator and as a planner, both in her time here in the city of Long Beach, but also in the city of Inglewood. And so I know that she's going to bring great contributions to the city manager, city management team and help bring a level of experience and sophistication'",
        "'speaker_3': 'to the team. And I look forward to the great things to come. Congratulations, women. And I'm honored to make this motion.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_2': 'Thank you. Congrats, Linda. I look forward to working with you. I think it's an excellent selection next.'",
        "'speaker_0': 'Thank you. Vice Mayor Andrews.'",
        "'speaker_3': 'Yes. Congratulations. I mean, I think you're like a diamond in the rough. And I'm looking forward to being, you know, coordinating this drive with you as soon as we can get some of these priorities. And congratulations again, young lady.'",
        "'speaker_0': 'Thank you. GONZALES Pierce.'",
        "'speaker_2': 'Thank you. I want to congratulate the whole city, Tom and Linda, for this appointment. Linda, I think that you are balanced, smart, fierce and fantastic partner for Tom in this position. And I also want to congratulate the department for really growing a great bench of people that can step up.'",
        "'speaker_2': 'And I know Oscar and Chris have been a pleasure to work with. Also very smart, strategic and thoughtful people that I know you've worked really closely with. So it's really great to see some of that leadership step up in this process.'",
        "'speaker_2': 'So congratulations, everyone.'",
        "'speaker_0': 'Thank you. Councilman's in the house.'",
        "'speaker_2': 'Thank you, Mayor. Congratulations, Linda. I am so excited to have you in this position. You bring not only diversity because you're a woman, but because you're an African-American woman. That I up that you you have stellar knowledge about the city and a passion for the city.'",
        "'speaker_2': 'I'm so big that I think that you're going to work so beautifully with Tom, and I look forward to working with you on many good things to make Long Beach better every day.'",
        "'speaker_0': 'Thank you, Councilman Mongo. Were you were you keyed up for the last item or for this one?'",
        "'speaker_2': 'I had tried to make this motion, sir, but it's okay.'",
        "'speaker_0': 'Go ahead, Councilman.'",
        "'speaker_2': 'Thank you. I just want to congratulate Ms.. Tatum. She's knowledgeable, professional and poised under fire. I like a lot of our department heads, but there's not a single department head. I love disagreeing with more than Linda because she teaches me so much about the city and the possibilities.'",
        "'speaker_2': 'I think there's a lot to be said of a person who can adapt and become a part of the Long Beach family so easily. Actually, when her real introduction to the larger community gatherings was during such a pivotal time in our city's history, I also think that it's a testament to her leadership in development services, because one'",
        "'speaker_2': 'of the things that's always really, really telling is when a number two is ready to step up and take on the responsibilities of the number one and. And you did that really well in that you have so many individuals within your department who are really ready to step up and lead.'",
        "'speaker_2': 'And so I'm. Congratulations. Great choice. I couldn't have thought of a better choice. I know that there was always whispers of who it could be, who it could be. And and Linda, your name has always been on that list since the very beginning, so we're really excited to have you.'",
        "'speaker_2': 'And congratulations to Oscar, who you trained so well. We look forward to working with him as well.'",
        "'speaker_0': 'Thank you. And again, just because it's confusing on the system, how were you queued up for the last item or for this item?'",
        "'speaker_3': 'I absolutely want to just take this opportunity to congratulate Linda, our congratulate Tom. But I also want to congratulate the entire city team and the strong stabilizing force. Somebody who was a strong department head, who's already a part of the city management team just shifted into a new role.'",
        "'speaker_3': 'And I think she's going to complement the city manager very well. And I think we're in good hands. So congratulations again, Linda. My full confidence.'",
        "'speaker_0': 'Thank you. And council member Ringo.'",
        "'speaker_3': 'Thank you, Mayor. And I want to add my voice of support for the election selection of Linda with a new city manager. We have a new team, and I'm looking at what we have seen so far, and it's very positive.'",
        "'speaker_3': 'I want to congratulate Tom. I'm making a great selection. I want to congratulate Linda for accepting the position because she didn't have to. Do you want to be the city manager? Could have easily said no, but she said yes.'",
        "'speaker_3': 'And I'm glad that she did because she's going to bring a lot of talent to this position and she's going to bring a lot of expertize and a lot of good, good decisions with with the management team here.'",
        "'speaker_3': 'So as we move forward with a new team, looking forward to working with with everybody. Thank you very much.'",
        "'speaker_0': 'Thank you. And Councilman Super now.'",
        "'speaker_3': 'Thank you. I'd like to congratulate Linda. I'm really looking forward to bringing your expertize to the position. I don't think there's anyone in the city who knows more about the impacts of population density and and really looking forward to you looking at this through that lens.'",
        "'speaker_3': 'Also, if I could borrow a little bit of time, I'd be remiss if I didn't mention what a great job Rebecca Garner has done over the last few months as the acting assistant city manager. So thank you.'",
        "'speaker_0': 'Thank you, Councilor. Super. And I'm going to just make some comments to close this out as well on this item. I want to just first, I just note that I think Linda Tatum is just a phenomenal choice, and I'm just really proud that we have such a great management team in place.'",
        "'speaker_0': 'Mr. MODICA You're doing a great job in your short tenure. You put together a really strong team. You brought an uplifted women into your team, which is important. I want to note and Mr. Mark, correct me if I'm wrong, I think that that Linda Tatum after this vote will be the highest ranking woman manager.'",
        "'speaker_0': 'I want to say in the history of the city, if I'm trying to remember woman of color, there have not been a woman of color in the position of manager or assistant city manager. As far back as I can remember, at least in in modern times.'",
        "'speaker_0': 'Is that right?'",
        "'speaker_5': 'Yes, in testing memory that at least in the last 20 or 30 years that that is correct.'",
        "'speaker_0': 'And so I don't think it's I don't think it should be lost on the moment that not only is Linda the most qualified and prepared person to take on this role, and that's why she was selected. I think, Linda, the fact that you're also kind of breaking that glass ceiling into that these top two positions is a'",
        "'speaker_0': 'testament to you, to your hard work. And really, it will serve as an inspiration to so many other women managers, managers of color that are looking to you as an inspiration and as someone that is really going to lead the city in a great direction.'",
        "'speaker_0': 'And so we know how important this role is. We certainly saw Tom in this role for many years, and certainly you will be different than Tom in this role. You guys are both, you know, complement each other. But we look forward to having you in this position and your leadership.'",
        "'speaker_0': 'We know it's going to be really, really felt. I want to personally also just thank Becky Garner for her just great work and commitment to the city of Long Beach. She loves Long Beach so much and just thank her for her service as well.'",
        "'speaker_0': 'And as well as the other wonderful managers and leaders that have been promoted into your leadership team that you announced recently. Mr. MODICA And with that, I know I'm not I'm sure if you hadn't been, if you had Ms..'",
        "'speaker_0': 'Tatum join you tonight or not. Mr. MODICA There where you are, is she there by any chance?'",
        "'speaker_5': 'Yes, she is.'",
        "'speaker_0': 'Why don't we just say a few words? So this Tatum did you want to say a few words?'",
        "'speaker_1': 'Thank you, Mayor. Members of the council for that. For those beautiful words. I'm deeply touched by them. And I cannot tell you how humble am in accepting this position and your trust, your faith and your confidence. And I I've said from day one that the minute I came to work for the city of Long Beach, I knew'",
        "'speaker_1': 'that it was a special place. And I will I will tell you why I've always felt that Long Beach, unlike other cities I've worked in, they they know who they are. The city as a whole. I have not worked in a city where the residents and the leadership is as proud to be from Long Beach and be'",
        "'speaker_1': 'a part of Long Beach. It's really a special place and I've loved and enjoyed my work here from day one. It's a wonderful team and I'm just I'm really proud to be a part of it. And I look forward to serving our city manager and meeting the council's goals and objectives and the challenges that we face in'",
        "'speaker_1': 'the coming weeks, months and years. So thank you so much for your support.'",
        "'speaker_0': 'Thank you, Ms.. Tatum. Madam Clerk, any public comment?'",
        "'speaker_4': 'Yes. We have one public comment from Laurie Smith. You have 3 minutes.'",
        "'speaker_2': 'Hi. Thank you for letting me address the City Council on this issue before you vote to approve for Miss Tatum being the city manager. I live in 90803 and in City District three. And as a property owner in Bluff Park, historic district and recent recipient of the Mills Act, I wanted to make you aware of my concerns'",
        "'speaker_2': 'with regards to Linda's management of development services. She failed to address community concerns as part of her duties. Supervising the department and allowed projects that did not adhere to Long Beach municipal codes and audiences. So as a result, the property values of homes in the district are now in danger and as is our quality of life.'",
        "'speaker_2': 'So disappointing that Tatum has selectively ignored audiences that the homeowners must abide by for city projects. And this flagrant indifference toward city audiences have left the city culpable for damages to property owners in our historic landmark district, which specifically addresses my concerns, which I after and I put in the e-commerce for everyone to view.'",
        "'speaker_2': 'And those concerns were never addressed. Even though the Cultural Heritage Commission agreed with my concerns, they have never been addressed. So I just wanted to note that the city charter doesn't negate that the powers and duties of the city manager is to direct and supervise the administration of all manager directed departments and to see that the laws'",
        "'speaker_2': 'and ordinances are enforced and executed. So Miss Tatum and Craig, back with the department's Department of Public Works led these projects and they failed to abide by the ordinances, never address community concerns. And these were cultural heritage ordinance, historic district ordinance and the Bluff Park historic landmark district court case.'",
        "'speaker_2': 'So additionally, the Certified Local Government Program, which she was overseeing, violations of those now jeopardize the federal and state funding of these programs. So if you're approving her for a larger role within the city, it's not going to make honorable to her continued negligence of duties.'",
        "'speaker_2': 'And I respectfully asked the city council council members require city staff members to fulfill their duties and to abide by the municipal code and the state certification of the Office of Historic Preservation. So thank you for your time and consideration.'",
        "'speaker_2': 'And I wish that one of her first duties, if you so approve her, is to make sure that the projects that she put forward and allowed to go forward is returned. And so that we will not have to seek legal issues on this and waste more of.'",
        "'speaker_3': 'Long.'",
        "'speaker_2': 'Beach time on this issue. Thank you.'",
        "'speaker_3': 'For your.'",
        "'speaker_2': 'Consideration.'",
        "'speaker_4': 'Thank you for calling for your comment. That concludes public comment.'",
        "'speaker_0': 'Thank you. Let's go and take a roll call, though.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District two, i. District three. District three. District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District six. By District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_3': 'By.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you. That concludes the regular agenda. Did I? Madam Court, did we miss any items or.'",
        "'speaker_3': 'We get them all? We got them all right.'",
        "'speaker_1': 'Yes, we're complete.'"
    ]
}