{
    "Resolution to Place General Tax Measure on March 3, 2020 Ballot to Increase Hotel Tax Rate.": [
        "'speaker_1': 'I have you down for consent. Next. So 27, please read the item.'",
        "'speaker_0': 'Is there a mover and seconder for the concerned calendar items?'",
        "'speaker_1': 'We're going to 27 and then consent. Okay.'",
        "'speaker_0': 'Item 27 is a communication from city attorney recommendation to adopt a resolution calling for the placement of a general tax measure on the ballot on the March 3rd, 2020 Special Municipal Election for submission of an ordinance amending the Long Beach Municipal Code to increase the rate of the general purpose transient occupancy tax from 6% to 7% and'",
        "'speaker_0': 'making findings of fiscal emergency pursuant to California Proposition 218 Adobe resolution providing the filing of primary and rebuttal arguments and adopt a resolution requesting the Board of Supervisors to consolidate a special municipal election for a local initiative measure to be on March 30, 2020 with a statewide primary.'",
        "'speaker_1': 'I think we had a pretty extensive presentation on this last week. This is just the documents that we already approved. I do have some public comments. Let me get to some to get to those who have signed up.'",
        "'speaker_1': 'If I can have Kelly Lucero, John Thomas, David Bunker and Cantrell and Christiansen and Lourdes Ramos, please come forward in that order.'",
        "'speaker_3': 'Good evening. My name is Kelly Lucero, president of the Long Beach Symphony. And I'm back just to share with you what an exhilarating week this has been. This community is buzzing. My phone has been ringing off the hook with people so excited about the opportunity for you all to and for the voters to choose to strengthen arts'",
        "'speaker_3': 'organizations, to put diverse and cultural programs into our communities, and to better serve those children and families and our community as the grunion. Harry Solskjaer's said two weeks ago he wrote, The arts are the soul of the city.'",
        "'speaker_3': 'I'd like to thank you all for your enthusiasm, your creativity, your courage for making the bold decision. To feed the soul of this great city. Thank you.'",
        "'speaker_1': 'Thank you so much, Mr. Sierra. Mr. Thomas.'",
        "'speaker_4': 'Good evening, Mr. Mayor. Members of City Council, I want to thank you all on behalf of the cultural arts community that continues to thrive here in the city of Long Beach, both the performing and the cultural arts. This major will really help sustain and grow and cultivate the arts community for the future and in the long term'",
        "'speaker_4': '. We're very lucky to have your leadership, your support and your vision to enact this agenda item. And everybody that I've talked to in the community is very, very positive for it. They realize the need for the revenue source.'",
        "'speaker_4': 'So we we thank you very much for your support this evening.'",
        "'speaker_1': 'Thank you so much for your comments.'",
        "'speaker_4': 'Mr. Duncan. Hi. My name is David Bunker.'",
        "'speaker_5': 'I am the board chair of Long Beach Camerata. Thank you all for the opportunity to speak on this. For our audience and our city council, we are proud to serve the Long Beach as the primary provider of choral music here in the Long Beach area.'",
        "'speaker_5': 'Studies have shown that in the United States that more people participate in choral singing than.'",
        "'speaker_3': 'Any.'",
        "'speaker_4': 'Other artform.'",
        "'speaker_5': 'And we found that to be an exciting aspect. And we also found that to be part of what Long Beach Camerata has been about as a community builder. Even within our own organization, Long Beach, Camerata Singers provides those musical opportunities to both the singers and its audience.'",
        "'speaker_5': 'We have The Kingdom Concert, which is an educational program. We have the new piece for Youth, which is a program for middle school individuals. The new TOT measure will help us expand these educational opportunities for the children here in the Long Beach area.'",
        "'speaker_5': 'In conclusion, I would like to thank all of you and particularly Mayor Garcia, Steve Goodling, for their work on this measure thus far. And we urge the city council to approve the measure for the ballot, and we urge the citizens of Long Beach to approve the measure in March.'",
        "'speaker_1': 'Thank you so much, Ms.. Ms.. Kantrowitz. And then he'll be Ms.. Christiansen.'",
        "'speaker_3': 'Good evening. And Cantrell. And as I said last week, I am totally in favor of all of these art projects. But I. In reading the ballot. I see that nothing is mentioned in there that this money, this extra hotel tax will go to the arts.'",
        "'speaker_3': 'Or anything else. In Long Beach. Not the libraries, not the police, not the. Roads. It will go into the general fund, just like measure a tax increase did. And so I urge you, when you put this on the ballot to add.'",
        "'speaker_3': 'That this. 7%, at least part of it will be used. For arts or some other thing than just putting it in the general fund. Thank you.'",
        "'speaker_1': 'Thank you. And Christiansen, please.'",
        "'speaker_3': 'So. Yeah. I kind of have to agree with Ann Cantrell. I mean, I don't know how many people are jumping up and down in Long Beach about a new tax. My sense of things is that what I hear is that we are the most taxed city, one of them at least in the state.'",
        "'speaker_3': 'I mean, we already pay so many taxes when we pass that other tax, we didn't really have to pay very much of it because we already had reached the max. So I know a lot of people that don't like to pay taxes to anybody.'",
        "'speaker_3': 'So I would think you would want to have a reason other than an emergency you got here, I guess, in the bill. So I think just to be asking for more money and not seeing where it's going isn't it's not very smart.'",
        "'speaker_3': 'If you want if you want it, then tell people how you're going to spend it. Of course, as an artist and retired art teacher, that would be a great way to spend it. But I don't think you're going to have much.'",
        "'speaker_3': 'Like, of course, if you put on that campaign real effort like you did for Measure M or that other one that you wanted and, you know, really push to send out all those mailers and spend all our money out of our regular general fund to get more money for the general fund.'",
        "'speaker_3': 'Maybe you could swing it.'",
        "'speaker_1': 'Miss Ramos, please.'",
        "'speaker_0': 'Hello, everybody. My name is Robert Ramos, president and CEO of the Museum of Latin American Art here in Long Beach. I have to say that in front of the Coast Guard sector, we are on celebration for these visionary project that certainly come together with the expansion of the city and the international obligation of our leaders.'",
        "'speaker_0': 'Diversity, inclusion and culture is part of the economic factor and the future of the city, not just of the future, but the city of now, of the citizens of quality of life. So I encourage everybody to be part of this marvelous opportunity and endorse these marvelous project.'",
        "'speaker_0': 'Thanks, everybody.'",
        "'speaker_1': 'Thank you very much. Members, please cast your votes and this will send this to the voters in March.'",
        "'speaker_0': 'Ocean carries. So Boehner can have it on.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Voted much. Voted Bush.'",
        "'speaker_4': 'You.'",
        "'speaker_1': 'Thank you very much. Thank you all. We will now go just two things. So we're going to do, uh, there's an item just to make sure we just get out of the way we're going to consent. And then item 28, there going to be a motion to change to the motion on that item.'"
    ],
    "Agreement with Long Beach Community College District to provide free courses at the Michelle Obama Neighborhood Library.": [
        "'speaker_0': 'Motion she carries.'",
        "'speaker_1': 'We're going back to item six on the consent calendar.'",
        "'speaker_0': 'Item six is report from Library Services Recommendation to authorize city manager to execute an agreement and any necessary amendments with Long Beach Community College District to provide free Noncredit and certificate course at the Michelle Obama Neighborhood Library for beginning for a period beginning February six, 2020 through May 21st, 2021, District nine.'",
        "'speaker_1': 'Thank you. Counselor Richardson, you wanted a presentation on this?'",
        "'speaker_6': 'Sure. This is something we, you know, we worked on for a while, and I wanted to get a staff report.'",
        "'speaker_7': 'Glenda Williams, our library services director, will give a brief report.'",
        "'speaker_8': 'Good evening, Mayor Garcia.'",
        "'speaker_3': 'And members of the city council. Before you tonight, there's an opportunity to have an agreement with the Long Beach City College to have some classes at the Michelle Obama Library. If approved, it will begin this coming semester, potentially in February.'",
        "'speaker_3': 'And we're very excited for this to move forward.'",
        "'speaker_4': 'Thank you. If approved.'",
        "'speaker_1': 'Okay, great. Customer Ranga. Anything? Customer Pearce. No. There's no public comment on this. Please cast your votes.'"
    ],
    "Continuation of Fourth Street Parking and Business Improvement Area Assessment and Agreement. ": [
        "'speaker_0': 'Bush and Kerry.'",
        "'speaker_1': 'Thank you. We have three hearings today, so we're going to go and begin our hearings. Our first hearing is hearing item number 11.'",
        "'speaker_0': 'Item 11 is a report from Economic Development recommendation to receive supporting documentation into the record. Concluded the public hearing and Adobe a resolution containing the Fourth Street Parking and Business Improvement Area Assessment Levy for the period of October 1st, 2019 through September 30th, 2020, and authorizes city manager to extend the agreement for a one year term district'",
        "'speaker_0': 'to.'",
        "'speaker_1': 'And there's a motion in a second on the hearing. Let's begin with the staff report.'",
        "'speaker_8': 'We have Eric Romero from Economic Development doing a brief report.'",
        "'speaker_7': 'Good evening, mayor and members of the city council. The fourth Street Parking and Business Improvement Area, also known as a business improvement district, was established by the City Council in 2007, allowing for the level of an annual assessment to be paid by businesses located in the district.'",
        "'speaker_7': 'The city contracts with the Fourth Street Business Improvement Association to manage the Business Improvement District and the Fourth Street Business Improvement Association's Board of Directors serves as an advisory board to the City Council on matters related to the district state law governing this district requires that an annual report be approved by the City Council.'",
        "'speaker_7': 'The annual report describes boundaries, proposed activities and budgetary information, as well as a method and basis for the continuation of the assessment. The annual report proposes no change to the district boundaries or method of living the assessment. The proposed activities will focus on marketing, special events and maintenance and beautification to continue the Levys assessments.'",
        "'speaker_7': 'State law requires that a public hearing be held on the proposed program and assessment. And it's October 22nd, 2019 meeting. The City Council approved a resolution granting approval of the annual report, declaring the intention of the City Council to levy the assessment and set today as the date of public hearing.'",
        "'speaker_7': 'City Council shall here and consider all protests from area businesses against the assessment program and boundaries of the area as proposed in the annual report. This concludes my staff report. I am happy to answer any questions. Thank you.'",
        "'speaker_1': 'Thinking, I. Let's see. On this item I have Mr. Goodhue, Ms.. Control. Ms.. Christiansen. I don't see here consumer appears. I'm sorry, Ringo. Okay. Members, just go ahead and cast your vote.'"
    ],
    "Continuation of Bixby Knolls Parking and Business Improvement Area Assessment and Agreement. ": [
        "'speaker_0': 'Bush and Kerry during 12. Item 12 Report from Economic Development Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution containing the Bigsby Nos parking and Business Improvement Area Assessment Levy for the period of Tober first 2019 through September 30, 2020, and authorize the city manager to execute the agreement for one'",
        "'speaker_0': 'year term District seven and nine.'",
        "'speaker_1': 'It's remarkable.'",
        "'speaker_8': 'Eric Romero from.'",
        "'speaker_3': 'Economic Development something the staff report.'",
        "'speaker_7': 'The big, you know, marketing and business improvement area, also known as the Business Improvement District, was established by the City Council in 1989, allowing for the levy of an annual business license assessment to be paid by businesses located in the district.'",
        "'speaker_7': 'The city contracts with the Bixby North Business Improvement Association to manage the district and the Bixby North Business Improvement Association's Board of Directors serves as the advisory board for the City Council on matters related to the District. State law governing this district requires an annual report be approved by the City Council, and your report describes boundaries, propose'",
        "'speaker_7': 'activities and budgetary information as well as the method and basis for the continuation of the assessment. The annual report proposes no changes to the district boundaries or the method of leaving the assessment. The proposed activities will focus on events, member outreach, business retention and recruitment and marketing and branding to continue the levy.'",
        "'speaker_7': 'The assessment state law requires that a public hearing be held on the proposed program and assessment at its October 15, 2019 meeting. The City Council approved a resolution granting approval of the annual report, declaring the intention of the City Council to levy the assessment and set today as the date of public hearing.'",
        "'speaker_7': 'City Council shall here and consider all protests from area businesses against the assessment program and boundaries of the area as proposed in the new report. This concludes my staff report. I am happy to answer any questions.'",
        "'speaker_1': 'I don't think this Christiansen or Ms.. Control or Mr. Goodhew no comment on this. So we're going to go ahead and. Councilman. Officer, any comments? No. Councilman Hearing any comments, please cast your votes.'",
        "'speaker_0': 'Bush and Kerry.'"
    ],
    "Entertainment Permit with Dancing for LBC Restaurant Group, LLC, dba Jade Restaurant.": [
        "'speaker_5': 'By the way, for the record, it's district eight. And that may.'",
        "'speaker_1': 'Hearing out of number 13, and this will require an oath.'",
        "'speaker_0': 'Item 13 Report from Financial Management. Recommendation to receive supporting documentation into the record. Conclude the public hearing and grant an entertainment permit with conditions on the application of Jade Restaurant at 6380 is Pacific Coast Highway Suite A for Entertainment with Dancing District three.'",
        "'speaker_0': 'This item required an oath. Please raise your right hand. You in each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_0': 'So help you God.'",
        "'speaker_1': 'Its co-owner.'",
        "'speaker_8': 'Emily Armstrong and Brett Jacobs from Financial.'",
        "'speaker_3': 'Management will be presenting.'",
        "'speaker_2': 'Their report.'",
        "'speaker_5': 'Good evening, honorable mayor and members of the city council. Tonight you have before you an application for entertainment with dancing for LBC Restaurant Group LLC doing business as Jade Restaurant located at 6380 East Pacific Coast Highway Suite A operating as a restaurant with alcohol in Council District three.'",
        "'speaker_5': 'All of the necessary departments have reviewed the application and have provided their recommended conditions as contained in the hearing packet. I stand ready to answer any questions Council may have, and that concludes staff's report.'",
        "'speaker_1': 'I'm so impressed.'",
        "'speaker_2': 'Mayor and thank you to our city staff for the presentation on this item, and thank you for taking the time to talk through this item with me yesterday. I'm glad to see that this hearing is before us and I look forward to this location continuing to be a great addition to the district.'",
        "'speaker_2': 'I want to focus on a few things here in terms of the restrictions that are being placed on this particular condition. First of all, it's my understanding that the type of permit that is being would be granted by action tonight would be the same as that which was given to Forbidden City, which was the restaurant that operated'",
        "'speaker_2': 'at this location prior to Jade's establishment as Jade at this location. This location is as very close to residents, specifically the Marina Pacifica residential community and as well as Bay Harbor. And I want to make sure that we're protecting the quality of life of the residents while giving this business an opportunity to be successful.'",
        "'speaker_2': 'It's my understanding that one of the conditions for this permit will require them to have to primarily stay a bona fide restaurant or eatery, and that they would not be able to transition into a nightclub or disco type of model.'",
        "'speaker_2': 'Is that correct?'",
        "'speaker_5': 'That's correct. Condition number four states that and then more specifically in the industrial conditions condition. Number two also states that they can not turn into a nightclub. It's to maintain a restaurant use.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'And it's also my understanding from this and other restaurants that have come across this council for consideration of an entertainment permit, that as a restaurant, it would also not allow for live entertainment or music or dancing on the patio at any time.'",
        "'speaker_2': 'Is that correct?'",
        "'speaker_5': 'That's also correct. There's also an additional condition. Number three, that specifically states live entertainment cannot happen or any dancing on the patio at any time.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'The other concern that have that I have and that residents have reached out to our office about is that, you know, obviously we know that sound can carry a long distance. So it's important to make sure that during the night hours the residents are not negatively affected by noise or the conditions that we're passing tonight.'",
        "'speaker_2': 'Also require that sound from the building should not be audible from 50 feet away in any direction.'",
        "'speaker_5': 'That's also correct. It's condition number five. And it also stipulates that all doors and windows must be closed during the hours of entertainment.'",
        "'speaker_2': 'Okay. And finally, I noticed that one of the conditions in here is that the permutation shall not hire promoters with the intent to advertise, promote or hold any entertainment activities consistent with nightclub entertainment. That is that also a condition that's part of this.'",
        "'speaker_5': 'Correct? That's also a condition.'",
        "'speaker_2': 'Okay, great. I know the business owner is here. I've had the pleasure of going to Forbidden City in the past. I've also had the opportunity to go to Jade and we wish them the best. And I know that they will be very responsive to any calls for service that we can get so that we can try to'",
        "'speaker_2': 'avoid any violations of the conditions. Any formal findings of violations of the conditions. So we'll continue to operate in a collaborative way with the business owner to ensure that there is peace and enjoyment of the residential properties in the area and not that that's not affected by this business.'",
        "'speaker_2': 'So thank you. I have nothing further on this.'",
        "'speaker_1': 'On this hearing. I sure I know that you stood up. I see you on the speaker's list, sir. I know you are. You're the business. Are you the business owner? Okay. But you didn't sign up to speak. Is that because you wanted to speak?'",
        "'speaker_1': 'So I know it's your first time. So in the future, please sign up to speak. Do you have any comments? Okay. I don't control Ms.. Christianson. Nope. So, Mr. Cert, come forward and just state your name, please, for the record.'",
        "'speaker_4': 'Good evening. My name is Rami Matar and I'm thank you for allowing me to voice my concern about the permit. And thank you. Council woman Miss Price, I think you addressed a lot of my concerns. Coming here, I.'",
        "'speaker_4': 'All I saw was just the request to entertainment. I am the closest resident in Marina Pacifica. I live exactly.'",
        "'speaker_5': '120 feet.'",
        "'speaker_4': 'Away from. From the press, from the restaurant. And I have an undercurrent of operation. There has been noise and I've complained at least a couple of times and I think the complied with my with the noise complain. However, I when I received the permit application, I was very concerned that.'",
        "'speaker_5': 'I and I didn't know if it is going to turn into a nightclub.'",
        "'speaker_4': 'Or they just wanted a way to legitimize the current operation, which I think include karaoke night or or some band. Again, I'm not here to, you know, like object to their business. I wish them success, but my well-being and my investment is also very important.'",
        "'speaker_4': 'And I trust the city in protecting my investments.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_4': 'Thank you. Thank you.'",
        "'speaker_2': 'And sir, if you can just hang tight for a moment before leaving, I'm going to have a staff member come out and give you our information and we'll also take yours. So if you ever have situations come up, you can also contact us so that we can also work with the business owner.'",
        "'speaker_4': 'Excellent. Thank you very much, sir.'",
        "'speaker_1': 'Thank you for coming down. Thank you. There is a motion in a second. Please cast your votes.'"
    ],
    "Report Back on Human Resource Audit and Trauma-Informed City.": [
        "'speaker_4': 'And move on to the next item. We'll go back to the regular agenda on this. It's the programs.'",
        "'speaker_0': 'Item 15.'",
        "'speaker_4': 'Yes. We're going to go back to the regular agenda now. Okay. We'll go back to identity.'",
        "'speaker_0': 'Item 15 is communication from Councilmember Pierce, Councilwoman Price Recommendation to receive and File Report on the Human Resources Audit and Trauma Informed City.'",
        "'speaker_4': 'It's just pies. Spears.'",
        "'speaker_9': 'Yes. Thank you. About a year ago, we put together an item with Councilmember Price and Councilmember Austin on our H.R. practices, requesting an audit and also a conversation around trauma informed practices for the city. So I'm happy today that we've got some staff reports and then I'll have a couple of questions afterwards.'",
        "'speaker_9': 'But I really want to applaud our city auditor and our team for a thorough dove into this. Thank you.'",
        "'speaker_7': 'Thank you, Mr. Vice Mayor. Members of the council councilmember peers. We have three short staff reports, oral reports that we'd like to give as this item asked for kind of three separate things. One is the trauma informed should be led by Theresa Chandler, our interim deputy city manager.'",
        "'speaker_7': 'One is kind of a brief overview of the hiring efforts and, you know, that's an ongoing effort. But you have a large two from four in front of you that details the status report as of March. And then our city auditor would like to say a few words as well.'",
        "'speaker_7': 'So we will start with Theresa. Gentlemen, please.'",
        "'speaker_8': 'Good evening, Honorable Vice Mayor and Council Members. Thank you for the opportunity to present on our trauma informed systems efforts. In 2015, the Department of Health and Human Services began working with community partners to explore the possibility of becoming a trauma informed city.'",
        "'speaker_8': 'In 2016, the group launched Trauma and Resiliency in Forum Long Beach, also known as Tree Shelby, a citywide initiative focused on reducing the impacts of persistent trauma in organizations and across systems. This network is a group of Long Beach professionals who are committed to holding the vision, setting priorities, developing and tracking data measurements and championing a trauma'",
        "'speaker_8': 'informed Long Beach. I would like to share some information with you on what a trauma and resiliency informed system actually is. But I must start with defining trauma. The continuous exposure to violence, poverty and other forms of disparity can have significant impacts on communities.'",
        "'speaker_8': 'Trauma can be defined as a psychological, emotional response to an event or an experience that is deeply distressing or disturbing. Immediately after the event, shock and denial are typical. Longer term reactions can include unpredictable emotions, flashbacks, strained relationships, and even physical symptoms like headaches and nausea.'",
        "'speaker_8': 'When trauma happens, it has short term and long term effects on the individual, on families and on the overall community. For many people in Long Beach, the continuous exposure to unsafe environments has resulted in higher rates of heart disease, respiratory illness and other health related outcomes.'",
        "'speaker_8': 'Persistent trauma not only impacts our community members and clients, it impacts our service providers, systems and the physical environment. Places and spaces where people live, work and play. Like schools, health care facilities, faith based organizations, social services and businesses play a key role in addressing the impacts of trauma within communities.'",
        "'speaker_8': 'How services are offered in these spaces actually play a key role in either reducing or enhancing the effects of being exposed to this trauma for their employees and service providers. The way in which services service providers hold, process and manage trauma will in turn have an impact on the experiences of community members who are seeking services.'",
        "'speaker_8': 'Many of these folks are trying to navigate complex systems while caring their own traumatic load. The Health Department and others recognize that a crucial point to interrupt the cycle of retraumatize is the retraumatizing of clients. Is supporting staff in addressing the vicarious trauma they might experience regularly in the workplace?'",
        "'speaker_8': 'In simpler terms, when a person walks in the door who is carrying a load of trauma and the staff person providing the service doesn't understand the effects of this person may be carrying. This can sometimes cause a domino effect of unsuccessful interactions between the two that may lead to more trauma for both the client and the staff'",
        "'speaker_8': 'person. Vicarious trauma is the emotional and psychological impact of connecting with the traumatic life events of other people. It often occurs without awareness. It accumulates over time and can change a worker's overall view of the world and people around them.'",
        "'speaker_8': 'This as this often affects a person's overall health and wellbeing as well. Resiliency, on the other hand, refers to the ability to cope with hardships and adapt to challenges or change. Resiliency develops over time and gives the capacity not only to manage with life's challenges, but also to be better prepared for the next stressful situation.'",
        "'speaker_8': 'The ability to remain hopeful is essential to resiliency and the process of healing. A trauma informed system is one in which all people within the organization recognize and respond to the impact of trauma. Traumatic stress on those who have contact with the system, including those seeking services, and us as service providers.'",
        "'speaker_8': 'This initiative is designed specifically to move Long Beach to become a trauma and resiliency informed city. The goal is that over time, collectively, we will embrace a comprehensive understanding of trauma and resiliency and incorporate this into our policy and practice.'",
        "'speaker_8': 'The implementation of the Tri Tre Alb initiative includes three core components training and education, policy and practice, change and evaluation. The goals of the pilot are to one begin with two identified systems the Health Department and the Long Beach Public Libraries, to adopt policies and procedures that enhance the delivery of services through trauma and resiliency.'",
        "'speaker_8': 'Informed approaches to convene a task force to advise the development of strategies to support staff in how to deliver trauma and resiliency. Informed Care and three Document Organizational Culture shift in the processes demonstrating how services are delivered and communities engaged for future replication.'",
        "'speaker_8': 'The Health Department and Library staff, as well as the City of Long Beach, Human Resources Department and the City Council offices, will receive training on these practices, the impact of trauma on ourselves and our clients, and tools for building resiliency in order to mean healthy, healthy responses in our work place.'",
        "'speaker_8': 'Relationships, training for h.R. And City Council will be prioritized and conducted in January 2020. Training will begin for health and library staff shortly thereafter. Additionally, the Health Department and library policies and procedures will be assessed for alignment with trauma and resiliency.'",
        "'speaker_8': 'Informed approaches and recommendations will be made for policy change. The evaluation component is designed to help us assess how well the training promotes learning and implementation of trauma and resiliency, informed approaches and the degree to which the policy changes are effective.'",
        "'speaker_8': 'This concludes my presentation. I'm available for any questions. Thank you.'",
        "'speaker_4': 'Thank you, Mr. Speaker. One of the experiences.'",
        "'speaker_7': 'So we'd like to have now, Alex Vasquez, give a short overview of some of the hiring improvements that we've been working on, along with our partners in the Civil Service Department.'",
        "'speaker_8': 'Uh. Good evening, council members. Um. What was submitted was a copy of a two from four memo outlining the city's review of our hiring process back in September of 2018. The Council City Council asks, requested the city manager to provide a review of its hiring process and the turnaround time for hiring new employees.'",
        "'speaker_8': 'Yeah. The improving the hiring process has been a top priority for the city manager, human resources department and civil service department, as well as all city departments. Over the last year, the city has also engaged, utilizing resources from a few fellow to help us perform an in-depth analysis and mapping process of our selection processes.'",
        "'speaker_8': 'Attached to the two from four Memo is a PowerPoint presentation that we provided our managers, and it outlines our approach to this review and provides some data that we collected. And it also provides a listing of some of our findings and some of our changes that have already been implemented and basically our approach on a go forward'",
        "'speaker_8': 'basis. What we did was we took a basically a biomass approach and we brought all stakeholders together to evaluate our hiring process. It was a collaborative effort and it was fully embraced by both civil service and human resources, along with all other city departments and stakeholders.'",
        "'speaker_8': 'We did a basically a a review of the selection process and mapped it out and outlined each of the steps and attempted to quantify the amount of time it takes to hire an individual. One of the things I just wanted to point out in the PowerPoint, we also provided some statistics about our hiring process.'",
        "'speaker_8': 'And on on page nine, I wanted to point out that we also took a look at what types of employment do we have in the city and where are we experiencing significant issues with hiring employees? Approximately 59% of our workforce work in classified service.'",
        "'speaker_8': '35% are unclassified, and approximately 6% are in management positions. As I indicated in in this PowerPoint on slides ten and 11, there's a step by step. Depiction of the hiring process. We also took a look at our vacancy rate by department.'",
        "'speaker_8': 'On Slide 12, our vacancy rates were ranging between 3% to 26%, depending on the department. And there were various factors that. Were attributed to the vacancy rates. Some of them were based on some departments receiving additional positions at the time.'",
        "'speaker_8': 'We did this analysis and some of them were positions that were kept vacant or were hard to fill. Some of the key findings were that there were some challenges with filling vacancies and the amount of time it was taking to fill those vacancies.'",
        "'speaker_8': 'The amount of time it took to fill vacancies depended upon whether or not there was a civil service list available for hiring departments to utilize or whether or not the position was unclassified or classified. But in general, I think we all recognize that we could do better.'",
        "'speaker_8': 'And we have taken some steps to look at ways that we can basically eliminate unnecessary processes or expedite certain processes so that we can assist our departments in filling their positions. I can go into more detail about some of these efforts that we implemented to streamline the hiring process.'",
        "'speaker_8': 'But we're not done. We are still working together with civil service and we are also will be engaging the AI team this year to assist us in continuing the effort of streamlining the hiring process and basically quantifying those efforts.'",
        "'speaker_8': 'And I'd be happy to answer any questions.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'And thank you, Vice Mayor, for our last presentation. We'd like to call up our city auditor, Laura Dowd, who will talk about the recent onboarding audit that she completed in partnership with H.R. in the city manager's office.'",
        "'speaker_2': 'Great. Thank you very much. Vice Mayor and City Council Members. Our office was requested to perform an audit in this critical area of human resources. And given my own staff's workload, we did contract out with a audit firm to conduct this performance on it.'",
        "'speaker_2': 'And the findings really boil down to three areas that generally the city's onboarding policies and policies and programs are and are adequate at this time. And we'd like to say that the city has also implemented some very positive aspects in their onboarding program and some best practices that the team found as they did benchmarks with other cities'",
        "'speaker_2': '. And so we want to give them a lot of credit for having a very good, especially pre-employment onboarding process. And we're also very pleased that the city manager and human resources department have been very collaborative in this process and in agreement with the recommendations and have already taken significant steps to implement the recommendations that the audit has'",
        "'speaker_2': 'recommended. I would just like to briefly give an overview of a couple of those recommendations that the audit made and one in regarding the pre-employment. There were two recommendations made, and one was the additional transparency to be provided by the Human Resources Department in their hiring regarding background checks.'",
        "'speaker_2': 'And this could reduce the uncertainty and frustration experienced by departments when one of their potential employees was denied and human resources has already trained personnel from the city regarding the background process and that what they do in making their decisions.'",
        "'speaker_2': 'The other was to perform a cost benefit analysis be performed regarding the value and relevancy of medical screenings for all employees. The City of Long Beach was only one of the six benchmark cities that did medical screenings for every employee for the post-employment on board onboarding.'",
        "'speaker_2': 'The city's post-employment approach is very is less formalized than the city's pre-employment onboarding steps, and the recommendations include for the city to develop a written onboarding policy. Or guide where in onboarding roles and responsibilities and expectations are defined and communicated to department managers, administrative officers and key personnel, and also to provide the city wide new employee orientation'",
        "'speaker_2': 'on a monthly basis. This has been a very successful program that the city has established, and so we recommend them to do it on a monthly basis, and they are doing that on a on a monthly basis. And it's been a very successful program.'",
        "'speaker_2': 'The other is to to have a little better tracking of the attendance at these new employee orientations so we know who's there and who's not attending and why, and to develop a policy that would standardize informal performance check ins of employment to ensure new employees are provided with sufficient feedback.'",
        "'speaker_2': 'And lastly, to develop an exit interview policy that would include a standard employee exit survey. Exit surveys and interviews can provide a valuable information to improve onboarding and employee retention. And then there's also a section on the elected officials onboarding.'",
        "'speaker_2': 'And we all know that onboarding is not only important to city staff and city management, but also for elected officials, as we are, and also for our staff's work. We're not subject to the city manager's onboarding policies. So the recommendations that the audit recommends is that with the mayor's lead, city council should adopt a policy establishing an'",
        "'speaker_2': 'official city council onboarding process and develop a comprehensive onboarding or orientation program and materials for council members. The second was the mayor's office should develop a separate onboarding document guide that is more tailored to Legislative Department at will employees providing pertinent information and guidance on various topics, including both requirements and voluntary steps.'",
        "'speaker_2': 'Essentially better guidance on what out will employees should know about city policies and requirements. All elected officials should encourage their new employees to participate in the relevant citywide onboarding activities, such as the new employee orientation. And that concludes my presentation.'",
        "'speaker_2': 'I do want to thank the city departments and the council members and the mayor and the departments and especially the city employees that participated in this audit. There were a lot of interviews that were conducted and surveys that were conducted.'",
        "'speaker_2': 'We received good feedback from the employees who participated, and we appreciate the agreement to all of the recommendations that this audit made. And I hope to assist in the collaboration of developing policies and procedures so that we can all fulfill the important duties and responsibilities that we have to public service.'",
        "'speaker_4': 'Thank you. Mrs. Dao, thank you very much.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Are you through?'",
        "'speaker_7': 'And that concludes our staff report.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_9': 'Thank you, Elizabeth. Councilmember. Do you want to speak first? Okay, thanks. Again, I want to thank all the departments that worked on this. I know I'd kind of expected to see the recommendations and timelines in a PowerPoint, but that's okay.'",
        "'speaker_9': 'I think the information that was provided is really fantastic. I want to thank the work around trauma informed and really being able to explain that to the entire council and to our community that when we get those trainings and that information, we're better able to assist not only our community members that we get a lot of calls'",
        "'speaker_9': ', particularly in the second with members of our community that might need a little extra handholding. And so I'm sure that this trainings will help us in addition to our staff. And so we'll really connect the trauma informed with our practices.'",
        "'speaker_9': 'What I read in the consultant's report, you know, I think highlighted exactly what we kind of knew, which was that we, you know, doing medical evaluations for every single employee, being one of only six cities that does that.'",
        "'speaker_9': 'I can tell you as someone that's hired a lot of employees here and it's someone that talks to a lot of workers when they go through that process, if somebody tries to get hired and they take anxiety medicine or they have something on that, they don't use that often, but they feel that they have to disclose that'",
        "'speaker_9': '. Then they have to talk to H.R. about it. Then they have to go to their doctor and get it, get a letter stating what it's for. And often whenever we're dealing with whether it's our mental health, which all of us, you know, have mental health challenges at different times, it really has been triggering for a lot of'",
        "'speaker_9': 'our employees. So I really am happy to see that they recommend removing that if it's not needed in that department. And I'm assuming that some of the departments might be Fire and PD that really need to go through the medical.'",
        "'speaker_9': 'I'm sure there are other departments, but I did want to ask one question because it was brought up through our health department. It was brought up through several other community members. And I'm not doing this to be to trigger a whole debate, but it's really just a question.'",
        "'speaker_9': 'Cannabis is legal now. Alcohol's legal. We don't test for alcohol. Is the city going to look at a cannabis policy or are they going to continue that for the entire city? Are they exploring it only for certain members of our employees?'",
        "'speaker_7': 'So we were also excited to see the editors recommendations about the medical. That's something in management that we've had questions about for a while. And it was part of the review that we were undertaking. And so this put a finer point on it and provided some data and some benchmarks.'",
        "'speaker_7': 'So we agree. One of the things that medical has done was reduce worker's comp costs that we do as a city, have one of the lower workers comp costs. But it also, you know, is an impediment to hiring because we're doing it for everybody and not as selective.'",
        "'speaker_7': 'So we are interested in some positions have to go through a medical and then others you can be more of in is a judgment call of which ones do we really want for workers comp purposes to go through a medical or not?'",
        "'speaker_7': 'To your question of of medical marijuana, that is something we're going to be looking at as we go through this. So it is illegal substance. And for some workers, it will absolutely be for forbidden because it's under DOJ guidelines and that type of thing.'",
        "'speaker_7': 'But we don't know the answer to that yet. But if we're not doing medical testing of every employee, we wouldn't necessarily need to do it through the background check. That said, you're not allowed to be intoxicated at work, whether it's illegal drug or an illegal drug.'",
        "'speaker_7': 'So we would still have the ability to do reasonable suspicion testing and those types of things to make sure if you're at work, you are not you are not inebriated.'",
        "'speaker_9': 'Just like with any substance, alcohol, pain pills, anything else. So I just want to hope that we as a city are looking through that lens of trying to make it aligned with with policies as much as possible. Other things that I just want to highlight because they weren't talked about, other onboarding processes that they've done is around'",
        "'speaker_9': 'your driver's history. And so if you're not required to drive for your job or you do, you have to have that background check. And I know with one of our employees, that was something that was ten years ago that came up and it stalled her onboarding for four weeks.'",
        "'speaker_9': 'And so I really am happy to see, you know, this third party do this audit and give us some of those recommendations. Other points that I'd like to highlight in the report about some of the vacancies. I know that we had someone in public comment speak about our animal shelter.'",
        "'speaker_9': 'And I just want to highlight, I think we have eight vacancies or eight positions slotted for our animal shelter, but only two of them are filled right now. Is that correct? I'm sorry to spring that question on you, but.'",
        "'speaker_7': 'I don't know if we have that today. Vacancies really are a snapshot in time. There are times when we're fully staffed. There's times when we have vacancies. We don't purposely hold vacancies, you know, under normal circumstances. But we also have things called vacancy targets that the council puts in the budget.'",
        "'speaker_7': 'So we may have eight vacancies, but it depends on the list and where we are in the hiring process. Our goal is to be fully staffed whenever possible.'",
        "'speaker_9': 'Of course. And I guess when when staff comes back with a report later in the year on what they've accepted, is some of the recommendations really looking at are there opportunities like if we have a veterinary school nearby, is our Parks and Rec team able to work with that school to try to fill vacancies in that department'",
        "'speaker_9': 'working with our workforce development? Those are some of the topics that I wanted to to talk about on that. And then I am going to ask on some of the vacancies. Also, we know that sometimes we have attrition.'",
        "'speaker_9': 'Obviously, I know in the past we've had a tuition fund and I just wanted to get clarity and history on that very quickly. There's something to kind of retain some employees or upward mobility.'",
        "'speaker_7': 'So tuition fund is one of the items that is in in the MCU. It's currently under a grievance procedure right now from IBM. So there is an active grievance that is going through the process on that. In terms of funding, it has not been funded since, I believe, 2005.'",
        "'speaker_7': 'So it was one of those things that went away could be 26, but it went away during the three year budget process as we did a three year plan. So we have not had active for for most departments, you know, funded program.'",
        "'speaker_9': 'I know that I'm over my time, I will say that I want to make sure that the H.R. practices that the mayor's office has talked about for legislative are things that we also have for our city attorney, city prosecutor and our city auditor as well.'",
        "'speaker_9': 'Thank you guys very much for a great work.'",
        "'speaker_4': 'Thank you, Mrs. Price.'",
        "'speaker_2': 'Thank you. And I want to thank my colleague, Councilmember Pearce, for bringing this item, this the series of items forward. I think it's evaluating, allowing us and actually forcing us to evaluate some of our practices and make them better and adjust to adjust them to modern times and modern realities in the workforce.'",
        "'speaker_2': 'And I think it was very educational. I think staff for the reports tonight, I thought it was really great, especially all the work around trauma informed practices. I think I think felt the older some of us get, the more we realize childhood trauma impacts the lens with which you view the whole world and your reaction to things'",
        "'speaker_2': 'and your sensitivities and your triggers and the like. So the more we can create a supportive work environment where we're working at understanding the core of the person rather than the exterior the person, I think the better will be as a as a workforce.'",
        "'speaker_2': 'So thank you.'",
        "'speaker_4': 'Thank you. Councilman Austin.'",
        "'speaker_6': 'Thank you so much. I want to thank also Councilmember Peers.'",
        "'speaker_5': 'For bringing this forward. You know, this could have been.'",
        "'speaker_6': 'Literally three separate items all in once and but but very substantive. I want to thank staff.'",
        "'speaker_5': 'For their very.'",
        "'speaker_6': 'Very detailed report. I know a lot of work went into researching and and especially the city auditor the audit team for their work here.'",
        "'speaker_5': 'I'm looking at and I think we all learn something here, particularly about being trauma informed or being a trauma informed city. But from from.'",
        "'speaker_6': 'An employee standpoint, I'm concerned about the vicarious trauma, particularly on many of our our employees who who are dealing with very, very tough situations on a daily basis, not just our public safety, but parks and recreation, our health department employees.'",
        "'speaker_6': 'And I think this is something that we need to continue to watch and keep in mind.'",
        "'speaker_5': 'And yeah, overall. Thank you.'",
        "'speaker_6': 'Great report. Excellent item. Looking forward, I think we're going to be a better city administration as a result.'",
        "'speaker_4': 'Thank you. Thank you, Councilman Nelson. And in public comment on this item. I have. I only have one, Mr. Cantrell. Very good. You. It's good you. Okay. And a question. No. Okay. The only one. Devon. Devon, you.'",
        "'speaker_5': 'Good evening, Honorable Vice.'",
        "'speaker_6': 'Mayor and City Council. Thank you for taking the time to hear this item. My name is Devin Ambler and I'm a representative of the IAM. So this report is through and the recommendations we think will move Long Beach forward so that we can continue providing world class services which our members provide on the daily.'",
        "'speaker_5': 'This is going to give.'",
        "'speaker_6': 'The employees the support they need to better do their jobs, and it's going to help management because we know that filling vacancies is very difficult. And to get your job done, you need those vacancies filled and that's really important.'",
        "'speaker_6': 'So we want to make sure that you're taking all of the recommendations very seriously.'",
        "'speaker_5': 'But we did have a couple of notes here. Firstly, we actually haven't.'",
        "'speaker_6': 'Seen any part timers at the new employee orientations monthly. We would love to have them there. So, you know, I know that we'd heard that they weren't coming to it, but we haven't seen them. So if we can work that out, they'd be fantastic.'",
        "'speaker_6': 'Make sure they're really part of the loop and are informed in everything. But also when it comes to when we're talking about judgment calls with medical testing and everything like that before onboarding, I don't like the term judgment call.'",
        "'speaker_6': 'I think we need sound metrics to make sure that people are being treated fairly. When you do judgment calls, that leads to disparate treatment, and we already know that certain communities are impacted by that more than other communities.'",
        "'speaker_6': 'But other than that, we're really thankful that this is happening. We think it's going to be fantastic for everybody, for the Council, for management, for the staff, and most importantly, for the communities we service. So thank you.'",
        "'speaker_4': 'Thank you very much, Kevin. See, there's no more speakers now. Excuse me. Yes.'",
        "'speaker_9': 'Smile when you look at me. I have two other comments. One that I was supposed to comment on earlier on the original recommendation. The second item on their request of the city auditor to conduct an audit of the process for employees, interns, volunteers, commissioners, elected officials to be informed of their rights as it related to discrimination, harassment'",
        "'speaker_9': 'and retaliation. I believe at that meeting, Councilmember Gonzales also talked about an online website similar to L.A. and I don't expect to report on that today, but I did want to flag it publicly and just say that we'll be following up with the H.R. department and how that's going.'",
        "'speaker_9': 'I know that there's an ethics audit coming, is that correct? What's the timeline on that ethics audit? You can just, like, yell at and I'll repeat it for you.'",
        "'speaker_2': 'Next month or two. It will be.'",
        "'speaker_9': 'Wonderful. Thank you. And again, with this item, we really just trying to make Long Beach, you know, the best city to work for, which I think is is a great goal for us to have. So thank you for your patience.'",
        "'speaker_7': 'Councilmember We have an answer. Alex Bass was on the how many harassment trainings you've been doing recently.'",
        "'speaker_8': 'And thank you, Tom. Well, I want to just share some information at the new employee orientation. When we onboard employees, they are provided with copies of policies and directed to where they can find the policies related to harassment, discrimination in the workplace, workplace violence and so on.'",
        "'speaker_8': 'And I also just wanted to share that so far where we're undergoing our campaign to train all managers and supervisors as required by state law. And to date, we've already trained 1198 supervisors and managers. And this year we were also mandated by the state to train all city employees.'",
        "'speaker_8': 'And today we've held 28 sessions and train 2548 city employees on prevention of workplace harassment. So in total, we've trained 3746 employees, and we're going to continue our efforts to ensure that all city employees are trained in this area.'",
        "'speaker_9': 'Over halfway there. Thank you so much. Great work, guys.'",
        "'speaker_4': 'Thank you very much. Let's see if there's more to speak as you please cast your vote.'"
    ],
    "Feasibility of On-Call Teams for Public Space Maintenance and Service Provision.": [
        "'speaker_0': 'Russian case.'",
        "'speaker_4': 'Now we're going to move to item 16, please, with the item club.'",
        "'speaker_0': 'Item 16 is is a communication from Councilwoman Price Council member. So Pinol and Vice Mayor Andrew's recommendation to request city manager to work with police department and multi departmental team to report back on the feasibility of creating teams that are on call to work with city departments.'",
        "'speaker_4': 'Thank you. Count on price.'",
        "'speaker_2': 'Thank you. I'm asking my colleagues to support me on this item as our ongoing efforts to try to create an environment where homeless individuals are being offered services and having incentives to allow them to get into services with some provisions regarding their property in the city of Long Beach.'",
        "'speaker_2': 'As we all know, we're taking huge steps to improve our ability to provide assistance to those in need while also minimizing the impacts homelessness has to the communities. Tonight, I would like to have us look into the possibility of Long Beach taking another step to improve our ability to address homelessness.'",
        "'speaker_2': 'We have an amazing staff and city team and our homeless outreach team, our police department, our quality of life officers, our fire departments, heat heart teams, and they work tirelessly every day to get homeless people the help they need.'",
        "'speaker_2': 'We've seen over and over that getting people into services is the most successful way of helping them to make major life changes and long term transformations. Through rehab, shelter or bridge housing or through detox treatment, they can obtain the first steps they need to get on that journey to recovery and or the assistance that they need to'",
        "'speaker_2': 'make life time changes. It can be time consuming and difficult work to convince our first responders and our homeless outreach team to finally accept services. And we want to make it easier for individuals experiencing homelessness to be willing to accept those services.'",
        "'speaker_2': 'One of the hurdles that I have personally observed through many homeless outreach ride alongs is that people living outdoors do not want to park from their belongings. Their belongings can, in most cases not be brought to the treatment center, which forces the individuals to choose between getting help or keeping their property.'",
        "'speaker_2': 'We should be able to offer another option where we have a dedicated team that can be called to inventory, collect transport and store the property for people, giving them peace of mind that they're not giving up their belongings in order to accept services.'",
        "'speaker_2': 'Instead that the city is working to help make accepting those services less difficult. This could be done for any part of our multi department team that works to address the issue of homelessness from police to fire to our health department.'",
        "'speaker_2': 'This could also be used to assist police when conducting arrest or when quality of life officers are transporting someone to a treatment center or facility. It could be used when our Hart team responds to a call and we want to get someone into the help that they need.'",
        "'speaker_2': 'This could be used when homeless outreach teams meet with an individual for the 17th time and they finally agree that they're going to enter into a program that gets them back on the right track. But they don't want to abandon their property, which is incredibly reasonable.'",
        "'speaker_2': 'Any department who would want to work to safely itemize and store property would be able to contact a team, a city team for that purpose, making it easier for staff members, working to get someone into services to be able to focus their attention on the individual.'",
        "'speaker_2': 'Removing this reason for someone to refuse services helps us make it more likely and more attractive for people to get into the services that they need by accepting services on the spot. It also helps free up existing city staff working with homeless individuals to do their work and not be forced to spend long periods of time inventorying'",
        "'speaker_2': 'property. Further, this inventory team could help us be more proactive in getting public spaces cleaned up by giving individuals experiencing homelessness greater confidence and security that their property will be kept safely in a secure location. It's a major way that we can reduce barriers to accepting services, help our multi department teams be more efficient and effective, and'",
        "'speaker_2': 'improve the maintenance of our public spaces. And with the purchasing of the building that will become the navigation center, we have an opportunity here. As a city, we can be more efficient with our specialized staff in ways that help city staff be more effective in police work, public space maintenance, providing homeless rehabilitation services and maintenance of our'",
        "'speaker_2': 'parking spaces. I believe this team could this inventory team could really become a huge asset to the city as we continue to work together to better help the homeless and to maintain our public spaces. So I ask my colleagues to approve this item, which allows us to explore the possibility of creating inventory teams to assist our first'",
        "'speaker_2': 'responders.'",
        "'speaker_1': 'Thank you, Councilwoman Price, Councilmember Supernova.'",
        "'speaker_10': 'Thank you. Great report, Councilman. I think that this is all about giving support to those who do the outreach and giving them a broader range of resources to help folks. And who knows? With this in place, maybe that average number of 17 visits will come down.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_1': 'Thank you, Ms.. Mary Andrews.'",
        "'speaker_4': 'Yes, thank you, Mayor. Council County Councilwoman Price. I think that this is an excellent idea to be able to help our homeless situation, because a lot of individuals do not want to depart from anything that they have created or stored.'",
        "'speaker_4': 'So I want to thank you for bringing this item forward. And I think any time that we can encourage homeless individuals to accept service is worth exploring. I am sharing with you all of the photos. If you can get a chance to see those.'",
        "'speaker_4': 'I have photos of this ongoing encampment along nine corridor in my district. I've gone out and spoke to these individuals. Some want to help. Some do not. But if they can make it easier for them to trace the transition and openness, this mechanism can help them.'",
        "'speaker_4': 'It's a lot of individuals and I know a few individuals pray to God that you never, ever have to be homeless, that you will be able to understand that a lot of these individuals. They're not really looking for help.'",
        "'speaker_4': 'But we're going to continue to stay and do everything we can to try to get them any kind of help that they need. So I thank you very much, Mr. Rice, for bringing this item forward, and I will totally support it.'",
        "'speaker_1': 'I don't see any public comment, any members of the public here on this item here. So we go ahead and please cast your votes.'"
    ],
    "Relocation Plan for 6841-6845 Atlantic Avenue.": [
        "'speaker_0': 'Council member Oranga. Bush and Kerry.'",
        "'speaker_1': 'You think the agenda is complete? We're going back to the last two items. It'll be 19 and 24. So we're going to go to 19/1, then 24. The new business. And I believe we've heard all other items say correct.'",
        "'speaker_0': 'Yeah. 19 and 24.'",
        "'speaker_1': 'So I a number 19.'",
        "'speaker_0': 'Item 19 is a report from Economic Development recommendation to approve the relocation plan for 684136845 Atlantic Avenue District nine.'",
        "'speaker_1': 'Okay. Thank you. Mr. Richards, do you want a staff report concerning no compensation? No. Okay. So most definitely do have. We do have some public comment on item 19. So. Marsha Durbin. Harold Durbin. Freddy McGowan. Art Figueroa, Darren Erin.'",
        "'speaker_1': 'Tina Soso if you could all please come up. Those first six speakers. And we have over ten speakers, so it'll go down to 130.'",
        "'speaker_6': 'I was like, We're going to use that report.'",
        "'speaker_1': 'Okay, well, I guess we're going to self-report. So if I can just have you guys take a seat, please. We're going to we are going to do a staff report first. Apologize for that.'",
        "'speaker_7': 'Thank you, Mr. Mayor. John Geisler, our economic development director, has a staff report that we can prepare.'",
        "'speaker_4': 'Provide honorable mayor and members of the city council. Thank you so much. So this report actually pertains to what we call Atlantic Farms or 6841 through 68, 45 Atlantic Avenue. We recently purchased this property as part of a project to eventually build our homeless shelter.'",
        "'speaker_4': 'And I'm going to ask Mary Torres, our property services officer, to give you a breakdown of what the relocation requirements are for existing tenants in what we have for you to approve tonight.'",
        "'speaker_8': 'Thank you, Mayor. Members of the city council. The item before you, like John said, was is the adoption of a relocation plan. The city did acquire the property this past July. There are current. The current tenants occupying the site are Eddy's Liquor One Residential Tenant College of Instrument Technology.'",
        "'speaker_8': 'KBIA 6845. And there are nine individuals who park their semi-trucks occasionally. Of those tenants, Eddie's liquor and residential tenant. The residential tenant will be vacating January 5th of 2020. KB 86845 is not being able is not being required to relocate at this time.'",
        "'speaker_8': 'Of the nine individuals who park at the site, only one has come forward to submit a claim for relocation benefits. And the city is currently working with the College of Instrument Technology in the Water Department on a relocation site.'",
        "'speaker_8': 'Under California law. Prior to any displacement of tenants, a relocation plan must be prepared and submitted for approval by the local legislative body. The relocation plan outlines the needs and characteristics of the displaced population, the available relocation resources and the city's program to provide assistance to each affected displaced party as well as the benefits available to them'",
        "'speaker_8': '. The relocation plan must be available for public review and comment for at least 30 days prior to consideration by the City Council for approval. On October 3rd, 2019, a notification letter was sent to all onsite occupants, indicating the relocation plan was available for public review.'",
        "'speaker_8': 'Comments were received during the three day review period, which ended November 31, 2019, and are included within the relocation plan for consideration and adoption. The recommendation before you is to adopt the relocation plan. This concludes my staff report.'",
        "'speaker_8': 'I'm available to answer any questions as well as the cities relocation consultant Overland Pacific and Color.'",
        "'speaker_4': 'Thank you. Is that it? That's fine. Could we have those speakers back up to the guys just place? Marcus Harrell. But he. You have a 90 seconds. You. How? How long? 90 seconds.'",
        "'speaker_3': 'They cut it in half because we.'",
        "'speaker_4': 'Have over ten speakers.'",
        "'speaker_3': 'Good evening. I'm sorry Mr. Mayor is not here, but Mr. Vice Mayor, city council members. My name is Marsha Durbin, and I serve in the city of Long Beach as the director of the College of Instrument Technology, also known as City.'",
        "'speaker_3': 'We are one of the affected displaced businesses business owners at 6841 Atlantic Avenue in Long Beach, where a small family run business. And we have been very successfully training Long Beach unemployed veterans and homeless residents for more than 30 years.'",
        "'speaker_3': 'We worked for the Long Beach Pacific Gateway and other workforce investment agencies to train and place participants in a heavy equipment truck driver or crane operator career. We have a success rate of 96% employment and a good jobs that pay them good enough that they can buy their own homes, cars and etc..'",
        "'speaker_3': 'Many graduates come back and tell us how they were able to buy a house or a car for the first time in their lives. Many were homeless. Most were collecting unemployment. And I see my time's almost over. We need what we need from you.'",
        "'speaker_3': 'We need more money for relocation. And we need a place to go. We have to get approval from the Bureau of Postsecondary Education for the new location. We don't have a location confirmed yet, and we need that desperately.'",
        "'speaker_3': 'We need your help.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Yes. Harold, please. Yeah. We started at the College of Instrument Technology and a joint venture with Long Beach City College 35 years ago. And unfortunately, I made a big mistake. I left Long Beach City College after two years because their emphasis of what their thought education should be and mine was different.'",
        "'speaker_4': 'We started the joint venture to have people trained, so when we hired them, they could actually go to work. We wanted the only thing that we'd have to tell them was where to punch your timecard and where the bathrooms were.'",
        "'speaker_4': 'We wanted them trained to that level so they were productive. Day one For the last seven years, we've had over 93% people actually going to work and. The last three years is 96%. And that's not internships, apprenticeships or enterprise zones.'",
        "'speaker_4': 'Those are not real jobs. They don't have to keep them after they get that federal or state funding. 80% of our graduates make 80 to 120000 after 20 weeks of training. When we were in Long Beach City College, they wanted a lesson plan for every day that put everybody in the same package.'",
        "'speaker_4': 'We left there because that is not productive. If you're a businessman, you would never do it that way. You learn every person to go at their own speed and their success rate. Our results proved that I was right.'",
        "'speaker_4': 'Thank you very much. Then the next speaker.'",
        "'speaker_5': 'Very honorable counselor. My name is Freddy McGowan. I am a 2016 city veteran graduate. I'm one of the success stories. I served with the United States Marine Corps for nearly 21 years. I served around the globe as a staff NCO upon graduation.'",
        "'speaker_5': 'Prior to retiring, I didn't have a place to go. I was at the unemployment office and with my and I saw the city flier with my 80% disabilities, I didn't have the skills or the knowledge of where to go, where to be hirable.'",
        "'speaker_5': 'The so once I enrolled at City, City gave me the skills that I needed to succeed and society along with other fellow veterans that were homeless. And I am testifying on their behalf that they're not here because they're successful.'",
        "'speaker_5': 'Men and women out there serving again in this country are successful civilians. Thank you to city. I respectfully ask a long, long beach Long Beach City Council that enough relocation allocations be distributed so the city can remain successful in relocating.'",
        "'speaker_5': 'Also, US veterans are helping us all out. Thank you so.'",
        "'speaker_4': 'Much. Thank you. Thank you very much, sir. Next speaker, I think we are. All right, guys.'",
        "'speaker_5': 'So I didn't go. Uh, thanks very much. Look.'",
        "'speaker_4': 'I think we have to figure out where.'",
        "'speaker_5': 'I work for college measurement technology. Oh, sorry. You guys have cerebral palsy.'",
        "'speaker_4': 'Excuse me, sir. Um, so Seattle has helped.'",
        "'speaker_5': 'Me painting with women. But that's not where it's gonna stay and help all kinds of people.'",
        "'speaker_6': 'From all facets of lives.'",
        "'speaker_5': 'From Long Beach City to the surrounding cities. They've helped. Tons of communities get jobs in the crane industry, heavy equipment industry. And if that's not for available for the people, it's just a humongous disservice. Not only. Sorry, guys.'",
        "'speaker_5': 'Not only for them, but for my colleagues that are all sitting around me right now. Citi's relocation is one of the best things you could put money towards. City has done great things for the community that have potential impact for generations.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_4': 'Thank you very much, Darren and Tina.'",
        "'speaker_5': 'How are you doing? My name is Dan Roy Aaron, and I'm a graduate and I'm also a truck driving instructor for the school. After completing the program in 2015 at Harmony. As an instructor, I appreciate you. The city of Long Beach would help see it and finding a new location so that we can continue to serve our'",
        "'speaker_5': 'community. The majority of the people that I train are people from the military, people who have been incarcerated for many years, people who have people that have many problems finding employment and people that come to the school that are homeless.'",
        "'speaker_5': 'I was one of these people because the city hired me. Now I can also give back to our community and you know, thank you for your time.'",
        "'speaker_4': 'Thank you very much. In a place.'",
        "'speaker_8': 'Hi, my name is Tina Swasey. So I am my Cathy Workforce graduate.'",
        "'speaker_2': 'I worked for.'",
        "'speaker_3': 'A major alarm.'",
        "'speaker_8': 'Security company for 26 years and then administration.'",
        "'speaker_3': 'And then I was laid off knowing that I was how do I knowing that I needed to be retrained. And then another field I found information on Katie and I started the trucking program. I graduated and Katie.'",
        "'speaker_8': 'Offered me a position to train other students in trucking. So I've been working there for ten years. I'm an instructor. I prep the students for DMV on their brakes and future to get there as CDL. I am 59.'",
        "'speaker_3': 'Years old and the city has no place to be relocated. It will jeopardize my job as well as my coworkers. I respectfully ask the Long Beach community to ensure.'",
        "'speaker_8': 'That city receives sufficient.'",
        "'speaker_3': 'Funds for a relocation. Thank you.'",
        "'speaker_4': 'Thank you to the next speaker, Matt and Senior Principal Jacob.'",
        "'speaker_8': 'Hello. My name is Francine. I've been.'",
        "'speaker_3': 'Jabbed about Brexit.'",
        "'speaker_8': 'Since 2015. I started CRT when I was about 20 with little experience in the work.'",
        "'speaker_0': 'Field and.'",
        "'speaker_9': 'Said he gave me that chance to grow as an.'",
        "'speaker_0': 'Employee and most importantly.'",
        "'speaker_8': 'Help people find employment.'",
        "'speaker_0': 'It's been a privilege to have the experience.'",
        "'speaker_8': 'Experience over 90% plays a role in each of their programs.'",
        "'speaker_3': 'I really do hope that the City.'",
        "'speaker_8': 'Of Long Beach is able to find a relocation facility, not just for my job for for other students that are unemployed and the veterans returning home. Thank you.'",
        "'speaker_4': 'Thank you very much. Jacob here. Jacob. Jason. Oh, I said Jason. Excuse me. Yes. My name is Jason. I reside in the ninth district as as I have for nearly ten years now. I am a c i t graduate who graduated from the who was trained and certified at the location at 6041 Atlantic.'",
        "'speaker_4': 'They are what we call the Atlantic Yard. I had gone to school in Long Beach City College and graduated from there with the horticulture degree. I had had some problems in finding a steady job and so I decided to go to city.'",
        "'speaker_4': 'I was trained and certified there and the training that they provide is top notch when we go as to get our class a driver's license at the DMV, I was shocked at how many of the other trade schools had their students turning around and walking that walk of shame away from the DMV without even getting to go'",
        "'speaker_4': 'on the road. But City provides their students with the skills that they need to make sure that they are going to pass. And that is why their completion rate and job placement rate is astronomical. I mean, if you look at our community colleges, the graduation rate is barely 13, 18%, yet they are providing jobs, high quality paying'",
        "'speaker_4': 'jobs, which now actually work at Long Beach City College and have been employed there. And so I ask if you do go through it, I strongly oppose it. But if you do go through, please postpone it to allocate them proper funding.'",
        "'speaker_4': 'Thank you, sir.'",
        "'speaker_1': 'Thank you. Next up is artist tutorial and an after party is Harry Durban and then Elizabeth Dawson. And then how to protect those folks in the lineup, please. Next up, artist guitarist Harry Durbin, Elizabeth Dawson and Howard Pratt.'",
        "'speaker_1': 'The police line up at the podium in that order right now. That would be great. Go ahead.'",
        "'speaker_8': 'Good evening. My name is art historian. I'm the assistant director at the College of Instrument Technology. I work directly with programs such as Pacific Gateway to receive referrals.'",
        "'speaker_2': 'And provide intake into our programs.'",
        "'speaker_8': 'I'm also the liaison with the California State Bureau of Postsecondary Private Postsecondary Education. In the event of relocation, I will ensure that we are compliant with BP during this critical move in transition. I'm also the liaison with the U.S. Department of Veterans Affairs, the VA.'",
        "'speaker_8': 'We started discussions with the VA already regarding our move, but we can't move forward with any type of review or.'",
        "'speaker_2': 'Approval.'",
        "'speaker_8': 'Until we have confirmed training site and also they require BPP approval first. So as you can see, the 90 day notification is very stressful at this point because we don't have a secured site. So we ask you to consider that when you do give notification, having sufficient relocation, time and support will enable us to hopefully make it'",
        "'speaker_8': 'through the period we want to be in. Compliance and to work with the city and with the city of Long Beach is help. We hope to secure a site immediately, make this transition smoothly so it does not affect our students and we can uphold our mission, which, as you've heard, is helping our veterans are unemployed or homeless'",
        "'speaker_8': 'or underemployed reenter the workforce with meaningful careers. I respectfully asked the Long Beach City Council to consider the timeframe and to receive sufficient relocation allocations.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_1': 'Thank you very much. Elizabeth Thorsen. I'm sorry. Eric Durbin, the mayor was with Belgium.'",
        "'speaker_6': 'Hello. Harry Durbin. I want to thank Mary Tours and Mr. Kaiser for working with us so closely as they have been to help us to find a new location. And since they've been working as closely as they have, we have found some spots that may work out, but nothing that's concrete.'",
        "'speaker_6': 'And that's what our major issue is, is that we need to be able to let the BPP know which you guys are familiar with. We have to let VA Veteran Affairs know where we're going to move to and they have to approve the site before we can do it.'",
        "'speaker_6': 'We can't just sit and say, Hey, we're going to move there tomorrow and go there. So it's like she said, a stressful.'",
        "'speaker_5': 'Process that we're very worried about because we want to be able to keep.'",
        "'speaker_6': 'And to continue providing the high level of service that we've been doing for so many years, thanks to my family and and the efforts that my dad saw way back when of a person needed to be able to be trained and then go directly to work in a short amount of time.'",
        "'speaker_6': 'Our course has run from 5000 to $30000 that it cost for people that come. It takes anywhere from eight weeks to 20 weeks and they go to work. I mean, they literally get jobs. I had a guy that took my eight week course level one, but we got his class license and his heavy equipment certification.'",
        "'speaker_6': 'He went day one and started off with the union, starting off at $52 an hour. So it works. It works over and over again. That's my slogan that I tell guys. It's not about what you want to do.'",
        "'speaker_6': 'It's about what you want to do on the weekend. And so you can make enough money to do what you want in your spare time. Thank you very.'",
        "'speaker_1': 'Much. Thank you so much. Elizabeth Dawson, please. And then Howard Pratt.'",
        "'speaker_3': 'Good evening.'",
        "'speaker_4': 'Mayor Garcia and City Council.'",
        "'speaker_3': 'The College of Internet Technology is a school that has been located at 6841 Atlantic Avenue. They have been paying the rent. They have been training folks that are underserved from the city of Long Beach. They have a longstanding contract with Pacific Gateway training.'",
        "'speaker_3': 'Long Beach residents. And they do it successfully. Our issue is the relocation plan that you all will be approving does not have sufficient funding allocated for the College of Instrument Technology to relocate $20,000. If you take a look at the items for the budget that were put there, an estimate of $150,000.'",
        "'speaker_4': 'This is a unique program.'",
        "'speaker_3': 'They have equipment that is more than 20 tons. It cannot just be stuck on the road and transported to that Long Beach water site. It cost an upwards of $20,000 to move all their equipment. We are asking the council and the mayor that we can work closely with Mr. Keisler and.'",
        "'speaker_3': 'In order for the proper relocation of the College of Consumer Technology. Thank you so much to you, Mr. Pratt.'",
        "'speaker_1': 'So Pratt here may know that we will close public comment and then go to Councilmember Richardson.'",
        "'speaker_6': 'Thank you, Mr. Mayor. So, first of all, thank everybody for coming coming down and making your case. That's what city council and democratic process is for. You know, I was just at the site just this morning, and I'll probably go over there and, you know, look at different things, you know, probably once every few weeks just to'",
        "'speaker_6': 'take a look. And, you know, I have a few questions for staff based on, you know, what the issues that you've raised. So. Mr.. MODICA So tell me about, you know, what the process was to determine what the amount of relocation is that these the tenants of the site receive.'",
        "'speaker_4': 'Councilmember. Absolutely. So I'm going to actually have Mary talk a little bit about the process specifically for Katie that we're engaged in. And we also have our our consultant, OPC, Overland Pacific Cutler here to answer some technical questions if we need that.'",
        "'speaker_4': 'So I'll start with Mary.'",
        "'speaker_8': 'Thank you. The the relocation estimates that are included in the relocation plan are based on a general assessment of the current condition. Once a suitable replacement site is located, then OPC works with the tenant to actually identify the costs that need to be taken into account for relocation to a specific site.'",
        "'speaker_8': 'So the relocation plan, again, is just a general assessment based on sort of an ideal relocation site. But once if I shouldn't say if, but if we can come to an agreement with the water department and get them onto that site, then OPC will work and identify the benefits and the costs that are associated with their moving'",
        "'speaker_8': 'expenses and then that will be incorporated into their their benefits.'",
        "'speaker_6': 'Within this plan is the plan to help assist identifying a site and then identifying the relocation support to make sure that that transition happened, correct?'",
        "'speaker_2': 'Yes.'",
        "'speaker_6': 'Okay. I'd like to keep an eye on this. I like to keep an eye on this. I'd like to make sure that Mr. Geisler, we we communicate. We do a better job communicating the expectations with with the tenant so that we understand it.'",
        "'speaker_6': 'And just to you so first of all, you know, my family's been in the trucking business a long time. I know the way that trucking can transform lives. I know that, you know, there are you know, within the industry, it's very forgiving.'",
        "'speaker_6': 'You can have not the best record and go get a class A driver license and all that matters is a driving record after that. Right. And so, you know, I have folks in my in my you know, in my family involved in the business.'",
        "'speaker_6': 'I've been involved in the business, Reefers, Drive-In, you know, Sandbox, you name it. I pretty much know about the industry, so I get it. I understand if there's something we can do to help with this transition, and I understand that this is a bit uncomfortable.'",
        "'speaker_6': 'This is sort of a bigger picture issue that we have to address. And I know that this is difficult for a lot of people. So we want to make sure that we're fair about this process and that we're communicating and being clear about expectations.'",
        "'speaker_6': 'If there's something we can do, in my understanding, coming into tonight, that that there's potentially a site, there's anything we can do to make that happen. You have my support there. Thank you.'",
        "'speaker_1': 'I think there's a motion in a second member. Please go out and cast your votes.'",
        "'speaker_0': 'Bush and Kerry.'"
    ],
    "Ordinance to Ban Flavored Tobacco Sales in Long Beach.": [
        "'speaker_1': 'Thank you. That concludes that item with item 24.'",
        "'speaker_0': 'Adam, 24, is communication from City Attorney. Recommendation to declare an ordinance amending the Long Beach Municipal Code by adding chapter as amended by the City Council prohibiting the sale of certain flavored tobacco products within the city of Long Beach.'",
        "'speaker_0': 'Read the first time and lead over to the next regular meeting of the City Council for Final Reading City.'",
        "'speaker_1': 'I do have some public comment. Did you want to do any comments first, Councilwoman?'",
        "'speaker_2': 'I have no comments.'",
        "'speaker_1': 'Okay. If these following folks could come forward, I think it's Hymie Rojas or Jimmy Rojas. James Nino. George Johnson. Sanjiv, come on. And Imran Khan. Mohammed, I sorry if I mispronounce some of those names. If you can just come forward in that order, please.'",
        "'speaker_1': 'I'm in. Rojas. James Nino. George Johnson. Sanjeev Kumar. Imran Khan. Muhammad.'",
        "'speaker_5': 'He's come forward. Time I went to dinner.'",
        "'speaker_1': 'James At dinner.'",
        "'speaker_5': 'James Hi, James. Nino. I just want to thank the council for giving me an opportunity to voice my opinion as a small business owner. And thanks for actually taking in and, you know, revising the ordinance. I know now I'm a firm believer that one person or one voice.'",
        "'speaker_6': 'Can make a change or a difference. And I just want to thank you guys and I'm in support of this ordinance. Thank you, guys.'",
        "'speaker_1': 'Thank you. George Johnson.'",
        "'speaker_6': 'On behalf of who could Chamber of Commerce, a small, grassroots organization, I would like to thank you on your proposed amendments to this ordinance, and we give you our full support. Thank you.'",
        "'speaker_1': 'Thank you. It. Sanjiv, come on.'",
        "'speaker_8': 'Thank you for.'",
        "'speaker_3': 'Giving me an opportunity to be.'",
        "'speaker_4': 'Here. So I'm a small business owner here. You know, I have a 7-Eleven franchisee, which I owns with my wife, Sue, who happens to be a 21 year Air Force veteran from the U.S. Air Force. We put all of our savings in here, and now it means we just need the.'",
        "'speaker_8': 'Menthol cigarets are.'",
        "'speaker_4': 'Regulated by the FDA. So we don't know how after having all this regulation made the difference, we are going to.'",
        "'speaker_3': 'Make on that.'",
        "'speaker_4': 'So the other request.'",
        "'speaker_3': 'Will be, you know.'",
        "'speaker_4': 'Looking to see, you know, how you guys manage. You can, you know, protect us that, you know.'",
        "'speaker_3': 'We can still survive in the business.'",
        "'speaker_4': 'That's my request. Thank you.'",
        "'speaker_1': 'Thank you. Is the next speaker. Here is Imran. Please come forward.'",
        "'speaker_6': 'The height of a city council. My name is Imran Khan and I too am a 7-Eleven franchisee. Me along with my dad. My dad has had the business in Long Beach for over 30 years now. We are in Belmont Shaw and, you know, we've been there forever.'",
        "'speaker_6': 'We've employed a lot of members of the community. We have, you know, always paid taxes. We you know, we we we also have a job. He was saying that we want to request that you guys look at the menthol cigaret ban because the tobacco sales are a big part of our business.'",
        "'speaker_6': 'And menthol cigarets, too, are, you know, a huge part of that. And I don't want to see my customers, my loyal customers that have been with us for, you know, ten, 15, 20, 30 years. I don't want to see them going to different cities to get their their product, you know, going under SEAL Beach or up to'",
        "'speaker_6': 'San Pedro. I'd like to see them as customers for our business, you know, taking a seeing a loss in sales. Not only, you know, the tobacco sales would lead to, you know, a decrease in sales and ancillary products.'",
        "'speaker_6': 'You know, people come in and buy their cigarets or buy sodas to buy chips to buy, you know, food items along with their cigarets. So if the menthol cigarets, if they can't come to our business for it, all their sales would come down.'",
        "'speaker_6': 'And we you know, I just want to make sure that, you know, that doesn't I don't want to see that happen. You know, and I also want to let you guys know that, you know, 7-Eleven, we do have a pretty good system of checking IDs to make sure that everybody is over 21.'",
        "'speaker_6': 'We have we actually have to physically scan their I.D. It won't even let us sell them, you know, any jewel product, anything. We have to scan their I.D. to make sure that they are of age before, you know, buying that tobacco product.'",
        "'speaker_6': 'And, you know, lastly, you know, with the increase in minimum wage, with the increase in rents, I don't think our business can afford, you know, any more loss of sales. So please take that into consideration. Thank you.'",
        "'speaker_1': 'Thank you. There is a motion and a second on the floor. This is, I believe, the second reading. And so, members, please cast your votes.'",
        "'speaker_2': 'The first reading, because we made some amendments, some pretty substantial amendments. So I'd ask my colleagues to continue to support this item again in an effort to continue to work with our businesses while the policy and safety concerns continue to settle.'",
        "'speaker_2': 'We have made this a temporary ban, which is a lot more mitigated than what most other municipalities are looking at. So I would hope that that would carry some weight with our business owners who understand the predicament that we're in.'",
        "'speaker_2': 'With that, I'd ask my colleagues to support this item.'",
        "'speaker_1': 'Thank you. Please cast your votes, members.'",
        "'speaker_0': 'Council member Austin, Bush and Kerry.'"
    ]
}