{
    "Continuation of Long Beach Tourism Business Improvement Area Assessment and Agreement with Convention and Visitors Bureau.": [
        "'speaker_3': 'I know they may be here is Jonathan Flor is here. It's not here. Okay? We're going to. Okay. We're going to move on to the next cab until we get this. Okay. We're going to go ahead and do hearing item number two.'",
        "'speaker_3': 'Can you read that, please, Madam Clerk?'",
        "'speaker_5': 'Item two is a report from economic development and recommendation to receive supporting documentation into the record. Conclude the public hearing and Adobe resolution containing the Long Beach Tourism Business Improvement Area Assessment for the period of Tober first 2017 through September 30th, 2018.'",
        "'speaker_5': 'District one, two, four and five.'",
        "'speaker_3': 'Okay. Thank you. With that, let me turn this over to Mr. West.'",
        "'speaker_2': 'Thank you, Mr. Mayor. We'll have a very short presentation. And then I believe the CVB would like to give a presentation as well. So I would turn it over to Eric Romero, our development project manager for EPD.'",
        "'speaker_7': 'Honorable Mayor and members of the City Council. This item is the annual approval of the Long Beach Tourism Business Improvement Area and ongoing assessment. On September 19, 2017, the City Council approved a resolution granting approval of the annual report and set today's date for the public hearing.'",
        "'speaker_7': 'The recommended action on this item continues the assessment for another year. There are no proposed changes to the basis of assessment, nor changes in proposed activity. Therefore, staff request that the City Council received the supporting documentation into the record, approve the resolution and continue the levy of the assessment and authorize the city manager to extend the agreement'",
        "'speaker_7': 'for one additional year. That concludes my report.'",
        "'speaker_3': 'Okay. Thank you. I'm going to now at this time, turn this over to Mr. Goodling.'",
        "'speaker_2': 'Thank you, Mayor.'",
        "'speaker_8': 'City Council, City Management. Thank you for the time tonight. We wanted to share with you what has happened over the last 12 months and a lot of great news. First of all, as we said.'",
        "'speaker_2': 'It's another great year. Excuse me already or no?'",
        "'speaker_3': 'I don't know what's going on back there, guys, but come on. Okay, hold on a second. We're going to we're going to get the presentation fixed. And this is just another just reminder that we need to take care of the technical issues that are happening.'",
        "'speaker_3': 'Last few.'",
        "'speaker_2': 'Meetings.'",
        "'speaker_3': 'Okay. Oh, just us. Okay. See my point. You're completely wrong. That's still. But we still had it. I'm reflecting on the last technical issue we just had at the meeting as well, so why don't we go in? I met Steve.'",
        "'speaker_3': 'What? You start over again, okay?'",
        "'speaker_8': 'Also, we have popcorn coming up for this because we have quite a few things that we want to share with you tonight. First of all, in terms in many different terms, this year has been a huge success in terms of transient occupancy tax.'",
        "'speaker_8': 'It's 26 and a half million dollars. What that means is 13 million of that goes to the general fund. 13 million of that goes to the special advertising and promotions fund, which can be spent then to re promote the city, remarket the city.'",
        "'speaker_8': 'In addition, for every dollar that the CVB got through our contract this past year, we returned $5.73. Also revenue per available room, which is a combination of occupancy and average rate went up 4.7%. The hotels and the management teams have done a great job in managing their assets and in maximizing the revenue that they can charge for'",
        "'speaker_8': 'the rooms. Occupancy was relatively flat this year, up about 1.7%, so they got most of their gain through rate. In addition, we have ten people across the United States and we believe very much in relationship selling where you have to be in market, you have to know the clients in those markets and we have to be asking'",
        "'speaker_8': 'for the business in those markets. And that's what we've done out of the business that we found. 50% of it is convention business. 50% of it is also in-house meetings or IEEE meetings that take place within one hotel.'",
        "'speaker_8': 'We do not believe in transactional relationships. A lot of spaces, a lot of cities and a lot of convention centers basically give me your space and your dates and your rates, and it's purely a transaction. We form partnerships.'",
        "'speaker_8': 'We form long term friendships so that we can ask for the business back, but we also help them in executing their conventions. When a client comes into town, we have either a lunch or a community breakfast where we bring all of our hotel partners and the convention center together.'",
        "'speaker_8': 'I had one client tell me that in 25 years of doing business and selecting cities, she's never had any city meet her with their general managers and their marketing directors and walking them into the city. That's one of the differentiating points of Long Beach versus any other city.'",
        "'speaker_8': 'We also go on the road. We were in Washington, D.C. this year. We also were in Chicago. We also were in San Francisco. And believe it or not, we were in Orange County. And we had 70 clients show up.'",
        "'speaker_8': 'In addition, we brought clients into Long Beach for The Cove opening and also for Grand Prix. And also for A-6 Volleyball. In total, we had over 850 clients that we met either on the road or bringing them into our city, representing over 300,000 room nights for an estimated impact of $120 million.'",
        "'speaker_8': 'In addition, we have attended over 20 tradeshows throughout the U.S.. And this outreach effort is just part of what we do. In addition, service is really key, especially in our business, because if we aren't providing service again, you can't ask for the business back.'",
        "'speaker_8': 'So whether it's our sales team which first finds the business books, if our service team comes in behind and services links them up with the city and the partnerships in the city. The convention center comes in behind and services as well.'",
        "'speaker_8': 'Our hotels do the same and even cash a day with the Office of Special Events gets involved with many of our conventions and Intarsia is just a wealth of experience and the clients love her. We had two you, which is the largest online learning education program system, Internet system in the U.S. with us this past June.'",
        "'speaker_8': 'And they had a party on the beach and Tasha Day helped them get down to the beach with the USC marching band. So again, these are the types of things as a full city that we do and that we pull off.'",
        "'speaker_8': 'In addition, we've gotten awards across the board from almost every publication. But aside from the service, what also differentiates us? I was reading today how Lord Taylor in New York City just sold their flagship store. It's hard to believe that a 100 year old institution had to sell their asset, but they did for 850 million and they'",
        "'speaker_8': 'retained the bottom three floors. If assets aren't constantly reinventing themselves, assets become antiquated. We learned by hosting the TED conference how people nowadays want an asset or a convention center to perform. And quite honestly, convention centers are really becoming old school.'",
        "'speaker_8': 'They're really looking for a conference style facilities. They're looking for places to network. Yes, you too can have a one piece which can Jayna pajama. So just let us know and we'll order it for you. Give us your size.'",
        "'speaker_8': 'But when we had Twitch this past weekend, all throughout our convention center, the promenade side, the exhibit hall side, the arena, all of it was used. All of our different breakout spaces were used. It sees spaces which permit people to collaborate and connect, to actually talk, to share ideas, and to know what's happening within their industries and'",
        "'speaker_8': 'renew and renew acquaintances and make new acquaintances. Twitch Khan was here last week. Most of you saw the purple T-shirts all throughout the city and the purple hair and everything else, and it was really, really a phenomenal convention.'",
        "'speaker_8': 'This is the outside the Pacific Ballroom really was the start of our trend in what we were doing. And for those of you who didn't get to see inside Twitch come. Basically the Pacific Ballroom where the arena became a large ESPN studio, so all the gamers were put on a round platform.'",
        "'speaker_8': 'Above were all the different LED screens to watch what the gamers were doing. Off to the side was a panel discussion with people critiquing and expounding upon what gaming, what the gamers were doing. And the audience was in the foreground.'",
        "'speaker_8': 'That was how the arena was used this past week. All of our tracing grid system, which we did four years ago, was completely used and it made it a turnkey space for Twitch. In addition, we've had multi-level marketing groups using our arena.'",
        "'speaker_8': 'And we've had special events inside the Pacific Ballroom. What I'd like to share with you is since 2013, we've had a 56% increase in the arena or the Pacific Ballroom. And what used to be a building that was quite honestly going into obsolescence has now become an adaptive reuse or reinvigorate IT facility, bringing additional economic impact to'",
        "'speaker_8': 'our city, not only in terms of the events in that space, but in terms of the conventions that want to use that space. In addition, tomorrow we have the president of Chicago's Navy Pier coming to look at us because they'd like to model what we're doing in Long Beach.'",
        "'speaker_8': 'The Cove was our next endeavor. And as as most of you know and thank you for coming this summer. It was a great event. And it was basically an underpass, a dark underpass that quite honestly didn't add much vitality to our city or to the facility.'",
        "'speaker_8': 'That space now is completely ablaze with lights. It's alive, and it's yet one more tool. National Association of Ports used it less than four weeks ago. International Association of Movers just used it for their party, as well as a topless terrace theater.'",
        "'speaker_8': 'And I'd like to share with you the opening party.'",
        "'speaker_1': 'Oh, I can't believe this is history. It's a party now.'",
        "'speaker_8': 'This new space has been a home run this past. As I mentioned, the port used as recently for the National Association of Ports, a convention here from Puerto Rico and talked to Mario Cordero. Mario pulled me aside. He said, Steve, I want you to meet this person.'",
        "'speaker_8': 'We we talked briefly. She was out of the 25 years I've been going to conventions, Long Beach is the best convention that I've ever attended for the National Association of Ports, and the closing party was in this space.'",
        "'speaker_8': 'In addition, the Terrace Theater Plaza is another space. We've added trusses under the lip of the plaza. We've also put trusses at the first level where the greenbelt is. The plan is to add two more trusses leading out to Ocean Boulevard, which will basically turn this plaza into a Rockefeller type center space.'",
        "'speaker_8': 'It'll be absolutely lit at night and brilliant. The mayor has been asking for a while for beautiful fountain display. And we'd like to share with you what we're doing. We like to thank council member Janine Pearce and also the mayor for their support on this and city management team for believing in it and the rest of the'",
        "'speaker_8': 'council for supporting it, because this will be our third turnkey special event space. I can't underscore how this is setting us apart from the competition. It's these types of spaces that's unique and different, and we're beginning to be recognized for our innovation.'",
        "'speaker_8': 'Everything you see here is the full functionality.'",
        "'speaker_2': 'You Venuto because of your piano. Who has done more to become yo yo yo this thing. Oh, a certain cool cool cool around called.'",
        "'speaker_9': 'A see sort of a son of Hollywood trophies won for. Go. Oh, man, you. Been burning for a long. Even. Some of. Comatose, you'd honor. Dan Brown.'",
        "'speaker_8': 'And we're even retaining him to sing at our opening. Thank you. In addition, we worked with the city and Eric Lopez in the team. There were seven RFP. This was the winning RFP. We thank city management for their support and belief in this suja early on.'",
        "'speaker_8': 'Jeanine currently and the mayor currently. This project is such a key project. Again, another TED inspired request. The owner of TED, the curator of Ted, said, Steve, we need the ability to get around the convention center quicker. And of course, the residents also enjoy the pedestrian walkways as well.'",
        "'speaker_8': 'With that, we, I think, have a beautiful, functioning piece of artwork that happens to be a bridge, and it easily connects the promenade to the Terrace Theater Plaza. So now we have a campus. We don't have disparate parts of our convention center anymore.'",
        "'speaker_8': 'And this is just a shot. It's not finished. And, of course, is a beautiful apartment complex going up behind it, but taking it a step further. There's 3000 LED lights inside this bridge. And so it is going to be a really cool space leading into and going all the way around the building.'",
        "'speaker_8': 'With that, it's been a phenomenal year. Believe it or not, we finally broke through with the New York press. New York is where most of the press resides. Successful meetings labeled us as basically one of the top 25 trailblazers in the U.S. We were the only city mentioned, the only convention center mentioned, the only CVB mentioned.'",
        "'speaker_8': 'No other cities were mentioned in this. And I think that's so great because we always are talking about innovation and we are an innovative city and people are recognizing the innovation here in Long Beach. In addition, Bill Bash also inducted us into the Hall of Fame this year back in May.'",
        "'speaker_8': 'Again, it was another great event. We were, again, the only city and the only facility that was actually recognized into this Hall of Fame. In addition, we would like to share with you what others are saying about our city and about our facility.'",
        "'speaker_6': 'In my 20 years being a meeting planner.'",
        "'speaker_1': 'I think the Long Beach CVB ranked number one in my mind. There's just nothing like it in the entire U.S..'",
        "'speaker_2': 'Long Beach Convention Center.'",
        "'speaker_3': 'Is one of those.'",
        "'speaker_0': 'Places.'",
        "'speaker_2': 'That makes me want to actually look.'",
        "'speaker_0': 'Forward to the meeting or.'",
        "'speaker_3': 'Event that I'm actually going.'",
        "'speaker_2': 'To. They built Long Beach Convention Center in a way that every time you go there, there's a different experience. They have activated spaces that you cannot believe. They've activated hallways to make them into one of the most premier event spaces that you'd ever find.'",
        "'speaker_2': 'Everyone is looking for that unique thing. That unique thing that doesn't cost a gazillion dollars to recreate, which is the most important thing at Long Beach, creates these venues that are just there and you just add your magic and your people to it and it works.'",
        "'speaker_10': 'In comparison, Benson centers the Long Beach Convention Center has spaces and allows you to be creative and innovative with your meeting. They're the most creative, innovative, forward thinking space I know. Turkey is especially important to planners. It makes it very simple to plan your events.'",
        "'speaker_10': 'You don't have to bring in different pieces because they're all bright.'",
        "'speaker_2': 'They're available for you.'",
        "'speaker_1': 'You know, just that personal touch, just adding things that are just unique and original and open to new ideas and new ways of doing things. And I think that really sums up the Long Beach experience.'",
        "'speaker_2': 'When you go.'",
        "'speaker_3': 'To Long.'",
        "'speaker_2': 'Beach, you feel the love. You feel like you want to come back.'",
        "'speaker_0': 'There on a regular basis.'",
        "'speaker_2': 'And it is your second home, if not your first home. The thing that makes them pioneers and trendsetters is really their leadership. It does come from the top down. What makes them different is they've always been very forward thinking and they've always been one of the early adopters of.'",
        "'speaker_2': 'Maybe technology or infrastructure development. They're always on the cutting edge and they're always looking for what's next.'",
        "'speaker_10': 'We would definitely come back to Long Beach because.'",
        "'speaker_1': 'We found the.'",
        "'speaker_10': 'Constant change at the.'",
        "'speaker_1': 'Center, the improvement of the facilities, the additions to great event space really feeds our need as we grow and we continue to look for space that's innovative and interesting for every topnotch. The service is wonderful and you don't always get that kind of service at a convention center.'",
        "'speaker_10': 'If the people are as friendly as they appear. But they are definitely very easy to work with. They are willing to be flexible and create spaces even in spaces that they have already set up.'",
        "'speaker_2': 'They are very much.'",
        "'speaker_10': 'Interested in helping you make the best product that you possibly can.'",
        "'speaker_1': 'They do whatever it takes to make that happen for you and you walk away feeling, I have a true partnership with Long Beach.'",
        "'speaker_10': 'It was really a true.'",
        "'speaker_2': 'Partnership.'",
        "'speaker_1': 'From start.'",
        "'speaker_10': 'To finish. You don't get a lot of destinations doing that. So kudos to Long Beach.'",
        "'speaker_2': 'Working with the crew is an amazing experience.'",
        "'speaker_3': 'It is so imaginative and innovative.'",
        "'speaker_2': 'I think there's probably the most innovative CVB in the country, not the world, really.'",
        "'speaker_8': 'As I mentioned, we've just finished three conventions. We finished International Movers Association. We finished the National Association of Port Authorities. We just had to which con which we just got word back today that it was their best convention ever.'",
        "'speaker_8': 'Both prior conventions have said the same thing. From the food at this at the convention center to the service at the center, to our hotels, to our city partners. The city has continued to just blow everyone away. This is a type of momentum that we're looking to build.'",
        "'speaker_8': 'And that coupled with service, that coupled with our infrastructure improvements that are innovative out of the box, nobody has them and they aren't a lot of money. That Cove project was basically a million and a half dollars, and it in terms of rebooking conventions, bringing new conventions and special events has will far outpace a million and a'",
        "'speaker_8': 'half, as we just saw, with the 54% increase in usage days at the arena. At this time, I'd like to also just highlight though, we have competition. Anaheim just added 200,000 square feet of space. That's a lot of space.'",
        "'speaker_8': 'They're saying that you from the second floor of there, 100,000 square feet. You can see the fireworks from the ballroom. Of course, we have true turnkey spaces, which I think are more creative. So it's our job to outsell that.'",
        "'speaker_8': 'But in addition, they have many new hotels opening up. Los Angeles just opened up an 800 room intercom. And that size is the problem is as you open these big boxes, if you don't have citywide conventions, they start looking for business that basically is in our ballpark.'",
        "'speaker_8': 'And so we start competing them with these folks. So again, service and our our creative spaces are key to us being and maintaining our success in pleasure and travel. We've also partnered with the Queen Mary and the Aquarium of the Pacific.'",
        "'speaker_8': 'We were in West Ways magazine in the summer and two of their issues were in sunset as well. And by partnering with them, we were able to take two pages instead of the Queen Mary on a top third page, the aquarium on the bottom right hand page, and Long Beach somewhere in between.'",
        "'speaker_8': 'We brought everyone together so we could own the real estate and come out with a huge message that it stops and you take a look. In addition, the 2 million circulation Sunset West Ways was 12 and a half million.'",
        "'speaker_8': 'But also our PR effort between Bob McDougal and Lauren Simpson and their team. We had some great home runs there, and I'd like Lauren Simpson to share what our PR team has done this past year.'",
        "'speaker_4': 'Thank you. So it's been an awesome year in terms of media hits for the CVB. We've had tons of publications, print stories on Long Beach throughout the nation, and we have ten still in the pipeline. I wanted to share a few of those placements with you tonight.'",
        "'speaker_4': 'Travelocity printed a story on Long Beach which garnered over 10 million an article. Impressions. Southwest Airlines In-flight Magazine published a story which garnered over 445,000 in print circulation. AM York, a daily newspaper in the city, published a story which had over 170,000 in circulation.'",
        "'speaker_4': 'Dallas Morning News. Their story garnered over 9 million online visitors and an L.A. parent magazine. That story garnered over 7000 in print circulation. We had additional stories in the bay area. Reporter Southwest. So successful meetings excuse me, sunset magazine, the oklahoman blade conveying San Diego family as well as Thrillist.'",
        "'speaker_4': 'Our overall media result. Excuse me, I ended up with a circulation of over 114 million and add equivalency of over $1,000,000. Overall impressions across print, broadcast and online resulted in over 100 million. We also hosted media visits for both groups as well as individuals.'",
        "'speaker_4': 'And as you know, as an industry, publications continue to downsize their staff. So a lot of editors are being let go and a lot of them are becoming just freelance writers, unfortunately. So for us to be able to have those people in our city is huge for us.'",
        "'speaker_4': 'Aside from that, once they're in destination, they tend to write additional stories as well. Recently we had two ladies and two editors from two major meetings publications and from New York flew them out and they experienced the Cove opening.'",
        "'speaker_4': 'They wrote three stories, and those stories went over, went out to over 200,000 and print circulation. We also had a writer come out who a freelancer for San Francisco Chronicle. Last summer we had her come out and experience pow wow.'",
        "'speaker_4': 'She had such an amazing time. The San Francisco Chronicle printed a story on our city which, as you can see, went over, went out to over 6 million. This year's power visit with just these four ladies alone garnered over 4 million impressions.'",
        "'speaker_4': 'These ladies were here for two and a half days, and in those two and a half days, we got 400 I'm sorry, 4 million impressions. We also got featured on the Instagram stories for Travel Channel. As Steve mentioned earlier, our PR efforts are solely based on relationship building and through those relationships we are able to get great'",
        "'speaker_4': 'opportunities. One opportunity being that with the Latina bloggers, the group came into our town and they were in need of someone to host 90 of their digital influencers. While because of our relationships as well as our proven ability to service.'",
        "'speaker_4': 'They chose us as a CVB. Their day alone garnered over 6 million in potential reach out of those 90 people. We had over 590 stories and social media posts written just on our city. Now, for the day, we decided to tour around our city.'",
        "'speaker_4': 'Of course, that included a Harbor Cruise Bay toward the Museum of Latin American Art. We lunched on the veranda at the Aquarium of the Pacific, and then they also went up in aerial tours of the city via helicopter.'",
        "'speaker_4': 'Now understanding we're unable to have 90 digital influencers in the sky at one time. We decided to have a little bit of a party, so we turned the hangar of the for the helicopter company into a party. And here's a glimpse of what that look like.'",
        "'speaker_4': 'Needless to say, we still receive emails to this day and social media posts related to the excursion that they had here in the city. Again, going back to those individual media trips that we hosted, there's one for Louis.'",
        "'speaker_4': 'If you look to the left, he's the one doing the back flip, as any mega YouTuber would do in a photo. I stopped this man for over a year. He's a huge digital influencer, huge YouTuber. He's got millions of followers across all channels.'",
        "'speaker_4': 'So, yes, I stopped him and finally was able to intercept him from Mexico as he headed to Fiji. Nonetheless, he decided to do a pitstop excuse me in Long Beach. Now, of course, he didn't travel alone. He decided to bring a few friends.'",
        "'speaker_4': 'And his friends just so happen to be mega digital influencers as well. So over 5 million people saw the group enjoying their time here in the city. And I wanted to share a day in Long Beach. Looked like for Louis.'",
        "'speaker_0': 'Good morning, guys. We're in Long Beach, California. To explore this amazing city.'",
        "'speaker_10': 'Florida will try to block it.'",
        "'speaker_2': 'Trip. I love California weather Schmidt.'",
        "'speaker_0': 'This is the.'",
        "'speaker_2': 'Most beautiful marina in the. I can't believe we got to play with penguins.'",
        "'speaker_0': 'That's like a dream situation right there. We're going out in a gondola. We're just going to catch the last light before the sun sets.'",
        "'speaker_4': 'Now for him to say those things about Long Beach is huge. I wish I could take credit for writing the script for, you know, everything that even my video. But it was purely based off of what he experienced.'",
        "'speaker_4': 'He had an amazing time. We got an itinerary, built that for him, worked with our member organizations, and he had a fantastic time. And now we have he was supposed to just do one Instagram post. He did, too.'",
        "'speaker_4': 'He also did a Twitter post and then he created three videos for him for us, one that was about 14 minutes long, which is unheard of as a CVB. We handle three, we manage three handles, one with a leisure focus, another with a meeting attendee and a meeting planner focus.'",
        "'speaker_4': 'And then finally, the convention center is handles across those handles. We've seen amazing growth ranging from 10% to 33% and following.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'I'm glad. I'm sorry. Increase in growth. Those handles we found serve as a guide for those who are visiting our city to, you know, for things to do, things to see as well as for meeting planners who are looking to host event in in Long Beach.'",
        "'speaker_4': 'They look to our convention center and meeting planner handles to see what kind of inspiration they can draw from the photos that we post for their next huge event. An example of that in a post that we did about the Pie Bar.'",
        "'speaker_4': 'Now our meetings handle data posts at a pie display from high bar writes beautiful photo. Well, it just so happened to be seen by a DC meeting planner. That meeting planner was so inspired that they immediately reached out to the pie bar and contracted with the pie bar to be at their event, their opening event, nonetheless, which'",
        "'speaker_4': 'occurred just two weeks ago here in the city. What I've shared with you are just a few examples, just a few of how we continue to feed the pipeline for media in digital and in print. Thanks so much for your time and thank you so very much for your partnership.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_8': 'In addition, we worked on the arts, the performing arts. We know any vibrant city, any vibrant downtown, these performing arts. And with that, this past year, we did a direct mail piece of 80,000 pieces which just went out.'",
        "'speaker_8': 'We worked with the Business Journal and it had, again, an insert on all the different activities, all the different concerts, all different plays. In addition with the Gazette, we did the same thing. Also POW Wow this past year had 20 murals throughout the city.'",
        "'speaker_8': 'Believe it or not, we're up to 50 murals citywide in three years. And POW Wow came to us three years ago by Julia Wang from Inner Trends and her team and also Ron Nelson at the Long Beach Museum of Art.'",
        "'speaker_8': 'And we can't thank them enough for bringing this concept in this group to us. It's been great in terms of of quite honestly, enhancing our city, but it's also been great in terms of public relations and also pleasure travel.'",
        "'speaker_8': 'A couple.'",
        "'speaker_2': 'Of weeks ago, I got a call.'",
        "'speaker_8': 'From Lillian Ferrell. Many of you remember Lori, and she was the finance director here in Long Beach. She's currently the assistant city manager in Huntington Beach. And Lillian said, Steve, we're working with Long Beach. We want to go after Amazon, but we want to make it sexy and we want to make it sizzle.'",
        "'speaker_8': 'So I said, Well, Lillian, there's there's one person that with only three weeks notice. That really, I think, could help do this and would be interested. And that would be Julia SWEIG. And so when I connected Lorene and Julia and short story Julia pro bono did the entire she and her team worked 24 seven for three weeks'",
        "'speaker_8': '. And the Long Beach team and the Huntington Beach team with John Keiser and Sergio and Lori and team, we all met and we pulled together a coffee table book, which was the RFP and then also a video we'd like to show you the video.'",
        "'speaker_8': 'I know Pat West is going to take this surfboard soon, so we have it on a very short leash. But the.'",
        "'speaker_2': 'Coffee table book of the RFP was.'",
        "'speaker_8': 'Delivered to Amazon, complete with a surfboard by the Huntington Beach staff. And we'd like to show you the video that we put together in three short weeks and Ed Trends, who quite honestly came up with most of these concepts.'",
        "'speaker_8': 'And we provided all the inlay and the details.'",
        "'speaker_2': 'What's dangerous is to. So here is the place. First, I need you.'",
        "'speaker_0': 'You're sure about this? Not the first place I think of for a job.'",
        "'speaker_2': 'Besides, every operation needs a long term view, and this is a hell of a view. Besides, who's better than one? Both cities get everything you need. You want to hustle? There's plenty of it. You want to relax? Lay low, eh?'",
        "'speaker_2': 'The beach is your backyard. If the job ever feels too big. There's people everywhere who've got your back. Need a clean getaway. They got three airports at your back. At the end of the day, I can't think of a better place than right here.'",
        "'speaker_2': 'It's a perfect stretch of coast to work hard, have fun and make history. Package delivered. This is going to be interesting.'",
        "'speaker_8': 'Inside business called this one of the seven most audacious plans. We were thrilled to have been selected for being audacious. And in addition I it our hope is that this will at least break through some of the clutter, if not just become Amazon's campus, to get some of their other real estate projects and some of their other'",
        "'speaker_8': 'business projects. Community partnerships. I.'",
        "'speaker_2': 'As a CVB.'",
        "'speaker_8': 'We realize that we're part of the community and it's very important to us to be involved in the community. We love what we do. We love the conventions that come in. We love the press that comes in. And we love to promote it.'",
        "'speaker_8': 'But we also love to help others who run nonprofits in the city and help them to be successful. We believe that if the city successful in all of its aspects. So all of us. And with that, I'd like to introduce John Thomas, our board chair.'",
        "'speaker_8': 'John.'",
        "'speaker_2': 'Good evening, counselor. Mr. Mayor. Wonderful to be up here to talk about our wonderful CVB and our community partnerships and our continual outreach program with our community partners as a as a de facto follow up to our community development, our cultural tourism outreach.'",
        "'speaker_2': 'We've identified community partners for the last several years, local community nonprofits such as the Center, our arts community or performing arts community. All these wonderful partnerships are strategic in that we get to sell Long Beach not only as a convention to town, but a cultural tourism town with our ranchos, our museums, our wonderful Queen Mary, our wonderful'",
        "'speaker_2': 'Aquarium of the Pacific. How to get the Queen Mary in there. Sorry. But it's just really, really wonderful asset. And as we look citywide, not just downtown, but as we look citywide, we have identified some wonderful strategic partnerships with the arts community, again with the center and others.'",
        "'speaker_2': 'So we have a short video for you to see. I believe it's the final one. So we're doing a video you out to take a look at this.'",
        "'speaker_1': 'And they have. Giving us such a great start here.'",
        "'speaker_6': 'We moved from the East Coast in the year 2000, joined the CDB in 2003, and it has been nonstop growth for us ever since.'",
        "'speaker_1': 'We have worked with a.'",
        "'speaker_6': 'Number of different convention and.'",
        "'speaker_1': 'Visitors bureaus. We actually belong to several others here in.'",
        "'speaker_6': 'The Midwest and Long Beach is by far the best. They are so integrated.'",
        "'speaker_1': 'Into the community, I think they are a fabric of what.'",
        "'speaker_6': 'Makes Long Beach. Long Beach.'",
        "'speaker_1': 'I don't know how many other cities really know and support their local community based organizations. And what I know is our local convention bureau really supports and knows their community based organization and really comes and sees how can we help you?'",
        "'speaker_1': 'How can we promote the work that you do? The CVB has taken a leadership role in positioning Long Beach as a destination for arts and culture, which is incredibly exciting and potentially transformative for our city. They are a major resource in our community.'",
        "'speaker_1': 'They are a major part of our economic redevelopment in town. And they are incredible colleagues and partners with all the different arts organizations in town.'",
        "'speaker_2': 'You know, I think that probably.'",
        "'speaker_1': 'We had the best.'",
        "'speaker_2': 'Community involvement.'",
        "'speaker_1': 'With our CVB than almost.'",
        "'speaker_10': 'Any city. What people also don't know about the Convention and.'",
        "'speaker_1': 'Visitors Bureau is that they.'",
        "'speaker_10': 'Also support the youth, but that's part of their community involvement and they've done that for many years without asking for us to broadcast that.'",
        "'speaker_1': 'They have.'",
        "'speaker_10': 'Pride and community because they invest in this.'",
        "'speaker_1': 'Community. So one of the most remarkable things that the CVB has done for us is rallied meal partnerships with the CVB members, and in year one, we had over 400.'",
        "'speaker_6': 'Commitments of meal providers for the families we serve here.'",
        "'speaker_11': 'They are the conduit of our culture and our character in our city. What I mean by that is that they're the first point of contact many times for visitors who are coming to our city. So they have to clearly understand not only the culture but the character of our city.'",
        "'speaker_11': 'What makes long language unique?'",
        "'speaker_2': 'Now the Convention Visitors Bureau of Long Beach thinks of the whole city as a whole. It's not just conventions. It's not just big business. They're promoting the city and everything that we have to offer.'",
        "'speaker_6': 'They have been influential in growing our city, growing our convention center and even areas beyond the downtown area into something that.'",
        "'speaker_1': 'People really will travel miles and.'",
        "'speaker_6': 'Miles across states to come and experience.'",
        "'speaker_10': 'Long Beach is a wonderful.'",
        "'speaker_1': 'Place for repeat business, and a lot of our clients are coming here year after year because of the innovation that has happened at the Convention Center. So each year they come, there's a new experience for them.'",
        "'speaker_11': 'When you engage our CVB, it's almost like you're going home. Even though you're in another state, you're so personable. It's like you never left home because they make you feel welcome at every stage.'",
        "'speaker_2': 'There's always this expression about Let a million flowers bloom, and it's okay if there's other folks doing similar things. But let's be the most brilliant flower. Let's be the one that really showcases what our city has to offer.'",
        "'speaker_2': 'Earlier, I was talking to somebody about the movie This The Spinal Tap, where they turned the volume up to 11. The CVB operates continuously at 11.'",
        "'speaker_1': 'But the CVB.'",
        "'speaker_2': 'In Long Beach.'",
        "'speaker_1': 'Is better than any in the United States.'",
        "'speaker_2': 'Pretty wonderful.'",
        "'speaker_3': 'Thank you, John. We're going to we have a couple of comments here as well. Sure. Steve, do you have anything else? No. Okay.'",
        "'speaker_2': 'I just. Mr. Mayor, if I might, I'm going to introduce two groups altogether. I'd like to thank the convention bureau board if they would like to rise. The wonderful staff of the CVB, our wonderful hotel partners, our restaurant, and our local nonprofit organizations that are here this evening.'",
        "'speaker_2': 'I want to thank all these folks for making the CVB a home run. I'm going to take every one of you as well. Thank you.'",
        "'speaker_3': 'Thank you very much. Thank you all very much. Okay. I mentioned this over to the council for for the hearing. This is part of the hearing, correct. Okay. So so let me let me let me go ahead and and and start actually, we have to do public comment is your public comment for this hearing.'",
        "'speaker_3': 'Cap.'",
        "'speaker_11': 'Yeah, I know.'",
        "'speaker_2': 'Yeah. Don't you ever.'",
        "'speaker_3': 'Do we have to go now?'",
        "'speaker_11': 'You go first. Ladies first. You go?'",
        "'speaker_10': 'Good evening. Hello. I love Long Beach and care for over 30 years and I've lived through all the redevelopment since the Navy has left. Now that we're an international city on a tourist map, please do not forget the residents that has held this community, especially in the downtown core, up for this duration and continued duration of redevelopment'",
        "'speaker_10': '. All the revenue coming in here. There's a lot of city work for the residential neighborhoods that has yet to be done. In all of this space of time and all of this new technology in 2017, we've got a lot of work to be done in our individual districts.'",
        "'speaker_10': 'So while tourists are coming here, cruises are coming here, it's it looks beautiful. There's still pockets in this beautiful area that continue to need work in each individual district and the residents that pay taxes and that uphold the local businesses in this community when the tourists are gone and they're not here and the conventions are not here'",
        "'speaker_10': '. They deserve to benefit from all of this beautification as well. Thank you.'",
        "'speaker_3': 'Thank you very much. See no other public comment, please. I need you to please be lined up.'",
        "'speaker_11': 'With ladies first. She goes first to.'",
        "'speaker_10': 'Show you start swarm group and associates. And as I sat and listened to all the accolades and the celebration and as I glanced around at all the people sitting in this room that were in support of the celebration, I wonder how much.'",
        "'speaker_10': 'How many of you. I'm sure you're cognizant of your homeless community because you have to see them every day, especially those of you who trek down here to city hall every day. What would the homeless say about that?'",
        "'speaker_10': 'What would they be happy for you? For us. The Scripture says that. The Lord listens to the prayers of those who are poor and homeless. What what will your homeless be saying to God tonight about all of this?'",
        "'speaker_10': 'And you're planning on more. How many of you are making sure that your council person. I'm meeting their requirement. To service those who are living outside of doors. There is no such thing as a homeless person. There are homes that have not found those people.'",
        "'speaker_10': 'And how long will you continue to come in here and celebrate yourselves? And you saluted that flag tonight again, one nation under God, indivisible. But what is God saying to you about those people that you are passing every day?'",
        "'speaker_10': 'I consider this a rebuke to you tonight. And he sent me to tell you again. What is God saying about this city tonight? I don't care how you're celebrating. What is he saying to you? And are you listening?'",
        "'speaker_10': 'Pastors. You only saying things to these people up here? They get more money in your pocket. Now you yourselves are not getting to giving to the homeless. When are you going to do your job? He has promised you seven years because you are a man or 70 years because you are a man or woman on the earth'",
        "'speaker_10': '. But as a pastor, as a prophet, as an evangelist, as a teacher, you are failing in your responsibility. And he will remove you. He will remove you because you are responsible. But these people not being able to do their job.'",
        "'speaker_10': 'Shaking your hands every January 25th on National Religion Day. That means nothing if you don't do your job. Nothing pass through as I help you in here tonight. Because this is your warning. And I'm standing in front of the house because in God's mind, there is no separation of church and state.'",
        "'speaker_3': 'None taken. Mr. Sardonic Speaker, please.'",
        "'speaker_2': 'Talk.'",
        "'speaker_3': 'Like Mr. Pete.'",
        "'speaker_11': 'Yes, sir. Okay. In Jesus name. And I need to have an image of him so you can know who he is, because, hey, that may be good for everything. I don't want them to lose any money. The business people.'",
        "'speaker_11': 'I love your hair. You make much money. But this cat right here, he went to visit Bloomberg. We talked. Okay, I have a few issues. Okay. First of all, my man said okay. He said some of my friends in Long Beach.'",
        "'speaker_11': 'What? Like we're trendy. Like what? The first in the California have drag queens. He's itty bitty kids. Did you play? You brought that back. I saw that dude was from Brooklyn. So when you went to you saw Bloomberg let it happen.'",
        "'speaker_11': 'So you brought that back? I say, so what? Teaching that to kids, man, said others. What others are saying. I tell you what others are saying. This is viral. They're saying you are here, damn mine. That's what they said.'",
        "'speaker_11': 'And I want to find out exactly what is it you or who was with you because hey, this one. Hey, this is a family issue. It's going be trouble on this. Hey, Democrats and Republicans is on this one.'",
        "'speaker_11': 'So we on this one already and the churches and all that, you ain't getting away with none of that if you want. Thank you. Mr. Know, you do.'",
        "'speaker_3': 'Have to speak to the item.'",
        "'speaker_11': 'This is the issue. The whole issue. I'm answering what they said. They were talking about how people feel.'",
        "'speaker_3': 'And you have to speak on the tourism improvement district.'",
        "'speaker_11': 'Shut me up.'",
        "'speaker_3': 'I'm just. I'm just letting you know. You have to speak to that. Continue.'",
        "'speaker_11': 'Anything you need to listen. I'm. I have some other ones. So this as far as drag queens. No drag queens in here. Hey, Mr..'",
        "'speaker_3': 'Pete, you have to speak on the business improvement.'",
        "'speaker_11': 'District, okay? The business improvement. Business improvement. Okay. I don't know fully what money going what's going, but he was talking about how people see us and you making people see us real bad. Now, the business won't be improve because there's a lot of these people that are Christians here.'",
        "'speaker_11': 'Yeah, they might be making money off of it, but hell, when it comes to visiting Long Beach, hell no. They don't want to tell the kid, okay, I'm going to get an Airbnb. And then they go, okay, kids, you can go to the library.'",
        "'speaker_11': 'Kids, come back. What happened, Mommy? It was a guy with horns. He scared me. He looks like the devil. Well, what the heck? And it would be your fault because you knew that was coming. Yeah, I didn't until I saw it.'",
        "'speaker_11': 'The thing went viral. You ain't saying nothing about it. You had nothing to do. I'm checking and will be on your ass. F for be on it for that.'",
        "'speaker_3': 'Please please say sir why you're holding a so let's not use negative words, please. Thank you.'",
        "'speaker_11': 'You ain't got nothing to do with this. I got this for your vampire ass. That's why.'",
        "'speaker_2': 'That's it. That's it.'",
        "'speaker_3': 'Because you're going to be removed for disturbing the meeting. If you keep disturbing the meeting, you will be removed. You're actually. I already shut you often. I can hear you anymore. So thank you. Not. Not the public. Not the rest of the public.'",
        "'speaker_3': 'So seeing it seeing, seeing any other no other public comment. We'll go back to the council. Thank you. And Mr. Petey, to serve the meeting one more time, reduce profanity. You will be removed from the meeting. Thank you very much.'",
        "'speaker_3': 'Okay. Thank you very much. So thank you. So now we're we're going to go ahead and go back to the council. This is America. And everyone gets a chance to give their opportunity, to give their comments and and have the freedom of speech.'",
        "'speaker_3': 'And so I appreciate everyone with their diverse viewpoints. Now, we're going to go back to the city council on this item. And let me let me just start just, of course, to Mr. Goodling and just everyone that came out.'",
        "'speaker_3': 'I just want to congratulate you guys again. I think, obviously, one of the amazing bright spots of of the city is the incredible drive that we have around tourism, the hotels, the restaurants, bringing the conventions. And I want to just thank everyone for their work.'",
        "'speaker_3': 'I particularly just want to mention I'm really I know, Steve, you've been hearing a lot from me about the fountains for a year or two, and I'm really glad that we got that project going. It's going to really be it's going to transform that space to an active space all, all year round.'",
        "'speaker_3': 'I can imagine, you know, Christmas music during the holidays and all sorts of different music, different times of the year. And it's going to be a really great special space. And so I just want to congratulate with you on that as well as the bridge and so many of the other of the great projects.'",
        "'speaker_3': 'So congrats to the team and everyone that's out here. I want to thank all of you for your for your very hard work, Councilmember Pearce.'",
        "'speaker_4': 'Yes. Thank you and thank you so much, Steve. Thank you, Charlie. Lauren, you guys have really rocked it and demonstrated, I think, that having a turnkey space really does change things. And when we look at some of the numbers and I think you said that we are in the last year kind of at flat occupancy, but we'",
        "'speaker_4': 'still had 4.7 revenue per available room. I think it demonstrates that we're able to start inching our way up a little more. And you know, funding the general fund is something that is really important, that has allowed us to spend dollars on things like tackling our homeless challenge that we have.'",
        "'speaker_4': 'And so that 13 million in total is definitely something that the city continues to count on and look forward to seeing that grow in the several years. And I want to thank those of you in the room that have participated in making sure that we're engaging with our homeless population down by our hotels are and I know'",
        "'speaker_4': 'that mental health America has tried to provide a training for folks to work in that area and I hope that we continue to do that as well. So definitely want to thank you guys for doing that work. A couple other things that I just wanted to to recognize is, you know, you not only do you go above'",
        "'speaker_4': 'and beyond, you make sure that with certain folks that come into the city that we're connecting them with myself or other people in the city structure. And, you know, like the A6 tournament that happened, that introduction allowed us to start making other introductions in the city that now we hopefully will have a youth sports scholarship that we'",
        "'speaker_4': 'don't currently have with national partners at the table. And so I really appreciate you guys always involving us in those discussions. I will say I've never been on a helicopter or taken a tour like that, so I need to live in the day of the life of a tourist in my city, I think.'",
        "'speaker_4': 'And then the other thing I would say that we need to do better. We need to get the kids on more of the the advertising for, you know, your little munchkins. Adorable. But thank you guys very much. There's not much more to say after that beautiful, awesome presentation.'",
        "'speaker_4': 'And just thank you guys for the work. And I look forward to partnering with community members and the CVB in new ways in the coming years. So thank you.'",
        "'speaker_3': 'Thank you, Councilman Gonzalez.'",
        "'speaker_6': 'Yes, thank you as well. And congrats on another successful year. I would like to say to all of you, Steve, Lauren, Charlie, the whole team communication is definitely the key and you all do a incredible job at and engaging us as city council elected officials and our staffs.'",
        "'speaker_6': 'I get emails from Steve quite often just giving us the rundown on how events went. It's a great talking point to give to our residents so they know what exactly is going on. And even when we engage with people outside of the city, it's fantastic to do that.'",
        "'speaker_6': 'Just like Twitch Con Lauren You do a fantastic job on social media. I would say it is just beautiful to see our city from a tourist lens. And often I tell people that you have to be a tourist in your own city sometimes because that's when you really get to appreciate it.'",
        "'speaker_6': 'So great work, everyone.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_0': 'After that presentation, I'm pretty sure some people are going to want to change their careers to social media. Influencer had no idea an influencer had perks like that. So obviously you guys come every year. We get a great presentation.'",
        "'speaker_0': 'This is the best. This is the best. I've seen these presentations for six, seven years. Lauren, I especially liked your part. I learned a lot, so I think I'm going to pick your brain. Steve John. I know Charlie's here somewhere.'",
        "'speaker_0': 'You guys have an amazing team. There was something I pulled out of that said. It's all about the service. Somebody said it's all about the service. And every experience that I've ever had with this CVB has been just something this memorable, great experience.'",
        "'speaker_0': 'And I got to tell you, we, you know, we had League of Cities in Naco. And, you know, as I sort of visit other elected officials, other cities, all people talk about is the great time they had in Long Beach and Legacies is coming back.'",
        "'speaker_0': 'And it's making that quick rotation because I had such a great time last time. So people so this is, you know, in our state, probably on the West Coast, this is the place people want to be. So whatever you doing, keep it up.'",
        "'speaker_0': 'You have my complete support and thanks for all that you do.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_12': 'Thank you. And thank you for the wonderful presentation. I sat here and took notes during the presentation on my comments, but the words were already used by so many of the the folks in the videos as well as the presenters.'",
        "'speaker_12': 'I just want to just chime in and say thank you for the great work that you do the the innovative approach, the aggressive approach to attracting new conferences and conventions and visitors here to the city of Long Beach.'",
        "'speaker_12': 'It truly does take a team effort. It takes a team effort all with the CVB and all of its staff, the city, the hotels, the employees and the community partners as a as a whole. It does take a team effort and we're all working together to a to market our city.'",
        "'speaker_12': 'I wanted to just just say great presentation with Lauren. Keep up the great work. I, too, learned a little something about social media and the the marketing that goes on with that and very good, well done. And, you know, two words come to mind and one person comes to mind, you know what?'",
        "'speaker_12': 'And I've never, never put those two words together to describe Steve Goodling, but sexy and silly only only you can get away with this. The I think the the CVB obviously is a great example of a high performing organization.'",
        "'speaker_12': 'It takes it takes a team to do that. And great job, great leadership, good work. Congratulations to the board and the staff. And we just think the Convention and Visitors Bureau for for being a motivating and positive force in our city.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_1': 'I want to thank you guys. I've been exposed to Lawrence Talent many, many, many years ago. And she doesn't just work on or downtown. She's citywide and a force to be reckoned with. I also want to say that I know that when Councilman Gonzalez and Councilmember Supernanny collaborated on the item related to Amazon, we could not have'",
        "'speaker_1': 'dreamed of a better package. And I'll tell you that a member of Amazon who works for them sent me a text message after watching the video and he said, It's so awesome. I sure hope that we pick you.'",
        "'speaker_1': 'It's not just the sunshine, but it's the people and you guys go all in every time. So I think that that says it best. I think that your impact was created exactly as you had hoped for. I think it's what we had hoped for.'",
        "'speaker_1': 'And I look forward to many, many more years of full convention and visitors bureau business. And I hope that every person here or watching at home will take the venture downtown to walk the pedestrian bridge because it's an investment that will really transform downtown.'",
        "'speaker_10': 'So make make the drive.'",
        "'speaker_1': 'If your company is having a convention in downtown, even if you live nearby, stay in one of our hotels, it'll be worth it.'",
        "'speaker_3': 'Thank you. Councilman Andrew says.'",
        "'speaker_2': 'Thank you, Mayor. This was not a night I plan on coming because the fact that most of you guys know this is Dodger night and day.'",
        "'speaker_10': 'And the power is out on the east side.'",
        "'speaker_2': 'I just really felt like I'm just not coming. But after I saw on the agenda that Steve and his group would be here. Steve, it's just you guys, you look around a lot of people I knew they would.'",
        "'speaker_2': 'I didn't think we'd have 11 people here tonight and I could just sneak right out. But someone came here to listen to something and I'm sure it was because of you guys program. So thank you guys. Again, you're doing a great job.'",
        "'speaker_2': 'And don't forget, Steve, please, like the young people are saying, you know, you all over the city of Long Beach, not just downtown. And I want to thank you for really working in my district. You guys, you're doing a great job and keep up the good work.'",
        "'speaker_2': 'I wholeheartedly support this motion. Job well done as you do every year. And I hope that you keep it coming. Keep it coming. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Now. Thank you. Great job, team. Great job. All the partners. And Steve, we ran that video in our weekly newsletter on Friday. And the number one question was, did you actually deliver with the drone? So if you didn't, don't tell me.'",
        "'speaker_0': 'We'll just keep that go. Thank you. Thank you. That concludes council comment. Members, please cast your vote.'",
        "'speaker_5': 'Motion carries.'"
    ],
    "Fifteenth Amendment to Agreement with Long Beach Area Convention and Visitors Bureau.": [
        "'speaker_3': 'Thank you. We're going to and we're going to the there's the item that's attached to this, I believe is item 15. So we'll take a vote on 15 as well if you want to read it in 15.'",
        "'speaker_5': 'Item 15 is report from City Manager Recommendation to execute the 15th Amendment to agreement with the Long Beach Area Convention and Visitors Bureau to extend for a one year period and to provide funding in the amount of four point million for fiscal year 2018 city.'",
        "'speaker_3': 'Thank you. There's a motion in a second. Mr. Goodling.'",
        "'speaker_8': 'I just want to say, Mayor. Council members, city management team. Thank you again for your support this year and thank you for your kind comments. And we really look forward to knocking out of the park yet another year.'",
        "'speaker_8': 'And this has been a wonderful year. And the we will stream for you the Dodger game.'",
        "'speaker_3': 'Okay. Thank you. I don't see any comments for this item. Please cast your votes. This is the attachment item for this.'",
        "'speaker_5': 'Motion carries.'",
        "'speaker_3': 'Okay. We're going to go back to our. Thank you very much. Back to our presentations. Okay. So I'm going to go ahead and we can just exit. We can go ahead and exit quietly for Councilman Gonzales. You're up.'"
    ],
    "Report from the International City Theatre for National Arts Month.": [
        "'speaker_3': 'And okay, we're going to go ahead and hear item 14, first item on the regular agenda, then we're going to public comment. Madam Clerk. 14.'",
        "'speaker_5': 'Item 14 is communication from Councilwoman Gonzalez. Councilmember Peers Recommendation to receive and file report from the International City Theater in recognition of National Arts Month.'",
        "'speaker_3': 'Councilwoman.'",
        "'speaker_6': 'Yes. So I'd like to say I'm so very excited. It's a very special evening because we have Karen Dhesi here, as well as many of our fellow many of my fellow board members. And it is a fantastic way to celebrate them through National Arts Month, which is October.'",
        "'speaker_6': 'In addition, if many of you did not know, they are actually our very own theater company. The ACT International City Theater has been a leader in the live theater world for over 30 years. In addition, this year they have not one, not only one, ten, 25 or 30 thereabout, almost 40 awards, basically envying theaters such as the'",
        "'speaker_6': 'Center Theater Group in L.A., the Geffen in L.A. and the South Coast Rep, among many others. And I'm so very proud to present them with a recognition today and also bring them up to say a few words I'd love to have carried up to the podium.'",
        "'speaker_6': 'We also have a presentation via video as well, and I hope we can get it right for you. So thank you so much.'",
        "'speaker_1': 'I'm Karen Deci, artistic director, producer of International City Theater. I want to thank Mayor Garcia and the Honorable Council as well for allowing me a couple of minutes to talk a little bit about these awards stage. Since L.A. recently announced their awards and I received almost 40 awards and one of the most important was named Best Larger'",
        "'speaker_1': 'Theater. And we were named we of South Coast Rep, the Geffen and the Center Theater Group in Los Angeles. As you can imagine, our budget is much smaller, but and we are the only company our size that was included for that award.'",
        "'speaker_1': 'And also last year, if you didn't know the L.A. Drama Critics Circle Award gave us outstanding season, and that's out of hundreds of theaters in L.A. and Orange County. Why is this important? Quality work enables us to attract extraordinary talent.'",
        "'speaker_1': 'I'm talking about actors with Broadway credits, television and film. Why is this important for Long Beach? I and other cultural organizations play an important role in the city's future development. Residents seeking an urban urban experience need things to do.'",
        "'speaker_1': 'I City is also an economic partner with the number of jobs we give annually more than 150 for artist, SMG employees and ancillary businesses, graphics, printing, etc.. We also serve our community with six education programs that's in every district, all nine districts from elementary school age to low income seniors.'",
        "'speaker_1': 'With 32 years in this community, we've created many ambassadors with artist workers and patrons continue commuting from L.A. and elsewhere and going back to their cities and talking about Long Beach. Now, I would like to share a short.'",
        "'speaker_1': 'Video. I hope that tells our story. Thank you very much.'",
        "'speaker_10': 'BCT is one of the best things we have in our city.'",
        "'speaker_2': 'I grew up in a in a community that really didn't have anything like that. And it wasn't introduced to me as a kid, and I wish it had to watch her see it for the first time. I can only imagine what it would have been like for me at her age, from music halls.'",
        "'speaker_7': 'To West Coast premieres to classic revivals. I can't think of a single production that I haven't enjoyed.'",
        "'speaker_2': 'I knew immediately what quality level was in these productions. Just from seeing the first one or two that I attended. They're always outstanding choice of material, of scripts, of directors, of casts.'",
        "'speaker_1': 'The kinds of shows that they have been putting on.'",
        "'speaker_2': 'Over the years.'",
        "'speaker_1': 'Build on the diversity in our community.'",
        "'speaker_7': 'The casts are amazing. They are full of some of the best talents.'",
        "'speaker_1': 'What I think is going through our communities is really changed our life.'",
        "'speaker_0': 'They have programs that go inside the community.'",
        "'speaker_2': 'Reach out, grab them.'",
        "'speaker_0': 'And expose them to.'",
        "'speaker_2': 'Go to the they.'",
        "'speaker_10': 'Go into the schools.'",
        "'speaker_1': 'They have special programs on Saturday free for families.'",
        "'speaker_13': 'At the end, you do like a 45 minute show, and it's really fun to actually go on the stage and show people what you've been doing for the last six weeks.'",
        "'speaker_1': 'The PACT program is a program where the ICG personnel come into my school and they teach a theater arts.'",
        "'speaker_6': 'Program in the classroom.'",
        "'speaker_7': 'It ranks right up there with passing a playhouse marked paper for the Gap. And it's one of our finest houses, and I think it's one of the undiscovered treasures of Los Angeles theater.'",
        "'speaker_2': 'I see. T is opportunity giving enhancement, having people engaged in theater, and you allow yourself to grow.'",
        "'speaker_13': 'With the community. I want to go back and see every show by.'",
        "'speaker_1': 'I also want to recognize my board members that are here tonight and my staff person as well and thank them for their patience and support and your support. Thank you.'",
        "'speaker_3': 'Thank you so much, Karen. Thank you very much. Give her a round of applause, an actor or so. We are so thankful to have you guys in our community. Councilman Gonzales also offers some additional remarks.'",
        "'speaker_6': 'Yes, I would just I do have a little recognition for you. It's not a little too big one because you deserve it. But I would also say that if you haven't if any of my colleagues have not been to the theater, please go.'",
        "'speaker_6': 'The issues are thought provoking, really fantastic actors, but the issues are also very timeless for for today's the day and what we're dealing with. So thank you so much again. And if you can all come up, we'd love to have a photo with you as well.'",
        "'speaker_2': 'We have a motion.'",
        "'speaker_3': 'Yeah, I'm going to get that first. So we need a motion in a second. First. Okay. Councilmember Pierce, to any comments?'",
        "'speaker_4': 'I do have some comments. I just want to say I want to echo what my colleagues said, which is you guys are a gem. You know, when I first got elected, you do the insane run around where you get to meet as many people as I never met before and fall in love with the city.'",
        "'speaker_4': 'And while I love the presentation that the CVB gave us, I fell in love with the city. When you and I sat down and talked about all the programs that you do, the outreach that you do, the community engagement and then coming to the theater.'",
        "'speaker_4': 'So I think I've been to three shows now and every one I'm just blown away, the intimate setting that's there. And I just feel like Long Beach is that city that, as they said, is an undercover gem still.'",
        "'speaker_4': 'And while we can do the lights and the shows and everything else, it really comes down to a thought provoking art. And so I'm really honored that my colleague asked me to be on this agenda item, and I look forward to getting other people to come with me to future shows.'",
        "'speaker_4': 'So thank you so very much. I really appreciate having you guys in the city and all you do.'",
        "'speaker_3': 'Thank you very much. Any public comment on the IKT presentation?'",
        "'speaker_14': 'Hi. My name is Emily. I live in West Side, Long Beach. And I do have to say that raising my two boys in Long Beach, we were able to go to the International City Theater free programs on the weekend.'",
        "'speaker_14': 'And I they were things that I could say to my boys, look at this picture. Do you want to go to this? You know, they trying to get them into the arts. And I was able to at least get them in the door.'",
        "'speaker_14': 'We were able to park and and it was like intimate venue. We were right up front. We did this for years and I have to do things that are free with my art, with getting my kids in the arts.'",
        "'speaker_14': 'It has to be free or we just can't go, including parking. And they did that for my kids for the last 20 years. So that's real access in the arts. Thank you.'",
        "'speaker_3': 'Thank you very much. See no other public comment. Please cast your votes.'",
        "'speaker_5': 'Motion carries.'",
        "'speaker_1': 'Of course. I was telling you.'",
        "'speaker_3': 'It was nice.'",
        "'speaker_1': 'Thank you. Okay.'",
        "'speaker_2': 'Close. Thank you so much.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_3': 'Okay. Just as an announcement. We are going to be adjourning the meeting later tonight in honor of Rick McCabe, who was a longtime city employee, as well as a member of the LGBTQ community and the former second District field deputy who passed away earlier this month.'",
        "'speaker_3': 'And there were some folks who wanted to honor him. I just want to make sure that people know that the we will be closing the meeting in memory of Rick McCabe, who had a lot of friends here at the city.'",
        "'speaker_3': 'And so that will be it at the end of the meeting.'",
        "'speaker_0': 'Okay. So we'll proceed with the city council meeting. Let's take up the consent calendar. We we took that out. Where are we now? Well, let's take a public comment.'"
    ],
    "Pilot Program of Workshops for Energy Efficient Mortgages and Related Fund Transfers.": [
        "'speaker_0': 'You have a good. So that concludes public comment. Well, we'll go ahead and move forward with I believe we have item number 16.'",
        "'speaker_5': 'Item 16 is a report from City Manager Recommendation to create and administer a pilot program of workshops to promote energy efficiency efficient mortgages among home buyers in Long Beach during calendar year 2018 citywide.'",
        "'speaker_0': 'Thank you, Mr. West.'",
        "'speaker_2': 'Mr. Vice Mayor, council members. This is an item that was brought to us to the city council a couple of months ago. We took it under our wing and worked with the the people who brought it to us.'",
        "'speaker_2': 'And Larry Rich is going to talk about how it can be implemented Larry.'",
        "'speaker_15': 'Thank you, Mr. West. Good evening, Mayor Richardson and members of the city council here to give you a quick overview of our proposed residential greenhouse gas reduction pilot program. You brought this to us back in May. And tonight, we're proposing a pilot program to educate homebuyers on their energy efficiency financing options during the 2018 calendar year.'",
        "'speaker_15': 'So what is an energy efficient mortgage or an ETM? Homebuyers or refinancing homeowners automatically qualify for 5 to 15% of their home value added to their mortgage loan to finance energy efficiency improvements. This 5 to 15% can also be used to purchase a home that is already energy efficient.'",
        "'speaker_15': 'This program has existed since 1980, but a lack of awareness and education has led OEM's to be vastly underutilized. The potential benefits of energy efficiency. Long Beach has an aging housing stock with 80% of owner occupied units built before 1970.'",
        "'speaker_15': 'Older buildings have large potential energy savings through upgrades. Upgrades provide an average of 25% savings on energy bills. Upgrades also create healthier indoor environments with cleaner air and better climate control. Upgrades can create economic dividends through job creation.'",
        "'speaker_15': 'And finally, greenhouse gases or goods are also reduced, helping to meet state and local greenhouse gas reduction goals. So the residential greenhouse gas reduction pilot program. So in partnership with local nonprofit Green Education Inc, we plan to provide a series of five workshops during the 2018 calendar year in locations spread throughout Long Beach.'",
        "'speaker_15': 'Workshops will cover energy efficient mortgages, other energy efficiency financing options, and rebates and grants that can be paired with financing. We will market workshops to local homebuyers and conduct in-person outreach to Long Beach. Employers will utilize prizes and giveaways to encourage attendance at the workshops, and we will follow up with workshop participants to evaluate program performance and'",
        "'speaker_15': 'energy savings. The financial impact. The budget for the pilot program is $40,000 and would be funded through the Gas and Oil Department's Cap and Trade GHG Reduction Fund. This budget will provide for a one year pilot program, including marketing campaigns and materials that are reproduced by city staff.'",
        "'speaker_15': 'Green Education Inc's services and conducting in-person outreach and teaching the five workshops. And finally, monitoring and evaluation of the pilot program. That concludes my presentation. I am happy to answer any questions.'",
        "'speaker_0': 'Thank you, as always.'",
        "'speaker_6': 'Yes. I want to thank you, Larry, for this work. I'm glad to see that we're moving in this direction. And I just have a couple of questions for you. How long do we expect the pilot program to be scheduled for?'",
        "'speaker_15': 'So we plan on rolling it out over the course the entire course of 2018. Right now, we're planning on doing a workshop every other month with a target start date in February and having the last one in October.'",
        "'speaker_6': 'Wonderful. And do we know when where those meetings will take place yet or have we gathered that information?'",
        "'speaker_15': 'We do have five potential venues spread across the city. The first one is potentially at the gas and Oil Department auditorium. But then we want to go to places like Chavez Community Center, something in West Palm Beach. We're also looking at Michelle Obama Library or as other park community center.'",
        "'speaker_15': 'And maybe I'm missing one, but that's the idea.'",
        "'speaker_6': 'Great. Well, thank you so much for the work. What you and your team do and sustainability is fantastic. And I appreciate you partnering with us and with green education. I'd really also like to thank them both, Marcia and Stella, because if it was for them, they, you know, this item would not be here.'",
        "'speaker_6': 'And you all have a vision for this type of program. This is exactly what I envisioned in this program. And I want to thank you for your work. You've been doing this for many, many years, and I appreciate that.'",
        "'speaker_6': 'And so we're a coastal city. We have to strive for even more initiatives in the sustainability. And I think this is definitely a step in the right direction. So thank you so much. I look forward to seeing the benefits from this after the workshops are done.'",
        "'speaker_0': 'Thank you, Councilmember Ganga.'",
        "'speaker_2': 'Thank you, Mayor. I also want to extend my congratulations on on the Green Inc. for putting this forward for us for the city. Just one question. Is there a benchmark in regards to how many households you want to reach within this pilot period?'",
        "'speaker_15': 'Well, we've estimated that there are 3000 home transactions in the city. Through our five workshops, we're hoping to get at least at least 30 participants each, which is over the course of the year, 150 direct participants in the workshops, ideally more.'",
        "'speaker_15': 'But hopefully through this process will reach a lot more home buyers that don't necessarily come to the workshops, but that the program will create a buzz.'",
        "'speaker_2': 'That sounds great. And I really would encourage people out there who are might be interested in and participate in this program to go ahead and reach out to the city and hopefully get their homes so more energy efficient.'",
        "'speaker_2': 'Thank you and thank you for your work.'",
        "'speaker_0': 'Thank you. Any public comment on item number 16? Seeing nonmembers, please cast your vote.'",
        "'speaker_5': 'Councilman Andrews.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_5': 'Weisman. Richardson. Motion carries.'",
        "'speaker_0': 'Thank you. Congratulations, Stella and everybody involved. Next, we'll have 17 items.'"
    ],
    "Staff Report on Equal Employment Opportunity Plan and Workforce Diversity Report.": [
        "'speaker_5': 'Motion carries.'",
        "'speaker_0': 'Thank you. Number 19, please.'",
        "'speaker_5': '19 is a report from Human Resources. Recommendation to receive and file a staff report on Equal Employment Opportunity Plan and 2017 Workforce, Gender, Age and Ethnic Diversity Report Citywide.'",
        "'speaker_0': 'Thank you, Councilman Braga.'",
        "'speaker_2': 'Yeah. I'd like to move that. We delay this report until the 14th.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Any public comment saying, members, please cast your vote. Oh, wait, we have one public comment to make.'",
        "'speaker_1': 'Yeah, just want to.'",
        "'speaker_11': 'Okay. This I don't I don't know a lot about it, but in the name of Jesus, I come. Robert Okay. But the thing. Let me turn this around.'",
        "'speaker_2': 'Okay.'",
        "'speaker_11': 'Okay. It says recommends that nation to receive. I mean to receive and file staff report on equal employment opportunity plan equal to equal opportunity employment plan. I don't see that out here. I don't I mean, but I hope it.'",
        "'speaker_0': 'Just just Mr. Pitt. And you won't lose your time. Okay. Does the only need speak to the motion to continue.'",
        "'speaker_2': 'The motion on the floor is just to continue the matter until November 14th so that we're not discussing the merits of this item.'",
        "'speaker_0': 'So you just.'",
        "'speaker_11': 'You speak to.'",
        "'speaker_2': 'The motion to comment on a motion would be whether you want to continue it.'",
        "'speaker_0': 'Or not to another date.'",
        "'speaker_11': 'Fair is fair. Well, can. Okay. Well, I'm happy. Can I say one thing?'",
        "'speaker_0': 'Go for it.'",
        "'speaker_11': 'Okay. And I said sure. 15. This didn't even ask a question. He said, Comment, boom, man. Why is he using black folks to get money for the city? I don't know what that's for. 15th Amendment. I know about that.'",
        "'speaker_11': 'We got our rights to vote and everything.'",
        "'speaker_0': 'I'm pretty sure that's not connected.'",
        "'speaker_11': 'So you know more about me. Ask later. Oh, thank you. I'll try. Maybe I'll make it, you know. But I want to be enlightened.'",
        "'speaker_0': 'Thank you for your time. Right. Members. Go ahead and cast your vote. Yes.'",
        "'speaker_5': 'Which increase.'",
        "'speaker_0': 'Thank you. That concludes the city council agenda. So now we have. I know. What can I say? So next we have a second public comment period for any, you know, any items on the agenda, please come forward. This is General.'"
    ]
}