{
    "Resolution on Environmental Impact Report Addendum for Midtown Specific Plan.": [
        "'speaker_4': 'Thank you. That concludes consent counter. We have two hearings, as you hear them. Item number 11.'",
        "'speaker_0': 'Report from Development Services recommendation to receive supporting documentation under the record. Conclude the public hearing. Adopt resolution approving and certifying the Environmental Impact Addendum. Declare ordinance approving a zone change on nine lots located at 2012245 West Pacific Coast Highway and 1827 Pacific Avenue.'",
        "'speaker_0': 'An An ordinance approving zoning code amendment to the Midtown specific plan read for the first time and lead over to the next regular meeting of the City Council for Final Reading District six.'",
        "'speaker_2': 'I'd like to think.'",
        "'speaker_4': 'So, but I'll let the. Here and go out and start stuff.'",
        "'speaker_2': 'Like to introduce Christopher Coons, the deputy development services director for this item.'",
        "'speaker_5': 'Good evening, Mr. Mayor, vice mayor and members of the council. This evening we're talking about an important housing project in the Sixth Council District. And it's also important because this is our first project brought forward pursuant to the land use element that was approved by the council back in 2019.'",
        "'speaker_5': 'So with that introduction, I'm going to hand it over to Patricia Defender, who is our planning bureau manager, and she will guide you through the presentation and take any questions.'",
        "'speaker_2': 'Good evening, Mayor and council members Patricia deepened over here. So this project, as Christopher noted, is a project located at 201 Pacific Coast Highway. I. The proposal is for a zone change and a zoning code amendment. This project was heard before the Planning Commission on November 5th of last year.'",
        "'speaker_2': 'At that time, the Planning Commission approved a site plan review for a new, new five storey buildings with 138 units, a mixed use project and a lot merger of nine lots into two separate lots. So at that time, they approved.'",
        "'speaker_2': 'They took those actions to approve the site plan review and the lot merger. And they also took an action to recommend that the city council approve a zone change, which I'm going to tell you more about, and also to approve zoning code amendments to expand the boundary of the Midtown specific plan.'",
        "'speaker_2': 'And that would be an expansion to one block west of the current boundary of Pacific Avenue. This is the site here in question at the corner of Pacific Coast Highway and Pacific. And you can see that the colored area on the map is the proposed extension zone change area and boundary extension area.'",
        "'speaker_2': 'This map here shows you the existing zoning. You can see from the map on the on the right that the zoning is a combination. The site currently consists of zoning. That is a combination of C, H.W. K and R2.'",
        "'speaker_2': 'And the first two zones are commercial zones that do not allow any residential use uses. And the second, the last of the zones that are two one is a low density residential zone. Important to note here, as Christopher mentioned, this is one of the first projects or the first project coming in using taking advantage of the newly'",
        "'speaker_2': 'adopted land use element. The proposed zone change would go from. Sorry. The proposed the general plan land use element identifies this area as what's called Tod Yellow, a transit oriented district low. This place type encourages mixed use projects that mix commercial industrial uses.'",
        "'speaker_2': 'It encourages a development pattern that's designed to foster a pedestrian friendly and invite environment and encourage transit use. And it also encourages transition so that larger scale developments transition and step down to smaller scale developments that may be existing.'",
        "'speaker_2': 'The current zone being that it does not allow mixed use and each of those those zones allow only single use are inconsistent with the toddler place type. And as a result, you know, this is one of the reasons why this zone change is an appropriate zone change for this property.'",
        "'speaker_2': 'The general plan land use element map additionally permits seven stories at this location as you can see on the on the map shown here. The subject location is identified also in the U.S. as a major area of change and as seen on the map and as shown on the inset map on the slide, and is described as'",
        "'speaker_2': 'an area where transit oriented development is anticipated, given its location on a major bus corridor and its proximity to the airline station at PCH and Long Beach Boulevard. This slide here shows photos of the existing condition at the subject location.'",
        "'speaker_2': 'The photos are looking north at the north side of PCH and west of Pacific Avenue. The subject locations and under-used site largely vacant or occupied by surface parking. It also contains a longstanding vacant building. The site has been a nuisance attractor and contributes to blighted conditions in the area as shown particularly on the bottom photo there.'",
        "'speaker_2': 'The fenced off vacant lot. This slide shows the location of the proposed zone change. So the zone change would be to the Midtown specific plan, transit node low. That is the zone and it is a mixed use zone that is consistent with the Todd Low general plan place type and would be extended west to the subject site'",
        "'speaker_2': '. To apply the zone. The Midtown specific plan would be extended to the subject site, as you can see here on the map. Consistent with the general plan. The table shows the consistency of the proposed specific plan, transit node, low zone with the Todd Allawi place type.'",
        "'speaker_2': 'So you can see the general plan identifies this area for mixed use at seven stories. The zone is a mixed use zone that allows five stories, and the project as proposed is a five story project. So this slide shows the general plan goals of the zone change helps to implement and is consistent with so it for there's'",
        "'speaker_2': 'a number of different general plan goals and accommodate strategic growth and change. It encourages degraded and abandoned buildings and properties to transition to more productive uses and it diversifies and the housing opportunities and provides new opportunities for housing that is located on corridors and near transit.'",
        "'speaker_2': 'Likewise, the zone that is proposed better aligns the zoning of the parcels with the goals of the top low place type. It facilitates the construction of mixed use development consisting of commercial and residential uses, and it facilitates construction of new housing consistent with state laws, including Senate Bill 330, the Housing Crisis Act of 2019.'",
        "'speaker_2': 'And finally, it facilitates the citywide rezoning efforts to bring the zoning into alignment with the new land use element. The city is currently undertaking a systematic geographic rezoning program citywide to bring consistency between the general plan and the zoning.'",
        "'speaker_2': 'And this request in the meantime, is consistent with that effort to rezone in a manner that that does implement the general plan. Just a quick note on, you know, state law, this particular in particular this bill. Senate Bill 330 was passed in recognition of the current housing prices.'",
        "'speaker_2': 'The proposed zone change facilitates construction of new housing units consistent with this bill, which gives substantial weight to the general plan and essentially says that when the general plan, the zoning differ, the city is required to apply the objective zoning standards that are consistent with the general plan.'",
        "'speaker_2': 'Just very quickly, I wanted to kind of run through some of the benefits of this project and what this project does. It increases housing. It increases opportunities for access to shopping and services it will replace, as proposed the current grocery store, which is located on the site.'",
        "'speaker_2': 'It creates an active pedestrian environment with ground floor commercial uses and an activity to pursue. It promotes walking, biking and the use of public transit and reducing number of vehicle trips, which is something that the general plan aims to do.'",
        "'speaker_2': 'It replaces underutilized surface parking with new commercial opportunities. It reduces building massing adjacent to low scale residential uses by stepping down in height. And it improves safety in the area by creating eyes on the street. The this as I noted previously, the planning commission did approve site plan review for this project that's contingent on this zone change'",
        "'speaker_2': 'in the zoning code amendment. Just wanted to show a rendering here of the project. This is the front facade or elevation of the project that would be facing Pacific Coast Highway. This is another rendering that shows how the building steps down to a existing low scale residential use that is directly to the north of the project.'",
        "'speaker_2': 'So you can see that the building steps down to a height of as low as 19 feet as it approaches the single that the single storey residential uses to the north. This slide just summarizes some of the public comments.'",
        "'speaker_2': 'There was a significant amount of public comments at the time of the commission and some of those issues related to height and compatibility of the project to the to the neighboring development. In terms of noticing or pardon me, an addendum to the Midtown specific planning.'",
        "'speaker_2': 'I r was prepared for this project in accordance with sequa and it was duly noticed in accordance with the municipal code requirements and notices were mailed to owners and tenants and site was posted in publication in the newspaper as required by the code.'",
        "'speaker_2': 'So in closing the City Council, the recommendation is that City Council from approve an addendum to the Midtown specific plan IIR. They did approve his own change from the existing zoning to the Midtown specific plan transit node lo district and approve a zone text amendment to the Midtown specific plan to reflect the expansion of the boundary to'",
        "'speaker_2': 'the subject area. With that, I'm happy to answer any questions that the Council and the Mayor might have. Thank you.'",
        "'speaker_4': 'Well, thank you for that. Let me first close out that part of the hearing. I don't believe there's any public comment for this hearing. Mr. Roberts. Oh, actually, I'm sorry. That's not true that you do have public comment on this hearing.'",
        "'speaker_4': 'So let me go ahead and have the court call the public comment and then we'll go back to Councilwoman Sorrell. So public comment, please.'",
        "'speaker_3': 'Mr. Mayor, this is Mike Brooks. Before we call public comment, just a reminder.'",
        "'speaker_2': 'We're going to need three separate votes.'",
        "'speaker_3': 'On this action. The first one is a resolution certifying the EIA and then a separate vote on each of the two orders and. Forward. Thank you.'",
        "'speaker_4': 'Well, we'll do that. Thank you. Madam Clerk, public comment.'",
        "'speaker_6': 'Our first speaker is John Dike's.'",
        "'speaker_3': 'Thank you, Mayor. City Council. I am the project manager for the project and we have been working on this for three years now and we're proud of the project presented to you. Architecturally, we think it's a significant move in that area and.'",
        "'speaker_3': 'We think it's going to make a big difference in helping the continued progress of that corridor, especially that Pacific PCH corridor. So those are the only comments I have. Other than we thank you for bringing this to council and we appreciate your support.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'Thank you. Our next speaker is Rebecca Davis. Rebecca Davis. Our next speaker is Todd Loomis.'",
        "'speaker_3': 'Hi, this is Todd Lemons from Pacific six, along with John Bendis. We also are pretty excited to get this corridor up and up and optimized. You probably know our company, Pacific Six, we are we're doing the Breakers Hotel and the Ocean Center Building where we re recently negotiated to be the developer on this project.'",
        "'speaker_3': 'We're a Long Beach developer and we're really eager to connect with the neighbors and members of the community. And since we just recently signed on, we really haven't had a chance to do that yet, but we certainly plan to and are very excited to do that.'",
        "'speaker_3': 'And as with all of our projects, we are certainly committed to build a great project and and we believe that the project will be a real asset to the community. Thanks very much.'",
        "'speaker_6': 'Thank you. Your next speaker is Rebecca Davis. Rebecca Davis. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you. And with that, I'm turn it over to Montoro.'",
        "'speaker_2': 'Thank you, Mayor. And I want to thank all of the residents and many people who care about the current market. That's right there. It's a high personal market. And I appreciate Mr. Lim is calling in as well to introduce himself as the new property owner.'",
        "'speaker_2': 'I just wanted to share that, you know, the owner wanted to make a public comment but wasn't able to do so. But I just wanted to make sure that I hear that those who that he's been serving the community during this pandemic, as you know, essential business has been providing groceries as almost kind of a little bit'",
        "'speaker_2': 'like a bodega in the neighborhood. Right. And so I know that he has expressed a lot of concern, as well as many who shops at his market, and that I want to make sure that he knows and many other knows that I'm committed to working with council members and danger as well, since we have, you know, residents'",
        "'speaker_2': 'that are just right neighbor that that are neighboring residents of this market and that we're committed to working together to ensure that we work with Mr. Specific six and anybody as well as residents to proceed in a way where we can continue to communicate about this development and this project as we proceed forward and just want to'",
        "'speaker_2': 'make sure that, you know. That it is. We have new owners that that's how I would like to proceed and appreciate all the comments and concern people have shared and looking forward to hearing the discussion and conversation with everybody.'",
        "'speaker_2': 'Thank you so much. And that I motion to I don't know if we have to have a motion for a hearing, but I do want to express that. I do want to support this project and that it's bringing housing and affordable housing into our neighborhood and meanwhile, wanting to address many of the other public comments, concern that'",
        "'speaker_2': 'was provided in the slideshow. Thank you so much.'",
        "'speaker_3': 'Well, thank.'",
        "'speaker_4': 'Thank you. That's a motion for the hearing to approve. Can I get a second on the motion, please? Set in by Councilwoman Allen. Any comments? Councilwoman Allen? Councilman Allen, any comments?'",
        "'speaker_7': 'I do not have any comment.'",
        "'speaker_4': 'Customers and day has.'",
        "'speaker_1': 'Think, Mayor, I just want to say how grateful I am to Councilmember Sorrell for her partnership and her willingness to to involve me and my residents in this project. I am super excited about this project going up. I think it's going to going to be fantastic for District six, but not only for District six, but for District'",
        "'speaker_1': 'one as well as we are the neighboring district and we share a lot of the things across PCH. So and I also want to thank all of the residents that have gotten involved in in this project and that have been concerned.'",
        "'speaker_1': 'I know that it has been a great concern for us to see the displacement of a wonderful grocery store that has been providing affordable food for our our residents, both in the sixth District and in the first District.'",
        "'speaker_1': 'And I want to thank Mr. Kell for all that he has done. You know, up until now, providing our residents with with not only great food, but also being a staple in the community and serving our first district residents as well.'",
        "'speaker_1': 'I'm very excited that Pacific Six has come on. I know that they have great partnerships with the community and I know it hasn't been like that in the past couple of months and that the community has felt that they were left out from participating in this in this exciting project.'",
        "'speaker_1': 'So I just want to say how encouraged I am by Bay and Pacific six coming into this project. I think that they're going to be fantastic and that our community is going to absolutely benefit from having them. I think that, you know, it's it's really hard for my residents and the residents of the sixth District to see'",
        "'speaker_1': 'our El Bassano market be this place. But I know that, you know, working with Councilmember Sorrell and working with Pacific Six, I'm hoping that we can provide some some good, good guidance and and maybe hopefully come up with another.'",
        "'speaker_1': 'I know that there's going to be an additional grocery store there. So I hope that it is tailored to our to our neighborhood. And I did have a question. When we send out notifications of projects, are those are those notifications also sent out in Spanish for the neighboring communities to understand what's going on?'",
        "'speaker_5': 'So Councilmember.'",
        "'speaker_3': 'Our.'",
        "'speaker_5': 'Notices typically include the bulk of a text is in English and then there is portions of the notices in other languages. And then on a case by case basis, we obviously have projects and locations where there's a lot more need for Spanish language.'",
        "'speaker_5': 'So when we have a meeting on those particular projects, we staff accordingly and have staff able to conduct that meeting in Spanish. When we do specialized outreach, we provide additional notification in Spanish, but the legal notice is provided in English with text at the end of the end of the notice that in Spanish and provides the option'",
        "'speaker_5': 'for the individual to request a translation. This is an area where the department, prior to COVID, was doing a lot of examination and looking to update our noticing and to to better multilingual our notices. That's a project that's on the shelf that as as COVID abates and we get back to staffing we can return to.'",
        "'speaker_5': 'So to answer your question, the notice is primarily done in English, but we do supplemental in situations.'",
        "'speaker_6': 'Where Spanish is helpful.'",
        "'speaker_1': 'Okay. And obviously it would, you know, in this area would be Spanish. And my so I thank you for that and for looking into that. And I thank you for for hopefully getting back to it. I think it's going to be important with other projects that may come along.'",
        "'speaker_1': 'And I know that there's a lot of development going on, so that's going to be very important moving forward. So I just want to say thank you to all of my residents that have been submitting comments and letting their their opinions be heard and also those that have continuously called my office and who have partnered also with'",
        "'speaker_1': 'with District six. And I think this is going to be a really good project for for the city, but especially for District six and District one. And I look forward to supporting this site. And thank you.'",
        "'speaker_4': 'Thank you, Councilwoman. I think that concludes when we check here the council comment. We have a motion in a second. Let's do a roll call.'",
        "'speaker_3': 'Vote, please.'",
        "'speaker_0': 'District one, i. District two.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District three. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five i. District six. District six. I District seven. I District eight. District nine. My motion carries.'",
        "'speaker_4': 'Great. Thank you very much. We are hearing item 12, please.'",
        "'speaker_0': 'We have two more votes for that item there.'",
        "'speaker_4': 'You're absolutely right. Let's take that second vote and then call the third one after.'"
    ],
    "Ordinance Repeal for Special Setback Requirements on Linden Avenue.": [
        "'speaker_4': 'Thank you. And now we'll move on to hearing what.'",
        "'speaker_0': 'Report from Development Services recommendation to receive supporting documentation under the record. Conclude the public hearing, find the project exempt from secure and declare the ordinance. Repealing Ordinance related to a special setback on the 5800 block of Linden Avenue.'",
        "'speaker_0': 'Read the first time lead over to the next regular meeting of City Council for Final Reading District nine.'",
        "'speaker_5': 'And we have a planning bureau manager, Patricia Defender for.'",
        "'speaker_2': 'Good evening again, Mayor and council members. So the item before you here is the repeal of an ordinance for that city to 15 foot special setback on this block of Linden Avenue, 5800 Linden Avenue. This is the location of on the map here.'",
        "'speaker_2': 'And the block is between South Street and 59th Street. Roughly the zoning in the vicinity is multi-family and neighborhood commercial. The development in the area is single family owned, multi-family uses and there's a vacant lot to the east.'",
        "'speaker_2': 'The special setback. This ordinance dates back to 1954. It was created. It was one of the tools the city used these setbacks to create the opportunity to widen streets. And it was intended to potentially widen the street by 15 feet on each side of Linden Avenue.'",
        "'speaker_2': 'It precedes some of the contemporary tools that we have to regulate building setbacks and to require public right of way dedications. So there are more effective mechanisms that exist today to implement street dedications and improvements. Some of those include the mobility element.'",
        "'speaker_2': 'Street designations. The current zoning code, which has set back requirements that are tied to the zoning and the subdivision MAP Act, are some examples of those tools that we now have in our toolkit. So the removal of this special setback would further implement the new zoning that this City Council approved back in November for North Long Beach'",
        "'speaker_2': '. The new zones do already have a way to regulate setbacks and do have a ten foot public realm requirement that would be applicable in this area. This particular the extent the geographic extent of this ordinance is very limited.'",
        "'speaker_2': 'And so it has, you know, limited utility to accomplish what it's trying to accomplish. And this ordinance also potentially conflicts with a development project that is in you know, that is in the works. So with that, the recommendation is to find that the proposed action be exempt, that the proposed action is exempt from the California Environmental Quality'",
        "'speaker_2': 'Act, and to repeal the special setback on the 5800 block of Linden Avenue. Happy to answer any questions that you might have in relation to this item.'",
        "'speaker_4': 'Thank you very much. I don't think any public comment. So is there a public comment?'",
        "'speaker_0': 'No public comment on this item there.'",
        "'speaker_4': 'Okay. Can I get a motion, please?'",
        "'speaker_3': 'But for me, I queued up to make a motion.'",
        "'speaker_4': 'I don't have it on here. Sorry. So I'll do a motion by Katherine Richardson. And a second by your Rango. Let's do a roll call vote, please.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District to.'",
        "'speaker_7': 'My.'",
        "'speaker_0': 'District three. District by district four, by district five by district six. District six. District seven. District eight.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine. District nine. High motion carries.'",
        "'speaker_4': 'Thank you very much. That concludes this item. So we're moving on from the two hearings. Let's do I think we have a short, open public comment period. So why don't we go ahead and do that, Madam Court.'",
        "'speaker_0': 'There's no one on the line for public comment.'"
    ],
    "Update on City Council Committees and Memberships.": [
        "'speaker_4': 'Okay. Then we will move on to the regular agenda. We do have a lot of items on the agenda, so I want to go and go through those. Let's begin with item 13.'",
        "'speaker_0': 'Communication from Mayor Garcia. Recommendation to receive and file a new list of City Council standing committees, authorities and memberships.'",
        "'speaker_4': 'Thank you very much. I want to go ahead and go through some of these committees really quick. And I just first want to just think, just the whole council. I know that just recently, of course, they approved kind of some consolidation that happened around committees.'",
        "'speaker_4': 'And I want to thank them for that. And I want to talk about our standing committees that we have put out forward here on the agenda. Let me just first say that we have condensed our standing committees now down to nine.'",
        "'speaker_4': 'That way, every single member is chairing a committee. Every single member is the vice chair of a committee. And then every single member is a member. So everyone has three committees. And then, of course, we still maintain all of the special committees and authorities that people are a part of.'",
        "'speaker_4': 'And of course, those range from the actor authority to the the the ICE Reference and Oversight Committee to the the Parking Authority. And we, of course, we have some of the memberships like we cities and the selection committee in California City.'",
        "'speaker_4': 'So all of those are part of it. But today's item is to approve all of it, but especially the focus on the new committees. I want to just highlight those. They think really there's a lot of thought that went into these new committees and the folks that are leading them.'",
        "'speaker_4': 'And I just wanted to briefly share some of that. I think it is important. I want to kind of redo standing committees. I want to first start with budget oversight. This is the one committee where we did not.'",
        "'speaker_4': 'Every committee, by the way, has new chair people. So we changed the whole system to just mix it up. I'm the only one that does not have a change is budget oversight. And that's because, of course, Councilman Austin, I was just appointed to that just last year.'",
        "'speaker_4': 'And so that's the one that retains the same chair. And that committee, of course, will be that is chaired by by the councilman. And we'll continue to do similar work as that has happened in the past. Then the next committee is our new Port Transportation and Infrastructure Committee, and that of course is being chaired by Councilwoman Price'",
        "'speaker_4': 'and that will include Councilwoman and House and Councilwoman Mango. And this committee, which I'm actually very excited about, is a combination of all the work that's happening at our ports, which of course is our biggest industry in the city.'",
        "'speaker_4': 'It's all of our transportation work. Which is everything from transit to goods movement to all of the kind of interconnectivity that we have across across the city, to the region and the country. And then, of course, infrastructure. And for for us, we're going to have an enormous infrastructure bill coming down the pipeline this year out of the'",
        "'speaker_4': 'White House. And so the building of that bill and how we can get as much possible back into the city is going to be really, really critical work, I believe, for this committee. And also what we talked about at State of the City, which is I'm really hoping this committee immediately takes up Measure eight and not just'",
        "'speaker_4': 'looks at how have we done with infrastructure across the city, but how are we going to spend these additional measure, $8 that are now in perpetuity for the city? So I think there's a lot of opportunities there. And I'm really grateful to Councilman Price, who I think is a kind of our leading voice and one of our'",
        "'speaker_4': 'leading voices around infrastructure for chairing this committee. Then we have economic development and finance, which is going to be chaired by Councilman Mongo and include Vice Mayor Richardson and Councilman Allen. This becomes also kind of job number one coming out of the COVID pandemic around economic relief and economic recovery.'",
        "'speaker_4': 'It's been, of course, Councilwoman Mango's kind of main issue as a member of this body is economic recovery. And so we're very excited about her chairing this as well. And I think a lot of our economic recovery efforts are going to come out of this committee, which is also very exciting.'",
        "'speaker_4': 'So I want to thank her for for taking on that challenge. Now we have our public safety committee, which will be chaired by by councilwoman sorrow. Again, I think that this is a moment we're all talking about about safety and we're talking about reform, and we're talking about how we create a just public safety system, more just'",
        "'speaker_4': 'public safety system. And I think that Councilman Sauro also brings the experience of having formerly chaired the PCC. We know that this committee will be looking at PCC possible ballot reforms and changes for that for the next election cycle.'",
        "'speaker_4': 'And so we think that is going to be a great conversation. And in this committee, not just around the traditional safety issues that need to be discussed, but also around the city. PCC So I want to thank Councilman Sauro for taking on that challenge, and I think he's well equipped to lead that conversation.'",
        "'speaker_4': 'The next two committees, I think, are pretty standard, but they're always important, and that's the Federal Legislation Committee and the State Legislation Committee. Those are being chaired on federal side by council member, by Baxley Richardson. And then we'll have Councilman Super now and Councilwoman Sara and for state legislation will be chaired by Canterbury Tauranga and vice chair'",
        "'speaker_4': 'will be Councilman Austin. And then we have Councilmember Richardson. We are living in a moment where we have an opportunity to bring down a lot of our support from the feds over the new administration to that committee will be critical to doing that work.'",
        "'speaker_4': 'And on the. And Vice Mayor Richardson also brings already some really great relationships there, especially with a lot of members that are now involved in committees and has work with the Congressional Black Caucus, which has been very active in over the last few years, is important.'",
        "'speaker_4': 'Also important is the why I think he's going to be a good chair is his work on Skaggs directly has a federal ledger link as president, and so I'm hoping that there's synergy there between those two so we can use both his work on Skaggs to help us at the federal level at the State Legislation Committee.'",
        "'speaker_4': 'We have come from Eureka, who again has really strong relationships in Sacramento. And so I'm looking forward to him chairing that committee and getting our state legislation approval through through all of our our committees in the state legislature on climate action, which is to get a new committee.'",
        "'speaker_4': 'We have Councilwoman Allen, then we have council member mango and council members. And there's probably no bigger issue that faces us in our future long term as as as climate change and climate action. I know Councilman Ellison very involved in that, and she talked a lot about that in her last campaign.'",
        "'speaker_4': 'And so there's a lot of work around the cap and a lot of work for us to do in the future there. So I look forward to that, to her leadership on that committee. We have the new Public Health and Housing Committee, which is a new committee and combined with the House, the former housing committee.'",
        "'speaker_4': 'Now, there's certainly probably no one better to chair that than councilwoman. Industry has been a strong advocate around housing and has really made that a kind of cornerstone of her work. I also want to congratulate and thank Councilwoman Sorrow and Councilmember Superhot for serving on that committee.'",
        "'speaker_4': 'And we also add the public health component, which we haven't had before on the council. And of course, having covered it as a as the key issue right now and all of our public health work, I think customers in their house will do a great job of leading the work on that committee.'",
        "'speaker_4': 'And finally, we have another great new committee, which is a combination of a different few others, and that's a new government and elections oversight committee, which will be chaired by council. A number supernova now included Councilwoman Allen and Councilmember Austin.'",
        "'speaker_4': 'Quite frankly, this is a very exciting new committee. It combines our personnel committee and it combines our elections, oversight work and really just government oversight. This is going to be the committee that internally looks at the systems and looks at our at our city, everything from who we're putting on commissions to how our elections are being run'",
        "'speaker_4': 'and to working with with some of our new commissions like the Ethics Commission, like redistricting. And there's so many other kind of internal kind of.'",
        "'speaker_3': 'Reforms.'",
        "'speaker_4': 'That the public has put in place that I think this we have we need to have this committee to be able to take an important but also oftentimes critical view of how we do things within the city. I've been customer super now we all respect is fair and balanced and I think you're going to do a great'",
        "'speaker_4': 'job chairing this. And so I'm really excited about kind of everyone's strengths and these committees. The last thing I'll say before we before we move on on this is that we are I'm hoping and it's not part of this motion, but something I've talked to a couple of members of is I'm really hoping and this might be'",
        "'speaker_4': 'an agenda item that comes forward at a later date, but that we establish some additional council rules around committees. And the reason why we are streamlining is, is because in an ideal scenario, we would have major issues that come in front of us, would first go to a committee or be forwarded to a committee to really vet'",
        "'speaker_4': 'it and to show that the folks on there have an opportunity and the public to really get into an item before it comes to the full council. And oftentimes I've heard from folks and I've noticed that an item will come on the supplemental or with a week's notice, and it's a major policy issue and has not been'",
        "'speaker_4': 'really vetted or discussed. I think I'm hopeful that the council can use this committee system to really vet items before they get to the full body. Of course, that's only going to be as successful as all of the council members want that to be.'",
        "'speaker_4': 'So we can't and unless we put a rule in place. But I'm really hoping that. We can bring something forward soon, that that strengthens these committees, encourages participation from the public at the committees. And then so when the item actually gets to the full body, it's been heard, it's been debated, there's a recommendation and we can move'",
        "'speaker_4': 'forward with a little.'",
        "'speaker_3': 'Bit more.'",
        "'speaker_4': 'Confidence that it's been well vetted. And by the way, this system is not new. This is most major cities across the country have have have structured committee systems. And I think we're at the point where we need to move a little bit closer in that direction.'",
        "'speaker_4': 'So I'm really hopeful that we can work on this over the next few months as these committees get going. So. So with that, let me first go. I do have 1/2. Thank you. I have a motion by Vice Mayor Richardson and seconded by Councilmember Austin.'",
        "'speaker_4': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I like the alignment of new committees. I think it plays to a lot of the strength of the members of the body. We have a difficult road ahead in terms of the recovery, and a lot of the committee work aligns with different aspects.'",
        "'speaker_3': 'We know Fed Ledge is going to be incredibly important in terms of federal relief. We know that economic recovery, the strategy for that is rolling out now. The committee adopted that, council adopted that. That's important. State led is going to play a key role in infrastructure.'",
        "'speaker_3': 'And I think each of the members really brings a really strong really brings a lot of dedication and focus. And I'd love to actually see these committees remain in place for some time so committee members can really deepen their relationships and their expertize on a subject matter and really have a command of these details.'",
        "'speaker_3': 'So I'm happy with this. I really like these nine committees, the approach where everyone's equitably easy to understand. Everyone gets one committee, one vice chairmanship and one chairmanship. And I think that that makes a lot of sense. So I'm happy to make this motion and support the recommendation of others.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I second the motion and I congratulate all of my colleagues for their committee appointments. Thank you for being thoughtful and making me the appointments. I look forward to serving as Chair of Budget Oversight and on the other committees that are that I've been asked to to participate on.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_4': 'Thank you, Councilman. Councilman, Mongo.'",
        "'speaker_3': 'Oh.'",
        "'speaker_2': 'Thank you. I echo the comments that you made, Mayor, about utilizing committees to really vet and go through the details of these types of agenda items. I hope that we can get to that point. I know that a lot of great work happens in these committees, and I would love to see some staff support in the way'",
        "'speaker_2': 'where Council on Price has been an example. When I served with her on public safety and how her staff have done real reporting out of what happened at committee, but I think that all committees could have that kind of support and staffing.'",
        "'speaker_2': 'And I know that each of us have had different roles and different responsibilities and different methods, but I think unifying how that happens is also important.'",
        "'speaker_4': 'Thank you. And I don't believe there is any public comment. Right, Madam Court?'",
        "'speaker_0': 'No, there's no public comment for this item.'",
        "'speaker_4': 'Thank you. In a roll call vote, please.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two by district three. I. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District six. I. District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District eight by district nine I. Motion carries.'",
        "'speaker_4': 'Thank you very much. We're going to continue on with the agenda. So let's go into M 20, please.'"
    ],
    "Extension and Execution of Project Labor Agreements with Los Angeles/Orange Counties Building and Construction Trades Council.": [
        "'speaker_0': 'Item 20 Report from Economic Development and Public Works. Recommendation to authorize City Manager to execute all documents necessary for the Second Amendment to project labor agreement and execute a new citywide project. Labor agreement for all covered projects over 750,000 and also street related right of way project over 1 million citywide.'",
        "'speaker_4': 'Thank you. Let's go and take it to the staff.'",
        "'speaker_6': 'Thank you, Mr. Mayor, members of the council. We're excited to be here tonight. We put a lot of good negotiation into a project labor agreement, and we're happy to bring this back after getting some good direction from the council in October and really working through a number of things to make our play even stronger.'",
        "'speaker_6': 'So I will turn that over to John Keisler and Nick Schulz for the presentation.'",
        "'speaker_5': 'Thank you, Tom. An honorable mayor and members of the city council. Happy to present to you the the details behind the new project labor agreement. So just as a quick background, back in 2015, the council authorized the original play.'",
        "'speaker_5': 'That agreement funded projects over 500,000. It ran for five years and it required certain things like the jobs coordinator for only projects over a certain amount that was extended by the city council last year so that we could negotiate a new agreement.'",
        "'speaker_5': 'As you also remember, on October 13th, we actually conducted a study session to get feedback from the city council and hear about the city council priorities. As you, as you recall, the independent jobs coordinator, new definitions for for our workers and who would be eligible for the program and new requirements for holding our contractors accountable for the'",
        "'speaker_5': 'program goals. Another important aspect that the Council highlighted was how can we use our project labor agreement to create good jobs for disadvantaged communities and include goals from our framework for racial reconciliation? I'm happy to report tonight that this new agreement really does hit on all those priorities and that the Council brought forward at the study session'",
        "'speaker_5': 'and really grateful for our partners at the trades, members of the community that have really provided a lot of input. And this really does establish a ten year agreement that prioritizes our residents, those that have the most challenges, and adds the independent jobs coordinator for all projects to support them in finding and keeping jobs.'",
        "'speaker_5': 'This new agreement also substantially adds more eligible projects. In fact, in the last play, we covered about $50 million worth of projects. This one will cover almost a quarter billion dollars over $260 million worth of projects that are projected by our public works department over the next five years.'",
        "'speaker_5': 'This also expands the definition of disadvantaged workers, adds the accountability that the council had prioritized. And to do this, we also increased the thresholds for projects so that we can cover the costs of these additional support programs, address some of the bidding issues we had encountered in the last play, and provide stability longer and bigger projects for'",
        "'speaker_5': 'our workers so that they have more continuity in their in their jobs. So just as a quick summary of the specific terms and conditions that the trades and and that our team, Nick Schultz hammered out, this is actually doubles the term from five years to ten years effective on the execution by both parties and covers all projects'",
        "'speaker_5': 'over $750,000 for street related or right of way projects over $1,000,000. And what we'll be doing is we'll be coming back after five years when we get our new project list to talk with the trades about a cost escalation factor based on year six and through ten.'",
        "'speaker_5': 'This also the trades have agreed to place referrals from the city in their apprenticeship program. They've also agreed to prioritize local workers on local jobs no matter where they were on the priority hiring list. And it requires the independent jobs coordinator to support all projects no matter their size.'",
        "'speaker_5': 'Union membership is not required for our residents and workers to participate in the play. And disadvantage workers now have a range of of different categories, including veteran chronic employment, homeless, single parent, criminal record, all of the same categories that the Metro play requires up in Los Angeles.'",
        "'speaker_5': 'Also, we're expanding our reporting to record disadvantaged work hours by city and tier so that we can better identify if local workers are benefiting from the program. And we're implementing a program on our side to hold our contractors accountable for these hiring goals that the Council has set.'",
        "'speaker_5': 'In terms of cost, this really will cover 40 to 50 projects over this next five year period. I have to call out Eric Lopez, our public works director, who has been really working closely, closely with us in really being an advocate for how we can make expand the number of projects in total budget.'",
        "'speaker_5': 'Those 40, 50 to 50 projects over the next five years are projected to be $266 million. That's a five times increase from our last. And we anticipate for the new programs that we talked about around independent jobs, coordination and reporting that it will be about 1% to 2% of the total project cost depending on the size of'",
        "'speaker_5': 'the project. That is a total of roughly 2.6 million to 5.3 million over the five year period for the total package. There's only one thing that I have to add to this presentation, which is an A. The recommendations should be approved as written except for the following amendment.'",
        "'speaker_5': 'And I have this up on the screen. It's in the the second recommendation that the language should read beginning after five years from the effective date of this agreement, the parties shall meet and discuss potential changes to these thresholds with any agreement reached to be put in writing and signed by the City and Building Trades Council.'",
        "'speaker_5': 'So with that, I will end my report and I'm happy with here with Nick Schulz, who really was at the forefront of negotiating this agreement to answer any questions you might have. Thank you so much.'",
        "'speaker_4': 'Thank you. Mr. Murdoch, did you have any additional comments?'",
        "'speaker_6': 'Just that I am really happy with the work that was done. I think we've seen a lot of great projects getting done through our project labor agreement over the past five years. We've employed a lot of people. We've reported on all of that progress and the last time that we did this and we're going to keep tracking'",
        "'speaker_6': 'it and looking about prioritizing jobs going forward. This also is part of our reconciliation work. As the council passed, the reconciliation plan was to really look at how do we do additional jobs, especially in areas that haven't had access to jobs.'",
        "'speaker_6': 'And that's what the jobs coordinator is going to do. So with that, we're turn it back to the council for questions.'",
        "'speaker_4': 'Well, thank you. I'm going to make a few comment and then turn it over to Councilmember Ringa who made the motion. Let me let me just begin broadly by saying that I'm really proud that Long Beach has really led the way in the creation of its original city wide project labor agreement.'",
        "'speaker_4': 'It was not it was done, obviously, with a lot of pain that went into it getting there. And I remember first being on the council when we were having these discussions and the resistance that we ran into as council members and certainly even even some resistance are when all of us came off this body together, a lot'",
        "'speaker_4': 'of folks that were still learning about what these project labor agreements were really all about from the community. But we got it done and we signed really one of the most substantial city wide agreements in the state of the agreement.'",
        "'speaker_4': 'It was a partnership with our construction trades, with all of our building trades that do such amazing work across our city, who build our city every single day. And I want to just thank each and every one of them, especially Ron Miller, who has carried who's been our go to leader on that end, but really all the'",
        "'speaker_4': 'heads of all the trades and the members. And I just want to also note that our work on this place and of course, the work that's happening now as we extend our wasn't just about what happened here in Long Beach, but we took this energy and began to work then with the port to ensure that they had'",
        "'speaker_4': 'a play. And then pretty soon Long Beach City College moved forward and they put a project labor agreement in place. And then recently the school district moved forward and put their project labor agreement in place. So we we made this not just about our public projects, our large infrastructure projects.'",
        "'speaker_4': 'We created a system where all project public projects across the city, across jurisdiction, would be ensured to have these level of good jobs. And we know that these projects come in and they come in in great shape. They're done by skilled labor.'",
        "'speaker_4': 'There's community benefits. There's apprenticeship programs. And they're done with the quality that we expect and within the budget parameters that we put in place. And so it's been it's been a home run for us, really proud to be here again for this extension.'",
        "'speaker_4': 'And I want to thank all the members that have been so supportive of our project labor agreement work. And so with that, we have a motion and first step is councilmember uranium.'",
        "'speaker_3': 'Thank you, Mayor. And if you can please put up a Slide seven. Think it's the one that I will be referring to. I want to agree totally with everything that the mayor said when I was on the committee, college board trustees.'",
        "'speaker_3': 'There was an effort also to create a play when I was on that board and there was resistance as well as during the time that Councilmember Ranga was on the city council to try to bring this forward. And there was also resistance in those days.'",
        "'speaker_3': 'So this is a major threshold that we're crossing at this point. You can put up Slide seven that. Anyway, the the whole issue is that it is community based. We are still doing a remarkable job of working with our community, our affiliates with Ron Miller and the construction and trades with all the other unions.'",
        "'speaker_3': 'And we're also dealing with this long before the legal foundation, I'll tell you, the teachers Liberal Lobbyist Mediation Project and many other community groups and leaders who also put a lot of work into this project. The most important parts of the project, obviously, I guess I'm able to fly there, is that it provides the Metro's definition of'",
        "'speaker_3': 'a disadvantage worker, and it also includes in their the city's ability to not only track these disadvantaged workers, but also find out where the cities are, what period you're in. And also, I think the most important part of it is that it holds our contractors accountable for local, for meeting local, and it's valid, charitable.'",
        "'speaker_3': 'I think that's one of the most important aspects of this project labor agreement. And as mayor said, it also provides a guarantee that the work that gets done in the city, in Long Beach and that well is done with codes and that with the the knowledge that there are going to be fair wages and living wages for'",
        "'speaker_3': 'workers in this project. So I'm very happy and pleased toward this motion forward. And we appreciate the unanimous endorsement supported by council. Thank you.'",
        "'speaker_4': 'Thank you, Councilmember. Next up is Councilwoman Cindy.'",
        "'speaker_1': 'Thank you, Mayor. I just want to.'",
        "'speaker_2': 'Give.'",
        "'speaker_1': 'A huge congratulations to city staff to council member Rhode Island for all the hard work throughout the year that has been done in advocating for our local construction trade jobs. I know it's been really great to be able to see, you know, this this presentation and see how much work has been put into it.'",
        "'speaker_1': 'I'm really excited because this this agreement actually brings so many good paying jobs to so many residents in need, especially right now. We're going to need so much of this. So I am looking forward to supporting this item.'",
        "'speaker_1': 'And again, congratulations on this.'",
        "'speaker_4': 'Thank you. Council member Austin.'",
        "'speaker_3': 'Thank you. Obviously, this item has my full support. I want to congratulate and just salute staff for negotiating a great agreement with the the building trades and the interest. I love the fact that many of the points raised by the community over the years, as we have learned over the last five years with the play of how'",
        "'speaker_3': 'to tweak it, our, our, our, our recommendations to to look at the Metro agreement, it looks like we're we're fully implement kit and agreed upon in this this agreement and that I think will help with equity but but ensure that that a as a member already mentioned that we have quality labor peace and quality projects in our'",
        "'speaker_3': 'city expands it to many other public works jobs that that we currently do now which I think is good. Local hiring is is extremely, extremely important. And I just want to just mention how far we've come. You know, over the last five years, I can remember, you know, the very first meeting when Patrick O'Donnell was the original'",
        "'speaker_3': 'author to to move the project labor agreement forward. I was a coauthor on that had matriculated it brought came back with you know Gonzales so much work and effort has come in over the years but it did start off very rocky and with a lot of uncertainty and uneasiness.'",
        "'speaker_3': 'And today I think we it's a 180 degrees. The relationship with the building trades over the last five years and the results that the original play has produced are commendable and something that we can build upon. And so I'm looking forward to supporting this item and putting people to work over the next several years.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you. Council member I'm sorry. Vice Mayor Richardson is next.'",
        "'speaker_3': 'Thank you, Mr. Mayor. This is certainly a monumental, monumental achievement for a Long Beach. The last play represented about $2 billion in work. This new play tonight represents more than $260 million more significantly. That's five times the impact on this honest play.'",
        "'speaker_3': 'It's five times the opportunity. Most of the jobs are coming to our local community, and that's largely by expanding to include street projects. And my colleagues are right. This has been refined. I want to lift up Councilmember Turanga, who's really been a voice and advocate for this since his time at LBC.'",
        "'speaker_3': 'Standing up for, you know, construction, local training and jobs. So I think it's appropriate that, you know, that he made this motion tonight. And I know he's got a tremendous like going to try to do it. I remember when I was a chief of staff, Steve Meal Break Appalachian Gerry ships Detroit.'",
        "'speaker_3': 'It's been a long history and it wasn't really until I think 2014 when all of us joined the city council that the support, the votes were there to really make this happen. I'm glad to see that the four high level community needs have been addressed in here.'",
        "'speaker_3': 'Shout out to the Long Beach local hire coalition and Long Beach Ministers Alliance. They fought for eight years to get this right. These these recommendations were not new. They advocated for these. When we began begin this conversation. They were advocating for these these these four measures.'",
        "'speaker_3': 'And it's great to see that it's been negotiated. Thank you to the L.A. Building Trades Council and city staff for making sure that these provisions are there. I also want to acknowledge the work of the Long Beach Racial Group Racial Equity and Reconciliation Initiative, specifically calling out the opportunity to ensure that the construction workforce reflects our local'",
        "'speaker_3': 'community. That's important. So the four pieces, the independent jobs coordinator, I'm glad to see this. They're utilizing strategies from the equity toolkit that's important to ensure that black workers, brown workers from our local communities of color can work on these projects.'",
        "'speaker_3': 'I'm glad to see the definition of disadvantaged work targeting the most to need. You know, I've said it before, we have a k-shaped recovery disadvantage, workers taking a lot longer to recover. So we have to align all of our strategies, including the play with that effort on reporting disadvantage, work hours.'",
        "'speaker_3': 'Incredibly important. Talked about this and glad to see that in there. And I love that we have a process to move the metro, hold contractors accountable. That's the view of all these things together has brought brought us to this point.'",
        "'speaker_3': 'So this is a big moment for the community. It's a big moment for jobs, the big moment for labor. It's a big moment, moment for language. And it's all about the recovery. So so thanks a lot. And I'm happy to support this motion.'",
        "'speaker_4': 'Thank you, Councilwoman Allen. Councilwoman Allen.'",
        "'speaker_7': 'Not going too well. Sorry about that. Yes, I'm sorry about that. I was still on mute. Yes. Thank you, Mayor. And I'm just really excited that we're at a good point and that everyone is happy. And I know that it always hasn't been this way in the past, but so much good work has been put into this'",
        "'speaker_7': '. And I have heard from several of our partners and this is a good package. Local hires. Goals are being met and the play has mechanisms to ensure a good faith effort by contractors, which is good. It encourages hiring of disadvantaged workers and implements independent job coordinator and also covers our street and gas line projects that weren't covered'",
        "'speaker_7': 'in the past. But most importantly, like my colleagues have already talked about, it establishes a ten year agreement that prioritizes Long Beach residents on the hiring list. And this is important for our community in a time where, you know, we need these jobs.'",
        "'speaker_7': 'So I do want to thank John Keiser and Nick Schultz and Eric Lopez for their work on this play and for all of our partners and trade. And I also want to acknowledge my colleague, Councilman Roberto Ranga, for his history and advocating for our local construction trades since his time on the council.'",
        "'speaker_7': 'So great work, everyone, and I'm excited to pass this tonight.'",
        "'speaker_4': 'Thank you, Councilman Allen. Councilwoman Pryce.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Can you hear me okay?'",
        "'speaker_4': 'Yes. No problem.'",
        "'speaker_2': 'Okay. Thank you very much. I do want to acknowledge the great work of staff of getting us to this point. And I know that during the conversations tonight, we've talked a lot about, you know, initial resistance to this.'",
        "'speaker_2': 'And I'm not sure exactly what specific conduct or words folks are recalling, but I do. Just like Councilman Austin, I do remember when this item came forth, I believe we were having our meeting offsite at the Highland Park Community Center when we first discussed this topic.'",
        "'speaker_2': 'And I think, you know, I was one of the council members that really was concerned about the additional cost of the project, because that was a community concern that would city projects now take on an additional cost. So I don't know that I would necessarily call that resistance, but I was really grateful at the time because the'",
        "'speaker_2': 'makers of the motion did accept some of the friendlies that I made that resulted in us having more transparency and regular reporting than we would normally have on citywide projects, which allowed us to be able to demonstrate to the constituents the best use of the public funds that we were using for these projects, which of course, is'",
        "'speaker_2': 'is the number one concern for all of us with the fiduciary duty to to make sure that we're getting the best price for projects. One thing that I have learned over the years is as several of the projects in my district and along the coastline have been completed with the play, they've been tremendously successful projects.'",
        "'speaker_2': 'And while there may be an additional cost associated with the terms of a play, that cost is is far outweighed by the benefits of utilizing a play. What I have been able to determine and speak of as fact from my own personal opinion as a result of some of the report back requirements that were part of the'",
        "'speaker_2': 'friendly amendment that we adopted five years ago, actually seven years ago, was that six years ago, on balance, the additional costs of the yielded in projects that are consistent in terms of the work quality and the quality of the final product, the efficiencies that have been identified as a result of working of the play, our efficiencies that'",
        "'speaker_2': 'we would not have without a play. And I think overall having some consistency and also at the same time putting quality Long Beach and regional workers on our city projects has far outweighed any additional costs that would come with the projects.'",
        "'speaker_2': 'And in my experience, the projects that I've been involved in have all come in under budget. So I feel very confident. I'm grateful that we had a robust dialog that was critical of some of the the concerns because we were able to demonstrate through the data that the play is actually a beneficial opportunity for the city in'",
        "'speaker_2': 'terms of executing city wide projects. And I'm grateful for John Keisler and Nick Schulz for putting the work that they put into place tonight, but also in the consistent reporting that was adopted as part of this provision in 2015.'",
        "'speaker_2': 'So I fully support this project and I look forward to having more city wide projects that can be completed through a play. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'Thank you. I want to thank so many members of our community who have continued to stand up for the community needs. I remember the dialog as well and at the time I was really modeling my goals after the Metro contract.'",
        "'speaker_2': 'It was the only conference that I was pretty familiar with and in meeting with elected officials that had passed a play and they really felt it was the gold standard. And here we are today. I'm able to mirror some of those things today, so I want to appreciate Labor for their work over the last five years.'",
        "'speaker_2': 'They've done excellent projects that I don't think would have been possible without the coordinated collaboration between our staff, the unions and the bid winners. And then I also want to thank our city staff. It has not been an easy path.'",
        "'speaker_2': 'It is a lot of additional work and we know that you're taking it on and taking it very seriously has led to amazing community impacts for individuals who might not otherwise have a job. And when you talk to someone who has had an opportunity because of the building trades and the confidence they have and how you can'",
        "'speaker_2': 'hear in their voice that their life has changed, you can tell that these agreements are really more than just jobs. They're really life. They're life for a family. They're breadwinners, they're community members that are able to have a living wage and also feel competent about how they can be a productive member of the community by contributing to'",
        "'speaker_2': 'their family. And so I just want to thank everyone who's worked with me over the past several years. I had a lot to learn about plays, and I think that now as a member of a council that's really I'm leading with with partnership, I'm really proud to be here.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman. Next up is Councilman Ringo.'",
        "'speaker_2': 'Thank you very much. I haven't had a chance to speak yet. I don't know if you're kind of going back.'",
        "'speaker_4': 'Yeah, I have your next. Sorry about that. Let me, let me. Let me. Let me, actually. What am I going to cancel in sorrow. And then I'll go to Castleman sorrow.'",
        "'speaker_2': 'Thank you. Sorry about that. I thought. Councilmember, you and I have spoken already, but I just want to make sure that to thank everyone who has been involved to getting it to this version, I know that it's taken a lot of conversations and work.'",
        "'speaker_2': 'And so I think John Kaiser Mitchell and Eric Lopez and their staff are getting it working so hard. And also our community organizers and advocates who have also made sure that we got all these different pieces together particularly.'",
        "'speaker_2': 'So just making sure I know that it's going to help, you know, contribute to increasing equity in my district. And I especially think it's a bit important that we incorporate the Metro's play definition of disadvantage workers and getting independent jobs coordinator.'",
        "'speaker_2': 'And it's going to be so crucial to ensuring that we get people in my district back to work and improving the livelihoods in their family as well. And also, I just want to echo to what Councilwoman Allen shared about again, referring back to Councilmember Urunga, as, you know, making this motion and his leadership and not only having'",
        "'speaker_2': 'his expertize around plays and labor and workforce development to the council, but also at bringing it from his past work as a LPC trustee. So I'm very supportive of this item and happy to support it. Thank you.'",
        "'speaker_4': 'Thank you. And now Councilmember Ringo.'",
        "'speaker_3': 'Thank you, Mayor. And I want to express my gratitude to all my colleagues for their very positive thoughts on this project here and the project legal agreement. It's been a long time coming. It's been a labor of love for many of us.'",
        "'speaker_3': 'And it's a culmination of a lot of blood, sweat and tears volunteers in bringing this forward. But one last thing, if I can. I'd like to see if we can have an annual review as to how we're doing with our place in our hiring efforts so that we can keep track of what we're doing here.'",
        "'speaker_3': 'And with that, a motion to approve the project agreement. Okay.'",
        "'speaker_4': 'Can we take public comment, please?'",
        "'speaker_6': 'Our first speakers, Abraham Zavala. Abraham Zavala.'",
        "'speaker_3': 'Hello? Yes. Yes. Please begin. Okay. Hello, everybody. This is Lopez speaking on behalf of Abraham that I couldn't make it. Representing Libra. Hello, Honorable Mayor and City Council. Thank you so much for digging. And also thank you for taking step forward and doing what's right, right.'",
        "'speaker_3': 'And protecting and ensuring that workers here locally get jobs. And hopefully with the new steps, we can ensure that local Long Beach residents are the ones taking up these local jobs with good benefits and the entry way to also union jobs that will ensure, you know, and ensure that we continue to grow middle class.'",
        "'speaker_3': 'So you can offer an opportunity to recreate and regrow a middle class to low income, marginalized residents who at times are, you know, put to the side, whether it's a criminal record or any other thing that is, you know, not allowing them to get a job.'",
        "'speaker_3': 'And, you know, we're offering opportunities here. So as a Long Beach resident, I'm really excited to see this forward. Really happy to see this as a tenant advocate, you know, to be able to offer, you know, opportunity for people who, like I said, get marginalized.'",
        "'speaker_3': 'And as we take that forward towards equity, you know, we're headed in the right direction. So, once again, thank you so much. And as a member of the of the coalition, you know, we support this and are really thankful for everyone who's taking a stab at this.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'I think your next speaker is Chris Hannon.'",
        "'speaker_3': 'Chris Hannan. Hello. Good evening. Honorable mayor, honorable city council members. This is Chris Hannan, representative for the Los Angeles Orange County's Building Construction Trades Council. The city of Long Beach is the project. Labor agreement has created opportunities for so many, with 235,000 work hours that were created or that were worked constructing those projects for the residents of'",
        "'speaker_3': 'Long Beach, the impact was much greater. And I'd like to echo some of the comments that were made earlier. The impact and example the city of Long Beach said is just so much bigger than that. The individuals that were taken in through the Long Beach City College's apprenticeship readiness program.'",
        "'speaker_3': 'That was created because of the city of Long Beach's Project Labor Agreement. Those individuals are now over the same period of time working between 680 to 850000 work hours for that same five year period of time. It's led to other project labor agreements and community workforce agreements in the area.'",
        "'speaker_3': 'When I was at the Long Beach Unified School District's meeting, as well as the Long Beach City College's meetings for their project labor agreements, there were individuals that started their careers because of the city of Long Beach. This play.'",
        "'speaker_3': 'And it's just incredible the impact that it's made on their lives. And now they're working not just on those Long Beach projects, but in and around the region. And bringing those dollars back to their communities along the Pacific Gateways has done a great job supporting and removing barriers for these for these candidates as they entered into apprenticeship'",
        "'speaker_3': '. And now many of them are even completing their apprenticeships and our journey level workers within our local unions. So the new ten year agreement is just going to create an expansion of those opportunities. And on behalf of the Building Trades Council and our local union affiliates and apprenticeship programs, we support the approval of item number 20.'",
        "'speaker_3': 'And want to thank all of you for the partnership. Thank you.'",
        "'speaker_6': 'I think your next speaker is Elsa tung.'",
        "'speaker_2': 'Hi. Good evening, Honorable Mayor and City Council. My name is Elsa Tung from Long Beach Forward, a member of the Long Beach Local Hire Coalition, which is a community based coalition that has been fighting for years for local and disadvantaged hire.'",
        "'speaker_2': 'Best practices within the city wide project labor agreement to benefit our Long Beach neighbors most in need. Today we say thank you. Thank you so much to economic development director John Keisler to city staff and to our council champions.'",
        "'speaker_2': 'Thank you for listening and with your vote today, thank you for doing right by our community. The proposed new plea includes the four structural improvements that have been consistently recommended by the local higher coalition to strengthen local disadvantage.'",
        "'speaker_2': 'Tire number one require an independent jobs coordinator for all projects to define disadvantaged worker using Metro's definition, which targets the most economically and socially disadvantaged population. Three Report Disadvantaged work hours by city or tier. So we know if Long Beach residents are benefiting and for use Metro's process for holding contractors liable for local and disadvantaged hiring goals'",
        "'speaker_2': '. Council members recall that under the original 2015 plea, only an average of 19% of work hours were performed by Long Beach workers, with a majority of work hours coming from outside Long Beach. With these four structural changes, we should see this balance tips back toward Long Beach workers, and specifically the Long Beach workers who are most structurally'",
        "'speaker_2': 'disadvantaged. Finally, I want to read out loud the equity lens section of the staff report, because this is the city's promise that everyone needs to hear, quote, exploring and enhancing the role of the independent jobs coordinator in the proposed plan to improve access to local jobs for black communities and communities of color was explicitly called for as'",
        "'speaker_2': 'an action item in the strategy for Advancing Economic Equity in the city's Racial Equity and Reconciliation Initiative. Report to advance the strategy, the play administrator in the Economic Development Department will develop an implementation plan using strategies from the Equity Toolkit to enhance the role of the Independent Jobs Coordinator in the recruitment, training and ongoing support of black'",
        "'speaker_2': 'workers and local communities of color for work on play projects. Now, to keep track of this promise over the next ten years of the agreement, the play should be brought back to council regularly for official review and evaluation council members.'",
        "'speaker_2': 'We find ourselves in one of the worst health, economic and racial injustice crises this city has ever seen. But with your leadership, we will have a brighter future. Thank you so much for your leadership today. Thank you.'",
        "'speaker_6': 'I think your next speaker is Jessie. I'll call her.'",
        "'speaker_3': 'Yeah. Well, also the council on all council. Mayor, my name is Jessie Alcala. I am a single father of five daughters. I live in the city of Long Beach. And the one thing I want to thank the city council for is creating this program that focuses on disadvantaged workers like myself.'",
        "'speaker_3': 'I am a single parent raising five girls all on my own. And this opportunity that I believe that can program, that can provide. Well to make a huge impact on my life and many lives. Long Beach residents. So what we would like to do is to have a strong commitment from the Honorable Council to stay focused on'",
        "'speaker_3': 'hiring locals as an active tenant leader in the housing. Just a moment. I want to call on council to remember that your jobs can lead to more stable housing for families like myself and my residents around. Thank you for your time.'",
        "'speaker_6': 'Thank your next speaker, Suzanne Brown.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_2': 'Good evening. My name is Suzanne Brown, and I'm an attorney with the Legal Aid Foundation of Los Angeles in our Long Beach office. I'm speaking this evening on behalf of the Long Beach Local Hire Coalition. Our coalition came together eight years ago to fight for strong, local and disadvantaged hiring requirements in the city's play.'",
        "'speaker_2': 'We strongly support plays and all the benefits of good paying union jobs, which is why the local and disadvantaged hiring pieces are so important to us. While it has taken some time to get the local and disadvantaged hiring provisions right, the recommendations in the staff report reflect what the community has been fighting for since the Coalition was'",
        "'speaker_2': 'formed eight years ago. We want to acknowledge this progress. We strongly support the adoption of a new play for ten years, with the four additional provisions laid out in the staff report, which you've heard restated many times, requiring an independent third party jobs coordinator for all play projects, utilizing Metro's definition of disadvantaged worker reporting, disadvantage, work hours'",
        "'speaker_2': 'by city or tier, and using Metro's process for holding contractors liable. These additional provisions will bring languages play into alignment with best practices by our partners in the region, such as L.A. Metro, and they will result in more jobs for Long Beach residents at a time when jobs are desperately needed.'",
        "'speaker_2': 'With the devastating and unequal impacts of the COVID 19 pandemic, we must seize opportunities to assist with a more equitable recovery. The play is one such opportunity and it was identified as such in the reconciliation initiative. We want to especially thank Councilmember Urunga and Vice Mayor Richardson for the leadership on this item.'",
        "'speaker_2': 'They have been working alongside us for years now. We also want to thank John Keisler and his team for working with us to create a play that includes the community's priorities. Thank you.'",
        "'speaker_6': 'I think your next speaker is coming off of a.'",
        "'speaker_2': 'Bob. President.'",
        "'speaker_3': 'Yes, good evening. Mayor and city council some provide here. You know, I just wanted to mention that, you know, ever since this project global agreement was in place five, six years ago, you know, thanks to the city mayor and.'",
        "'speaker_3': 'And the city council for taking on the adoption of the plea. You know, we know it was, you know, hard negotiations between the building trades, Roger Miller and Ray and and and the city staff at the time. But, you know, we we always experience these type of project labor agreements that come across a renewal process.'",
        "'speaker_3': 'And I don't think there's not one project labor agreement that has not been renewed since the project labor agreements have been in place for for many, many years. So, you know, I just want to echo the mayor's comments when he mentioned earlier about, you know, the city of Long Beach taking on, you know, throughout the city departments'",
        "'speaker_3': 'and the different agencies in the city of Long Beach that have adopted project agreements. Thank you to you, Mayor, for, you know, being the advocate that you are and the city council, you know, being advocates as well to the to the other agencies within the city.'",
        "'speaker_3': 'You know, and I think, you know, the city of Long Beach, you know, you know, take their hats off and say, hey, you know what? You're the you're basically the only city that has done this, I think, in all California, when it comes to having all the different agencies within the city of Long Beach adopt a project'",
        "'speaker_3': 'labor agreement. And I think the top probably three or four cities that have adopted a ten year agreement, you know, within L.A. County. So, you know, this is you know, this this day is a historical day, especially moving forward with the infrastructure dollars that the city is looking forward to in the near future.'",
        "'speaker_3': 'We look forward to working closely with the city of Long Beach and making sure that these project improvements, you know, keep keep moving and in making sure that we keep ourselves accountable. I want to thank the city staff, Nick and John and Public Works director for negotiating this contract.'",
        "'speaker_3': 'You know, these contracts and you know, they're not easy, but, you know, you guys got it done. And, you know, he'll be out tonight getting this applicants approved. So thank you. Thank you very much. And we look forward to working closely with the city and then.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'That concludes public comment for this item.'",
        "'speaker_0': 'Mayor. That concludes public comment.'",
        "'speaker_4': 'Customer Ringa before we go to the depot or I'm sorry you made a motion. I just want to confirm that that includes the the revisions the staff discussed.'",
        "'speaker_3': 'Yes, it does. And I also think in the annual review of the progress.'",
        "'speaker_4': 'Yes, we we definitely we definitely got that and then I have so that's the motion to have the second by councilman's in Dallas and councilman price.'",
        "'speaker_2': 'Tamara, just real quickly, I wanted to just highlight a couple of things as as my colleagues were talking. It occurred to me that this conversation regarding plays has been going on far before, even when I was on the council and councilman Councilman Ranga highlighting that former Councilwoman Ranga had also brought this issue before council and that he'",
        "'speaker_2': 'himself had brought it with City College as a reminder that this is a lot of conversation. Then when I was involved in this through this council, and so there probably has been a lot of historical procedures with resistance and concerns and things in the past that I'm not even aware of.'",
        "'speaker_2': 'But I do. I would be remiss if I didn't call out specifically now Assemblymember O'Donnell and Senator Gonzales. Assemblymember O'Donnell is the one who brought that item forth at that first meeting that I think lasted until one or 2 a.m. at Highland Park, where we first talked about this issue.'",
        "'speaker_2': 'And he was really passionate about the topic and did a lot to educate me. And I know some of my other colleagues on why he felt passionately about it. And when he went on to the assembly, Senator Gonzalez really took the lead on this as well.'",
        "'speaker_2': 'And so, Councilmember Ranga, thank you for your efforts on this and for reminding us of how long this discussion has actually been happening, that it even predated you on this body, but that you had initiated on the College Board as well.'",
        "'speaker_2': 'So I really appreciate that. But I didn't want the night to go by without acknowledging some of our former colleagues who contributed so much to this conversation. So thank you.'",
        "'speaker_4': 'Thank you, Councilwoman. There is a motion and a second roll call. Vote, please.'",
        "'speaker_0': 'District one. I district to. I think District three, I District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'District five. District five. I. Can you hear me? Yes, thank you.'",
        "'speaker_2': 'Oh, good. Thank you.'",
        "'speaker_0': 'District six. I. District seven.'",
        "'speaker_3': 'A resounding A.'",
        "'speaker_0': 'District eight.'",
        "'speaker_3': 'II.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'By.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Emergency Ordinance on Third-Party Food Delivery Service Fees.": [
        "'speaker_4': 'Thank you very much. Moving on, we have I think we've got four or five kind of second readings of ordinances. So why don't we go ahead and get through these rather quickly? I 22 please.'",
        "'speaker_0': 'Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code or related to third party food delivery service fees, and declaring that this ordinance shall take effect immediately read and adopted as read citywide.'",
        "'speaker_4': 'Okay. Can I get a motion in a second, please? Check out a motion by Sunday House second by country ranger. I don't think there's any public comment. Roll call vote.'",
        "'speaker_0': 'District one, district two. I. District three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four. District five, i. District six.'",
        "'speaker_2': 'He. I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_3': 'By.'",
        "'speaker_0': 'District eight. District eight.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Emergency Ordinance on Temporary Enforcement of COVID-19 Health Orders.": [
        "'speaker_4': 'Thank you. Item 24, please. I'm sorry. 23.'",
        "'speaker_0': 'Communication from City Attorney Recommendation to Declare Ordinance Amending the Long Beach Municipal Code relating to Temporary Enforcement of Long Beach health orders related to COVID 19. Declaring the urgency thereof and declaring that this ordinance shall take effect immediately.'",
        "'speaker_0': 'Read and adopted as read citywide.'",
        "'speaker_4': 'Okay. Can I get a motion in a second, please? There is no public comment on this item. Then get a motion in a second, please. Motion by Councilmember Ringo. Second vote comes from a Sunday House roll call vote.'",
        "'speaker_0': 'District one. My district, too. I. District three. I. District four. All right. District five, I. District six. I. District seven. I. District eight. By District nine. District nine.'",
        "'speaker_4': 'Clinton.'"
    ],
    "Emergency Ordinance for Premium Pay for Grocery Workers in Long Beach.": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_4': 'Thank you. Item 26, please.'",
        "'speaker_0': 'Communication from City Attorney Recommendation to Declare Ordinance Amending the Long Beach Municipal Code. Establishing Labor Standards Requirements for premium pay for grocery workers working in Long Beach. Declaring the urgency thereof and declaring that this ordinance shall take effect immediately.'",
        "'speaker_0': 'Read and adopted as read citywide.'",
        "'speaker_4': 'Thank you. As your city attorney, is it just one vote or two?'",
        "'speaker_3': 'This is one vote, Mayor. Thank you.'",
        "'speaker_4': 'Okay, great. I have a most of my councilman and Diaz and a second by Councilwoman Sara. I have no public comment. Roll call. Vote, please.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. Hi. District three. District three, II District four, high District five. District five. I. District six. I. District seven. I District eight.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Long-Term Leasing and Development Opportunity at the Former Long Beach Armory.": [
        "'speaker_4': 'Thank you. We have a thank you for getting through all those. We have a couple of council items. And so let me go ahead and go through some some of these other items. First step, we're going to hear item number 19, please.'",
        "'speaker_0': 'Report from economic development. A recommendation to adopt specifications for the long term leasing and development opportunity at former Long Beach Armory and authorize city manager to execute all documents necessary to enter into an exclusive, exclusive negotiation agreement with Howard Cdmo District one.'",
        "'speaker_4': 'Kate. We're going to do a council presentation. I think we have a short presentation first. So let me turn this over to staff.'",
        "'speaker_6': 'Thank you, Mr. Mayor. John Chrysler and Sergio Ramirez will give the report. Perfect. Good evening, honorable mayor. Council members have a very short presentation. I'd actually find it quite exciting project. So for a request for an exclusive negotiation agreement for a city property.'",
        "'speaker_3': 'The former Long Beach Armory. By way of background the the city.'",
        "'speaker_6': 'Property that's located at 854 seventh Street along seventh and Alamitos is was a former Army National Guard property that was decommissioned in 2018. The property reverted back to the city. It's approximately an acre with a three story building.'",
        "'speaker_6': 'It's situated adjacent to Sin Anthony High School, right across the street from Mola Payam and GOM Minor Park. As mentioned in 2018, when the property was decommissioned by the the armory of the property asset vacancies. That time and rec has significant improvements that are required.'",
        "'speaker_6': 'Back in last year, in May of 2020, the city staff issued a request for proposals. And due to the pandemic, that request for proposal timeline was extended to July 20. July 29, 2020. At that time, a respondent team, we did get a proposal from Gunnery Partners, a group of partnership, Howard C.M. Pacific six and son Anthony High'",
        "'speaker_6': 'School and Studio 111, who are proposing an exciting project. The Armory Arts Collective would be an adaptive reuse restoration project of the historic Armory Building, which would introduce offices, meeting rooms, studios, exciting performing arts center, a gallery space and an outside performing arts garden.'",
        "'speaker_6': 'The space would be used by Saint Anthony High School, as well as opened up to the community and made available for programing. In addition, as part of the component of the project, potentially there could be development of an 86 unit workforce housing project to help finance the improvements of the armory.'",
        "'speaker_6': 'This evening, staff is requesting an exclusive negotiation agreement period, which would allow staff to work with the applicant for a period of time to see if to explore due diligence and also negotiate terms of a more definitive agreement.'",
        "'speaker_6': 'The term that's being requested would be a 90 day negotiating period with an additional 90 days, if required, to be able to come to an agreement. That concludes the staff presentation and happy answering questions. Thank you.'",
        "'speaker_4': 'Thank you. We have. Let me turn this over to Cattleman's in Dallas, which I know is in the district. I believe that's a motion. And then I have a second, I believe a Councilman Price Council members in Dallas.'",
        "'speaker_1': 'Thank you. Thank you, Mayor, very much. First of all, I wanted to say how excited I am to see this proposal moving forward. I know the staff, especially our economic development department, have been working so hard to help our city turn this space into a positive, good, good for our community.'",
        "'speaker_1': 'And I couldn't be more excited about the plans that they've outlined here. I'm especially excited to see the collaboration between all of the people on this bid and that are really going to be making a huge difference. I mean, I'm grateful for any opportunity to increase access to affordable housing in Long Beach, as you all know, but'",
        "'speaker_1': 'especially in my district. On top of that, being able to see this turn into an active, vibrant community space that can be used by our amazing partners in that neighborhood is so exciting for me. I'm glad to see that St Anthony's is going to be part of these plans as they move forward.'",
        "'speaker_1': 'And I'm also looking forward to the effects this could have on our surrounding neighborhood and the way that it's going to elevate that particular neighborhood. Something that has been particularly of concern of mine over the last year has been the binder park that we have right now.'",
        "'speaker_1': 'And I feel that with this project, it's going to elevate it and really give these park the the the opportunity to really thrive as it was intended so that all of our neighbors can can really be able to take advantage of this new project coming up in our first district.'",
        "'speaker_1': 'So I'm so excited to see this coming up right there on that particular corner. And I can't wait until it comes into fruition. So thank you, everyone.'",
        "'speaker_4': 'Thank you, Councilman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I want to echo the comments of my colleague, Councilwoman Zed de Haas. I think this is a really interesting project. The collaborations are interesting and very positive. And what I love most about this project is that as we will discuss with item 15, this did go out to bid.'",
        "'speaker_2': 'It was a competitive process. It was fair. And as a result, I think we can all have confidence in the outcome of that process because it was a fair process that everyone was able to participate in to determine whether or not they they were both suitable and a viable partner to the city.'",
        "'speaker_2': 'So I really appreciate this collaboration and very much support this item. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'Thank you. I appreciate the comments of my colleagues. I've enjoyed meeting with Saint Anthony after they were able to be the arbiter of choice for this negotiation. And while I understand there are no guarantees they'll come to an agreement, I'm hopeful that they'll work together or hand-in-hand with the city to find a solution for some minor park'",
        "'speaker_2': 'and for that community that will have a lasting impact for generations to come. Thank you.'",
        "'speaker_4': 'Thank you. There is no public comment that I have. I'm going to make some comments and then we'll go to a vote. So I just want to just congratulate Councilwoman Zendejas for her work just believing in this project.'",
        "'speaker_4': 'And this is something that we've been working on. When I was a councilmember for the first district and hoping that we could get that armory activate, it did and brought back. And I know that then Councilman Gonzalez also was so interested in this.'",
        "'speaker_4': 'And the part of this that I really love is I want to just uplift Saint Anthony High School. I think they partnered with some amazing folks to get this project done. My first job out of college was Saint Anthony.'",
        "'speaker_4': 'I worked for an amazing woman who's now retiring named Gina Rushing. And Gina, I would have been the president for this entire time. And she talked about the armory when I didn't even know the neighborhood. Right out of college and about, you know, kind of her vision and dreams for the armory and Saint Anthony.'",
        "'speaker_4': 'And so when I think about Gina generosity, Maguire and I think about her legacy that she's leaving. I also know this is a part of her work is always fighting for Saint Anthony, is being a part of this project.'",
        "'speaker_4': 'And so I just want to also honor her and honor Cindy Anthony High School, an amazing institution that we have in our city and all of the staff on that campus and that faculty that really have always looked at that armory as an opportunity for those students.'",
        "'speaker_4': 'And so thanks to them and of course, thanks to the development partners as well, Councilman and de Haas and just the whole team, I'm ecstatic that you guys got it across the finish line and we're going have a great project there.'",
        "'speaker_4': 'So thank you to the city staff as well. And with that roll call vote, please.'",
        "'speaker_3': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_6': 'District two.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District four. High District five. High District six.'",
        "'speaker_2': 'I. District seven. I.'",
        "'speaker_3': 'I. District eight. Hi. District nine. All right.'",
        "'speaker_5': 'Motion carries.'"
    ],
    "Report on Operational Models for the Helicopter Unit of the Long Beach Police Department.": [
        "'speaker_4': 'Thank you. Item 14, please.'",
        "'speaker_3': 'Communication from Councilwoman Pryce, Councilwoman and Councilwoman Allen, Council member, super long recommendation to direct city manager to report back within 90 days.'",
        "'speaker_6': 'With a report.'",
        "'speaker_3': 'Between various models for the operation of the helicopter unit of the Long Beach Police Department.'",
        "'speaker_4': 'Thank you, Councilwoman Price.'",
        "'speaker_2': 'You, Mr. Mayor. So this item really is a follow up to some of the budget discussions and decisions that we made regarding our police helicopter unit. I'm a huge, huge supporter of the helicopter operations because I'm very familiar with and I think many of us are.'",
        "'speaker_2': 'The reality that when people commit crimes, one of the first instincts is to flee. And either whether they're fleeing on foot or in a car, that flight can be very dangerous and difficult for our police officers to apprehend the fleeing suspect if they're on foot.'",
        "'speaker_2': 'It's very difficult to be able to locate their whereabouts from the ground. And if they're in a vehicle, it can be really dangerous because oftentimes it results in high speed chases. And so the helicopter, a police officer, is trained to be able to see things from a much broader viewpoint and vantage point.'",
        "'speaker_2': 'And their operations are just much more efficient and safe in terms of apprehending fleeing suspects. And so I'm a little bit concerned because when we adopted the changes to the budget regarding our helicopter unit, we didn't really have a structure in place.'",
        "'speaker_2': 'I know we delayed the implementation of moving things like the Hart team over without further study and evaluation of what the practical changes would be. But with the helicopter unit, we simply just approved the budget modifications with the understanding that we'd be notified later of the operational changes.'",
        "'speaker_2': 'So we have been given some more information of how the operational model might work with the new budget. But I'm asking the city manager to take another look at that because with the increase in violent crime that we're seeing throughout the city.'",
        "'speaker_2': 'What I don't want to happen is for us to lose any more patrol officers from any of the four divisions. If a patrol officer who's trained to know what to look for has to go and assist a civilian pilot with with basic law enforcement functions, then I think it will cause our patrol divisions to suffer with that'",
        "'speaker_2': 'loss of a body. So it may make sense to do it. It may not make sense to do it. I know circumstances have changed since we adopted the budget in terms of staffing for that unit. And I'm just asking the city manager to take another look to for us to determine, does this new model still make sense'",
        "'speaker_2': '? Is the cost benefit enough that it it outweighs the benefits of having trained law enforcement personnel in a helicopter? And and if so, of course, I'm going to support whatever decision the chief and the city manager believe is the right thing to do.'",
        "'speaker_2': 'But I think this warrants a second look now that we've had an opportunity to to kind of settle from the budget and evaluate what some of the impacts of our decisions might be in a practical sense. So I want to thank the city manager for taking a look at this, and I want to urge my colleagues to'",
        "'speaker_2': 'support this item. And I just want to remind everyone, we're not asking to move any money around right now. We're just asking to see the current budget recommendations make sense in light of some of the practical realities. Thank you.'",
        "'speaker_4': 'Thank you, councilwoman. Next up is and I'm assuming that's also in motion. Councilman Van De has it received?'",
        "'speaker_1': 'Thank you, Mayor. I just want to thank profoundly Councilwoman Price and our amazing city staff for this item today. I'm really looking forward to that discussion when it comes back. And I think it's absolutely important that we understand the impact of our budgetary decisions on the work our city is able to do for our residents, especially coming'",
        "'speaker_1': 'from a district where there are so many violent crimes that happen. So I'm looking forward to that discussion. Thank you.'",
        "'speaker_4': 'Thank you, Councilman.'",
        "'speaker_2': 'Thank you. I hope that when this report comes back that we're able to hear a little bit more about the standards across the industry. There are agencies across this country that take police officers and pay for them to go through a pilot school just so that they can get trained police officers.'",
        "'speaker_2': 'The amount of value that a pilot and spotter team happen when they coordinate and know each other well and work together well and have similar training experience. They say that it's worth between nine and 15 cars on the ground.'",
        "'speaker_2': 'And so the the cost benefit seems to be one that we really need to look at. So I'm very supportive of this item. I was supportive of reevaluating this as a potential cut when the budget was here. And I'm glad that it's coming back for an additional look.'",
        "'speaker_2': 'Thank you, Councilwoman Pryce.'",
        "'speaker_4': 'Thank you. Now I have Councilwoman Allen.'",
        "'speaker_7': 'Yes. Thank you, Mayor. I also want to thank Councilwoman Price for bringing this item. I, too, am a huge advocate of the helicopter. And as a former police officer, I can definitely attest to the benefits of the helicopter and what they bring to law enforcement.'",
        "'speaker_7': 'It saves on bad manpower and it's a great de-escalation tool when you can set up perimeters and it just slows things down. And so I look forward to seeing their report. I think experience matters. Like my councilwoman, Mongo just spoke on.'",
        "'speaker_7': 'And I like to see that those benefits. I also would like to know, I mean, if there's been any conversations with even, you know, contracting our services out to any of our border cities. And and then also, I did have some questions with regards to I know that the port has participated in some of the fees for'",
        "'speaker_7': 'the helicopters in the past and what that still looks like. So these are all things that I definitely would like to see and when the when the report comes back. So thank you so much again. And I appreciate staff looking into this.'",
        "'speaker_4': 'Thank you. I don't believe there's any public comment on this.'",
        "'speaker_0': 'No. There's no public comment on this item.'",
        "'speaker_4': 'Cast your votes, please.'",
        "'speaker_0': 'District one. I district to. By District.'",
        "'speaker_2': 'Three.'",
        "'speaker_0': 'District four, District five. I. District six. I. District seven. District eight. High District.'",
        "'speaker_2': 'Nine.'",
        "'speaker_3': 'Right.'",
        "'speaker_0': 'Merchant carries.'"
    ],
    "Unsolicited Proposal Process for City Owned Real Property Development.": [
        "'speaker_4': 'Thank you. Next up is item number 15.'",
        "'speaker_0': 'Communication from Councilwoman Price, Councilwoman Zendejas, Councilwoman Allen. Recommendation to direct City Manager to work with economic development. Create an unsolicited proposal process for development of city owned property.'",
        "'speaker_4': 'Thank you. Councilman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. So I'm bringing this item forward because I know what happens to all of us, but every once in a while, I'll get a call from a developer who has driven by either an underutilized city property or a city property that may appear to be vacant.'",
        "'speaker_2': 'And they want to know what they can do to acquire it or to utilize it. And we currently have no formal process in place to make such a discussion, a fair discussion that provides access to anyone, access and information to anyone who might be interested in developing the same site.'",
        "'speaker_2': 'And so it seems sometimes like the process is a little bit of who, you know, instead of us publicly putting information out there that a specific property has been the subject of interest by a developer, and we are welcoming interest from other potential developers on that same property.'",
        "'speaker_2': 'And so I think this is a process that that really we should put into place. And we've talked to I've talked with John Keisler about this, and I don't know if John wants to speak further about it, but I imagine that Council District three is not the only district where this type of conversation happens.'",
        "'speaker_2': 'And so I think developing a formal process that provides access and opportunity for all potential interested developers in acquiring and or operating city owns land is a beneficial tool for the city to have. So I'd ask my colleagues to support this item, and I don't know if Mr. Heisler still here on the call, but if you wouldn't'",
        "'speaker_2': 'mind, maybe just talking a little bit more about why this is a positive development if we had a process like this.'",
        "'speaker_6': 'This is Tom Modica. I think John is it was not available right now, but he and I have spoken as as you and I have as well. We do believe that there is a benefit for creating a citywide structure for unsolicited proposals.'",
        "'speaker_6': 'We do get these on a regular basis and we do have a process for processing them and taking a look and analyzing them and getting those to the city council in closed session. I do think having a more of a structure and knowing kind of what to expect if you do want to do an unsolicited proposal.'",
        "'speaker_6': 'And also some of those key questions about how do you also give opportunity to those who you know, who are also interested in the part in the process and developing on that site. So we think this is a good thing and we'd be happy to bring back some ideas for the council to consider.'",
        "'speaker_4': 'Thank you. Councilman, president, anything else you want to continue?'",
        "'speaker_2': 'Thank you, Mr. Mayor.'",
        "'speaker_4': 'Councilman Margot. Councilman Mongo. Okay. Let me move on. I'll come back. Councilman Zoro.'",
        "'speaker_2': 'Thank you. I'm sorry. I want to go ahead. Councilmember, you know, I've been having some microphone challenges this evening. Thank you. Councilman Price and the co-sponsors of the item. This is something that comes up so often. And we've talked to city staff about options.'",
        "'speaker_2': 'It often has to do with what city department is most involved in it. And so I would love to see a transparent process that both encourages the businesses and or ideas to come forward, but also has some transparency to it.'",
        "'speaker_2': 'Where proposals received are incubated for a certain period of time, where the address of interest is listed on a public website. So other individuals who might have ideas about that particular site could come forward with ideas without revealing the efforts of the original proposer.'",
        "'speaker_2': 'And so that ideas can really flourish in a competitive way without direct competition of losing the value of the ideas and the work brought forward by one. So I really appreciate this item. I would love to see this move forward.'",
        "'speaker_2': 'And if we do move to a committee structure, I would love to hear this item in economic development in finance, because I think it would be a powerful one. Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman Sara.'",
        "'speaker_2': 'Thank you, Mayor. So and I also think Councilmember Pryce and the other members for bringing this agenda forward. I do think that we should have a formal process to understand these, a process for unsolicited proposal and a clear process.'",
        "'speaker_2': 'But I also want to make sure that as we do develop a process, we take into consideration, you know, districts like mine who might have some properties available that developers might be interested to take in consideration of the concerns around community as far as how it might impact or change the makeup of the community as well.'",
        "'speaker_2': 'There's just been a lot of heightened concerns about displacement in in my district. So I just want to make sure, as we're developing it, that we also take that into consideration about how we're making sure there's a transparent process as well to residents that might be impacted.'",
        "'speaker_2': 'I know that the process is a proposal and it doesn't necessarily, you know, have a process yet for informing community members or residents of the area, but also making it so that we encourage those from the community maybe or create process where they're also able to possibly apply for this as well.'",
        "'speaker_2': 'And so thank you.'",
        "'speaker_4': 'Thank you, Councilwoman Allen.'",
        "'speaker_7': 'Yes. Thank you, Mayor. Am I also signed on to this item? And it's important because it creates a path for unsolicited proposals regarding the acquisition we sell or shared use of city owned property and Lumbee each has a good history of strong processes, and I'm proud of that.'",
        "'speaker_7': 'But we also need to make sure that we have a defined process for unsolicited proposals as well. And I am a firm believer that by creating a channel for unplanned projects not formally requested by the city is also a great opportunity to boost innovative development projects.'",
        "'speaker_7': 'And it's just good for the city. So I look forward to seeing this move forward.'",
        "'speaker_4': 'Councilwoman and councilman Sunday has.'",
        "'speaker_1': 'Thank you, Mayor. I just want to thank Councilmember Price for bringing this forward. I think that this is very, very fitting for us as a city as we continue to grow and as we continue to develop. I think that having a fair and just process will be beneficial to all involved.'",
        "'speaker_1': 'So very happy to support this item.'",
        "'speaker_4': 'Thank you. That concludes comments. Let's do a roll call vote, please.'",
        "'speaker_0': 'District one, i. District two. I District three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four by district five, i. District six. At District seven. I District eight. District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Feasibility Study of Acquiring Open Space for Park Development along LA River.": [
        "'speaker_4': 'Thank you. Next up is item 60 in?'",
        "'speaker_0': 'Communication from Councilman Austin, Councilwoman Zendejas, Councilmember, your UNGA recommendation to request City Manager to study the feasibility of acquiring open space for public park development along L.A. River and report back within 60 days.'",
        "'speaker_4': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'All right. Thank you. I'd like to thank my councilmembers Van de Haas and Durango for joining me in signing on to this important item. Creating new parks in open space has been a priority for our city council and for me personally.'",
        "'speaker_3': 'For many years, for nearly two years, I served on the Lower L.A. River Revitalization Plan Working Group, identifying potential projects and working with other cities along the entire 90 mile stretch of the lower L.A. River, which extends from the city of Vernon to the mouth of the L.A. River in Long Beach.'",
        "'speaker_3': 'In just the past 12 years, more than 70 acres adjacent to the L.A. River have been opened to the public to enjoy its parks, walking trails, natural habitat and open space. In 2008, L.A. County opened more than 35 acres of the Dominguez Gap wetlands.'",
        "'speaker_3': 'In 2018, we opened an additional 32 acres of the entire forest wetlands connecting to the Dominguez Gap wetlands and creating the longest contiguous stretch of open space along the entire L.A. River. We also opened Molina Park in 2018, providing an additional 3.5 acres of park active recreational park space along the L.A. River in North Long Beach.'",
        "'speaker_3': 'We are also doubling the size of Davenport Park with additional with an additional nearly three six acres of additional park space. In addition, there are a number of projects along the river that are being designed under development or have opened, including the Jake Travis Greenbelt, Wrigley Greenbelt, the 51st Street greenbelt, and the Hamilton Loop, just to name'",
        "'speaker_3': 'a few. With these efforts, we have significantly increased the amount of open space along the western part of our city and we must continue to do so. So at this time, I'd like to request the City Manager to study the feasibility of acquiring additional properties that may not be currently publicly owned along the L.A. River.'",
        "'speaker_3': 'This feasibility study can somewhat mute.'",
        "'speaker_4': 'Can everyone mute, please? Except for the councilmen. Thank you.'",
        "'speaker_3': 'Thank you. This feasibility study should provide a realistic assessment of what was a visit with L.A., what the Long Beach River Link Plan and the Lower L.A. River Masterplan. What funds are there from different funding sources, including local, regional, state and federal levels and potential costs for acquisition and development of open space.'",
        "'speaker_3': 'I would also like to just say we should be also looking at any opportunities for public private partnerships. And as we look at equity for communities throughout Long Beach, it will be helpful to understand what other part projects are currently in the works in the city and that they also may be competing for these funding sources.'",
        "'speaker_3': 'We know that we cannot limit this to any particular properties and I don't want to do that. But I do want the city manager and our city team to provide a comprehensive look at what is feasible in Long Beach.'",
        "'speaker_3': 'I ask my colleagues for their support on this particular item. This is very, very important to many in the community, as there's been a new, new reinvigorated interest in the lower L.A. River in our city. And I think this merits our attention, but also the attention of our state legislators as well.'",
        "'speaker_3': 'And so I'm happy to bring this forward and look forward to hearing your comments, but also from the public.'",
        "'speaker_4': 'Thank you. Next up, it's customary, Ringo.'",
        "'speaker_3': 'Thank you, Mary. And I want to thank Councilmember Alsup for inviting me to sign into the title. I have been a long time supporter of increasing parks space. In fact, in last year we made great strides in creating some space and by purchasing the park, which added 1.3 acres into the end to create park space, we were'",
        "'speaker_3': 'also able to execute an agreement for city ownership and management of the cemetery. I think recently the acreage for little things complex for over three attacks, 13 acres and allowed it to be continuously to our Willow Street. So the sale was a continuation of our work to get more park space into the city.'",
        "'speaker_3': 'And I am proud to support the sentiment that get the members of the City Council to also support you. Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman Sara.'",
        "'speaker_2': 'Yes, I want to thank that Councilmember Austin and as well as the other members on the floor signing on to.'",
        "'speaker_1': 'This.'",
        "'speaker_2': 'For bringing this forward. I appreciate Councilmember Austin's leadership and having represented.'",
        "'speaker_1': 'Long Beach.'",
        "'speaker_2': 'On the Lower L.A. River Revitalization Working Group, as well as council member Urunga, having served as a sitting on the board of the Rivers Mountains Conservancy. I just have a few question about the the the naming of the reference of the report in the title.'",
        "'speaker_2': 'Its it refers, it refers to lower L.A. River Master Plan. I just want to make sure and then but in below that it discussed the lower L.A. River revitalization plan. I just wonder if that was meant to be.'",
        "'speaker_2': 'And the Lower L.A. River revitalization plan as there is no such. There's nothing. We don't have a lower L.A. River master plan, only an L.A. River master plan. And it's.'",
        "'speaker_1': 'Currently.'",
        "'speaker_2': 'Hasn't been adopted. It's currently going through public comment. And so I just want to make sure we clarify that. We're talking about which document, which document we're referring to.'",
        "'speaker_3': 'Well, this typically want to acknowledge all of the visiting and work that has actually occurred over the past two decades, even before I joined the council. And so there are a number of documents or other plans. I reference the L.A. River River Lake Plan, but I know that the County of Los Angeles just recently released a plan'",
        "'speaker_3': 'as well. But the visioning, that process that went through we went through for the Lower L.A. River Revitalization Task Force was there were a number of projects and opportunities identified in that plan as well. And so I want our city staff to look at the sum total.'",
        "'speaker_2': 'Thank you. All right. I just wanted to make sure because I want just to make sure there's alignment in terms of since I agree with you, there are so many different plans working towards the same vision. The other clarification I just wanted to make, Councilmember Austin, is I heard you say kind of public and private partnership.'",
        "'speaker_2': 'Can I just clarify if if this feasibility will also include both public and private property, that will be part of the feasibility plan?'",
        "'speaker_3': 'Well, absolutely. I certainly I don't think we should limit our potential. I think we should be aspirational. And I think private properties, if there are willing sellers, should be certainly included and looked at as opportunities as along with public spaces as well.'",
        "'speaker_3': 'There are there are county parcels along the lower L.A. or along the river in Long Beach that that are currently undeveloped on an unplanned at this time. And we need to be looking at public spaces as well.'",
        "'speaker_2': 'And would you be open if I just made sure we offer a friendly amendment that we just specifically clarify to say, you know, adjacent to the L.A. River, both public and private property, just so that we're clear and there isn't confusion that we're not overlooking any any areas.'",
        "'speaker_3': 'That would be fine. Including golf courses. Yeah.'",
        "'speaker_2': 'Thank you. And if I can just circle back really quick, this is just my last if I may just include maybe if we could refer back to the recommendation to be and the Lower L.A. River Revitalization Plan just because that's been adopted versus the L.A. River Master Plan, which hasn't yet.'",
        "'speaker_2': 'And I just want to make sure we have the staff look at documents that's been adopted that's going to be reporting back in the next six days as the L.A. River Master Plan will.'",
        "'speaker_1': 'Be.'",
        "'speaker_2': 'Are just taking public comment right now for the next 60 days. So I just want to make sure staff has the right document that's been adopted to review.'",
        "'speaker_3': 'Again, I'm not not necessarily interested in limiting, and I don't know that that really serves a purpose. I think staff should consider all documents that are that are currently adopted and under consideration right now. Councilwoman.'",
        "'speaker_2': 'Okay. Just wanted to, you know, just provide those comments as we're working toward that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'No further question.'",
        "'speaker_4': 'Thank you. Councilman's in the house.'",
        "'speaker_1': 'Thank you. First of all, I'd love to thank Councilmember Austen for inviting me to sign on to this to this item and for bringing this item forward. I also would like to thank our engaged community members who have done such a wonderful job of identifying this space and advocating for expansion of park access in Long Beach.'",
        "'speaker_1': 'Although obviously this is not in my district access to green space and especially the development of open space along our L.A. River corridor has been a huge passion of mine for a long time. I'm incredibly interested in seeing this feasibility study come come to fruition, and I absolutely share the vision.'",
        "'speaker_1': 'And I hope that we can see these large parcels of land be turned into park space for our entire city to enjoy. So thank you again, Councilmember Austin.'",
        "'speaker_4': 'Thank you, Councilwoman. Vice Mayor Richard.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Just a couple of questions for her staff and before I get there. You know, we've been pretty engaged. And in my first term, we spent a lot of time on the uptown open space plan.'",
        "'speaker_3': 'It was modeled after the Great Providence plan. We saw the Drake Chavez, you know, follow the process. They did a plan and they saw funding and they expanded, expanded. Drake traveled the uptown open space plan. We follow the same model.'",
        "'speaker_3': 'We saw there's a lack of open space. So we worked with the community and we got we went through a planning process, a one, I believe, a Parks and Rec award. And from there, all other efforts stem from the DeForest Art vision, the Hamilton Loop vision, the Highland Park Master Plan.'",
        "'speaker_3': 'All of those things came out of this this focus here. I think what I'm unclear on, based on this motion is this centered on just river, because I see a larger issue. And and I'd love to see some connectivity if it all started with Jake Chavez.'",
        "'speaker_3': 'And the top of the river is in the bank district, the Forest Park and North. I'd love to see a plan that brings it all together that the five members of the council along that L.A. River can be engaged in.'",
        "'speaker_3': 'I know that there's been significant work on the West Side with Councilman Turanga and the Westside Livability Plan. And I know that Councilman sorrow. Councilman Zoro has tremendous history with the Mountain Conservancy. And I would just hope that what we have here ultimately is a vision that's inclusive of all those.'",
        "'speaker_3': 'So so so my first question to staff is based on this motion, are you or do you anticipate moving forward with creating a larger vision for this area that incorporate all of this work, including the river work? How are you how are you planning to respond to react to its motion?'",
        "'speaker_6': 'So we see this as requests for information. Vision plans tend to be pretty involved documents where you're setting aside consultant resources and staff resources to really go out and start from scratch and kind of engage your community and you start looking at vision.'",
        "'speaker_6': 'We've perceived this to be more of a feasibility analysis, to look at, kind of answer the questions about what are some of the opportunity parcels out there. We've done some of this work already. We can't remember your UNGA brought some attention to this a couple of years ago as we looked at oil operators.'",
        "'speaker_6': 'We've had our deputy city manager, Kevin Jackson, really following a lot of the L.A. River plans and been giving input into into those plans. And so we see this as a report back in a memo format to talk about what it takes to be able to procure land.'",
        "'speaker_6': 'What are some of the opportunities, both public and private, along the L.A. River and kind of connected areas to really help educate what are the opportunities and what are some of the challenges and some of the high level costs and next steps.'",
        "'speaker_3': 'Okay. Perfect. Thank you. I think. I think what I'm interested in is, you know, not reactionary. There's been a lot of proactive work that's taking place. It's been highlight for wetlands tells me you rank his work on the oil properties.'",
        "'speaker_3': 'Drake Chavez uptown open space. I'd love to see us advance to the next step of unifying, connecting those plants. And I would hope that we can draw on, you know, I want certainly want to make sure that I'm a part of this conversation given the river, the uptown sort of pathway.'",
        "'speaker_3': 'And I think it's important to remember sorrow is a part of the conversation as well. Given her professional expertize, the the Mouth Conservancy. So those are my suggestions. I'm happy to support the motion. Thank you.'",
        "'speaker_4': 'Thank you. Let's go to public comment, please.'",
        "'speaker_6': 'Our first speaker is. And Cantrell. And Cantrell. The next speaker is Aimee Valenzuela mere.'",
        "'speaker_2': 'Hi. Can you hear me?'",
        "'speaker_3': 'Yes.'",
        "'speaker_6': 'Please be in.'",
        "'speaker_2': 'You can. Thank you. My name is Amy Valenzuela, and I thank you all for your time tonight. I'm going to be the first person to speak, and I just want to introduce our team. We have a group of neighborhood volunteers who've come together to form in a very short time, the River Park Coalition.'",
        "'speaker_2': 'Some of you have heard of us. We've started as a grassroots organization, as mostly people who had participated in the planning processes that Councilmember Austin has spoken of tonight, as well as some of the other council members. And we have in a very short period of time really under threat of one property that is now being developed'",
        "'speaker_2': '. That was part of the signature feature of the Lower Los Angeles River Revitalization Plan as it pertains to Long Beach, which includes the Wrigley Park north and south. So although we came in opposition 23701 Pacific Place, we've really come to understand that the entire park that was planned through the River Link and other documents is under threat'",
        "'speaker_2': '. And so we really appreciate Councilman Austin's bringing forward the feasibility plan. We also feel very strongly that we need to be at the table. I think we're all clear on what the challenges are. We're all clear on what the costs are.'",
        "'speaker_2': 'We've been part of planning for decades now, and it's just really time to act. So we've launched this grassroots process. We want to come to you and especially to our council members who've worked so hard on this issue over the years that we're here.'",
        "'speaker_2': 'We're not going away. We're going to be partners in this.'",
        "'speaker_6': 'We thank you. Our next speaker is Carlos Servais.'",
        "'speaker_3': 'Good evening. I'd like to address two points. One is support for Councilmember Austin's memo, and the other is related to the activity at 3701 Pacific Place during the very framework for reconciliation listening sessions, one of the items raised with the issue of environmental racism and park inequity in Western Lobby, where the highest level of pollution in the'",
        "'speaker_3': 'nation, the most overcrowded conditions, a higher incidence of asthma and other respiratory diseases, higher incidence of cancer, high rate of poverty even pre-COVID, a shorter life span than the east side of Long Beach. A contributing factor to all of this is the lack of parks and open.'",
        "'speaker_3': 'Space. We have one park acre per 1000 residents versus 17 in the eastern side of the city. Even with the parks mentioned by the council members, we are still woefully short. Council, I strongly urge you to consider equity in supporting parks in open space such as the Council Approved River Link Project Reference in town Councilman Austin's memo'",
        "'speaker_3': 'regarding the ongoing construction at 30 7a1 specifically the developer took out permits for grading and soils. However, development services have turned a blind eye to the fact that 1 million surcharge pile built under city permit is causing damage as we speak through a major storm drain that services this area, as well as damage to two abandoned oil'",
        "'speaker_3': 'wells and two active oil pipelines making an existing environmental disaster even worse. This is why council must require a full environmental impact report that will look in-depth at this and many other issues before accepting the plan.'",
        "'speaker_6': 'Thank you. Your next speaker is Clayton Hurd.'",
        "'speaker_4': 'Hi. Good evening.'",
        "'speaker_3': 'Everyone. This is Clayton Hurd from the office of Congressman on file. Just want to read a brief letter from the congressman.'",
        "'speaker_4': 'Dear, honorable mayor and.'",
        "'speaker_3': 'City council members. The Los Angeles River has been a source of inspiration and opportunity long before my time on the Long Beach City Council. From the original caretakers, the Gabrielle, you know, and tons of people to countless neighborhoods and communities alongside the 51 mile waterway, the river has always offered unlimited potential.'",
        "'speaker_3': 'The existing river and limited open space provide a patchwork of areas for residents to experience nature.'",
        "'speaker_4': 'Exercise with friends, and spend.'",
        "'speaker_3': 'Time with loved ones. As the river continues to transform, I strongly encourage the city to explore all options to develop new public access and open space alongside the Los Angeles River, with a focus on communities lacking park space and those disproportionately impacted by environmental injustice.'",
        "'speaker_3': 'Long Beach has already made progress in the past few years to provide park space that connects the community to the Los Angeles River in areas like the Forest Park and into Wetlands and Drake Park. However, certain areas of the city still lack significant access to park and open space.'",
        "'speaker_4': 'Many of the communities surrounding the L.A..'",
        "'speaker_3': 'River are also disproportionately impacted by several sources of pollution, from heavy traffic on the 710 freeways to refineries and port activities in the south. Additional greenspace will help reduce the urban heat island effect, making neighborhoods cooler and even reduce some of the harmful air pollution that has resulted in higher rates of respiratory illness compared to other areas'",
        "'speaker_3': 'of the city. For these reasons, I strongly support the agenda item and I look forward to supporting efforts to ensure all residents have access to open space and part.'",
        "'speaker_6': 'Think your next speaker is Elina Teachey.'",
        "'speaker_2': 'Hello. I'm opposed to the proposal that proposed land use on the brownfield site at 3701 Pacific Place. As a resident living near the L.A. River and as a landscape architect, I would like to see greater park equity across West Long Beach, and I would like to see the city council and Mayor Garcia keep your promise for open'",
        "'speaker_2': 'space at that site, along with all of the sites recognized in the River Link Vision Plan and the Lower La River Revitalization Masterplan. The industrialization of all river adjacent open space, including brownfield sites, should cease. I would like you to support full environmental impact reports for each of those sites, as well as what other clean up and'",
        "'speaker_2': 'mitigation is required. I want to point out that there are funding sources and grant moneys available to purchase parcels, clean them up and convert them to green and recreational spaces and or green infrastructure sites. I would encourage you to make a bottom up rather than top down land use decision.'",
        "'speaker_2': 'Most importantly, I believe that as part of the River Park Coalition, we are demonstrating that there is public will. I have sent you all a detailed letter of my thoughts on this issue. Thank you for your time and consideration of my views on this matter.'",
        "'speaker_6': 'Think your next speaker is Gabrielle Weekes. Gabrielle Weeks. Our next speaker is McFadden.'",
        "'speaker_3': 'Okay.'",
        "'speaker_2': 'I'm sorry. Hi. My name is Gabrielle Weekes. I'm the chair of the Sierra Club.'",
        "'speaker_3': 'For the region.'",
        "'speaker_2': 'So that's not just our city, Long Beach, but many cities around here.'",
        "'speaker_3': 'As you heard.'",
        "'speaker_2': 'From some of the previous speakers, many of us have been excited about the L.A. County project re-imagining the Los Angeles River from end to end. I was a commissioner on that as well. As a lower revitalization plan. Some of the work that's been done at the northern end of Long Beach, there's been a lot of action around'",
        "'speaker_2': 'our rivers and I think that's wonderful because we need more still. Somebody had referenced the River Link and I know some of you on the council, we've been around long enough to know what that was.'",
        "'speaker_3': 'I helped Susan with that almost 20 years ago.'",
        "'speaker_2': 'And for decades the community has known we need more open space in central and west Long Beach, more trees, more.'",
        "'speaker_3': 'Recreational opportunities for.'",
        "'speaker_2': 'Humans, more wildlife areas. We need more of all of that. And especially with this wonderful thing that the county is doing in partnership with Frank Gehry, now is a really great time for us to look for IMC money or state programs, to work with people like Alamogordo or reps in Sacramento to really make.'",
        "'speaker_3': 'Our river.'",
        "'speaker_2': 'Here as beautiful as the stuff that they did up in City of L.A. a few years ago.'",
        "'speaker_3': 'I hope that you guys will vote to do this.'",
        "'speaker_2': 'And to have some.'",
        "'speaker_3': 'Ambitious.'",
        "'speaker_2': 'Goals and police work with.'",
        "'speaker_3': 'Us to accomplish this.'",
        "'speaker_6': 'I think your next speaker is McFadden.'",
        "'speaker_2': 'Hello. My name is Mark McFadden and I'm with River Park Coalition. First of all, I'd really like to thank council members Austin and Ringo for requesting this feasibility study. This is a wonderful first step towards gaining park equity for the park for residents of West Long Beach.'",
        "'speaker_2': 'But I'm confident that the feasibility study will find, however, that there are precious few parcels left for developing into open space, one of the largest of which is 3701 Pacific Place. I'm urging this body to halt development by the builder on this site until this feasibility study can be completed.'",
        "'speaker_2': 'Furthermore, in light of the fact that this property factors into the Long Beach River Link plan and the L.A. River Master Plan, which is still under its own secret process, a complete are must be conducted on the site to analyze the biological and cultural resources that are vital to the larger L.A. River community and that will be'",
        "'speaker_2': 'severely affected by industrial activity here. There are at least three precedents in the state of California for an M and B being deemed insufficient, and the government instead opting for the sequel required air. You'll find those precedents in the binder that we presented to your office there in Enclosure three under the letter from Chatterton, Brown, Parsons and'",
        "'speaker_2': 'Minter, environmental lawyer. Thank you.'",
        "'speaker_6': 'Thank you. Our next speaker is one of a.'",
        "'speaker_3': 'I congratulate council members and they got enough in for bringing up this agenda. Item Council Member Austin. As the key author of the item, I am pleased to see you are addressing your campaign commitment that stated with your vote upgrade and improve our space.'",
        "'speaker_3': 'I am supportive of such an item. This can be the start of meaningful action that takes our city from aspiration to implementation. I also encourage that this motion not be limited to just open space but to any vacant land along Gilbert River, private or public studies and plans.'",
        "'speaker_3': 'Years and decades, taxpayer funds, community involvement have clearly shown that there is a desire that only requires the political will to develop action steps and connect the dots, such as the Over the River Revitalization Plan in our city's own River Link plans developed by our Parks Department and approved in 2007 and again reaffirmed by many of you'",
        "'speaker_3': 'in 2015. I would also like to note that the only river master plan identifies the oil operators and former golf driving range as the crown jewel of the Lower Elk River. Over 70 acres of land, which should be at the top of any list, studied the feasibility of acquiring vacant land for park space.'",
        "'speaker_3': 'Again, thank you for bringing this portion to the council because it's not just about dollars and cents or feasibility studies. It's about doing the equitable thing and addressing environmental justice to a community.'",
        "'speaker_6': 'Thank you. Our next speaker is Kyle Scepter teacher.'",
        "'speaker_3': 'Lately, Mr. Mayor and council members. My name is Keith Taber and I'm a resident of the of those neighborhood. I'm also a licensed architect in the state of California, certified by the National Council of Architects Registration Boards and a lead accredited professional.'",
        "'speaker_3': 'I'm here to voice my strong opposition to the 3701 development, and we'll say, in my 30 years of practice, I've never been activated to categorize a development as reckless and irresponsible as this one. And equally short sighted is the paving of the L.A. River.'",
        "'speaker_3': 'I believe that this project deserves the rigor of fully air. Furthermore, the designation of a light industrial zoning central to a residential district I think is negligible. The development's tepid response to its opposition by providing a publicly accessible green space, all with a front row view of an RV parking lot is not equal to or better than'",
        "'speaker_3': 'that of a park parkland, which is the intent of the River Link plan. Our leaders of Long Beach have the responsibility to ensure that a development within the L.A. River watershed are ecologically responsible, promote the proliferation of natural flora and fauna, and benefit the future generations of the communities they serve.'",
        "'speaker_3': 'They must consider the problem zoning districts around and provide equitable greenspace in the community with a deficit 17 times that of this Long Beach. Our City of Long Beach also has an opportunity to set an example for every community along the river.'",
        "'speaker_3': 'They must take that opportunity seriously to the betterment of our region's quality of life. Thank you for listening.'",
        "'speaker_6': 'Think your next speaker is Kimberly Walters.'",
        "'speaker_2': 'Good evening. Thank you so much. Council Members Austin Oranga for getting the city of Long Beach back on track with a long standing Long Beach reveling plan and the Lower Los Angeles River Revitalization Plan. I'm also extremely grateful to Congressman Lowenthal and Assemblymember O'Donnell, who have lent their support to getting Long Beach back on track.'",
        "'speaker_2': 'New field reps are here tonight to support this plan. Our message here is the funding is out there. As has been referenced, there is EPA funding for brownfields cleanup programs that EPA funding for environmental justice grants. Just right now.'",
        "'speaker_2': 'March 12, 2021. California Department of Parks and Recreation has a grant opening for almost $400 million for the statewide park program that could help us acquire these lands. And there's over $30 million available from the RNC specifically for the lower L.A. River from Prop 58 and another $30 million available from the RNC for Prop one for an'",
        "'speaker_2': 'open call for projects. There's also money from the state, from outdoor equity and for land and water conservation, for habitat conservation. So there's also, as you know, money from the county in Measure A and also the port has a great deal of funding that they could put towards this.'",
        "'speaker_2': 'We also removing River Links coalition plan to go for direct philanthropy so that the many millions of dollars it will take to acquire, to make safe and to green these parcels will in fact be feasible. And this is possible.'",
        "'speaker_6': 'Think your next speaker is Shane Weaver.'",
        "'speaker_3': 'You mean honorable mayor and council members? My name is Shane Weaver, Long Beach Road Representative for Assembly Member Patrick O'Donnell. I'm here this evening to speak on behalf of the Assembly Member O'Donnell, support of River Park Coalition's effort to create more create more open space and improve the quality of life for neighbors living near the Los Angeles'",
        "'speaker_3': 'River. Assembly member O'Donnell acknowledges the River Park Coalition's efforts to engage their neighbors in hopes of a better quality of life. Assemblymember O'Donnell has long been involved in securing open space in many parts of the city. The city council member as a member of the San Gabriel Rivers and Mountains Conservancy and as assembly member serving as your'",
        "'speaker_3': 'voice in Sacramento, the member would like to thank those, including councilmember councilmembers Austin, Urunga and Sun House for making this effort a priority. And please consider the Assemblymember your partner in this effort. Together, we can make this happen.'",
        "'speaker_3': 'Thank you. That concludes public comment for the sun.'",
        "'speaker_4': 'Thank you. We are going to go back to the item. Councilman Austin, you have any additional comments before the vote?'",
        "'speaker_3': 'No. I just want to appreciate all the comments from all the public, all my colleagues. And I think staff is clear on on the direction we are looking at repeatability and we're looking at more than one parcel. We're looking at the entire lower L.A. River, the L.A. River in the city of Long Beach, encompassing all of the'",
        "'speaker_3': 'districts in the city. I think it's very, very important, again, that we understand that, that we're looking at a big plan. We're looking at a plan that has and vision that has been in place for for many years.'",
        "'speaker_3': 'We're looking at the complicated parcels. And, you know, I heard some comment, comment that all it requires is political will requires a lot of money to. And so I'll be also in my capacity as a vice chair and a member of the state large committee pursuing state resources and any other resources and grants to work to help'",
        "'speaker_3': 'realize our vision here in the city, as we always have been over the last eight years. Thanks. Mayor. This is City Attorney Park. And may I make a short comment? Sure. Thank you. There was a lot of public.'",
        "'speaker_4': 'Comment this evening on a particular.'",
        "'speaker_3': 'Project, but I just want to point out that project is not before us tonight and is not part of this agenda item and that this is a request to explore possible open space acquisition adjacent to the L.A. River.'",
        "'speaker_3': 'Thank you very much. Thank you very much.'",
        "'speaker_2': 'I can say.'",
        "'speaker_3': 'Something. Roll call vote.'",
        "'speaker_2': 'We need to be able to speak. Well, I guess not so.'",
        "'speaker_4': 'I. I'm sorry, Mr. Clarke. Did we conclude a public comment, Mr. Clarke.'",
        "'speaker_3': 'So.'",
        "'speaker_4': 'Mr. Kirk. Okay. Yes.'",
        "'speaker_6': 'It's public comment.'",
        "'speaker_4': 'I just wanted to make sure that I heard something. Go ahead and roll call.'",
        "'speaker_6': 'Sorry. We have one more person that you missed. Leslie Guertin. Leslie Gerritsen. Leslie. Claire Dirksen, are you there? I can choose for the company.'",
        "'speaker_0': 'We'll do a roll call vote. District one.'",
        "'speaker_1': 'What I.'",
        "'speaker_0': 'District two.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five i. District six. I. District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District eight. Hi. District nine. Motion carries.'",
        "'speaker_4': 'Thank you. Next item, please. 17.'"
    ],
    "Report on Crime and Violence Prevention in Long Beach.": [
        "'speaker_0': 'Communication from Councilwoman Zendejas. Councilwoman Allen. Recommendation to request city manager to work with all appropriate departments to report back within 30 days on violent and quality of life crimes in Long Beach.'",
        "'speaker_4': 'We're going to go in here. Here. The item. Please. I think I'll see. Believe it. CD1 Councilman's.'",
        "'speaker_1': 'Yes. Do we have any public comments? Maybe we can hear those first, Mayor.'",
        "'speaker_4': 'If we don't think we have any public comment on this item.'",
        "'speaker_3': 'Of course, speaker Mr..'",
        "'speaker_0': 'Mr. Perot is on the line.'",
        "'speaker_4': 'Sure. Go ahead.'",
        "'speaker_3': 'Bill. Yes. Thank you. Good evening, Mr. Mayor. Council members. I am Bill Perl. I published Long Beach report dot com a media outlet now in our 21st year providing independent news online all the time and regarding violence in the city of Long Beach.'",
        "'speaker_3': 'As we have reported, the city of Long Beach has crime stats, have gaps, and we urge the council to fix them so you can do. The city of Long Beach, for example, does not list shootings in its official crime stats, but the city of Long Beach.'",
        "'speaker_3': 'But the city of Los Angeles does. L.A. residents can see every month how many shootings there were and where they were. They don't have to rely on Public Records Act requests to get neighborhood crime information. Long Beach buries it shootings with an aggravated assault, which is a category that includes various crimes.'",
        "'speaker_3': 'And the council can fix this. Any of you can. Agenda is an item for future use. It could be in the next week or so to begin listing shootings in long beaches. Official crime stats. We urge you to do so.'",
        "'speaker_3': 'Second, the city of Long Beach no longer lists serious part one Crimes against persons and property by Council District. The city used to routinely do that. It was easy for us to taxpayers to compare what's going on in Council District two with five and seven and nine.'",
        "'speaker_3': 'But that stopped. Elbe PD now only shows crimes by divisions north, south, east and west, which spans which spanned more than one council district and then invites confusion and misinformation. For example, in her official 2018 ballot statements. Councilwoman Mongo took credit for crime decreases that use numbers from East Division that included numbers from council districts three and'",
        "'speaker_3': 'four that weren't part of her council district and five reporting crimes by council district would end the confusion. If there are incumbents on this council who don't want the public to know the facts, let's find out who they are.'",
        "'speaker_3': 'Some council members should agenda is restoring reporting crimes by council districts. And third, this council needs to end the double standard. If a child or adult is shot by a police officer, the city collects and releases data on the person shot to disproportionate impact on various groups.'",
        "'speaker_3': 'But in non-police shootings, which impact historically disadvantaged and working class areas, the crime victim is invisible. This council needs to correct this inequity and begin to compile and release data on the victims of non-police shootings, just as we do for police shootings, because those crime victims matter, too.'",
        "'speaker_3': 'So I must add that there will be a report that has advocated all of these actions constructively and editorially, some for some time, and tonight will show whether the council wants to maintain the status quo or to move to fix things.'",
        "'speaker_3': 'Thanks very much for letting me be heard. Good evening.'",
        "'speaker_6': 'Thank you. That concludes public comment for this item.'",
        "'speaker_1': 'And thank you so much for public comment. And I also want to give a big thanks to all my residents who have been calling in to my office, who have been meeting with me on on this item and who have sent in any comments as well.'",
        "'speaker_1': 'First of all, I know that that this is a very intense item for me. So I really want to thank my colleagues for their help in bringing bringing this forward. Thank you so much, Councilwoman Allen. I know that you know how important this is as US council members, our first priority as is.'",
        "'speaker_1': 'The safety of our residents. And given the recent shootings and other high profile acts of violence in our city, especially in the First District, I felt that I must ensure to my residents that we are doing everything within our power to bring this to an end.'",
        "'speaker_1': 'And so this is why I brought this item forward. I as I said, I know that this is a complicated issue. And there there are no easy ways of doing this, obviously, because if there were, they would have already been found and done.'",
        "'speaker_1': 'That being said, the seriousness of this challenge means that we must find new solutions, renew our existing efforts to keep our community safe and free of violence. And law enforcement must be our first partner in this. And and continues to be.'",
        "'speaker_1': 'But I'm also interested in looking at ways we can work within our neighborhoods to address the root cause of violent crimes. COVID has placed incredible constraints on our ability to maintain programing within communities and provide the necessary opportunities for our residents.'",
        "'speaker_1': 'But we're all now all aware of these gaps that are deadly consequences to our neighbors. And we must find ways to address these needs. I'm grateful that staff has indicated that they will be able to bring this item back on such a quick turnaround.'",
        "'speaker_1': 'I know that it's usually a 90 day turnaround, so I'm so grateful for you accepting to bring this back in 30 days. That means a lot to me and to my residents. I want to make sure that my residents and our residents here in the city of Long Beach know that we hear your concerns.'",
        "'speaker_1': 'And it is absolutely my position and my responsibility as a councilwoman that we find an end to our violent crimes and that we acknowledge that these violent, violent crimes are not acceptable in our city, and they are not and they are intolerable.'",
        "'speaker_1': 'The first district has had history with with violent crimes. But this is not okay. We cannot and I repeat, we cannot normalize this behavior. We we have been having violent crimes for years. And at the beginning of the of my term here in the first District, I saw a lot of violent shootings.'",
        "'speaker_1': 'And I've been working really hard to try to find ways to eliminate that. But all we've been seeing is the uptick in these violent crimes, and it is not okay. I know we have lost a lot of officers and our public safety is at risk.'",
        "'speaker_1': 'You know, for our residents in the first district and I know that, you know, we need more more public safety in in the First District. And I know that that's something that is very important to my residents. And I understand that we we must try to figure out ways to eliminate these violent crimes.'",
        "'speaker_1': 'One of the things that, you know that really upsets me is that every weekend I or even it doesn't have to be during the weekend. You know, I have to be with my fingers crossed hoping that we don't have a shooting that weekend.'",
        "'speaker_1': 'We should not live like that. You know, that's not quality of life. We we as leaders have the responsibility to create safety for our residents, safety for our children. Right now, during this city council meeting, we got a council notification that a 16 year old young male was shot, another shooting while we're in city council meeting.'",
        "'speaker_1': 'This is not acceptable. So I thank the staff for being open to bringing back and bringing back a presentation on what we are already doing to prevent this and and finding new ways and finding new solutions to putting an end to this and also, you know, finding and finding ways to be able to involve the community and'",
        "'speaker_1': 'bring the community in and work together as partners while we eliminate this this violent crime epidemic that's happening not only in the first District, it is happening throughout our city, but we really need to take care of this.'",
        "'speaker_1': 'And so I just want to thank all my residents for all of their support on this item. I want to ensure that to them that, you know, I will continue being their strong voice on this matter. And I look forward to the presentation being presented in 30 days.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you very much. Next up, I have Councilman Sara.'",
        "'speaker_3': 'It's full of germs.'",
        "'speaker_2': 'Thank you, Mayor. I want to thank council member Councilwoman Sunday for bringing this item for it with the support of Councilwoman Allen. I definitely hear and reiterate the concern that council members and I have as my district borders hers and we have the same and increased rate in violence, gun violence as well.'",
        "'speaker_2': 'And I, I believe that we need to make sure we pay attention to this as much as we are doing a lot of work and important needed work around our response to COVID. And but I also want to make sure that they're not separate either, right?'",
        "'speaker_2': 'That we know that a lot of this is connected and there intersected, and that there's also been an increase in how things lead to violence. And some of these cases are interpersonal dispute. And I so I want us to consider also appreciate stop being willing to do a report back in 30 days.'",
        "'speaker_2': 'But I want to make sure that we also take into consideration past report that's been done around violence prevention. I know that we want to make sure we have short term, immediate response to the current rising violence. But I also don't want to and I want to acknowledge and honor the work that's been done for many years'",
        "'speaker_2': 'and what we need to do to prevent and address really also some creating some mid-term and long term approach to this and really also empowering our.'",
        "'speaker_1': 'Community with.'",
        "'speaker_2': 'Some kind of resource because they've also been very inspiring during this pandemic to support and demonstrate kindness is that it shouldn't be limited certainly to just, you know, groceries and other, but that everybody's shown other ways of acts of kindness.'",
        "'speaker_1': 'And I think that this.'",
        "'speaker_2': 'Pandemic has prevented certain level of support. But I also want to think about can we also include all those other methods that we had explored in something like Safe Long Beach violence prevention plan that was certainly created before I closed it.'",
        "'speaker_2': 'But are there some ways we can integrate that into this as a way where we can have a response that doesn't only look at it from a public safety perspective, but also a public health and equity perspective as well.'",
        "'speaker_2': 'So I just wanted to share that and I think staffer, you know, taking this on and your leadership council members and Dana and also to all of the residents and everyone that has been very concerned, we are concerned with you.'",
        "'speaker_2': 'It's it's not a day that goes by that we all doubt that this isn't care, that this is it doesn't rest heavy. It's all heavy on my heart. And I want my residents and to know that I think about this a lot and and looking into ways that we can work together to decrease it and prevent it'",
        "'speaker_2': '. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'Thank you. I'm hoping that when this item comes back in 30 days, it also has the opportunity to touch upon the technological advances that Ms.. Ericsson has made to allow us future greater capabilities in pulling reports. I know that for each community meeting that our commander and lieutenants joined me at, we pull data and statistics for that'",
        "'speaker_2': 'specific neighborhood by crime, and we make sure that they know neighborhood by neighborhood zip code, by zip code where we stand as compared to years before and even a decade before, if that's important to them. So we pull that data, but we've also worked on the technology that's necessary to make the changes so that residents can make'",
        "'speaker_2': 'that pull those reports themselves. I want to thank one of our community members, John, who has worked hand in hand with two of our prior commanders on some of the challenges with the systems that we have, but that there's also progress being made.'",
        "'speaker_2': 'And I think that that would be a valued part of the of the presentation if a maker of the motion is so open to it. Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman Allen.'",
        "'speaker_7': 'Yes, thank you, Mayor. I also was drawn to this item, and I notice that our residents don't feel as safe as they used to. I also want to acknowledge that the 30 days was a, you know, aggressive timeline.'",
        "'speaker_7': 'And I do appreciate the PD for getting this report back to us so quickly and I to look forward to the presentation. I have recently seen the difference in the quality of life and the feeling of security that many of our residents all over Long Beach have long enjoyed.'",
        "'speaker_7': 'And like Councilwoman Sun has said, I think we all as a council bear the responsibility and making sure that our community is safe. I took that oath very seriously when I was a police officer and was seriously injured in a line of duty protecting my community.'",
        "'speaker_7': 'And I take this very seriously now as a councilwoman. And when I look at gun violence is up and I don't want our quality of life and or the feeling of being safe and secure and secure to go back to what I experienced when I was a police officer back in the nineties.'",
        "'speaker_7': 'So, you know, our kids need to feel safe going to school. People need to feel safe playing at the parks or walking to their stores or whatever they do. We just need to have a sense of safety. So I, I just like I said, I care a lot about this.'",
        "'speaker_7': 'I care a lot about the safety of our community and and those who are serving on the front lines. And this will always be a priority to me. Thank you so much.'",
        "'speaker_4': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Thank you. Council member, Sunday House and all the signers on bringing this forward. It's certainly a challenging issue. And Long Beach is committed to violence prevention time and time again and and to the community.'",
        "'speaker_3': 'I just want to just remind just remind you to let folks know that violence prevention, it's a it's a long term it's a long term strategy. It's the process of looking at the conditions that surround a community. Communities in common that have shootings and look at some of the factors are those communities.'",
        "'speaker_3': 'They have a lack of investment. They allow the lack of programing, open space opportunities for, you know, investments into education and and poverty is a lot of times the common thread between these communities. So you all you meet violence prevention.'",
        "'speaker_3': 'Within a public health lens to be coupled with investments into that into those communities. You also need crime suppression, intervention by both law enforcement and and community based organizations that can do intervention. So it is really three dimensional chess.'",
        "'speaker_3': 'What's happening? I think one thing I would highlight is that I believe that the next city council meeting, we're going to see a presentation about a lot of the work that the community has advocated for in terms of youth development, youth strategic plan, our investments in the youth that will now be boosted with measure us and all'",
        "'speaker_3': 'of these things that presentations come to council very soon. And City Council has a previous budget in alignment with the reconciliation plan, just funded additional investments into activating our violence prevention plan. So we've had a plan for some time, but it hasn't had the Stafford investment in this recent budget and the reconciliation funding.'",
        "'speaker_3': 'We funded staff to begin that process of violence prevention. So I think whatever we do in terms of response needs to be balanced with look at the investments we have ongoing. Let's look at the new capacity we built, CARES Act and other things and couple that with the crime suppression strategy.'",
        "'speaker_3': 'So it should be it should be comprehensive because unfortunately, a lot of times when you hear about crime or violence or shooting, it's already happened and it's already too late. And that family's already impacted, their communities already impacted.'",
        "'speaker_3': 'And so we have to make sure it's just like, you know, putting, you know, putting some money towards savings for the future and paying for some bills right now. That's how we have the best in violence prevention. We have to really think about that with all the investments that we make.'",
        "'speaker_3': 'So I look forward to it. Councilmember Sunday House, Thank you for taking the lead on this item. Look forward to supporting this effort. Look forward to jumping in fully and making sure that what we do is real. Thank you so much.'",
        "'speaker_4': 'Catherine Ashton, please.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And I want to appreciate also Councilmember de Haas and Allen for bringing this item forward, because I think it's very important that we have an honest conversation at the city council right now. Crime is really on the rise, particularly violent crime and gun crime in our city every day for for several now months'",
        "'speaker_3': ', it seems like there's been a shooting or multiple shootings. And we can't sugarcoat that. We can't gloss that over. I don't want to put that responsibility on our health department. I would put that responsibility on on anyone other than the the the the our our police officers.'",
        "'speaker_3': 'And they need our support to do this to do their jobs. We have had a violence prevention plan for a few years now. Just a few months ago, we supported and voted for a violence into violence intervention strategy.'",
        "'speaker_3': 'And now we're talking about a crime suppression plan. And I think all our great acronyms and great approaches. And yes, we do need to have a balanced approach, but we need to call this for what it is. You know, this is this is street politics.'",
        "'speaker_3': 'These are these are this is the illicit market. We have we have a gang culture in our city. And we as a city council cannot make excuses for gun violence. We have to come up with the solutions. We need to move the resources.'",
        "'speaker_3': 'We need to get prohibited possessors off the streets and get the guns out of their hands. I mean, I think we just have to call it what it is. It's a problem right now and it's a big problem.'",
        "'speaker_3': 'And and we're not going to get out of it inspired by sugarcoating this. We have to make sure that that our police officers are supported to do their work and to do their jobs and in every area of the city.'",
        "'speaker_3': 'You know, I've asked for our our acting commander ten is able to to increase and chief of police obviously Chief Luna to put more resources in the north long. It's I mean whatever it takes right now to to suppress the strategy of the crime that's happening right now.'",
        "'speaker_3': 'We have to do it this this. This is this is a this is a problem. We have not had crime a crime spree. We have not had violent crime like this in our city in many, many years. And so what we are experiencing now is not normal.'",
        "'speaker_3': 'And and it can't we can't we we have to use unconventional strategies and approaches to to to deal with a very, very unique and unconventional spike in crime. Something is going on. You can see it with the watch commander alerts that we as a city council get every every evening.'",
        "'speaker_3': 'Right. Something is going on. It's different. And, you know, this is this this impacts our ability to to be the city we want to be. This crime is impacting, you know, the quality of life for our residents. It's impacting our ability to attract economic development in key corridors and key areas of our city that we want to'",
        "'speaker_3': 'revitalize. It's an issue that we have to come to grips with honestly in how this conversation about the direction that we want to go in as a city. But I'm happy to support the item.'",
        "'speaker_4': 'That comes from San Diego that you have something additionally.'",
        "'speaker_1': 'Yes, Mayor. I just wanted to thank all of my colleagues for your support on this item. But I also wanted to see if if Chief Luna was available, I know that he might have had a small, brief presentation that I might have missed.'",
        "'speaker_6': 'Yes, Chief Luna's available if he'd like to hear from him.'",
        "'speaker_3': 'Good evening, Mayor, and members of the city council. I am here with all of you tonight listening to every word that all of you are saying very intently. And I did not have a presentation that's going to be set up for 30 days, but I'm available to answer any question you have regarding violent crime or as a'",
        "'speaker_3': 'matter of fact, almost any crime going on in the city. What I do want to emphasize with the comments being made is that even though this report is due in 30 days, we are not sitting on our hands waiting to report out to you what we're doing.'",
        "'speaker_3': 'Yes, we are absolutely, extremely concerned about the shooting activity that happened in 2020. We ended the year not in a good place. We didn't begin this year in a good place. I know that not only the members of my command staff, but I personally lose a lot of sleep over the shootings that occur.'",
        "'speaker_3': 'You have supported us the last several years with neighborhood, safe streets, overtime, money that's already been utilized in some of the locations that you've already spoken about. Some of these hotspots per se, where we're seeing more activity pop up, a very data focus not only on those spots, but individuals that we think are perpetrating a lot of'",
        "'speaker_3': 'these shootings. And I'm looking forward with more time to brief you on a lot of the things that we're seeing that are very problematic. And I'm going to focus on our city, but I don't think I'd be doing my job if I didn't tell all of you that every major city, almost every major city in the United'",
        "'speaker_3': 'States right now has experience, assert a surge in violent crime, specifically murders and nonfatal shootings or hit shootings, as we call them. And you will never hear me make excuses. I'm going to focus on our job here. My job is to stop these shootings.'",
        "'speaker_4': 'Whether I get help or not.'",
        "'speaker_3': 'That's my job. It's our job in the police department. And I welcome meetings, strategies, community input. When I do speak in 30 days, I'll talk about the strategies that we've come up with working with some of our city partners, and I'm really looking forward with a lot of energy.'",
        "'speaker_3': 'I'm ready to go right now. Matter of fact, I wouldn't mind going out in the street right now and working. That's just my passion and the passion of the people that I represent on this police department who come out here 24, seven, seven days a week, putting their lives on the line.'",
        "'speaker_3': 'Shots being fired in a matter what it is. They're taking guns off the street, putting prohibitive possessors. As Councilman Austin stated, he knows because he's worked a lot with me. Our prohibitive possessors, for example, are arrest in 2020 were up over 40%.'",
        "'speaker_3': 'That's people that are out of prison because of COVID, who are carrying guns, who are have no business carrying guns, who are involved in a lot of the criminal activity in our city. And the councilman has nailed it.'",
        "'speaker_3': 'And a lot of our efforts are there. And we'll continue that. And I look forward to making this report out in 30 days. Thank you very much. And I stand ready for any questions any of you may have.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_2': 'Real quick.'",
        "'speaker_1': 'Well, I'm sorry. I have one more comment. Sure.'",
        "'speaker_4': 'Go ahead.'",
        "'speaker_1': 'I just wanted to thank you, Chief Luna. I know that my residents are very, very happy with the interaction that they have with our public safety officers. They're always there. They're always presence there. Are there to answer any questions?'",
        "'speaker_1': 'I know that I've been able to call on them at the spur of the moment to come meet with my residents. And they've been there. And we also know that you've been overworked. A lot of our public safety has been overworked and continues to be overworked.'",
        "'speaker_1': 'And yet you still find ways to provide more resources for us in our district, and we are aware of that. And so we do want to thank you for that. And I believe that, you know, I think that when it comes to these violent crimes and we can't put it all on public safety officers.'",
        "'speaker_1': 'We we as city leaders have to find solutions. This is like. These crimes that are happening. Yes, are happening not only statewide, nationwide, but we need to do something about stopping them in our own backyard. So, you know, I look forward to your presentation in 30 days and I look forward to an action plan for my former'",
        "'speaker_1': 'city staff as to how we can address these violent crimes. And again, I want to thank my residents for always being so active and and being being great neighbors and making sure that we focus on what's happening out in our neighborhoods.'",
        "'speaker_1': 'So thank you.'",
        "'speaker_4': 'Thank you. Vice Mayor, thank you again.'",
        "'speaker_3': 'Then just a question for the chief in the request on chief. Can we make sure? I'd love to. You mentioned some of the issues with respect to folks being let out early with COVID 19 due to COVID 19.'",
        "'speaker_3': 'I'd love to hear more specifically how many of the early release folks been perpetuating these approaches. I'd love to. I'd love to know some specifics. If I. Yes. Or vice mayor, if I hear your question, you want to know how many prisoners have been released due to COVID between L.A. County jail and the state prison system?'",
        "'speaker_3': 'The correlation between that and the violence has happened in the. I don't understand that. So some data to help flesh that point off. Absolutely. I'll be closer to the report if this council chooses to have that information. Thank you.'",
        "'speaker_4': 'Roll call. Vote, please.'",
        "'speaker_0': 'District one I. District two.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four. I District five. I. District six. By district, by district seven.'",
        "'speaker_3': 'By.'",
        "'speaker_0': 'District eight, district nine.'",
        "'speaker_3': 'By.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Update on Health Orders, Vaccine Rollout and Hospital Capacity.": [
        "'speaker_4': 'Thank you. And item 18, please. And I think I am 18. Oh, no, that's different. Now, I know we probably heard a lot of that in the study session, but it is a separate item. So can we just hear that item?'",
        "'speaker_4': 'And then Councilman Mango, if you want to make a motion on that.'",
        "'speaker_0': 'Communication from Councilwoman Mango Councilwoman Price Recommendation, direct city manager and Health Department to provide an update on the latest changes to the state and local health orders, the status of our vaccine rollout, and how residents and businesses may be impacted.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Okay. Thank you. Do I have anything else on that?'",
        "'speaker_2': 'No. I just wanted to say that I really appreciate. As I mentioned earlier tonight, I brought forward this item before the city staff agenda as the vaccination rollout. I think that the information was valuable. All our colleagues have an opportunity to pose their questions and bring forward questions from the community.'",
        "'speaker_2': 'And I want you to know how important that has been. But we've really crossed a couple of great barriers in the last year in terms of being able to look at and understand how we can communicate better with the community.'",
        "'speaker_2': 'As a lot of families have cut the cord, we hadn't had the opportunity to.'",
        "'speaker_3': 'Reach.'",
        "'speaker_2': 'Those individuals through Channel 13, through a council meeting. But now with council meetings on YouTube, it makes it for a wide range of people to see and play back what has happened at city council meetings. And so I feel that it's really important to have presentations like the one we had tonight.'",
        "'speaker_2': 'So with that, I'm comfortable with this item as it is moving forward without any additional staff presentation, but I hope that we will have regular briefings so that we won't have to consolidate so much information in a two hour presentation, but perhaps more regular short updates as changes occur.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'There's a second by Councilwoman Price to everything.'",
        "'speaker_2': 'Councilman Price I did just want to acknowledge one thing that wasn't covered in the study session earlier, and that is when the governor lifted the regional stay at home order, the city had the opportunity to prepare its own health orders, and I wanted to acknowledge that our city did that.'",
        "'speaker_2': 'It made its very specific health orders very swiftly and did so independently, of course, in collaboration and consultation with other cities and health jurisdictions in the county. But I really appreciate that we made it our own and that we followed the state.'",
        "'speaker_2': 'I thought that really showed a lot of independence as a city with our own health jurisdiction. And I thought it really showed that our health department was listening and trying very, very hard to do the difficult balance of maintaining the public health concerns at the forefront of their health orders, but also acknowledging some of the small business'",
        "'speaker_2': 'impacts and job impacts that residents were facing. So I just wanted to acknowledge that it's not lost on me that our health department acted swiftly and did so independently while still collaborating with other jurisdictions in the region. So thank you for that.'",
        "'speaker_4': 'Councilman Mongo.'",
        "'speaker_2': 'Thank you. And then I just had I know that a lot of businesses have reached out to the Forbes line to provide some feedback and some suggestions related to some recent updates that they've had some challenges with either being able to implement and or needing support.'",
        "'speaker_2': 'Do you anticipate that any adjustments will be made in the next week or two weeks? What is that timeline looking like in terms of being able to receive the feedback from the community and for the Health Department to take into consideration these additional ideas that have come forward?'",
        "'speaker_4': 'Mr. Modica.'",
        "'speaker_6': 'Yeah. So health orders don't really have a time. We don't update them like every week or so we update them as the need persists. So if we do have tweaks that need to be done to our health order, our attorney helps to draft those and put those out.'",
        "'speaker_6': 'We are looking right now about how to get information out to businesses about how to do Superbowl safely, for example. So we'll be communicating on that to make sure that we've got as few crowds and gatherings as possible.'",
        "'speaker_6': 'We have established in contact with the Restaurant Association and are in discussions with them about just how to make sure that we have the appropriate distance between people and any kind of nuances there that we can do within the state to to implement that.'",
        "'speaker_6': 'But we do need to follow state state guidance. We can't be any less permissive than what the state allows.'",
        "'speaker_2': 'And do we still have a direct communication with the state? So for example, I know there was some discussions related to, okay, six feet apart tables versus eight feet apart tables and what other things could be valued like partitions that wouldn't make eight feet apart, tables necessary floor to ceiling, glass or plastic, things like that that have'",
        "'speaker_2': 'come forward. Are those being considered and what is the the strategy on communicating that back to the community?'",
        "'speaker_6': 'Yeah, so we do have the ability to ask questions of the state. They have also changed some of their own regulations. So where before they had said plexiglass was, you know, allowed, especially indoors as a suitable barrier, they don't say that anymore.'",
        "'speaker_6': 'And as we did the research, we are not finding that they have the but we do have the ability to use plexiglass as a alternative to the six feet. The eight foot is our way to ensure that we're meeting the six feet.'",
        "'speaker_6': 'We often see tables that are six feet apart, but when you put chairs on either side, then that makes it four feet apart because you push your take your chair away two feet. So that is our own local interpretation of achieving that six foot distance if there's different ways to phrase it or work on that.'",
        "'speaker_6': 'What we're really trying to accomplish is keeping people the minimum six feet away from other tables and other people, just as we do in every other industry.'",
        "'speaker_2': 'That's great. And then my last question also comes from the community related to waivers for school reopening. Is there been any progress or update on that?'",
        "'speaker_6': 'So Kelly covered this. She would do it better than I would. But we I believe in the presentation. It says we do not have any more waivers. So in purple. The waivers go away, but you have to be below 25 per thousand in order to open up school.'",
        "'speaker_6': 'So it is now that program has ended. We now you have to get down to 25 cases per hundred thousand for five consecutive days and then school districts can submit that safety plan and it goes through both local and state approval and it's only for K through six where you can still have the Cohorting and all those'",
        "'speaker_6': 'different guidances as well. That still remains.'",
        "'speaker_2': 'I appreciate that. I know you and I have talked about that one on one. There's a concentration of schools and church based schools in my district, and I really appreciate you providing that. And we will, of course, provide a link to this information in our newsletter, as always.'",
        "'speaker_2': 'Thank you so much.'",
        "'speaker_4': 'Roll call. Vote, please.'",
        "'speaker_0': 'District one. District two i. District three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five. I. District six.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District seven. I. District eight.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine. Motion carries.'",
        "'speaker_4': 'Okay. Thank you. That concludes the meeting. We do have, I think maybe two members that have a closing comment, Councilor Murray, Ringo.'"
    ]
}