{
    "Resolution to Modify Development Impact Fee for ADUs.": [
        "'speaker_2': 'Report from Development Services recommendation to receive supporting documentation under the record, conclude the public hearing and accept statutory exemption. 17 Dash 136 Declare ordinance amending the Long Beach Municipal Code relating to A2 use read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_2': 'Adopt a resolution to submit a request to the California Coastal Commission to certify and amend amendment to the Certified Local Coastal Program and adopt a resolution modifying the established development impact fee structure for 80 use citywide.'",
        "'speaker_1': 'Thank you. Stay safe. Thank you, Mr. Mayor. For this item, we will have a staff presentation from Linda Tatum, our planning bureau manager, and Carrie Tai, our current planning officer.'",
        "'speaker_3': 'I'd like to introduce Carrie Tai, who will make the staff presentation for this item. Carrie has been assisted by the rest of our project team. Scott, Kinsey and Alexa.'",
        "'speaker_0': 'Carrie.'",
        "'speaker_6': 'Thank you. Good evening. Honorable Mayor Garcia and members of the city council. This is a continued public hearing from October 10th, 2017, and it's regarding a city initiated ordinance pertaining to local regulations for accessory dwelling units, which, as you know, the state of California required requires local jurisdictions to allow.'",
        "'speaker_6': 'I'm going to do a very brief background just for the benefit of the audience. But basically last year there were a series of state laws that were passed and that took effect January 1st of this year. And those laws mandated that local jurisdiction, local jurisdictions approve accessory dwelling units if they meet a certain set of standards.'",
        "'speaker_6': 'And it also prohibits cities from largely requiring parking for those accessory dwelling units. However, state law does allow for cities to adopt local ordinances to refine the state regulations, and that's what the staff is proposing at this point.'",
        "'speaker_6': 'Local ordinances have the ability to regulate lot size, the size of accessory dwelling units, processing requirements, and also details such as development impact fees and covenants that restrict the use of that accessory dwelling unit. So on July 6th, 2017, the Planning Commission forwarded a recommendation to the City Council to adopt a local accessory dwelling unit ordinance.'",
        "'speaker_6': 'The City Council conducted a public hearing on this item on October 10th, where the Council considered the Planning Commission's recommendation and also took public testimony via a public hearing. After City Council deliberation, the Council continued the item and requested that staff change several proposed standards.'",
        "'speaker_6': 'Those standards are minimum lot size, so to increase the minimum lot area for a property to be eligible for construction of an accessory dwelling unit from 4800 square feet to 5200 square feet. The second item was to increase the required open space from 25% of the gross floor area of the accessory dwelling unit to 30%.'",
        "'speaker_6': 'The third change was to reduce the maximum accessory dwelling unit size to 50% of the gross floor area of the primary dwelling or 800 square feet, whichever is less. And the Planning Commission recommendation, just to remind everybody, was 1000 square feet.'",
        "'speaker_6': 'So the council asked us to reduce that. And lastly, the council asked us to look at requiring parking for accessory dwelling units in preferential parking districts. So I will talk a little bit about that. So the table on the screen as well as in the staff report details the standards that are in the proposed local ordinance as'",
        "'speaker_6': 'compared to state law. And as you can see, the list of standards includes minimum lot size, a lot with a light coverage, floor area ratio, etc.. The items highlighted in red are the city council requested changes to the Planning Commission's recommendation and so the minimum lot size at 5200 square feet and the open space at 30% of'",
        "'speaker_6': 'the size of the accessory dwelling unit. And there.'",
        "'speaker_3': 'We also.'",
        "'speaker_6': 'Had a pretty extensive discussion on generally the number of units, number of properties with single family homes that would be able to construct an accessory dwelling unit. And based on the lot size alone and not taking other details into consideration like light configuration, light shape.'",
        "'speaker_6': 'About roughly two thirds of residential lots with single family homes in the city could possibly be eligible for an accessory dwelling unit, but that's based solely on lot size. As mentioned, the Council also amended the Planning Commission's recommendation for maximum accessory dwelling unit size.'",
        "'speaker_6': 'There are two types of accessory dwelling units attached and detached, and this would mean that an accessory dwelling unit that is attached to a primary single family home would be limited to 50% of the size of the single family home or 800 square feet, whichever is less.'",
        "'speaker_6': 'There are some exceptions for if the primary dwelling unit is is particularly small, but that that would allow an accessory dwelling unit of at least 640 square feet and then all detached ones would be limited to 800 square feet.'",
        "'speaker_6': 'So with regard to parking districts, as discussed in the staff report and at the prior public hearing, all the state law included many provisions about how cities can regulate parking. One of those is that any accessory dwelling unit located within a half mile of public transit does not require parking.'",
        "'speaker_6': 'In fact, the state just does not allow the city to require parking. However, certain areas such as the coastal zone and the designated parking impacted area because required findings have to be made that not requiring parking for accessory dwelling units may negatively impact those areas based on their physical characteristics and their development patterns.'",
        "'speaker_6': 'The local ordinance does does propose to require one parking space per accessory dwelling unit. So the difference in the preferential parking districts which the city council asked us to look at.'",
        "'speaker_3': 'At.'",
        "'speaker_6': 'These districts, differ from parking impacted areas in the sense that they're the way they're created. They are, rather than physical characteristics, they are potentially impacted by nonresidential uses in the nearby proximity that have the potential to negatively impact the on street parking during certain, whether it's business hours or whether it's operating hours.'",
        "'speaker_6': 'Of those nonresidential uses, the presence of the parking permits ensures that the residential neighborhoods remain available for residential parking, and by definition, they don't share the same physical characteristics that the parking impacted areas do. And because of this, the the imposition of a parking requirement in preferential parking districts on accessory dwelling units would not be consistent with'",
        "'speaker_6': 'the provisions of of of state law on how cities could require parking for these uses. So therefore the parking requirements, as proposed in the local ordinance would remain essentially as proposed by the Planning Commission with one with one change.'",
        "'speaker_6': 'And I will mention there was a recent state law that was adopted in October, which now limits cities to one parking space per accessory dwelling unit, whether it's in the coastal zone or otherwise. And so that requirement will stand.'",
        "'speaker_6': 'And then I should also mention that there is required replacement parking required for anybody who converts their garage to be an accessory dwelling unit. That replacement parking does not have to be in a garage. It can be in another exterior configuration and it can also be tandem, and that is detailed in the ordinance.'",
        "'speaker_6': 'There are other accessory dwelling unit standards that ensure that the inclusion of accessory dwelling units will be consistent with residential neighborhoods, and some of those include exterior modifications to ensure that these units are architecturally compatible with their primary dwelling and also that there are privacy standards when we when we review the location of these accessory dwelling units'",
        "'speaker_6': '. Lastly, I did mention that there are covenants that are required on accessory dwelling units. The owner must live on the property or if the entire property is leased out, then one tenant, one party, if you will, would be limited to living on that on that site, even though there's two units.'",
        "'speaker_6': 'And that would be something that the property owner has to sign to agree to. The other two provisions would be that short term rental of the units is prohibited and by short term that's less than 30 days. So in the in the commonly understood as things like Airbnb that would be prohibited and also the covenant would restrict'",
        "'speaker_6': 'the accessory dwelling unit from being sold separately. I mentioned development impact fees. The new development in in the city pays development impact fees. The state law requires that impact fees be commensurate with the scale and demands of the proposed improvements.'",
        "'speaker_6': 'And then given that accessory dwelling units are limited to a smaller scale, they're accessory in nature and they're allowed in more limited circumstances. The staff is proposing that a development impact fee that is proportionate to accessory dwelling units a, b be implemented.'",
        "'speaker_6': 'And so included in your action in your item tonight is a resolution to adopt development impact fees that are commensurate for the size of accessory dwelling units. So with that stuff is recommending that the City Council adopt the Planning Commission's recommendation as amended by your direction from the October 10th meeting for minimum lot size, minimum open space'",
        "'speaker_6': 'requirements and maximum unit size, as well as adoption of the resolution for development impact fees. And I should mention, because this is a zoning code amendment, there is also a resolution that would direct the Director of Development Services to forward this on to the California Coastal Commission for Certification.'",
        "'speaker_6': 'So that concludes staff's item. And we can any we can address any questions you have. Thank you.'",
        "'speaker_1': 'Okay. Thank you. We have a motion in a second on this item. Councilwoman Price.'",
        "'speaker_5': 'Thank you. I want to thank staff for incorporating the amendments that the City Council provided direction on the last time we were addressing this topic. And I think it's it's very clear that this was an issue that we received a great deal of community feedback on.'",
        "'speaker_5': 'And the proposal that came to us from the Planning Commission really did not, although it was well thought out, it really did not take into account some of the concerns that we heard from our residents. So I appreciate you making the modifications that you did.'",
        "'speaker_5': 'And I'm much more comfortable today with where we stand in terms of our local regulations then than I was before. These amendments were made much more comfortable. I do have a few follow up questions on the two thirds calculation that you provided for us regarding the number of units, residential units that might qualify.'",
        "'speaker_5': 'That's based strictly on the 5200 square foot calculation, right?'",
        "'speaker_6': 'Yes, that is correct. And it's based solely on lot size, with no regard for the way the property's currently developed or the way the property is shaped.'",
        "'speaker_5': 'Okay. So if someone were to build an accessory dwelling unit on their property, they would have to comply with all the other regulations that we have, such as setbacks, height, open space, all those additional things in order to even be eligible to build one.'",
        "'speaker_6': 'Yes, that is correct.'",
        "'speaker_5': 'And we haven't done a calculation of how many properties in the city because we don't know how all of those two thirds of those homes, how they're structured currently.'",
        "'speaker_6': 'That is correct. There are many, many, many different variations in those configurations.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'So I think that's a really important qualifier. And I want to highlight it that we're not saying that two thirds of the homes in the city, residential homes in the city could could have accessory dwelling units that based on lot size alone.'",
        "'speaker_5': 'And none of the other factors that are part of our development standards, such as setbacks, building heights, open space, all of those things, those are not factored into that very rough estimate. The other thing that I wanted to ask is how are we going to be tracking the development of these properties so that we can study the'",
        "'speaker_5': 'rate and the locations of the buildings and so that we can make sure they're being built to standard standards and continually updated.'",
        "'speaker_6': 'Thank you for your question on the on the issue of tracking the city does because all the accessory dwelling units require building permits the administration of building permits is done through our electronic permit tracking system. So we are able to tell which properties have accessory dwelling units.'",
        "'speaker_6': 'And also it acts as a repository for us to store the covenants that every property is also required to to sign and record. So we have copies of those as well. But we have a way to we will have a way to track them and also track the size of them where they were approved.'",
        "'speaker_6': 'And that way we could verify later on if something were to change.'",
        "'speaker_5': 'Okay. Is that when people apply for a building permit, will they be able to identify on the actual permit that this is an accessory dwelling unit?'",
        "'speaker_6': 'Yes, absolutely. That's required to be identified.'",
        "'speaker_5': 'Is it possible for council to get a report back on an annual basis of how many accessory dwelling unit applications we've received?'",
        "'speaker_3': 'Yes, we certainly can do that. And we will make a tickler to do so.'",
        "'speaker_5': 'One.'",
        "'speaker_3': 'Year after the effective date.'",
        "'speaker_5': 'Of the ordinance. And I would just.'",
        "'speaker_3': 'Note that staff is also interested in knowing the volume that's really important for the city's housing inventory. So we'd like to have a handle.'",
        "'speaker_5': 'On that number as well. That's great. And then towards that end, since this is a bill building permit process, will the neighbors in the vicinity get notifications when there's a building permit filed for an accessory dwelling unit?'",
        "'speaker_3': 'No, a any residential development is a what we call a ministerial approval, and it's allowed by right by the code. So there is absolutely no requirement for noticing of any neighbors on the any proposal.'",
        "'speaker_5': 'Okay. But the annual report would give us hopefully it could be designated or it could be categorized such that we know maybe what districts, the permits, whatever.'",
        "'speaker_3': 'We can certainly do that. Yes, that would be great. Okay.'",
        "'speaker_1': 'Kate. Thank you. So you mean that emotion?'",
        "'speaker_5': 'That's emotion.'",
        "'speaker_1': 'Yes. And second wave, actually. Richardson, vice mayor. Thank you. I'll just be brief. I know we had an opportunity to have a robust conversation on this and just to refocus it. We know that people are already sort of living in substandard situations, garages, things like this.'",
        "'speaker_1': 'Growth is already happening. This just allows us to grow in a way that's not haphazard and is safer. And and along with, you know, it goes along with with existing building codes and safety codes. So the state, you know, has has required cities to do this and take a good look.'",
        "'speaker_1': 'All the cities are figuring out what to do or how to how to address this, whether or not to comply with the state and and what that looks like. And I think that we've tried to have a measured approach and really figure this out.'",
        "'speaker_1': 'So good job on staff and I'm going to be voting in support of this tonight. Thank you, Councilman Mongo.'",
        "'speaker_3': 'I want to thank staff for the work they did. I, too, have some questions. On page seven, you talk about the parking required under the amendments to state law. You said same of the existing number of spaces for primary dwelling.'",
        "'speaker_3': 'What are those for a standard single family residence right now?'",
        "'speaker_6': 'Thank you for your question. Council Member.'",
        "'speaker_3': 'Mongo.'",
        "'speaker_6': 'On page seven. I'm trying to find your.'",
        "'speaker_3': 'The reference here. Here's the box for the ADAS in the coastal zone parking at one. And then on the right side of this primary dwelling, same as existing number of spaces. Is that chart reflecting that? If you have a single family home today, you're required to have x number of parking spaces.'",
        "'speaker_6': 'For for the replacement parking? Yes. If you're if you're a single family home and you have two spaces and you convert your garage, you must provide two replacement spaces. And that's why it's the same as the primary dwelling unit.'",
        "'speaker_3': 'So tourist placement spaces in addition to the two driveway spaces. A the drive. Not every home has a driveway. Right.'",
        "'speaker_6': 'So if you cannot if you cannot provide replacement parking, your property is not eligible to to be converted.'",
        "'speaker_3': 'So this has come up a few times from residents in our district because in the fifth District, a lot of the homes are built where there's, say, a31 on the front and all the Douglas homes at the time when they were built.'",
        "'speaker_3': 'And then there's a long driveway to a two car garage in the back. So if that two car garage was converted, they already have a considerable number of spaces that they may or may not use for parking. So tell me how that works.'",
        "'speaker_6': 'In that configuration. Thank you. In that configuration, the long driveway would act as the tandem parking spaces that would serve as the replacement spaces for the garage that was converted.'",
        "'speaker_3': 'So it would it would be not replacing spaces. It would be acknowledging spaces that existed but were not required before. Right.'",
        "'speaker_6': 'The spaces that exist in the driveway at one, at one point were excess and in excess of the spaces that were in the garage. And now the excess spaces turn into the required spaces. That is correct.'",
        "'speaker_3': 'And. So if someone like that added an accessory dwelling unit separate from the garage, they would be required to add one of those spaces, theoretically as an extension of a replacement space or an additional space.'",
        "'speaker_6': 'A No. If the property is within a half mile of a transit stop, a parking would not be required for the accessory dwelling unit. And therefore, if they converted a portion of the primary unit to the accessory dwelling unit and the garage remained, they would not need to provide additional parking at all.'",
        "'speaker_3': 'So you say a transit stop, but in other legislation that's been discussed these days, it's a transit corridor. Is this a transit stop or is it a transit stop that has access every 15 minutes or every 8 minutes or what?'",
        "'speaker_6': 'We discussed the accessory dwelling unit legislation is is does not define the transit priority area or transit corridor like some of the other legislation or legislative documents do. The transit stop is simply the stop, and it does not define the headway or the frequency of service.'",
        "'speaker_3': 'Do we have a map? I'm sorry? Do we have a map that shows any and all locations that are not within a half a mile of a transit stop in the city? There is there is an exhibit in the staff report.'",
        "'speaker_3': 'But I can summarize by saying that fully 98% plus of the city is actually covered by is proximity to a transit stop. That was going to be my guess. So I think that there's one last question. People who currently have illegal accessory dwelling units or that they were built not through a permit process before this was built'",
        "'speaker_3': ', what is the process that would be that they would undergo to become a acknowledged accessory dwelling unit?'",
        "'speaker_6': 'If they have if they currently have an illegal conversion, they would have to come in and undergo the same process that somebody who didn't have anything at all would have to go through. And if if the case was that their property in some way, shape or form did not qualify for that accessory dwelling unit, they would have'",
        "'speaker_6': 'to take corrective actions to return that to whatever purpose it was, if it was a garage or if it was a portion of their their home. That is a single family property that only allows one unit. They would have to correct it to that state.'",
        "'speaker_3': 'And how are you going to be able to inspect some of the standards, considering that the walls are already closed up and you can't see the electrical and all those things are now hidden inside the walls?'",
        "'speaker_6': 'As part of any permit to legalize an illegal conversion. The inspector, the building inspectors have to be able to verify that the construction was done in accordance with the current building codes. And if that necessitates opening up an illegally constructed wall, that is something that the property owner would have to undertake in order for the inspectors to'",
        "'speaker_6': 'verify what is behind the wall. And that includes not only the construction of walls, but things like wiring and things like plumbing, all of which, if not constructed properly, have the potential to be dangerous.'",
        "'speaker_3': 'So I appreciate the changes that were made when this came to the council the first time. We didn't have all the information because not every city had taken on this this challenge yet. Last night at the city council meeting in Pasadena, they had a very robust discussion.'",
        "'speaker_3': 'One of their council members had actually gone on a ride along with their fire chief and responded to a fire at an accessory dwelling unit. And so what are the egress and ingress requirements for an accessory dwelling unit?'",
        "'speaker_3': 'Are they significantly similar to that of a duplex? What what protections do we have?'",
        "'speaker_6': 'The building code requirements for an accessory dwelling unit are the same as those for a residential habitable space. And not being a building inspector myself and I do know that there are certain window exits and certain door exits that are required, but it's in the same fashion that a residential single family home would be or any any'",
        "'speaker_6': 'unit, any duplex, but any unit.'",
        "'speaker_0': 'And if I can just add to that for those adus where they are actually converting a space within their existing home to the ADU, that does require a separate entry exit. So it would be a standalone unit even though it's within the existing space.'",
        "'speaker_0': 'So there would be a door and appropriate windows.'",
        "'speaker_3': 'Thank you. So one of the things that I felt strongly about when we discussed this the first time was putting two thirds of our housing inventory into this program when we haven't had the time to think it through yet and see the potential implications.'",
        "'speaker_3': 'I moved it specifically from 5000 square feet per lot and made that motion to move it up to 5200 and actually even higher than that at the time because there weren't other comparable cities that were doing more. After last night's council meeting.'",
        "'speaker_3': 'The city of Pasadena approved 7400 square feet lots. To receive an accessory dwelling unit. And so I'd like to propose a friendly amendment to my colleagues of increasing the size of the lot up to 7400 with the option a year from now after our first report to adjust that number so we can see how many people are'",
        "'speaker_3': 'going to take advantage of this, what that looks like, how popular it is and then. I'd like to hear from my colleagues on their thoughts on the process.'",
        "'speaker_5': 'So that's not a friendly that I'm willing to accept at this time. This is frankly, this is a discussion that we've been having collectively for a period of time. And I really think that if we're going to completely change what we've started in terms of our discussion with staff, then we all need time to once again go'",
        "'speaker_5': 'out and do outreach with our communities and also talk with staff about what the pros and cons of changing the maximum square footage would be. The last time it actually was 4800 square feet. Councilwoman Price, I mean, Councilwoman Margo Adams.'",
        "'speaker_5': 'I'm talking to myself.'",
        "'speaker_3': 'Everyone who's been called.'",
        "'speaker_5': 'Count and you you increased it to 5200, which I think is a huge step in the right direction. And I think that is definitely something that we vetted with our communities. And, you know, this is a mandate that has been given to us by the state and recognized as a state issue.'",
        "'speaker_5': 'And I think we're doing our best to work within that framework. And frankly, while I appreciate what the city of Pasadena has done, I think it's important for us to do what is best for the city of Long Beach, knowing the geographic and demographic composition that we have in light of all of the different factors that we'",
        "'speaker_5': 'have to consider in terms of our housing needs and our opportunities for housing. So I'm not comfortable accepting that friendly at this time because frankly, we have not done any outreach with our communities or city staff about it.'",
        "'speaker_5': 'And it's to me, it's not an appropriate friendly to be making at this at this juncture, but that's my personal opinion.'",
        "'speaker_3': 'Well, I think it's quite appropriate. The data related to two thirds of the properties being available in the 5200 square feet is also new information. And the original analysis came forward with comparisons of other cities that had done like things.'",
        "'speaker_3': 'And so as more cities come on board, that is going to be additional information. And I'm not encouraging us to delay in any way. I'm just saying that if we were to bump it up to 7400 square feet tonight with a six month or 12 month option to relook at this, it would not.'",
        "'speaker_3': 'There's a few we don't even know what the percentages. But I'm saying that to give that many options in communities, especially after recently finding out what is or is not available within parking, because I know that the parking designated area is now a whole new component that parts of our district that currently would have been subject are'",
        "'speaker_3': 'no longer subject. So I appreciate your answer and I will consider my options. Thank you.'",
        "'speaker_1': 'Councilmember Super. Now, thank you. I just have a follow up to the garage conversion point that Councilwoman Mango brought up. I, I brought it up at the last meeting, but I think it bears repeating and that is if one is to convert an existing garage, let's say a single garage with a single driveway to a bedroom or'",
        "'speaker_1': 'a family room. Once that conversion is made, that pad, that driveway goes away as a place to park. If it's converted as an adu, then you get credited for a place to park. Is that still correct?'",
        "'speaker_6': 'Uh, Councilman Supernova. Thank you for your question. Yes. Just to clarify. If the garage is converted into an accessory dwelling unit, the driveway must be available for replacement parking. That is part. That is because the state provision regulates our ability to require, let's say, another garage or and some other kind of enclosed parking.'",
        "'speaker_6': 'We have to we have to allow any open configuration. So that essentially forces us to allow people to use their existing driveway if they were to convert that garage into an accessory dwelling unit. And you're right, it may not be the same situation.'",
        "'speaker_6': 'If somebody simply converts their garage for some other purpose, it would be specific to accessory dwelling units.'",
        "'speaker_1': 'Right. And the reality is, as a council office, we might get a phone call, hey, me and my neighbors parking in this illegal spot and then we have to respond. Well, actually, it's an adu, so they can't park there.'",
        "'speaker_1': 'Okay. The other point I wanted to make was a follow up to Councilman Price's point about the annual report. If we could have that include maybe applications, since it is a new program, let's see if people are applying, not making efforts, falling through the cracks and all the data, I think would be helpful.'",
        "'speaker_3': 'We can certainly provide a pretty robust information regarding the number of applications, the number approved, and we're happy to compile that and get it back to you.'",
        "'speaker_1': 'Okay. Thank you. And my last point is just kind of clerical on the slide number six on the parking districts. One statement about PDS says that it's a self-selected process which requires majority consent by property owners. And I don't mean to be too picky here, but it requires a supermajority that is 66% and actually not property owners'",
        "'speaker_1': ', but any resident. So the reason that's key that it's just come up with our office with public works. I just like to make sure that if my version is correct, let's make sure we get development services well, public works, but specifically traffic engineering and the city attorney's office on the same page.'",
        "'speaker_1': 'Thank you. Thank you, Councilmember Austin.'",
        "'speaker_7': 'Yes.'",
        "'speaker_1': 'So.'",
        "'speaker_7': 'Staff, I just want to thank you for for the for the great work. And with this has been an issue that we've been looking at for several months in response to state legislation and to gain local control over our own land use within our city.'",
        "'speaker_7': 'Quickly, I just wanted to just just state that on any given Tuesday night, we can change an ordinance here. Is that correct? Related to what we're doing with accessory dwelling units.'",
        "'speaker_3': 'Well, with proper noticing and the like. Yes.'",
        "'speaker_7': 'So. So my month.'",
        "'speaker_5': 'And planning.'",
        "'speaker_3': 'Commission of consideration.'",
        "'speaker_7': 'So this is a journey. Not not. We we may find things along the way that we want to tweak as a city council, right?'",
        "'speaker_0': 'That is correct.'",
        "'speaker_7': 'Want to be clear on that because we don't have to do it all tonight.'",
        "'speaker_3': 'That is correct.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_3': 'They appreciate that you mentioned that component. And so if we agreed to 7400 tonight and in two or three weeks, we found out that the number of units wasn't enough or any of those things. We would have those protections in place for neighbors, but that we could always reduce it.'",
        "'speaker_3': 'It's easier to reduce the square footage than to increase it. Is that correct, Ms.. Tatum? I think that once you set up an expectation for a higher threshold.'",
        "'speaker_5': 'It may be a little.'",
        "'speaker_3': 'Bit more difficult. But in either case, it's still an ordinance.'",
        "'speaker_5': 'And that ordinance would.'",
        "'speaker_3': 'Have to go through as Councilmember Price's noted kind of public outreach staff research and and then going to planning commission and the city council. But yes, you are correct that the process is essentially the same. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Pierce.'",
        "'speaker_4': 'Yes. I just wanted to take what staff has said. And for me, it's easier for us to start with a small and then go larger. So if we came back in a year and then added to. I think that that makes a lot more sense to be able to go through that process.'",
        "'speaker_4': 'And so particularly in my district where the lot sizes are so much smaller and more challenging. So thank you.'",
        "'speaker_1': 'Johnson Mango.'",
        "'speaker_3': 'So I guess the opposite is what I was thinking, because what I wouldn't want to do is offer a program and then take it away from people. And so that's why I was thinking if you started at 7400, there's a group of people that all have access to it.'",
        "'speaker_3': 'We could evaluate it and then you could expand the program. But if you started with 5200 and anyone had access and then you took it away and there were people in a process already, I would worry about the equity of the options.'",
        "'speaker_3': 'And then I would also say that maybe as a counter option, is there any kind of noticing that would be appropriate that we could write into the ordinance? Say, for instance, I heard Councilwoman Price was interested in noticing if it's between 5270 400, could there be a noticing process or something like that so that people know where'",
        "'speaker_3': 'these are and as they're coming online?'",
        "'speaker_0': 'If I can try to answer that question that when the state impose these requirements, the basic requirement for 80 use on local jurisdictions, they made it clear that they wanted it to be a ministerial process because in the past, when cities had these types of ordinances, typically they were done by public hearing, right?'",
        "'speaker_0': 'And they made findings that that made it difficult, in fact, to convert a space or build a space as a do you. So they allowed us to do a certain limited amount of standards in lieu of a discretionary public hearing.'",
        "'speaker_0': 'So it really has to be, by state law, a ministerial process with no notice provided, you know, there's no it's still on notice, but they have to meet all of the criteria in the ordinance.'",
        "'speaker_3': 'But wouldn't it be possible to write an ordinance that is for 7400 feet and above that is ministerial in nature and meet the requirements of the state and then create a secondary process for others that would be non-ministerial or is it going to be an overarching umbrella now?'",
        "'speaker_0': 'It's an overarching umbrella, I understand.'",
        "'speaker_3': 'Okay. Well, my community had communicated their desire for me to pursue this, and I can hear from my colleagues comments that it would not have enough support. So I appreciate the efforts. And I wanted my community to know that I continue to hear them and fight for them.'",
        "'speaker_1': 'Thank you. There's a motion on the floor by Councilman Price, Ambassador Richardson. I just want to catch someone pricing the vice mayor strongly support Pacific. I want to thank staff. We're working very hard on getting us to this place.'",
        "'speaker_1': 'And I want to thank the council for I know the numerous conversations around what's a difficult issue, but certainly a state mandate, but but also very issue that we want to make sure we get right and provide access for these opportunities for families and homeowners across Long Beach.'",
        "'speaker_1': 'And so with them members, please go ahead. And Castro votes. Public comment. Mayor, I'm so sorry about that. And this is a hearing. So actually, let me let me back that up. So there's a motion on the second floor and let me close our deliberation and please go to public comment.'",
        "'speaker_1': 'Any public comment on accessory dwelling units?'",
        "'speaker_8': 'Good evening, Counsel. Larry Boland. At a previous time, I mentioned to you that the old granny housing ordinance that we had put all of these accessory units at the back, 50% of the lot. And what that does is it prevents all the front facing garages not to have a front door that's right on to the driveway.'",
        "'speaker_8': 'That's right under the street because so people could use it at the front door. Areas of patio put up their umbrella and their barbecue. And when we go, the only released common sense way to accommodate this is to protect the facades of the r-1.'",
        "'speaker_8': 'And let's call this what it really is. This is not an accessory dwelling unit. This is duplexing. We're putting duplexes in the entire city. And the question is, does the only one zoning go away because we're not on one anymore?'",
        "'speaker_8': 'I find that to be a very negative thing to happen to the city in the name of density. And we don't need more people, we don't need more cars, we don't need more traffic, and we want to push more density into the R-1 area.'",
        "'speaker_8': 'So it's absurd. I'm sorry, but are we going to change the zoning? I have that question too. Or two or three, whatever it really is, and eliminate or let's just call it what it is. We're putting duplexes in and I don't think they should face the street.'",
        "'speaker_8': 'Can we get to a mr. Mayor frame and answer that?'",
        "'speaker_1': 'Can we do all the public comment? I'm going to get back to the city attorney for any questions. Okay. Thank you, sir. Next speaker, please.'",
        "'speaker_2': 'I actually spoke at our last city council meeting on.'",
        "'speaker_4': 'October 10th, and I'm very impressed with how things are shaping up. I know that Councilwoman Mongo actually started hitting on this with the with the driveway and the thought with the long driveway. What that does to ADOS. And I know that it's great that we have public transit so close to us and now we're 98% covered.'",
        "'speaker_4': 'We also have coastal areas and parking impacted areas which was touched on. We do still need to provide a spot for those. So if you were to put an ADU over garage, an existing two car garage in a parking impacted zone or in a coastal zone, you'd have to provide a driveway spot.'",
        "'speaker_4': 'That same driveway spot can't be used for that primary residence. If they wanted to add on to their home. That's that's how the zoning.'",
        "'speaker_6': 'Code currently.'",
        "'speaker_4': 'Operates. So if you're in a parking impacted zone and you don't currently meet the parking requirements, which is two garage spots in any single family dwelling district, you can only add 250.'",
        "'speaker_2': 'Square feet to your main.'",
        "'speaker_3': 'Home.'",
        "'speaker_2': 'That's how they prevent you from.'",
        "'speaker_6': 'Expanding your home and making sure you can find parking.'",
        "'speaker_4': 'Whereas essentially, if you had a long enough driveway, you could.'",
        "'speaker_5': 'Provide a driveway spot.'",
        "'speaker_6': 'For one car and then build.'",
        "'speaker_4': '800 square.'",
        "'speaker_3': 'Feet.'",
        "'speaker_6': 'Within reason if all.'",
        "'speaker_5': 'Of your other.'",
        "'speaker_6': 'Ordinances for adds are met. So something to consider on how that affects primary dwelling units and.'",
        "'speaker_2': 'Allowing it used to be built up to.'",
        "'speaker_4': '800 square feet, but only allowing the primary residence to.'",
        "'speaker_5': 'Add up to 50 if.'",
        "'speaker_4': 'They don't.'",
        "'speaker_6': 'Have conforming parking. Another item I.'",
        "'speaker_2': 'Know that we are.'",
        "'speaker_6': 'More involved in in the Planning Department.'",
        "'speaker_4': 'But we've also had thorough discussions with the.'",
        "'speaker_6': 'Building department on if you have an existing rumpus room or a pool house or anything like that. And basically, in order to convert.'",
        "'speaker_4': 'A pool house or rumpus room.'",
        "'speaker_6': 'Or anything.'",
        "'speaker_4': 'You have to consider it as.'",
        "'speaker_6': 'A new construction. So a.'",
        "'speaker_4': 'Pending any like if you have.'",
        "'speaker_6': 'Double hung windows making those.'",
        "'speaker_4': 'Egress efficient, you'd have to pour another slab.'",
        "'speaker_6': 'Or epoxy coat it. So you're conforming to the building code. All of.'",
        "'speaker_5': 'That is very.'",
        "'speaker_4': 'Expensive. On top of the development fees, which for a rumpus room, let's call it 400 square feet, might be 10000 to $12000. It basically.'",
        "'speaker_5': 'Stops that process dead in the water because of the expense that.'",
        "'speaker_0': 'This is getting.'",
        "'speaker_4': 'Anyways, I appreciate you listening to my comment and thank you, guys.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Next speaker, please. Josh Butler with Housing Lumber on. I want to thank the Council for taking on this very challenging issue of finding additional spaces for people to live in our community. I imagine these are going to be largely issues that impact homeowners that are currently dealing with overcrowded situations and maybe allow their family members to live'",
        "'speaker_1': 'in the back houses and and also increase equity in their homes at the same time. I would encourage the City Council to pay as much attention, if not greater attention to the 60% of the residents in our city who are currently renting their homes and are dealing with ever increasing rents, ever tightening market, and we're not putting'",
        "'speaker_1': 'enough housing online fast enough. So we'd love to see the City Council pay as much attention to issues like Jessica's eviction rent control and taking on issues that affect, again, the nearly 25% of our residents who are living in poverty.'",
        "'speaker_1': 'A majority of them are renters. So this has been a great addition and I can't imagine. I would love to hear the report in the future of how many units we actually create out of this and how many new housing opportunities we create.'",
        "'speaker_1': 'I suspect it will be relatively minimal and that we're going to need to start looking and spending more time on some of the larger pieces of the puzzle that will get us to where we need to be, which is that people have a safe, decent, healthy place to live here in Long Beach and people are paying.'",
        "'speaker_1': 'I can go and work in the apartment with that. Com you'll see that people are paying over $2,000 to get a two bedroom apartment here in Long Beach. And that that's more than the mortgage on a half million dollar home.'",
        "'speaker_1': 'So, again, renters in your city are struggling. They are working class folks who are renters in this community. And so, again, from housing, why which is effective? This is fantastic that we're doing this. I do think Ms.. Mongeau creates and brings a good point that in the future, perhaps we do need to look at increasing the lot'",
        "'speaker_1': 'size, but it would seem to be counterintuitive to make the large size larger. And then go back to how do you tell the people that you are going to close down your property? You already built it. So it seems like it would be more prudent to start at the smaller size.'",
        "'speaker_1': 'And if all goes well, then we consider an increase in that size. But I do think it's a good point and more people may have an opportunity to take advantage of that in the future. Thank you. Thank you.'",
        "'speaker_1': 'Next speaker for. Hi. My name is. My name is Trevor Griffey. I am a Belmont Heights resident. I teach at Long Beach City College as an adjunct instructor in history and labor studies. The only reason I'm able to afford living in Belmont Heights is because zoning was higher in the nineties.'",
        "'speaker_1': 'And someone on these long, narrow lots that we have in some of our neighborhoods built a house that's basically double the size of mine and then rented out the house that I'm in. And I'm very aware of the fact that zoning was constrained in the late nineties precisely to prevent people like me from living in the neighborhood'",
        "'speaker_1': 'that I do. So when I see my neighbors put up signs that say increased density equals crime and parking, I'm offended. And I also find it to be a kind of scare mongering that is really unfortunate and actually tends to frame community as not including renters.'",
        "'speaker_1': 'And so I'm glad that the council is doing something to help renters. I think it's unfortunate that the balance of power is such that you still have you're still putting constraints on ADU use when I actually don't see the need to do so at all.'",
        "'speaker_1': 'And I also want to talk about this question of local control really briefly understand that you all don't like that the state alleged bypassed you on on this legislation. But at the same time, there is a housing law that you could enforce more, and that is the prohibition on short term rentals that Councilmember Pierce's office has brought'",
        "'speaker_1': 'up. There are hundreds of units that are currently openly, illegally flouting land use law and being rented on Airbnb that are being taken out of the market for actual Long Beach residents. And your action to try to restrict adus while doing nothing about these short term rentals, I think suggests poor priorities.'",
        "'speaker_1': 'Thank you. Thank you very much. And just so just so the chairman's way, because I know that we've received some updates. So staff is actually in the middle of a kind of extensive look on this issue of the short term rental issue.'",
        "'speaker_1': 'And we expect that that report that was authorized by the council is going to be coming back to the council with information on what we're doing next. But that's an important issue that this council has been discussing. Correct?'",
        "'speaker_1': 'When do we expect that to come back to council? Short term rental.'",
        "'speaker_0': 'You mean like what? Right. So.'",
        "'speaker_3': 'You know, we are getting so commonplace.'",
        "'speaker_1': 'When do we say that? To commit the council.'",
        "'speaker_3': 'Mr. Mayor, members of the City Council, we've received eight proposals on an RFP and are going through the interview process and we'll be bringing a contract to council in January.'",
        "'speaker_1': 'Okay. Thank you very much. Next speaker, please. I guess my name is Ramon. I'm from District five. My stuff is on record. I didn't hear the beginning part, but I don't have a problem with the ads. I think they're cool.'",
        "'speaker_1': 'Everybody should have one. No, I'm just joking. I support him. I do like the owner occupied thing. I think he's as critical of what we're doing. I like a lot of the questions that Stacey Mungo is asking as far as the maximum footage.'",
        "'speaker_1': 'I would I would like to I appreciate the comments of Linda, what she has gone through and all the work that she's done. And I can tell you that I have friends that are in Newport Beach and they're also on the city council, at least two of them.'",
        "'speaker_1': 'And they have told me that that the the maximum square footage of the accessory dwelling unit is 600. They have a density that's far less than ours. So I would I would recommend having a density. I mean, dropping it to 600 feet.'",
        "'speaker_1': 'That would be that would be really my my only major my most major change to what you're doing just to match with what is happening with the other cities. Because I don't think that's that's happening here. We're like the second most densest region in the country besides New York City.'",
        "'speaker_1': 'Besides that, I can say that I have a little bit mixed idea. I know that there's a certain kind of for replacement parking. There's another bill that I didn't see mentioned here. It's it's a I think it's SB whether it's six nine.'",
        "'speaker_1': 'Right. And I think that also says replacement parking may be a little bit ignorant on that, but it didn't that one did not specify the. You know, I think you're allowed to four for four that you allowed to use the driveways in which you have to do some kind of replacement for that.'",
        "'speaker_1': 'I could be wrong, but I think SB 1069 is that law that we need to look at square footage for the houses?'",
        "'speaker_0': 'I don't know about that.'",
        "'speaker_1': 'There's a certain law that you can't go beyond the threshold. And we need to make sure that we're in that that range in which we're there. We just need to do a study and make sure that everything's correct in that.'",
        "'speaker_1': 'But that's about it. You have a great day. Thank you. Next speaker, please. Evening. My name's Phil Harris. I'm out. Good evening, ladies and gentlemen. I've been a homeowner since 1996. The same house my house is in. Our three has our three, but it's 6000 square feet.'",
        "'speaker_1': 'Now, this the estate law seems to approach this as they're trying to assist homeowners in developing their property a little bit, taking off the reins of local government, squeezing them into a position where they can't develop their property.'",
        "'speaker_1': 'So when I hear things like running this up to 7500 square feet and I have a 6000 foot piece of property with one residence on it, and I potentially cannot make an accessory dwelling even one more three. So I have an R three property which was at the time approved by the city and the planning.'",
        "'speaker_1': 'But the regulations requirements of local governments has made is making it impossible for me to do anything with my property at all. And I think that there's something initially wrong with that. If I buy a piece of property and it's our three year as the new commission from 21 years ago, it shouldn't be able to prevent me'",
        "'speaker_1': 'from using it as some version of an R three, and all I want to do is make it as an accessory dwelling. I think the state law says 1200 square feet. I don't know why I have an AR three and they're trying to squeeze me down to 800 square feet.'",
        "'speaker_1': 'I have plenty of space on my property to do this. So my questions are, what is the purpose of denying what the state law has presented for you to do and how does that assist people already bought a property and a paying for 21 years not to be able to use it as an hour three.'",
        "'speaker_1': 'Thank you, sir. Speaker, please. Robert Pete representing.'",
        "'speaker_7': 'Jesus and the truth, because there's not a.'",
        "'speaker_1': 'Lot of truth around here when it comes.'",
        "'speaker_7': 'To this. I mean, I see.'",
        "'speaker_1': 'I see, you know, you stand up there.'",
        "'speaker_7': 'You look dignified and everything.'",
        "'speaker_1': 'But everything you do.'",
        "'speaker_7': 'Is communist. I mean, the guy is talking about control. He doesn't need people constantly trying to control his get down.'",
        "'speaker_1': 'Now, America, once again way. Why? Every time I'm talking, you always got to get to talking to somebody. Missed rule. You always do that. Always be respect for you. Me be respectful. You be respectful to me. She's asking the question.'",
        "'speaker_1': 'Say, Oh, yeah. Where you telling man I'm talking to you? Yeah, I'm going to know anyway. Anyway, listen, all this stuff, no direct control. No. To just cause eviction, all this communism and that. A guy who's talking. George Butler, where do you go?'",
        "'speaker_1': 'We crawl back in this hole. He's. Yeah, yeah, yeah. I want everybody here. No, George Butler is a straight out communist bum. So going this that you can address. Okay, I'm telling you, Josh Butler is a communist bum, and I want you to tell all the people, okay, I'm around that chump everywhere he goes, because in a'",
        "'speaker_1': 'big city nose meeting, he lied to all the people and he lied to them and told them this was the highest. He said this is the highest property on the coast around the nation. And then even one of the Democrats that was a Democrat meeting said, no, he's a big liar.'",
        "'speaker_1': 'Anyway. So that being said, I'm getting back to this now. No, on just cause eviction. We don't need anymore browns that we can't get rid of. No on rent control. Rent control is communism, life, liberty and the pursuit of happiness means a man could buy his property and he's a master of his property.'",
        "'speaker_1': 'You trying to be the master man? You ain't Miles Satan or Fidel Castro. And we ain't gonna let that happen. So now the word control no. To just cause eviction. And I don't listen to bums like Josh. Brother, he's a bum.'",
        "'speaker_1': 'Sir, can you please stick to the issue? And this is not just. But there's a bomb room. Josh blew out of town and works. I have people funding him from around here. We're going to run Josh Bell this butt out housing Long Beach is a fraud.'",
        "'speaker_1': 'Josh Butler is a bum. Oh, just to add, shame on you. I'm okay. And and let me tell you, at 80, Josh is a bum. Okay? Okay, sir. Andy, thank you very much. That's last answer. One more time.'",
        "'speaker_1': 'Josh is a bum, everybody. Josh Bell is a thank you, sir. No, we got to run him out. All right. Thank you so very much. Next speaker, please. You got to keep rolling. I got a couple more seconds.'",
        "'speaker_1': 'I'm going away, sir. Thank you very much. I got ten more seconds. Josh Boehner's a bum. Come on, Josh Bell. The run was communist, but out of town, you know you're not talking about that. It doesn't matter. Only go once your time is up.'",
        "'speaker_1': 'Yes, sir. Thank you. Time's up on Josh. Thank you, sir. So, just as a reminder to the to the public, I think I want to continue to say this, that whether we agree or disagree with what's being said, people have a right to their First Amendment to say what they want to say.'",
        "'speaker_1': 'And so we will continue to use that rule. And I would hope that people would use some decency and stick to the issue and be respectful in the process as well. Mr. Good, your next Speaker, very good to address on file in terms of the Granny Flats or small units.'",
        "'speaker_1': 'One of the things you consider and I'll bring you back the pictures next week, four further so people can see them if they did not see them in the L.A. Times and local papers. It's one of the concepts that I think would work very well in down in the Marine Stadium next to, as I pointed out before'",
        "'speaker_1': ', 818 as a housing unit for veterans. I've scoped it out and we can put about six. Good. Eight units there. And when I'm talking about the grass to the north of of eight and immediately to the north of eight in which is not used, except once in a while people will be flying drones.'",
        "'speaker_1': 'There's still a sidewalk there, there's still public access. And I encourage the city to take a look and at those designs because they will be perfect in areas throughout the city where people need housing. A granny flat. And I've used the word granny flat.'",
        "'speaker_1': 'A one unit house easily constructed and would have a bathroom. And it's about twice the size of an average dorm in a university and so forth. But again, I would urge the city to pull out those diagrams and take a look at them and scope them out, because that could be a solution to some of our housing'",
        "'speaker_1': 'issues and so forth. Obviously, if you've got a kids, that's not going to work, but for particularly veterans or people that have a limited areas in which they travel and so forth, that would be great. Thanks. Thank you.'",
        "'speaker_1': 'And our last speaker speaking, this is closed. Go ahead, sir. I just really quickly have a question about the the restrictions that they have, the minimum lot size and restrictions overall with like the housing regulations, are they based purely on like safety and inspection?'",
        "'speaker_1': 'Like I understand code plays a big part in it and like it's a it's a discovery process to find out the safety elements of building adding, adding on to a property. But is there a lot size based on a safety assessment from the fire inspector or is it just based on numbers from other cities that we've gathered'",
        "'speaker_1': 'or like arbitrary number? That's that's just awesome. Thank you, sir. Okay. I'm in a close public comment. Just a couple. Just to quickly clarify from staff, I know there was a some questions from the audience, particularly about how the council decided on these certain lot sizes and these designations.'",
        "'speaker_1': 'And that came out of a variety of meetings. I was at the council, had some staff recommendations as well as the state regulations that came as well. And I'm not sure if you have anything else to quickly add to what the gentleman just said.'",
        "'speaker_3': 'I couldn't clearly here, but it sounds like the last gentleman was talking about the issues of safety and just to respond to the issue of safety. Any proposal for an accessory dwelling unit is reviewed by the Building and Safety Department as well as the fire department, and it is required to comply with all building code requirements as'",
        "'speaker_3': 'well as access by fire and emergency services. And regarding how the the original proposals came up, I think we started from the state allowed unit size of 1200, but we did a very thorough review of the city's lot sizes and property sizes to make sure that the proposal that we brought forward for the Council to consider we'",
        "'speaker_3': 'had a good handle on the potential development opportunity that existed in the community and we arrived at the proposal for 1000. But after feedback from the community at the Planning Commission public hearing, they actually reduced the, the, the standard to the 1000 and the council again hearing from the public further reduce that to the 800.'",
        "'speaker_3': 'So that's a little bit of the background in terms of how we got to the the current 800 proposal.'",
        "'speaker_1': 'Okay. Well, thank you very much. But public comment is closed. Councilwoman Price.'",
        "'speaker_5': 'I just want to add, I appreciate Mayor, you clarifying that, because I think from the public comment, there was.'",
        "'speaker_3': 'Just still.'",
        "'speaker_5': 'A little bit of confusion and there was a member of the public who spoke about kind of having a restriction if there are lot size was a was a specific size. And I want to say I hear you on that.'",
        "'speaker_5': 'And that's why this entire process has been a bit of a balance for us. And that's why I don't think it would be beneficial to the homeowners in our city if we were able to restrict the rights to build a granny flat on their property based on their lot size.'",
        "'speaker_5': 'Unlike some other cities, the demographics of our city are such that most of the lot sizes that are above 7008 thousand range are in a concentrated in one or two districts, if that. And so that would limit many of the people in the city from being able to actually build a granny flat.'",
        "'speaker_5': 'And so we certainly we have to be very cognizant of the density concerns that our residents have, because certainly those do create parking impacts primarily and noise impacts and other impacts. But at the same time, what we don't want to create is a situation where there's inequality based on.'",
        "'speaker_5': 'The district you live in as to whether you're able to fully develop your property to the extent that someone with a larger lot size would be able to. So we're mindful of that. And I just wanted to clarify because that the resident who spoke was under the impression that the proposal required 7400 square feet be the minimum'",
        "'speaker_5': 'size. And that's not the that was a friendly amendment. But the proposal that's on the floor is not for that. It's for 50, 200 square feet. So thank you.'",
        "'speaker_1': 'Thank you very much, Councilman Mongo.'",
        "'speaker_3': 'Thank you. While I would prefer to go with the 7400 square foot lot size to ensure that we are gradually taking steps into this, I see that the bigger protection is having some standards in place instead of not having some standards in place and so on.'",
        "'speaker_3': 'My preference would be to go with the 7400. I will be supporting this at 54, I'm sorry, 5200 because not passing something tonight would actually be more detrimental to the communities. And so with that, I look forward to seeing how the vote.'",
        "'speaker_1': 'With that membership is in motion in a second. Please cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Economic Subsidy and Revised Transient Occupancy Tax Sharing Agreement with American Life, Inc. for 100 East Ocean Boulevard.": [
        "'speaker_1': 'Thank you are hearing I remember to.'",
        "'speaker_2': 'Report from economic development recommendation received supporting documentation into the record conclude the public hearing regarding an economic subsidy in connection with revised transient occupancy tax sharing agreement with American life, and authorize the city manager to execute the First Amendment to the purchase and Sale Agreement.'",
        "'speaker_2': 'Attaching a revised transient occupancy tax sharing agreement for the property located at 100 East Ocean Boulevard District to.'",
        "'speaker_1': 'Thank you. We will just begin by doing this staff report, please. Thank you, Mr. Mayor. Our staff report will be given by John Keisler, our director of economic development. Honorable man.'",
        "'speaker_9': 'Members of the city council. I'm happy to bring to you tonight an update on an agreement for vacant property located at 100 East Ocean Boulevard, popularly known as the Jurgens Trust Building. This building was built in 1919, but demolished by private property owners in 1988 and purchased by a redevelopment agency in 2011.'",
        "'speaker_9': 'It was designated for future development in the Long Range Property Management Plan, and in 2015 the city issued a request for proposals for the purchase and development of this site. The proposal that was chosen was from American Life Hotel Developer and located in Seattle, Washington, for the purchase price of $7 million.'",
        "'speaker_9': 'Also executed at the time of the purchase and sale agreement with a transient occupancy tax sharing agreement authorized by the City Council on May 17th, 2016 as part of the original purchase and sale agreement. There were a few conditions prior to the transfer of ownership, which included an executed contract with a nationally recognized hotel operator for star'",
        "'speaker_9': 'or equivalent designation. Fully executed project labor agreement between the buyer and the L.A. Orange County Building, Construction Trades Council, and evidence that the hotel operator had agreed to participate in a card check neutrality agreement for the hotel, not including the restaurant.'",
        "'speaker_9': 'And the original Transient Occupancy Sharing Agreement was based on an analysis for a 350 Room four star $165 million project, which established a $47 million feasibility gap and verified by a third party review. The projected $54 million in total transient occupancy tax that would be generated over 20 years was determined to be shared 5050.'",
        "'speaker_9': 'Over that 20 year period between the city and the buyer, the developer, which would be approximately 27 million for for both the buyer and the city. What we have since that time that occurred are a number of changes, including a 2016 lawsuit that was filed by the Citizens Against Downtown Long Beach giveaways, ultimately that the court ruled'",
        "'speaker_9': 'in favor of the city and a petition for writ of mandate was denied in 2017. And also changes in the market costs for labor construction materials and financing had grown over this period of time and to to make the project work.'",
        "'speaker_9': 'The design was increased from 350 rooms to 417 rooms, with the construction costs increasing from 165 to $262 million to complete the project. Since that time, we've conducted a new economic feasibility gap analysis and established that the gap was now $61 million.'",
        "'speaker_9': 'And we verified that with our third party financial consultant, Kaiser Marston and Associates. So what we have for you tonight is a revised transient occupancy tax sharing agreement. The purpose of this agreement is to address the feasibility gap by restructuring the timing of the total sharing in this new amendment.'",
        "'speaker_9': 'The buyer would share up to 80% or approximately 27 million, the same amount from the original agreement. But they would be reimbursed in the first nine years rather than over a 20 year period. The city in the new agreement would receive 20% or approximately $7 million of the TOT over the first nine years, and then at year'",
        "'speaker_9': 'ten would start begin to receive 100% of the TOT generated from the project starting at about $4 million a year and reaching over $6 million a year by year 20. As part of this new agreement, the developer has committed to a minimum investment of $230 million to receive the full benefit of the TOT sharing agreement.'",
        "'speaker_9': 'And the agreement would continue to remain in effect for 20 years. There's a number of other benefits of the revised TOT sharing agreement. The project will be much bigger, as we mentioned, creating more jobs for both the construction project as well as for ongoing operations.'",
        "'speaker_9': 'Construction jobs are estimated to be 1700 for this project in ongoing operations. The estimated job creation will be 360 ongoing jobs in the downtown. The new project will include more amenities, which will create more sales tax and jobs than the original project.'",
        "'speaker_9': 'The cost of the project going from 165 to 262 million are almost $626,000 per roomkey will result in a greater economic impact for the city. It will require this minimum of $230 million in investment, which was not a part of the original agreement.'",
        "'speaker_9': 'It will command higher average daily room rates estimated to be over $220 per night, which will generate both. Higher wages and more transient occupancy tax to the city. And the developer has also agreed to include worker safety improvements such as panic buttons, to make sure that we have a safe working environment in our hotels, as well as'",
        "'speaker_9': 'a good faith effort to identify a local restaurant operator if a third party operator is chosen for the restaurant itself. I wanted to give you a quick estimate on the on the timeline. If we do have an approved agreement amendment, I'm sorry, and the buyer would begin the process of securing entitlements, as well as a card check'",
        "'speaker_9': 'neutrality agreement in a hotel operator agreement in 2018. There would also be a play or a project labor agreement for construction in 2018, and if all the permits, entitlements, environmental review and agreements are presented to the city, we would approve the transfer of the asset and begin construction in 2019 with a grand opening estimated for 2021.'",
        "'speaker_9': 'And just to conclude, the existing agreement that is in place that the City Council approved last year.'",
        "'speaker_1': 'Already requires.'",
        "'speaker_9': 'The project labor agreement and a card check neutrality agreement before the property could ever be conveyed or escrow could be closed. The amendment maintains these requirements and the transfer of property will not occur until these requirements are satisfied with that.'",
        "'speaker_9': 'I would like to conclude my report and answer any questions.'",
        "'speaker_1': 'Thank you, Mr. Commissioner. Thank you for the update. And just to want to clarify, and I'm going to go ahead and go to the Council on the public. So, Mr. City Attorney, I know that this was mentioned briefly by Mr. Keisler, but get both the former proposal as well as this proposal of Mr. City.'",
        "'speaker_1': 'And if you can just clarify this piece, they both contain both a project labor agreement, a full project labor agreement on the site, as well as a contract agreement on the site as well. Is that correct? That's correct.'",
        "'speaker_1': 'And is it correct also that the the support from the city in our commitment financially to this project would not happen and this project is not eligible for those funds? When we close this deal months out, unless both the contract agreement and the project labor agreement were in place, is that correct?'",
        "'speaker_1': 'If I understand your statement correctly, we we do not have to close unless those items that you indicated occur. That's correct. And that's part of the agreement is for those items to be included. The transfer would not occur.'",
        "'speaker_1': 'Okay. Excellent. Thank you very much. Want to just reiterate that. So I appreciate that. And with that, let me go to you. There's a there's a motion on the floor, Councilmember Pearce.'",
        "'speaker_4': 'Great. Thank you. I want to thank you for clarifying. I want to thank staff for their incredible work. And I want to highlight a couple of things with this project. This is the first hotel project in my district that's been on city land that I will be participating in approving, possibly just want to keep my options open'",
        "'speaker_4': 'here. I want to make sure that we highlight some things that have changed in the process. Never before has everybody really had a seat at the table in creating a what we're not calling, but what is essentially a community benefits agreement where we're hearing from all the Labor Party's as a city and it's not the city's job'",
        "'speaker_4': 'to negotiate those Labor contracts, but the city ushering through best practices to try to make sure everybody is at the table. And so I want to applaud staff for forming a relationship with Unite Here Local 11, where they have not had that before.'",
        "'speaker_4': 'I also know that we've had a lot of outreach from other stakeholders and different issues pertaining to local hire piece and a couple other components. I have a couple of questions, then I want to go to public comments and then hear from my colleagues.'",
        "'speaker_4': 'I know vice mayor has to leave, so if we could hear from vice mayor and the public comment and then behind the rail, I think it would be helpful. The city attorney I have a my first question is you you stated that we do not have to.'",
        "'speaker_3': 'Approve.'",
        "'speaker_4': 'The ask the land sale if those things are not met. But is it a requirement that we have to? Have those.'",
        "'speaker_0': 'In place.'",
        "'speaker_1': 'Mayor and members of City Council. Assuming I understand your question correctly. No, it's not a requirement. There's the possibility that the failure of a condition could be waived by the city and the closing could proceed without a card check agreement or without a labor peace agreement.'",
        "'speaker_1': 'But I think, as you just heard staff publicly say.'",
        "'speaker_9': 'That's not their intention. And I don't.'",
        "'speaker_1': 'Think they would ever do that without seeking further clarification or guidance from council. But it's theoretically possible.'",
        "'speaker_4': 'Theoretically possible. But we could say tonight that if something were to happen, it would need to come back to council. We could ask for that tonight.'",
        "'speaker_1': 'That's correct.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'You could make it so that those two conditions there, they are described in section.'",
        "'speaker_9': '3.2 H and I of the current.'",
        "'speaker_1': 'Agreement that those conditions are not waive able by the city.'",
        "'speaker_4': 'Thank you for that. I also wanted to clarify in the communication we've received this morning, it has the Los Angeles Orange County Buildings Trading and Construction Trades Council is outlined under 3.2 H under 3.2. I'm assuming I it just says that there's a card check neutrality agreement.'",
        "'speaker_4': 'So tonight we could put in there that that needs to be done with unite not here local 11 I'm assuming.'",
        "'speaker_1': 'Well no I think the card check neutrality agreement, the idea is that it needs to be executed by the hotel management company. Right. And then I'm not a labor law expert, but my understanding is that the that the employees could opt to unionize or not and become part of whatever union they might choose to.'",
        "'speaker_1': 'It may well be that unite here 11 is the one they would, but I don't think legally they're required to.'",
        "'speaker_4': 'All right. Thank you for those questions. I'd like to hear from my colleague and then hear from the public, please.'",
        "'speaker_1': 'Councilman Richardson. Thanks. So I do have a hard stop at 630. It's my daughter's first Christmas show tonight. But I wanted to. I'm already late, so I wanted to just chime in and just say this is a very important project.'",
        "'speaker_1': 'And I was here when the first agreement went through, and I remember hearing from the parties, you know, everyone hasn't seen that corner and wonder what the city of Long Beach is going to do with that corner. It's really important.'",
        "'speaker_1': 'It's going to be a tremendous success. My comments last time that came around are the same when we want to make sure that there's, you know, that that, you know, I congratulate there's a project labor agreement and it's great to hear that the 1700 quality jobs are going to be created through this process.'",
        "'speaker_1': 'And I hear the commitment to the commitment to labor peace for the ongoing operations. I just think that's the way that we go moving forward. So I wanted to express my support here and also acknowledge the president of the school board.'",
        "'speaker_1': 'Well, both the president, the school board and Dr. Feldman Williams, school board member. I won't be here for your recognition tonight, but I just wanted to acknowledge before I have to take off. But thank you and express my support here.'",
        "'speaker_1': 'But unfortunately I won't. Given how long the last item went, likely this will go for another hour. I won't be here for that. Thank you. And thank you for that moment, Jenny. Thank you. Okay. So, Councilmember Pearce, you want to go to the public comment, is that correct?'",
        "'speaker_1': 'Yes. Okay. So we're going to go now on to public comment on this item. So please come forward if you have a comment on this item. I'll go first. Ron Miller, executive secretary of the L.A. Orange County Building Trades.'",
        "'speaker_1': 'Really appreciate the partnership here. We do know this developer. We've done agreements in the past with him in Los Angeles. They've been very successful agreements with both the building trades and the hotel workers. You can go over to Olympic Boulevard and see a see the hotel there.'",
        "'speaker_1': 'And it's been very successful, put a lot of folks to work, create a lot of new careers and should be good. We'll have local hire just like we have on all the other projects in Long Beach and moving forward with more success.'",
        "'speaker_1': 'I did get a thing from a researcher today in my office that through Long Beach City College we put numerous people through our apprenticeship readiness program. The latest numbers I got, we've put 50 people into careers, into apprenticeships in the building trades.'",
        "'speaker_1': '16% of those 50 are women, 16% are African-American. And so it's a good success. We're building on this project. It's going to be something to help us go further. Thank you. Thank you. Next speaker, please.'",
        "'speaker_3': 'Thank you, Shirley. So with respect to this hotel and I'm sure that each council councilperson representing the homeless in your district, you know who they are. You you talk to them, that you meet with them regularly and they have access to you as your more affluent constituents.'",
        "'speaker_3': 'The Seaport Marina closed, and a lot of those people who were using vouchers to live there are now without a place. Some of them lined PCH and Second Street. When you're allowing businesses, particularly coming into the state or other cities to operate here.'",
        "'speaker_1': 'Other cities are building.'",
        "'speaker_3': 'Now, building in to the base. Knowing that they need to do more for their homeless clients, building it in so that somewhere in there the working homeless I'm not talking about the dirty, sloppy one that you don't want to shake their hand.'",
        "'speaker_3': 'Their teeth is green and creamy. Their clothes look like they haven't bathed in 12 years. I'm not saying that homeless. I'm saying the working homeless person who. You wouldn't even recognize that they were that. But they're sleeping in their car, some of them.'",
        "'speaker_3': 'What if we built in? And I know it might be a little too late for this hotel? What if we bought into the coming forward so that vouchers can be accepted for those who may or may not be able to afford the $700 a night a night fee for that hotel?'",
        "'speaker_3': 'But, hmm. If you say to the business coming in, you know, we're trying to work with our homeless community. Oh, we want to rename them to not homeless, but people without housing. Possibly you can build that in so that, who knows, they may be able to reside there.'",
        "'speaker_3': 'The statement going Long Beach kept ringing in my ears last week and I laughed every time it was coming up. Go, go. Long Beach. Well, we go in with the homeless. What creative ideas are you thinking moving forward?'",
        "'speaker_3': 'Or are.'",
        "'speaker_1': 'You only.'",
        "'speaker_3': 'Sticking to the letter of the law that other cities are doing? Where the home is going with you. They think.'",
        "'speaker_1': 'They're going to go if there's nothing more.'",
        "'speaker_3': 'Than.'",
        "'speaker_1': 'Around the.'",
        "'speaker_3': 'Corner and back. They're going with you.'",
        "'speaker_1': 'Thank you, Mr. Speaker, please. But even they are seeing a fellow concern in the city staff in the public as here today. I just wanted to recognize the brothers and sisters that's here to support this idea item moving forward.'",
        "'speaker_1': 'IBEW folks there living here in Long Beach that wants to support good projects like this moving forward. I can tell you that the track record that American Life has is a really good track record in L.A. City, L.A. They've done a project under a project agreement in Seattle.'",
        "'speaker_1': 'I spoke with our our sister local union there, Local 46, which represent IBEW members out there. And they've implemented project labor agreements under American lives projects out there. So they have they do have a good track record on utilizing place and in the benefits that come with it.'",
        "'speaker_1': 'I urge the city council to move forward with this item. Thank you. Thank you very much. Thank you for coming out next speaker, please. Very good. What I am going to impart here, I was going to impart also.'",
        "'speaker_1': 'On two other items on another agenda. But the same principle applies regardless of what regardless of what project we're entering into. I think the city should adopt as a policy. If before they enter into an agreement and sign the agreement, they must secure from the company.'",
        "'speaker_1': 'No matter who it is. A letter that states and discloses. Any. Financial. Embezzlement. Crimes. That they had their companies had been involved in. Like we discovered after after after we signed the contract for was a near near $10 million for the parking structure used in parking lots.'",
        "'speaker_1': 'And we found those people, you know, they came here like flies on garbage. They know where the you know, they know where the corrupt is or are. So I think it you adopt it for this cup and I, I the building certainly we need to rebuild that.'",
        "'speaker_1': 'But let's make sure. And I know nothing about this company that you do your due diligence, see how many, if any, have been convicted of crimes. And had them just you sign the agreement in saying that if if.'",
        "'speaker_1': 'It's later discovered. That you didn't do due diligence and they in fact, were convicted of the crimes such as the person is such as a company who signed the contract with the market like did then. The contract is null and void, period.'",
        "'speaker_1': 'Not only that, the city would get any money back. That they spent. Having to deal with this company. Thank you. And my apologies to the company. I know nothing about you, but I do know some of the people here in this city and on the city council.'",
        "'speaker_1': 'We have a great many that are honest. Unfortunately, that's not 100%. Thank you. Thank you, Mr. next speaker, please. Good evening. Warmed Lisowski Long Beach Citizens for Fair Development with a group that brought the original litigation and have a pending appeal.'",
        "'speaker_1': 'I applaud my union brothers and sisters for trying to get this developer to sign some type of labor agreement. But as you could see, the answer to council person's second district's question was that, no, they can still buy the property without your union agreement.'",
        "'speaker_1': 'So I urge the union to if you see how fast these buildings go up these days, you really are only going to have about two months of work there. You should be looking for longer term sustainable jobs in the in a renewable energy sector.'",
        "'speaker_1': 'The city is still arguing that this is not a project council person papers, not a project. And as you can see, they have selected a developer. They have selected hotel brands. And this most certainly is a project. In fact, if you look on tonight's agenda, the address is not even on the agenda item number.'",
        "'speaker_1': 'So who was trying to pull a fast one and not even alert the community that there was a hearing on 100 East Ocean today? The transient occupancy, occupancy, tax sharing agreement, it's kind of become a frank agreement. I don't think even people behind the days understand what's going into this agreement.'",
        "'speaker_1': 'If the gap all of a sudden has expanded to 61 million, how is the same $27 million going to cover that gap? It just doesn't quite make sense. And so we also take objection with the fact that in the staff report, the staff gave our organization an incredible amount of power, saying that delays caused by our lawsuit'",
        "'speaker_1': ', where we were merely asking the city to follow, secure the law, just merely holding the city to account, to follow the laws that that other cities make their developers follow. And then use this to speed up the rate at which the developer gets their $27 million tax rebate.'",
        "'speaker_1': 'So we support development in the city, but we support development with local developers that have a benefit to the community. This is an out-of-town developer that is just giving some lip service to the labor movement. And this project does not help the residents of Long Beach.'",
        "'speaker_1': 'Thank you. Thank you. Next speaker, please.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_3': 'Good evening. My name is Rita moreno. I been a hotel worker in the city for four years now. I live in the ninth district. I'm here on behalf of the hospitality workers of Long Beach. I have.'",
        "'speaker_4': 'To oppose American lives proposal.'",
        "'speaker_3': 'To restructure the existing tax sharing agreement with the city. We believe this would set a bad precedent for the city's upcoming conversations.'",
        "'speaker_4': 'Of studies of the city wide tax initiative policy for hotels.'",
        "'speaker_3': 'We also we are also here to tell the city council that we oppose broader tax initiative policy that carries the intent of subsidizing future hotel development near the city, near the city center, without any assurance that the working families of Long Beach like mine have tangible benefits, either as our city hotel industry continues to grow.'",
        "'speaker_3': 'We, the hotel workers of Long Beach are a reminder, are reminding our mayor and the Council that it is your duty to protect us, all of your working people, not just the businesses we hope to. We hope that the mayor and the council respect other workers and and the community.'",
        "'speaker_3': 'You call to put people over profit. Profit. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_3': 'Good evening. My name is Rachel Smith. I currently work in and formerly resided in the first district. I'm here to oppose American Life's proposal to restructure the existing tax sharing agreement with the city, because we do not know how this may impact a potential.'",
        "'speaker_6': 'Citywide incentive policy.'",
        "'speaker_3': 'I'm also here to tell the city to tell the city council that I oppose a broader tax incentive policy that carries the intent of subsidizing.'",
        "'speaker_6': 'Future hotel.'",
        "'speaker_3': 'Development near the city center without any reassurance that workers in Long Beach will have tangible benefits and protections in hotel. Workers are the backbone of Long Beach tourism industry. Working women of color make up more than half of all hotel workers in Long Beach.'",
        "'speaker_3': 'In my experience, as time goes on, workers see an increase in workload and consequently an increase in injury rates. I call on the mayor and the city council to prioritize working families, not only business. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_3': 'Good evening. My name is one. I'm a lawyer. I am a hotel housekeeper here in Long Beach. Last week, Time magazine feature me as proud a group of women called The Silence Breaker, and we were named Time's Person of the Year 2017.'",
        "'speaker_3': 'It was an honor to me to be included with a brave woman, a man who came forward publicly against sexual harassment at all economy levels. For years, I have been fighting for the rights of women working in the hotel industry.'",
        "'speaker_3': 'After. After I decided that I was tired of being harassed, ignored, abused, and that I will fight back. I am so proud of this moment where women everywhere are standing against abuse. But I'm.'",
        "'speaker_6': 'Here tonight to condemn.'",
        "'speaker_3': 'The actions of the city council. They have failed the woman or this city. Mayor Garcia and Council members Pryce, Huston, Mango, Soprano and Andrew in known our pleas to heal and instead fight with the rich hotel company who profit off our exploitation.'",
        "'speaker_3': 'Tonight, Austin in Price will propose an investment policy for city employees just a month after they deny one for hotel workers. I said to my male Garcia will promise them a new hotel, a bellman requiring the company to do nothing about the abuse its workers will no doubt face.'",
        "'speaker_3': 'I know this because I have to spend my life, my life cleaning hotel rooms, save them by breaking what that fell foul me honorable to predators who too often are protected by the fact that they are also paying customers like so many other women in the Long Beach hotel industry.'",
        "'speaker_3': 'How come? For what we know with my story, to demand that the theory is stand with women I think are being ignored by councils that spend more time talking about giving away millions of dollars to hotel developers than that it does about protecting hotel workers from an abuse.'",
        "'speaker_3': 'The honor of being named Time's Person of the Year is an honor that should be shared with the entire city. Long Beach. But as it is, then, that person that the year awards show the hypocrisy of a city council who will rather have us stay quiet and suffer in silence.'",
        "'speaker_3': 'I am here tonight to tell you. We won't stay quiet. We will persist. Thank you.'",
        "'speaker_1': 'Thank you very much. Go ahead, sir. Good evening. My name is Andrew Mayorga. I'm a representative of Laguna Local 39, representing our membership. I just want to. I just came here in support of this project, and I'm glad I was at the end of the line.'",
        "'speaker_1': 'I heard a lot of negative stuff. Let's just start with first. You know, American life doesn't just give lip service, say they came. And wherever they build, they build with the community. They outreach to the community. They come to individuals like myself and my brothers back here.'",
        "'speaker_1': 'So to sit here and say that they give nothing but lip service to us or to you as homeless, an insult. I know wherever they go, they reach out. I probably share that. There's developers here in Long Beach that are building right now that have never once approached anybody from our community to come help them put a'",
        "'speaker_1': 'shovel in the ground. But that's on a separate note. And again, to address something else that I heard tonight, and just for the young lady, I think started all this conversation about how the council doesn't do anything to help the homeless when projects like this come.'",
        "'speaker_1': 'I just want you guys know that's not true. Through projects like this and agreements through plays, I've come across many of our membership that started out in their cars and now live in apartments are on their pathways to owning homes, on cars, new cars and on their end are starting families.'",
        "'speaker_1': 'And that's because of people like you, people like American life and my brothers and sisters back here that we tend to build things. Thank you so much. Thank you very much. Next speaker, please. I just have a point of clarification because I'm confused is like the agreement, essentially the company is going to pay the city a lump'",
        "'speaker_1': 'sum and then over nine years they're going to get money back from the tax cut of the taxes because I know resort tax from Palm Springs where I'm from like goes entirely to the city to fund like all of our special projects and social projects.'",
        "'speaker_1': 'So I just I'm curious about that, like to understand how like are they getting all the money that they paid the city back in that nine years? So they're breaking even and then we're going to start getting our money.'",
        "'speaker_1': 'And then with subsidizing like developments like a hotel, wouldn't American Life Inc be, like, big enough to be able to support itself and not need a subsidy when developers like like local real estate developers that are trying to build, like, low income homes for people that already need it because we have a population problem already.'",
        "'speaker_1': 'So to bring in like a hotel. Yeah, we have we have conventions all the time, but we have plenty of hotel space for those conventions already. As it is, we need more housing subsidy. So I'm just wondering. Thank you.'",
        "'speaker_1': 'Thank you, sir. Next speaker, please. Good evening, Council. My name is Max Norris. Thank you for giving me an opportunity to speak today. Following Councilwoman Pierce's line of questioning, I can assume that she's likely to make an amendment to require the play conditions as well as the card check and hopefully as well the safety call buttons as'",
        "'speaker_1': 'a matter of condition for the the passing of the transfer of the land between the city and American life or whatever this company is called. I would just want to point out that without that amendment, this is simply just a lip service to the trends of the week.'",
        "'speaker_1': 'The hashtag of the week, the TIME Magazine article. You know what? You guys all turned your back on a couple of weeks ago. So without an amendment like that, this is nothing, obviously. My. My brother's in labor, and the trades will get their play.'",
        "'speaker_1': 'It's coming quick, and the trades will make sure it happens. But on the back end, without assurances by amendment, as I assume Mr. Pearce will introduce shortly, this is nothing, this is nothing at all for the hotel workers or for the rest of Long Beach because those 7000 jobs will be gone.'",
        "'speaker_1': 'And as important as they are and and I do think that they are important, those jobs aren't going to go anywhere by adding that amendment. Thank you. Thank you, Nick. Speaker, please. The last speaker speaker's list is now closed.'",
        "'speaker_1': 'Good evening, honorable mayor, honorable council members. My name is Greg Steinhauer, president of American Life. I thought I would come up here and you could hear directly from my mouth. So, as you know, we're under a purchase and sale agreement to buy the property.'",
        "'speaker_1': 'And in the earlier agreement, we have agreed to sign a card check agreement with the unions. We will commit to that. We have committed to signing the project labor agreement with the unions. We've always had excellent relationship with the labor unions.'",
        "'speaker_1': 'We have excellent relationships with Unite here up in Seattle. But for some reason there seems to be an issue down here. I don't know why that is. The but we're not going to sign the card check agreement until we have a flag in place.'",
        "'speaker_1': 'It's just that simple. It makes no sense to do that from our standpoint until we have an operator for the hotel, which we hope we'll be able to announce in the first quarter of 2018. John ran through all the economics of the proposal.'",
        "'speaker_1': 'One other point that was not made, and that is by changing the structure of the proposal and reducing the length the city actually benefits to a tune of over $6 million that receives $6 million more during that time period than had we stuck with the original agreement.'",
        "'speaker_1': 'It's just as the hotel's gotten bigger. These projects, hotel developments, a cyclical type of development. There is no assurances that when you come online, there's going to be a market. And this is a way to help mitigate the risks so that we can and make this investment and create jobs for everybody.'",
        "'speaker_1': 'These projects take between 24 and 30 months to build. That's a lot of construction work. And I appreciate your reconsidering this from from my view. Where I sit, I see no issue and we will honor our word. Thank you for your time.'",
        "'speaker_1': 'Thank you very much. Kim he was the last public speaker. Mr. Pete. I called last public speaker. So I will, sir. Yes, I called last of the speaker already. You want anyone in the audience? I will let you speak because for public comment, please be quick.'",
        "'speaker_1': 'We all recall that public speaker. Go ahead, sir. Quick. So I don't get the whole 3 minutes, so I actually don't even have to let you speak because I recall. Come Speaker said be quick, but go ahead, sir.'",
        "'speaker_1': 'Up there. Go ahead. So you told me I'm getting I'm just saying out of respect, but you can go ahead. Speak. Quick, 3 minutes. Quick. Yeah. So as far as you know, hey, I wouldn't even come up here, but let me switch this out.'",
        "'speaker_1': 'And so I want you to go come on up here. But the lady the young lady spoke and it sounds like she was making threats, like, oh, well, well, they always giving funds to the hotel. You're supposed to put funds to the hotel.'",
        "'speaker_1': 'The Americans. She only she can speak English. She's up here reading off of a paper, you know? Sir, could you please address the issue? Can you please address the issue? If you believe? Because check this out. You know what?'",
        "'speaker_1': 'Check that 8834 B of the penal code is about citizen's arrest. Hey, watch your threats. I organize a brother service officer, you know, stay on topic. We're. I'm telling you. 834 B.S. And I'm not shy about it. I'm not having that.'",
        "'speaker_1': 'This ain't going down in America having non-Americans threatening Americans. You American men and I don't give a damn about. Hey, sir, you know that. You know, you have to stay on topic. Topic? No, you're out. I'm talking about the lady with you.'",
        "'speaker_1': 'Go ahead, sir. I'm going. You didn't tell her she was off topic about threatening Americans, did you? Go ahead, sir. You did. You did you hold on second to the public as as as reprehensible as what's being said.'",
        "'speaker_1': 'But this is he has a he has a right to say it. So continue. Yeah, yeah. Oh, shut up, sir. Anyway, address me. Thank you. Well, okay, you could take that too, but check this out. Hey, the thing is, is America for Americans?'",
        "'speaker_1': 'Okay, and when we up here, I like to see it as such. I don't know. I'm 53 years old. I ain't never seen it like this to where a non American could come with a threat towards an American.'",
        "'speaker_1': 'Hey, I don't know. We ain't having that. I know some yoga don't turn into snowflakes and got sore but we ain't no snowflakes in this side Are we going to melt the snowflakes? Snowflakes melt and they're going to get dealt with just like just like all the people again dealt with now for what they did earlier.'",
        "'speaker_1': 'So back to this issue no more non Americans then we're gonna deal with your own non Americans think you got something going that ain't being forgotten and all of them sorry people this with you so that's a warning.'",
        "'speaker_1': 'That's it. Trump is running the stuff in the United States. Amen. John, thank you. So public comment is now over and now we're going to back to the council. So public comment is over. Thank you very much. So we'll start off with Councilman Pearce.'",
        "'speaker_4': 'Thank you, Mayor, and thank you to all the speakers that spoke tonight. I do want to give a little bit of context and a little bit of my background. When I first came to Long Beach and I first started volunteering, it was before the release of The Tale of Two Cities, which Gary Heidrich, who was wrote the'",
        "'speaker_4': 'foreword for that, is actually here. And what came out of that study was that we had given $1,000,000,000 of subsidies to our downtown tourism industry, and we've done that with zero strings attached. We did that without asking for a play, without asking for a card check, without asking for environmental protections, without any strings attached at all.'",
        "'speaker_4': 'One hotel rent free for ten years on city land. And so for me being here tonight, talking about this tonight, it's been a challenge for me in looking at what the ideal situation would be. Would I like to have things signed in front of me and a guarantee?'",
        "'speaker_4': 'Yes, I would. Do I have faith in the process and the commitment from developers, from labor, from the community members that we're going to have a fair process in the end? I do. And I do want to hear from my council colleagues, but I would like to make some amendments to guarantee us some of that process.'",
        "'speaker_4': 'So I just really want to make sure that those folks in the audience and at home recognize that having a community benefit agreement that's going to be comprehensive. It's the first time we've done this with the hotel development in our downtown.'",
        "'speaker_4': 'I'm going to go ahead and list the amendments that I'd like to make. And so city attorney, if you don't mind. And then do you want to do the play stuff for the requirement? Okay. So first, I just want to clarify on you.'",
        "'speaker_4': 'Make sure I read it right. I want to make sure that we do amend Section 3.2 to require council review before finalizing the sale. As I had asked previously of our city attorney's office, it's a requirement. And so I want to make sure that we do ensure that it comes back to this body before a sale is'",
        "'speaker_4': 'final made.'",
        "'speaker_1': 'You can require that. That's not what I understood you to ask earlier. When we had our discussion, I thought that you were seeking the city would not be able to waive requirements three to H and three to I.'",
        "'speaker_1': 'It would only come back before you if the city proposed to waive either one of those. But if they do not waive them and there is a labor peace agreement and there is a carbon neutrality agreement, then we would close without coming back to council.'",
        "'speaker_4': 'So only if there is a request for a waiver would I like it to come back. Perfect. To be clear, I would also wouldn't mind having a report after that sale is done, a staff report just given to the council so we know where we're at on the process.'",
        "'speaker_4': 'I would like for the restaurant peace. It's one thing that I've always talked about. I think that our downtown is an amazing downtown and we have that balance in between some corporate businesses and some local businesses. And we tend to be a fantastic place where we've got things like the chocolate place and the juice place.'",
        "'speaker_4': 'And so wanting to take an opportunity on the corner of Pine and Ocean to celebrate a local restaurant. Should there be a third party restaurant operator? Just clarifying that the developer would work with the Economic Development Department to identify a Long Beach restaurant for that operator if it is a third party operator.'",
        "'speaker_4': 'So I wanted to make sure that was clear on the record because in the report it just kind of lays it out. Lucy For the workers safety, as you know, as some people brought up today, it is not a it weighs heavy on me that we had a very lengthy meeting about Claudia's law and a two weeks'",
        "'speaker_4': 'later we had an agenda item around giving a subsidy to a hotel. And so it does weigh on me, and it is an opportunity for us to highlight a developer that's saying, hey, we're going to do it voluntarily without even it being part of a labor contract, but we're willing to do that.'",
        "'speaker_4': 'And so I do want to lift up the specifics for me that are important. As I raised at the last council meeting, we talked about this, that the developer has agreed to have panic buttons. I would like to clarify that these panic buttons be given to each hotel employee assigned to working in a guest room without another'",
        "'speaker_4': 'hotel employee at no cost to the hotel employee. And that panic button should be able to communicate with security, not simply be a noisemaker like a whistle that could only be heard on one floor. I'd also like to include establishing a process for the employees to notify their employer about unwanted sexual advances, requests for sexual conduct or'",
        "'speaker_4': 'other verbal or physical contact, which is typically included in a personnel file or not file but protocols. But just wanted to make sure that we highlight that there's a process where an employee has an opportunity to step out and do that.'",
        "'speaker_4': 'Those are the changes that I would like to have included as a requirement for this. And these are changes that I've had conversations with our developer on. And so I now ask my council colleagues to support this motion to approve this total restructuring.'",
        "'speaker_4': 'The benefits to the study are great. Adding the additional rooms is fantastic for our bottom line and having a developer that's willing to do more than just sign a card check agreement or labor peace is the right choice for us in this city.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_1': 'Mayor. May we clarify a couple of the amendments? Sure. Councilmember. Councilmember Pearce, as the deputy city attorney that will be tasked with drafting the amendment, I want to.'",
        "'speaker_9': 'Just bring to your attention to things that might be difficult and ask for clarification. The first two conditions.'",
        "'speaker_1': 'I think are clear. The first of which is that the three two age and 3 to 1 cannot be waived without coming back here. I think it's also pretty simple to include a requirement that the panic buttons or providing immediate contact with security be included for all workers.'",
        "'speaker_1': 'The other two are you requiring that the any restaurant be locally owned, or is it best effort to.'",
        "'speaker_4': 'Best effort with working with our economic development team? If it is a third party. Okay. So it's only if it's a third party and working with them to identify and it's a best effort.'",
        "'speaker_1': 'Okay, great. Thank you. And then lastly, the it had to do with the employment policies with respect to reporting. That gets into quite a bit of detail. Can you provide me with more?'",
        "'speaker_4': 'Yeah, it's not actually reporting. It's just making sure that there's an employee process in place for which the hotel employee notifies the employer, the operator, about unwanted sexual advances, and that they have time on the clock to do that, which is pretty standard in every H.R. policy.'",
        "'speaker_4': 'But I wanted to make sure we lifted that up because we have had so many issues around sexual assault in the industry.'",
        "'speaker_1': 'Okay, great. Thank you. I can certainly draft it that way. If if it's okay with staff and the council, I can do that.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Okay. Thank you. Councilwoman Gonzalez.'",
        "'speaker_2': 'Yes. I want to thank city staff as well. And I know the developer. Gregory spoke with him earlier today, as well as our building trades and unite here. Who is here as well. I think this was a very good collaborative effort and Councilmember Pearce brought forward a lot of great items that I know she worked behind the'",
        "'speaker_2': 'scenes on to make sure we got it right, not just for any city, but for a long beach. And as we know, we try to do things very customized here in the city. And I think this was a really good example of what we could do when we all worked together.'",
        "'speaker_2': 'And for me, I think, you know, seeing that the average hotel investment, hotel unit investment will be $630,000, give or take. We're right now at about an average of 350 to $400000 of investment per unit of hotel speaks volumes to where the city is headed.'",
        "'speaker_2': 'And with that, I really am appreciative that we have these benefits for our community that will come back with all that investment. So absolutely ensuring that there is a project labor agreement, that's something that my office authored a few years back with a few of my council colleagues here that embeds in that 40% of our of the'",
        "'speaker_2': 'workers on site will be local hire. And we'll we'll certainly do everything that it takes to get to that target. And then 10% of the workforce on that specific project will be disadvantaged workers. What's exciting about that is that we know that, like I said, it's an all encompassing project that will include the workforce as well as'",
        "'speaker_2': 'great development. And I have done some research on American life and I've seen the projects and the stature of the projects in other cities like Seattle and other cities in downtown L.A. and it's just fantastic that they're willing to invest their time and money here.'",
        "'speaker_2': 'And as far as that's concerned, I think the only question I had was just clarification. I know I spoke with John earlier today on the six or $7 million that we are going to that we're projected to see within the total that, you know, from the former restructuring plan to now, will that be realized within the nine'",
        "'speaker_2': 'years or within the 20 year term? The nine years, correct?'",
        "'speaker_9': 'Yeah. Councilmember So that the 7 million projection that is cited in the the staff report is just the city's portion of the first nine years.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_9': 'The actual number of four for Tom projected on this much larger project will be 77 million over the 20 years. City will realize an estimated $50 million in total over that term.'",
        "'speaker_2': 'Great. I appreciate that. So I'll just end with saying that we're going from a $165 million investment to a $230 million investment. That's not just dollars. That's workers. It's employment for the city of Long Beach. And I think all of you, again, for being great players in all of this.'",
        "'speaker_2': 'Thank. You.'",
        "'speaker_5': 'Thank you. So I would like some clarification on the amendments and what requirement that puts on the developer, because I have to admit, I'm a little bit confused at this point in terms of what the amendment does to the developer.'",
        "'speaker_5': 'I may have missed that along the way, but I know we can't force them to do certain things, but then we're including them as amendments as part of this contract.'",
        "'speaker_9': 'So I'm sorry, Councilman Price, what what amendments are you referring to? The amendments that are included in the staff report.'",
        "'speaker_1': 'Or the amendments that were made on the.'",
        "'speaker_5': 'Floor? The amendments that were made on the floor.'",
        "'speaker_1': 'So I'll walk through the four amendments again to the extent I remember them off the top of my head. The first one is that right now 3.2 H requires the buyer to execute a labor peace agreement prior to the city's obligation to transfer the property.'",
        "'speaker_1': '3.2 I requires the buyer to I'm sorry, the hotel operator. So it's the buyer's contracted operator to execute a card check neutrality agreement with its employees or agree to do that when it has employees prior to the city's transfer of the property.'",
        "'speaker_1': 'Both of those conditions right now, as the agreement reads, are craveable by city staff, which is normal in purchase and sale agreements. All conditions that run to the benefit of either the buyer or the seller are waiver bbl by the buyer or seller respectively.'",
        "'speaker_1': 'I want the first amendment was not to make those craveable. So those two are hard and fast requirements to the extent that the staff wants to close without either one of those two agreements, that council would have to approve that.'",
        "'speaker_1': 'Is that clear?'",
        "'speaker_3': 'I think so, yes.'",
        "'speaker_1': 'That's the First Amendment. The Second Amendment was the inclusion of a panic button, as it were. And I'm sure that I will be able to work up more detail for the agreement in a commercially reasonable, commercially standard panic buttons for all the employees of the hotel.'",
        "'speaker_1': 'The third one was requiring the developer to use a best effort to work with the city economic development. To the extent that there is a third party operator or there will be a restaurant at the property. Keep in mind that this property may not be developed with a restaurant.'",
        "'speaker_1': 'It may not even be developed as a hotel. There's still the entitlement and squat process to go through, which is completely separate from what we're doing here. And the last request was. That's right. That's right. That last request was the system in place for the hotel operator to work with its employees to take sexual harassment claims and'",
        "'speaker_1': 'make sure that that's not done on the employees time? As I understand it, that would be on the clock. So that's all the detail that I expect to excuse me, including the amendment. Above and beyond what was already disclosed in the council letter, which Mr. Keisler spoke to.'",
        "'speaker_5': 'Okay. So a couple of questions on the panic buttons. How many rooms does this hotel have?'",
        "'speaker_9': 'Councilmember. It's proposed for 416 rooms.'",
        "'speaker_5': 'Okay, that's good. Because as I indicated very strongly the last time this item came before council.'",
        "'speaker_3': 'I believe all.'",
        "'speaker_5': 'Employees should be protected from sexual assault and harassment regardless of the size of a hotel. So it's good to know that this hotel is over the threshold of 100 rooms, which was arbitrarily set in a prior proposal. But but surely that policy should apply to hotels of even ten rooms.'",
        "'speaker_5': 'So that's that's good to know. In terms of the first and second provisions, how is that? I mean, we heard the operator, the owner of the project, talk about their commitment to those the play and working with their employees on the union aspects.'",
        "'speaker_5': 'How are these two amendments changing? What the understanding of the city or the hotel owner? What as to these two elements, how how did these two amendments change that understanding?'",
        "'speaker_9': 'My understanding is that these amendments.'",
        "'speaker_1': 'Don't change the substance of either agreement.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'So the substance stays the same? Yep. Okay. And our contract, our contractual obligation, would not change as a result of these two amendments.'",
        "'speaker_1': 'That's correct. I mean, the contractual obligation would change in that the city staff can no longer waive them. They no longer have a contractual right to waive. They have to come back to the council.'",
        "'speaker_5': 'Perfect. I understand that. I'd like to hear from my colleagues on this, but I think some of the amendments are definitely make a lot of sense, like the panic button. And I support that entirely. Thanks.'",
        "'speaker_1': 'Thank you, counsel. I'm in Austin.'",
        "'speaker_7': 'Thank you very much. So this is a been a very, very interesting discussion thus far. I was really struck by listening to public comment, particularly those from labor. I'm thrilled that this hotel is in the works. I think it's going to be a great luxury hotel potentially for our our downtown skyline, but also for to improve economic'",
        "'speaker_7': 'development. And it's been mentioned it's going to create jobs, construction jobs and hotel jobs as well. I was struck by the comments. Labor clearly is not on the same page and not monolithic on this particular item. And so from time to time, there are disagreements within even the House of Labor.'",
        "'speaker_7': 'And I think that speaks to some of the leadership today. I think these are this these kind of public disagreements should be avoided in the future. But I'm curious regarding the amendments, and I appreciate the effort put forth.'",
        "'speaker_7': 'We want to make sure that we we have a sound public project. Labor agreement is something that the city has worked towards for some time. We've actually, I think, work toward getting card check neutrality agreements as well. I don't think this would have been accomplished or even be entertained five years ago or with council's previous to this'",
        "'speaker_7': 'council. And so I think we've come a long way as a city. But regarding the the amendments I gave, number one and number two, I'm fine with. But in terms of what we are doing this evening, it's it's creating a in agreement with the developer correct over TLT and some of these issues will be borne out after'",
        "'speaker_7': 'the hotel is actually developed in. We're talking about operations of a hotel. And so my question is what and I was going to ask this question is what enforcement mechanisms will the city have, you know, after this hotel is built, should any one of these provisions not be adhered to?'",
        "'speaker_7': 'For example, number four or number two, what what what provisions what kind of enforcement can can can happen at that point? At this point, we're talking about a well, an operator that we don't know who is going to be.'",
        "'speaker_7': 'Right. Right. We would hope that they have a contract neutrality and a collective bargaining agreement in place which could be negotiated at that point. But but what kind of this is this is what kind of enforcement is.'",
        "'speaker_1': 'Councilmember Isom? That's a good question. The enforcement before the sale would be that they don't get the developer doesn't get the property, which which is a pretty big hammer to wield. However, at their after after escrow closes, the city would have very limited enforcement powers over that.'",
        "'speaker_1': 'But the idea would be that the developer won't get the property until such time as an agreement is signed with the union providing for the panic button. So it would be incumbent upon the organized labor to then enforce its rights under the written agreement, which I would expect it would be able to do on an ongoing basis'",
        "'speaker_7': '. And so, with what I understand, organized labor coming back or enforcing their rights with their collective bargaining rights, but would they come back to the city or would we be the arbiter at that point, or would that be?'",
        "'speaker_1': 'No, I think the courts would be the arbiter at that time. Okay.'",
        "'speaker_7': 'Thank you for that. I will. I'm looking forward to hearing more and more comment and conversation about this. Again, I'm in the spirit. I am certainly supportive of of building and developing a hotel in our downtown. I think it's necessary, particularly on that that corner something this is something that we should be be working towards.'",
        "'speaker_7': 'I want to congratulate and thank our staff for negotiating what I believe is a creative agreement that gets to yes with American life. And I want to thank American life, the president, for being here personally and for for his commitment.'",
        "'speaker_7': 'I've done some research on the developer. They've had some very great projects throughout the country, throughout the downtown L.A. area. And I hope we're able to to reach an agreement. Here this evening to help to move forward with something that I think is will be an economic development boon for the city of Long Beach.'",
        "'speaker_1': 'Thank you, Councilman. Councilman. Mongo.'",
        "'speaker_3': 'Thank you. I am so excited about this project. I think that I hear from my colleagues that their support to build another hotel in downtown Long Beach. I think that it's great jobs, great local hire program. Locally owned and operated restaurant opportunity.'",
        "'speaker_3': 'I think that a lot of credit goes to the staff for all your work on this. The developer for coming to the table, labor for coming to the table. I think that it's a tipping point for Long Beach and I think the projects like this will continue to come forward at a benefit to the city and a'",
        "'speaker_3': 'benefit to the residents. It is no wonder that we are seeing record levels of lower the lowest levels of unemployment in our city's recorded history. Local hire programs create that, and that is really important. We're also seeing impressive household income growth, unlike is being seen in the rest of the country.'",
        "'speaker_3': 'We are top we are number seven in the country for income growth. And projects like this continue to contribute to that. And so thank you to everyone who cares about our neighborhoods. And thank you for working through this together.'",
        "'speaker_3': 'I look forward to a ribbon cutting.'",
        "'speaker_1': 'Thank you, Councilman Ringo. Thank you, Mayor. What a difference a couple of weeks makes. While I'm very, very amazed at this city council, I'm very proud of the city council today because of the support that they are giving.'",
        "'speaker_1': 'Not only a new development, not new perhaps, but new to the city of Long Beach and their willingness to adapt and change and include some of those key points that we want to have to protect not only workers, but to give jobs to people.'",
        "'speaker_1': 'And I think that that's amazing. I want to thank, of course, Councilmember Pearce for taking that bold step and included some of these items in there and in her amendment to the project, because I was already looking at the possibility of us not strong enough, we need to include support announced by.'",
        "'speaker_1': 'The bottom line is that as long as we have a labor agreement, then a project that's going to be working for Long Beach, it's going to be unprecedented, from what I understand, for us and for the region. I think it speaks volumes about the city council, how progressive it is, how mindful it is of all of its'",
        "'speaker_1': 'responsibilities to not only its residents, but to the working class and to the working people of Long Beach. So thank you very much. I will be supporting the item. Thank you. I know that all the other council members have spoken.'",
        "'speaker_1': 'I want to just say just one thing and then we'll go it will go to the vote. I want to just you know, this is have been a parcel of land that's been empty for decades. And I want to thank, obviously, the team that's come forward to develop.'",
        "'speaker_1': 'What is going to be Long Beach is first a four star hotel. It's going to be incredible activator and job creator. I want to thank, of course, our partners in labor the fact this will be the largest private labor agreement, I believe, in the entire city.'",
        "'speaker_1': 'You guys are going to build a pretty substantial project and I just want to congratulate all the good jobs are going to be created. I think it's great and complete as we did the first time support. There'll be a contract agreement.'",
        "'speaker_1': 'And of course, this is also going to provide millions of dollars of economic development into into the city as well as into the jobs from boat for both the hotel workers on site, the food service workers. And of course, the workers are going to be building this incredible structure on the corner of ocean and pine.'",
        "'speaker_1': 'So these we're the largest hotels in the city. This will be also, I believe I was talking to our economic development folks, Mr. Chrysler, but it will be it's one of the largest hotel construction projects, I believe, happening in the state of California.'",
        "'speaker_1': 'If that's not if that's not correct. Is that right?'",
        "'speaker_9': 'Honorable Maria. It's one of the most certainly per room. It's the one of the most expensive.'",
        "'speaker_1': 'Okay, good. Well, good. Okay. Excellent. Well, thank you. Look forward to seeing this thing come out of the ground next year. I want to thank the councilmember. I want to thank the the the staff who worked incredibly hard and also want to thank the folks that don't get a lot of thanks often.'",
        "'speaker_1': 'But you guys worked so hard on this to our city attorney team. Thank you for the years of this work. So, member, please cast your vote. Motion case. Thank you very much. Great. Okay. We are now. That's believe it or not, we're about to start the regular agenda, which is crazy.'",
        "'speaker_1': 'So the hearings are over. We're going to we're only going to one request to move an item up. So we are going to hear the first. Two things we'll do is hear the item and then consent calendar. I'm sorry, then public comment, then we will do a consent calendar.'",
        "'speaker_1': 'So we are going to do Councilman Austin's item.'",
        "'speaker_0': 'No, no, no.'"
    ],
    "Report on Urban Educator of the Year Award.": [
        "'speaker_1': 'I'm sorry. Oh, I'm sorry. That was the item. I meant the item for Dr. Williams where I'm looking at the wrong one that got moved up. Item 26, 26.'",
        "'speaker_0': '171717.'",
        "'speaker_1': 'Communication from Councilwoman Gonzales. Councilman Andrew's recommendation to receiving file a report from Long Beach Unified School District Board member Dr. Felton Williams on the 2017 Urban Educator of the Year Green Gardener Award. You anyway. Fine. Thank you, Mayor.'",
        "'speaker_1': 'First of all, this is going to be very exciting for me to be able to present this award to a very outstanding individual, because the fact that the work that he's done, not only in the city of.'",
        "'speaker_0': 'Long Beach International, this individual, he is someone that.'",
        "'speaker_1': 'You will not only hear about tonight, but you hear about this guy all over the world, because I can just see that's the type of movement he has in his heart. And so, you know, my colleagues, I'm bringing, you know, basically great joy to celebrate the work of this long time friend and colleague, Dr. William Felton.'",
        "'speaker_1': 'And, you know, his enthusiasm for education, youth has spanned decades, decades, and he's an advocate and a change agent in programing for marginalized communities. His leadership has been recognized on a national level, earning him the national highest honor as an urban educator of the year.'",
        "'speaker_1': 'Great job, Dr. Felten, and I want you to keep the work. And so after this, I would like to I'd like to bring this ad, my colleagues, you know, help me pass this. And I have I know I have some other people want to speak on this item.'",
        "'speaker_1': 'So, you know, we'll wait until after this and I'll have a certificate I'd like to give. Absolutely. Councilmember. Councilman Gonzalez.'",
        "'speaker_2': 'Yes. So I have a few things to say. So thank you so much for being patient, everyone with us. This is definitely something that deserves a lot of time. So a bit about our distinguished, honorable Dr. Felton Williams.'",
        "'speaker_2': 'He worked in education spanning about 45 years. From 1972 to 79, Dr. Williams held several administrative positions at Cal State Long Beach, which include administrative analyst, instructional services, administrative assistant to the Director of Public Policy, Administration, and Supervisor of the Learning Assistance Center.'",
        "'speaker_2': 'During this time, he helped develop computer assisted registration and the Public Policy Administration Graduate Program. Dr. Williams also served as the Director of Affirmative Action and Assistant to the President from 1979 to 1994 at Cal State Dominguez Hills, when Dr. Williams was dean of the School of Business and Social Science at Long Beach City College.'",
        "'speaker_2': 'He was elected onto the school board. Since then, he has been a proponent of the academic and career Success for All Students initiative that recently established Ethnic Studies program with Cal State, Long Beach and Long Beach City College Promise.'",
        "'speaker_2': 'Dr. Williams was recently awarded the 2017 Urban Educator of the Year from the Council of the Great City Schools. This award was named after Richard Green, first African-American chancellor in New York City, and Edward Gardner, former Denver school board member.'",
        "'speaker_2': 'And it comes with a $10,000 scholarship to a student in the winner's district. We're looking forward to who you select. And it is no secret that his passion in ensuring that every student in Long Beach succeeds definitely matters to him.'",
        "'speaker_2': 'And Dr. Williams, we thank you for your service to students in our city and we congratulate you. Thank you so much for being a friend. He and I share a family hometown. I grew up in a few different places, but San Pedro is where we call home to many of our family members.'",
        "'speaker_2': 'And so we have that bond and connection. And I really appreciate you being here and thank you for your work. I think now, Councilmember Andrews, there's a video that will play on behalf of Dr. Williams.'",
        "'speaker_1': 'Congratulations, Dr. Williams, on the 2017 Green Garner Award. We can't thank you enough from the Lumbee Unified School District for everything that you've done for our young people from the day that you stepped on as a board member.'",
        "'speaker_1': 'You've been a huge advocate for equity and access for all of our kids. And because of your efforts to lead our initiatives, our district is recognized as one of the best in the nation. You truly have transformed the lives of thousands of young people and our entire community.'",
        "'speaker_1': 'So on behalf of all the children, their parents, our teachers, our community stakeholders, and the Board of Education and myself, thank you for a job well done. Williams has the wherewithal to. Reach back on life experiences that none of us on the board.'",
        "'speaker_1': 'He brings those and the most meaningful way to policy, to discussions. To better the future of our kids in business schools. He advocates for programs that benefit students. He's an articulate voice on the in their defense and on their behalf, as well as for the teachers.'",
        "'speaker_1': 'He understands that the teachers and the classified staff, the community as a whole is all part of this effort. We also saw some great injustices in this community and actually. And so he dedicated his life to be the change process and to.'",
        "'speaker_1': 'Part of the process. You know, one says you can't bring the change process unless you have a seat at the table. I think Dr. Will and Sara, he knew that education was the key. So we went into the military.'",
        "'speaker_1': 'Came back through the GI Bill, got his education, gets his Ph.D. from Claremont. So he not only is a great role model for other African-Americans and for all students, he is one who models on a daily basis what one should do if they want to bring about change.'",
        "'speaker_3': 'I think for his own upbringing and maybe some of the challenges or the injustices that he's seen in his own life has helped him to perhaps see that in.'",
        "'speaker_4': 'Others and.'",
        "'speaker_3': 'Want to create a way in which people can excel, be able to move forward. His work in the NAACP, I think, has a lot in terms of building his character and his passion for education and just. We were wanting to create a around that because we know the drive system.'",
        "'speaker_1': 'Is seeing students succeed. He wants to close that achievement gap. He wants to see students graduate from high school. He wants to see those students go on to college, enjoy successful careers, and have successful lives. He knows the risks.'",
        "'speaker_1': 'We're done. So for him, it really is about getting as close to the end zone as possible so that we can share the rest of the nation. How this can be done in the general with the Legion of Ideas has been growing nationwide, but I think Dr. Ruth.'",
        "'speaker_1': 'It gives it further emphasis. It's nice to read about a district in its successes. When you have an individual as articulate and well-informed as Dr. Williams. In that message forward. Personally, it makes a tremendous impact. I think what gives them the greatest satisfaction is knowing he's made some contribution to the welfare of others.'",
        "'speaker_1': 'And that's what motivates.'",
        "'speaker_4': 'Now. Karen.'",
        "'speaker_1': 'I'd say equity. Charismatic integrity and I would say commitment. A great board member should be.'",
        "'speaker_10': 'You're going to speak for the city, which is.'",
        "'speaker_1': 'Great. And we do have a couple. Let me get to a couple of the council members and then I'll have Dr. Williams come up. Councilman Price.'",
        "'speaker_5': 'Thank you. Well, Dr. Williams, congratulations. I'm so proud to know you and to hear about your accomplishments. That video was beautifully done. As a council member, I'm very proud to have you here with us today so that we could recognize you for this.'",
        "'speaker_5': 'But more importantly, I'm really proud as a Long Beach Unified School District parent. I started my political career by being active on my PTA, and so I am very much in tune with the needs of our students and the expectations of the parents in terms of what the.'",
        "'speaker_3': 'School board does.'",
        "'speaker_5': 'And the satisfaction that parents in my circle have with the way that Long Beach Unified is run. And that has a lot to do with you and your leadership and that of your colleagues. So I congratulate you not as a council member tonight, but as a as a parent of two children in the very district that you'",
        "'speaker_5': 'have worked hard to build and strengthen. The only thing I will say is I was very disappointed that there was not a Wilson cheerleading squad in the final shot. But Councilman Andrews and I have an ongoing rivalry as I'm about to become a Bruin family member.'",
        "'speaker_5': 'But one of the things that I love about our school board is that you understand, celebrate, appreciate that diversity and that that level of levity that we have when we have the banter back and forth about our schools.'",
        "'speaker_5': 'Because really, at the end of the day, it's every single one of these schools that's fantastic and offering our kids opportunities every day. Thank you for being a role model to them and inspiring all of us in terms of your leadership.'",
        "'speaker_5': 'I appreciate it. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Austin. Thank you. And I'd like to just.'",
        "'speaker_7': 'Also take this opportunity to congrats, congratulations. And I say congratulations to Dr. Williams for the honor. I'm glad that you're here. And I'm glad my colleagues brought this item forward to give you your due respect as an education leader, as a champion for mentoring in our city, young men and boys of color an example and as a'",
        "'speaker_7': 'class example of an elected official who carries himself with great integrity. I've watched you've been involved for many, many years. He is always been a voice for equity and of course, quality education and a steady force for poor in our city.'",
        "'speaker_7': 'He's everywhere. And all the events, he's he's popping up and making sure that he's representing the school district to the fullest. I want to also thank you as a parent in our schools. I want to thank you for the work that you do to impact the lives of students and parents along with unified and throughout our state'",
        "'speaker_7': '. You are certainly known and have helped put Long Beach on the map as a as a league leading and distinguished district. And on a personal level, you have been a friend and a confidant and a mentor on so many levels.'",
        "'speaker_7': 'Again, it's my honor here. And thank you for all you do.'",
        "'speaker_1': 'Thank you. Councilman Ringo. Thank you, Mayor. I've had the privilege of working with Dr. Williams for many, many, many years. We worked together one at one time, Islamic State, when he was there at the Learning Assistance Center, and I was across the hall at a tutoring center, and we were both worked together for a while.'",
        "'speaker_1': 'And then we saw when our different ways and we came back together again when I was a member of the Board of Trustees at Army City College, and he became a board member at the at the Board of Education.'",
        "'speaker_1': 'And we worked together to help put to to craft what is now known as the College Promise, which is a nationally recognized program that puts brings together community colleges and school districts to create student success, not only locally, but nationally.'",
        "'speaker_1': 'And so I want to congratulate you on that as well and congratulate you on your award. Well-deserved. Thank you very much, Councilman Mongo.'",
        "'speaker_3': 'I was an echo the comments of my colleagues. You're such a role model to so many. And you do so much for the community, not just what you do on the board, but what you also do for the community and the nonprofits and the churches and every other group that you touch.'",
        "'speaker_3': 'And so thank you and thank you for being there to take coffee on a Saturday to be a mentor, because that's really important to the future of of Long Beach. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Supernormal. Congratulations, Dr. Williams. I just have a very quick anecdote. If you want to know where Dr. Williams priorities lie. Last week, we were all set to celebrate this night here in council chambers, and there was a conflict.'",
        "'speaker_1': 'So rather than come here and get all this praise, he went to a ribbon cutting at Browning High School. So that tells you what he's all about. Thank you. Thank you. And Dr. Williams Felton, obviously a huge congrats.'",
        "'speaker_1': 'We're so proud of our school system. We're so proud of your leadership locally and across the country. And I want to invite you to come up and say a few words. And as Dr. William is coming down, I just want to let you guys know, if you decide to change this profession, Dr. Williams can say, yeah, yeah'",
        "'speaker_1': '. Thank you all so very much. Good evening. Good evening. Honorable Mayor Garcia, members of the city council. Thank you all so very much for your wonderful comments. Let me just take a quick second to introduce two of my colleagues that are here tonight, our board president, Megan Kerr.'",
        "'speaker_1': 'She's here and my fellow board member, John McGinnis, which you both stand, please. Thank you so much. And to Councilman Andrews and to Councilwoman Gonzalez, thank you so much for this opportunity for my hometown girl from San Pedro.'",
        "'speaker_1': 'And if you don't see it right, we know you're not from San Pedro. Some people try to pretend that they're from San Pedro, but they just don't get it right. But a home grilling for Councilman D Andrews who spent so much time over there, you may as well have been from San Pedro.'",
        "'speaker_1': 'So the I really want to basically just say that, you know, even though I was a recipient of the award, the award is about much more than me. And if I can just quickly just highlight some of the notes at the event in reference to that award.'",
        "'speaker_1': 'And so I want to just take a moment to read that information. It's about my appreciation to Aramark and Scholastic for their continued sponsorship of this award. More importantly, I deeply appreciate the continued efforts to add value to the lives and aspirations of urban schoolchildren throughout America.'",
        "'speaker_1': 'And in today's climate, this support is more crucial than ever. I want to extend my appreciation to the men and women and students of the Long Beach Unified School District for adding meaning to my life. They take their responsibility seriously in the worst of times, in the best of times.'",
        "'speaker_1': 'They are committed and resilient and work diligently to provide challenge and opportunity to each and every student. Added to that, as a city government under the leadership of our current mayor, Robert Garcia. That, along with the other district partners, do not hesitate to serve as a crucial link to the success of our students.'",
        "'speaker_1': 'Recently, the Long Beach Police Department sponsored a shopping outing with students from Washington Middle School shot with the Cup. Other partners have stepped forward to provide free eye examinations and glasses to every student in the district who needed them.'",
        "'speaker_1': 'Similarly, the city prosecutor, Doug Halbert, has worked with the district on a consistent basis to fashion programs for our students and their families that are fair and compassionate. Other activities, such as free school uniforms, are provided to students who are unable to afford them.'",
        "'speaker_1': 'Just to cite a few examples of the individuals and organizations that make Long Beach what it is. We had approximately 500 business partners when I first joined the board in 2004. Thanks to the great work of our staff, we now have over 1500 business partners who provide every conceivable form of support imaginable.'",
        "'speaker_1': 'This was the climate in Long Beach and it is an enduring one. It is a testament to the broad level of community and business support in the city. I want to thank our superintendent, Chris Steinhauser, who does not waver in the face of challenge, particularly when it comes to ensuring equity and opportunity for each and every student'",
        "'speaker_1': 'in the district, as evidenced by providing district supported PSAT and SAT exams. Khan Academy Pairing University have some ethnic studies classes just to name a few. His support has been unwavering in responding to the challenges and academic success of students across the board.'",
        "'speaker_1': 'And it has been my sincere pleasure to work with him. He is not only the superintendent of one of the nation's most effective and nationally recognized urban school districts that is recognized for its efforts in closing the achievement and opportunity gap.'",
        "'speaker_1': 'But he is also my friend. During my 13 year tenure as a member of the Council Great City Schools to include serving as its chair, I've come to truly appreciate the important work of the Council on behalf of the nation's urban school districts.'",
        "'speaker_1': 'That work is and remains first class. My thanks to the men and women of the Council who continue to endure and claim the moral high ground on behalf of our students. They are indeed blessed with excellent leadership and the person of the Executive Director, Michael Casserly.'",
        "'speaker_1': 'And finally, to be the recipient of the Green Gardiner Award is a testament to the many people who work day in and day out. None of us make such opportunities on our own. And again, I want to thank Councilman De Andrews and Councilwoman Linda Gonzalez for this opportunity to be with you this evening and to take people'",
        "'speaker_1': 'who are here tonight who came to support me. And I would like to ask them to stand, please. And again, thank you all so very much. BOLTON We're going to come up there real quick. Why don't we all go up and take a photo with better.'",
        "'speaker_1': 'Be.'",
        "'speaker_0': 'You might want to put that back to Susie.'",
        "'speaker_1': 'What is this place? I told you. You like to speak? When the doctor speaks for me, I have to tell him time is up. This guy is a great archer. I can say.'",
        "'speaker_0': 'Thank you. Okay. Here we are. You go down there. Okay. We're going to look over here real quick. All right. Okay. Yeah. Doug. You guys very good. John McGinnis. Everybody. Everybody.'",
        "'speaker_3': 'It's all right.'",
        "'speaker_0': 'No, no. Come on. Let me go. Come on, you guys.'",
        "'speaker_1': 'We're trying to get everybody to squeeze in.'",
        "'speaker_0': 'Please. She's coming. Come up. She's coming. Yeah. You stand right here. Don't worry. Yeah. Yeah. There we go. Okay. All see it? All right, everybody, that's easier to do. One more. Awesome. Thank you so much. Thank you so much for waiting.'",
        "'speaker_1': 'Okay is a public comment. Dr. FELTEN Before we see none. Dr. Williams, congratulations again, and let's give him another round of applause. Okay. I apologize. So it's just the the the second the second agenda item that was asked to move up and that was some.'",
        "'speaker_1': 'We'll do that one. That's the last one. I'm sorry. Please vote. Cast your vote out, please. 25 married into public comment. And that would it be a public comment?'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Review of the City's Unlawful Harassment Complaints Policy and Procedures.": [
        "'speaker_1': 'Okay. So it'll be, it'll be item 20 then public comment and consent. I don't know, item 20. That's not the item. You wanted to name Mr. Aston, because it's not quite 19.'",
        "'speaker_0': 'It's just 20.'",
        "'speaker_1': 'It's item 20. Go ahead.'",
        "'speaker_0': 'What do you think?'",
        "'speaker_7': 'Thank you, Mr. Mayor. And obviously, I want to thank all my my colleagues also for signing on to this very timely and important issue facing workplaces throughout our country today. In the past two months, the nation has seen a transformational moment and how we address the magnitude and pervasiveness of the problem of inappropriate sexual contact in the'",
        "'speaker_7': 'workplace. Numerous high profile reports of harassment and abuse in fields such as entertainment, media, hospitality and government as well as through the MeToo social media campaign, have prompted many organizations to reexamine their policies and procedures to make sure that we promote a safe work environment.'",
        "'speaker_7': 'The victims of unlawful harassment feel comfortable coming forward and reporting. This is about ensuring that we are fostering here in the city of Long Beach a work environment and that we do not. A respectful work environment. And that we do not tolerate an abuse of power or a lack of respect or professionalism.'",
        "'speaker_7': 'I would like to thank our Director of Human Resources, Alice BASKAS, for for being here this evening and would ask that she provide us a brief overview of our existing policy and procedures regarding unlawful harassment or sexual harassment.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'All.'",
        "'speaker_3': 'Good evening, Mayor. And City Council members and the City of Long Beach has several policies regarding a EEO related to unlawful discrimination and harassment in the workplace. Those policies are posted online and they're also provided to city employees when they're onboarded as new employees.'",
        "'speaker_3': 'We also provide mandated sexual harassment training to our supervisors and managers. And also employees can file a complaint at five different places if they can file a complaint informally with their supervisors or managers, with the EEO counselor at their department, or directly with the H.R. department, EEO citywide counselor.'",
        "'speaker_3': 'They can also file complaints with outside agencies such as the State DFA or the federal EEOC. They can file those directly with those agencies. Employees can also file complaints or lodge a complaint with the city auditor. And if that happens, those complaints are then referred over to H.R. for investigation.'",
        "'speaker_3': 'I think I covered basically what is a just a high level overview. And if there are any specific questions, I'm happy to cover that.'",
        "'speaker_1': 'Okay. Follow up with a couple of quick questions. Does the city's.'",
        "'speaker_7': 'Policy currently address bullying and intimidation in the workplace, whether or not it's due to a progressed protected class?'",
        "'speaker_3': 'So in broad terms, our policies do cover harassment in the workplace. So if an employee came to us alleging harassment in the workplace, we would investigate it. And that also is covered in the state policies.'",
        "'speaker_7': 'And is our. Is your department currently looking at doing any ways to provide any sort of additional avenues for victims to report harassment, such as a.'",
        "'speaker_0': 'Hotline?'",
        "'speaker_3': 'So we are currently exploring the feasibility of of user utilizing a hotline type of avenue for individuals to file complaints. I recently came back from a H.R. conference last week and talked to my colleagues from the City of Los Angeles who are also looking at that.'",
        "'speaker_3': 'And we're going to be collaborating together and looking at the feasibility of having such a such a process for individuals to file complaints using a hotline or a one 800 number.'",
        "'speaker_7': 'And how can you explain how such complaints are investigated? Are they done internally or are they done by outside investigators?'",
        "'speaker_3': 'Yes. So there are various different types of investigations. We are policies called for and we prefer that complaints to the extent possible can be resolved informally with the supervisor and manager. However, if that's not possible, we will conduct a formal investigation.'",
        "'speaker_3': 'If someone wants to file a formal complaint. We will use either inside or outside neutral investigators to conduct an investigation, including conducting an intake with the complainant and also interviewing any witnesses, reviewing any documentation. And we also consult with the city attorney's office in conducting our investigations as we are progressing through the investigation or need assistance.'",
        "'speaker_1': 'Okay. Thank you. And I just.'",
        "'speaker_7': 'Wanted to just address some some of the comments that that were made earlier. And, you know, in case anybody wants to twist this issue into something else. As chair of the city's Personnel and Civil Service Committee, I really felt a need to have this discussion this evening and the responsibility to bring it forward along with my colleagues'",
        "'speaker_7': '. So I'm and I'm really glad we have a very diverse council to have this discussion this evening. Recognizing that the employees understand the intent of this item is to discuss and reaffirm our city's policy on unlawful harassment and sexual harassment to make sure that we're sending a clear message as a council that such misbehavior will not be'",
        "'speaker_7': 'tolerated in any workspace in this city. We as a council also have a direct responsibility to our city's workforce, and we have a responsibility to the taxpayers of our city. And so this is why we I brought this item forward.'",
        "'speaker_7': 'I look forward to hearing from my colleagues. I would ask that you go ahead and and and but but also I wanted to also point out that the motion tonight requests that the city manager report back to the city council, in addition to review the city's current policies and procedures.'",
        "'speaker_7': 'What we're doing this evening and look at how the city and how city employees are informed of how they can file a complaint. A breakdown of the complaints the city has received over the last five years, and recommendations on possible changes to the policy to ensure that it is also victim friendly.'",
        "'speaker_7': 'And so with that, I ask for my my councilmembers colleagues to support this item, and I look forward to hearing further their comments as well.'",
        "'speaker_1': 'Thank you. Councilman Price.'",
        "'speaker_5': 'Thank you. I want to thank Councilman Austin for bringing this forward. I know that there are many organizations and entities who are reevaluating their policies around the nation based on the national conversation and what what I think I hear the intent of Councilman Austin and from what I know of my colleagues to be, is that it's not'",
        "'speaker_5': 'just about creating a policy or revising our policy. It's about the culture. It's about the type of culture that we're setting as leaders and the type of environment that we want to create. And so to the extent that city management, the city manager and his team are listening and identifying some best practices that can be utilized to'",
        "'speaker_5': 'not only identify areas where our current policies can be strengthened, but also areas where we can provide additional training for our department heads and possibly even our employees of how to create spaces that are safe for the employees.'",
        "'speaker_5': 'One of the things that I have often said in regards to trainings that I've been involved in for with managers for H.R. related issues, is that when people come to work, most people go to work because they have to in order to support their families.'",
        "'speaker_5': 'And so to have to go to work and be in an environment where you are subjected to things that are offensive, the where you're being bullied, where you might be feeling uncomfortable in terms of your space every day is definitely not an environment that should be tolerated.'",
        "'speaker_5': 'So to the extent that city staff can develop best practices to not only make that culture known, but also provide ways to investigate corroborated claims where such policies are not followed. I think it's important for us to be able to do that.'",
        "'speaker_5': 'So again, I commend Councilman Austin for bringing this forward and making sure that we are keeping at pace and in some instances ahead of the national conversation regarding workplace policies designed to prevent this type of incident or.'",
        "'speaker_3': 'Behavior at.'",
        "'speaker_5': 'Workplaces. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_2': 'Yes, I just want to say that, of course, I will absolutely support an item that looks at sexual harassment and sexual assaults. It's absolutely something I believe in. It's something I'm passionate about. And as this item starts, it actually starts with over the past two months, numerous high profile reports of inappropriate sexual conduct in the workplace that'",
        "'speaker_2': 'prompted a national discussion about sexual harassment. What I find a little troubling about that is that why it took high profile reports for us. Actually have a discussion about this item to actually bring this forward to this this council.'",
        "'speaker_2': 'And so instead of being and I don't feel and absolutely I'm going to support this and I have a question relative to what we can make do to perhaps make it stronger. But what I would like us to do when we're looking at policymaking is to be more proactive versus reactive, because now this just looks as though'",
        "'speaker_2': 'we're reacting to everything going on because a celebrity decided that they wanted to come out with a high profile issue. And so I don't believe in that type of policymaking. I want us to be able to get in front of something before this happens or when people start coming out in various industries, not just the municipal industry'",
        "'speaker_2': '. So I will say that and I hope that we can stand committed to making sure that whatever this policy is, that we look forward, as I mentioned, to other industries and and especially as we brought forward the hotel housekeepers to ensure that that stays the topic of discussion.'",
        "'speaker_2': 'I will ask, though, that I believe, Alex, that the state requires sexual harassment training each year. Is that correct?'",
        "'speaker_3': 'That's correct. Every two years, supervisors and managers must go through a two hour training course that is meets state requirements. And we actually just completed that in 2017 for our supervisors and managers.'",
        "'speaker_2': 'Perfect. And so that's just supervisors and managers, though. So is there any way for us to expand that above and beyond what the state requires, to require everyone to do some sort of sexual harassment training? I do that on my private side of life.'",
        "'speaker_2': 'Everyone does the training, whether you're a manager or not.'",
        "'speaker_3': 'So that's something certainly we are looking into also expanding, providing some type of a course to all city employees, non supervisory non-management employees. We're we're right now exploring the feasibility of doing that, whether that be it on an online type of system or in classroom type coursework.'",
        "'speaker_3': 'So we are looking at the added ways of delivering that type of training.'",
        "'speaker_2': 'Great. And I was just going to ask about that because I know that video. I mean, if we can make it easier on people to take a at least a video so they can see scenarios in which they can understand what sexual harassment and assault actually mean in the workplace, I think that would be great.'",
        "'speaker_2': 'So other than that, I extend my support. Thank you very much.'",
        "'speaker_4': 'Thank you. I do want to, you know, recognize that the conversation we had several weeks back, one of the discussions was making sure that we take care of our our house first. So I want to, you know, applaud us for doing that.'",
        "'speaker_4': 'I have lots of thoughts and I did a PowerPoint, but I'm going to save it and I'll share it with you guys at our next meeting. What I do want to include are some talking points and some facts.'",
        "'speaker_4': 'So we ground ourselves. We're having a conversation about policies and procedures which sometimes can be very dry and pull us away from the reality. The reality is that over 50% of people that have said that they've experienced sexual harassment on the job do not report it for fear of losing their jobs.'",
        "'speaker_4': 'That 80% of those that experience sexual assault on the job are women. That we spend over $120 billion a year as a national government on workplace violence cost. And so I just want to ground us also in the fact that it's not just sexual assaults that we're talking about with the hashtag MeToo, which was cited in the'",
        "'speaker_4': 'item, but that there's other types of violence and bullying and yelling and threats that can happen. And we need to have an H.R. policy that understands that violence and understands the trauma that people experience, men or women, when they go through violence at home, as children, as adults, and how that trauma can be triggered in the workplace'",
        "'speaker_4': '. And so while I would love for us to have a policy that is inclusive of gender and inclusive of making sure we have a one 800 hotline, which I support, making sure that we have a video training that is not just for supervisors that all of us have to take.'",
        "'speaker_4': 'I want my staff in my office to understand how to deal with those that have experienced sexual violence or bullying in the community and in my office. So a trauma informed policy is what I hope that you can come back with, because I know in my experience it.'",
        "'speaker_4': 'There are spaces that do not feel safe that are supposed to be safe. There are processes that are supposed to support victims that do not support victims. And while we say as a whole that we want that culture to be there, unless we're talking about it and doing it every single day, it falls through the cracks.'",
        "'speaker_4': 'And if I felt that way, then our lowest paid staff person at City Hall, I can't imagine how they feel if something happens, whether it's a offhanded comment and making sure that we're being trained. I'm not assuming because they had poor work habits, that they're just complaining and blowing something out of proportion.'",
        "'speaker_4': 'So I believe after a lot of conversations that this council has had, that our city attorney's office has had and directors that a trauma informed our practice is what we have to do in in the city. And so I wanted to make sure that we feel that gravity, especially with the fact that in our management we are'",
        "'speaker_4': '60% male in management and that we are 39% women. Then in Non-Management, it's 39% male and 60.8% women. And with the numbers of statistics that we have around that abuse that we have to recognize, we have to go above and beyond trauma.'",
        "'speaker_3': 'I just want to make.'",
        "'speaker_4': 'Sure I don't. And I want to also call out and recognize that as a city, I want to ensure that our legislative department is treated the same as all of our departments whenever it comes to training, cultural sensitivity and expectations for processes.'",
        "'speaker_4': 'If a complaint is made that that goes into someone's file, that their process is fully being run through, and that the 14th floor is not treated any differently than any other department. I'm not saying that's happened. I just want to ensure that that is a process that is there.'",
        "'speaker_4': 'And then again, I want to echo what my my colleagues said. Councilmember Gonzalez. It's about prevention, creating a safe culture, trauma informed practices, and exploring options around safety and health managers. In the policy that we have, I don't see, I didn't know.'",
        "'speaker_4': 'And so I asked my staff to give me this policy that we even have a equal opportunity office that will notify and that there is an actual counselor or designee. How do how does each department know who that designated person is?'",
        "'speaker_3': 'So each department has an administrative officer so that the they and that person is usually the EEO counselor for that particular department. And then there's also a city wide one. We just recently revamped our brochure that is provided to city employees, and we also translated it into Spanish and we have that available online.'",
        "'speaker_3': 'We're looking at disseminating that to each employee and with a piece for a pay stub staffer. And so it also, as I indicated before, employees are informed when they're onboarded initially about our policies and and provided the brochures.'",
        "'speaker_4': 'Thank you. I don't think I got any brochures when I came on, but, you know. Thank you. I would also like to say one thing that was in the sexual harassment piece that we were looking at for the hotels included having a third party, whether it be a nonprofit, their own attorney or the police present whenever filing'",
        "'speaker_4': 'complaints that when you come back with recommendations of, you could see if there's some best practices out there that allow an employee to have a third party present when they're going through the investigative process. And that's it. So thank you, colleagues, for bringing this forward.'",
        "'speaker_4': 'It obviously is a timely issue.'",
        "'speaker_1': 'Because we're going to take you there as a former manager and administrative officer in the city of Long Beach. I had instances where I had employees come to me with complaints about harassment or potential workplace violence. And I dealt with it.'",
        "'speaker_1': 'And it's it was at the time that I was employed here that we were the administrative officers were the individuals that employees could go to. But there's not always that level of trust, I have to say. And unfortunately, with every department, within every department that that had an employee can go to an administrative officer and lodge a'",
        "'speaker_1': 'complaint and feel comfortable that it's going to be taken care of, because that's not always the case. So I would I would agree with my councilmember colleagues out here that we probably do need some kind of additional way of having employees report harassment.'",
        "'speaker_1': 'Or intimidation or bullying or whatever it is that that bothers them in the workplace when they're working with either a colleague or us or a subordinate or a superior. Because it's not always possible to know if your item got taken care of.'",
        "'speaker_1': 'I mean, that one of the things that I think it's unfortunate and it's I know it's probably the law because you're not supposed to reveal that. But sometimes a police don't know if where their complaint when they might have lodged it but then it's gone and there's no feedback for them in terms of whether there was a'",
        "'speaker_1': 'resolution to their complaint. And they continue to work. And and the person that they may have be having an issue with is still working or still supervising them or still a colleague or still in the workplace. So we need to know, have a resolution on that and hopefully that when this comes back, there's going to be some'",
        "'speaker_1': 'kind of recommendation or suggestion or a policy that addresses that, because I think that's that's the most important thing is that is harassment is reported. And the reason it's not reported and we get that high percentage of individuals that don't report it is because there's a lack of trust.'",
        "'speaker_1': 'And we need to build it. We need to build that trust for our employees and anybody to come to us or to go to, to, to our office of h.r or a or whoever we designate to report those come to our senators.'",
        "'speaker_1': 'So I will support this. Adam, I want to thank Austin customer roster for bringing this forward. But at the same time, I want to address the fact that if we don't address it now, we're going to have a hard time addressing it later.'",
        "'speaker_1': 'So it is unfortunate that this conversation is not taking place because of what's taking place nationally and locally. But it's it's an important one. And I'm glad that we're having it now. Thank you. Thank you. In that clip this hour, Councilman Councilman Austin, I thank you and.'",
        "'speaker_7': 'I appreciate the comments. I want to just follow up on a couple of of items unlike any future policy and like staff to look at, including bullying and intimidation. And in this the harassment policy specifically calling out those actions because there are situations and as a employee advocate, I deal with all the time situations where people are'",
        "'speaker_7': 'not necessarily being sexually harassed or harassed, but they're being bullied and intimidated to the point where their their work environment is completely hostile. And that does open the door for other problems to the point that, you know, we're having this conversation today instead of being proactive about it, this and I think we're being proactive because the city'",
        "'speaker_7': 'has a policy. We are reviewing our policy. The city of Los Angeles is reviewing their policies right now. The county of Los Angeles are reviewing their policies right now. The state of California is reviewing their policies right now.'",
        "'speaker_7': 'This is what good government is all about right now. And if we don't have this conversation today, as Councilmember Jauregui said, we'll be regretting it later. This item, this issue is specific to employees in the city of Long Beach, the employees who are within our purview as a city council to to to to govern.'",
        "'speaker_7': 'And they they we we we vote on their they're collective bargaining contracts. This is within our house. And again, the responsibility is not only to making sure the workplace for the employees here is safe and healthy, respectful and professional, but also that the we also have a responsibility to our our taxpaying public, because there are liabilities that'",
        "'speaker_7': 'come with us not taking care of business in that regard. And so I'll in my comments there, I appreciate the the discussion, the fact that council my council colleagues were reading this policy and discovering new things and things that they didn't know about in terms of city operations was well worth the time spent this evening.'",
        "'speaker_7': 'And so thank you very much for the colleagues and look forward to voting. Thank you.'",
        "'speaker_1': 'Thank you. Any comment on this? Please come forward. Please come forward quickly so we can. Thank you very much.'",
        "'speaker_3': 'When I heard Councilman Gonzalez's comment about why suddenly because of celebrities are down being paid, they are called on the carpet about their internal behavior. I immediately thought, what difference would that make at the moment when we first heard the first celebrity, whether it be Bill Cosby or and now our president making statements that were harassing toward'",
        "'speaker_3': 'women. The people who follow suit.'",
        "'speaker_1': 'All the other.'",
        "'speaker_3': 'Celebrities who were found to be in conflict. They knew bringing in these men was called that they had a behavior that was adverse. They started calculating when. There are. Oh, at some point my may be uncovered. When Mr. Austin brought this up and now hearing that it was his call, I thought, okay, if the city has existing'",
        "'speaker_3': 'behavior now, that's going to be revealed. This is the call out now. You may hear about it next year. It may start being rolled out. Things that you didn't know. This is the call coming from Mr. Austin that, oh, we need to relook at this.'",
        "'speaker_3': 'Based on all the other behavior of people, we never would have thought statements such as this would have come. So I. I wasn't called to answer that. But I say. Yeah. It needed to be done now because other cities are examples, because other people are examples, because celebrities are role models to our children.'",
        "'speaker_3': 'Because Mr. Cosby was a role model to many black family families. So I took it. I took an aversion to that. Why now? Yes. Now, because now the city of Long Beach may give its employees the go ahead in just that statement to say, okay, now I can start talking about what has been happening to me for'",
        "'speaker_3': 'the last five years. Where before I wouldn't have felt free. This is why. And it doesn't matter that it took a celebrity to bring it forward. The issue is. It hadn't been done. Until all of the other individuals that affect our city, in our view, came forward.'",
        "'speaker_3': 'Tonya, seven, district resident. I want to applaud you for bringing forth this policy review, a policy review that you labeled as a victim friendly policy. I'm not sure what motivated you to bring this policy review forward now, other than the many victims who have recently come forward in the media to report inappropriate conduct and and who, quote'",
        "'speaker_3': ', did not feel there was a safe environment in their workplace for them to come forward to report harassment. What pains me is that a couple of months ago, some of you did nothing for the many victims or more appropriately called survivors, who indicated that they, too, did not feel there was a safe environment for their in their'",
        "'speaker_3': 'workplace for them to come forward to report harassment. As council members, you're not elected just to put forth public policy, but you're elected to make a difference in people's lives, to make their lives better. As past director of the Sexual Assault Crisis Agency, I too agree that there is a need to ensure that all employees have a'",
        "'speaker_3': 'safe work environment and feel safe to report incidents. Emphasis on all employees. Yet reviewing and updating policy alone is not what will ensure that employees feel safe. Workers need to know that you understand what they are going through and how their working conditions either increases or lessens incidents of abuse.'",
        "'speaker_3': 'You must understand that what workers are going through. If there are no women in management positions, it can be difficult for some to understand what's going on. While working in the city 29 years ago, my water broke at work and I drove to the hospital.'",
        "'speaker_3': 'My boss asked me if I was going to return to work later that day. And now, an hour later, I gave birth to my youngest child. And no, I did not return to work that day. Don't get me started on pumping milk while at the city of Garden Grove.'",
        "'speaker_3': 'While I was working there, the public works department had all men employees. When one man who is transgender and showed up as a woman after her surgery, they worked hard to understand her circumstances and in what way work, environment and behavior need to change.'",
        "'speaker_3': 'First of all, you need to show you understand why some survivors do not report abuse. Three months ago, many were saying and were troubled because there was no record of reported incidents. That's not understanding. Saying that policy will result in litigation or that you see no nexus between harassment and workload.'",
        "'speaker_3': 'That's not understanding. Secondly, you need to engender trust. I can't see my time, Dick and I just have to talk faster. Thank you. If you engender trust, if employees don't trust you to believe their claims, or that those claims will not be investigated, no amount of policy tweaking will help.'",
        "'speaker_3': 'If they don't trust that, you will protect them. After reporting, no policy review will help. And finally, you need to acknowledge that working conditions play a major role in setting the stage to allow harassment to fester and continue.'",
        "'speaker_3': 'For example, here in the city of Long Beach, many years ago, no fire stations had separate facilities for women firefighters to shower or use the restroom. A separate restroom. I hope that has changed. When a few months ago, a couple of you were concerned about nuanced details that about treating differently.'",
        "'speaker_3': 'One class of employees. Please recheck next time you're dealing with public safety because they do have unique needs. Also, the employees are represented by a bargaining unit and they should have a say in this policy because it is about working conditions.'",
        "'speaker_3': 'I applaud your attempt at this policy review, but understand that work environment also means work conditions. And I hope that when you receive the requested breakdown of complaints the city has received over the past five years, and if there is only.'",
        "'speaker_1': 'A victim ensuring.'",
        "'speaker_3': 'That you continue to seek improvement in the policy. Thank you very much. A few more seconds for someone given eight years.'",
        "'speaker_1': 'That I got to treat everyone the same. Thank you so much. Mic speaker, please.'",
        "'speaker_3': 'My name's Nader Tushnet and I live in the third district and I am very pleased about this policy coming forward to City Council. I'm particularly pleased that we are looking at changing the culture. I worked for 50 years and in men in a largely male industry and it's not easy to change the culture.'",
        "'speaker_3': 'It's also important to note that the more managers there are who are women, the better it is for women to work there. I know that it's not only women who feel harassment. I am concerned, however, that you are looking only at your house.'",
        "'speaker_3': 'Your house is important. It sets the tone for the city. That is true. But your house and leaving other houses alone. And I'm speaking particularly about the hotel workers, leaves out the most important people in our city.'",
        "'speaker_5': 'And I want to say it's Hanukkah.'",
        "'speaker_3': 'So I can quote a rabbi. And I also was with my my extended family this weekend, and we were raised in a particular way. Rabbi Hillel said, If I am not for myself, who will be for me? If I am only for myself.'",
        "'speaker_5': 'What am I? And if not now, when?'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Q Next speaker, please. I'm also closing the speakers list, so I think. That. Mr. Murchison, for the last speaker there was no other speakers. Is that correct? No other speakers besides Mr. Murchison. Okay. Great. Next speaker.'",
        "'speaker_3': 'Please. Thank you very much. Zoe Nicholson. I live in Rose Park, second district. I can understand that. You might think that I am writing tonight to congratulate you on agenda item number 20. In fact, I would be if this was 1999.'",
        "'speaker_3': 'I've been an elected leader and am the president of your local now chapter and W is the largest organization advocating for the rights of women and girls. It is celebrating its 52nd year. I find this moment absolutely astounding because you are differentiating between the workers who work for you and the workers who support the industry in this'",
        "'speaker_3': 'city. I want to ask those five council members.'",
        "'speaker_0': 'Who voted no on.'",
        "'speaker_3': 'September 19th to do me a favor. Should anyone in your future want to shake your hand?'",
        "'speaker_1': 'Over one of our.'",
        "'speaker_3': 'Citizens being honored as Time's Person.'",
        "'speaker_1': 'Of the Year. I hope you will stand tall.'",
        "'speaker_3': 'I hope you will square your shoulders. I hope you will look them right in the eye and tell them.'",
        "'speaker_0': 'You voted no.'",
        "'speaker_3': 'Because that is the fact. One failed panic button out of thousands. Three years isn't long enough for a study or the comment. Well, it is Grand Prix weekend. Our people deserve protections and workloads and sexual assault. All human beings deserve this.'",
        "'speaker_3': 'You should be leaders in this culture.'",
        "'speaker_0': 'This is not progressive. Progressive means that you lead.'",
        "'speaker_3': 'You don't wait for the hashtags to pile in and how many people you love.'",
        "'speaker_0': 'Can now say me to. Thank you very much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'I'm with her. My name is Linda Calderon, and I am president of National Council of Jewish Women of Long Beach. And I represent over 400 members who live in Long Beach and in the surrounding areas. One of my priorities is to advance the well-being and status of women, which includes developing laws, policies, programs and services that protect'",
        "'speaker_3': 'every woman from all forms of abuse, exploitation, harassment and violence. I would say that your mandate as a city council is the same to protect all employees from all forms of abuse, exploitation, harassment and violence. And I would commend you on looking at your employee policies again.'",
        "'speaker_3': 'That also should include the hotel workers and others, the majority of whom are women. Although they may not be under your direct supervision, their rights to work in a safe and secure environment are in the hands of the policy makers.'",
        "'speaker_3': 'That means you and I would like to give you some feedback about the meeting that we had in terms of Claudia's law. We had been told that you studied this hotel issue for almost three years. Was this not enough time to pool your research and unearth every possible question and solution to the issue?'",
        "'speaker_3': 'Each of you had that responsibility. There should have been no excuses about coming to a conclusion. You are a leaders. You're looked to as leaders. And when you receive testimony that there were incidents and actions that created a hostile work environment such as sexual assault, you are obligated to review the facts, not your opinions.'",
        "'speaker_3': 'And you did, as you did at that city hall meeting that met about hotel issues. It is your responsibility to inform yourselves about the circumstances surrounding sexual harassment and sexual abuse and make informed decisions. Did you know how difficult it must have been to publicly testify to these acts of aggression?'",
        "'speaker_3': 'Do you recognize the testimony of a supervisor standing up and saying he was present here as one of intimidation? Do you think anyone would publicly describe their experiences that they were not true? And yet one of you said that you did not believe them.'",
        "'speaker_3': 'You said it again tonight as well. In addition, many of the words that the five people who voted against this were dismissive and self-serving and lacked human compassion. Your leading means to listen, study, evaluate and make a decision that is the best possible decision for all parties.'",
        "'speaker_3': 'You are the leaders. I might also add that I'd like you to be part of the solution. I noticed that some of you, at least one of you is on the telephone right now, gave us your back for a few minutes.'",
        "'speaker_3': 'This is dismissive again and it is rude. We are here to try and come together to do something for people who feel that they don't have a say. Thank you very.'",
        "'speaker_1': 'Much. Thank you very much. Next speaker, please.'",
        "'speaker_3': 'Good evening, everyone. My name's Christine Pettit. I'm the executive director of Building Healthy Communities Long Beach, and I'm also a sixth District resident. And I'm here tonight to speak in support of the item and also to echo some of the sentiments that were said that policies are one thing.'",
        "'speaker_3': 'I definitely agree with Councilmember Price Price's comment that we must look at culture. And one of the things that is telling about the culture and City Hall are some of the comments that were made on September 19th and the discussion around Claudia's law.'",
        "'speaker_3': 'I heard hotel workers come up and share their experiences of sexual harassment and assault, and I heard council members say that there wasn't enough evidence. Why do we need to act right now? Let's make sure to get it right.'",
        "'speaker_3': 'Even though we've been talking about this for years, those comments from the dais actually made me sick to my stomach and it lingered throughout the week as someone who has experienced sexual harassment. And I think that. You know, if I was a city employee or council staff, I would think that maybe if I came forward with my'",
        "'speaker_3': 'experience of harassment, that maybe it would be dismissed. And so while you might think that this testimony is twisting this item, what you say up here on all items sets the tone for the culture in Long Beach. And I want to say to that.'",
        "'speaker_3': 'If anyone else had been recognized as a time person of the year in Long Beach, we would be celebrating. And I haven't heard a peep about that. Our brave silence breaker from Long Beach. So I just want to say that, you know, it's good that you're looking at your policy.'",
        "'speaker_3': 'I ask you to look beyond what is written. Look at the culture you are promoting here. Sure. Get your house in order. But I also encourage you to take action to protect workers in the taxpayer subsidized hospitality industry and frankly, wherever else you can.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. Next week if we. Your name's David Garcetti. It's a g r c t. I just came up here impromptu. But there's an issue with this sexual harassment that really kind of hit a nerve. The one person that made a big issue about policies and reviewing stuff is somebody who apparently is not.'",
        "'speaker_1': 'Has had issues at the workplace with working with or with coworkers. In the question, though, I was having is that with this new reviews that you're doing here, are you going to be looking also at workplace relationships? And both sides of the spectrum, if somebody comes to complain, whether it's a subordinate or a supervisor, and also if'",
        "'speaker_1': 'it's male or female, different genders, now that we have to deal with all the different genders, it can also. I'm talking about being going across the board with everything and not just looking at which is what. What's going on now where it's a female saying that, oh, I've been sexually harassed, but men aren't coming forward or even'",
        "'speaker_1': 'gay or lesbian or anything else. I think that when you're looking at this now, when you're looking at this now in this day and age, it's not just, oh, let's look back at something from the nineties and this update.'",
        "'speaker_1': 'This is new stuff that we have to go across all genders. And just like they said, if somebody doesn't feel comfortable, you might have somebody who's doesn't feel comfortable talking to this particular person because of their sexual orientation versus that one.'",
        "'speaker_1': 'There's age differences. But the biggest thing that was strange to me is that I've I've worked in the military, I've worked in the government. We've always had these sexual harassment classes. And for it to be something like new is kind of strange.'",
        "'speaker_1': 'I don't know how it's been going on Long Beach where you don't even know if you've been doing it once a month. You don't even know who to go to. That's just seems kind of weird to me that you wouldn't be able to know your chain of command and everything you're supposed to be doing.'",
        "'speaker_1': 'But just but just in point, the thing that the main question I'm asking is that if there's issues of workplace relationships, let's say, and it feels something is something goes wrong, and then somebody out of retaliation goes and says, well, I was harassed.'",
        "'speaker_1': 'Are you going to look at it just because of that person is a male or a female or subordinate or supervisor? Are you going to take it seriously and be like, okay, wait a minute, we need to look at this and we need to use this as an example for, like Dan said earlier, as an example for'",
        "'speaker_1': 'the rest of the city where you're not taking sides just because it's somebody in a position of power or somebody who is more favored. And that's the thing that I'm saying. If that if you're going to be looking at this, look at it, there's a big giant spectrum now.'",
        "'speaker_1': 'So you have to start looking at. Thank you, sir. Next week, please. Good evening, councilmembers. My name is Brian McGinnis and I'm a Long Beach resident and constituent of council member supervised district. I am here to say that I commend city leaders for taking steps today to address how city staff can be protected from abuse on the'",
        "'speaker_1': 'job. However, I also want to point out a contradiction. Recently, the Long Beach City Council had an opportunity to help hospitality workers get much needed protection in the workplace. This council and the mayor failed them. Council Members Price, Mango, Austin and Supervisor.'",
        "'speaker_1': 'Well, I appreciate you bringing up this important item. The four of you, along with Councilmember Andrews, were responsible for voting down protections for hotel workers this past September. This hypocrisy lays bare one of the defining questions of our time.'",
        "'speaker_1': 'Will you, as empowered individuals, side with the most vulnerable members of our communities? Or will you serve moneyed interest and callously try to justify unnecessary human suffering? Long Beach bills itself as a progressive city. But it strikes me as cynical that some of you favor political expediency over workers health and safety.'",
        "'speaker_1': 'The time has come to protect all workers, regardless of who they work for. Thank you. Thank you. And the final speaker. Good evening, Mayor. Council members. I want to applaud Councilman Austin and the rest of you for bringing forward this item tonight.'",
        "'speaker_1': 'I know that we had a very robust discussion several months ago. I do want to point out a couple of things where I don't disagree with Councilman Pearce and Councilman, you're wrong in indicating that people don't come forward necessarily that have been assaulted.'",
        "'speaker_1': 'One of the things I did hear from our chief, our deputy chief at a public safety committee meeting, was that reported there was one incident in five years. Now, I grant you that there's a lot more that happens.'",
        "'speaker_1': 'I grant you that we don't want that culture in Long Beach. I get that. But statistically, there's one in five years. It's hard to focus on an industry like that more specifically, and I need remind everybody, including the audience, that proposed ordinance was focused on hotels of over 100 rooms.'",
        "'speaker_1': 'So it wasn't like it was going after the hospitality industry, quote unquote, in general. It was focused on a very specific group, a group that hasn't had a problem in the past. And yet, if we're all that concerned about sexual assault, why not go after the motels?'",
        "'speaker_1': 'Those seem to be the ones that would have bigger problems in Long Beach than the big hotels. The big hotels have H.R. policies. The big hotels have security. The motels don't. So why wouldn't you go after them? I don't see a policy in Long Beach when you're looking at your in-house stuff that says, gee, let's target this'",
        "'speaker_1': 'at development services, but we'll leave the IT department alone. It doesn't work that way. It's across the board. So if you're going to do a policy, take it across the board all the way and make sure that when you focus in on it, you can back it up.'",
        "'speaker_1': 'Now, I understand that things happen like that and people have incidences where they don't want to discuss it. Totally respect that. Totally respect the fact of the woman that mentioned don't want that culture in Long Beach. I get that.'",
        "'speaker_1': 'But on the other side of the coin, when you're going to propose an ordinance, let's make sure that's across the board for every industry in Long Beach. Thank you. Thank you. Public comment is closed. We have a there's a motion in a second on the floor.'",
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_5': 'Thank you. I wasn't going to speak again, but I feel very compelled to do so because it's a shame that the item that is being brought forth by Councilman Austin tonight, an item that's being discussed all over the nation by municipalities and public entities alike to evaluate not just sexual harassment policies, but all types of harassment policies'",
        "'speaker_5': 'is now being somehow connected to a. A political item that came forth in September that really is being spun in a very, very unfortunate and inaccurate way. So the first thing I will say is one of the blessings of being a city council member in Long Beach is that every single one of our meetings is recorded.'",
        "'speaker_5': 'And one of the benefits of that is that people who want to repeat what you have said have the option to do it accurately by going back and listening and watching the video to find out what you actually said.'",
        "'speaker_5': 'I have been reading a lot of the social media posts, not all of them, because frankly, some of them are just garbage because they're complete alternative facts. But I've been reading a few of them, and it's absolutely unbelievable to me how blatantly they have misrepresented what happened at that meeting.'",
        "'speaker_5': 'Some of you were in the meetings that I had with Unite here before the item came to council. You know, you know, in your heart of hearts what my issues were with that item. If you didn't know them from being in a private meeting with me, you certainly had the opportunity to learn them by listening to me'",
        "'speaker_5': 'talk about the items on the council floor. The issue for me was never about panic. Buttons are providing public safety for hotel employees. Was I concerned that the proposed ordinance only protected employees? Housekeepers. Not all employees. Housekeepers in hotels of 100 or more.'",
        "'speaker_5': 'Yes, that was a concern to me because I think if housekeepers are vulnerable.'",
        "'speaker_3': 'Which they are, they should be.'",
        "'speaker_5': 'Protected at all size hotels. I don't believe that people who stay in hotels of 100 rooms or more are more violent or aggressive towards housekeepers than those who stay at a local motel. So I asked whether or not it was possible for us to consider an ordinance that required panic buttons for hotels of all sizes.'",
        "'speaker_5': 'And those of you who were in the meeting with me heard me ask, because there was a connection made between public safety and workloads. And what I said at the council floor was how is it that.'",
        "'speaker_3': 'Workloads will.'",
        "'speaker_5': 'Reduce the number of number of public safety issues in the room? Is there some correlation between the number of square feet that an individual cleans and their likelihood to be sexually assaulted? That was a simple question, and there was no correlation between the two.'",
        "'speaker_5': 'When I met with the organizers and I believe. But while they indicated that they had authored most of the ordinance, what I was told is that sometimes the hotel rooms in today's day and age are harder to clean.'",
        "'speaker_5': 'The mattresses are heavier. There is more glass on the surfaces. And so the question that I asked was, well, then why is it that we're including other types of rooms in the work load limitations, like a conference room or a dining area?'",
        "'speaker_5': 'And they said, no, no, no, that shouldn't be in the ordinance. And I said, No, no, that is in the ordinance. And they said, Well, we'd be okay with that if you want to make that change. And my response was, You'll be okay with it.'",
        "'speaker_5': 'What about the councilperson who brought the item? Shouldn't that be the person who's making the decision about what's okay and what's not? It was very, very clear to me, as it was to everyone, that the the item that was brought to council was a package deal that included many different elements, not related specifically to public safety.'",
        "'speaker_5': 'And my public safety, I mean, an attack on an individual when they're vulnerable with another human being. There were several items that were included, including the opportunity.'",
        "'speaker_3': 'For the housekeepers, if they are.'",
        "'speaker_5': 'In a union, to be able to.'",
        "'speaker_3': 'Completely waive.'",
        "'speaker_5': 'Those protections by vote of the union.'",
        "'speaker_3': 'So if there's only let's say there's.'",
        "'speaker_5': '100 people in the union and 30 of them are housekeepers and 70 of them are not.'",
        "'speaker_3': 'They could vote to.'",
        "'speaker_5': 'Completely do away with those protections.'",
        "'speaker_3': 'By vote of the.'",
        "'speaker_5': 'Union. That to me didn't make sense, and that is what I said. I started off my comments that night, as I did, as I know many of my colleagues did, saying that we should absolutely protect public safety, safety, and that I would do anything possible to figure out a way to change that ordinance, to make it public'",
        "'speaker_5': 'safety. It was very, very clear to me that the ordinance was a package deal. There was no room for compromise, and that's why it failed. So let me just be clear. It is okay. If you want to summarize people's arguments, it's okay if you want to give their arguments a certain meaning, but it is not okay to'",
        "'speaker_5': 'falsify people's statements. It is not okay to say that someone said something they did not say. It is not okay. It's absolutely improper, unethical and in some circumstances.'",
        "'speaker_3': 'Illegal to attribute words.'",
        "'speaker_5': 'To an individual who did not state those, especially when those words are on video and can be evaluated. And so I hear what everyone is saying. But please, the problem that we have in many situations with women and there there are opportunities for advancement is women not supporting other women.'",
        "'speaker_5': 'And I think it's very, very important that if we're going to criticize one another, that we do it fairly. But we do it fairly and honestly. We all know we're all educated enough to understand the nuances of policy that's presented to council.'",
        "'speaker_5': 'If one aspect of policy is something that's objectionable, that doesn't mean it's okay to walk away and accuse someone of disagreeing with every aspect of the policy. That's just wrong. It's just wrong. So let's call it what it is.'",
        "'speaker_5': 'If you feel compelled to summarize what happened at that September meeting, what you should be saying is that the five people who voted against the proposed ordinance completely agreed with the public safety aspects. They had trouble with the other aspects because that is what was repeatedly stated.'",
        "'speaker_5': 'And in fact, what you should be saying is, for the first time ever in the region, the Long Beach City Council passed a resolution supporting collective bargaining for an industry, a private industry. That is not something you see every day.'",
        "'speaker_5': 'For that, my colleague, Councilman Austin, should be commended. And there is no other way to spin that. And I know let's talk about adding bullying to our policy here. Bullying comes in many, many forms. I know bullies. If you're going to criticize someone, criticize them for what they actually did, not what you want to sell to the'",
        "'speaker_5': 'people. Thank you.'",
        "'speaker_1': 'But the councilwoman. Councilmember Pearce.'",
        "'speaker_4': 'I wasn't going to queue up again either. I respected the voices that came to speak. They had a right to speak. They had a right to voice the pain that a lot of us felt after that day. I felt.'",
        "'speaker_4': 'Like a certain day in November for good month after that vote, and we can debate what happened that night to clarify. Mr. Marginson For the 100 rooms. I made an offer on the floor that night to make it cover everybody.'",
        "'speaker_4': 'I made an offer for us to have several months to do the work and those offers were denied the opportunity to work on this long term, whether or not that's what the union wanted, that's what I, as a council member behind the dais offered, and it was denied.'",
        "'speaker_4': 'And so that's that's what hurt the residents and the workers. They didn't care about the politics of what happens up here. Five, four, nine person vote. It takes courage to speak up. You guys know, for me, it takes courage to speak up.'",
        "'speaker_4': 'And the reason why I spoke so passionately about this is because I know what the process is like in the city. And I know that to have a council that says, we heard you for 3 hours and we weren't willing to do something out of the box, whether or not our union partner wanted it or not is'",
        "'speaker_4': 'it is painful for the other people that work in the city. It does send that message whether or not that was the intent, that was what happened and that's the action. However, we set our words or spun those words or how passionately we got.'",
        "'speaker_4': 'The fact is, there was a vote that said, we're not going to work on this anymore. And that's why it's so hard because hashtag me, too, takes courage. And it is you know, I disagree with the idea that this is the wrong time to do it.'",
        "'speaker_4': 'I agree with my council colleagues. This is the right time to do it. I saw the item and said, Dang, I wish I would have done that first. You know, so I applaud them on that. But we can we have to recognize that the culture in this city is is by all of us.'",
        "'speaker_4': 'And so I don't like when we school, the people that come up here to have courage to speak up, correcting the record, I agree with, but there's a lot of assumptions and it just demonstrates how difficult it is to talk about assault.'",
        "'speaker_4': 'It demonstrates how hard this item is and how much we could commit to it and not just make it a policy review like we did in 2015. So I urge us to really dig in and do this the right way and change our culture.'",
        "'speaker_4': 'I worked for a nonprofit who is.'",
        "'speaker_3': 'All about.'",
        "'speaker_4': 'Culture first, and our leadership development is there. It's not a question of whether we offer a department head some opportunity for a grant for leadership development. It's a given lane. I had every two weeks, an hour with a personal coach to talk about any issues that that's the type of organization that has leadership, that says we care'",
        "'speaker_4': 'about you and your partner. So I just want us to ground ourselves. And this is passionate for a reason. It's very personal and politics is personal and sexual assault is political. And we have to make sure that we do the right thing by everybody in our city.'",
        "'speaker_4': 'This is the right first step and I look forward to more steps in the future.'",
        "'speaker_1': 'But you to continue.'",
        "'speaker_2': 'Gonzalez I would just like to say to that, you know, it's it's unfortunate this took a turn. Absolutely. Support this item. Absolutely. I do a 150%. But relative to what Councilmember Price was saying, which I feel is really unfortunate, but we have to reprimand the public for coming forward, I don't feel that that is respectful in any'",
        "'speaker_2': 'sense of the word for us to be talking to the public in that sense for coming forward and speaking how they feel. We should never dictate how they should feel and we should just accept it. And sometimes as council members and elected officials, we have to take it.'",
        "'speaker_2': 'Trust me, we have to take it day in and day out. And that's what we do and that's part of our daily routine, is being able to hear things that maybe are not comfortable regardless of the situation. And clearly we're on different ends of the spectrum and on what we feel about the item that came forward in'",
        "'speaker_2': 'September. I don't think it's an item that will go away, and I'm glad that this will not go away within the city inner workings. But when we say a resolution, it's almost like saying nothing is going to happen.'",
        "'speaker_2': 'And so while highlighting that there's an issue, unfortunately, I don't believe a resolution did anything. And then to talk about, you know, that this last item was a package deal, I feel was also disrespectful. It's not a package deal.'",
        "'speaker_2': 'There was a lot of work that went into that policy. I write my own policies myself, personally. I do the work and the research myself. Yeah, somebody may give me an idea for a policy, but I put every ounce of energy and I research quite a bit to make sure that it's the right policy for Long Beach'",
        "'speaker_2': '. So while we said that, I again appreciate the the public being here and speaking about this issue and supporting this issue as much as possible for men, for women, for all of us. And I hope. We can get it right.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_3': 'I appreciate, Councilman Gonzales, that you do your own research. I would also like to say that when this does come back, that in the meetings that I had before that policy was brought, I, too, proposed several changes that would have made it a policy that could have been a huge success for Long Beach and hotel workers.'",
        "'speaker_3': 'And my meeting ended with and I wish it could have been recorded like council meetings are because you could go back and check the tape. But it ended with that's not something we're open to taking out of the policy at this time.'",
        "'speaker_3': 'At a time when I was told that the policy had not been written yet, a version of that policy was circulated in the community. And I went to community meetings and I went to meet and talk to and hear from the hotel workers.'",
        "'speaker_3': 'I appreciate that, my colleagues. Councilman, at the time, both Mayor Richardson and Councilmember Durango were very welcoming to me at these meetings. And many of you know that in downtown Long Beach, my mother was assaulted at work, but nobody's stepping up to protect her or her rights.'",
        "'speaker_3': 'And she had a panic button and nobody came for 47 minutes. And so when I write a policy, I'm going to write one that's actually going to make a difference. I've gone and spoken to hotel workers and worked with hotel management to provide self-defense classes and trainers, the same providers, the same trainers.'",
        "'speaker_3': 'That provided me defensive tactics training after I was assaulted on Vermont Avenue in my workplace as a county employee. The reason I am a deputy sheriff today is because I didn't want to be defenseless. And there's no better empowerment for any woman.'",
        "'speaker_3': 'Continue. How to protect herself because it takes a long time to call 911 and it takes a long time when you press that panic button. And so I want to thank. Those that are in the community that are doing the hard work and making the compromises.'",
        "'speaker_3': 'It's not about Facebook posts. It's about the actual work on the ground and talking to the people who are actually cleaning their rooms and walking to their cars because the likelihood that these people are attacked is actually most when they are leaving or going to a place of business, not not significant which type of business it is'",
        "'speaker_3': '. And so I want to thank all the hotel jams who paid for free courses for defensive tactics training provided by the same trainers that L.A. County Sheriff's Department uses at their own cost and on their employees paid time.'",
        "'speaker_3': 'Because I believe that makes a difference.'",
        "'speaker_1': 'Thank you. Councilwoman Pryce.'",
        "'speaker_5': 'I just want to say one thing, and that's really we have yes, we're public servants. We put ourselves out there, but we also have the right and, in my opinion, the obligation to defend ourselves. And when we hear comment after comment, that is a complete misinterpretation of something that we said.'",
        "'speaker_5': 'It's important. And it's I have a duty to my constituents to make sure I set the record straight. I would do that in a court of law, and I will do that in here. I will not allow someone to misstate something I said.'",
        "'speaker_5': 'I will always defend myself and stand up for myself. And we talk about a culture of support. We really should be starting with our city council, because for whatever motivation any of us have for bringing an item forward, if someone accuses us of doing something that our colleague knows we didn't do because we had a private conversation'",
        "'speaker_5': 'with them, we shared with them what our concerns were. And if they stand there idly while someone accuses us of having an intent they know we didn't have, we should be supporting each other. We should be saying, you know what, I hear what you're saying.'",
        "'speaker_5': 'But she actually didn't have an objection to this part or this part. What she did have an objection to was this part. But they're not doing that because you know what? It's really, really fun to watch a train wreck when it's not happening to you.'",
        "'speaker_5': 'It's fun to watch someone, one of your colleagues get attacked or something. You know, they didn't mean you know, it's not in their heart and sit quietly and allow them to get attacked. It's much, much more difficult to stand up and say, you know what, I understand your passion and your frustration, but I got to tell you'",
        "'speaker_5': ', I work with this person. I may not agree with everything that they do, but that wasn't their intent. They don't want women to get attacked. They do care about public safety. We need to support each other. Just because we don't agree on every aspect of a policy doesn't mean that when someone else defames us or slanders us'",
        "'speaker_5': 'or says something that's inaccurate, that we shouldn't be standing up and doing the right thing and saying, You know what? I understand you're frustrated, but that's not exactly what they said. We're all educated enough to be able to do that, and it takes courage to do that.'",
        "'speaker_5': 'And I want to say something because I know I was hoping that this item wouldn't turn into this. But when the comments were made and and frankly, they were instigated by some of my colleagues before they went to public comment by referencing Claudia's law.'",
        "'speaker_5': 'This item today is not about Claudia's law, but it was made to be about Claudia's law. And at the end of the day, it is not okay for any of our colleagues, one in particular, to be taking the heat that my colleagues who voted, who were in favor of Claudia's law.'",
        "'speaker_5': 'No. His intent was not about. It's just not okay. People are getting bullied. And if we're going to stand by and pretend it's not happening and be part of the we're part of the problem, I think support creating a culture of support means we also support each other.'",
        "'speaker_5': 'Just because we don't agree on every single aspect of a policy doesn't mean we're not the enemy, doesn't mean we are. We hate whatever the topic was that was brought forward. Please, please, please. If we're going to start talking about creating a culture of support in this city, we should start with the city council.'",
        "'speaker_5': 'We should keep the facts straight and accurate and operate from a place of.'",
        "'speaker_0': 'Facts.'",
        "'speaker_5': 'And fashion our arguments based on facts and not emotion. Thank you.'",
        "'speaker_1': 'Councilmember Pierce.'",
        "'speaker_4': 'Hold on. Councilmember Price. So I wanted to make a comment in reference to Councilmember Price's comment. I'll give her a second. What I'm trying to make a comment with, you know, Councilmember Price, I want to recognize that your comments and feeling like you've been bullied, whether it's by the folks in the audience or I'm.'",
        "'speaker_5': 'One of our colleagues, has been bullying.'",
        "'speaker_4': 'Okay. Well, the comment that you just made made me feel like you were saying that about yourself based on the comments we made. So I wanted to apologize. I don't like the idea of bullying, and I don't like the idea that our colleagues feel bullied.'",
        "'speaker_4': 'And I. I just want to highlight that again. It's something that's very passionate for a lot of people and for you. And any comments that were made by the colleague, by the audience about your comments that you were defending your right, you supported all hotels, you supported the sexual assault pieces, you supported that.'",
        "'speaker_4': 'My frustration is that we were all told by a third party that we weren't okay with dividing it up and the vote didn't happen. And so from my record, my recollection is that people felt like there was a decision made before we came to this body to be worked out behind the dice.'",
        "'speaker_4': 'And that I believe in us as a group behind the dais to trust each other, to have a conversation. And so I don't want my colleagues to feel like I'm in the bullying business or that people that are passionate in the bullying business, but we owe it to ourselves to have a full process.'",
        "'speaker_4': 'And, you know, I hope that we can put this to rest right now and just recognize that it's something that's very emotional for a lot of folks. So.'",
        "'speaker_1': 'Okay. Thank you. I know you've done public comment already on this item. So there is a motion on the second floor by Councilmember Austin and Councilwoman Price members. Please cast your votes.'",
        "'speaker_3': 'Jimmy. Motion carries.'",
        "'speaker_1': 'Okay. Thank you. Okay. We're going to we're doing public comment now. I'm one of the first three speakers, Kenneth Roth. Jonathan Crouch and Larry Boland. Please come forward. Kenneth Roth. Jonathan Crouch. And Larry Boland. I've got to put on my prop here first.'"
    ],
    "Eighth Amendment to Lease for Career Transition Center.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Thank you. Item eight on the consent calendar, please.'",
        "'speaker_2': 'Report from economic development. Recommendation to authorize the city manager designee to execute any and all documents necessary for the Eighth Amendment to lease. Number 25156. Between Properties Number 22, LLC and or ILWU Credit Union, A Successor and Ownership and the City of Long Beach for continued operation of the Career Transition Center by the Workforce Development Bureau and'",
        "'speaker_2': 'the Department of Economic Development District seven.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'Okay. Yeah. I want to thank staff for arranging this nice little swap in the lease to get the ILWU, the International Longshore Workers Unit, into Long Beach. It builds that bridge between San Pedro and Long Beach with the ILWU and that.'",
        "'speaker_1': 'And it's a great repurposing of that of that building. SIMON Thank you. I do. Thank you. COUNCILMEMBER There's a motion and a second. Any public comment, please cast your votes.'",
        "'speaker_0': 'She went.'",
        "'speaker_3': 'Councilmember Mungo. Thank you.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Contract with Clear Channel Airports for Airport Advertising Program.": [
        "'speaker_1': 'Next up is item 20. We heard 2021.'",
        "'speaker_2': 'Report from Long Beach Airport in financial management recommendation to execute a contract with Clear Channel airports for the development and operation of an airport advertising program at the Long Beach Airport District five.'",
        "'speaker_1': 'Thank you. There's a motion. Any second. Is there any public comment?'",
        "'speaker_0': 'What?'",
        "'speaker_1': 'I'm sorry. Yeah, I'll switch it up. Okay. Yeah. You know what I want? Okay. There's a motion in a second. Is there any public comment? There's no public comment. Let me actually get a short staff report, cause I know this is something that a few of us up here are probably looking forward to.'",
        "'speaker_1': 'It's exciting stuff. Our airport director, Jess Romo, less honorable. They were members of council. The item before you is a concession agreement for advertising opportunities. Long Beach Airport. This is a successor agreement to an advertising contract we have in place.'",
        "'speaker_1': 'This one, if approved, will generate in excess, in excess of $1,000,000 over the term. And it will broaden our ability to advertise more fully at the airport while still abiding by the city's regulations and ordinances relative to billboard advertising.'",
        "'speaker_1': 'And any questions you have, I'm happy to answer. Okay. That was a separate point, Councilman Mongo.'",
        "'speaker_3': 'I'm just glad that we're moving in this direction. I think that there's a lot of opportunities in this, and so I look forward to seeing what gets created. Thank you.'",
        "'speaker_1': 'Account Summary Gringo Councilmember Superdome. Thank you. I just wanted to recognize Director Romo and staff for sitting through a long meeting. Thank you. And please cast your votes.'"
    ],
    "Grant Funding for Park Rehabilitation Projects in Districts 1 and 6.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Thank you, Adam. 22.'",
        "'speaker_2': 'Report from Parks, Recreation and Marine. Recommendation to accept a total of $981,509 in grant funding from the California Department of Housing and Community Development through the Housing Related Parks program to be utilized for the rehabilitation of park facilities and park playgrounds, District one and six.'",
        "'speaker_1': 'There there's a motion in a second that comes from Gonzales in the comments, or.'",
        "'speaker_2': 'It can have a quick.'",
        "'speaker_1': 'Look where we get a quick staff report. Sure. This is very exciting as well. Our Parks Recreation and Marine Director re night.'",
        "'speaker_4': 'Good evening. Honorable married members of the council. Yes, we're very excited to receive this grant from the state. And just under $1,000,000.'",
        "'speaker_3': 'We want to make sure everyone.'",
        "'speaker_4': 'Understands that the grant guidelines were very restricted as to what types of projects and areas that we could spend the funding. So this will fund three projects.'",
        "'speaker_3': 'One is some.'",
        "'speaker_4': 'Upgrades desperately needed upgrades and repairs to the Drake Park Community Center.'",
        "'speaker_3': 'We are also going to be replacing a very well worn and loved.'",
        "'speaker_4': 'Playground at Peace Park and giving them a brand new playground which has been long overdue, as well.'",
        "'speaker_3': 'As another.'",
        "'speaker_4': 'Brand new playground at Martin Luther King Park. So we're very excited about these projects.'",
        "'speaker_1': 'Those are all three so needed. That's great. Really great to hear. Councilmember Andrews. Yes, thank you. Again, I'd like to thank Maria for this, because the fact that this will really, you know, be greatly benefited from the investment in our parks and also I'm looking forward to the ribbon cutting.'",
        "'speaker_1': 'So thank you again. Really wonderful investment. Thank you again. Thank you. And no public comment on this. Please, members cast their votes.'"
    ],
    "Ordinance Approving Water and Sewer Rates and Charges Effective January 1, 2018.": [
        "'speaker_1': 'Public comment saying non please cast your votes. Motion carries 24.'",
        "'speaker_2': 'Communication from City Attorney Recommendation to declare an ordinance approving resolution number WD 138 to establishing the rates and charges to be charged for water and sewer service, declaring the urgency thereof and providing that this ordinance shall take effect on January 1st, 2018.'",
        "'speaker_2': 'Read an adopted as read citywide.'",
        "'speaker_1': 'Thank you. There's a motion or a secondary or any public comment. CNN. Please cast your votes.'",
        "'speaker_3': 'Motion carries.'",
        "'speaker_1': 'Thank you. Is there any second public comment period for anybody? Nope. Yes. Okay. Please. Is there someone speaking or. No, just general public comment. This is general public comment on anything, not on the agenda.'"
    ]
}