{
    "Donation to Wilson High School PSTA Sweatshirt Fund.": [
        "'speaker_1': 'One Transfer Item 18 Communication from Councilman Price Councilman Super Now recommendation to increase appropriations in the General Fund Group and the City Manager Department by $1,000 to provide a donation to PTA. California Congress of Parents of Woodrow Wilson.'",
        "'speaker_1': 'Woodrow Wilson High School. Item 20 Communication from Councilwoman Zendejas Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $6,190 to support the first annual Independence Day Dog Parade. Item 29. Communication from Councilwoman Sara recommendation to increase appropriations in the General Fund Group and the city manager department by $750 to provide a'",
        "'speaker_1': 'donation to Cambodia Town, Inc. Item 30 A Communication from Councilwoman Sara recommendation to increase appropriations in the General Fund Group in the City Manager Department by $327 to provide a donation to Partners of Parks. Item 31 Communication from Vice Mayor Richardson, Councilwoman Allen and Councilwoman Sara recommendation to increase appropriations in the General Fund Group and the City'",
        "'speaker_1': 'Manager Department by $250 to provide a donation to the Long Beach Camerata Singers. An Item 32. Communication from Councilwoman Zendaya's recommendation to increase appropriations in the General Fund Group and the City Manager Department by 3000 to provide a donation to Disabled Resources Center Inc.'",
        "'speaker_1': 'That concludes the transfers.'",
        "'speaker_0': 'Thank you. It's been moving and seconded. Any public comment on the fund transfer items?'",
        "'speaker_1': 'If there are any members of the public that would like to speak on item 18, 20, 29, 30, 31 or 32 in person, please on the podium.'",
        "'speaker_5': 'In Zoom.'",
        "'speaker_1': 'Please use the raise hand feature now. Terry. Terry, your time begins.'",
        "'speaker_5': 'Now in a zoom.'",
        "'speaker_2': 'On Item 21.'",
        "'speaker_1': 'No, that is not a transfer. That concludes public comment.'",
        "'speaker_0': 'Thank you. I see Councilwoman Zendejas is there.'",
        "'speaker_2': 'Henry's vice mayor. Just wanted to make a quick correction on item 32. It is a transfer to support Disabled Resource Center for three scholarships for students with disabilities at Cal State University, Long Beach and Long Beach Community College, as well as a scholarship that goes out to our.'",
        "'speaker_2': 'I'm honored that for that on their special annual fundraiser. Thank you very much.'",
        "'speaker_0': 'Thank you. That satisfies public comment and council comment. Let's have a roll call vote, please.'",
        "'speaker_1': 'Councilman's and it has.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Allen. I. Councilwoman Price.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman. Super now.'",
        "'speaker_6': 'All right.'",
        "'speaker_1': 'Councilwoman Mongo. Hi. Councilwoman Sara, I. Councilmember, your. I. Councilman Austin.'",
        "'speaker_7': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson. Hi. Motion carries.'",
        "'speaker_0': 'Thank you. All right. That satisfies the transfer consent. Let's move on now to presentations. Our first presentation is with the Sister Cities, Young Artists and Authors Group. And I want to invite and. Cute, sir. Thank you. And he wants her to come forward.'"
    ],
    "Program Review and Incentives for Housing Choice Vouchers.": [
        "'speaker_0': 'Okay. So now we move on to the regular agenda. We have item number 19.'",
        "'speaker_1': 'Item 19 is a communication from Councilwoman and Mongo recommendation to request city manager to direct the appropriate departments to review the existing EDU permitting process and design a program that would both incentivize acceptance of vouchers for housing and educate landlords on how housing choice vouchers work.'",
        "'speaker_0': 'Okay. Is is as. And I see you. Councilman Price. Is Councilman Mongo here? Yes. Okay, great. Did you want to log your motion and some of the second. Okay, great. Okay. You recognized.'",
        "'speaker_5': 'Thank you. In working with the.'",
        "'speaker_2': 'Many different departments of the city, we recognize that there are opportunities to improve the way in which we address our housing shortage. Many know that there are approximately 2000 homeless individuals in our city. And those homeless individuals. There's a report or a statistic from one of our department heads that says between 20 and 30% of those individuals'",
        "'speaker_2': 'actually have housing vouchers. So if we were able to better incentivize landlords to take the housing vouchers, we would potentially get an additional 600 people off the street. This motion is to encourage the city to come together with many different departments.'",
        "'speaker_2': 'I've talked to individual department heads about potential opportunities. I'm going I look forward to seeing what they will bring back so that there's an incentive for more landlords who are either modernizing or building additional units and or use to take housing vouchers.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_4': 'Um. Thank you, Mr. Vice Mayor. I want to thank Councilwoman Mongo for bringing this item forward. This is a fantastic item, and I think it's really important for us to work with our local housing providers to do everything that we can to increase our affordable housing stock.'",
        "'speaker_4': 'Our office will be hosting a workshop on August 11th. We've invited our housing authority team to be there to educate landlords, all landlords throughout the city. Anyone who wants to come is welcome to come to the workshop on August 11th.'",
        "'speaker_4': 'I'll make an announcement with the with with the specifics at the end of the meeting. And I think it's really important for us to think very clearly about where our affordable housing options lie in the city and do everything that we can right now to make existing housing stock more affordable.'",
        "'speaker_4': 'That is something that I think we have a lot of landlords that have very positive experiences in working with the city on the vouchers and that program. And I think it's important for us to educate them and make sure they have the opportunity to participate in those programs with the help of city staff.'",
        "'speaker_4': 'I think that's a a key issue here with our city staff. They're willing to sit down and educate people on the process. And it's just we don't have enough opportunities for them to do that. So thank you, Councilmember Mungo, for bringing this item forward and allowing us to have that discussion at the city level.'",
        "'speaker_0': 'Thank you, Councilman Alston.'",
        "'speaker_7': 'Thank you. I'll be brief. I just want to thank, uh, maker of the Motion Councilmember Mongo, for bringing this item forward. I think it's innovative. It's an innovative way to utilize or to utilize a program that that is actually seems to be pretty popular since we adopted it a couple of years ago.'",
        "'speaker_7': 'Staff report says it has over 400 applications in for a to use this year. Probably 250 have been built in the last couple of years. And so clearly there's an opportunity for a to use to to help meet our housing needs, particularly for low income households and those with the housing choice vouchers.'",
        "'speaker_7': 'And so I applaud the innovation and I'm happy to support this item.'",
        "'speaker_0': 'Thank you, Councilwoman Zendaya's.'",
        "'speaker_2': 'Thank you very much, Vice Mayor, and a big special thank you to Councilmember Mungo for bringing this very important item forward. I think that we are living in special times, especially right now as we're recovering from COVID and a lot of our residents are finding themselves in need of vouchers.'",
        "'speaker_2': 'And I have also spoken to a lot of other property owners, too, who would like to take these vouchers. But the time that it takes to get approved, to be able to take these vouchers sometimes is not ideal.'",
        "'speaker_2': 'And that's one of the things that holds them back from accepting to take these vouchers. Is there anybody in staff that can maybe speak on that a little bit more?'",
        "'speaker_10': 'Yes. I believe we have Kelly Colby on the line about the voucher program. Well, she may be unmuted or not on the line.'",
        "'speaker_2': 'Okay. I mean, you can get back to me in regards to this. I just am very supportive of this item and look forward to to supporting this item.'",
        "'speaker_10': 'Sorry about that, Councilmember. We'll make sure we get your answer.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Councilwoman Mongo might be able to help with an answer for Councilman Zendejas. You are correct. There used to be significant challenges in the approval process and therefore landlords were incentivized. But several years ago, a few of us on the council worked with the Housing Authority, and they actually will pay you to hold your unit open for one'",
        "'speaker_2': 'of our members. So you actually could theoretically get rent for holding the unit for about your members, so there's no disadvantage to the landlord. Further, I did want to thank. A couple of my colleagues. I know that throughout the journey of our time together, we had many different versions of what we can do to help our housing'",
        "'speaker_2': 'voucher community. And I think that the workshop on Friday is going to be very, very, very beneficial. I think that I'll also just mention a couple of quick things that I was thinking when writing the item that many people don't know.'",
        "'speaker_2': 'But when you add either an EDU or an additional unit, you're not required to add any meters if your property is already metered. And one of the things that's an incentive for the water and gas department is they want to know each and every customer, and they also want to incentivize conservation.'",
        "'speaker_2': 'It's difficult to incentivize conservation when you have a dozen people on a meter or even two or three people on a meter because no one knows exactly who is using how much and if the things they're doing are working.'",
        "'speaker_2': 'When you go to build an Adu and or a an additional unit, meters cost upward of 1500 dollars. So if a person wants to add meters, it can be a quite an expensive experience when they're already paying thousands upon thousands of dollars for permits.'",
        "'speaker_2': 'And the cost of building right now is high. And so I look for opportunities similar to what's possible than water and gas to find ways to incentivize landlords to get something that the city already wants. That helps us all in our environmental pursuit of excellence and finds housing opportunities once again.'",
        "'speaker_2': 'And thank you, Councilwoman Price. I know that I didn't have time to have you sign on to an item with our restrictions at City Hall and COVID. But I just wanted to thank you as well for being second door on the item.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. I'll just offer my support I think is a great item. And, you know, I'll just also just say that, you know, over the years, the group of landlords, it changes over time. And there are always stigmas with the housing choice voucher program.'",
        "'speaker_0': 'And a lot has changed about the program. Like what Councilwoman Mongo mentioned, the standards have changed. We can, you know, put down additional deposits to hold the unit. And there are a lot of things that people don't know about.'",
        "'speaker_0': 'The Modern Housing Choice voucher program is very different than the Section eight program of the nineties or the eighties. And so the more we can do outreach, last time we did this was a lease up Long Beach initiative that we worked on together, the workshops and things, but we didn't have to use at the time.'",
        "'speaker_0': 'And I think this you know, I think this is really, really smart because this is yet another way for us to have a higher lease up rate, because if we don't use all our vouchers, you lose them to the federal government.'",
        "'speaker_0': 'So we have to continue to identify ways to utilize the vouchers that we have, particularly given there is a long line of people who are who have vouchers in hand and don't have a place to go. So I really like this item.'",
        "'speaker_0': 'Is any public comment on item 19?'",
        "'speaker_5': 'If there are any members of the public that.'",
        "'speaker_1': 'Would like to speak on item 19 in person, please stand up at the podium in Zoom. Please use the raise hand feature or dial star nine now. In person.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Your 3 minutes begin now.'",
        "'speaker_6': 'So I can't face success for president. This is a very rare occasion. I'm both a product of public housing here, specifically Section eight housing here in the city of Long Beach. And now I'm a provider of nine units in my neighborhood in a central area where we use Section eight vouchers to house people in the neighborhood.'",
        "'speaker_6': 'The only problem is not one of them is through the housing authority of Long Beach. They're all Heathcliff. And I'm going to tell you why. I was not incentivized to take a single voucher from the city of Long Beach.'",
        "'speaker_6': 'The process was strenuous. It was months and months of delay. Um, there's only a percentage of the, uh, units that's covered, not the entire amount. So I just want to say that. And last but not least, another reason why a lot of landlords are not incentivized is because the price points are antiquated.'",
        "'speaker_6': 'Um, you know, I live nine or 813, uh, the, the median is $1,595. That does not cover a one bedroom apartment right now. So, you know, you take the capital ES aspect, that side of it, right. I just don't know that many people that on real estate that are doing charitable work in relation to the properties that'",
        "'speaker_6': 'they own. So it's just not working. If you look at, um, currently what we do, we are, uh, we have because of COVID this incentivize the greatest voucher recipients in the city of Long Beach. Those are motel friends.'",
        "'speaker_6': 'They no longer are taking these vouchers because we're incentivizing them, because we've given them all this COVID money. So now they don't want to take the vouchers because they would rather take the COVID money and the millions and millions of dollars in contracts which we've repeatedly renewed and given to them.'",
        "'speaker_6': 'And the homeless people continue to be homeless because they're holding vouchers. And when they go to the provider to give them the vouchers, there's no need to, you know, save. Long Beach is one of the few metropolitan major metropolitan cities in America that has more vouchers than public housing.'",
        "'speaker_6': 'I want to commend, uh, councilwoman. Mango for bringing this up. I think it's a great attempt at solving something. The problem is this is a bandage trying to patch up a gunshot wound. A shotgun, arguably. I think that if we want to have really radical positioning with respect to.'",
        "'speaker_6': 'You know, getting rid of the 2000 plus people. As Councilwoman Zendaya said, these are special times and we need special efforts. We need to expand, expand public housing. You know, we have under 5% of the city. That's public housing.'",
        "'speaker_6': 'And if we really want to do more like room for error, we need to just buy up. We need to have the housing authority instead of spending so much time on these Section eight vouchers, you know, open up a conversation with hope and try to buy up, you know, all these antiquated buildings.'",
        "'speaker_6': 'You know, a lot of these buildings I living in in their time in the last 1960. I just want to finish this point. The building I live in is old. So the apartment, the amount of rooms in it doesn't fit the current families.'",
        "'speaker_6': 'The current families have to separate by gender. So you can't if you have a boy and a girl, they can't sleep in the same room. Under section eight. We need to update that. If we want to use these vouchers.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. I saw one more speaker. Was there another speaker on this? Okay. Our final speaker.'",
        "'speaker_6': 'Good evening. I just want to clarify something.'",
        "'speaker_0': 'Is the microphone on. Okay. Maybe speaking to the microphone.'",
        "'speaker_6': 'Hello? Yeah. Good evening. I just want to clarify written opposition to this as written not because I'm against housing choice vouchers, section eight housing Section eight rental assistance, the need to incentivize uptake of the HCV program to reduce the number of potentially homeless people that are still waiting.'",
        "'speaker_6': 'None of those things are things that I'm opposed to. It's just as written. There's a bit of a missed opportunity, as the previous speaker mentioned, not only. To incentivize better construction, but to frankly investigate existing aid use not only for environmental, health and safety, public safety compliance, but also just for efficiency.'",
        "'speaker_6': 'And I made a comment specifically because, you know, when it comes to where we're in human history, but also where we're at in this city, we do not need to pipe in natural gas into any of these homes, frankly.'",
        "'speaker_6': 'I would love to see more incentives for not only the kind of green building construction we have, but frankly, the kind of building stock that we're going to need to house as many people as we do. And there are other ways to incentivize, frankly, more public housing and more affordable housing construction.'",
        "'speaker_6': 'You know, this is I mean, you know, just as one one final point. I mean, you know, it'd be great to see if there was some data on not only which landlords, but which landlords have, which situations that are constraining them.'",
        "'speaker_6': 'And for future projects for new construction, you know, which which properties are kind of waiting for, for these to house these populations.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. That satisfies for the comment. Let's have a roll call vote, please.'",
        "'speaker_6': 'Councilman's in Dallas.'",
        "'speaker_2': 'Hi.'",
        "'speaker_6': 'Councilman Allen.'",
        "'speaker_4': 'Hi.'",
        "'speaker_6': 'Councilwoman Price. Hi. Councilman. Super or not. All right. Councilwoman Mongo.'",
        "'speaker_2': 'Hi.'"
    ],
    "Report on Senior Housing in Long Beach.": [
        "'speaker_6': 'Councilman Zoro. I council member younger. Hi, Councilman Austin. Hi. Vice Mayor Richardson. All right. Motion carries nine.'",
        "'speaker_0': 'Of 21 police.'",
        "'speaker_6': 'And 2021 recommendation to request City Manager to work with Development Services Department to provide a report back to the City Council within 60 days on the status of senior housing in Long Beach.'",
        "'speaker_0': 'I'm so impressed.'",
        "'speaker_4': 'Thank you. A motion. One minute here.'",
        "'speaker_1': 'Hello, my am.'",
        "'speaker_5': 'Okay.'",
        "'speaker_4': 'Thank you to Councilman Austin for signing on to this item. I'm looking forward to this agenda item coming back to city council. And I have been reading some of the correspondence that we received today about the item from various senior housing advocates and folks that are interested, like the caller received.'",
        "'speaker_5': 'Earlier, about the.'",
        "'speaker_4': 'Future of senior housing in the city of Long Beach. As our Long Beach population ages, it's increasingly more and more important for us as a city to think proactively about the needs of our seniors. Community, housing, security and availability is a major issue for our senior population in Long Beach.'",
        "'speaker_4': 'And we should also make sure that as this Council, we're focused and work together to develop for the city's future needs in terms of senior housing for decades to come. It's been a while since we've had a comprehensive report on senior housing in Long Beach today.'",
        "'speaker_4': 'In fact, I'm not sure in the eight years that I've been here that we've had a comprehensive report on where we are and how we can incentivize or fund more senior housing in the years and decades to come.'",
        "'speaker_4': 'A lot of times we have developers who want to develop housing projects in the city of Long Beach, and it's very difficult to incentivize them or get them interested in a senior housing project because a lot of times the financials just don't make sense.'",
        "'speaker_4': 'But it's so much beyond financials and all the work that we're doing to make sure we have inclusionary housing throughout the city where we accommodate workforce and low to mid affordable housing units. We're not doing the same for senior housing and I think that needs to be a major focus for us moving forward.'",
        "'speaker_4': 'We've seen investment after investment in housing in the city of Long Beach, but very little investment is put specifically into senior housing. And we do have some success, successful projects and some success stories in regards to senior housing, but we certainly use should use that as a base to develop more.'",
        "'speaker_4': 'One of the other things that we hear a lot about is as we move forward and we we consult with futurists and urbanists about what kind of housing developments we want to incentivize in the city of Long Beach.'",
        "'speaker_4': 'We talk a lot about mixed use development and ones that are targeted specifically for seniors so that they don't have to drive there. There's a lot of walkability and a communal type of environment. So I'd like to know, as part of this agenda item, what opportunities we have in the future to attract developers to the city of'",
        "'speaker_4': 'Long Beach, to focus on senior housing projects, mixed use, senior housing projects and projects that will keep seniors who are looking to downsize because they're empty nesters. Their children have moved on and built their own families. How we keep them here in the city of Long Beach and not lose them to surrounding neighboring cities that offer more'",
        "'speaker_4': 'senior communities. So I ask my colleagues to support this item. And again, thank Councilman Austin for signing on. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Austin?'",
        "'speaker_7': 'Yes. I'm happy to sign on to this item. It makes a lot of sense in light of our most recent homeless count. That actually was very, very, very illuminating. And talking about the amount of people over the age of 54 that were living that are living on the streets currently.'",
        "'speaker_7': 'And I think that's most more than 50%. And so this item, I think, is timely. It makes a lot of sense for us to to study, look at opportunities to find out where we are, but also to look at the opportunities to develop more senior housing to meet the needs of our community and our residents today.'",
        "'speaker_7': 'I'd like to just say that I think that there are some some unique opportunities, particularly with surplus lands that both are with the city, but also the school district. And I would ask the city manager's office to look into those areas.'",
        "'speaker_7': 'And then to the maker of the motion. Councilmember Price I just it says that, you know, to work with developmental services, that department, but I would just open it up and allow the city manager to include all departments, including economic development and the housing authority to to look at, you know, opportunities there.'",
        "'speaker_7': 'If you be open to that friendly.'",
        "'speaker_4': 'Absolutely. I think that's a great idea. Thank you.'",
        "'speaker_7': 'Thank you so much. Happy to support.'",
        "'speaker_0': 'Thank you, Councilwoman Sara.'",
        "'speaker_1': 'Thank you, Vice Mayor. I appreciate this item that's brought forward by Councilwoman.'",
        "'speaker_4': 'Pryce, because, you know, I have quite a few affordable housing for seniors in my district. And in fact, I have, I think already maybe 2 to 3 buildings that's been there for a while. One of it is Mercy Housing.'",
        "'speaker_4': 'And I have actually a few more that's going up and that's that's going to be targeting low income seniors. So I love to see how based off of the housing element plan that was created, how it can be looked at throughout the whole city, which is what this item requests.'",
        "'speaker_4': 'On the income range of the seniors that you know it'll be available for because I do like to see and support housing for seniors throughout the whole city and how you could certainly build more. Thank you. Support the item.'",
        "'speaker_0': 'Thank you, Councilwoman Allen.'",
        "'speaker_5': 'I yes. I also think this is a great item. Councilwoman Pryce and I will be supporting this. I know that our second District Senior Commission representative, Alan Goldstein, has shared that more affordable housing is going to be really important in the growing elder abuse problems.'",
        "'speaker_5': 'I did want to ask Councilwoman Pryce if she would consider I got this question from one of my residents, which I thought was good. Can you look at how we can ease the senior housing navigation system? I'm hearing that each senior has to apply at each building rather than going through a central system.'",
        "'speaker_5': 'So that could be something.'",
        "'speaker_1': 'We could look.'",
        "'speaker_4': 'Into. Absolutely. I think that's a really good idea, too. I just wasn't aware that that's a hurdle, but absolutely anything we can do to help.'",
        "'speaker_5': 'Okay. And then one more Councilwoman Pryce also. Do you think that that you would consider also. Including the senior commission and the development of this report.'",
        "'speaker_4': 'Another excellent idea. Yes, absolutely. Maybe they can. I don't I absolutely want to do that. I don't know mechanically how that would happen. Would City Manager then work with the Commission to solicit input? I'm open to what however we want to do it.'",
        "'speaker_10': 'I think typically with a commission like that, we this is more of a request for information. We've done a number of presentations in the past on affordable housing. So we can kind of bring those together, show which ones are the senior projects, and then we would present that.'",
        "'speaker_10': 'And then we can give that to the senior commission probably after we do the two from four. And if they have certain recommendations that they would want to fold or forward on meeting, then we would do that and forward that on as well.'",
        "'speaker_10': 'So we can do it in a two step so we don't have to slow down the presentation of the report.'",
        "'speaker_4': 'I totally open to that. I think that's a great idea. Okay.'",
        "'speaker_1': 'Thank you, Councilwoman Pryce.'",
        "'speaker_5': 'And then also, this is for the city manager.'",
        "'speaker_1': 'Do the housing developments qualify.'",
        "'speaker_5': 'For density bonuses?'",
        "'speaker_10': 'Yes, there are certainly density bonuses that have to do with affordable housing, that state law. And so we can provide a little bit of information on that that's not restricted just to seniors, but certainly affordable housing projects.'",
        "'speaker_5': 'ROTHERT okay. That's all my questions. A great item, and I'll be supporting it.'",
        "'speaker_0': 'Thank you, Councilwoman Zendejas.'",
        "'speaker_2': 'Thank you so much, Vice Mayor. Thank you, Councilwoman Pryce and Councilmember Al Alisyn for this item. I'm really excited about it. As you know, I'm very passionate about the senior community here in our city and also the disability community here in our city.'",
        "'speaker_2': 'So I really think that this is a timely item to bring forward and we really do need to know more about what we have here in our city. And one of the things that I would like to see are ask Councilmember Price, if you would consider to me be even just in parentheses, include of people with disabilities'",
        "'speaker_2': '. The reason that I ask that is that, one, a lot of times people with disabilities are forgotten about and not really thought of. But at the same time, people with disabilities have a lot of the same income issues that seniors do, and a lot of seniors also have disabilities.'",
        "'speaker_2': 'So I don't know if that's something that you might be may consider adding in to this.'",
        "'speaker_4': 'Absolutely. And I thank you because you've brought that issue to light for a lot of us. We've talked about things like things that we take for granted, like elevators, for example, in housing projects. And so. Yes, absolutely. I mean, I think the most important thing is for our city team that looks at this issue to figure out'",
        "'speaker_4': 'what incentives can be made available for additional housing. And you're absolutely right. Many of our seniors have either, you know, well, they're all differently abled, but if they do have a specific disability, they have that additional hurdle in addition to affordability that that we don't think about.'",
        "'speaker_4': 'So absolutely. Yes, I'm happy to include that in the report and anything else anybody wants. I think, you know, this is a city wide report. We all like we all have seniors in our district. So. Yes.'",
        "'speaker_2': 'Thank you. Thank you. And the reason that I say that is because me being a person living with a disability, I lived in a place that was not accessible to me for ten years because I could not find a place that was accessible and affordable because the places that I was finding were either they were accessible, but'",
        "'speaker_2': 'I could not afford them or they were affordable, but I could not access them with my wheelchair. So I really appreciate and thank you again.'",
        "'speaker_0': 'All right. Thank you. And that satisfies the council comment at my support as well. I think it's a great item to request the support and all the amendments have made it even even better. You know that as long as I've worked in the city of Long Beach, I've always known that senior housing projects are always welcome in'",
        "'speaker_0': 'the community. I can think of, you know, great projects like the Senior Arts Colony. Every affordable housing tour makes a stop at the Senior Arts Colony or Ramona Senior Housing up in the ninth District that took an old, dilapidated bank that had vacated and turned into a great project that added 61 units of affordable housing.'",
        "'speaker_0': 'And I know we have an aging population. Councilman also made a great point about the homeless count. We can't take off an eye off the eye, off the ball despite how well we've done on particularly this particular group.'",
        "'speaker_0': 'So thank you so much. Is there any public comment on item 22?'",
        "'speaker_1': 'If there are any members of the public that would like to speak on item 22 in person, please stand up at the podium in Zoom. Please use the raise hand feature or dial star nine. Now we have one in Zoom.'",
        "'speaker_5': 'Sorry. This is item 21.'",
        "'speaker_0': 'Terry Quinlan, your housing.'",
        "'speaker_2': 'Thank you again. This is Terry Quinn and thank you, Susie Prize for bringing this to the city's attention. And please incorporate mobile home parks because they already exist. I did look up and found out that there are 2000 parks in the city of Long Beach and so they are affordable housing units.'",
        "'speaker_2': 'And I hope that you will consider that as part of your discovery as well. Thank you.'",
        "'speaker_0': 'Thank you. Mr. Kim.'",
        "'speaker_6': 'Thank you, Vice Mayor. Son, I can't face successor president. One of the greatest things about the sixth district is that, proportionally speaking, we house the most seniors. Check the facts. One of the things one of the things that I would love Development Services Department to put in this report.'",
        "'speaker_6': 'If we just put in Friendly's in there as a citizen, I would love. For one to see that in the data cluster. I have already looked at it, but just for the sake of the public. Uh, where are the, the the density, the proportionally speaking citywide of where are the seniors running?'",
        "'speaker_6': 'The second part is that because if we really want to be serious about housing our elderly population, we need to figure out a way to mandate the covenant housing for perpetuity because that I my personal experience of engaging with private equity people, there's two ways of how they look at senior housing.'",
        "'speaker_6': 'Um, they look at it as pre because a lot of buildings there's three you can look you can also put that in the report there's three buildings that are on their way out in terms of covenant housing. The covenant is about to be up.'",
        "'speaker_6': 'So they look for buildings like that to buy them and they kick out all the old people. I mean, we saw that happen here, um, on Ocean with the Breakers. Um, there's bigger buildings. I think the Lutheran one is one of them, where people are salivating, waiting to buy the building so they can kick out all the'",
        "'speaker_6': 'seniors. That's one thing. And then the second thing is that, you know, because of our transit hub fixation with density and everything is that they want to develop in the transit hubs, the housing. Uh, but it doesn't have the strenuous covenant of the past.'",
        "'speaker_6': 'So that's yesteryear. It's 47 years or more. These people are developing in transit hubs like the Arts Council colony. That was just reference people. You can look at how long that one is. People are developing those buildings with the mindset of will take federal money for a couple of decades right will alleviate are either bond restrictions or'",
        "'speaker_6': 'loan restrictions and then we'll we refinance by the time we refinance. We no longer legally have to do senior housing anymore. I think we can kick out all the old people and do really want to do, which is basically get a tax free luxury unit apartment building in the transit hub.'",
        "'speaker_6': 'So I just think that these are the kind of things that need to be in the report because it's very actively being done right now by entities nationwide like Blackstone, you know, and Linamar and a couple of other ones.'",
        "'speaker_6': 'So just things that that we can throw out because if we really want to house our seniors, we have to do it forever, not just for a slight amount of time. Thank you.'",
        "'speaker_0': 'Thank you. All right. That satisfies public comment. Let's cast their votes.'",
        "'speaker_1': 'Councilwoman Zendejas.'",
        "'speaker_13': 'Right.'",
        "'speaker_4': 'Councilman Allen. All right, Councilman Price.'",
        "'speaker_1': 'Councilman Suber.'",
        "'speaker_6': 'Not I.'",
        "'speaker_1': 'Councilwoman Mongo. Hi. Councilman Ciro, i. Councilmember Urunga.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_7': 'All right.'"
    ],
    "Letter of Completion for the Minimum Wage for Healthcare Workers.": [
        "'speaker_1': 'Vice Mayor Richardson. Motion carries nine zero.'",
        "'speaker_0': 'Thank you. 22, please.'",
        "'speaker_1': 'Communication from City Clerk Recommendation to receive and file the letter of completion from the Los Angeles Registrar Quarter County Clerk for the Long Beach Minimum Wage of Health Care Workers.'",
        "'speaker_0': 'Thank you. As a staff report here.'",
        "'speaker_1': 'There is no staff report on file. Mr. Modica, did you from the city clerk's office? This is.'",
        "'speaker_10': 'Yes, Johnny Vallejo. I can give a short staff report on this item.'",
        "'speaker_6': 'Thank you. Good evening, Vice Mayor and council members. So this this item here is to bring a petition that was submitted to to city clerk and confirmed and certified by the county clerk related to a petition in regards to health care, minimum wage increase.'",
        "'speaker_6': 'So in addition to this is somewhat related to a previous request for a minimum wage study that was requested previously from economic development staff, which we are currently in process of conducting. So we shared out via TFF recently an update on the status of that excuse me, of that minimum wage study.'",
        "'speaker_6': 'So as I understand you will be provided the, the certification in the language that was certified tonight and you will have certain actions that you may take tonight. Uh, one of those being an opportunity to wait for the completion of the study and reconsider this item at a later time.'",
        "'speaker_6': 'And that concludes my staff report.'",
        "'speaker_0': 'All right. Thank you, Councilman Ciro.'",
        "'speaker_4': 'Thank you, Vice Mayor. So is I mean, based on the TFF, is there any outcome of this study so far?'",
        "'speaker_6': 'So we have not completed the study. So the study is in process right now. We, the consultant LLC is currently working to um, to circulate a survey, uh, that is already being circulated with some of our partners and will be more broadly circulated starting tomorrow.'",
        "'speaker_4': 'And when do you expect us to get something that we will be able to review?'",
        "'speaker_6': 'It will be tight. I think we shared some of the timing considerations related with the study, the complexity of the study, and some of the, the hurdles that were, um, that were expressed to us by the consultant. They will, though, attempt to have a study completed in draft for presentation to the Economic Development Commission on August 1st'",
        "'speaker_6': 'and a very tight turnaround. We will then bring that that that study for review to the city council the following day, August 2nd.'",
        "'speaker_1': 'Thank you. I'd like to to.'",
        "'speaker_4': 'To motion that we continue the study until we're able to get it by August 1st to be able to have further discussion. And as far as how. How to proceed with our options.'",
        "'speaker_0': 'Thank you. Councilmember Garrincha.'",
        "'speaker_10': 'A very supporter of the site. I'm looking forward to the completion of the study.'",
        "'speaker_0': 'Thank you, sir. Public comment here.'",
        "'speaker_1': 'If there are any members of the public that would like to speak on item 22 in person, please line up at the podium in Zoom. Please use the raise hand feature or dial star nine now. We have one in Zoom.'",
        "'speaker_1': 'And over nine in line.'",
        "'speaker_0': 'Okay. So that means we go down the 90 seconds. So let's do this handle Zoom. Matter of fact, let's start here because they're going to actually be standing and the people on Zoom are going to be at home.'",
        "'speaker_0': 'So let's start right here. Thank you. All right. You recognize.'",
        "'speaker_5': 'Thank you. Good evening, everybody. Good evening. Um, honorable counsel officials here. And, uh, everybody. My name is Cynthia Okafor. I am a licensed vocational nurse at one of the psychiatric facilities here in Long Beach City. I am here to humbly implore you to.'",
        "'speaker_13': 'Consider raising minimum wage.'",
        "'speaker_5': 'For health care workers to $25 an hour. I know he mentioned about 30. And, um.'",
        "'speaker_13': 'While that is a process, I am still requesting that you listen to us and maybe be swayed by our arguments. So a $25 minimum wage for us. Minimum wage. Minimum, uh.'",
        "'speaker_5': 'Minority group actually because I say minority, because majority of the people who work, uh, at healthcare facilities, well, I'll use the place where I work. Uh, you know, mostly people.'",
        "'speaker_13': 'Of the minority group and majority of us, um. I'm really living beyond the poverty threshold in California. It's. It's. It's. It's. It's. It beats me. I don't know. Health care is something that nobody should be. Should be taking a back seat that I remember.'",
        "'speaker_13': 'Thank you. 2020 time many.'",
        "'speaker_5': 'Of us had okay. Many of us had in 2020 when the COVID case happened, when we had like the first outbreak of COVID things. You worked alone many times because I was burnt out.'",
        "'speaker_13': 'I almost gave up. You know, I worked with so many of.'",
        "'speaker_5': 'My colleagues and well, some of my colleagues felt the same way. We walked.'",
        "'speaker_13': 'Along. We were burnt out.'",
        "'speaker_5': 'If only we had therapy.'",
        "'speaker_13': 'Right.'",
        "'speaker_0': 'Thank you. Thank you. Think we really have to be fair to everyone. But thank you so very much for your testimony. Thank you. Next speaker, please.'",
        "'speaker_5': 'Hello. My name is Marcella. I just want to first off say that, you know, it's a privilege to hear us out, us as workers. Through this pandemic as health care workers have been there. When you think of health care, it's dedication, time, devotion, blood, sweat, tears.'",
        "'speaker_5': 'I have three kids and there's been many a times where I would have to do doubles and, you know, not see my kids off to school. And, you know, it hurts. But my devotion was to take care of patients.'",
        "'speaker_5': 'It's a struggle at times. But as a single mother, I tried to push through. But with everything on the rise, as far as groceries, rent, kids, there's no limit to payments. So I just hope that you guys really taking consideration to our struggle and our needs and we need help just as well as our patients do in'",
        "'speaker_5': 'our unit. We have COVID patients and it takes time, you know, away from our family to help them in order, you know, to save their lives and to help us keep our head above water, you know, to provide for our family.'",
        "'speaker_5': 'So I ask that you guys deeply consider our needs. Thank you.'",
        "'speaker_0': 'Thank you. Next week or please.'",
        "'speaker_6': 'Very good. Thank you.'",
        "'speaker_5': 'I love when I start this. I mean, I'm Miller Carlin. Oh, I'm sorry. Uh.'",
        "'speaker_3': 'Trabajo para la.'",
        "'speaker_5': 'Salud aqui in Long Beach. But am.'",
        "'speaker_3': 'I a key player in La Paramo and help mentor the paramount nosotros.'",
        "'speaker_5': 'System? Must be the.'",
        "'speaker_3': 'End the.'",
        "'speaker_5': 'Maintenance salary of the minimal work aloneness as it damsel Cousteau they re. The more.'",
        "'speaker_3': 'We got on ESA.'",
        "'speaker_5': 'Is more rural Salida the land people can nosotros is.'",
        "'speaker_3': 'Is the movie mucho cost of.'",
        "'speaker_5': 'Para nosotros. De la leche tortillas.'",
        "'speaker_3': 'La.'",
        "'speaker_5': 'Gasolina todo acevedo la renta todo necesitamos sobre sally salida adelante. You're so you're persona. Get me your you will get real mucho nosotros gammas al in Los Gatos the Los Pacientes Black It.'",
        "'speaker_3': 'Is cal mental used.'",
        "'speaker_5': 'I This guy knows that his grandmother's thermostat has done the same prep work. I am from Barnoldswick and Lana from gold. P e. Buddhism knows better than most is the cost of a no law. No law meant then get in.'",
        "'speaker_5': 'Was it not less system of supplicant looking lamenting but utterly rather lanthimos utter convinced that I be the con mistress.'",
        "'speaker_3': 'For a possible.'",
        "'speaker_5': 'Mistress illusionist. Yeah, it's total craziness.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_6': 'Hello. Thank you so much. My name is Amelia Carlene. Good afternoon, everybody. Thank you so much for being here. And I want to just to let you know, I work with Long Beach between Long Beach, Blue Lagoon in Paramount and Health Care Mental Clinic.'",
        "'speaker_6': 'We kindly request to each one of you today that we need for you to increase wages is really difficult because we're barely making ends meet. It's very difficult for us. The cost of living just by itself milk, tortillas, gas, everything has increased drastically.'",
        "'speaker_6': 'So we actually want that change to make happen. I mean, I'm a person, I can tell you that I'm a hard working person. Every day of risking my life are risking working with patients, not just with them, but even actually even having the risk of getting hit by them.'",
        "'speaker_6': 'And also, we can only request once again that you make this change. We need that increase. It's getting very difficult just to make ends meet on a daily basis. Thank you.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_6': 'Thank you very much, Vice Mayor and members of the City Council, Alex Jones, speaking tonight on behalf of the Hospital Association.'",
        "'speaker_9': 'Of Southern California. I want to thank each of you individually for your engagement in recent weeks on this very complex issue. As you'll hear from members of the coalition tonight, we've got two major concerns. One I think was voiced earlier tonight as part of the motion, and that is with the timing of the economic impact study.'",
        "'speaker_9': 'It's a very complex issue. Long Beach is a very nuanced, complex city. If we rush into this without knowing what the economic impacts are directly or indirectly, I think we're doing the voters an injustice. The second issue is a good governance issue, and that is this should be put to the vote of the people.'",
        "'speaker_9': 'Again, Long Beach is a diverse constituency, lots of ideas, lots of complex issues. People have a diversity of opinion on it. We would ask that you wait for the economic impact study. Give yourselves and your voters time to digest the findings of that study.'",
        "'speaker_9': 'As a group, we are a stakeholder and we are engaged with leads. But what we've heard so far is that there will be significant time constraints on doing a proper study of this very complex issue. Number two, we would ask that from a good governance standpoint that you put this matter on the ballot and let the people'",
        "'speaker_9': 'of Long Beach decide. Thank you very much.'",
        "'speaker_0': 'Thank you. Next week, a police.'",
        "'speaker_12': 'Good evening.'",
        "'speaker_4': 'My name is Kristin Pugh. I'm the vice president for government relations for the memorial care health system. As you know.'",
        "'speaker_12': 'Our system includes.'",
        "'speaker_4': 'Memorial care at Long Beach Medical Center and Miller Children's and Women's Hospital, as well as other ambulatory sites of care in the city. We are proud of our long, deep history. With over 100 years providing compassionate and quality health care to the Long Beach residents.'",
        "'speaker_4': 'Our hospitals are top regional.'",
        "'speaker_12': 'Providers of medical services.'",
        "'speaker_4': 'And that is thanks in part by our dedicated workers. From environmental services to radiology to pharmacy and many others. I'm here today.'",
        "'speaker_12': 'To speak on the proposed.'",
        "'speaker_4': 'Health care wage measure and to recognize and thank you, the Council, for requesting an economic impact report. As with other hospitals.'",
        "'speaker_12': 'Community clinics.'",
        "'speaker_4': 'Workers and local organizations, we are concerned about this proposed measure. The measure is arbitrary, unequal and discriminatory.'",
        "'speaker_12': 'It excludes the.'",
        "'speaker_4': 'Majority of workers in the city. Could deepen inequities in the health care system.'",
        "'speaker_12': 'And jeopardize.'",
        "'speaker_4': 'Access to care. We are proud and appreciative of the professionalism, hard work and personal sacrifice that all of our employees make and have made to treat.'",
        "'speaker_12': 'Our patients during this pandemic. But unfortunately, on acting, this measure.'",
        "'speaker_4': 'Is not the way to show appreciation. Again, I want to thank this Council for recommending the city to conduct an economic analysis to better understand the impacts of this measure. We hope you agree this is something the voters should have the opportunity to inspect on their own.'",
        "'speaker_4': 'Thank you so much for your time.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Lock on some very much. My name is Florrie Munoz. I was working for 30 years at some Mary's Medical Center as a CNE and as well as a dialysis tech for 18 years working two jobs to support my family as I am a single mother.'",
        "'speaker_5': 'One of the big issues that the hospitals right now is they're being short of staff and during the pandemic got worse. The reality is that hundreds of health care workers are working for less than $25 per hour. And.'",
        "'speaker_5': 'After the pandemic. Got worse. Even after that, we risk our lives and our families lives taking care of patients during the pandemic. And we still do. The inflation is 8.4% higher. Yes. Last year alone. How we can live with a salary that barely cover our living expenses.'",
        "'speaker_5': 'We are here to ask you, all of you, please.'",
        "'speaker_3': 'Please support our.'",
        "'speaker_5': '$25 minimum wage for clear language. And they did that and they did it. Please don't leave language behind with the servant. We are it. Thank you for your time.'",
        "'speaker_6': 'Thank you. Next week, at least.'",
        "'speaker_5': 'Good evening, council members. My name is Celine Castillo. I've been a CNE for six years and I have been working for St Mary's Hospital in Long Beach since the beginning of the pandemic. But even in the work, even in my work as a skilled credential health care worker, I have to work two jobs to make ends meet'",
        "'speaker_5': 'because I also work as a CNE in San Pedro. I've been getting tested for COVID weekly since March of 2020 due to the degree of exposure. I faced many challenges in my life. I'm grateful for my opportunities as a student and a doc, a recipient.'",
        "'speaker_5': 'I am working hard to follow my calling and serve my community, but I have nothing to show for my sacrifices. Having to work two jobs has meant everything else in my personal life has been on delayed. We, as health care workers, are feeling broken throughout the pandemic.'",
        "'speaker_5': 'I had to isolate myself from my family, my friends, because I couldn't risk getting them sick. Even I had I. I even had to care for a fellow coworker who contracted COVID and passed away on my watch. The experience has been very lonely and hard on me psychologically.'",
        "'speaker_5': 'I can't. But I continue to work in health care because I love what I do. I could make 24 an hour at Target or become an insurance agent like some of my former coworkers, many who have decided is not worth staying to endure the stress while feeling undervalued and left short staffed.'",
        "'speaker_5': '80% of health care workers believe California is definitely going through a crisis of short staffing. It's real.'",
        "'speaker_1': 'Your time has expired, ma'am.'",
        "'speaker_0': 'Thank you so much. Thank you. Right next to the police.'",
        "'speaker_5': 'Good evening, Vice Mayor. City Council members. My name is Laura Culbertson. I am the chief human resources officer at College Medical Center. College Medical is a 221 bed acute care hospital with surgery, medical and behavioral health services. It has been a fixture in the community for 65 years.'",
        "'speaker_5': 'We employ over a little over a thousand employees and provide services for approximately 20,000 patients annually. Many of those patients are dramatically underserved in our community, including those with behavioral health issues and individuals with limited economic means. This measure, while it does increase all employee wages, it doesn't account for how we are reimbursed, which is generally a'",
        "'speaker_5': 'flat fee, which with no negotiation to increase. We're dedicated to serving behavioral health patients. We have plans in the works. We're about to open a 27 bed additional unit. However, due to this measure, there are concerns that we'll have to limit the number of beds in the community.'",
        "'speaker_5': 'Um. You know, I think that arbitrarily creating a two tier system is going to lead to work for lead to a workforce shortage at smaller clinics and public health care facilities, jeopardizing, jeopardizing access and quality of care for Long Beach's already underserved communities, including those 2000 homeless people that you spoke about earlier.'",
        "'speaker_1': 'Time has expired, ma'am.'",
        "'speaker_0': 'Thank you so much for your time. Okay. Thank you. Next speaker, please.'",
        "'speaker_5': 'Right. Hi. My name is Vanessa Rodriguez and I work at St Mary's Hospital. I have been working there for 15 years and I work in the IVF department. And as you can see, we have a thin kitchen people and we I work.'",
        "'speaker_5': 'Been working there 15 years. So since day one, we've been there working through the COVID period. Some people without vacation denied a vacation because of the shortage of the staff.'",
        "'speaker_3': 'So I feel we deserve it.'",
        "'speaker_5': 'Because we've been there day after day, working, seeing patients passed away. We've been there families.'",
        "'speaker_3': 'We've been there for them.'",
        "'speaker_5': 'We've been working in every single patient's.'",
        "'speaker_3': 'Room, cleaning the rooms. So we for me, emotionally.'",
        "'speaker_5': 'Having to see patients passed away, it's mentally hurt. My feelings and everything, having to be there.'",
        "'speaker_3': 'But we are still there. We never gave up.'",
        "'speaker_5': 'And we're still there.'",
        "'speaker_3': 'So I feel we deserve it.'",
        "'speaker_5': 'And then the cost of life. The life, the cost, the especially Long Beach.'",
        "'speaker_3': 'I grew up here. It's changed a lot. Really lot.'",
        "'speaker_5': 'Lost everything up. I'm pretty sure medical expenses have.'",
        "'speaker_3': 'Gone up too. So I feel we deserve it.'",
        "'speaker_0': 'Thank you for your time.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thanks to the police.'",
        "'speaker_3': 'Good evening. My name is Reverend Stanley Kim, and I am the director of Mission Integration, the St Mary Medical Center. And these are my colleagues. And it pains me to stand before you, but I ask for your counsel as well as your prudence.'",
        "'speaker_3': 'We all seem very supportive of our 400,000 patients annually and of which the 70% are under insured. Our outreach programs and medical care results in over $67 million of a net community benefit annually. We are your safety net hospital seeing high medical and uninsured.'",
        "'speaker_3': 'Our number one focus is maintaining access to the care we provide. Enacting measures that implement higher wages at some facilities while excluding the other majority of others, is not only inequitable, but also creates an unstable market. For instance, this will take a heavy toll on staffing as skilled nursing facilities.'",
        "'speaker_3': 'Since COVID, we have been struggling to place individuals in lower levels of care. With more surges happening as we speak, this would impact the total system of care in Long Beach. We can move patients out. We can take critical COVID patients in.'",
        "'speaker_3': 'We understand that the US has had a tight turn around and should the analysis exclude some important economic considerations? We believe continuing to do thorough research on this measure is important. Our residents also should have an opportunity to weigh the merits of this measure and determine whether the policy is good for the Long Beach community.'",
        "'speaker_3': 'So your time is strongly urge the Council to refer the measure to the ballot.'",
        "'speaker_9': 'Thank you very much. Thank you.'",
        "'speaker_0': 'Next speaker, please. Thank you, everyone. Let's let's let's move through public comment. Thank you so much. Next speaker, please.'",
        "'speaker_7': 'Good evening. My name is James Bell and I'm a radiology tech. I work for Kaiser Permanente. And I'll be very upfront with you gentlemen and ladies. This does not impact me directly at all. But I am speaking here in support of the $25 minimum wage for healthcare workers.'",
        "'speaker_7': 'We've heard from the California Hospital Association of the various employers saying how this would be a negative impact to them. But the bottom line is they're trying to create a divide between health care workers of the haves and the have nots.'",
        "'speaker_7': 'It is labor's contention that everybody deserves $25 an hour as a minimum wage working in health care. You're doing an impact study. I was at Downey when they discussed doing the same thing. And the and the legal expert there said the likelihood of getting an effective and accurate assessment by August 1st is unlikely, in part because the'",
        "'speaker_7': 'data you're going to have to get is going to be from the California Hospital Association and the various employers who are not going to give out confidential information about their finances to you, because that could impact them in a competition.'",
        "'speaker_7': 'So they're not going to give you accurate information and they're going to tell you what they.'",
        "'speaker_9': 'Want you to hear.'",
        "'speaker_7': 'And they're going to spend millions of dollars to lie to the voters if it goes to the ballot. And we're talking about millionaires who run these hospitals.'",
        "'speaker_2': 'Sorry to tell.'",
        "'speaker_7': 'You that I make too much money. Thank you. So I'm asking.'",
        "'speaker_3': 'You, please.'",
        "'speaker_7': 'On behalf of labor.'",
        "'speaker_3': 'To support this measure for the health care heroes.'",
        "'speaker_9': 'So you're supposed to be honoring that, sir.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Good evening. Council members and Vice Mayor Richardson. I am from the Hospital.'",
        "'speaker_5': 'Association and I'm here today to speak with you.'",
        "'speaker_2': 'About the.'",
        "'speaker_5': 'Minimum wage health care worker initiative. The previous caller said that we are choosing winners and losers. But I want to make clear, this measure chooses winners and losers. This measure targets.'",
        "'speaker_4': 'Private facilities.'",
        "'speaker_5': 'And integrated systems. It excludes community clinics, Planned Parenthood clinics, acute care.'",
        "'speaker_4': 'Senior living facilities. This measure is the measure that causes a divide. And as you heard.'",
        "'speaker_5': 'From many of the speakers, there is already a workforce shortage going on.'",
        "'speaker_4': 'In health care. The hospitals are well aware of that.'",
        "'speaker_5': 'Those that are included and those are excluded are working to recruit and retain health care workers every day.'",
        "'speaker_4': 'This is not the way to do it.'",
        "'speaker_5': 'Choosing winners and losers.'",
        "'speaker_0': 'Just, just a moment, folks, please. Just a moment. This doesn't help us get through the process. We want to make sure everybody's heard no matter which side, and that you get your full 60 seconds. So when that happens, we have to roll back more time.'",
        "'speaker_0': 'So just respect, respect the process. Let's go ahead and move through. Thank you.'",
        "'speaker_4': 'Thank you. So this does not. We're asking you not to put us in a position where.'",
        "'speaker_5': 'You're choosing winners and losers. We're asking you to do an economic.'",
        "'speaker_4': 'Study to look at the overall impact on health care systems. And we applaud you for that step. Monterey Park has taken that step today. Inglewood sent this to the ballot. Duarte has sent this to the ballot. And yes, there has been some cities that have.'",
        "'speaker_5': 'Chosen to move forward. And those cities are currently experiencing a referendum.'",
        "'speaker_4': 'Because this issue is.'",
        "'speaker_5': 'Discriminatory and it chooses winners or losers.'",
        "'speaker_1': 'Losers matter. Time is up.'",
        "'speaker_4': 'Treats people working, doing the same job at different locations differently. Thank you for thank.'",
        "'speaker_0': 'You for your time. Next speaker, please.'",
        "'speaker_5': 'Hi. Good evening. I tried to do the best I could. Thank you for be here for us.'",
        "'speaker_3': 'Because you guys represent to all of us.'",
        "'speaker_5': 'And for that, we both for you guys. Well, we want to tell you about they really we need that. The rent is very expensive. You can find one bedroom, 1500, no minimum. That that is very expensive. The gasoline.'",
        "'speaker_5': 'What happened in Ukrainian? They sent already five packet the money of Crimea. So we need help like.'",
        "'speaker_3': 'Ukrainian to.'",
        "'speaker_5': 'You know sergeant do you represent us. So first.'",
        "'speaker_3': 'Here.'",
        "'speaker_5': 'Later there but very good help Ukrainian but help.'",
        "'speaker_6': 'Us to.'",
        "'speaker_5': 'We need that for candles so barber. And coming another thing like monkey part it's another thing impact to also everybody is scared because we don't know what's going to happen for you for me and we already have a lot employer death so my hospital is good because give me a good things but.'",
        "'speaker_3': 'We need you guys help you too. I everybody know only.'",
        "'speaker_5': 'Employee of the Empresario something like that. Everybody because if you have money for other things can have on it for us.'",
        "'speaker_13': 'So please help.'",
        "'speaker_5': 'To us in off of them and everybody because they can do their self. You represent and need to help everybody because we live in the United States.'",
        "'speaker_3': 'Thank you. Please.'",
        "'speaker_5': 'Thank you. Thank you for.'",
        "'speaker_10': 'Your time.'",
        "'speaker_0': 'Next week.'",
        "'speaker_7': 'The please.'",
        "'speaker_2': 'Yes. Sorry.'",
        "'speaker_0': 'Thank you. Come forward.'",
        "'speaker_5': 'Good evening. My name is Kimberly Estrada.'",
        "'speaker_12': 'And I'm.'",
        "'speaker_2': 'Speaking in support of raising the minimum wage. I would like to let you guys know that I am a food service.'",
        "'speaker_12': 'Worker at.'",
        "'speaker_2': 'St Mary's. My mother is here. She is a housekeeper at St Mary's. My sister works in the.'",
        "'speaker_5': 'Lobby in St Mary's. Checks in visitors and staff. My entire family has given its livelihood to this amazing hospital. But during the pandemic, you know, I.'",
        "'speaker_2': 'Have seen the change and we've all been short staffed, so much so that they.'",
        "'speaker_5': 'Eliminated.'",
        "'speaker_12': 'Positions and.'",
        "'speaker_2': 'Disperse the workload among the workers that.'",
        "'speaker_5': 'Stayed. And, of course, the pay didn't go up, you know, and it's not.'",
        "'speaker_2': 'Like just because you're sure you're.'",
        "'speaker_5': 'Not going to feed two floors of patients, we get it done because we have to.'",
        "'speaker_12': 'We care about our patients.'",
        "'speaker_5': 'So I'm here to ask you to support us in raising that minimum wage. The last five.'",
        "'speaker_4': 'People.'",
        "'speaker_5': 'That have been hired in my department this year to help us with that problem. All of them have quit. A day, a week, a month. Every single one of them.'",
        "'speaker_2': 'You think you're getting help and they all leave.'",
        "'speaker_5': 'And I ask myself, why is that?'",
        "'speaker_2': 'Our pays and competitive anymore. And it's bordering on unsustainable. So please help us, because we're asking for your help. We need it badly. Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_7': 'Next speaker, please.'",
        "'speaker_6': 'And I can face six sense for president. I was born at 2776 Pacific Avenue. There used to be Pacific Hospitals, now college medical. I'm speaking in support of the workers. I think they should get more than $25. But I accept the number that you guys want.'",
        "'speaker_6': 'But it's interesting to me that we all obviously have a rank and file versus senior management conversation here as effectively split on the die the aisles here. But it's interesting to me that the woman from college made a medical reference that they might not be able to pursue a further 27 bed expansion to, you know, attack our'",
        "'speaker_6': 'homeless population due to this particular process. That's crazy, because currently, as it stands, the state of California, the highest medical fraud case was from Pacific Hospital when $900 million was stolen by Dr. Faustino Bernadette. And that money was still being used for why they can't pay people a fair wage.'",
        "'speaker_6': 'And also, the only person that Trump pardoned, uh, in California outside of Duncan Hunter, it's interesting to me where money the the lack of money is ignored. And and when it's supported, it's supported when you can pay people a couple of hundred thousand dollars to do kickback schemes and steal from the workers tax payers like ourselves.'",
        "'speaker_6': 'When workers come up here and ask for a fair wage, there's no money. That's wrong.'",
        "'speaker_1': 'Your time has expired.'",
        "'speaker_6': 'It's wrong.'",
        "'speaker_0': 'Thank you. Our last speaker.'",
        "'speaker_7': 'Hello, city councilman. My name is James Marks. I'm a former health care worker. I worked in health care for many years. And I'm here at a for support of these people who put their lives on the line every single day.'",
        "'speaker_7': 'They're underpaid. They're under-resourced, out of work that they do. They overdue. Trust me, I know. You know, they owe their lives on the line with COVID and everything else. Not only that, but in some institutions, they're working. They're working with.'",
        "'speaker_9': 'With their.'",
        "'speaker_7': 'Lives, their health is jeopardized. So I just want to say, I'm here for support of them and the working class. You all everyone up here, we all, we're working class people and some of us, we still are to this day, our parents, our great grandparents.'",
        "'speaker_7': 'We're working class people. So we're all able to relate to what they're saying. This is not about you have inflation going up. This is a.'",
        "'speaker_9': 'Survival thing going on right now with people. People are in dire straits. They're in desperate need. People need relief.'",
        "'speaker_7': 'And I don't know any one else who deserves it other than needs. And then you have someone who comes here from corporate who's saying what they don't need. I worked in College Medical Center. Trust me, I know they have the resources and the fans are everywhere and corporate, they have it.'",
        "'speaker_7': 'It's just a matter of the we'll the political will to do it for the people and the hard to do it for the people. Thank you very much.'",
        "'speaker_6': 'And ah, I missed it.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'We have one speaker zoom does it.'",
        "'speaker_5': 'We have one speaker in Zoom.'",
        "'speaker_0': 'All right. Let's let's handle the Zoom.'",
        "'speaker_1': 'Speak three in a row.'",
        "'speaker_4': 'So that.'",
        "'speaker_2': 'Evening, my name is Serena Jo Cell, and I am assistant director of public affairs at Kaiser Permanente South Bay. I want to thank the Council for working with the L.A. EDC to conduct a thorough impact analysis. Kaiser Permanente has served Long Beach since 1954.'",
        "'speaker_2': 'We are the largest private employer in the state of California and we employ 147 staff in positions that are Long Beach medical officers who care for more than 32,000 members. We take.'",
        "'speaker_4': 'Great pride in providing competitive.'",
        "'speaker_2': 'Pay, strong benefits and exceptional support to our employees. Everyone is concerned about health care worker burnout, and that is why we have invested so heavily in supporting our workforce, particularly over the past two and a half years. We have provided additional COVID related benefits, including childcare, grant, alternative housing, additional paid sick leave and onsite counseling.'",
        "'speaker_2': 'And we provided bonus payments to all of our employees. The issue of burnout is serious, complex and multifactorial. The solution placed before you by the initiative's proponents will not fix this problem. Instead, it threatens to deepen the disparities in our broader health care system, exacerbating the challenges that community clinics already face in hiring as they struggle to'",
        "'speaker_2': 'compete for staff. We thank the Council for taking steps to fully understand the potential consequences of the proposed measure and ask that you ultimately let the voters decide. Thank you.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_0': 'All right. Thank you, sir. Will now take you back behind the rail. Thank everyone for their public comment. We have a motion. Mr. City Attorney, can you restate the motion.'",
        "'speaker_10': 'Has as I understand, the motion is to continue this item until you August 2nd when you have the economic study. Back at that time, the decision under the election code for the Council will be to either adopt the the initiative as written without changes or place it on the ballot.'",
        "'speaker_0': 'Right. Okay. So let's go ahead and move on to the roll call vote, please.'",
        "'speaker_1': 'Councilman's in the house.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman allen.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Price, I. Councilman super. Now I. Councilwoman Mongo I. Councilwoman Ciro, I. Councilmember Your Honor, I. Councilman Austin. Hi, Vice Mayor Richardson. Motion carries nine zero.'",
        "'speaker_0': 'Thank you. Now we're going to move up item number 28, the sister cities presentation. I'm going to hand over hand it over to Councilman Austin to manage this one. Thank you.'"
    ],
    "Sister City Application of Taoyuan City, Taiwan.": [
        "'speaker_5': 'Item two so.'",
        "'speaker_7': 'Much. And. Clerk. Can you read the item, please?'",
        "'speaker_1': 'Item 28 Communication from Councilman Austin. Recommendation to approve its application to Taiwan as the city's newest sister city. It's a recommendation to approve the application of the Tao Yuan City, Taiwan, as a city's newest sister city.'",
        "'speaker_7': 'Okay, thank you so much. And I would just ask if you guys can please exit quietly. We still have business before the council. Thank you so much. And I'll recognize myself on this item. Motion. I'm excited to bring this item forward, which at the Long Beach City Council to approve the application from Taiwan City, Taiwan for sister'",
        "'speaker_7': 'city status with the city of Long Beach. Five years ago, the Taiwan City sent a delegation of government leaders and prominent business figures to Long Beach in hopes of forging a stronger relationship and ties between our cities. Since then, our partnership has blossomed into a friendship and partnership, and we've been fortunate enough to host Taiwan City representatives'",
        "'speaker_7': 'on several occasions. Like Long Beach, Taiwan City is a multi-ethnic metropolis that acts as a logistics hub for Taiwan. Both cities have taken advantage of our coastal positions to develop into hotbeds for trade and commercial activity. Embracing Taiwan City as a sister city, providing multiple or multiple I'm sorry, a mutually beneficial exchange of business opportunities and port'",
        "'speaker_7': 'strategies. Further, an exchange of culture may lead to enrichment for both of our cities. Throughout the exhaustive application process, Taiwan City has shown a willingness to embrace. Long Beach. Worked diligently with our sister cities of Long Beach. They attended Dragon Boat festivals, promoted Taiwan, Hakka, food culture and local events.'",
        "'speaker_7': 'And I want to also just recognize that during our toughest times during the pandemic, when we were dealing with PPE shortages, it was our friends from our from Taiwan City who were sending personal protective equipment like face masks and shields and gloves and other equipment to our emergency operations center.'",
        "'speaker_7': 'Their hard work has culminated in the sister city's of Long Beach organization, unanimously approving their application to establish a sister city relationship on December 28, 2020. However, Council approval is still needed to formalize this agreement and this relationship.'",
        "'speaker_7': 'I'd like to thank those in attendance today who've worked tirelessly to make this partnership possible, and I would ask that my colleagues support and embrace Taiwan City, Taiwan as a sister city for the city of Long Beach. And I'd like to kick it over to the city attorney for.'",
        "'speaker_10': 'Thank you, Councilmember Austin. And the request is totally understood by the council member. But I was wondering if we could change the motion to direct the city attorney to prepare a resolution approving the application of Taiwan, Taiwan, new city, Taiwan as a sister city.'",
        "'speaker_10': 'If that direction we received tonight, there is no action that the mayor would take or be authorized to take. So it would be a vote of the body. So tonight, if it's the will of the council, we would bring back to you next at the next meeting a resolution approving this.'",
        "'speaker_10': 'And then it would be turned over to the sister cities of Long Beach, obviously, to administer on behalf of the sister city program. Thank you.'",
        "'speaker_7': 'So move that. I accept that. Mr. City Attorney, that is our motion and tastic.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_4': 'I wholeheartedly support this item and thank Councilman Austin for bringing it forth.'",
        "'speaker_0': 'All right, Councilman Ciro?'",
        "'speaker_5': 'Yeah. I also want to add my support.'",
        "'speaker_4': 'I'm always supportive of anything that allows us to do mutually beneficial exchange for business opportunity, port strategies, and obviously especially cultural enrichment with other countries. Thank you.'",
        "'speaker_0': 'Thank you. I'll just. Councilman Allen.'",
        "'speaker_1': 'Yeah. Just real quickly, just want to say thank.'",
        "'speaker_5': 'You to Councilman Austin for bringing this forward. This is a great item and I will be supporting it.'",
        "'speaker_0': 'Thank you. And offer my support as well. I will now go to public comment. Is there public comment on this item? That would be the time to come forward.'",
        "'speaker_1': 'Are there any members of the public that would like to speak on item 28 in person? Please line up at the podium in Zoom. Please use the raise hand feature now.'",
        "'speaker_0': 'Thank you. If you will sit on.'",
        "'speaker_8': 'My name is Susan Redfield. I'm president of the sister cities of Long Beach. And I want to thank Councilman Austin for bringing this request for full status. I'm startled because I didn't know I was going to have to wait another month anyway.'",
        "'speaker_8': 'Sister Cities happily collaborates with thousands of Long Beach residents from multiple backgrounds each year. It's our vision to continue serving as an international arm for our city and its leadership, serving toward the betterment of the personal and economic future of Long Beach.'",
        "'speaker_8': 'Thank you for the consideration of this request.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_6': 'Please. Hi. Good evening. My name's Mindy, and I'm part of the Long Beach, Italian Sister City Formation Committee. I just wanted to thank the Long Beach City Council and Councilman Al Alston for bringing this up today. I've been delighted to be working with the rest of the sister cities of Long Beach City members for the past several'",
        "'speaker_6': 'years. Italian city has long held the city of Long Beach in high esteem as one of the forefront cities in the country. When town Mayor Chang visited, he was very impressed with much of what he saw, and he believes that there is much more in common that we can share after working together with all the sister cities'",
        "'speaker_6': 'and meeting everybody else. I look forward to seeing much of the incredible things that we could accomplish together. Connecting cities to cities, cultures to cultures and people to people. I'm very excited to continue moving down this path and introducing Long Beach to Taiwan and talking to Long Beach.'",
        "'speaker_6': 'Thank you very.'",
        "'speaker_0': 'Much. Thank you. All right. That satisfies public comment. Let's go. Councilman Austin.'",
        "'speaker_7': 'Thank you. And appreciate the public speakers and the support of my colleagues on this item. I just would like to point out, I know the mayor isn't here this evening, but he was enthusiastically supportive of this item as well.'",
        "'speaker_7': 'I know that the Cities Association was working with the mayor's office and there may have been a little confusion in terms of how to draft this as a result. But he was fully supportive. Like I said, five years ago, the delegation came here, met with the mayor.'",
        "'speaker_7': 'I was privileged to be in that meeting and part of that and and host that delegation. And I think that this will be a fruitful relationship for many years to come. Look forward to our vote this evening. Thank you.'",
        "'speaker_0': 'Thank you. Let's cast our vote.'",
        "'speaker_1': 'And women's interests.'",
        "'speaker_2': 'I mean, women. Alan.'",
        "'speaker_1': 'I count. Women price.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman. Super.'",
        "'speaker_6': 'Now I.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Sarah, I. Councilmember Urunga. Hi. Councilman Austin.'",
        "'speaker_7': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson. Hi. Motion carries nine zero.'"
    ],
    "Approval of Consolidated Plan and Action Plan Amendments for HUD Grant Funds.": [
        "'speaker_0': 'Thank you. Congratulations. All right, so we'll move now to item 23. And I think this is the last item with the staff presentation. So this is the last longer one, folks. Let's hear item 23.'",
        "'speaker_1': 'Report from Development Services recommendation to approve the five year consolidated plan and Fiscal Year 2022 2023. First Action Plan and Prior Action Plan Amendments for the Community Development BLOCK Grant, the Home Investment Partnership Program and the Emergency Solutions Grant Program.'",
        "'speaker_1': 'Grant Funds City Wide.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Staff Report.'",
        "'speaker_10': 'Thank you, Vice Mayor, Members of the Council. We're excited to be here today to talk about our five year plan for CDBG funds that come out of the federal government. These are really transformational funds for some of our most impacted communities.'",
        "'speaker_10': 'And the team has been doing a lot of planning with the community about how best to invest those limited resources. So we do have a presentation tonight as we really look at how those funds are going to be focused.'",
        "'speaker_10': 'And I'd like to turn it over to our sports, he and his team to go through the presentation.'",
        "'speaker_3': 'Thank you, Mr. Rocha.'",
        "'speaker_0': 'Vice mayor and members of the City Council.'",
        "'speaker_6': 'Earlier this year, we conducted.'",
        "'speaker_3': 'A workshop with council to discuss and help us provide a framework.'",
        "'speaker_6': 'For the Consolidated.'",
        "'speaker_3': 'Plan. I want to say that Council, we heard you.'",
        "'speaker_6': 'We put your comments into action, including.'",
        "'speaker_3': 'An extensive.'",
        "'speaker_6': 'Public participation process to gather input that helped us prepare this plan.'",
        "'speaker_3': 'Tonight, we are here to provide you a presentation on the five year consolidation plan.'",
        "'speaker_6': 'As well as the annual action plan.'",
        "'speaker_3': 'So with that, I've got Nikki Haymaker, our community program specialist.'",
        "'speaker_6': 'Who will provide you a presentation.'",
        "'speaker_12': 'Thank you. The city's current consolidated plan will expire on September 30th, 2022. The new consolidated plan will take effect on October 1st, 2022, and will expire on September 30th, 2027. Once a five year consolidated plan is adopted, the city must submit an annual action plan for each of those five years.'",
        "'speaker_12': 'The annual action plans are guided by the Consolidated Plan and they identify annual goals, deliverables and funding for each fiscal year at the end of each fiscal year. A paper report, which is consolidated annual performance evaluation report, is also submitted to HUD and that summarizes our annual accomplishments.'",
        "'speaker_12': 'The Consolidated Plan is required in order to receive these three grants, the first of which is the CDBG program. This program can be used for both housing and non housing activities that improve lower income communities. The city anticipates receiving about 5.4 million each year under CDBG.'",
        "'speaker_12': 'The Home Investment Partnerships Program supports affordable housing production, and we anticipate receiving about 2.3 million under home and for ESG. This funding is specifically for programs that support individuals and families experiencing homelessness. Our health department administers this program and we anticipate receiving about 500,000 each year.'",
        "'speaker_12': 'There's a lot of information to cover in this presentation, but these are the big takeaways. The need for more housing, particularly affordable housing, is something that we heard a great deal of during our input process. So this plan cycle focuses on all things housing.'",
        "'speaker_12': 'So that includes new construction through funding for site acquisition, accessory dwelling, unit construction, homeless prevention and continued home spending. The plan builds on community input, HUD priority areas and other related efforts, such as the recently adopted housing element.'",
        "'speaker_12': 'We're also expanding programs and staffing to prevent homelessness through landlord tenant mediation, anti displacement regulations and other supportive programs. We also received input regarding increasing grant amounts for our existing rehabilitation and facade programs to increase the impact of those programs.'",
        "'speaker_12': 'This change will also reduce the overhead expenses to to administer those programs. Funding for our city parks will continue. However, there will be a shifted focus from programs to improving the physical facilities. Oh, I'm sorry. Lastly, the plan supports community grants and partnerships through capacity building for nonprofits, community land trusts and neighborhood associations.'",
        "'speaker_12': 'The first step in the development of the consolidated plan is to determine the different needs in the community within the areas of housing, community development and homelessness. These needs are determined through analyzing available data and gathering public input.'",
        "'speaker_12': 'The second step in this process is to identify any gaps in services and or determine current available resources to meet needs. And because the level of need tends to be greater than the limited resources that we receive through these grants, we then move on to the third step, which is to identify priorities or prioritize needs, rather.'",
        "'speaker_12': 'So we do this by considering the extent of needs, the impact toward our consolidated plan goals, availability of other funding, and eligibility for funding. Based on HUD's program parameters, HUD does have rules about what we can and cannot use the funding for, so we need to be mindful of that as well.'",
        "'speaker_12': 'Public participation is key to the development of the Consolidated Plan and the Annual Action Plans staff has been engaging the community to identify high priority needs in the areas of housing and community development. Due to COVID, much of our outreach efforts have taken place virtually.'",
        "'speaker_12': 'But we have employed some other methods to try and engage as many people as possible. We created a multilingual survey which was provided in English, Spanish and Tagalog, and all detailed the results of the survey in a later slide.'",
        "'speaker_12': 'The city also conducted a variety of outreach efforts, including promoting the Consolidated Plan, community meetings and the survey via the City of Long Beach and Development Services, social media. And just to give you a picture of the reach.'",
        "'speaker_12': 'The city of Long Beach social media has about 193 contacts and development services. Social media reaches just over about 10,000 contacts across all of the various social media platforms. We also placed advertisements and multilingual newspapers as well as sponsored posts via the Long Beach Post, English and Spanish social media accounts.'",
        "'speaker_12': 'We emailed all neighborhood associations and CDBG areas. We sent email blasts to community organizations and residents through the Neighborhood Resource Center and Link L.B.. We've promoted the plan in the Go Along Beach newsletter, which goes out to over 56,000 recipients.'",
        "'speaker_12': 'We issued a public notice to the city manager's office and we sent hardcopy mailers to 21,000 residents and businesses in CDBG eligible or recap census tracts. We also hosted for Neighborhood Association Focus Groups three virtual community meetings, two public hearings with the Long Beach Community Investment Company, and one virtual feedback session after the draft plan was published'",
        "'speaker_12': '. Interpretation services were provided at the community meetings, the public hearings, and the feedback sessions as well. Staff have also consulted with and held meetings with several city departments. The Long Beach Continuum of Care Board. And we hosted two study sessions, one with the LV CIC and one here with the City Council.'",
        "'speaker_12': 'So the next couple of slides detail some of the key findings as it relates to housing conditions and challenges in Long Beach. The majority of residents in Long Beach are renters and 52% of households are lower to moderate income.'",
        "'speaker_12': '12% of households are considered large. WATTS Which means that there are five or more members living in the home. 20% of households are headed by seniors. 7% of households are headed by single parents. And the vast majority of those single parent homes are have a female head of household.'",
        "'speaker_12': 'And 40% of those households have children living in poverty. 10% of Long Beach residents live with one or more disabilities, and there are 3296 persons considered to be homeless. The majority of housing stock, 83% was built before 1979.'",
        "'speaker_12': 'So the implication here is that many units currently require or will require upgrades and rehabilitation. Other key findings illustrate the challenge of housing affordability and overcrowding. 2089 Publicly assisted affordable units are considered at risk of converting to market rate housing.'",
        "'speaker_12': 'Home prices have increased significantly over the last five years by 22% between 2017 and 2020. And then from January 2020 to January 2022, it's increased another 24%. Additionally, the median rent at Long Beach is higher than what HUD considers a fair market rent for smaller units.'",
        "'speaker_12': 'So studio apartments, one bedrooms and only about 14% of rental units have three or more bedrooms, compared to 63% of owner occupied units. We also looked at housing problems among low to moderate income owners and renters. Housing problems, for our purposes include physical defects, overcrowding, cost burden and severe cost burden.'",
        "'speaker_12': 'So cost burden means that a household uses 30% or more of their gross income to pay for housing. And as you can see here, LMI, renters experience cost burden at a much higher rate than LMI owners at 47% compared to 19%.'",
        "'speaker_12': '27% of LMI renters experience severe cost burden, which is 50% or more of their gross income spent on housing compared to 11% of owners. And overcrowding, which is more than one person living per room, is experienced much more frequently by renters at 14%, compared to 3% of LMI owners.'",
        "'speaker_12': 'So now we're looking at the prevalence of severe housing problems among and how those disparities exist across race, ethnicity in general. Extremely low income households experienced severe housing problems more than any other income group in the city. However, when we look at these problems, when factoring in race and ethnicity, we can see that Pacific and Pacific Islander'",
        "'speaker_12': 'households, as well as Hispanic households, experienced the highest rate of severe housing problems at 100% and 84% respectively, which is quite a bit higher than the citywide average of 75%. This is also true for the very low income category.'",
        "'speaker_12': 'Pacific Islander and Hispanic households experienced the highest rate of severe housing problems at 81% and 58%, respectively. When looking at cost burden, American Indian Alaska Native households experienced the highest rates of cost burden at 33%. However, black households experienced the highest rates of severe housing cost burden at 28%.'",
        "'speaker_12': 'So in addition to assessing for housing needs, the Consolidated Plan also evaluates what we consider non housing needs. This includes needs for persons experiencing homelessness, non homeless, special needs, which may include needs for persons with disabilities or single parents, for example, and non housing community development needs, which includes things like infrastructure, neighborhood cleanups or economic development.'",
        "'speaker_12': 'As mentioned previously, this plan includes about $500,000 annually for homeless services through the Emergency Solutions Grant, which is not a lot. However, the city receives funding for homeless services through a variety of other sources, including the city, county, state and federal, which totals over 77 million.'",
        "'speaker_12': 'And so even though the Consolidated Plan contribution just makes up a fraction of these overall resources, the Consolidated Plan does play an important role in the Health Department's overall homeless response and strategy. The continuing production of affordable housing is critical to addressing housing stability and preventing homelessness.'",
        "'speaker_12': 'The city currently receives annual funding for affordable housing under home at approximately 4.3 million per year. But we are also a recipient of the permanent local housing allocation, which gives us about $3 million per year, as well as some other one time funds, such as the city's care home grant.'",
        "'speaker_12': 'So as we'll discuss in future slides, the current plan and the first year action plan really maximizes those home funds. And aligning and leveraging all of these other different housing resources help us maximize our impact. Over the last few years, 302 new affordable rental housing units were completed with financial support from the city and the LBC, AC'",
        "'speaker_12': '. Currently there are 323 affordable rental housing units under construction across four projects. The City and L.B. CIC provided about $14 million in funding, primarily through home. To support these projects, a total development cost for these four projects is over $180 million, which is to say that the city's $14 million investment leveraged 166 million and outside investment into'",
        "'speaker_12': 'these projects and into the city. The average city subsidy has been about 44,000 per unit, which is very low compared to past years as we asked developers to work hard to maximize other resources. The first of these four projects under construction is Anaheim Walnuts.'",
        "'speaker_12': 'This property will offer 87 affordable rental units for extremely low to low income families. Long Beach Senior Housing is a 67 unit rental property for extremely low to low income seniors. 26.2 apartments will provide 76 affordable homeless rental units for extremely low to low income households.'",
        "'speaker_12': 'And lastly, there's The Cove, which provides 89 affordable units for extremely low to low income homeless veterans. Another important tool to address housing needs is the housing element. The housing element is a required component of the city's general plan.'",
        "'speaker_12': 'It was updated this year and it shows how the city will meet housing demand over the next eight years. Our housing element goals are aligned with our Consolidated Plan goals, and some of the programs contained in the housing element will be addressed in the Consolidated Plan and with the funds that we receive.'",
        "'speaker_12': 'Housing element law requires that all California cities, towns and counties must plan for the housing needs of all residents, regardless of income. The California Department of Housing and Community Development determines the total number of new housing units that must be built.'",
        "'speaker_12': 'And this is called RINA, a regional housing needs allocation. Our local arena requirement is given to us by Skaggs, the Southern California Association of Governments. They look at several different factors in determining what our arena requirement will be.'",
        "'speaker_12': 'Some of those factors are household growth, future vacancy needs transit and job accessibility and household overcrowding. So as you can see here, the Long Beach Rina allocation is 26,502 units, and of which 57.9% of these units need to be for the extremely low, very low and low income households.'",
        "'speaker_12': 'These are our consolidated plan goals to assist in the creation and preservation of affordable housing for lower income and special needs households. To support activities to end homelessness. Support activities that assist with basic needs. Eliminate blight and or strengthen neighborhoods.'",
        "'speaker_12': 'Expand economic opportunities for low income households, and promote fair housing choice. When we develop a five year consolidated plan and the action plan activities, HUD regulations require us to focus on and address the listed priorities here. So housing needs, homeless needs, economic development needs, community facilities and infrastructure and community services needs.'",
        "'speaker_12': 'These are the steps that we take to develop the action plans. We start with HUD regulations and what is eligible. We gather meaningful public input. Input. We conduct an analysis of data which informs the needs assessment and helps us identify gaps in services.'",
        "'speaker_12': 'We also incorporate housing element goals to align our efforts. We consider resource constraints and we make geographical considerations in line with HUD requirements. So as we've discussed, one of the ways we've collected public input for this consolidated plan is through a multilingual community survey.'",
        "'speaker_12': 'This survey was posted online for a period of two months and was promoted and community meetings, workshops on social media and the various outreach efforts that I mentioned previously. The survey received a total of 586 responses. Respondents were asked to rank the relative importance of different programs and services, with one being the most important and seven being'",
        "'speaker_12': 'less important. So they ranked these items in three different categories community development, housing needs and economic development needs. So based on the survey results. Services for people experiencing homelessness was ranked as the most important community development need, followed by street improvements and neighborhood improvements and engagement.'",
        "'speaker_12': 'For housing needs. Housing for people experiencing homelessness was ranked highest, followed by rental housing for low income families and low income housing for older adults. And then finally, for economic development activities, respondents ranked job creation and retention programs as more important than small business assistance.'",
        "'speaker_12': 'Oh, sorry. I also want to mention the survey is just one of the ways that feedback is gathered. We also gathered input through community meetings and workshops, so we also recorded those public comments and weighed them as part of the overall needs assessment as well.'",
        "'speaker_12': 'And we received many public comments around the need for more affordable housing, increasing access to that affordable housing and services for people experiencing homelessness, which is in line with with the survey results that we received as well. I mentioned these structural changes at the beginning of the presentation.'",
        "'speaker_12': 'However, this slide just provides a little bit more detail about what those changes are in the new consolidated plan compared to the current consolidated plan. The proposed plan places an increased focus on new affordable housing construction through CDBG funded site acquisition, 80 new construction and continued home spending for affordable housing production.'",
        "'speaker_12': 'The plan expands programs and staffing to prevent homelessness through landlord tenant services. Support for the implementation of anti displacement regulations and complementary fair housing services. The plan also phases out the place based Neighborhood Improvement Strategy Program and modifies existing programs like the Home Improvement and Commercial Improvement Programs to increase increase grants of up to $25,000 to increase'",
        "'speaker_12': 'impact. Again, funding for parks will increase just with a shifted focus from programs to physical facilities. And the plan will also support grants and partnerships for capacity building for nonprofits, community land trusts and neighborhood associations. For the first action plan.'",
        "'speaker_12': 'Under the new consolidated plan, which is fiscal year 2023, we are proposing the following budgeted activities. Under Consolidated Plan Goal one Create and preserve affordable housing. We are focusing on affordable housing, production and site acquisition, anti tenant displacement services and housing rehabilitation under goal to support activities to end homelessness.'",
        "'speaker_12': 'We're focusing on preventing and responding to the needs of persons experiencing homelessness. I do want to point out that in fiscal year 23, the ESG activities shown here have since been revised. In FY 23, the focus will will be on rapid rehousing, $373,000 for that, and about $85,000 for street outreach.'",
        "'speaker_12': 'As we've all seen, the recently published homeless count has shown that the number of people experiencing homelessness has increased significantly over the last two years. So getting as many people into housing is the priority. We're also continuing the security deposit assistance program, though this time around it will be funded under CDBG rather than home.'",
        "'speaker_12': 'Under goal number three, eliminate blight and strengthen neighborhoods. A variety of community development activities are being supported, including graffiti removal and prevention funding for the Neighborhood Resource Center, capacity building for neighborhood leaders, grants to assist community organizations, community land trusts and business improvement districts.'",
        "'speaker_12': 'Park Facility Improvements. Code Enforcement and tree plantings. Under goal for the city will continue its technical business support program and undergo five. Fair housing services will be provided, which includes support for tenant landlord disputes, fair housing workshops to educate the public about protections and rights as well as some other services.'",
        "'speaker_12': 'The activities that we just covered do not constitute all of the activities that the five year plan will carry out. The programs listed here are currently funded under the 2018 to 2022 Consolidated Plan, and they will continue in the news cycle because these programs have existing funds already.'",
        "'speaker_12': 'They will not receive additional funding under the year one action plan, which is why they were not shown in those previous slides. However, these programs can receive funding in years two through five, depending on the need and the available funding.'",
        "'speaker_12': 'As mentioned before, local needs do exceed the funds that we have under this consolidated plan. However, there are some existing programs and resources that are working to address some of the needs identified in the plan process, which you can see here.'",
        "'speaker_12': 'So that includes some home ownership assistance programs, community land trust development, additional accessory dwelling unit programs and eviction prevention services. As required by HUD's recent directives. The Fiscal Year 23 action plan will not include any unspent REPROGRAMABLE funds from prior Action Plan years.'",
        "'speaker_12': 'Instead, these funds will be reallocated through the amendment process to different programs that are in line with the last consolidated plan, and they'll just continue to be accounted for and spent under their original fiscal year. So the table shown here details the reallocation of remaining FY 22, 21, 19 and 18 funds contained in the amendments.'",
        "'speaker_12': 'The proposed amendments are refocusing the majority of unspent funds to support housing acquisition. And with that, here is the staff recommendation for this item. The Consolidated Plan, an annual action plan must be submitted to HUD no later than August 15th, 2022, which is 45 days prior to the beginning of the new fiscal year.'",
        "'speaker_10': 'Thank you very much, Mayor Council. I know that was a long report, but you can see how much thought and how much investment has gone in with community input into the next five years of these really, really critical funds.'",
        "'speaker_10': 'So I want to thank the team and thank Nicky for a really comprehensive report and shows how much we're paying attention to the community needs and housing in particular, and we're available to answer questions.'",
        "'speaker_0': 'Thank you. I'll start off here and I'm happy to make the motion here. And you're right, it's it's important. Lots of community engagement went into this plan, and we only get one bite at the apple every five years.'",
        "'speaker_0': 'So it's important that we take our time and understand this program. In the district I represent, North Long Beach community is incredibly important. We it's one of the only flexible dollars that we have to address some real serious issues like economic development and improving facades.'",
        "'speaker_0': 'And we had a good conversation a few months ago, and I'm really proud to see a lot of the feedback from the council reflected in here. We talked about how the $2,000 grant program had an increase with inflation in many years.'",
        "'speaker_0': 'I'm really proud to see that it's now $25,000. That's enough to get a property on an open the door and, you know, sign the paper to let us spend some money to improve the facade. So so it's 25,000.'",
        "'speaker_0': 'Yeah. So that's, you know, that's a that's a that's a big deal. I also love that, you know, and based on our conversations, you know, when we first I mean, you know, last time we did a plan and the time before that we didn't have an economic development permit, we do now.'",
        "'speaker_0': 'And so this still allows you some flexibility to allow economic development. Whose you know. You know, I know they're short staffed today, you know, but but to allow that team to utilize things like this grant to go out and actually make things happen in the community, I also the last thing I'll say is it's very, very clear'",
        "'speaker_0': 'that you have an intentional focus on housing these five years. And I saw based on the surveys and all the feedback, that is the top issue. We have to use every tool that we have to advance affordable housing and so on, and to keep people in their homes.'",
        "'speaker_0': 'And so I particularly love the the the piece in there to help people stay in their homes. So that's incredibly important. So happy to make this motion and I move on to Councilman Sorrell.'",
        "'speaker_4': 'Thank you, Vice Mayor. Yes. I want to thank staff for a great work done with this report back, reflecting our priorities. But I also am interested in learning how I'm new to kind of this CDBG grant process in the way that the reports or surveys are done and the reports coming back.'",
        "'speaker_4': 'And I see that it's now changing the emphasis from place based neighborhood programing to the housing development. And so how does that look? Because before when it's place based, it's based on kind of the criteria used in the most need, right?'",
        "'speaker_4': 'So how are you? So using the same criteria or approach?'",
        "'speaker_6': 'Before we answer your question, I just want to just remind you that the place space will still will still be in process. We have two or three different project areas that we need to address, and I will be working with the corresponding districts to complete those efforts.'",
        "'speaker_6': 'It's under the separate the previous consolidated plan that that effort was unique. It was something that we discussed. So as far as projects to be able to identify brand and help neighborhoods in terms of improve its economic sustainability.'",
        "'speaker_6': 'Again, based upon the input we received at our public outreach efforts, we shifted our priority now to really focus on all things housing. So that's kind of what led to the phasing out of that of that program and into more housing opportunity areas.'",
        "'speaker_6': 'And to further answer your your question, COUNCILMEMBER So when we talk about a shift from, you know, sort of the place space program where those are infrastructure improvements, so sidewalk improvements, crosswalk improvements, landscaping, lighting and your district in, you're familiar with those.'",
        "'speaker_6': 'When we talk about housing production that comes in the form of a loan, it's a residual receipts loan, meaning the developer does not have to pay that loan unless there's extra revenues in a given year and then they make a payment on that loan.'",
        "'speaker_6': 'So we have two different pieces on the CDBG side. It's what's called a side acquisition loan. So it's to buy a piece of land to develop in the future an affordable housing project. So that may not end up being in the most the area of concentrated poverty.'",
        "'speaker_6': 'You've talked about on other items this evening and other occasions about, you know, housing being built around the city and not just in your district. So the emphasis has changed from the federal government over the last ten years and the emphasis is on high opportunity area.'",
        "'speaker_6': 'So we would do a solicitation of developers asking, you know, propose a project and we would look at a number of different factors the financial performance, the number of units, but also the location. And we would consider a location that might be over concentrated where there's a certain stretch of Long Beach Boulevard, which has a high concentration'",
        "'speaker_6': 'of affordable units. And those are great projects, but we're looking at doing projects elsewhere. So we would look at the location in that way, which is a different way of thinking about it than how we did the play space.'",
        "'speaker_6': 'But you're still serving people in poverty and very high levels of poverty and actually providing them certain options to experience different locations around the city. Does that answer your question?'",
        "'speaker_4': 'Yes, because that's really where I'm getting it is regardless of where the housing is built, I would just want to make sure it's serving. Those who it's supposed to address are people living in poverty or people who are in at risk of being homeless.'",
        "'speaker_4': 'So I just wanted to make sure that regardless of where is built, if it's not identified as these sites as being high poverty areas, that people would be able to who meet at least a criteria would be able to have access to those housing.'",
        "'speaker_6': 'And I'm going to let them give you the exact criteria for who we can assist and who we don't assist in general.'",
        "'speaker_7': 'Which is used mostly for affordable housing.'",
        "'speaker_10': 'In the first instance of the completion of affordable housing, we serve people that earn 60% area median income or below. And then when we also put together the contracts and the agreements together, for instance, out of 100 units, we have an option to make like 60, 70 of those units to be to go for very low income'",
        "'speaker_10': 'or basically hard money, whether it's home or some of it. You can only assist in housing production, land acquisition, people that are on 80% or less in the area, median income. Thank you. The other point I want to mention here is we have several other strategy funded activities.'",
        "'speaker_10': 'Those activities are still remain for us in low income eligible areas.'",
        "'speaker_4': 'Great. Thank you so much. One thing I'll add is to say appreciate seeing more money being added to enhancing our neighborhood leadership program is so vital because some of the reason why many of the neighborhoods are needing support is because it does also need leadership in the area.'",
        "'speaker_4': 'So I hope to see more. I know that it's set there, but I hope they can be increase a little bit more because I think that's really what helps maintain whatever gets built in those the neighborhoods. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'Thank you. I just wanted to ask.'",
        "'speaker_2': 'A question of clarification about the presentation.'",
        "'speaker_5': 'It talked about.'",
        "'speaker_2': 'Homes with more than one adult. And I think that I just wanted to clarify. I know that people are watching at home and we want to be accurate and I could be wrong. I think that it's more than one adult that are not siblings or more than one adult that are not married to one another or cohabitating'",
        "'speaker_2': '. I think that those would be exceptions. If they're not exceptions, I'd like to know about that.'",
        "'speaker_5': 'It's now.'",
        "'speaker_6': 'Yeah, I'm trying to find the exact slide, but we look at overcrowding in a couple of different ways. So one would be what you just mentioned, adults that do not have a, you know, relationship through marriage or sibling or parent child.'",
        "'speaker_6': 'And we also look at just the sheer number of persons per room. So there's two different ways to look at it. And I think both are actually alluded to in the presentation.'",
        "'speaker_2': 'Yeah, I just know that we're a family or a city of family values and we appreciate to parent families just as much as one parent families than if there are two parent families. That's a reasonable way to live.'",
        "'speaker_2': 'And so when you count those numbers, we don't wanna be penalized for the number of families that we have in our city when the statistics are aggregated. And then my mom comes from a family, and I come from a family where my brother and I shared a room and my mother shared a room with her three sisters'",
        "'speaker_2': '. And I think that that's a my girls share a room, even though I could separate them. I think that there's a lot of value in that and we want to make sure to have accurate statistics on a true need.'",
        "'speaker_2': 'Thank you. Thanks and great work on this presentation. It's been a long time coming and I know a lot of work going into it. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Price.'",
        "'speaker_4': 'Thank you. I just want to take a moment to acknowledge the staff for that amazing presentation. It was really thorough. I know these are topics that we've talked about quite a bit, certainly over the last eight years. But just recently we had the opportunity in April to touch on some of these topics, and the presentation tonight was'",
        "'speaker_4': 'fantastic. So I want to thank staff for everything that you're doing and also for the work that you do offline, not in a council meeting to educate all of us and teach us how we can be part of the solution in terms of working with housing providers and not only just helping shape policy, but also helping implement'",
        "'speaker_4': 'some of the policies that you bring to us for recommendation. So really grateful and appreciate the presentation. Thank you.'",
        "'speaker_0': 'Fantastic. Thank you. Public comment on this item.'",
        "'speaker_1': 'If there are any members of the public that would like to speak on item 23 in person, please line up at the podium in Zoom. Please use the race hand feature or dial star nine now.'",
        "'speaker_6': 'In present day Sinai campus. Sixth District Resident Councilwoman Mongeau. Page 26. I've read it multiple times, so you know you. I would let you know when we get this home acquisition program in and in movement. I would love to volunteer all my free time that I already spend reading your guys's white papers and reports.'",
        "'speaker_6': 'Amazing. Uh, uh, presentation. Uh, Miss Nikki. Uh, it's. It's amazing when the data supports, when you spent years of your life talking about, you know, we were losing our working class, uh, framework and, uh, it's great to see finally some teeth behind the methods used.'",
        "'speaker_6': 'To facilitate preserving that population, it's imperative for the future for the future of our school district, because our schools are going to be closing in next seven years because there's not enough children attending them. And honestly, just for the continuity of our communities and neighborhoods, I think I agree with Dr. Sorrell with respect to the concentration.'",
        "'speaker_6': 'HUD has the scattered method that they use now, but the concentration is of affordable housing projects in the 66 district neighborhood is always something to bring up. I think one topic, a solution that I like that was referenced was the, uh, the storefront facade thing, the $25,000 would help.'",
        "'speaker_6': 'The problem is that some people want to maintain blight. About a year or two ago, Councilman Austin tried to bring up a bill or relation to the vacancy tax because there's corridors like the Civic Avenue where people willingly choose to leave their storefronts empty, blighted, because they're waiting for the next economic kick to, you know, over sell'",
        "'speaker_6': 'their, you know, antiquated property for. That's something that we as a city need to impact and either force them to either drop the land so we can do something with it, like house these people or move on from it.'",
        "'speaker_6': 'The second thing would be that because although we do financing as a sneaky reference, we take county financing. When we do that, they one of the stipulations is that we have to take a list housing lists. So even though we are, to Mr. Hogg's point, providing opportunities of housing, it's not Long Beach people that get put in'",
        "'speaker_6': 'those buildings. And that's a problem. We cannot continue to allow, you know, projects to come onto our land and be built here, but don't facilitate eliminating those 3296 people. So great presentation, great opportunity for the public to see data and hopefully we can do something with this.'",
        "'speaker_6': 'Thank you. Well, finally, one thing is that L.A. Metro just announced that they're going to be facilitating land banking around all the transit hubs and transit zones. Maybe this is an opportunity to engage as a city with the county to facilitate some type of development.'",
        "'speaker_6': 'And I know lobbies Boulevard all the way up to Norfolk.'",
        "'speaker_1': 'Mr. Can Vega, Time's up.'",
        "'speaker_6': 'Has a lot of car dealerships that need to go. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'My name is Clarissa Cooper, and I came about a disturbance of the very and the city of Long Beach, a sanitation department. I have a picture here on my phone was so disturbing. And I don't I just like to show it to one individual or whatever to get something done.'",
        "'speaker_3': 'And there's another problem in the city of Newark, Long Beach beginning, maybe Cher Park and going forward, going north there, there's a bad rodent problem. And there are there are just many things that, you know, just really, you know, this is really getting really foul as far as like, well, the rats are really starting to come all'",
        "'speaker_3': 'around the apartment building and some people like four and 3:00 in the morning, they will take, you know, like their rubbish and throw it in the big vendors and I alley because it's you know so many apartments right around there and I was just to do anything they can be done about that because the raccoons are really'",
        "'speaker_3': 'the motion and I don't know whether in a Daytime Cher Park or not, but you know, it's really getting bad and they really need some type of situation to, you know, have it sprayed or, you know, it's really out of hand.'",
        "'speaker_3': 'They're going all the way from from from from right there along Beach Boulevard over to Atlantic. All the way down del Amo, up all the way to maybe South Street. And you know, if you ever be out in the evening by people that, you know, work at night and are coming home, this is this really is getting'",
        "'speaker_3': 'scary. And I've been here Long Beach for 50 some years, and I've never I've never witnessed this situation. And I was just wondering, cause I had a lot of fine people in my family that worked for the sanitation department that have gone on.'",
        "'speaker_3': 'And I just worried, you know, if they could do anything, it would be deeply appreciate it. I would really, you know, really. You know, thank God for that. Thank you. So if I could show someone this picture, if I may.'",
        "'speaker_0': 'Maybe Mr. Murdoch is cued up. He'll help make sure someone can.'",
        "'speaker_3': 'Speak with his shoulder.'",
        "'speaker_10': 'Yes, absolutely. Aubrey, if I can ask you to come to talk to this lady and get all her information, and we can certainly work on this problem. So thank you for bringing that to our attention.'",
        "'speaker_0': 'Thank you so much. I think that concludes public comment here. Members, please cast your vote.'",
        "'speaker_1': 'Councilman's in Dallas.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman Allen. Councilwoman Pryce.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman. Super. Now.'",
        "'speaker_6': 'I.'",
        "'speaker_1': 'Councilman Mongo.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilmember, your anger.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson. My motion is carried nicer.'",
        "'speaker_0': 'Thank you. Good news. We have some results for those who have been waiting on the permit results. So, Madam Clerk, I'll hand it back over to you. Let's pull the let's pull the midtown up first.'",
        "'speaker_1': 'So regarding results of assessment ballots cast for the Midtown Business Improvement District, the total assessment ballot distributed was 61 total valid ballots counted were 22, and the percentage of assessment in favor was 58.89%. There is not a majority protest.'",
        "'speaker_0': 'Though. That's good.'",
        "'speaker_1': 'News. This is good news. This passes.'",
        "'speaker_0': 'Congratulations and we need to take a vote on this one before we move to the next one, correct? Correct. And we pull the item up on the system.'"
    ],
    "Renewal of the Midtown Business Improvement District.": [
        "'speaker_1': 'And this is item 17. I joined 23 International.'",
        "'speaker_0': 'Okay. It's moved. Seconded. Do we need to public comment again on this? No. No. Okay. Councilman. Sorry. Your comments.'",
        "'speaker_4': 'Yeah. I just want to thank, you know, Eric Romero, who was formerly with the Economic Development Department for all his hard work, as well as our Midtown People board members, as well as all the business owners for voting and making sure that to renew the midtown bid, it's a long time coming.'",
        "'speaker_4': 'It's been a bit of a two year process, but we're here and I just want to congratulate them all for the hard work and that it's just going to make sure that we continue on to this road to recovery in the aftermath of the pandemic.'",
        "'speaker_4': 'And I'm just so excited for us to build on the vision that Midtown that has to making it better and safer and stronger and most of all supporting our businesses and our neighborhood in the area. So thank you very much.'",
        "'speaker_4': 'Congratulations, everyone.'",
        "'speaker_0': 'All right. And I'll just add my congratulations to the Midtown PBA Board. You know, with what you know, like the councilwoman said, as we move forward to the recovery, there's lots of investment to be made. And that's an incredible partner, incredibly important partner to make sure that midtown continues to head in the right direction.'",
        "'speaker_0': 'And so congratulations to all of you. Let's go ahead and cast our vote on 17.'",
        "'speaker_1': 'Councilman's in the house.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman Allen, I. Councilman Price. Councilman. Super now.'",
        "'speaker_6': 'I.'",
        "'speaker_1': 'Councilwoman mongo.'",
        "'speaker_2': 'I.'"
    ],
    "Public Hearing and Ballot Tabulation for the Downtown Property and Business Improvement District Renewal.": [
        "'speaker_1': 'Councilwoman Sara, i. Councilmember, your conga line. Councilman Austin. Hi. Vice Premier Richardson. Motion carries nine zero.'",
        "'speaker_0': 'Thank you. Now, let's now go to 16 and we have another recusal.'",
        "'speaker_5': 'Yes, let's move to recuse myself. Cause I am property and the people.'",
        "'speaker_0': 'Thank you. All right, let's proceed.'",
        "'speaker_1': 'Regarding the results of the assessment ballots cast for the downtown Long Beach property based Business Improvement District, total assessment ballots distributed were 3245. Total valid ballots counted were 877. The percentage of assessment in favor was 78.83%. There is not a majority protest, so it passes.'",
        "'speaker_0': 'All right. Congratulations to the downtown Long Beach Alliance. We're going to recognize Councilwoman Sun House as the maker of this motion. And Councilwoman Sara was the second councilwoman and they asked your comments.'",
        "'speaker_2': 'Thank you very much, Vice Mayor. I just want to congratulate the LBA and very happy for their renewal. I think that this is a fitting time for us moving forward. There's so much that the LPA has done, especially during this pandemic, in uplifting not only our residents in the area, but our businesses as well.'",
        "'speaker_2': 'And I just want to say how excited I am to continue that work with you and continue this partnership that we have developed. And I'm just really excited to see what the next ten years are going to bring to our downtown.'",
        "'speaker_2': 'And I'm just looking forward to it. And congratulations. Thank you to all that worked on this so, so very hard for the last two years. And thank you to city staff. And I'm just really, really excited to see what comes next.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Ciro.'",
        "'speaker_4': 'Part the emotion and congratulation everyone.'",
        "'speaker_0': 'At my comments here. Congratulations. This is ten years and I love the adjustments to the assessment, the focus on homelessness downtown and more outreach. These are certainly things that people care about. And again, the album is going to be an incredibly important partner moving forward.'",
        "'speaker_0': 'So congratulations to you. Members, please cast your vote or let's do the roll call vote.'",
        "'speaker_1': 'Councilman's in the house.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilman Allen. Councilwoman Price.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman. Super now. All right. Councilwoman Mongo.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilwoman. Sara. Hi. Councilmember Ranga. Hi, Councilman Austin. Hi, Vice Mayor Richardson. Hi. Motion carries eight zero.'",
        "'speaker_0': 'Thank you. Item 23, please. Congratulations.'"
    ],
    "Contract Award to Courtesy Chevrolet Center for Vehicle Purchase. ": [
        "'speaker_1': 'We've done item 23. Next item is 2024. Report Report and Financial Management Recommendation Award a contract to courtesy Chevrolet Center of San Diego, California, for the purchase of various Chevrolet sedans, utility vehicles and trucks, and a total annual amount not to exceed 1,500,000 citywide.'",
        "'speaker_0': 'Thank you. A motion is our second. It's been moved in second. Then he called comment on this item.'",
        "'speaker_1': 'If there are any members of the public, they would like to speak on item 24 and person. Please line up at the podium in Zoom.'",
        "'speaker_5': 'Please use the raise hand feature or.'",
        "'speaker_1': 'The start line now. See. Now, that concludes public comment.'",
        "'speaker_0': 'Thank you. Let's go ahead and ballot.'",
        "'speaker_1': 'Councilwoman Zendejas.'",
        "'speaker_13': 'All right.'",
        "'speaker_1': 'Councilman Allen. Councilman Price.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Supergirl, I. Councilman Mongo.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilwoman Sara, I. Councilmember Urunga.'",
        "'speaker_6': 'I.'",
        "'speaker_1': 'Councilman Austin. Hi. Vice Mayor Richardson. All right. Motion carries eight zero 25.'"
    ],
    "Ordinance to Amend Long Beach Municipal Code on Marine and Ocean Areas.": [
        "'speaker_1': 'Vice Mayor Richardson. Hi. Motion carries nine zero.'",
        "'speaker_0': 'Thank you. 27, please.'",
        "'speaker_1': 'Report from City Attorney. Recommendation to declare ordinance amending the Long Beach Municipal Code relating to marine areas and Pacific Ocean areas. Read the first time and later for the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_0': 'Thank you. Has been moved and seconded. Any public comment here at there?'",
        "'speaker_1': 'Any members of the public they would like to speak on item 27 in person please. And up at the podium in.'",
        "'speaker_5': 'Zoom, please use the raise hand.'",
        "'speaker_1': 'Feature or dial star nine. See. Now, that concludes public comment.'",
        "'speaker_0': 'Fantastic. Members, please cast your vote.'",
        "'speaker_1': 'Councilman Zendejas.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilman Allen.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Councilman Price, I. Councilman. Supervisor.'",
        "'speaker_6': 'All.'",
        "'speaker_1': 'Councilwoman. Mango. I. Councilwoman Sara, I. Councilmember Urunga.'",
        "'speaker_9': 'Hi.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_7': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Motion is carried. Nine zero.'",
        "'speaker_0': 'All right. Fantastic. That satisfies the agenda.'"
    ],
    "Contracts for Various Infrastructure Repairs and Improvements under Job Order Contracting Method.": [
        "'speaker_1': 'We have item 26.'",
        "'speaker_13': 'Oh.'",
        "'speaker_0': '26.'",
        "'speaker_1': 'Okay, Mr. one.'",
        "'speaker_0': 'No, we did 26. The infrastructure. Okay. Well, let's do 26.'",
        "'speaker_1': 'Report from Public Works Recommendation to adopt specification. Ah, dash 7193 and authorize city manager to execute all documents to enter into multiple contracts for various infrastructure repairs and improvements and a total aggregate amount, annual amount, not to exceed 40 million for a period of one year, with the option to renew for two additional one year periods at'",
        "'speaker_1': 'the discretion of the city manager citywide.'",
        "'speaker_0': 'Or any public company here.'",
        "'speaker_1': 'If there are any members of the public that like to speak on item 26 in person, please line up at the podium in Zoom. Please use the raise hand feature or dial start start nine. See. Now, that concludes public comment.'",
        "'speaker_0': 'All right, members, please cast your vote.'",
        "'speaker_1': 'Cattleman's in the house. All right, Councilwoman Allen, I. Councilwoman Price.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Zuber, now i. Councilwoman Mongo I. Councilwoman Sarah I. Councilmember Urunga, I. Councilman Austin.'",
        "'speaker_7': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'All right. Thank you. That satisfies the agenda now. So we have our second general public comment. Before we go to closing remarks and adjournment. Madam Clerk, you want to just make sure you give the rules on public comment and if there's any final public comment.'",
        "'speaker_1': 'So if you'd like to speak during second public comment, please line up at the podium. You'll be given 3 minutes for your second public comment period.'",
        "'speaker_0': 'Thank you. Now we turn. Thank you. Come on forward. You recognize?'"
    ]
}