{
    "City Council Standing Committees Update.": [
        "'speaker_0': 'Thank you. And let's read item number two, please.'",
        "'speaker_1': 'Communication from Mayor Garcia recommendation to approve a new list of City Council standing committees and requests city attorney to draft a resolution reflecting the changes.'",
        "'speaker_0': 'Thank you. I just want to first thank the city manager's office and the city attorney's office for their help in putting this item together. We have been talking as a as a body in the past that at different meetings and council meetings about just the need to kind of clean up our our council committees.'",
        "'speaker_0': 'And so what this document in front of you essentially does is it really just consolidates some of the committees that we already have. It moves around some of the the committee names and really kind of focuses on nine major committees.'",
        "'speaker_0': 'That will be our standing committees moving forward as well as, of course, does some consolidation work around these? And so briefly, I know you have an extensive memo in front of you, but I just want to just kind of briefly go over what will be the new nine standing committees of the city council.'",
        "'speaker_0': 'And you'll notice, of course, some things have been combined as a part of this. In addition, I just want to add that one of the things that we'd like to see moving forward, I think some council members have even discussed this is we really want to empower our new committees to really take on issues and really become'",
        "'speaker_0': 'experts in those areas. We oftentimes items and agenda items come up before the council, oftentimes with little time to do a really strong analysis by the body. And so this gives us an opportunity to really hopefully get items to these committees, have them do some analysis, have the public an opportunity to really delve into community participation and'",
        "'speaker_0': 'then come back to our council with recommendations. Well, while at this time there is no proposed changes or council rules as far as how committees work or might work. We I know I know some have discussed this. We can look at that certainly in the weeks ahead.'",
        "'speaker_0': 'But for now, I just want to go over those committees. So we have of course, we retained the Budget Oversight Committee, which, as we all know, explores our public policy positions as it relates to the budget and is an important committee every single year.'",
        "'speaker_0': 'The second committee is a new Port Transportation and Infrastructure Committee that, of course, combines some of our of our efforts around Tidelands, but also around the CHP, major street and road improvements and all of the infrastructure around the port.'",
        "'speaker_0': 'So this becomes a real critical committee on port, on the harbor and all the transportation across the city, including infrastructure. When we're talking about the next phase of measuring street investments and all the great work, I think this is going to be a really critical committee for us in the years ahead.'",
        "'speaker_0': 'The next committee is Economic Development and Finance. This committee, of course, will continue to do some of the work it's been doing around around financing and around possible bonds and revenues. But also, most importantly, the broad work of economic development, particularly as we look at economic recovery.'",
        "'speaker_0': 'So that is going to be that new committee. Then, of course, we have two committees that really aren't changing much. Those are going to be the federal legislation and state legislation committee. Those are those stay in place. Again, public safety committee also just stays in place.'",
        "'speaker_0': 'Then we have our new Climate Action and Environmental Committee, which is a little bit of an expansion of our former environmental committee. And again, that's a critical issue, particularly as we have the cap in front of us and then we have a new public health and housing committee.'",
        "'speaker_0': 'I think we all know that public health is the challenge of our time. We didn't have a committee specifically focused on that. And this combines public health and housing, which really are linked into a new committee to look at our our housing and homelessness crisis that that exists.'",
        "'speaker_0': 'And finally, we have combined different pieces of different committees into the new government personnel and Elections Oversight Committee. This committee takes pieces of the former personnel and Civil Service Commission. It takes pieces of the Elections Oversight Committee. And it takes even pieces of the Economic Development Finance Committee as it relates to smaller litigation, settlements and charter committee'",
        "'speaker_0': 'appointments into one new committee that really looks internally at the way our government functions. So those are the new committees. All the other kind of, you know, different smaller authorities or committees still exist, of course. But I wanted to go ahead and put these forward for all of you and and get these adopted.'",
        "'speaker_0': 'I think it's an exciting time for us to rethink our our committees. So with that, let me first get a motion and a second. We do have the cue system now working. So. Let me check really quick. If I can get a motion and a second, please.'",
        "'speaker_1': 'So moved.'",
        "'speaker_0': 'I have a motion by Councilwoman Price and a second by Councilwoman Zendejas. Is there any public comment?'",
        "'speaker_1': 'There is no public comment on this item.'",
        "'speaker_0': 'Okay. Councilwoman Price, any comments?'",
        "'speaker_1': 'No comment, Mr. Mayor, I support the item.'",
        "'speaker_0': 'Councilman's and has any comments.'",
        "'speaker_1': 'No comments. Thank you, Mr. Mayor, for.'",
        "'speaker_0': 'And Councilman Richardson.'",
        "'speaker_2': 'I certainly support this. I'd love to take a deeper dove on the Environmental Committee conversation. I know that when it relates to infrastructure and tidelands, all that there there's sometimes two conversations. It's you know, it's an infrastructure conversation.'",
        "'speaker_2': 'Then it's your policy around oil and climate and all that. And I want to I want to make sure that, you know, it's clear that the Climate Action Committee can think about oil and policy around oil and those things, which a lot of times will be connected to.'",
        "'speaker_2': 'Traditionally, they're connected to pipelines and things like that. So, you know, moving forward, I mean, I think some of someone's results tonight, but I'm really certainly interested in how that how that all will work together from a policy standpoint that really anticipate what the next couple of years.'",
        "'speaker_2': 'A lot of focus on air quality operations and oil policy are going to confront that are. But I support I support this motion I think is the right.'",
        "'speaker_0': 'Is there any problem? And you said there's no public comment, Madam Clerk.'",
        "'speaker_1': 'Not on this item.'",
        "'speaker_2': 'Okay. Real call, but please.'",
        "'speaker_1': 'District one. My District two, i district three. I district for.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District five. District six. High District seven. District eight. High District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Chris.'"
    ],
    "CARES Act CDBG CV-3 Allocation, Programs and Budget Approval.": [
        "'speaker_0': 'Thank you. And now I'm going to turn this over to Vice Mayor Richardson. I'm going to go and get ready for the state of the city. So I will see you all later tonight. And Vice Mayor Richardson, if you want to do just the few items that are left with a lot.'",
        "'speaker_2': 'Thanks a lot. Go ahead. The number three, please.'",
        "'speaker_1': 'Report from Development Services recommendation to approve proposed programs and budget for the third round of emergency grant funds from the CARES Act and Community Development BLOCK Grant. Coronavirus Allocation Citywide.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. This is town America. So we have an exciting presentation for you tonight. It won't be long, but we do want to go over the recommendations for the third round of CDBG funding. A lot of these items are things that council has given direction to us over the past year that when additional funding'",
        "'speaker_4': 'became available, could we fund these things? So we're happy to fulfill that commitment. We also do have one change on the floor that we would like you to consider, and we'll talk about that when we get to that item a little bit different than the staff report, given some new information.'",
        "'speaker_4': 'So I will turn it over to Oscar and Patrick to go through the report.'",
        "'speaker_0': 'Thank you, Tom. Mayor, members of the city council, we are pleased to provide you this proposal for programs for the third round of CDBG COVID three allocation. Patrick here is here to give you a brief presentation of.'",
        "'speaker_5': 'Thank you, Oscar. Vice Mayor and Council. The Federal Cares Act includes three rounds of Cares Act CDBG funds. Under CB1, the city received $3.6 million. The funds were used to provide emergency rental assistance to lower income households through our Long Beach Cares Rental Assistance Program.'",
        "'speaker_5': 'CV two was allocated to states and the city did not receive any funding. HUD has released a CV three and the city was awarded $4.5 million in funding. Sorry about that. The primary purpose of CDBG Cares Act funds is to prevent, prepare for and respond to COVID 19.'",
        "'speaker_5': 'Staff is recommending several programs or activities to be implemented with CB three funds. Based on previous direction from the Council, as Tom mentioned, as required by how these programs were posted on the city's website for public comment and no comments were received.'",
        "'speaker_5': 'Activity. One allocates $1,392,600 for the acquisition of the Best Western Hotel, located at 1725 Long Beach Boulevard. The state's project Homekey program provided most of the funding for this acquisition, and it will provide interim housing for people experiencing homelessness.'",
        "'speaker_5': 'Now, this is where the changes that Tom mentioned under activity two, we were going to propose to provide additional rental assistance for residents experiencing impacts from COVID 19. But we recently found out that. Congress adopted after Congress adopted the second COVID relief bill.'",
        "'speaker_5': 'It included $25 billion for emergency rental assistance, and the city will likely get about $15 million of those funds for rental assistance. Given that large allocation of funding, staff would like to revise its recommendation to eliminate Activity two and move this 645,000 to Activity three commercial rental assistance.'",
        "'speaker_5': 'If that's acceptable to the council, we ask that you include that in any motion that's made tonight. So for activity three, we're allocating it. Allocate $1,000,000 for a new commercial rental assistance program or 1 million 645 638 if the council accepts staff's amendment.'",
        "'speaker_5': 'The program provides up to $4,000 in rental assistance for businesses located in city egg eligible areas that have been forced to close due to the health order. We will. If approved, the Department will be partnering with the National Development Council who will be responsible for accepting electronic applications and will confirm applicant eligibility for the program.'",
        "'speaker_5': 'Activity four allocates 550,000 for an artist assistance program. The department will partner with the Long Beach Arts Council to provide $3,000 grants to lower income artists impacted by COVID 19. The Arts Council will receive about $100,000 to implement the program, and 450,000 will be provided for grants to 150 qualified artists.'",
        "'speaker_5': 'Activity five allocates 40,000 to provide additional funding to the Fair Housing Foundation to handle an increased volume of residents needing assistance with rent repayment, with rent payment and eviction issues. Activity. Six allocates 40,000 to advertise and promote right to counsel services provided through the Stay Housed L.A. County program, which provides free legal assistance and virtual education to'",
        "'speaker_5': 'households facing eviction. And the the city council approved $250,000 that will be provided to help fund that L.A. County program previously. Activity seven allocates funding for administrative costs. At the beginning of my presentation, I mentioned that the city had received a cv1 allocation of $3.6 million for the Cares L.B. Cares Rental Assistance Program.'",
        "'speaker_5': 'Instead of setting aside the full 20% administrative budget of 723,000 for that program, staff only set aside 600,000. That was a mistake, as we have already spent nearly $800,000 to administer the program. It's critical that we set aside the full 20% for this CB three grant in order to cover our administrative expenses and backfill what we spent'",
        "'speaker_5': 'on CB one. The programs are very labor intensive and they work beyond completion. That concludes my presentation. Thank you.'",
        "'speaker_2': 'Thank you. So thank you for the presentation. I certainly won't receive funding. I want to. I don't have the cue system, so I'm going to take voice cues. Their emotions will approve. Look on.'",
        "'speaker_1': 'This. The sun has a motion to a approve with the recommendation of Sky.'",
        "'speaker_2': 'Okay, so I hear the motion is there are second.'",
        "'speaker_1': 'Row, second, second.'",
        "'speaker_2': 'Okay. I heard I heard sorrow first. And just because everybody I know other people chimed in, I just couldn't hear who what. So I heard the they I heard sorrow as anybody want to speak that emotion or we got to go.'",
        "'speaker_1': 'I, I do want to, um, uh, I do want to just ask a question if that's okay. This is counselor.'",
        "'speaker_2': 'Okay. You recognized before? Yes.'",
        "'speaker_1': 'I just, um, you know, I appreciate the additional funding that's come through to make the modification for residential housing. I just want to make sure that, you know, when it does get distributed, that it does. I just want to make sure it's distributed throughout these designated CDBG areas throughout the city.'",
        "'speaker_1': 'So I just want to make sure they're not clustered in specific areas and that we're just conscious of moving it around. Is there a way to to to see that that that's being done or proposed to being done?'",
        "'speaker_4': 'So, Councilmember, this is Tom. Are you talking about the commercial assistance or the additional rental assistance that would come in the future.'",
        "'speaker_1': 'For both of them, just for commercial and for housing assistance?'",
        "'speaker_4': 'Okay. Um, so I can talk a little bit to that. So we have had some good success with the Tenant Assistance Program. We have a map that we shared with council. It is income qualified, but it really was spread throughout the community.'",
        "'speaker_4': 'We certainly saw areas of need that had slightly higher concentrations, but we did not have it all completely concentrated in one area. We have we expect the same thing for the commercial. Those have to be located in CDBG areas.'",
        "'speaker_4': 'So those can't be in anywhere. That's not CDBG designated, but roughly half of our city is designated. We can work with the staff and the and HUD to see if there's a way we can do similar to our equity criteria to make sure that we don't have all over concentrations in certain areas.'",
        "'speaker_4': 'That said, when we bring back the rental assistance program, you know, we're just learning about that. We're just getting the dollars. We don't even have a final amount yet. We will bring you back a program. Given that amount of resources, we'd like to look at some models where we look at the entire city, but also perhaps look'",
        "'speaker_4': 'at some focused areas where we're seeing some real challenges. So we would bring that back to the council for you to give some input on.'",
        "'speaker_1': 'Great. Thank you so much.'",
        "'speaker_2': 'All right. Thank you. Any other further counsel to the company? All right. So let's is there any public comment on this item?'",
        "'speaker_1': 'There is no public comment on this item.'",
        "'speaker_2': 'Thank you. Let's have the roll call.'",
        "'speaker_1': 'District one. Archive District two II District three. High District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'Councilmember Mongeau can't unmute, but she texts that she's an AI. She's texting this quote.'",
        "'speaker_1': 'District six i. District seven.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'II.'",
        "'speaker_1': 'District nine.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. Let's let's here we have, I think, three speakers cued up for public comment. Let's hear them now.'"
    ],
    "Ordinance on Unpermitted Dwelling Unit Amnesty Program.": [
        "'speaker_4': 'Thank you. That concludes public comment for Denise me.'",
        "'speaker_2': 'Thank you so much. Now we're on to item four. Audience.'",
        "'speaker_1': 'Item for a report from Development Services recommendation to declare ordinance amending the Long Beach Municipal Code relating to an UNpermitted Dwelling Unit Amnesty Program read and adopted as read citywide. Motion face sun has.'",
        "'speaker_2': 'Motion and they have their second. Second Richardson. Okay. Sorry. The second is very public comment on the site. Yes, we have Tiffany Davey. Thank you. Hi. Good afternoon. Animal Vice Mayor and City Council Chairman Davie, District four resident.'",
        "'speaker_2': 'I am in support of this ordinance as it proposes an adequate and timely policy solution to a myriad of issues in an effort to not.'",
        "'speaker_1': 'Only meet.'",
        "'speaker_2': 'State origin requirements, but also city goals and plans such as the Have Home Recommendation and the Mayor's Affordable Workforce Housing Study Group. As a creation of Chapter 21.66 of the Long Beach Municipal Code seeks to bring to code these units already occupied.'",
        "'speaker_2': 'That does a great disservice to previously mentioned state and city goal by expanding the breadth of the housing qualified to be formally legalized in the voting code, which previously only applied to units created prior to 1964. As far as procedural mechanisms of implementation pass application submission, I find it to be great benefit for all seeking such amnesty'",
        "'speaker_2': ', which, by building health and safety standards goes further to include their tenants as well. The affordability covenant that is outlined is a service to not only meeting those same goals, but also ensuring a just and equitable recovery from this ongoing crisis, which the city also address the conjunction of multiple crises such as the COVID 19 crisis.'",
        "'speaker_2': 'Housing crisis and racism as a public health crisis which are occurring at the same time, and for which policies such as this ultimately seeks to benefit all residents of the city. This element is also critical in Future City plans as it pertains to emergency preparedness, mitigation, response and recovery.'",
        "'speaker_2': 'In closing, I believe support of this item is timely to address directly those factors that align with a true just and equitable recovery from these terrible crises. Having served as a field representative for the United States Census Bureau for the 2020 decennial count, I can attest that this ordinance would do more than simply remove from visibility, but'",
        "'speaker_2': 'allow our city to enact policy, which would aid Census Bureau efforts in the future to achieve an accurate count and thus ensure we, city and residents alike, have the adequate federal support needed in disasters such as this one.'",
        "'speaker_2': 'We're still gathering and those to come. Thank you. Have a good evening. Thank you.'",
        "'speaker_1': 'District one. I'm District two, district three, I District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five. District six. Can you hear me? Yes. Received. Thank you. District six by district seven. By District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'District nine. All right. Motion carries.'",
        "'speaker_2': 'Well, that satisfies our agenda. Is there any new business from the city council announcements?'"
    ]
}