{
    "Destruction of Records for the Legislative Department and Council Districts 2, 4 and 5.": [
        "'speaker_3': 'Thank you, Mayor. Remember the city council items five, six and seven all deal with the destruction of records for various departments. Item five is the Department of Development Services. Item six is records from financial management in item seven deal with records from three of the council offices, districts two, four and five.'",
        "'speaker_3': 'At since the time that the agenda was posted, we've received public record request to either inspect or to look at the receive an index of what records are being destroyed. And so what we'd ask tonight would be to amend the motion on all three of these items to authorize the city to destroy these records once we have'",
        "'speaker_3': 'completed and complied with the public records request that are currently pending at the city. Thank you.'",
        "'speaker_0': 'Okay. Can I get a motion in a second for that request? The emotion, like any public comment. Please come forward.'",
        "'speaker_2': 'Very good to hear Kirk as he addressed. Unless you have something to hide. I would hold off destruction of any records for 90 to 120 days, by which time the U.S. attorney will have established a strong foothold in this city.'",
        "'speaker_2': 'But if you've got something to hide, why, I can't stop you. Thank you.'",
        "'speaker_0': 'Thank you. Okay. I think we're no other speakers. We can take these, I think, as a group. So please cast or do the roll call vote, please.'",
        "'speaker_1': 'Yes, Councilwoman Gonzalez. Councilmember Pearce, Councilwoman Price Councilmember Super or Councilwoman Mongo i. Vice Mayor Andrews. Councilmember. Younger i. Councilmember.'"
    ],
    "Agreement with Cat Protection and Welfare Organizations for the Long Beach Little Paws Project.": [
        "'speaker_0': 'Okay. Now we're going to go to a public guy who if I call your name, please come forward. Oh, I'm sorry. Let me let me let me go and do that. I'm 13, ma'am.'",
        "'speaker_1': 'Court report from Parks, Recreation and Marine recommendation to authorize the City Manager to execute an agreement with Helen Sanders Cat Protection and Welfare Society to partner with the Long Beach Animal Care Services for the Long Beach Little Paws Project to be housed in commercial properties at 1179 East Wardlow Road in Long Beach from January 1st through 2019'",
        "'speaker_1': 'through December 31st, 2019, with an annual renewal option, increase appropriations in the General Fund in Parks, Recreation, Marine by 50,000, offset by revenues from animal care donation trust accounts, districts five and seven.'",
        "'speaker_0': 'Thank you. Councilwoman Mongo would like a short staff report, Mr. West.'",
        "'speaker_3': 'Yes. Ted Stevens.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Honorable Mayor and city council for this opportunity to talk about this item. This has been a kind of a long time coming for this project.'",
        "'speaker_4': 'We have two great groups, the Little Lion.'",
        "'speaker_0': 'Foundation and Helen Sanders, Cat Paws. They've been instrumental with us, working with us for the last two years on saving the lives of hundreds of underage kittens. The focus of this nursery is for the bottle babies, the kittens under eight weeks of old, but even more specifically under four weeks of old that need 24 hour care.'",
        "'speaker_0': 'And they're.'",
        "'speaker_4': 'Just two really great.'",
        "'speaker_0': 'Groups, a great group of volunteers, and they've found a location and we're going to be supporting them financially as best as we can, as well as with other things social media, fundraising. The adoption process. Afterward as much as we can.'",
        "'speaker_0': 'Spaying and neutering. And then again, the financial the $50,000 that we have in our trust right now for cats and kittens. And we're really excited to get this project going. We hope it's approved. It's been something that we've been dreaming up for a long time and we're really excited to be working with.'",
        "'speaker_4': 'These two groups. They're really great.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_6': 'Thank you. I just want to appreciate Mr. Stevens for his continued commitment to this. I know it's been ups and downs for several, several months trying to get this done. And then also to give you a bit of praise related to your press release today that euthanasia is, ah, again down and the great work that you've done'",
        "'speaker_6': 'while you were there. We will be sad to lose you in the next few weeks, but congratulations on your new opportunities and thank you for all that you've done.'",
        "'speaker_0': 'Thank you. Constable Pearce.'",
        "'speaker_6': 'I also want to say that this is a great step in the right direction, and I look forward to more good steps in the right direction. Thank you.'",
        "'speaker_0': 'Thank you. Public comment on this item. Please come forward. Is there any public comment? Is there any other public comment on this item? The closing of the speakers list. 1/2. Just the three. Okay. Speaker's list is closed. Just the three that are here.'",
        "'speaker_0': 'Just please go ahead.'",
        "'speaker_8': 'Good evening. Mayor and City Council. My name is Patricia Turner. I'm the director for No Kill Long Beach. I've been over I'm a trained researcher. I've been doing research on the Long Beach Animal Care Services shelter for over six years.'",
        "'speaker_8': 'We're very happy to see this kitten nursery. This is an excellent move. Partnerships with rescues are part of the no kill equation, which is something we've been working very hard to educate the public about, educate city council about, and let people know what's out there that this is a wonderful step in the right direction.'",
        "'speaker_8': 'Long Beach Animal Care Services killed 601 kittens last year. Many of them were healthy, treatable and maybe just a little too young. But many cities across the nation are saving these animals. And I'm very, very happy to see the city of London joining the rest of the country in a humane care for our our shelter animals.'",
        "'speaker_8': 'However, I was dismayed to see the clause, the provision in the description that restricts the right to free speech of the rescues who are going to be doing this heroic, wonderful work for you all. So I'd like to read into the record what exactly that clause says.'",
        "'speaker_8': 'And this is from the description that's on the that's on the city website. It says, Publicity takes me a moment to find it. I'm sorry, publicity. Okay. Additionally, no one affiliated staff or volunteer with any party in this agreement will engage in negative verbal behavior or written posting towards another party on social media or other online or'",
        "'speaker_8': 'public venues to make negative, defamatory or inciting remarks about another party in this agreement. Further on, it says all backs reserves the right to determine at its sole discretion what is negative, verbal or written posting behavior. So I just would like to say that getting to this point with the city has not been easy.'",
        "'speaker_8': 'I've been advocating for six years and I've had to say some pretty negative things because what has happened is the shelter has been killing animals without impunity and without putting in proper safeguards in place. And we have two audits now that have have shown that this is the case.'",
        "'speaker_8': 'They have showed they have vindicated every remark I've made on social media, and I am very thankful to the U.S. Constitution that gives me a First Amendment right to talk about the killing of animals in shelters that have been recalcitrant in doing their job.'",
        "'speaker_8': 'Mayor Garcia, you yourself have hidden people's posts. And I know this because I personally documented those postings that were hidden by people during the last election. And, you know, if you hear some anger in my voice, it's because it is there.'",
        "'speaker_8': 'I dedicate nearly all of my free time to helping to change this shelter, and I do it in as principled a way as I possibly can. I'm a trained researcher, and I'm employed by the University of California. And I have principles.'",
        "'speaker_8': 'And I have been I've been threatened by people on this council that they were going to sue me because of things that I've said that were absolutely 100% true. So I am thrilled that we have this kitten nursery, but I am not thrilled about this violation of First Amendment rights.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_9': 'My name is Alex Armstrong, and I lived in Long Beach for 39 years and I'm also very happy about this program. I think it's a great thing. I'm very happy that you're putting this in place finally. But again, I also cannot stand by and watch my First Amendment rights and the rights of my fellow colleagues.'",
        "'speaker_9': 'It's being pushed aside. Section 1983 to Animal Rescue. There can be no dispute that complaining about abuses or violations of law at a shelter is a constitutionally protected right. A rescuer not only has the First Amendment right to speak out against abuses and violations of law committed by a governmental entity, he or she also has the constitutionally'",
        "'speaker_9': 'protected right to demand that the government correct the wrongs that are identified. This includes to the rights to threatened or sued or to actually file suit against the shelter. So great program. I don't know why you would need to to put the end of it.'",
        "'speaker_9': 'Mom, put this statement a gag order on on the staff and the volunteers. If a staffer or a volunteer member sees something wrong at this program, something that they have every right to speak up about it, it's only common knowledge that they should be.'",
        "'speaker_9': 'You would in you would invite that it should be brought. You would want my staff who work for me. I don't tell them. Don't say anything to anybody if Joe does this wrong. I want you to bring that to my attention.'",
        "'speaker_9': 'So things like this. Again, he seemed to want to stop people from saying anything bad about the shelter. And I disagree. Very happy about the program. Thank you for bringing it to Long Beach.'",
        "'speaker_2': 'Thank you. Next speaker.'",
        "'speaker_6': 'Mayor.'",
        "'speaker_10': 'Vice mayor again. My name is Christy Maloney. I'm a resident of Long Beach. Was born and raised here. Schooled here. Grew up with animals. Lots of animals and in rescue. Yes. These two groups are a godsend for our city's kittens.'",
        "'speaker_10': 'That's for sure. Please don't tie their hands by disallowing them to disclose negativity that does exist. Or we end up with a negative shelter again. So we're trying to get back. To having positive relationships and having a gag order on these to.'",
        "'speaker_10': 'Groups are is something that I want you to think twice about and hold off on voting on this and. See if that can be. Taken out.'",
        "'speaker_6': 'Or reworded.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_2': 'Thank you. You know. No to have comments from. You have another speaker?'",
        "'speaker_1': 'Occupy Roll Call.'",
        "'speaker_6': 'Vote no. Have a.'",
        "'speaker_7': 'Fine.'",
        "'speaker_6': 'I have a question for Charlie Gray, Mr. City attorney. I am reading this as well. And I'm curious. I know that there's been some tense moments over the last couple of years, and I know that some of the concern has been around false information.'",
        "'speaker_6': 'Is there a way that we could amendments to make sure that it's, you know, that people can share accurate information around accurate numbers at our shelter? It does seem kind of vague. And I'm just wondering if there was a way to tighten up the language.'",
        "'speaker_3': 'Well, certainly we could we could change the language or rework the language. It obviously would have to be agreed to by both parties in order to do something like that. But this language was put in at the request of the department.'",
        "'speaker_3': 'We could we could certainly change it in any direction that the council would like. Seems like a.'",
        "'speaker_6': 'Port. It seems like a poor direction for us as a council to just put something that as up to one party's discretion that we could put that into any agreement, you know, in any department. And I haven't had a lot of conversations about this.'",
        "'speaker_6': 'And I know that you guys have done a lot of work on it so far, but if there was a way to make it specific, to make sure that that people are talking about truth that happens in our shelters and that we leave, I know that that's a difficult to prove.'",
        "'speaker_6': 'And I know Councilmember Mongo has something to say, but I would just love to see it where we could get a little bit more comfortable with it.'",
        "'speaker_0': 'Councilman Mangal.'",
        "'speaker_6': 'Thank you. Councilman Pearce, I'm glad that you brought that up. We started these dialogs with the staff. Currently, anything that is factually based, they can post whether it is negative or not as long as it's fact based. I think that the the root the root of it is more the name calling, antagonizing misinformation or saying inappropriate or'",
        "'speaker_6': 'harassing things towards our staff members. And so this is also a similar clause, I think, that was mentioned. And correct me if I'm wrong, Mr. Stevens, is this the same clauses in the volunteer agreements?'",
        "'speaker_0': 'I believe so, too.'",
        "'speaker_6': 'And from my understanding, both of the fosters that are involved have no issue with it. And they also believe that they have many other methods to be able to say anything they want. Is that accurate, Mr. Stevens?'",
        "'speaker_0': 'Yes. They the two groups were.'",
        "'speaker_8': 'They were totally fine.'",
        "'speaker_6': 'With it. And I don't want to delay the ability to have the agreement with them, because we're getting a ton of little kittens at the shelter at this time. And so I appreciate you guys taking the time to inform me.'",
        "'speaker_6': 'I actually met with the department head for Parks and Rec as well, so I'm just glad we're going to have the opportunity to save these little kittens. Thank you for that. And I just I know that it's going to come back in a year, so I would ask that it could come back maybe in nine months for'",
        "'speaker_6': 'us to see how successful the program is. That would be helpful.'",
        "'speaker_0': 'Okay. So we'll get an update in nine months.'",
        "'speaker_6': 'Thank you. Two from four. Would that be okay? That's fine.'",
        "'speaker_7': 'Great.'",
        "'speaker_0': 'Please. Going to do a roll call vote.'",
        "'speaker_1': 'Councilwoman Gonzalez. Councilmember Pierce. Councilwoman Price. Councilmember Sabrina. Hi. Councilwoman Mango. Hi, Vice Mayor Andrews. Council Member, Your Honor. Hi. Councilmember Richardson. Motion carries.'",
        "'speaker_0': 'Okay. Thank you. And I just wanted to and I just wanted to thank all of you. This is obviously an amazing going to be an amazing partnership and program. You're already all doing such amazing work, saving so many lives and just thank you.'",
        "'speaker_0': 'And we look forward to the expansion of the partnership. So thank you all very much for being here. We're going to move on to public comment. If I call your name, please come forward. John Kilgour, Donald Shumaker, Anna Huang are the first three.'"
    ]
}