{
    "Contract with IPS Group Inc. for Electronic Parking Meters.": [
        "'speaker_1': 'Hearing item one is a report from the City Manager and Public Works recommendation to receive supporting documentation into the record concluded the public hearing. Adobe resolution authorizing city manager to execute a contract with IP's group for the purchase and installation of electronic parking meter in an amount not to exceed 1.5 million 538,979 and Adobe resolution establishing parking'",
        "'speaker_1': 'meter rates as defined in the Long Beach Municipal Code. Citywide decrease appropriations in the City Activities Department by 800,000. Increase appropriations in the public works department by 1.148 thousand 134. Increase appropriations in the Belmont Shore Parking Meter Fund in the Public Works Department by 44,573, and increase appropriations in the Rainbow Harbor Fund in the Public Works Department'",
        "'speaker_1': 'by 153,891.'",
        "'speaker_5': 'And.'",
        "'speaker_3': 'Mayor, members of the city council on tonight's hearing. Number one item, it will require three separate.'",
        "'speaker_5': 'Motions and actions. We would after the presentation by staff, if the council so desires, we would need a separate motion and adoption of the resolution authorizing the city manager to execute the contract with IPC Group, and then a second motion to establish the parking rates amending the municipal code.'",
        "'speaker_5': 'And finally, a third action on the appropriation adjustments. Thank you.'",
        "'speaker_0': 'Thank you. With that, I'll turn this over to staff.'",
        "'speaker_12': 'Thank you very much, Mr. Mayor. Members of the city council. We've got about a ten minute presentation to talk a little bit about the parking meter issue and all of the public outreach and the immense amount of study that we have performed this year looking at how we can improve our parking infrastructure.'",
        "'speaker_12': 'So we want to talk a little bit about our citywide approach. Talk a little bit about what this study found and what the results of that study was. Talk a little bit about community feedback and then go through some question and answer and be available to council to answer questions.'",
        "'speaker_12': 'So we really approached modernizing our our infrastructure for parking with a couple of goals in mind. One, we wanted to enhance the user experience. We have about 620 meters throughout the city, and we'd like it to be a uniform experience when you when you park in downtown or Belmont Shore or in the park.'",
        "'speaker_12': 'We wanted to really go through approach this with a comprehensive plan and reducing the cost of a fractured parking meter system. We really wanted to capitalize on data that can now be available as you upgrade to smart meters as they are so called.'",
        "'speaker_12': 'And we really wanted to do some extensive study both on the technical side and on the financial side to make sure that this is a sustainable model and that we can afford it on a go forward basis. And so we conducted a parking meter study earlier this year, and the results were finalized in August 2014.'",
        "'speaker_12': 'And we brought that out to the community to share the results of that study and really get some some public input. And so what we really looked at was how do you upgrade our meters or whether we should be doing single spaced meters or multi spaced meters?'",
        "'speaker_12': 'What are those new meter capabilities that we would recommend and then perform that financial analysis that we talked about? So we get asked the question sometimes, what about multi spaced parking meters? Why are single space preferred over multi space?'",
        "'speaker_12': 'If you remember, the city actually performed a pilot in the pike and in downtown using multi spaced parking meters. So those are currently in operation. We started this pilot a couple of years ago and what we found is people really do enjoy those multi space parking meters, but really they are more inclined to to function in a'",
        "'speaker_12': 'lot in a parking lot rather than on the street. We found that there's some confusion when they're on the street. They're not quite as intuitive, but they work very well in our parking lots. And so we're moving on a path to have multi space parking meters in all of our lots and single spaced parking meters for our'",
        "'speaker_12': 'and on street parking. So we get asked sometimes, where are the parking meters in the city? We actually have them in three areas in downtown. What you see here in red is what we call the downtown core, and that's currently at a dollar an hour.'",
        "'speaker_12': 'Then we have other areas of downtown which are shown in blue. We also have parking meters in the park and you'll see them down here. Those are currently at $2 an hour and that's those limited meters in the park.'",
        "'speaker_12': 'And then the third area that we have parking meters is in Belmont. Shaw and Belmont Shaw has all along of Second Street, we have about 50 cent an hour. We have 50 cent an hour on Second Street and then we have a number of lots that also are metered and those range from about $0.25 an hour on'",
        "'speaker_12': 'the north side. We actually have some that have a compounding rate. The more money you put in, the cheaper they are. And those actually average out at about $0.13 an hour. And then we have a lot down there in Belmont Shore as well.'",
        "'speaker_12': 'So what are some of the benefits of smart parking meters? Really, it is a new world for, you know, that we all live in we're all using credit cards a lot more. There's still people that love using change.'",
        "'speaker_12': 'There's people that love using their credit card. It is really a personal choice. The benefit of a smart meter is that it can do both. It accepts both credit cards and change. You know, these new meters are large backlit screens.'",
        "'speaker_12': 'They're very easy to view, very easy to use, very intuitive. You can display messages on them. You can tell people things like, you know, there is a special event coming up tomorrow or, you know, parking is free tomorrow if it's a city holiday.'",
        "'speaker_12': 'There's also a lot of technology that comes with it in terms of being able to have apps and information. For example, you can get mobile apps. We've seen them in other cities that help do drive by voice navigation.'",
        "'speaker_12': 'So it can tell you there are 40 parking spaces right now available on Belmont Shore. Drive down, take a left, take a right, and the parking space is right there on your right. And we often see people circling in downtown on Belmont Shore looking for parking.'",
        "'speaker_12': 'Apps like this can help direct people directly to a spot eliminating that need for circling. And then it provides a lot of data. For city staff and our stakeholders to come together and really empirically look at our ad, our parking situation at all of our parking assets, and how do we move things around to make things better'",
        "'speaker_12': '? Parking experience. So what we're looking at doing is doing a piggyback process to purchase EFPs parking meters. We talked about this a little bit at the council the other day, and we are recommending piggybacking here what the benefits of piggybacking here is.'",
        "'speaker_12': 'We are able to use the city of Sacramento's bid process to get the rate for 6000 single space parking meters for our 620 meters. So essentially, we're getting a a bulk discount and it's saving us about 12% if we were to bid this ourselves and to go out by ourselves.'",
        "'speaker_12': 'So we believe we're very comfortable in recommending the piggyback. It saves time in terms of implementation, saves time in terms of procurement and saves money as well. So talk a little bit about the financing. There are two aspects.'",
        "'speaker_12': 'We want to be able to fund the capital costs and the operation costs. The meters are there is a capital cost. It's about 750,000 for 600 meters. And then there's the sensors that go along with those that cost about 440,000.'",
        "'speaker_12': 'The real issue is the operating the operating expense is much higher for these types of meters because they provide a lot more benefit. There's a lot more that they can do. For example, the existing meter costs about 158 parameter, and the smart meters, we believe, will be up to 446 meter dollars per meter annually to maintain one'",
        "'speaker_12': 'of the big variable costs that we need to account for is the credit card usage cost. Every time you swipe your credit card, the city pays a transaction fee for that to the credit card company. And so you have to make some estimates on how many people are going to use credit cards.'",
        "'speaker_12': 'In the city of Santa monica, they estimated about 35% of people would use credit cards. And actually it was a very popular program. People love the meters in Santa monica. They started to use them and they used about 60% credit card transaction almost overnight.'",
        "'speaker_12': 'Santa monica had a $1.4 million expense they had not counted on. So we want to learn from their experience and plan appropriately. And we're conservatively planning that we'll be able to absorb up to a 70% usage of credit card rates or credit cards over the next several years.'",
        "'speaker_12': 'And so we know that you're going to we're going to have to find a way to pay for these if the city council does choose to move forward. Rate adjustments are what we are recommending. We've looked at the issues of credit card fees and the rate increase could cover that.'",
        "'speaker_12': 'We also are making some assumptions that the meters themselves will generate some revenue and that's a good thing. But we need to have a sufficient cushion in case those meters aren't you know, they don't meet our projections. And so we believe with the rate increase that we're proposing today will be able to cover both those eventualities and'",
        "'speaker_12': 'that the rate increase will keep the city what we call net revenue neutral. We're not looking to make a whole lot of money with these meters, but we're also not looking to lose any money, essentially be able to afford the cost of the new service.'",
        "'speaker_12': 'So we took this presentation that you heard on the road and went out to the community and heard a number of things. It was a pretty extensive outreach effort. We reached we did about 14 different meetings. We did an online community forum.'",
        "'speaker_12': 'We received about 70. So responses from that from Speak Up, Long Beach. We did email as well, and we also did a lot of social media. So we heard from a lot of people about parking meters. Just in your packet, you have the full information for what we heard and on the road.'",
        "'speaker_12': 'I wanted to sum up a couple of key issues. On meter rates, we definitely heard in Belmont. Sure. That there's a concern that an increase in meter rates will negatively impact residential parking. We're very sensitive to that. We we understand that area very, very well.'",
        "'speaker_12': 'And so, you know, we heard that very loud and clear in Belmont Shore and downtown. We heard some of the same issues about, you know, parking impacted areas. We also heard something in addition to that is the idea of trying to keep some parity between the downtown commercial area and the Belmont Shore commercial area in terms of'",
        "'speaker_12': 'a rate increase or everyone paying a certain amount in order to receive these meters and the sensors we heard some people love the sensor idea. Some people don't like the sensors. Some were worried that it will eliminate the remaining time to the next users.'",
        "'speaker_12': 'Others felt the sensors were incredibly powerful to provide that data that we're looking for. And in Belmont, sure, the parking commission actually looked at eliminating the sensors as a way to save money to prevent a rate increase. In terms of meter rates.'",
        "'speaker_12': 'We looked at a couple of different issues. We took a look at passing on our credit card fees to credit card users. That was a request to look at the so-called convenience fee. We also looked at whether you increased rates in the lots and increased rates for the on street meters and what different levels we could be'",
        "'speaker_12': 'doing that and especially in Belmont. Sure. We looked at reducing the proposed rate from 50 cent increase down to $0.25. We looked at whether we should increase rates in the lots on Second Street and whether or not we should do a change in enforcement hours.'",
        "'speaker_12': 'In terms of credit card transaction fees, we were asked, can you do a credit card transaction fee? And the answer is essentially it is legal in California to do so. However, our financial management department has talked to our credit card vendors and found that our contracts actually prohibit that.'",
        "'speaker_12': 'And we've talked to them personally. They do not allow us to pass on directly the credit card transaction fee. And so that is not something that will be recommending. In Belmont Shore, we were asked to really take a look at different alternatives about the meter rate increase in Belmont Shore parking.'",
        "'speaker_12': 'A business associate or a business improvement commission came up with some ideas. And so we looked at whether or not we could increase the lots and found that they would that we'd still be in a loss if we just increased the lots and not the meter rates.'",
        "'speaker_12': 'On the street we looked at enforcement hours, which would generate some money, but unfortunately that would really impact the residents down there because they use that for parking at night. And we looked at a smaller increase. Can you drop your rate from a 50 cent increase down to a 25 cent increase?'",
        "'speaker_12': 'And so in downtown, we looked at very similar things in Belmont. Sure, we did find that you can lower the rate from 50 cent increase to 25 cent and that can be affordable. Unfortunately, the same thing isn't available in downtown.'",
        "'speaker_12': 'Downtown has a different financing structure, different expenses. But one thing that we are looking to do in downtown is really make an investment in parking, is using some of the funds that are available from parking meter revenues above and beyond.'",
        "'speaker_12': 'For the first two years to invest in our downtown parking, we heard a lot of input about the need for additional parking, the parking garage improvements and safety and security and all those things. And so that is part of this staff recommendation to every two months as the money comes in that is above and beyond what we'",
        "'speaker_12': 'need. Put that aside for two years to be able to invest, and that's approximately $480,000 over the next two years. That is projected at this time. In terms of meeting rates, where are we compared to everybody else? We believe that we will still be very competitive.'",
        "'speaker_12': 'Actually, I'm going to skip to slide 23 to show where we're actually going to be is everybody raises rates when when looking at IPS meters or just about everybody. And even with our rate increase, we believe will be very competitive, will be at or below other beach cities will be between $0.75 and Belmont sure dollar to dollar'",
        "'speaker_12': '50 in downtown and $2 in the pike. And if you see down here, we'll see a number of cities that we're very competitive with. And so just wrapping up the recommendations, three things I want to highlight is one of the things we heard in the community is this idea of can we if we have to have a'",
        "'speaker_12': 'rate increase, can we maybe get some free time for short trips? And so we like that idea. We're actually recommending that you get 5 minutes free. So if you show up and you just want to run and get your dry cleaning run to a market, you can hit a button and you get 5 minutes free.'",
        "'speaker_12': 'And we think that's a very good thing to study for the first year in a one year pilot, I talked a little bit about the investment in parking. We're also looking at investing in mobile apps and investing in our website.'",
        "'speaker_12': 'And then one of the things we heard in Belmont, sure, is the issue of citations after 2 hours. And so we're looking to keep the same practice that we have today, not changing that, studying the data over six months and then making some decisions and coming back to the council on that.'",
        "'speaker_12': 'So for the next steps, if the city council elects to move forward, we basically will implement the following. An extensive public outreach and education campaign will let people come see the meters, touch the meters, get used to the meters, talk about how they work.'",
        "'speaker_12': 'We also want to relax enforcement during the initial implementation so that users have a chance to to, you know, get it right when they're using the meters. We'll also be looking to, you know, get a lot of information on that website, I think will be very helpful.'",
        "'speaker_12': 'And then we expect the rollout to be about 6 to 8 weeks after contract approval. Once we've got all these steps in place. So with that, we'll end the presentation. I just want to shortly thank a lot of people who have really spent a lot of time on this for the last six months.'",
        "'speaker_12': 'Too many to mention. But I do want to mention a couple our a Malloy and John GROSS, Mike Sickles, Leah Ericson, Dave Roseman, Geraldine Alejo and Karen Fu, who's sitting behind me who really did a lot of work out in the community.'",
        "'speaker_12': 'And then, of course, our business improvement districts, Bill Lorber and president in Belmont Shore and Craig Cogen for spending a lot of time to go out to the community, to engage the community and to work with us. And with that, we're available for questions.'",
        "'speaker_0': 'Thank you. I'm going to turn this over to the council and then hop, have a comment. So, Councilwoman Price.'",
        "'speaker_9': 'Thank you. I want to thank staff for their diligent efforts to get us information and access to data in regards to this proposal. I will say that I've been very involved in this proposal with my community in my district since the initial memorandum came out identifying this opportunity.'",
        "'speaker_9': 'And initially, as staff knows, I was opposed to the idea of any sort of rate increase. I have a couple of concerns. I will be moving. In fact, I'll move at this time to adopt staff's recommendation. And then I have some comments.'",
        "'speaker_0': 'There's actually there's now the city attorney. There's three actual motions that we made. Could could Councilman Price make all three?'",
        "'speaker_3': 'That that's correct. Okay.'",
        "'speaker_0': 'So you would make the three different motions? Vice President I would second those and then we could do one public comment period for for the items that correct. That's correct. Okay. So do you want to make the three different motions?'",
        "'speaker_3': 'I believe.'",
        "'speaker_5': 'She did by moving staff recommendation will take three actions.'",
        "'speaker_0': 'On staff that's on mission. Yes thank you.'",
        "'speaker_9': 'Thank you. I do want to have some additional comments, though, in regards to the item. So I want to talk a little bit about what my thought process was and hopefully in that process, answer a few questions for those who might be interested in this topic.'",
        "'speaker_9': 'Now, the initial staff recommendation on this for Belmont Shores specifically was a 50% increase, and that's that was the initial proposal. Mr. MODICA Is that right?'",
        "'speaker_12': 'Yes, that is correct.'",
        "'speaker_9': 'And the proposal that staff is now making, the recommendation that staff is now making would make the increase in Belmont Shore, the lowest in the city.'",
        "'speaker_12': 'Yes, we were actually as part of the community outreach, we look to see if we can reduce that rate. We definitely heard that that was an issue. So we are proposing rather than a dollar going up to a dollar, it would be only going up to $0.75 and using some of the fund balance that the parking commission'",
        "'speaker_12': 'has to make sure that they can cover those costs. And yes, it would be the lowest rate in the city would be $0.75 in Belmont. Sure.'",
        "'speaker_9': 'In terms of the discussions that took place, I want to thank staff for the outreach that you did throughout the city, specifically in the Belmont Shore area and the third district. I think, you know, it's safe to say that the dynamics in Belmont Shore are very different than many other communities in the city, specifically the proximity of'",
        "'speaker_9': 'residences to businesses. That's something that's very unique in the three areas where the new parking meters are being proposed. I would say that the proximity of homes to businesses and the availability of parking is is makes Belmont Shore this similarly situated than the other areas.'",
        "'speaker_9': 'So I think it makes sense that they have a different parking meter goal and wondering if that is what staff found to be the case in terms of the surveying that you did?'",
        "'speaker_12': 'Yes, we found them to be two very different areas. Don't you know, there in downtown you do have parking impacted areas, but they also have parking garages. They have some benefit of a parking garage in Belmont. Sure, they don't have a parking garage, but they have some lots that are very inexpensive.'",
        "'speaker_12': 'But it's also a very elongated strip. We're in downtown. It's more of a course, so they are very different areas.'",
        "'speaker_9': 'One of the things that staff did on this project and other projects that I think was really good and I think you should get a commendation for it, is using the Speak Up Long Beach survey tool. I've had a chance to read all of the survey responses in regards to the parking meter proposal.'",
        "'speaker_9': 'And the issue of disparity is one that I think was kind of echoed throughout the the comments from folks is that if there was going to be any sort of an increase, it needed to be an increase that everybody would that was getting this new convenience in terms of the meters was going to be experiencing.'",
        "'speaker_9': 'So I think that's an that's an issue. That's an important one that's come up. I am happy to know that the staff recommendation is now 25% increase in Belmont Shore as opposed to $0.50. And I want to think for a moment, Bill Lauber, who's here because he came up with several alternatives, many alternatives in order to try'",
        "'speaker_9': 'to find a way to make the rate increase, either zero or minimal. And it's my understanding that staff has considered all of those alternatives. And the recommendation that staff is making takes into account the convenience fee alternatives, increasing lot rates, changing the times, not having sensors.'",
        "'speaker_9': 'All of those were taken into consideration. Is that right?'",
        "'speaker_12': 'Absolutely. We did take a look at all of those. A lot of them are very good suggestions. I wish we could have piece them all together to add up to the total that it would have that we really were looking to.'",
        "'speaker_12': 'We came close but not quite there. But it we did look at all of those. And I want to thank Mr. LaBella as well.'",
        "'speaker_9': 'And now I had an opportunity to meet with some of the stakeholders in our community, including members of the Belmont Shore Resident Association Board. And I think one of the biggest concerns and and and they were very candid with me about their concerns.'",
        "'speaker_9': 'One of the things that's come up is sometimes people actually drive around the residential neighborhoods a little bit more because they don't have coins. And so they're looking for off street, off second Street parking so that they don't have to deal with the coin operated parking meters.'",
        "'speaker_9': 'And so I think the convenience of being able to use a credit card is something that most people who I've talked with have reached out to our office feel is a good thing. One, the issue that's come up for us in our community is the keys, the use of the keys, the parking keys.'",
        "'speaker_9': 'Can you elaborate a little bit on on the future of those keys?'",
        "'speaker_12': 'Yeah. So the key was implemented as a pretty innovative program down in Belmont Shore as a way to use the what I call the. Don't meet her, but allow you to not have coins, but to use a key to turn it into a little bit of a of a meter that allows a different form of payment.'",
        "'speaker_12': 'That exact system won't be transferable over into these new into the new meters. But we're very much interested in looking to see if we can replicate that if the business if the parking commission is interested in that, if the business association is interested in that, being able to provide a card that you can load up similar to'",
        "'speaker_12': 'the key and to also work on a transition so that people don't lose the money on their keys. So that's definitely something we're going to be looking at.'",
        "'speaker_9': 'Because that's an issue that's come up recently. It just seems that wherever I am on Belmont Shores, someone will walk up to me and tell me that they purchased a bunch of those keys of Christmas presents, or they still have money left on their keys and they want to make sure they don't lose money.'",
        "'speaker_9': 'And we're going to be able to ensure that that happens. Is that.'",
        "'speaker_3': 'Yes.'",
        "'speaker_12': 'That'll be part of our implementation plan. I don't know exactly today how that will work, but if we approve this, that will be factored into our implementation plan over the next several months.'",
        "'speaker_9': 'The other thing is these these smart meters, are they smart enough that when the technology changes and people are no longer using credit cards, they'll be able to sync up with smart phones?'",
        "'speaker_12': 'Absolutely. It has the ability today to do Apple Pay or Google Pay or Google Wallet or any of those things. We're actually choosing not to purchase and enable that because it is such a small market share right now.'",
        "'speaker_12': 'But if the market share grows and people are using that, it absolutely can be retrofitted at a pretty small cost. And it's a very easy adaptation. And we can and we can use that functionality in the future.'",
        "'speaker_9': 'I have a question that maybe the city attorney might be well suited to answer. Depending on what action we take tonight. Would it be possible for us at some point in the future to reevaluate the rate structure so that we use the data that we're collecting from the smart meters to determine whether or not there are different'",
        "'speaker_9': 'rate options available, such as the progressive pricing that some Kurt Schneider, who's a resident and a member of of our very active member of our community, suggested that a progressive pricing type option, where it's maybe $0.50 for the first hour, which is what it is now, but that you raise it higher than that for the second hour'",
        "'speaker_9': '. Is that something that we could look into down the road and modify our payment structure?'",
        "'speaker_3': 'May or members of Council.'",
        "'speaker_5': 'Councilmember Price Absolutely. Under the second action you would take tonight in adopting the parking meter rates in the municipal code, you could come back at it at a later date and adjust just that rate, which would adjust the rates in any of the areas that the council decided to do.'",
        "'speaker_5': 'So, yes, you could do that.'",
        "'speaker_9': 'Okay. And that's I mean, I'm letting staff know at this point that that's something I'd really like to look into. And obviously, I'll talk to my council colleagues about that and see if that's something they're interested in. But if that were an option for our residents so that they're still having the same type of rate that they're'",
        "'speaker_9': 'used to for the first hour and pay more for additional time. And we can study and use the the data from the sensors to help us with that. I think that would be great. In terms of the sensors, one of the concerns that we've heard is that these sensors are going to encourage the city for revenue generation'",
        "'speaker_9': 'purposes to change its enforcement practices. Can you comment on that a little bit? Like, are we going to have, you know, people issuing citations waiting for the car to drive away and the sensor to indicate that it's, you know, waiting for the sensor to go off and indicate that someone's expired.'",
        "'speaker_12': 'So we absolutely looked at the citation and the impact of these meters on citation, and we actually believe that revenue is going to be approximately flat. It might go a little bit up, it might go down. It actually varies by year by year.'",
        "'speaker_12': 'For example, in a in a down year, in a down economy, we see our parking citation money drop as people are very, very careful about not getting citations. In other years it'll go back up. So in terms of the technology here, we don't expect a major change.'",
        "'speaker_12': 'It will help our officials to become a little bit more efficient while they're driving down that street. They'll be able to see who is, you know, not currently paying, but they can do that today anyway. We don't expect this to be that every time somebody is over by a minute that a parking citation person will show up'",
        "'speaker_12': ', they're going to run their normal routes. From that perspective, things are going to be pretty much the same.'",
        "'speaker_9': 'In terms of using the data from the sensors to evaluate whether or not we need to modify our current parking ordinances in terms of to our max parking. Is that something that you foresee the sensors allowing us to be able to do?'",
        "'speaker_12': 'Absolutely. One thing that we heard in Belmont. Sure is the issue of the two hour limit and whether or not we would be changing our enforcement practices. And so what we want to do is leave things as they are today.'",
        "'speaker_12': 'So no change in enforcement practice. And then after six months, take a look. Maybe it's six months, maybe it's a year. But as we review that data, what are people parking? Are most people staying for 3 hours rather than 2 hours?'",
        "'speaker_12': 'And if that's the case, should we be coming back to the council with a recommendation to change the hours to 3 hours, or is 2 hours appropriate? And should we be should we be changing our enforcement practices to encourage more turnover?'",
        "'speaker_12': 'So the data will provide a lot of information and we won't be making changes until we look at that data and then come back to the council.'",
        "'speaker_9': 'And you would expect that to be maybe six months or a year.'",
        "'speaker_12': 'I think we're going to start at about six months to really delve into the data once we've got a certain amount of time behind us to see some patterning and then and then look at the data from there.'",
        "'speaker_12': 'So between six months in a year.'",
        "'speaker_9': 'Now, another thing that I think is very different in Belmont Shore is that we do have some some lots that are adjacent to the businesses, parallel to Second Street, and our residents use those lots for parking. So changing the hours where they're changing the parking meter hours in Belmont Shore would inconvenience the residents who use those lots'",
        "'speaker_9': 'because they like to park in those lots after work and leave their cars there till the morning. Is that something that you found in any other neighborhood other than Belmont? Sure.'",
        "'speaker_12': 'We definitely have some parking challenges in District two, in District one as well, where they use lots after hours in order to park. And so we're very sensitive to that. Again, part of this study is we didn't want to change any hours.'",
        "'speaker_12': 'We thought that was a little too much to to bring to the community is changing parking locations and hours and rates would just be a very confusing so this really focused on the rates and then we want to use the data to look about whether or not we should be changing ours.'",
        "'speaker_12': 'So no, our no, our changes are being recommended as part of this.'",
        "'speaker_0': 'Gentlemen. Are you all right?'",
        "'speaker_9': 'I am. I'm just taking one last look, and I think I'm done. Thank you.'",
        "'speaker_0': 'Councilman Gonzalez.'",
        "'speaker_9': 'Okay. Thank you. I want to thank you all again for your work in this. I know it's been a long time coming as well as our community that's here. I first want to preface this by saying I know it's been it's hard to think about an increase in rates, but about two weeks ago, I brought forth an'",
        "'speaker_9': 'agenda item that really looks at downtown parking holistically. I shared that with some of you. I shared, you know, obviously our council, we passed that agenda item. It will basically direct our city manager and staff to look at public and private lots as it relates to efficiency exploration of a smartphone application, which is already being done.'",
        "'speaker_9': 'Safety as it relates to any unusual high calls for service at particular locations and also maintenance. So cleanliness as well. A lot of the emails I had been receiving, a lot of the contact I had been getting from business owners and residents alike, addressed a lot of these concerns.'",
        "'speaker_9': 'It was it was cleanliness. It was, you know, our city place parking garages aren't looking good. There's high calls for service. There have been issues after hours for employees. And so I hope and I feel very confident that the city manager will come back with some information that will make us make some changes, if possible, to our'",
        "'speaker_9': 'downtown parking garages to be able to to look at that. Aside from that, with the parking meters. I just wanted to go over a couple of questions with you. Can you? I know you explained a little bit about almost a half a million dollars projected to come back to the downtown for infrastructure improvements.'",
        "'speaker_9': 'Is that and that's above and beyond what we would be making. Can you go into that a little bit further?'",
        "'speaker_12': 'Yes. Councilmember and as to your parking study, we actually find that to be very symbiotic with what is being proposed here. And so ours really looked at add on street meters, but we're we're very cognizant of that. This is a system.'",
        "'speaker_12': 'And so but what you're proposing actually is going to dovetail very nicely into this effort. And then this effort actually provides the funding source to be able to do some of the things that we would find in the parking study.'",
        "'speaker_12': 'And so the staff recommendation and this came out of discussions with Dub and others in our park and our community input. This was not part of the original recommendation was to say let's invest for two years the the amount of revenue above and beyond that we're currently experiencing today from the city side, the downtown Long Beach associate'",
        "'speaker_12': 'is actually going to be repaying the city out of their portion that they receive for that for the one time capital costs. But the city will have some money and right now it's projected to be 480,000 over two years.'",
        "'speaker_12': 'It could be more, could be less depending on the assumptions. And we see that money being available to start doing some of the improvements to fund the parking study, if you will, and and make some real improvements in terms of signage and signage and safety and security and paint and lighting.'",
        "'speaker_12': 'Yes, ma'am.'",
        "'speaker_9': 'And then there were in comparison to Belmont Shore, we have a few different elements that make us a little bit different in the downtown. So we have the to our free parking and we're there. Was there anything else?'",
        "'speaker_9': 'I know we're getting 5 minutes for free on the on the front end. And were there any other elements that made downtown a little bit different than Belmont? Sure, because.'",
        "'speaker_12': 'I think those are the big ones. It's also the way that the finances are structured in downtown. We have an agreement to share 50% of the cost with of the net revenue with the DBA, which then reinvest that back into public realm and marketing.'",
        "'speaker_12': 'And so that's an expense. And we also have some general fund programs that count on that parking revenue. So it is a unique area compared to Belmont Shore. It's definitely different. And the parking garage, the to our free really is a fantastic resource that we're not really aware of any other major downtown anywhere in California that has'",
        "'speaker_12': '2 hours free parking in a parking structure in downtown.'",
        "'speaker_9': 'Great. Thank you. And I just want to say, you know, like I said, as hard as it is to increase rates, I think, you know, I'm certainly initially I wasn't supportive as this of this. I am supportive of it now.'",
        "'speaker_9': 'Just because we are getting a lot of these concerns, I feel will be taken care of with both the agenda item prior and then, you know, just looking at what we we are projected to to come about now with with potential revenue.'",
        "'speaker_9': 'Last thing I wanted to mention, I.'",
        "'speaker_4': 'Had it in.'",
        "'speaker_9': 'Here was the data. So I know we had talked about the data. And so I just want to reiterate, it is possible to come back after three months, six months to re evaluate the data and say, you know, if this isn't working, then we can go back down to the dollar or perhaps we need to change ours'",
        "'speaker_9': 'if need be. But that data is really going to be very imperative for us to be able to do that, correct?'",
        "'speaker_12': 'Absolutely. And we agree with that. The data really is important. And that's one of the reasons that we're recommending both in Belmont Shore and in downtown, that we have that data and those sensors so that we can make those changes.'",
        "'speaker_12': 'And I think there'll be a lot of good information that we currently don't have today to help us manage our parking resources.'",
        "'speaker_9': 'Okay. I just wanted to get that clear. Thank you very much.'",
        "'speaker_0': 'Thank you. Vice Admiral Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I, too, wanted to extend my gratitude to staff and the business community, both from Belmont Shore area as well as downtown. For all the work that went into this and I know that this did not start just recently, all of you, most of you were involved during the pilot phase as well, when'",
        "'speaker_2': 'we were looking at whether this technology is one that we are in that we're certainly able to do, and one that's right for Long Beach. So I especially wanted to thank the downtown Long Beach Associates as well as the Belmont Shore Area Business Improvement District for their participation.'",
        "'speaker_2': 'But my thanks to staff, I do want to share how very appreciative I am of the lengths you went through to ensure that you had the right information. I know you made trips to other cities and spent a lot of time there to investigate how they're doing it.'",
        "'speaker_2': 'You were on the street. You're talking with their traffic engineers and looking at their data, not just from an increase in revenue standpoint, but really the customer experience. And I can speak confidently that I saw your staff there in Santa monica spending all day talking with different department heads and staff members and also the business improvement district'",
        "'speaker_2': 'there on what the experience has been. So my sincere appreciation for all of the effort that went into that. Our interest in parking meters and the visitor experience goes back several. They go back several years and it was mentioned by Tom Mr. Modica during his presentation what our experience was with the pilot project.'",
        "'speaker_2': 'This I also wanted to convey. While it's obvious and it's stating the obvious, it certainly is very much in line with our innovation agenda. This city is moving.'",
        "'speaker_4': 'Toward.'",
        "'speaker_2': 'Being able to allow its residents, its customers, its visitors to navigate and negotiate with all of their activities in a way that makes sense to them, in a way that they conduct their lives today. And a lot of it is technology based.'",
        "'speaker_2': 'And so moving in this direction comports with not only the city's innovation agenda on behalf of its residents, but also the way people are moving in their own lives to conduct their lives. And the convenience of using credit cards, which was stated earlier, is very much a part of that experience, not to mention the potential impact on'",
        "'speaker_2': 'the revenue. And specifically speaking to Santa monica's experience, I know they conveyed what the revenue experiences and balanced with what the customer friendly experience was as well. And there's a cost to making these sorts of improvements and that therein lies the challenge and why we are coming forward with this proposal.'",
        "'speaker_2': 'I wanted to ask a couple of questions to Mr. Modica. One relates to the grace period. Do you recall what the other cities utilized if they had the grace period, what their grace period was correct?'",
        "'speaker_12': 'What I believe the Vice Mayor is referring to is when a car leaves and the sensor resets, the the amount down to zero. Do you set it down to zero? Do you set it down to 5 minutes? Do you send it to something else?'",
        "'speaker_12': 'Many cities reset it down to zero. There is no grace period. City of Santa monica actually found that they had a number of constituent complaints about resetting it down to zero. And so the compromise that they came up with was to reset it down to 5 minutes so that there is a five minute grace period.'",
        "'speaker_12': 'So if a car leaves, you have at least 5 minutes. We had originally proposed that that was what was in our study. And actually as we went out and met with the community, we came up with that other idea of providing everyone 5 minutes free because in that case, the first scenario, you only get 5 minutes of'",
        "'speaker_12': 'somebody had time left on the meter. So we're actually proposing something a little different in that everyone gets 5 minutes free. You just have to push the green button on the device and you get. Yeah, that's the. 5 minutes.'",
        "'speaker_2': 'And then that would be very much a part of the outreach. Correct? So. I wanted to ask. That five minute grace period in other cities that do it, they do it when the meter resets. Our proposal, your proposal to council is to do it by putting hitting the green button.'",
        "'speaker_2': 'If the idea is to allow residents or visitors to run a quick errand, I'm not quite sure that that 5 minutes captures that unless you're parking right in front of a business which I know in the downtown is never possible and certainly in Belmont.'",
        "'speaker_2': 'Sure, either. And so I'd like my colleagues to consider, especially my colleague in the third, perhaps a ten minute. Green button reset, whatever you call it, grace period. Have you evaluated the financial impact of a ten minute? So we're not doing 15 this price.'",
        "'speaker_12': 'So part of the reason we chose the five minute I think we absolutely agree with you is that 10 minutes is probably more reasonable for a short errand. We really don't know what the financial impact is going to be.'",
        "'speaker_12': 'We had to make some educated guesses, and what we're estimating in downtown is that the five minute free pilot would be actually about $85,000 a year just for the 5 minutes. It it's not quite linear, so it's not like you just add, you know, 85 plus 85 and that's your new amount.'",
        "'speaker_12': 'It might actually be more than that. So we would certainly be open to increasing it to 10 minutes. What we were proposing was to do it for 5 minutes for, you know, three months, six months, something like that, to get a feel for it and what that cost would be and see what the meter data tells us'",
        "'speaker_12': ', how many people were actually only staying for 5 minutes and then expand it to ten? If you'd like to make a different recommendation, we can try. We just might have to then go down if it's too expensive. We were proposing rather start low and an increase.'",
        "'speaker_2': 'So let me ask you this. When when someone does the 5 minutes and you're looking for data to determine whether or not they're staying longer, how are they staying longer? Are they doing so by coming back and putting money in the meter through their credit card?'",
        "'speaker_2': 'How how is that expressed to us?'",
        "'speaker_12': 'So the sensor will be able to see when the car pulls up and when the car actually leaves. We'll also be able to get data from how many people push the five minute button. And so we'll be able to see exactly how many people are taking advantage of our 5 minutes.'",
        "'speaker_12': 'And then we'll be able to get a sense of currently what the trips are. How many are there? Four, five? How many there for ten? How many are there for 15? 20. That will give us a better estimation once we get the sensor data of that.'",
        "'speaker_12': 'Another option could be you're just throwing this out there is to put in the meters without any free pilot program for the first couple of months, get that data and then institute a appropriate number. You know, there's a number of different ways to do this.'",
        "'speaker_2': 'Just from the practicality. And I know this is probably far more detailed than we necessarily need for the first discussion of it. But from a practical standpoint, if I approached a meter, someone's left actually any meter given your proposal and I strike the green button, I have 5 minutes, but if I needed ten, am I adding the'",
        "'speaker_2': 'additional five while I stand there or am I coming back?'",
        "'speaker_12': 'You would add it right then, so it would be 5 minutes free and you could walk away. Or if you needed ten you would put in a nickel, a dime, whatever it is, or, you know, if you needed to swipe your card and you would then buy an additional five to get up to ten.'",
        "'speaker_2': 'Okay. And we can have, I suppose, the data conversation later. My, my challenge with looking at that data to determine does someone need 5 minutes for an errand or 10 minutes for an errand. I think it like you said, it's not linear and it's sort of a blended average that you will end up with.'",
        "'speaker_2': 'And so I'm not sure that that gives us the most accurate data. My recommendation for our counsel is for the first three months to do the 10 minutes, look at look at the data, and you come back to us with that data and we can make a determination.'",
        "'speaker_2': 'While it is much harder to take something away, I do think from making a change going to a technological change like this and and a fee change or parking meter rate change this might be. A nice amenity for for certainly the residents that have expressed concerns.'",
        "'speaker_2': 'What are your thoughts, Mr. Vodka?'",
        "'speaker_12': 'We'd certainly be willing to do that if that's what the council would like to do. We you know, we'd want to if the council makes that adoption or that motion tonight, the first thing we would do is kind of rerun some of the financial models just to make sure that it that based on the assumptions it'll fit'",
        "'speaker_12': '. And if it does fit, then we'll move forward with that and do it for three months if it for some reason doesn't work in at all and the projections show it may put us in negative, then I think we would need to come back and and get some further directions before implementation.'",
        "'speaker_2': 'And that'll be my caveat to the friendly amendment is it'll be contingent on the staff's assessment of the 10 minutes versus the 5 minutes and if it still keeps us where we need to for the capital expenditures for this project.'",
        "'speaker_2': 'Councilmember Price Are you amenable to that? Yes.'",
        "'speaker_12': 'Vice Mayor So do you want to point out it would result in less revenue for the infrastructure improvements in downtown because that that money comes out of the same pot so we can do the 10 minutes. It may result in some reduced money.'",
        "'speaker_12': 'It won't, you know, just off the top of my head, it's not going to take all of the money. It will just be a reduced amount.'",
        "'speaker_2': 'So we're doing this for the first three months. And then you'll let us know what the cost implications are.'",
        "'speaker_3': 'We'll do. Just three months.'",
        "'speaker_2': 'Okay. Thank you. That's all my comments for now. And I would urge my I would urge my colleagues to support this item. Thank you.'",
        "'speaker_0': 'Councilman Mango.'",
        "'speaker_4': 'Assistant City Manager Modica. Could you elaborate a little bit on the inability to pass on the transaction fee to the consumer? Because for those of you who are about to pay your property taxes, which are due any day now, you can absorb the fee.'",
        "'speaker_4': 'If you choose to use a credit card. We pass that 3% on to the customer and they choose to take that. Additionally, if you pay by check, same with your animal licenses in L.A. County, you pay a certain fee, but if you choose to use it by credit card, we have an agreement with link to govt that'",
        "'speaker_4': 'passes that cost on to the consumer because. The theory is that the cost of maintaining the meters is equal for every resident and every consumer of the space or the dog license or the property. And therefore, why should one taxpayer pay less than another based on their type of transaction?'",
        "'speaker_4': 'Additionally, if we were able to pass that on to the consumer, because these meters are so smart, if it was a dollar and I paid by quarters, it would be a dollar. But if it was a dollar and I paid by a transaction fee, it would be like a dollar five $0.05.'",
        "'speaker_4': 'And since it would be a transaction fee, which is digital, hopefully that would not result in an additional coinage challenge. Thoughts? Anyone.'",
        "'speaker_12': 'So we spent a lot of time looking at this. I will try my first crack at the explanation. It is fairly complicated because you are absolutely correct. There are ways to do it and we actually do certain types of those types of payments as well.'",
        "'speaker_12': 'I certainly learned a lot about this. And if I if I say something incorrect, though, John, growth earlier will help me. We actually do have the same type of fee that you are talking about in the city and we do it for online bill pay.'",
        "'speaker_12': 'And essentially what you are paying is a convenience fee to use a online payment as a method of payment rather than passing the direct transaction fee from the credit cards on to the customer. So we had originally approached it from that approach as can we do the same thing with parking meters?'",
        "'speaker_12': 'And so we reached out directly to Visa and MasterCard and they were telling us what we do in terms of utility billing payments with the county does is a separate issue from passing the direct cost of the credit card transaction fee on to the customer in the manner that we were thinking of doing.'",
        "'speaker_12': 'There are other ways to do it. It becomes very convoluted and complicated. You can raise all rates and then discount for cash. You have to notify if they do a number of different things. But in that, if the intent is to keep the rates low and passing on just the fee, that would defeat the purpose, because otherwise'",
        "'speaker_12': 'you have to raise everybody's rates and then provide a a cheaper discount for cash. So if I if there's anything else to add, please jump in.'",
        "'speaker_4': 'So are you saying that if the rate was a dollar ten but there was a discount for cash, it would be a dollar in coin, but that the rate is a dollar ten per hour.'",
        "'speaker_12': 'That would be one way to approach it.'",
        "'speaker_4': 'Okay. And then to my colleagues, I am very interested in data. I think that there's a lot of value. I'm really excited about our open data and sharing a lot of what we have going on in the city with our residents.'",
        "'speaker_4': 'And I think that if we want to do a real assessment of the impact of the 5 minutes, I think that there's some value in starting with zero and then going to five. And then if you'd like to potentially go to ten, realizing the risks.'",
        "'speaker_4': 'And before you go to ten, you'd already have the data from zero and five. And that variance would potentially give you the output and the challenge of the cost implications to go into ten. And so my friendly amendment would be to do.'",
        "'speaker_4': 'Three months at zero. And then the three months at five.'",
        "'speaker_0': 'Vice President Lowenthal.'",
        "'speaker_2': 'Yeah. Mr. Mayor. Councilmember Mongo makes a very good point. I was just looking at the slide presentation again on some of the detail as well as some of the background information. And I do think it would be more responsible for us to start with.'",
        "'speaker_2': 'Five. I know you've asked for four zero, but start with five. Look at the data. I saw the look of concern on Mr. Marcus forehead, but he didn't articulate it. Sometimes you have to hear what's not being said and and our interest is not to start at a negative.'",
        "'speaker_2': 'And so I will ask I yes, we'll start with five at three months and then reevaluate.'",
        "'speaker_0': 'Next we have Councilman Price.'",
        "'speaker_9': 'I do have a question in regards to that. Mr. Modica, is Belmont Shore in a situation where we could financially accommodate the 10 minutes free because we are not similarly situated to the other areas in terms of our parking meter purpose.'",
        "'speaker_9': 'It's more of a turnover goal in Belmont. Sure. And so for us, you know, we might be able to since you've run the numbers in Belmont Shore so carefully, is that something that we could accommodate? Because my concern with the 5 minutes is there are very few businesses in Belmont Shore where you could go in and really'",
        "'speaker_9': 'utilize that 5 minutes in a meaningful way.'",
        "'speaker_12': 'So what we saw when we ran this and it's in the staff report is we looked at a number of estimates and we're expecting the 5 minutes free in downtown Belmont, sure. To cost about $25,000 in just roughly.'",
        "'speaker_12': 'Looking at it and give some numbers in year two, Belmont sure would have $132,000. But in year three, there would be 23 million, $23,000 in net excess. And so in that scenario, let's just say the 5 minutes free were to double.'",
        "'speaker_12': 'You would be okay in year two, but you would go negative in year three, you would go positive in year three four and then back a little bit below. That's not to say it can't work. But you know, there's also the fun balance that Belmont, your parking commission has that is different than in Belmont Shores.'",
        "'speaker_12': 'So if you wanted to allocate additional, you know, a fund balance to cover that for a certain period of time, that would be a financial that would be a financially responsible way to approach it as well.'",
        "'speaker_9': 'You know, I'd like to before talking on this item any further, I'd like to hear from the public in terms of public comments. I know there are some folks here who might have something to say about that, but would that be an option for us as maybe to do something different in terms of that, the free time'",
        "'speaker_9': 'that would be different in the shore as opposed to downtown?'",
        "'speaker_12': 'That's entirely a policy question in the council. There's nothing prohibitive from the technology side of things. As long as the finances and the fund balance were there, you would just have to allocate some of that fund balance to ensure that you wouldn't go negative during the time that you're that you're piloting this.'",
        "'speaker_9': 'Okay. Have no further questions.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'I'm going to make some comments before we go to public comment. And then, Councilman Gonzales, do you have additional comments as well? Okay. Why don't you go ahead and then I'll close.'",
        "'speaker_9': 'And I wanted to take it a little bit further. I know, Tom, don't give me any bad looks, but I know we talked about this in the beginning with even a removal of the parking meters, the ones that were not making any money.'",
        "'speaker_9': 'Because I know historically, you know, living personally, living along pine, but also knowing that some meters just don't even generate any revenue at all. It's just it's pretty poor. I just want to make sure that we keep that in our and our on our radar.'",
        "'speaker_9': 'I know I had discussed that with you beforehand, but if there's something some data that comes back and says these aren't even efficient, even for maintenance purposes, I mean, that would be something we could look at as well, correct?'",
        "'speaker_12': 'Absolutely. That's going to be part of our review. The beauty of the sensors is they will tell us when people are parking there during hours and whether they're paying. They also will tell us when people are parking there and not even when they're not being enforced.'",
        "'speaker_12': 'So if we see meters that are losing money on it, we will will definitely look at removing those and maybe placing them somewhere else or just getting rid of them altogether.'",
        "'speaker_9': 'Okay, great. Thank you.'",
        "'speaker_0': 'Great. Thank you. We're going to go to the public here in just a minute. Just a couple of comments and then Mr. Modica, then a question for you. I want to make two sets of comments. The first is about the technology, and the second, it's about the rates, which has been part of the larger discussion.'",
        "'speaker_0': 'But the first thing I want to say is I really want us to just commend city staff, the group involvement or the parking commission deal, a hope to the DRC, all the residents who have been involved in this process.'",
        "'speaker_0': 'This is when you think about this, we're upgrading a major system in the city. This is creating a government that is more responsive to the 21st century. It's technology, it's data collection. This is exactly the type of investments that we need to be making and to ensure that we are a city with all the amenities of a'",
        "'speaker_0': 'big city and being are the two areas of the city that have parking meters. I think to go to smart meters, I've been lamenting not having smart meters for years. I've been using smart meters in every other downtown oceanfront in every other city.'",
        "'speaker_0': 'And we've been a little bit behind, but we've been doing also our research, our due diligence on the issue. And I want to thank all those groups. I want to thank Vice Mayor Lowenthal, who's been kind of leading the charge on this issue for for many years.'",
        "'speaker_0': 'And also just a few things. Also, Tom, on the rate issue one, I do I think it's great that downtown has the two out of three lots. I think that needs to continue. I also want to make sure that at the six month review, we review two things that you and I have discussed before when I was'",
        "'speaker_0': 'on the council. One is looking at areas, particularly in the northern part of downtown, where you have meters in neighborhoods that have developed to a place where they're no longer business districts. So example, you have streets on Pacific Avenue that have no businesses that have parking meters in front of residences.'",
        "'speaker_0': 'And at time there may have been business on that street, but as as have been developed into residential corridors, there's no longer the need for those meters. And so it's I think it's it's hard to have a street with all residential homes and parking meters.'",
        "'speaker_0': 'And so I think we need to evaluate at the six months and and I know that part of this is ensuring that we can pay for this. And so if if we get the data back, we need to evaluate which parking meters, like Councilman Gonzales said, are are obsolete.'",
        "'speaker_0': 'In addition to that, I want as part of the six month, I would like to request that we also look at what is what you can what we consider the downtown core versus the downtown. Because if you look at the map, the what we consider the downtown core, which is the red, if you can put slide number'",
        "'speaker_0': 'seven up on the screen real quick. If you look at this map, this is this has been a map that we've used for a while as far as what we consider the downtown core versus the downtown from a from a parking rate point of view.'",
        "'speaker_0': 'And it may be and I don't mean I don't know this to be the case, but we should look at it. It may be that portions of it's what currently are the downtown core should have a downtown rate because of the usage.'",
        "'speaker_0': 'And it may be that there may be a street or two that are considered the downtown that should be considered the downtown core because of usage there. There are there are areas of that are currently in the blue section of the downtown that have very high use.'",
        "'speaker_0': 'And there are some areas that are in the red that have very low use. So if at those six months, those two items can also be reviewed, I think that's an important piece piece of all this as well.'",
        "'speaker_12': 'Absolutely. We can look at both of those. And that's what that's really the benefit of the data. So, yes, we'll have a lot of data to look at and make some good decisions about what is appropriate and what the appropriate rate and locations are.'",
        "'speaker_0': 'And I know there's an I that's that's been a request. I know that some of the neighborhood groups have submitted in the past to the city. And so I just want us to revisit that as well. So with that, let's go ahead and open this up to to public comment.'",
        "'speaker_0': 'So please come forward and introduce yourselves for the record.'",
        "'speaker_3': 'Greetings, Mayor. Council members and members of staff. My name is Eric Ray and I live at 133 Promenade Walk in the second District on the incoming vice president of the Downtown Residential Council. And I'm a member of the historic Pine Avenue Business Association, which is HOPER encompasses many of the businesses on Pine Avenue from First Street, and'",
        "'speaker_3': 'many of the businesses are North Third Street. Well, I support the installation of smart meters due to the ease of use factor for the customer experience and being able to use credit cards. I think it's unfair that the entire downtown core will be on a full dollar 50.'",
        "'speaker_3': 'I believe the downtown core should be set at a dollar so that we're more competitive with Belmont. Sure. To be clear, the proposal states that Belmont Shore will be at $0.75. The downtown periphery will be it will be a dollar.'",
        "'speaker_3': 'And that includes the East Village and the downtown core will be at a dollar 50. If you look at the map, the downtown core includes some of the economically developing parts of downtown, such as Pine Avenue, north of Third Street, seventh Street, between Pine Avenue and Long Beach Boulevard and so forth.'",
        "'speaker_3': 'This includes many of the small businesses who took a risk in Long Beach and are more vulnerable due to the higher parking meter prices outside their businesses, which deters customers. 5 minutes free is a nice gesture, but will hardly buy time to buy a cup of coffee at Starbucks or let alone a sandwich across market.'",
        "'speaker_3': 'Well, I understand that there's a city place parking garage with two free hour parking. Many people feel it is an unsafe parking garage for a variety of reasons, which includes lack of security on the blue line and many calls for police in that section of downtown.'",
        "'speaker_3': 'I asked you to think about the Long Beach customer experience when making your decision. I asked you to put yourself in the shoes of a consumer who visits Pine Avenue, but is met with empty storefronts and expensive parking meters, which also have sensors that reset when a car pulls away.'",
        "'speaker_3': 'In addition, lots of data shows that cost of living has gone up for individuals and families, but wages haven't. The proposal before you does offer some good suggestions with revenue projections. However, part of the solution is to consider that not all parts of downtown are economically sustainable.'",
        "'speaker_3': 'Yet we need to compromise. Thank you.'",
        "'speaker_0': 'Thank you, Eric. Next speaker, please.'",
        "'speaker_5': 'Mr. Mayor. Members of the city council. I'm Joe Ganim. I'm president for another 30 days of the downtown residential council. And I'll be more than happy to give that position to Mike Dunphy. We had the pleasure of having Tom Mollica and Sharon at our forum, and they made a presentation.'",
        "'speaker_5': 'We had a packed house. I think most of the comments were very positive. I didn't hear anything and haven't heard anything in a negative sense about this idea at all. I have some personal comments, however, to make in a question to ask.'",
        "'speaker_5': 'First of all, I finally get to retire the little lime green coin purse that my wife bought me to put in my nice black macho jeep. Somehow it never fit and twins are a real nuisance. But on the other hand, the first three months that I bought, first two months that I was here, I had the pleasure'",
        "'speaker_5': 'of contributing to the city's coffers by the tune of about $90 for parking tickets. So I. The purse wasn't such a bad thing after all. The other thing is I heard about Apple Pay. However, I was listening carefully and perhaps I missed somewhere, Mr. Mayor, about the ability for the smart meter, if you will, to inform the'",
        "'speaker_5': 'person who's parked there when their time was about up, or in fact, whether or not they could use an app to not only pay for the meter, but at least re-up the meter if that was an availability through the application as opposed to, you know, you get to pay for it, but you don't know when for sure'",
        "'speaker_5': 'it's going to expire unless you've set a separate app to let you know when that's going to happen. So it would seem to me that that would be a real convenience. I know that if we're sitting down, enjoying ourselves, having dinner or something, and maybe the service has been a little late getting to us and we've got'",
        "'speaker_5': '10 minutes left, but we are not aware of that. The convenience of using the credit card then is obliterated by the fact that we get back and find out that we've been ticketed because we didn't know the meter ran out and we should have been able to do that.'",
        "'speaker_5': 'So I appreciate all this effort on technology. I think is is a great idea. My own thoughts about the rates is, quite frankly, I think most of us really concentrate more on being able to get a parking space and being able to pay for it efficiently.'",
        "'speaker_5': 'I don't know about others. Maybe I'm a little different, but I frankly, in most cases than the smart meters, but the maximum amount because I have no idea how long I'm going to be available. And so whether or not I'm saving a nickel, a dime a quarter or $0.50 a dollar, you know, I mean, at the end'",
        "'speaker_5': 'of the day, we're probably going to spend a great deal more money, whatever we're doing after we park than parking. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Mr. Mayor, City Council. My name is Michael Wylie. I live at 638 Pacific Avenue. I'm also the president of Sam Co Corporation. We own approximately a block in North Pine apartment buildings and about 50,000 square feet of commercial space.'",
        "'speaker_5': 'Tonight, I'm in regards to the parking in North Pine.'",
        "'speaker_8': 'The mayor mentioned North Pine.'",
        "'speaker_5': 'There's a lot of empty parking spots up there. In fact, about three or four years ago, I did a survey up there in which we audited the parking spots. And it looks like from our study, the area between 6/8 Pacific and locus generates about $50 per meter per year.'",
        "'speaker_5': 'And I think what the meter is, 425 bucks. So quite, quite a long payback on that.'",
        "'speaker_13': 'So anyway, that's all I wanted to say. Thank you all very much. Thanks.'",
        "'speaker_0': 'Thank you, Mike. Next picture, please.'",
        "'speaker_7': 'Dennis Dunne. This is sour grapes. I know. But if we had built a swimming pool, we'd have 128 free parking places and won't have to worry about $0.50 extra charges for the consumer. Marketplaces would be available. Well, the pool has been set in concrete and the wheels are in motion.'",
        "'speaker_7': 'So let's go from there. What is the problems with this new parking meters set up? I think there are seven problems. That. That signal disaster. First, business revenues would go down because people would not be going into the stores to get change.'",
        "'speaker_7': 'They are more apt to buy something in the store if they go for change rather than to have a credit card. Put it in the machine, check it. More credit cards. It's a jungle. Why more credit cards? We have enough credit cards now.'",
        "'speaker_7': 'People are in debt because of credit cards. How are you going to keep track of the cost? It's staggering the amount of burden you will put on the person. Third. More. There'd be more overpayments with credit cards than if you didn't have credit cards.'",
        "'speaker_7': 'Because it's like magic. You get a gift, a parking place, and there's no exchange from your wallet with money to the meter. It's just magic. You slip a card in the machine's mouth and it feed you a free parking place, it seems.'",
        "'speaker_7': 'But nothing's free. It's going to cost you a lot more money because of overspending, because they won't be aware of the expense so much. And. Fix the costs of maintenance machinery we're talking about. You have to you have to maintain it to its prime order.'",
        "'speaker_7': 'That's going to cost money. The maintenance of these machines that are so exotic, you give credit cards. Seventh. There will be a black market in credit cards. There's no real stoppage. Of of thievery and of a black market that would be initiated.'",
        "'speaker_7': 'There's no real guards with the credit card system. Those are the points I'd like to make, and I'll leave it up to your consideration.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_13': 'Good evening, Mr. Mayor. Members of the City Council. My name is Craig Cogen with the downtown Long Beach Associates. I first want to thank staff for the incredible work that they've done in preparing this information. I don't know if it was the mayor or ourselves who really were in a race to get new technology in our downtown'",
        "'speaker_13': '. We've been asking for it for a couple of years now, and we finally are able to look at really the benefits that this will provide. And I think it's important that although DARPA is supportive of a staff recommendation, that the technology and the rate adjustment does not equal unconditional support, that our support does come with those conditions'",
        "'speaker_13': 'that we have. We have requested and submitted to city staff and it's included in your packet. We have about 11 recommendations that we hope to be able to implement in a very systematic, strategic and chronological timeline. But again, it looks we look at the technology, we look at the convenience, look at the visitor friendliness, and it's sometimes'",
        "'speaker_13': 'the parking is the first and last impression that one gets in their business corridors. I think we have to be cognizant of that relative to data collection. I don't think this proposal would be worth the wait if it did not include the sensors without the data that that it will collect.'",
        "'speaker_13': 'We cannot go forward by making rational and smart decisions on how to utilize the parking that exists in our downtown or in Belmont Shore. And I want to thank the vice mayor and Councilmember Gonzales and their recommendation directing city manager to look at the off street parking issues in our downtown relative to the parking lots and city'",
        "'speaker_13': 'place parking. It does need better maintenance. It does need stronger security. It needs to be maintained on a regular basis. And we're looking forward to working with staff and certainly with city council on those issues and certainly be able to provide any of the support and support and and and offered the opportunity to create that opportunity when'",
        "'speaker_13': 'it comes to providing that service for the parking lot. So anyway, again, thank you. City staff did an incredible job in presenting that to us and look forward to the support here tonight. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Hello. My my name is Celia McGill. I live in a I have a living you in me like 20 C 27 and living in and Pacific and twenties in 15 in the poor me maybe, but it is very good to see the those mirrored.'",
        "'speaker_1': 'But right now in this moment I'm in scary you know y because I live in over there in Pacific in 15. And in one building apartment on them is Pacific Theater like. And we can we have a something we have more space to partner the car.'",
        "'speaker_1': 'Now we are looking for around in the ground up there here. I'm going to I'm going to looking for one place where I'm going to leave my car. Why? Because I have more space and then maybe some some pencil than going to say Oprah specific.'",
        "'speaker_1': 'The lady parking space. Yes, but only two in 9 a.m.. Single and single woman with three, three busy, busy students, one in in lobbies, in university lobbies, and another 10 million, obviously. And they are they are very busy in item mobile to give them a right.'",
        "'speaker_10': 'Also.'",
        "'speaker_1': 'I also am very busy to enable in my community and different activities. And then for me without it for me is not working, maybe is very good for business, for places, for recreation areas, but no where to place away the cable building like I told you place too late tomorrow the sweeping will pass maybe to then going'",
        "'speaker_1': 'to sleep in my car if I if I am going to park my car and for my in my room, I am going to sleep in my car and wait until they are sweeping bus even though I am going to looking for around to to find one place where I leave my car then well, we need maybe'",
        "'speaker_1': 'we need those, those meeting in recreation areas where maybe in in something you you know, your city, you know what, what, where we need up. But maybe over the Pacific Pacific in 15. We don't need it. We need only one place where we can to borrow or car because nobody is too many cars.'",
        "'speaker_1': 'We can MySpace where we can to park or something. I see some person they pay $1 to summer a liquor stores to live Berkeley car over there. But they need to pay like a one day or three days before they call somebody because we can find one a space where we're going to leave the car away.'",
        "'speaker_1': 'Because if not, then what are we going to. We're going to find one ticket for last week. Okay. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please. This is our we have a link. Lisa is next and she'll be our last speaker coming off the speaker's list. Go ahead.'",
        "'speaker_6': 'Yup. Thank you very much, Mr. Mayor. Bill or beer bill? Much for parking commission. I'm the current chair. Start off by some big thank you's. Member Price did a great job looking at this and reviewing it and I really appreciate the effort you put into it.'",
        "'speaker_6': 'Staff did an amazing job too. I really appreciate all the work that Mr. Motoko did and the outreach that he did with the community in particular. I want to throw a shout out to Craig and his group. They really looked at it well.'",
        "'speaker_6': 'They made a number of suggestions that I know us and make sure would like to. So the debate did a great job on their task force. So thank you also. There were some comments earlier about the disparity or the difference between Belmont Shore and downtown in other areas.'",
        "'speaker_6': 'And I just like to focus on a couple of quick things. Now, Mature has always had a lower parking rate than downtown or any other area, and that's for many of the reasons that Member Price mentioned. But I think what wasn't mentioned is, is probably the most important reason, which is we don't have meters in Belmont.'",
        "'speaker_6': 'Sure. As a revenue source they they were never installed for the purpose of creating a new revenue source. They were originally installed to pay for a couple of parking lots. I remember my dad telling me that 20 years ago that when the parking lots were finished being paid for, they were going to take them out.'",
        "'speaker_6': 'Well, obviously that didn't happen, but we use them now to turn over parking. The purpose of the meters in Belmont Shores to help us make parking available to other people. Not not as a revenue source. Councilmember Mongeau made a couple comments about the merchant agreement and the convenience fee, and we strongly support that idea and I'm not'",
        "'speaker_6': 'sure for some of the same reasons that she was mentioning. I personally don't think it's fair to force the cash paying consumer, which is generally some of the older consumers. And I'm starting to get into that category to pay for the convenience of somebody that wants to use a credit card.'",
        "'speaker_6': 'You're basically disproportionately charging one group for the other group's convenience, and that's just not fair. I realize that, you know, it's the wave of the future, but I'd like to see you guys ask city staff to look at that merchant fee and see if they can, you know, make a change to that merchant fee in the future'",
        "'speaker_6': '. So we could have a convenience fee. The data, as Craig was mentioning, is probably the single most important thing here, in least in my personal opinion. Without it, we can't look at, you know, rate structures. We can't look at the time, the amount of time we allow people to park.'",
        "'speaker_6': 'And since I'm not sure it is really about turn over, that data, I think will be tremendously useful for us. So we really, really while the commission didn't necessarily support the idea for a cost issue with the sensors.'",
        "'speaker_6': 'I am glad that you are looking at it and I hope you guys will pass this with sensors everywhere. Regarding the the five minute free period. Sorry, Bill. I'm sorry. Yeah, it's okay. One question. The fund balance. How will that work?'",
        "'speaker_0': 'Tom Bill, just so you know, you know, just the rules of the rules so the council can ask questions. But thank you so much. And maybe that might get asked by a council member. So thank.'",
        "'speaker_9': 'You. Hi, Lisa.'",
        "'speaker_4': 'Ramla, lifelong Long Beach resident, and I'm also a member of the Belmont Shore Parking Commission. And since Bill already did the thank yous, I'll pass on that part right now. I just want to comment on the five and ten minute idea that came forward.'",
        "'speaker_4': 'I understand that people are against the looping, which is the resetting of the meter. So I guess that's where maybe this came up. But I agree that 5 minutes really isn't enough to do an errand. And I feel like 95% of the people, probably 98%, won't know about the green button.'",
        "'speaker_10': 'They'll just go up and put money in or swipe their card.'",
        "'speaker_4': 'And if they do know, I think it'll cost so much confusion of, oh, 5 minutes. Okay, 5 minutes free. I'll pay for.'",
        "'speaker_10': '55. How do I do that?'",
        "'speaker_4': 'Or they won't know. Then I'll find out 3 minutes, three months later and say, How come no one told me? Because as much outreach that you did was which was wonderful time at all the meetings, everything we went to, I still would read so many letters in the Guardian Gazette.'",
        "'speaker_4': 'They had so much misinformation. I couldn't believe it. And I just think they were opening up a can of worms to do the five minute, ten minute mark. I know your offices don't want to get calls from angry residents about the looping and all that, but I just think you're opening a huge can of worms to do'",
        "'speaker_4': 'that. So that would be my thing was to pass on that. Thank you.'",
        "'speaker_0': 'Okay. Thank you. We've close the speakers list. We're going to go back to Councilwoman Pryce and the motion by Councilman Price and Lowenthal.'",
        "'speaker_9': 'Councilman Mr. Modica, how will the fund balance work?'",
        "'speaker_12': 'So Council member and Mr. Livia. The way that it'll work is you essentially have a pretty healthy fund balance right now in the park and it's city funds but it's it's dedicated for parking. Commissioner for the parking issues down in Belmont you're essentially our financial management department would just ensure that there is a healthy enough fund balance'",
        "'speaker_12': 'to cover any type of potential decrease the the 25 cent rate increase actually was was not an easy thing to do we had to make sure that there was going to be funds available because we're taking a little bit of a risk.'",
        "'speaker_12': 'So if if our assumptions are incorrect and the costs are higher than that, we're saying for at least one year have some cash available to cover that so that it's never negative then. And we just wouldn't allow the commission to spend that money on something else for that year period.'",
        "'speaker_12': 'Then we would reassess next year. We're hoping it's not necessary, but then next year you'd have to potentially do another 25 cent rate increase if our projections aren't what we expect them to be.'",
        "'speaker_9': 'But our projections are fairly conservative, correct?'",
        "'speaker_12': 'They were very conservative under the 50 cent. They are still somewhat conservative under the 25 cent. But again, the variability is is so hard to predict. If people start using the credit card a lot, the costs will go up.'",
        "'speaker_12': 'And it could be that we you know, they don't use it nearly as much and you have more more funds available.'",
        "'speaker_9': 'Regarding the convenience fee that Mr. Lorber was talking about, is it possible for staff to consider that option in the future? As we renegotiate those merchant agreements.'",
        "'speaker_12': 'We're happy to look at those agreements and talk to the banks about them. And so that can be something that we look at. My understanding is it is not a city of Long Beach issue with our in our contract.'",
        "'speaker_12': 'It is more of a global Visa and MasterCard. But we'll keep our eyes open if there's changes in the future. Again, you know, convenience fees can be charged in a number of different ways. You know, we did look at that to see if any other city has found out how to do them.'",
        "'speaker_12': 'And none do in California all 25 that we looked at don't of cities. But I believe one city in the nation does do a convenience type fee. And so we can we can continue to look at that.'",
        "'speaker_9': 'In terms of the 5 minutes free. If we were to opt out of that, would we get anything back like a ten cent rate increase as opposed to a 25 cent rate increase?'",
        "'speaker_12': 'I guess technically you could go back in and change the the the fee. I think a 65 cent fee for parking might be a little odd. It's a little nonstandard, but I suppose anything's possible.'",
        "'speaker_9': 'And at this point that 5 minutes is being recommended to ensure consistency throughout the city and also some show some goodwill.'",
        "'speaker_12': 'Correct.'",
        "'speaker_9': 'Even if people don't use it, if we opt out of it, at least according to staff's recommendation, we don't really get any benefit in terms of a reduced rate increase at this time.'",
        "'speaker_12': 'And could you restate that?'",
        "'speaker_9': 'Sure. If we opt out of that five minute option, there's no proposal on the table that would reduce the rate increase.'",
        "'speaker_12': 'No, not at this time. We were looking to do rate increases typically happen in round numbers just for that and the way that they calculated. So we were we would either we would do the 75 cent rate increase.'",
        "'speaker_9': 'So thank you.'",
        "'speaker_12': 'Or a 75 total rate, not a rate increase.'",
        "'speaker_0': 'Okay, great. So we're going to go to a vote now. And I just want to make sure that we understand the motion that's on the floor and the motion on the floor, which was by price. Lowenthal was to approve staff's recommendation.'",
        "'speaker_0': 'As presented with the at the five minute free. Correct. Okay. And that's inclusive of all three motions.'",
        "'speaker_3': 'And Mayor.'",
        "'speaker_5': 'We'd need a separate vote. We'd need a first vote would be on the resolution authorizing the city manager to execute the contract with IPC Group. That's that would be the first action by the council. If that motion passes, then we would go to the second item to adopt the resolution establishing the new parking rights.'",
        "'speaker_0': 'Right. So we have we have the first price. Lowenthal made the motion for the first for the first one. Members, please go and cast your vote.'",
        "'speaker_1': 'Motion carry eight zero.'",
        "'speaker_0': 'Thank you. Could we get a motion for the second one?'",
        "'speaker_2': 'So move.'",
        "'speaker_0': 'Second. Okay. There's been a motion and a second member. Please cast your votes.'"
    ],
    "Revisions to the Downtown Dining and Entertainment District and Related Ordinances.": [
        "'speaker_1': 'Item 26 is a report from Development Services and Financial Management. Recommendation to approve the recommended revisions to the Downtown Dining and Entertainment District. And request city attorney to drive an ordinance amending the Long Beach Municipal Code related to the downtown dining and Entertainment District.'",
        "'speaker_1': 'And the definition of nightclubs district to.'",
        "'speaker_5': 'Mayor councilmembers. I'm going to turn this over to our development services director, Amy Bodak, and also Rachel Tanner.'",
        "'speaker_9': 'Mr. Mayor. Members of the City Council. I'm going to ask Rachael Tanner to start.'",
        "'speaker_4': 'With an overview of the process and the staff report on the policy recommendations. And then Rachel and I are available to answer specific questions you might have. So with that, I'm going to start with Rachel.'",
        "'speaker_9': 'Thank you. Good evening, Mayor. And members of the city council. As you may know, the downtown dining and Entertainment District is an area in downtown bounded by Third Street and Ocean Boulevard to the north and south and Pacific and Long Beach boulevards on the east and west.'",
        "'speaker_9': 'It also includes the Pike and Shoreline Village.'",
        "'speaker_4': 'The council piloted the district in 2005.'",
        "'speaker_9': 'And then established it on a permanent basis in 2008. By doing so, they instituted consistent operating conditions for businesses with entertainment permits. In August of 2013, the City Council initiated a one year.'",
        "'speaker_4': 'Moratorium against the issuance.'",
        "'speaker_9': 'Of entertainment permits in the district for businesses with a Type 48 ABC license. The city's council directed the city manager to use that pause to evaluate the entertainment permit policies and to engage downtown stakeholders in this evaluation. As part of that, a task force was formed.'",
        "'speaker_9': 'Several the members are here this evening and participated in the evaluation. Earlier this year, the City.'",
        "'speaker_4': 'Council extended the moratorium for six months.'",
        "'speaker_9': 'To allow that stakeholder task force to conduct public outreach and engagement. The engagement included two public forums in August and October, two meetings with the LBA executive committee and submission of comments via email from the public. On November 12th, the task force in city staff met and reached a consensus on the recommendations that we're presenting tonight.'",
        "'speaker_9': 'The recommendations are meant to encourage residential development, as well as dining and entertainment. They safeguard both the quality of life for residents, while also providing clarity and predictability for business owners. Recommendations cover four broad areas entertainment permit processing, standard conditions of operation enforcement and items for future consideration.'",
        "'speaker_9': 'Regards to permitting, we recommend a process that proactively addresses quality of life issues such as loud music. To do so, we recommend following the downtown plan, which currently requires nightclubs to obtain a conditional use permit and an entertainment permit.'",
        "'speaker_9': 'However, as of today, there is no definition of nightclub in the municipal code. We believe nightclubs should be clearly defined in the code, and we recommend defining it as an establishment that has a Type 48 ABC license and an entertainment permit for music and dancing.'",
        "'speaker_9': 'Secondly, we recommend creating an enhanced entertainment permit that would be applicable to the district. To take this permit, applicant must was conduct a sound attenuation study to prove the sound emanating from their establishment and doesn't violate the city's sound ordinance.'",
        "'speaker_9': 'Or applicants can apply for a waiver from this requirement by one either indicating or demonstrating that they've used sound mitigation practices in the build out of their space, or illustrating that entertainment was previously permitted at the location without any incident.'",
        "'speaker_9': 'The requirement would apply to first time or change of owner applicant. Current entertainment permit holders today would only be subjected to this violation or this requirement if they become deer tiered due to sound violations. We also recommend modifications to the standard conditions of operations.'",
        "'speaker_9': 'Several of these are minor modifications designed to bring the conditions up to date with current entertainment permit practices. Among the more significant changes we recommend permitting outdoor amplified music, including rooftop entertainment in the district. Outdoor entertainment would be allowed from Sunday to Thursday from 10 p.m. to 10 p.m. and Friday and Saturday from 10 a.m. to midnight'",
        "'speaker_9': '. We also recommend making the standards clear to business owners by codifying the conditions in the municipal code. Currently, the conditions are an attachment to the code and are not easily found by potential applicants. Enforcement is another piece that we examine and it's really critical to the success of the district.'",
        "'speaker_9': 'We recommend maintaining the hearing system while enhancing enforcement through additional outreach.'",
        "'speaker_4': 'Under the taring system, a.'",
        "'speaker_9': 'Permit who violates the conditions of operation is subjected to progressively more stringent regulations. The system has proven very effective in changing the behavior of entertainment establishments or revoking their entertainment permits when necessary. In addition, the Vice unit will establish a community liaison who can respond to complaining parties seeking to ascertain the outcome of a complaint, as well'",
        "'speaker_9': 'as report to the downtown community on incidents that have occurred and how the police have responded to these incidents. Finally, there are three recommendations related to future action. First, when the new conditions have been implemented for at least six months, the city staff and task force should reconvene to evaluate the program's effectiveness.'",
        "'speaker_9': 'Second, we believe the boundaries should expand, however, only after an engagement process that intentionally includes residents and business owners from proposed expansion areas. The process should take place after the recommended changes have been in place for at least one year.'",
        "'speaker_9': 'Finally, the impacts of bass sound on the quality of life in downtown came up often in our discussions. Modifications to the sound ordinance, though, are beyond the scope of this task. The city council could, however, take future action, adding standards for bass sound to the city sound ordinance.'",
        "'speaker_9': 'This concludes my report. And I'm available to answer any questions.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I wanted to thank the staff for their work on this. I know we've spent a lot of time on the dining and entertainment district permitting process since its inception a very long time ago. And I'd like to thank the mayor and the council as well for taking this item up earlier than originally planned'",
        "'speaker_2': '. I see a few members of the task force that are here, and I'd like to thank the entire task force for their commitment and passion to improve the downtown. City staff Rachel Tanner, in particular, thank you very much for your hard work and your diligence on this item.'",
        "'speaker_2': 'And I wanted to express my appreciation to the downtown Long Beach Associates and community members for their interest and suggestions all along the way. These recommendations that Mr. Tanner summarized, I believe, strike a compromise between the business and residential communities.'",
        "'speaker_2': 'For many years, well over a decade, we have tried valiantly, and I believe we've been successful with the help of community members and businesses to identify the downtown as not only the economic heart of of the downtown, the Long Beach overall, but a neighborhood as well.'",
        "'speaker_2': 'And I do believe that striking this balance between the business and residential community speaks to that effort and speaks to that goal. I'd like to note that the task force was keenly interested in making sure our overarching request, particularly my overarching request to encourage good actors and discourage bad actors, was carried out.'",
        "'speaker_2': 'I know that that's an interest that many of us had. We've observed that when left, left without any guidance, that naturally does not emerge. And so to be able to have a structure that encourages the good acts of those and and discourages the bad acts of others, I believe is healthy for our downtown.'",
        "'speaker_2': 'The dining and entertainment district ordinance is a living document and it'll require updates from time to time. Hopefully we wouldn't have to put this much time into it in terms of bringing forward recommendations, but I do think this is worthwhile and all the time that you've spent for this effort is worthwhile.'",
        "'speaker_2': 'Our downtown's changed since the original dining and entertainment district conditions were established. I remember attending pilot meetings in 2006 and I know that we have changed significantly since that time. We have more residential units and higher expectations, certainly from our downtown stakeholder.'",
        "'speaker_2': 'And what I believe is that this ordinance will make our application process more predictable for new businesses. We want to have a predictable process, whether it's for businesses or residents or visitors, but particularly in this case, this will add to the predictability, more flexibility for current operators and more responsive to residents looking for enforcement of bad actors'",
        "'speaker_2': 'or bad choices that are made. So with this council members, I urge your support. Many of us, including Councilmember Gonzalez and council and Mr. Mayor, when he was a council member, we have worked for many years to ensure that the community is part of this process, that the business community is part of the process of this, as'",
        "'speaker_2': 'well as the stakeholders. And all of us have been at this for a very long time, and I believe this is an amazingly good product that we've all delivered together. With that, I urge your support.'",
        "'speaker_0': 'Can I get a second on that? Kim's been in motion in a second. Any public comment on the item? Scotian.'",
        "'speaker_13': 'Thank you, Mr. Mayor. Members of the city council, Craig Cogen with the downtown Long Beach Associates. I first of all, first of all, I want to thank the vice mayor for her leadership and in engaging and introducing this process a year and a half ago.'",
        "'speaker_13': 'It has been a very good learning process. I think we've been able to better understand the growth of our downtown, balancing the needs of our downtown. And certainly this process has been a very healthy discussion. So again, thank you very much for that.'",
        "'speaker_13': 'And we're supportive of all of the issues that have been addressed in the recommendations. I think the only concern that we have and the downtown task force is it's to be commended, as well as city staff that have done who have done that have done an excellent job in addressing the ambiguities and the vagueness that exists in'",
        "'speaker_13': 'the existing document. And we want to clarify that the only outstanding issue that we have is really the sound attenuation study that is going to be required of new permittees. And we're still a little concerned of what that process looks like, what those conditions of sound mitigation may be, and what really what those proposed cost would be'",
        "'speaker_13': '. And those proposed costs vary from a depends on who you consult with some really. I would like to a little bit more certainty if we're talking about clarity and certainty. I would like to remove some of the uncertainties that may be surrounding that part of the process and get more clarity on that.'",
        "'speaker_13': 'Other than that, we're very supportive of this process. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, mayor and city council.'",
        "'speaker_13': 'My name is Eric Carr live at 133, the promenade, which is right in the heart of the entertainment district. I am the past president of downtown residential council.'",
        "'speaker_3': 'And I.'",
        "'speaker_6': 'Have the.'",
        "'speaker_13': 'Privilege of being a task force member on the Entertainment District Task Force.'",
        "'speaker_6': 'As want to comment on how you can comment on the work of the task force with the support of the.'",
        "'speaker_13': 'Subject matter experts from the city staff and that to vice mayors.'",
        "'speaker_6': 'Lord last point. I think the.'",
        "'speaker_13': 'Group has come to a good compromise with businesses and.'",
        "'speaker_5': 'Residents to strike that happy medium that will.'",
        "'speaker_6': 'Support a really thriving.'",
        "'speaker_5': 'Mixed use environment.'",
        "'speaker_13': 'Downtown. And I just want.'",
        "'speaker_6': 'To give my humble recommendation to the council to support this in the next phase as well. Thank you.'",
        "'speaker_0': 'Next week replace.'",
        "'speaker_9': 'Hi, my name is Laura Cameron and thank you Mayor and council members. I was fortunate enough to serve on the task force. Thanks, Vice Mayor. Low and fall. And it's been it's been a long road, but it's been a great road to kind of bridge the needs of both the residential and business communities to come up with'",
        "'speaker_9': 'these recommendations to really develop a kind of fruitful entertainment district. I think what was key to what Rachel and Vice Mayor Lowenthal pointing out is that the recommendations really create that predictable environment that really shifts us from a reactive environment to a proactive environment.'",
        "'speaker_9': 'So with that said, I really hope that you guys take our recommendations and move them forward.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_5': 'Mr. Mayor, members of the City Council, I'm Joe Garnham. I too am a member of the task force. I would like to know why the city manager thought I had knowledge of nightclubs, but I guess the word must have gotten out anyway.'",
        "'speaker_5': 'It was it was a great process. We had a lot of good discussion back and forth. The interesting thing is, I think most of us believe that now as the current time frame, we really don't have the kinds of issues that had occurred prior and time when Vice Mayor Lowenthal brought up the issue.'",
        "'speaker_5': 'The key was how to keep it that way. And now we've got some good actors, as she calls them. And we want to keep it that way. And we want to give credit to those businesses that have invested their time and their energy and their money in providing a really good product to create and sustain the vibrancy'",
        "'speaker_5': 'of downtown. So the standards are not particularly easy. It means that somebody is going to come do Long Beach needs to be serious about it and they need to put their investment in and and be a good business.'",
        "'speaker_5': 'It also means that the existing businesses are going to be supported by other good businesses. So we have the right combination. You know, there is one thing that we couldn't cover, and I think it deserves to be mentioned here.'",
        "'speaker_5': 'And that is the key to all of this in the future. Not particularly. Now, as we ramp up and see other as this ordinance takes place and new businesses come and take a look at our city. But the key in the future is going to be our ability to enforce it, our very own.'",
        "'speaker_5': 'And that's currently reliant on the police department and the city health department with their noise and nuisance abatement issues. I think that what we're going to have to see in the future is some means by which to recognize that perhaps neither one of those departments are really adequately established to manage this issue properly.'",
        "'speaker_5': 'I'm not giving any any I'm not saying anything bad about the way they are currently. But I think as we see more of these businesses come in, we're going to need to have more attention to the enforcement part.'",
        "'speaker_5': 'We've tried to do a lot of it by ordinance. We hope we're going to have the kinds of businesses come in. But in the end, our ability to enforce this is going to help ensure we maintain that level of quality business in our community that the businesses and the residents can live in, and genuine security and safety'",
        "'speaker_5': '. And all of us have a good time. I urge your support for this. I think it's a really good start and look forward to anything we may do in the future to improve it. Thank you.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_9': 'Reading Mayor Council members. My name's Katrina Harding. I am also a task force member. I would just want to say that I think it's a great compromise between business and residents. The task force came up with from the recommendation and through the great dedication of Rachel Tanner.'",
        "'speaker_9': 'One thing that we didn't bring up tonight is that the task force one to look at, have council, examine expanding the boundaries. Right now, the boundary ends at third. And I think at this point, the downtown has already started to expand up third and on pine.'",
        "'speaker_9': 'So that would be something that could be looked into expanding northward at a later date and having the test having. The task force may be involved in that process. Thank you.'",
        "'speaker_0': 'Thank you. Okay. With that, we do have a motion on the floor which has been made for the item. Members, please, Gordon, cast your votes.'"
    ],
    "Grant Funding from DLBA for City Prosecutor Department.": [
        "'speaker_1': 'Item eight is a report from the city prosecutor. Recommendation to execute documents to receive and expend grant funding from downtown Long Beach Associates in the amount of 18,000 for a period ending September nine, September 30th, 2015, and increase appropriation in the General Grant Fund in the city prosecuted department by 18,000 citywide.'",
        "'speaker_2': 'And I'd like there's been a motion in a second and I'd like to turn this over to our city prosecutor for a brief description on what this project is. I realize it was unconcerned, but it is noteworthy.'",
        "'speaker_3': 'Well, very briefly, item number eight would authorize a grant of $18,000 to help fund a community prosecution program in the downtown Long Beach area. As background, the city prosecutor's office historically was one of the first officers to engage in community prosecution.'",
        "'speaker_3': 'All the community prosecution programs were eliminated over the years as the budget dwindled, and I think it's time to start to revive them and look at the benefits of community prosecution. The downtown Long Beach associate discussed with me, and we engaged in a dialog that could allow a part time prosecutor to provide some services in the downtown'",
        "'speaker_3': 'Long Beach area, providing information on crime trends, meeting with some of the stakeholders, and also reporting back on what's happening in the courts and in our in our community. This is a pilot program. It would last nine months.'",
        "'speaker_3': 'And at that time, we would reassess and make sure that it's in everybody's interest to continue before we continue this program. But it's our hope that it's successful and that we can bring back community prosecution to the city of Long Beach.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you, and I thank you for your efforts. There's been a motion and a second. Councilmember Gonzalez.'",
        "'speaker_9': 'I just want wanted to quickly thank you, city prosecutor Doug Halbert. I know how much work you've put into so many of the initiatives you've brought forward. But this is wonderful. Thank you.'",
        "'speaker_2': 'Thank you. Is there any member of the public that wishes to address council on this item? Please come forward. State your name.'",
        "'speaker_1': 'Mary Coburn, downtown Long Beach Associates.'",
        "'speaker_4': '100 West Broadway, Suite 120. Good evening, Vice Mayor Lowenthal. Members of the council. We're very.'",
        "'speaker_1': 'Happy to have.'",
        "'speaker_4': 'This opportunity to work with the city prosecutor's office on this pilot program. Many of our counterparts across the state, especially in the larger urban areas, work with their city prosecutors to address quality of life issues. This is another tool in our toolbox to help our evolving downtown address quality life issues.'",
        "'speaker_4': 'And we really look forward to this pilot program and looking at the results at the end of the nine month period. Thank you for your support.'",
        "'speaker_2': 'Thank you, Mary. Next speaker.'",
        "'speaker_3': 'Very good. Hugh Clark has the address. I would suggest amending this and I would bump the dollar amount up to let's start with $200,000. And follow the line that I have early suggested that we fire the city manager and hire a retired United States federal judge to act as a master to run the city until we get'",
        "'speaker_3': 'it back on track. I realize that's a little more, but I think in the final analysis, it will pay. It will pay. We'll have a more efficient, certainly a more honest administration. I'd like you to consider that. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Goodyear. I appreciate it.'",
        "'speaker_3': 'And also the issue is, tell us why what the objections are to having an outside federal judge come in and administer the city.'",
        "'speaker_2': 'Thank you. Mr. Ghanim.'",
        "'speaker_5': 'Thank you, Vice Mayor. Members of the council. Wow. I'm. I don't think I can follow that, but I think Pat's okay. And in either case, I'm. I've been appointed by the City Council to the Homeless Services Advisory Committee.'",
        "'speaker_5': 'I also serve on the Continuum of Care Board, which is the body that makes the decisions on distributing the federal moneys that are coming to the city on those issues. And I've been a part of the Lincoln Park Task Force for the last several months since its inception.'",
        "'speaker_5': 'We have an extraordinary amount of things that go on to assist those in our community that are in a hardship situation and particularly those that are on the street. But the reality is, unfortunately, there are simply some who will not take advantage of those opportunities.'",
        "'speaker_5': 'There are even those who, when given the opportunity to have a housing voucher, refused for months on end. And then when they do, maybe, perhaps possibly accept it. The social workers find them sleeping in the front yard or on the on their in their living room floor instead of in a bed.'",
        "'speaker_5': 'So there are simply those that that will not conform. And there are those that require a different approach. The community deserves to have safety and security. And we have we have a commendable operation to ensure that those who want it have a means of achieving it.'",
        "'speaker_5': 'So I appreciate this effort. I applaud the city attorney or the city prosecutor, or rather, I applaud city attorney two. But the city prosecutor and I know that he and our new police chief are going to be attending a meeting tomorrow of the homeless coalition and explaining this program at 830 in the morning.'",
        "'speaker_5': 'So I urge your approval of this and look forward to its implementation and means by which we can help to ensure that people who want to visit our community in the downtown area and in others impacted will be able to do so without problems.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Councilman Ray Andrews.'",
        "'speaker_3': 'Yeah. Yes. Doug, I also like to commend you on such a hard, hard job that you're working with, especially with this idea that you brought in and assist tonight. I know how you guys work with that. And I want to thank you again for doing what you're doing.'",
        "'speaker_3': 'It's a wonderful job and please continue to do that. I wish we had more money to give.'",
        "'speaker_2': 'And with that members, please cast your vote among. Yes.'",
        "'speaker_1': 'Bush and Kerry seven zero.'",
        "'speaker_2': 'Thank you, Madam Clerk. Will you remind me if we are at the regular agenda item 19 one nine? Are you sure? Item nine.'"
    ],
    "Resolution to Initiate Coastal Development Permit Process for Leeway Sailing Center Rebuild.": [
        "'speaker_1': 'Item nine is a report from Development Services. Recommendation to adopt a resolution allowing the initiation of a consolidated coastal development permit process in connection with the rebuild of the Leeway Sailing Center District three. Nine.'",
        "'speaker_2': 'Councilmember Price.'",
        "'speaker_9': 'I'd like to move to table this item until December 16th. I received numerous emails today along with a big report from staff, and I think I need to circle back with the city attorney on this issue before we move forward on this item.'",
        "'speaker_4': 'Second.'",
        "'speaker_2': 'There's been emotion in a second. Is there any member of the public that wish to address Council on item nine? Please come forward stating that.'",
        "'speaker_3': 'Very good you able to support the council and so sage suggestion this is a just to understand this is a very. Very indicative project of some of the problems we face and the dollar amount that's being urinated down the drain by what is being suggested here would go to pay for projects that would benefit the public much'",
        "'speaker_3': 'better. Leeway Center is an excellent facility. The kids that are the staff that produces the product, i.e. teaching kids how to sell, are second to none. They do a tremendous job. When those kids come out of that program, they can sail better than their parents.'",
        "'speaker_3': 'But what happened is we got some people involved that hadn't the faintest idea about boating, about sailing, and indeed, the city had to fire the first consultant because he forgot about the fact that sail boats, sailboats move by sails.'",
        "'speaker_3': 'The sails move by wind. He blocked all the wind so everybody would be sitting there in the bay in that area without any wind. In addition to that, the size of this facility is being almost tripled, which is absolutely useless.'",
        "'speaker_3': 'It's a pure waste of money. It's indicative of the West, Hollywood, west of bullying damage this city has done. So I think when this comes back next week, you'll see some more details ending and be able to adopt a more intelligent course than it's sitting here in front of you now.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'I am Dennis Trombley. I've lived in the third district for 32 years.'",
        "'speaker_8': 'Sailor For over 50 years. I currently work for Cal State Long Beach as a volunteer employee for and work at the Sailing Center. I have prepared information that I have forwarded to Councilman Pryce, which I believe is.'",
        "'speaker_3': 'Why this is part of why this.'",
        "'speaker_8': 'Has been postponed.'",
        "'speaker_3': 'And has not been looked at properly from the proper.'",
        "'speaker_8': 'Perspective. We are.'",
        "'speaker_5': 'Supporting redoing.'",
        "'speaker_8': 'The center because it's falling down. It's really bad. It needs to be done. This has been on the books, I think, since 2007, way.'",
        "'speaker_3': 'Before I was involved.'",
        "'speaker_8': 'I only became aware of this about two and a half weeks ago, started looking into it, found all kinds of things we were not involved in.'",
        "'speaker_5': 'We've not been included. We didn't get our input, nor did.'",
        "'speaker_8': 'Any of the other.'",
        "'speaker_3': 'Major stakeholders.'",
        "'speaker_8': 'We're trying to find out how it move for this.'",
        "'speaker_3': 'Far forward without our involvement.'",
        "'speaker_8': 'We are one of the major users of this facility. And.'",
        "'speaker_3': 'You know.'",
        "'speaker_8': 'Hundreds and hundreds of people have been affected by this. And we'd like to have it studied a little better.'",
        "'speaker_3': 'And then come back with some.'",
        "'speaker_8': 'Recommendations. We've supplied drawings and some other.'",
        "'speaker_5': 'Materials to be reviewed.'",
        "'speaker_8': 'And we'll supply some more now that we've got a little more time. Thank you.'",
        "'speaker_2': 'Thank you, sir. Councilmember Mongo.'",
        "'speaker_4': 'Dennis, I just wanted to thank you for those of you who don't know in the audience today. When people come prepared in advance and submit to us their comments, they're attached to the digital agenda that all of us are reading.'",
        "'speaker_4': 'So your comments are sent to all council members and they're memorialized for all of us to read both on this item and when it comes back to council. So thank you for being prepared and coming in today.'",
        "'speaker_5': 'Thank you. And I'm new to the.'",
        "'speaker_8': 'Process, so I'm learning. Thank you.'",
        "'speaker_2': 'Seeing no further comment. Members, please cast your vote. I mean, yes.'",
        "'speaker_1': 'Bush and Kerry eight zero.'",
        "'speaker_2': 'Thank you. Item 19.'"
    ],
    "Cancellation of the City Council Meeting on December 23, 2014.": [
        "'speaker_1': 'Item 19 is a communication from Mayor Robert Garcia. Recommendation to cancel the meeting of December 23rd, 2014 due to the holidays.'",
        "'speaker_2': 'Do you want to know who moved in second? Oh, it was Councilmember Richardson and Andrews. There's been a motion and a second seeing no public comment or member comment. Members, please cast your vote. I mean, yes.'",
        "'speaker_1': 'Council member, Austin. Motion Carry A2 Item 2013.'",
        "'speaker_3': '13, 14, 15. I can combine them.'",
        "'speaker_1': 'They were not.'",
        "'speaker_2': 'They were not polled, sir.'",
        "'speaker_3': 'Excuse me. I think if you would remove the tape. I came to this council, this podium, and listed that along with council. I am the one that Council councilwoman the price board. And at that time, they said the Council on pace was full number seven.'",
        "'speaker_3': 'But I had also at that same time when I rose at that time, referenced 13, 14 and 15, saying that I would not vice mayor or.'",
        "'speaker_5': 'Members of the council, the item were not pulled by the vice mayor or members of the council. And therefore there was taken on the initial action they were voted on. So they were not polled.'",
        "'speaker_2': 'They were not polled. Only council members can pull the items. They were not pulled by us.'",
        "'speaker_3': 'Is that I could I get a clarification that from the city attorney?'",
        "'speaker_2': 'I'm going to ask you to sidebar with the city attorney and we'll move on with the agenda.'",
        "'speaker_3': 'Point of order, if.'",
        "'speaker_2': 'Necessary.'",
        "'speaker_3': 'To order Robert's Rules of Order.'",
        "'speaker_2': 'Mr. Goodhew, please sidebar the city attorney.'",
        "'speaker_3': 'Roberts Rules of Order.'",
        "'speaker_2': 'Please sidebar with the city attorney.'",
        "'speaker_3': '20.'",
        "'speaker_2': 'Item 20, and I'd like to thank you for your patience, for waiting for item 20.'"
    ],
    "Report on Fiscal Impact of Looping System Installation in Public Facilities.": [
        "'speaker_1': 'Item 20 is communication from Councilwoman Price, Councilman Andrews and Councilmember Richardson. Recommendation to require city manager to write a report within 60 days identifying the fiscal impact associated with installing a looping system.'",
        "'speaker_2': 'There's been a motion and a second councilmember price.'",
        "'speaker_9': 'Thank you. I would like to thank Bram, and I don't know if I'm pronouncing his last name right, but Khokhar for introducing the hearing loop system to me through a letter that was sent to my office in September.'",
        "'speaker_9': 'Additionally, in May of 2014, Richard Hernandez, chair of the Citizens Advisory Commission on Disabilities, recommended to then-Mayor Foster and the City Council members the installation of the hearing loop system within city facilities. This system would allow people with hearing loss to fully participate in civil civic activities and to contribute to the productivity of this great city.'",
        "'speaker_9': 'And I think we need to explore the financial impact of installing such a system throughout our city facilities. I think you.'",
        "'speaker_2': 'Thank you, Councilmember Price. And since we have our public speaker cued up, Councilmember Andreescu, would that be okay? Go ahead, please. Please state your name.'",
        "'speaker_10': 'MAXINE Barton. I'm with the Hearing Loss Association of America Long.'",
        "'speaker_4': 'Long Beach, Lakewood chapter. And I want to thank the councilwoman, Susie Price defenders and Rex Richardson.'",
        "'speaker_10': 'For.'",
        "'speaker_4': 'Bringing this back on to the agenda.'",
        "'speaker_10': 'This matter has been going on since the last city council.'",
        "'speaker_4': 'I've given each of the members a packet.'",
        "'speaker_9': 'Giving the history and.'",
        "'speaker_4': 'What's transpired thus far. And my only comment and I would like to add, since you're considering a new civic center, that all of the developers, when they submit their bids or proposals, include looping within certain areas of the building.'",
        "'speaker_4': 'So that the general public that frequents those areas are able to hear. It's great that you have the captioning. But with regard to the captioning, there's a seven minute delay so that people with hearing loss can not only always follow it.'",
        "'speaker_4': 'Right now, there are 48 million people in the United States with a hearing loss. One in seven adults, one in five teens, and three and five returning veterans within. By 2003, that 48 million will have doubled in order to have proper representation.'",
        "'speaker_9': 'We need to have.'",
        "'speaker_4': 'Facilities that allow this unseen disability. To go forward and let the general public participate in all of your events.'",
        "'speaker_9': 'And.'",
        "'speaker_10': 'City affairs.'",
        "'speaker_4': 'So I thank you, Councilwoman Pryce. And I've listed at the bottom of my packet for the city manager.'",
        "'speaker_9': 'And did you get a copy of my packet?'",
        "'speaker_4': 'Good. Yet it I've listed references. U.S. here now USA has it has twice presented a proposal to the city council and I've listed.'",
        "'speaker_9': 'Brown Kakar.'",
        "'speaker_4': 'Who is the state looping chairman of the State of California. If you go anywhere in Europe, you were looped. If you go to three, the city council where looped looping as.'",
        "'speaker_10': 'The technology of the future very.'",
        "'speaker_4': 'Inexpensive and it certainly.'",
        "'speaker_3': 'Is. An improvement over.'",
        "'speaker_4': 'What is provided now under the ADA. By the city for people with hearing loss. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Andrews.'",
        "'speaker_3': 'Yes. Thank you, Vice Mayor. First of all, I think Councilwoman Price for bringing forward this with this item being cosigner and hearing loss is a tremendous barrier to effective communication. I'm very supportive of seeing how we can acquire looping systems in our city public facilities to assist our residents that are hearing impaired.'",
        "'speaker_3': 'And I want to thank you again, Mrs. Price, for being a part of this.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_13': 'Thank you. Councilmember Price. I think this is definitely in line with the work that we're doing around becoming better advocates for language access in our city. I'm going to support this item and I'm proud to sign on. My belief is that everyone has access to should have access to our government.'",
        "'speaker_13': 'And this would be theoretically, I'd love to see what the costs would be to implement. I would imagine it's going to be a lot of senior citizens, a lot of caregivers, a lot of disabled folks that might take advantage of this.'",
        "'speaker_13': 'So thank you.'",
        "'speaker_2': 'Thank you. Are there any other members of the public that wish to address council?'",
        "'speaker_3': 'Thank you for the opportunity. My name is Warren Willard. My partner, Rick ARCHBOLD, and I operate a business called Hearing Now USA, and we install hearing loops all throughout Southern California. I wanted to give you an opportunity to ask any questions, specific questions you might have about hearing loop technology.'",
        "'speaker_3': 'But primarily, I wanted to let you know that Long Beach has an excellent opportunity to become a leader in Southern California municipalities and providing quality hearing to those that have hearing impairment. We call it Silent or the invisible disability.'",
        "'speaker_3': 'And it's rampant. It's all around us. I've suffered with hearing disability for a number of years. I retired from another business and decided this would be my mission. We are also the firm that loop the first facility in Long Beach, DRC offices.'",
        "'speaker_3': 'So I want to thank you for your consideration. We look forward to working with the city in any way possible to help make this happen.'",
        "'speaker_2': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Tengku Imam, you know, like mayor and council members, I'm glad that you have taken up this issue, but I won't repeat what I had been already given. I tell that the City of Cerritos had already located, and there are as many as 17 more cities in California.'",
        "'speaker_3': 'In California.'",
        "'speaker_8': 'They have looped.'",
        "'speaker_3': 'Their council chambers. And also, I find there are 36 other cities in the whole USA. They also love their council chambers. And there's not only that in Europe you have to do that happening.'",
        "'speaker_8': 'And I'd like to inform.'",
        "'speaker_3': 'That some of the cities, what they are using about the funding that capital city received, community grant and a home grant from the U.S. Department of Housing. And they have been using those funds that qualify for community enhancement projects.'",
        "'speaker_3': 'And this project qualifies under the category creating decent living environment by removing existing barriers to help improve accessibility to persons with disability in accordance with in accordance with the ADA. I think Golden City absolutely had already senior center salmon growing in the senior center.'",
        "'speaker_3': 'They're also going to loop their library and they are performing arts center. So if they left it on and on, that's what it did. I have got some at the door of a hearing association. We don't sponsor any vendors.'",
        "'speaker_3': 'We can I can only give you a list of some of the member and some of the information about this technology. If they want to pursue I have those papers so they can go there. And I also I also gave the names of the cities who have it.'",
        "'speaker_3': 'And Turkey can always contact them for that information. They can also contact the city engineering city of Cerritos. They will provide a lot of help on this one. By the way, my name is Veronica Carr. I live in the city of Cerritos.'",
        "'speaker_3': 'Of course, I have been advocating the cause because I am I have been suffering and I have been just feeling isolated. I thought that we should help this community. Thank you. In the papers for the city.'",
        "'speaker_2': 'And so, Mr. Cathcart, I.'",
        "'speaker_3': 'Would like to.'",
        "'speaker_2': 'May I ask you to give that to the City Clerk? To your left.'",
        "'speaker_3': 'We already give you, dear. Pass. Yeah, sure.'",
        "'speaker_2': 'Now I don't.'",
        "'speaker_3': 'Any question if standing there, I mean.'",
        "'speaker_2': 'Is it the same packet that that. No, it's not. Okay, we may not have it.'",
        "'speaker_3': 'Yeah, our thing. Okay, that's fine. I mean, I have got the names of the city. You have something else you need to worry about. The papers.'",
        "'speaker_8': 'For the.'",
        "'speaker_3': 'Um. Yeah, I mean, they're talking all about the technology if they want to review it. But this is definitely a new technology. This is the only one which is helping us like this one. It's a wonderful building, but because of this reverberation, we were virtually lost.'",
        "'speaker_3': 'We were not knowing where the sound is coming from, which way we should look. We were only reading this and then barely I could hear and the council member asked him talking something. Okay, that's fine. But time he has to look down his paper.'",
        "'speaker_3': 'So we were lost. What is happening? I well, I would suggest council should take up the funding because really it's about the quality of life for the resident. It's about it. It's about giving the equal opportunity to the minority they have not able to do is happening.'",
        "'speaker_3': 'So.'",
        "'speaker_2': 'Thank you. Your time. Your time is up.'",
        "'speaker_3': 'Political process.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you, Mr. Corker. Thank you, Councilmember Austin.'",
        "'speaker_8': 'Thank you, Vice Mayor. I just want to commend Councilmember Price Andrews and Richardson for bringing this forward. I want to thank the speakers who have come out and speak in support of this looping system in our public facilities.'",
        "'speaker_8': 'You know, whatever it takes to to to open up access to to residents to participate in government. I support I can imagine on a personal note that this looping system might even help a council member or two. So thank you very much for for bringing this item forward, and I plan on supporting it.'",
        "'speaker_2': 'Thank you. Seeing no further public comment or member comment members, please cast your vote at Miss.'",
        "'speaker_1': 'Motion carry eight zero.'",
        "'speaker_2': 'Item 21.'"
    ],
    "Revised Financial Policy on Fiscal Impact Statements.": [
        "'speaker_1': 'Item 21 is a communication from Vice Mayor Lowenthal. Lowenthal Chair, Budget Oversight Committee Recommendation to approve the revised Financial Policy on Fiscal Impact Statements.'",
        "'speaker_0': 'Okay. Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I'd like to make the motion to move this item. And second, a couple of comments. Thank you. The Budget Oversight Committee felt that there was a need for more fiscal information when city council considers items from departments and council offices.'",
        "'speaker_2': 'We certainly try to impose that discipline on ourselves when we're bringing forward our own items to try and evaluate the fiscal impact. This does not include items deemed insignificant in terms of staff time or cost, but the Budget Oversight Committee felt there was a need to include year over year information and the standing financial position of the'",
        "'speaker_2': 'city to better equipped council members for its consideration. As Councilmember O'Donnell is now an Assembly member and no longer with us. I'd welcome any comments from my other be a key member Councilmember Mongo and financial management staff and I'd also like to thank the financial management staff for their efforts.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_4': 'Several weeks ago on one of our agenda items, we had an item before council which stated an amount of money that the city would be obligated to for a particular item. But what that item did not disclose without questioning from council members was that the price of that item was $4 million over the prior year costs.'",
        "'speaker_4': 'And so I think it's important to have all of that information in advance, both for us and for the public to review those items. And so that in partnership with the discussions with some staff related to sometimes the significant amount of shift for resources and staff time to put together certain things.'",
        "'speaker_4': 'I just think we need to be cognizant of those items and be aware of it. Not saying that it's not appropriate because we absolutely need those items to come back and those reports are important. It's just important to be able to quantify it and to be honest with ourselves and each other about what that cost is.'",
        "'speaker_4': 'So I'm very supportive of the item and I look forward to increasing the fiscal discipline of the Board of the council and for our city staff as well. Thank you.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_9': 'Thank you. I wonder if there's and I wasn't privy to the discussions that led to this item, but I wonder if there's a way to also amend our policy of writing no fiscal impact on agenda items when there in fact is either a fiscal impact or an unknown fiscal impact, because sometimes we'll get an agenda item and'",
        "'speaker_9': 'it says no fiscal impact. And it's very obvious that the item might have a fiscal impact. And then further, when you ask staff, is this going to have a fiscal impact? And they say, we don't know, and yet we're voting on an item that says no fiscal impact.'",
        "'speaker_9': 'I think if there was a way to add this within the spirit of this proposal, I'd be interested in doing that because I think we really need to be honest with the public when we put an item on the agenda that if we don't know what the impact is going to be, we should just say that.'",
        "'speaker_9': 'And that way we can vote on an item not knowing how much it's going to cost the city, if that's what we want to do.'",
        "'speaker_0': 'So that's merely one thought. The won't accept that.'",
        "'speaker_2': 'I do, and I wanted to seek some guidance from staff on how that wording would appear. For instance, I'm familiar with working with other cities where we don't actually put no fiscal impact unless it really does mean that if it's unknown, we're asked to put something akin to it is unknown at this time.'",
        "'speaker_2': 'But we do anticipate being able to evaluate the fiscal impact, something that states or at least acknowledges that there is a cost to it, even if it's just staff time. So, Mr. City Manager, I'm wondering what your suggestion is.'",
        "'speaker_3': 'I'm going to ask our finance director, John GROSS, to respond to that. Now this item, what you're seeing in front of you is an update to an existing fiscal impact statement, which existing fiscal impact policy, which requires all council matters that come before you to have a fiscal impact statement.'",
        "'speaker_3': 'What Councilwoman Brice, you are talking about is and Vice Mayor Lowenthal is making sure that the three items that the EEOC asks us to look at are included, and that includes the clarify that expenditure information is on there, particularly past expenditure information and resource utilization, including staff time as a fiscal impact, specifically as an impact.'",
        "'speaker_3': 'So those two items have been included and are in the current wording in the last item was to require EFM review, financial management department review and I think that addresses your last item and that that if an item if it comes before us and it says no fiscal impact, we as financial management are required to review that'",
        "'speaker_3': '. And this document, as worded as we thought we had addressed, what the BOC asked for, would allow the financial management department to change that fiscal impact to better reflect what resources might be required or utilized. So I believe, subject to your review, that the wording has revised and as requested by the PRC, already incorporates a fix, so'",
        "'speaker_3': 'to speak, to an incorrect or what not might be totally correct. No fiscal impact. There will be some that have no fiscal impact. We will review it and we will change it if we believe it has a fiscal impact and its mark.'",
        "'speaker_3': 'No fiscal impact. Hope that answers your question.'",
        "'speaker_2': 'It does. Thank you.'",
        "'speaker_0': 'Okay for the comment on the item. Please come forward.'",
        "'speaker_3': 'Larry. Who do? Clark has the address. Do not have a statement of what? A project, let's say over $10,000 should cost is just inane. It's like the DNC policy pop out a kid. Don't worry about what it cost.'",
        "'speaker_3': 'We'll take care of that for you. There should be no project here. And you could I think it's it's fair to argue what the dollar amount should be. But once you establish that, then there should be no projects that are approved unless you know exactly where the dollar amount is going to be buried.'",
        "'speaker_3': 'Unless you've got a printing press downstairs to print the money. I don't know who came up with the idea of of having a policy that you should have no office, no statement of official impact. But that's clearly a disease thought in my view.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'No more public comment. Councilmember Richardson.'",
        "'speaker_13': 'Thank you, Mr. Mayor. So I think that including financial, you know, fiscal impact statements are important. I think it's the right thing to do. However, there's a few things here that I'm certain frankly concerned about, particularly the EFM review.'",
        "'speaker_13': 'So there's a line in this policy that says if time is not sufficient enough for the required fiscal impact analysis, financial management may hold the item, provide for a preliminary fiscal impact analysis, or may indicate on the council letter, fiscal impact statement that additional analysis and information is recommended.'",
        "'speaker_13': 'So I'm concerned that I'm concerned that if we submit an item. It can be held up or delayed from a discussion here at the city council before that review has taken place. There is a number of examples tonight where sometimes you just want to have the discussion and it will.'",
        "'speaker_13': 'You know, obviously city staff will weigh in and say, you know, there are some you know, this is unfunded mandates on and so forth. You know, there was a there was a substitute motion on the floor about or friendly about expanding from 5 minutes to ten on parking meters.'",
        "'speaker_13': 'And they said very clearly, hey, this, you know, this, we haven't studied this. We haven't evaluated that. I thought that was fair. And I expect city staff to step up and let the council know. You know, just the last item on loops, we asked city staff to work on that.'",
        "'speaker_13': 'I think that's an appropriate way to go about it is to you know, I think the checks and balances are built in here in the fact that we all meet together and we catch things when they haven't been vetted appropriately.'",
        "'speaker_13': 'I think when we take that power away from ourselves and hand it over to city staff and say, you can unilaterally hold up an item, I think that creates some some problems for me and in the fact that our ability to serve as council members really rests on this and our ability to place a proposal on the'",
        "'speaker_13': 'on the city council agenda item and have a discussion. You know, I would also say that there are already tactics in place that are used, whether they're in writing or not. When a councilmember promote proposes an idea. You know, there are a number of city staff that will visit all the other council members and say, hey, I've'",
        "'speaker_13': 'got issues with this. This, you know, is going to cost us a million bucks, so on and so forth. And a lot of times our phones ring and it'll say, Hey, fix this. And a lot of times they get fixed.'",
        "'speaker_13': 'So I would say I'm not prepared tonight to hand over a hand over that ability for for city staff to unilaterally hold up or delay an item. So so that said, I'd like to see I mean, I appreciate the work that's been done.'",
        "'speaker_13': 'I certainly feel like the fiscal impact the three elements here. So the past expenditure information and staff time, I think those are important, but the require fiscal management review, I'd like to strike that. So my substitute motion would be to to approve the first two, but take out the required financial management review because I think that's going'",
        "'speaker_13': 'to happen anyway. And this goes to sort of the if it ain't broke, don't fix it. I think we've acknowledged certain things that are broke, but I don't think the fact I don't think that element of bringing things to the city council that I'm prepared.'",
        "'speaker_13': 'I don't think we fix that by taking that entirely away from city council members. I think we we hope we should express to city staff that we expect them to catch things and inform the city council members. Given the fact that we don't have researchers on our staff and it's our job to really put our beliefs and'",
        "'speaker_13': 'our ideas out there. So that would be my substitute motion.'",
        "'speaker_0': 'Thank you. I have Councilman Ranga next, but I do I do have a question. Maybe it's to the the the chair of B of C. The way I understand it is the motion. And the item would give councilmembers options.'",
        "'speaker_0': 'So so option A would be this has been reviewed by by city staff on the on the fiscal impact. Option C is a councilmember could put that the fiscal impact has yet to be determined. That's still an option, right?'",
        "'speaker_0': 'Isn't that right? Okay. And then third option would be that there is no fiscal impact or that that it would require analysis. Is that right? Okay. So so the ability for so a councilmember could still bring something forward if there has not been a fiscal impact yet done on the item, it would just be noted that it'",
        "'speaker_0': 'hasn't been done yet. Correct. Okay. I just wanted to clarify, Councilman Ringo.'",
        "'speaker_5': 'Thank you for bringing this up, because obviously transparency is a big issue with any elected body in regards to its budget and how things are brought forward and what the expectations are in terms of any reports. And if the expectations are, there's going to be a fiscal impact where no fiscal impact, I think obviously we should know'",
        "'speaker_5': 'know that in advance. But I have to agree with Councilmember Richardson in the fact that, you know, I don't have the type of staff to be able to do that kind of research. And if I want to bring something forward, how much of a delay am I going to have in putting that through the city council agenda'",
        "'speaker_5': 'because of the fact that I need to have the background done on that would when I would have to talk to our financial management people to get a background on how much of a physical impact would my ordinance or proposed ordinance would have on an idea or on a project that I want to put forward?'",
        "'speaker_5': 'And even if there's no fiscal impact, you know, they could probably tell me that, too. So I think that yeah, I know that this is an effort to streamline and to get our council agendas much more intact and much more efficient.'",
        "'speaker_5': 'But I also don't have an issue with the fact that I think it would be more time taken by each council office to bring something forward that can be done in, say, a month. It'll take two or three week to two or three months to get forward because of the background and the research that would need to'",
        "'speaker_5': 'be done on that. And that hasn't practical impact by that. So I mean, it's it's sort of it's sort of a disingenuous it goes sort of backwards. And I think at this point for what I see and Councilmember, it's that you took the words out of my mouth.'",
        "'speaker_5': 'You know, it's if it ain't broken waiting it waiting, need fixing cause all the wording is already there. We can as council members that we feel that there is going to be a fiscal impact. Then we asked staff, give us what the fiscal impact will be on this ordinance.'",
        "'speaker_5': 'So I think that that the the the the the semantics and the structure it's built in already and the way we present our agenda items for consideration by the full council. So I, I'd like to see maybe a substitute motion to, to substitute with a substitute substitute, okay.'",
        "'speaker_5': 'To receive and file this. And it does have some good stuff, but I would use to file a second.'",
        "'speaker_0': 'All right. There is a substitute substitute to receive and file and I'm gonna go to Charlie. Charlie partner, city attorney and then Councilwoman Price there.'",
        "'speaker_2': 'I'm sorry, was there a second?'",
        "'speaker_0': 'There was a second.'",
        "'speaker_3': 'Mayor.'",
        "'speaker_5': 'Or members of the council. Just for clarification, there currently exists in the Long Beach Municipal Code 2.03076. The requirement for fiscal impact statements by those items submitted by a council member requires the Council member to state the fiscal impact of the requested action, and it requires that the fiscal impact statement be prepared by such council member indicating'",
        "'speaker_5': 'the significance or whether it has a significant fiscal impact. No significant fiscal impact or no fiscal impact at all. So I think the policy and the from the.'",
        "'speaker_3': 'Policy is to help.'",
        "'speaker_5': 'Staff and council implement the a requirement that already exists for the council. And so or maybe, maybe not, maybe there's further direction.'",
        "'speaker_3': 'But currently there is a requirement under the.'",
        "'speaker_5': 'Municipal code that there's where this comes from. So I just I'm not sure we were discussing that in this context.'",
        "'speaker_0': 'Okay. So let me let me go back to where we are. I have Vice Mayor Lowenthal and Councilwoman Pryce and then Council member Austin.'",
        "'speaker_2': 'So, Mr. City Attorney, thank you for clarifying that, because in hearing this discussion, I realize that the item was not as clear and my comments were not as clear as they could have been. Those policies that Mr. Parkin stated, they exist for council members.'",
        "'speaker_2': 'We want them to exist and extend for staff. That was the budget oversight committees recommendation. We want the. Staff. When staff. So all the items that we consider are not just council member driven, we have staff items from different departments and department heads.'",
        "'speaker_2': 'City manager brings an item. Gas and oil brings an item. We want the same requirements for fiscal impact statement to apply to staff. So what we don't want as a council hopefully is for staff to bring forward an item like any item.'",
        "'speaker_2': 'And not let us know what it costs. So we sort of are blindly taking action based on the merit of the proposal without understanding the the cost. So as council members, when I bring forward an item, I have to I am required to state what the fiscal impact is.'",
        "'speaker_2': 'But according to those three items that Mr. Parkin mentioned.'",
        "'speaker_0': 'Hey, someone has a mic on if for I thank you.'",
        "'speaker_2': 'But staff doesn't have the same requirement. They may operate under the same metric, but it's not required. And so we're trying to align council member standards with staff standards extended to the staff.'",
        "'speaker_0': 'Is that? Mr. West, drop your career with that as well.'",
        "'speaker_3': 'Oh, we have no issues. Right.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'Everything is gets vetted from. It takes us about.'",
        "'speaker_5': 'Eight weeks to put an agenda item through because it goes through the city attorney's office.'",
        "'speaker_0': 'And that. Mr.. Parkin And you got your clearance on Vice President of the motion.'",
        "'speaker_2': 'And Mr. Mayor, if I might also address a salient point that Councilmember Richardson brought up, this would not allow staff to hold up a council member item. What we're asking through this item, and probably not as artfully stated as it could have and should have been, and I apologize for that.'",
        "'speaker_2': 'We are asking staff to make sure they're not bringing forward an item for our consideration where we don't know how much that's going to cost. The ideas could be fabulous, but we should know what it cost before we vote on it.'",
        "'speaker_0': 'Next nexus. Councilwoman Price Pryce.'",
        "'speaker_9': 'Thank you. I appreciate all of the conversation that we're having here. I do want to respond to Councilman Richardson regarding his comment about if it's not broke, why fix it? The problem is it is broke right now. It's broke.'",
        "'speaker_9': 'And I'll give you a classic I'll give you a classic example. We as council members can put an item on the agenda, either in the regular timeline or on the supplemental agenda. And we can request a staff report regarding the fiscal impact case in point looping system tonight.'",
        "'speaker_9': 'Okay. We can also put an item on the agenda, regular or supplemental, where we are directing staff to take an action, not study fiscal impact, but to take an action. And when we write on that supplemental agenda item, there is no fiscal impact.'",
        "'speaker_9': 'Where there might be a fiscal impact, then we've got a loophole in our responsibilities pursuant to the ordinance that the city attorney just specified. So I'll give you a classic example. On November 11th, we were at Halton Park and agenda item three, which was the plea, said there is no fiscal impact.'",
        "'speaker_9': 'That item was put on the supplemental agenda during the process of trying to educate myself at the council meeting. I asked. John GROSS whether or not we knew what the fiscal impact would be and staff specific. I watched the video like four times specifically said we do not yet know the fiscal impact because the item was filed'",
        "'speaker_9': 'on Friday. Something to that effect. And so we have a fiduciary duty to if we and I completely understand. Council Member You're on the statement about not having the staff for the resources to be able to do fiscal impact.'",
        "'speaker_9': 'Certainly that's way beyond something that my council office could do, although they're amazing, brilliant people. It's just they don't have the resources. So that's one of the reasons why most of our items usually request a staff analysis so that we as a body, all of us can have adequate information with which to carry out our fiduciary duty'",
        "'speaker_9': '. So there's a loophole right now wherein we can say there is no like, for example, item number three had in it a proposal for a possible additional position. And yet it said there is no fiscal impact, not fiscal impact is unknown, not fiscal impact to be determined, not anticipated fiscal impact, but minimal.'",
        "'speaker_9': 'But it specifically says there is no fiscal impact. And so what I would like to see is something that allows for us to be able to have a fiscal impact. That is a reasonable fiscal impact. That's honest. What we think may not be 100%.'",
        "'speaker_9': 'It may be, you know, fiscal impact. The range is going to be somewhere between 20,000 and 100,000 or something. But to say there is no fiscal impact when staff is telling us we don't know, I think that there's a little bit of a loophole there.'",
        "'speaker_9': 'And it it is in conflict, in my opinion, with. What the city attorney just read. So I think there was an issue there because we have a duty when we're filling out these agenda items to, you know, be answer the the required components, which fiscal impact is one.'",
        "'speaker_9': 'So that's where it's coming from. But you raise great points and I agree with you. I don't want items to be held up because of that. I really don't. I would hope staff wouldn't do that. But I think that's a great point.'",
        "'speaker_9': 'And I think, Councilman, you around those statements are really you know, I take those to heart as well. So thank you.'",
        "'speaker_0': 'Okay. Thank you, Councilmember Richardson.'",
        "'speaker_13': 'Thank you for clarifying, Vice Mayor, that the intent was for staff. I just see that it says originating department or elected or appointed offers or office must be reviewed by the financial management department. So that is, you know, that being called out is what concerned me.'",
        "'speaker_13': 'And then but I understand if that wasn't the intent and I get it, sometimes you have one expectation, but one lands is something else. And it seems like there are two understandings from multiple understandings here on the dais about what this policy actually does.'",
        "'speaker_13': 'Like so I just heard from Councilmember Price that it does it is expected that council this would apply to council people as well, which I get it. I'm I'm in a position where, you know, I think that we should have we should be responsible when we say there is no fiscal impact.'",
        "'speaker_13': 'But the check the accountability to that are the eight other people that you have to sell this to, as well as the city manager. They are expected to look at what they vote on. And so while, you know, my staff and myself, we try to try our best to do our diligence to really evaluate if there's an'",
        "'speaker_13': 'impact, because we know if there is is going to have a tough time getting through the council. I think we get that. And that's just the reality of, you know, this democratic process. Just one of the thing, the if it doesn't broke, don't fix it.'",
        "'speaker_13': 'I was talking about like a narrow version of that. Like, I know there are elements that are broken, but I'm talking about like our ability to put things on the agenda. That's what I'm talking about, because before it makes it to the agenda, the number of checks in place when it makes it to the agenda.'",
        "'speaker_13': 'If is late, you get two other people to sign on. If it makes it on time, they've got a week. Council's got a week to review it. You know, if it's flagged by city manager, he'll make it clear to everybody here there are some major problems with this, with this item.'",
        "'speaker_13': 'I've seen it as a chief. I've seen that councilmember. So there are mechanisms in place. So I'd say that's the if it isn't broke, don't fix it for me. However, we're discussing we're debating the substitute substitute right now, which is the the receiving file.'",
        "'speaker_13': 'So that said, I think if if this were to come back in some other form at some point that like calls out, hey, we're talking about specifically staff being held accountable to listing fiscal impacts. I'd be open to to entertain that discussion and and supporting that.'",
        "'speaker_13': 'But I think it's needs to come back in a different form.'",
        "'speaker_0': 'Okay. Councilmember Mongo.'",
        "'speaker_4': 'I am so appreciative of the healthy discussion here today. And I will start by saying that this item before Budget Oversight Committee came from several different discussions that have happened, both at Council and Bossie that got us here today.'",
        "'speaker_4': 'Specifically, as I mentioned in my opening comments, an item came before this body that was a $4 million annual increase to the city. And it was not listed for council review. And most specifically, the checks and balances that Councilmember Richardson talks about of having additional people sign on.'",
        "'speaker_4': 'The staff don't currently have that. So this is a comprehensive item that is both for staff and for electeds. And in that case, the staff put that item on. But in any item that comes in on a Friday, while you do get two other council members to sign to, agenda is the item.'",
        "'speaker_4': 'The public doesn't have that amount of time to review it, and nor does anyone put in place to, quote unquote, validate that there's no fiscal impact if an agenda item would like to come forward. I believe that under the way that the original motion was written that if you wrote fiscal impact is unknown at this time, you'd'",
        "'speaker_4': 'still agenda the item and it would not require that getting to that point. Instead, it would alert both the council and the public that there were still things to be determined in that process. And so with that, I would say that.'",
        "'speaker_4': 'In certain occasions, depending on which group of individuals you serve in front of. There are times where you might say this may include an impact of 700 hours of staff time, or this might include 600 hours of staff time.'",
        "'speaker_4': 'And while I appreciate that some of our staffs might not have financial analysts at the level of Mr. GROSS in our offices, we are all able to make general estimates of an average city employee who makes X dollars an hour plus 56% benefits times 20 hours a week for 16 weeks.'",
        "'speaker_4': 'My estimated impact would be etc. and these are easy to do. These are things we've all done in our home budgets, in our previous employment, in our campaign budgets. I mean, we know how to allocate resources or none of us would be here today.'",
        "'speaker_4': 'And so for that, I hope that we get back to the original motion and move it to protecting the financial, health and welfare of the city. I really appreciate the comments made by Councilmember. Price and Vice Mayor Lowenthal in trying to pull us together in where the intent of the item came from, because this did come from'",
        "'speaker_4': 'many discussions in front of this body, which is why healthy discussion is so important. So thank you to everyone.'",
        "'speaker_0': 'Councilman Councilwoman Gonzalez.'",
        "'speaker_9': 'Thank you. Yes, very healthy discussion, I think. I believe the intent of it all. Absolutely. I do agree that there needs to be more details when it comes to fiscal impact. And we we do need to do a better job at that.'",
        "'speaker_9': 'Some people are subjective and looking at that. Is it a fiscal impact in terms of staff time? Is it a fiscal fiscal impact in terms of, you know, do we still have time to come back and review that?'",
        "'speaker_9': 'Which oftentimes we do. And I know that the city manager in cases like the play did come back with memos that did include fiscal impact. You know, there's time to to be able to do that. I would say, you know, we need to look at perhaps a disclaimer, something that is pretty universal depending on what we're were'",
        "'speaker_9': 'putting out there. I think we've kind of discussed that. Something that would state, you know, what the general fiscal impact would be, not the intricacies. I think it's too detailed on the front end to do that, and I believe it would delay the process.'",
        "'speaker_9': 'So I would support a receiving file.'",
        "'speaker_0': 'Okay. Next is Vice Mayor Lowenthal.'",
        "'speaker_2': 'One. Excuse me. I wanted to ask the city attorney in the. Statement that Councilmember Richardson read about. Where are you reading this from, Councilmember Richardson, where it says the elected.'",
        "'speaker_13': 'So we're talking page two on the revised policy on impact statements. Yes. Top of the page.'",
        "'speaker_2': 'Oh, got it. Okay. Mr. City Attorney, is that the current policy? Or is that a combination of the current policy and what the new item is asking for?'",
        "'speaker_3': 'I think maybe I can ask answer that question. This is a council policy, and as such, it's not explicitly in code. It's adopted by resolution. And the current policy is on the last page of the attachment. It's not marked.'",
        "'speaker_3': 'It's page three. And the current policy is there. There have only been minor. I won't say minor, obviously not. But there are only been the changes requested by the BRC.'",
        "'speaker_2': 'So if I might understand the part that gives greatest concern to Councilmember Richardson specifically, is it the portion that it must be reviewed by financial management?'",
        "'speaker_13': 'So at the beginning of the paragraph, it said, it calls out those three departments elected or appointed office, and then it goes further in the third sentence to say, if time is not sufficient for the required fiscal impact analysis, financial management may hold the item.'",
        "'speaker_13': 'So it just continues. So it's the third sentence in the same paragraph, continuing that same discussion on this fiscal impact statement on that item. So the whole paragraph is problematic.'",
        "'speaker_2': 'The entire paragraph or the part about having it being held. Because. Currently we're required to provide a our policy is to provide a fiscal impact when we bring items forward that exists. Yes, I believe what I'm hearing you indicate is that.'",
        "'speaker_2': 'You're finding difficulty with financial management having the ability to hold the item.'",
        "'speaker_13': 'Yes. So it says. So here's where it's problematic. So on the second sentence, it says the proposed city council letter should be submitted in accordance with normal administrative timeframes to allow financial management departments review and comment if time is not sufficient for required fiscal impact analysis.'",
        "'speaker_13': 'So who's to say it's efficient or not? Like if. So, if we were to put something on that we think is a very basic standard item and someone takes issue with it and they haven't had an opportunity to do it.'",
        "'speaker_13': 'Like are we saying supplemental? Are we saying supplementals are not enough time for city staff to review so that that time frame brings up an issue that I have concerns about? Then it says that they may provide some options for them.'",
        "'speaker_13': 'They can hold the item. They can provide a preliminary fiscal impact analysis, or may indicate on the fiscal impact statement that additional analysis and information is recommended. It's saying that they would add that to our item. Fiscal financial management will add that statement to our item, not that we would.'",
        "'speaker_13': 'That's how I interpreted this. Whereas if I submit an item for discussion, I want that item to be presented as we presented it that. So I have an issue with that potentially being held up or altered by financial management.'",
        "'speaker_13': 'However, if. I mean. I mean, there are a few ways we could do this.'",
        "'speaker_2': 'No. And I'm and I'm I'm very appreciative of you explaining this, because I'm I'm able to hear what the concern is. And so I do think we can get there tonight. And that's why I'm thankful you're expressing your concerns.'",
        "'speaker_2': 'For instance, if I can just use an example, I have a council agenda item I'd like to bring forward. I'm aware that there is a fiscal impact, but I'm asking staff to come back with a recommendation. And so typically what I would do in my office is I would say there is no fiscal impact in requesting staff'",
        "'speaker_2': 'to come back with the item or a recommendation. But when they come back with the recommendation, we'd like them to identify what the fiscal impact might be so I could make that statement. We will still have the ability to do that.'",
        "'speaker_2': 'You will still have the ability. I will still have the ability. You will still have the ability all of us would to bring forward a supplemental item for consideration. That does not change. And if I can ask Mr. GROSS to weigh in on that.'",
        "'speaker_3': 'Yeah. The the item I'm happy to the statement may hold the item financial may hold the item was never intended to apply to elected officials. It was this is a generic fiscal policy. So it was intended to apply to city manager departments.'",
        "'speaker_3': 'So if I can suggest, at least in terms of what it was intended to say, adding a parenthetical after May hold the items put in parentheses only for city manager departments that would probably represent more accurately what was intended.'",
        "'speaker_2': 'And that is the intent. And so Councilmember Richardson, I'd like to add that on the floor in parentheses, parentheses, only city management items. City management department items. The intent of the committee was not to have financial management hold up council items.'",
        "'speaker_2': 'Again, this is really to temper and measure staff bringing forward their items without the proper fiscal impact. So in parentheses. So in parentheses I'd like to amend in there only city management department items. So that financial management, so that there is not misinterpreted, that they have the ability to hold up our own items.'",
        "'speaker_2': 'Being council items.'",
        "'speaker_13': 'So. So before I jump in, so I want to have that discussion. But before I do that point of order, are you allowed to change that? Because we've got to to. Well, prevailing motions.'",
        "'speaker_2': 'Absolutely. So there's a motion on the floor for receive and file. And prior to that, is is your substitute. And you'll have to remind me what your substitute.'",
        "'speaker_0': 'I mean. Let me. Let me. Mr. Parkin, I think that her being the maker of the original motion, she can certainly adjust her original motion.'",
        "'speaker_5': 'At this time. The discussion on a.'",
        "'speaker_3': 'Point of order should be.'",
        "'speaker_5': 'To the motion on the floor, which is the receive and file. The the ability to amend the original motion wouldn't return to the maker until the other two motions are dismissed.'",
        "'speaker_2': 'Okay. So as part of my comments, Mr. Mayor, I. Now that I fully understand what my colleagues were concerned about and I agree with you. If I if I could just state that unequivocally so I agree with you.'",
        "'speaker_2': 'I have the I would have the same concern. I'm willing to change the item on the floor, if you will, allow us to revert back to the original item and vote no. Either withdraw the received file and let's go back to the original item and give us an opportunity to amend it on the floor.'",
        "'speaker_0': 'Okay. I have a list. You want to respond that Councilmember Austin next cued up.'",
        "'speaker_13': 'So technically.'",
        "'speaker_0': 'It's Councilmember Rounds.'",
        "'speaker_13': 'That we got to respect. Councilmember Rein does most of the questions should be directed to him prior to.'",
        "'speaker_2': 'I'm sorry, I was I was looking his way while I was linking.'",
        "'speaker_3': 'To.'",
        "'speaker_0': 'Councilmember your NGO's is not removing his his motion right now, is that correct? Okay. Okay. So Vice Mayor Lowenthal, anything else?'",
        "'speaker_2': 'No. Then I would urge a no vote on receive and file so that we can have an opportunity to apply councilmember standards onto our own staff.'",
        "'speaker_0': 'Next is Councilman Braxton.'",
        "'speaker_8': 'So I've been sitting here patiently and I think this has been a very educational process. And in terms of our fiscal responsibility as a as a council. Our practices and protocols are policies. But I am I want to be clear about how staff items actually get to the agenda and what process they go through to get there'",
        "'speaker_8': '. Because I am not aware of any any, any, any agenda items and none have been brought to to the floor in terms of examples where there is a real need, I believe, to to to modify that. I want to speak to Councilmember Richardson's point, meaning that these nine council members are service checks, as well as our budget'",
        "'speaker_8': 'oversight committee. There are there are so many mechanisms in place to keep us fiscally responsible. And so, Mr. City Manager, can you walk us through how our staff checks themselves in terms of fiscal responsibility, in terms of bringing agenda items forward, forward?'",
        "'speaker_5': 'I'm going to ask John GROSS to respond to that on how the Finance Department looks at all council letters done by departments.'",
        "'speaker_8': 'Wait, not all council letters. These are these are agenda items that are.'",
        "'speaker_3': 'Given what we call.'",
        "'speaker_5': 'Letters are agenda items. Okay. By depart by city manager.'",
        "'speaker_8': 'Department, I think. Correct.'",
        "'speaker_3': 'The the city management has a process by which all city manager council letters that are proposed to go to city council, go through the financial management department. We have a process to do that. The what this and we've been doing that for years so that what you see in front of you is is every every week are'",
        "'speaker_3': 'fiscal impacts that have been reviewed by the financial management department. What this strengthens and is makes required and currently isn't is that, for example, if public works or police department write their own fiscal impact, although they write it and we have a process to review it, this change in the policy explicitly allows the financial management department to'",
        "'speaker_3': 'make whatever changes are needed to make it clearer to City Council what the impacts are. And we do do that. And this makes that process that we use more clear, particularly when you have departments. It doesn't happen often, but occasionally those who who think they have written a good fiscal impact.'",
        "'speaker_3': 'But we believe that it isn't clear enough to city council and may not provide the information City Council wants this change to the policy, allows the financial management department to formally make that change. We actually do do that now.'",
        "'speaker_3': 'This makes it clear that it's authorized.'",
        "'speaker_8': 'So what I'm hearing is that you do do it already and that these these occurrences are few and far between. Is that correct?'",
        "'speaker_3': 'We do do that for city manager departments. Yes. And we do make changes. I won't say that's few and far between. We actually quite a few times make changes to the fiscal impact statements.'",
        "'speaker_8': 'Okay. So I'm troubled to understand why we need to move forward and set additional policy. I'm really concerned about over analyzing just about everything we do lately. And I do appreciate the robust conversation. I do appreciate council members interest in tweaking the system to make it make it better, because we should always look towards continuous improvement.'",
        "'speaker_8': 'But I don't think we get there by adding bureaucracy to policy making or or ignoring the checks and balances that are already in place. And so with that, I'm I'm open to receiving 2 to 2, supporting the motion to receive and follow.'",
        "'speaker_0': 'Councilwoman Price. Okay. Councilwoman, if Councilman Andrews, who hasn't spoke and then I'll go to Councilman Mongo.'",
        "'speaker_7': 'Yes. Thank you, Mayor. You know, since I started as a councilman, you know, I've made every effort to run, you know, my agenda item to the city staff so I can get their input from the various departments that might be involved in my agenda item.'",
        "'speaker_3': 'You know, this is a good practice for all council.'",
        "'speaker_7': 'Members to, you know, for the intact. But I just think at this point, if we're doing it the way we're doing it, I mean, this could be putting the cart before the horse. And I would also would recommend, you know, to receive and file.'",
        "'speaker_0': 'Okay. Councilman Mongo. Okay. Now what?'",
        "'speaker_4': 'On the agenda items 27 and 28 tonight. I think that there was extensive questions that I've received from the public. I feel that I've done my due diligence as a council member to speak with city management specifically on the 5.5 million a year for two years, etc..'",
        "'speaker_4': 'But but the council but the item as recommended by development services, though thoughtful and I appreciate the way it is presented, it leaves out how much has been spent each year over the last five years. How does that compare?'",
        "'speaker_4': 'Are we spending more? Are we spending less? The same is true of the item from several weeks ago which spurred this discussion, which I won't call out my colleague, but I received a call at 10:00 at night thanking me for bringing the item to the attention and pulling the item and making thoughtful discussion about a $4.5 million'",
        "'speaker_4': 'annual increase. These are real dollars for real services. And to not have the discussion and to say that the stuff being brought forward already is clear. If it was clear, we wouldn't receive so many questions. And I think the intent is that it is clear in advance when being put on the agenda so that I know that'",
        "'speaker_4': 'my staff does do a lot of relaying back and forth between constituents and community members and the staff departments, as does Councilmember Price's constituency, to ensure that they have all the information so that they can submit comments in advance without coming all the way downtown several miles to make their comments.'",
        "'speaker_4': 'And so I think that there's a lot of value in this. And so I would prefer a friendly amendment to Councilmember Uranium's item to send to Bossi for revisions and more clarity to come back to this body more thorough.'",
        "'speaker_4': 'Is that something you'd consider?'",
        "'speaker_0': 'I think for the city attorney, we have to only speak. The only thing we can do right now is vote on the receiving file before we could do other amendments to other motions. Is that.'",
        "'speaker_3': 'Correct? Actually, this is this is directed to the.'",
        "'speaker_5': 'Maker of the motion that's on the floor at the time. The receiving file, I think, was a friendly amendment.'",
        "'speaker_4': 'Friendly amendments to.'",
        "'speaker_0': 'The.'",
        "'speaker_4': 'Friendly minimum standards to Bossi. Instead of receiving in file send received to Bossi.'",
        "'speaker_5': 'I believe that Councilmember Mongo has requested Councilmember Urunga to consider that as an amendment to his motion. Is that correct? That would be appropriate at this time, as discussion of the receiving file motion is a different.'",
        "'speaker_0': 'Well let's well council councilmember Ranka do on to respond to that.'",
        "'speaker_3': 'You missed your item. Well I appreciate the the effort I think that it.'",
        "'speaker_5': 'Changes my motion frankly. And I think I'll stick with what I get right now.'",
        "'speaker_2': 'Substitute substitute is receiving.'",
        "'speaker_0': 'Okay. And now we're back to the vice mayor. Thought they were going to go for a vote.'",
        "'speaker_3': 'So. So.'",
        "'speaker_0': 'First, Mary Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor, I. I think in the interest of what I've heard from our council colleagues, my council colleagues, not just tonight, but truly throughout the various meetings that we've had, the the better alternative would be to send it back to committee this.'",
        "'speaker_2': 'I acknowledge that this item is not worded, even reading parts of it with Councilmember Gonzalez, it's not worded exactly as it should be. Just in hearing the misunderstanding of what a council letter means as a staff member to another city council letter comes from staff.'",
        "'speaker_2': 'It's clear to me that all of us don't understand that to be the same because it sounds as though it's a council agenda item. This should be reworded. I do think it does speak to the spirit of what each of us wants, and receiving and filing doesn't provide that opportunity.'",
        "'speaker_2': 'I think sending it back to committee, I might humbly request that of Council Member your anger. I would appreciate that as chair of the Budget Oversight Committee, I think it's very important for us to at least have the opportunity to review these fiscal impact statements from from staff and look at a good policy that we would all'",
        "'speaker_2': 'agree on.'",
        "'speaker_0': 'Comes from Ringo.'",
        "'speaker_5': 'What I need at this point, I guess, is a clarification going, you know, say I'm old and I get sleepy in late. Perhaps I could get a read from the city attorney in terms of a definition and a clarification as to what it means to receive and file.'",
        "'speaker_5': 'From what I'm hearing, from what I'm hearing is that there is some issues with this as it is currently presented. There's a willingness by the EEOC to revisit it, reword it and bring it back. Does receive a file, provide that opportunity their counsel merry around the the answer would be it doesn't eliminate the ability of the EEOC'",
        "'speaker_5': 'to bring up an item again to discuss policy. What I think the the maker of the substitute or the request for the friendly amendment would be that this would be a more efficient way of directing the EEOC to revisit this issue.'",
        "'speaker_5': 'But either way, it could be revisited by the EEOC.'",
        "'speaker_0': 'Okay. So so Councilmember Turanga, is your is are you keeping your receiving information or are you accepting advice, Mary?'",
        "'speaker_5': 'And those the received information apparently brings it back eventually, later, when when the beauty has another opportunity to revisit this item.'",
        "'speaker_0': 'Okay.'",
        "'speaker_5': 'So I'll stay with the receiving file.'",
        "'speaker_0': 'Okay. I'm going to go back to Vice Marie Lowenthal and then we need to get to a vote soon. We have right now on the floor is the motion to receive and file Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I want to thank Mr. Parkin for his explanation. So, Councilmember Your Honor. What I want each committee chair has the authority to set an agenda for the committee, and. And that's clear. What I wanted to align with the committee agenda is, is really support from this body to consider this policy.'",
        "'speaker_2': 'We could still do it and we may still do it. In the spirit of collaboration, I'd prefer to do it knowing that our council members would like to have that discussion. And so do we have the authority as chairpersons to do that?'",
        "'speaker_2': 'Certainly I can set the agenda, I can do that, but I'd like to do that knowing that you'd be open to that conversation. And that's what I'm urging from you.'",
        "'speaker_0': 'I think I think Vice Mayor Lowenthal clearly would like to bring this back to the BRC. And that's that's a request. Certainly she could bring it back regardless. But I think she's asking that in this and in the spirit of of taking it back and collegiality.'",
        "'speaker_0': 'Councilmember.'",
        "'speaker_5': 'Go ahead. Well, I'll defer to if you if you drop your motion to.'",
        "'speaker_8': 'Accept this.'",
        "'speaker_5': 'And change your motion to take it back to the.'",
        "'speaker_13': 'EEOC.'",
        "'speaker_0': 'And I think I think if you accept the friendly amendment to take to go back to the U.S., that takes care of that.'",
        "'speaker_5': 'Well, then we're good.'",
        "'speaker_2': 'I just wanted you to be the author of that motion.'",
        "'speaker_3': 'We also need the second.'",
        "'speaker_0': 'Yeah. So is there a second to. Okay. Okay. So we have okay, everyone, we have a motion on the floor which is to send back to Bossie. That is the motion on the floor. Councilman Richardson.'",
        "'speaker_13': 'So I would I would just say and I'm going to support this motion. I'm going to say as another friendly that with this direction to the C, we're unequivocally clear that what should come back is this policy. But to address ensuring that what city staff do they have the same requirement that what we do as what city'",
        "'speaker_13': 'council does and that. You know, our city council items will not be delayed, tampered with, adjusted. Stamped anything before we actually placed them on the agenda. So I want to I want to make sure that that's protected in this recommendation.'",
        "'speaker_2': 'Guaranteed. I think it'll just be in plain English. This document is not in plain English. So.'",
        "'speaker_0': 'Okay, so there's. We have a friendly amendment. Did I. Did you even do public comment on this? Because I don't. I think we did. It's been such a long time ago. So great. We have it. We have a motion on the floor to send back to B or C.'",
        "'speaker_0': 'Please cast your vote.'",
        "'speaker_1': 'Councilmember Richardson. Bush and Kerry. Eight zero.'",
        "'speaker_0': 'Okay, next item.'"
    ],
    "Amended and Restated Lease for Parking under Queens Way Bridge.": [
        "'speaker_1': 'Item 23 is a report from the City Manager recommendation to execute an amended and restated lease with legacy partners. One. Long Beach Ocean Gate for the use of city owned property located under the Queensway Bridge along West Seas Highway District two.'",
        "'speaker_0': 'Okay. Vice Admiral Lowenthal. I. Item 22.'",
        "'speaker_2': '23. No. 22. I'll make the motion.'",
        "'speaker_0': 'Okay. Vice Mayor Lowenthal, there's a second by Councilmember Andrews public comment. Mr. Good who come forward.'",
        "'speaker_3': 'Very good. Hugh Clark, as he addressed if my reading of the attached information for the council is correct. Included in his expenditures. There's a half a million dollars for chairs. I don't know if anybody's priced that out. I don't know what you're buying them for the Kardashians or who you're buying them from.'",
        "'speaker_3': 'But a half a million dollars of chairs there. This is the item 23. We're on item 22. I'm sorry. I thought you were on 23.'",
        "'speaker_0': 'Okay. Thank you. We have a vote now. The motion that made. Please cast those.'",
        "'speaker_1': 'Bush and Kerry, seven zero.'",
        "'speaker_0': 'Okay. We're now actually going to hear item 38 because there's members of the public that are here for it. And so there's been a request from a council member to move that up. So Will we will move item 38 next.'"
    ],
    "Agreement with City of Bellflower for Traffic Study and Potential Traffic Control Device Installation.": [
        "'speaker_1': 'Item 38 is a report from Councilmember Councilmember Richardson recommendation to authorize city manager to negotiate an agreement with the City of Bellflower to undertake a traffic study at the intersection of Downey Avenue and 64th Street in the City of Bellflower for the purpose for the purchase of determining if installation of a traffic control device at that intersection'",
        "'speaker_1': 'is warranted.'",
        "'speaker_0': 'Okay, Councilman Richardson.'",
        "'speaker_13': 'Thank you, Mr. Mayor. So I wanted to first thank our residents for hanging out this late. We have represented representatives from the Ramona Park neighborhood and the St Francis and Andy Street neighborhoods. So the Downey Avenue and 64th Street intersection has been a common problem and complaint in the ninth District for a number of years.'",
        "'speaker_13': 'The most common complaint is the speeding along Downey Avenue due to due to no traffic signals along the no slow, you know, traffic measures between Artesia and South Street, which is a long stretch. And so another complaint is the inability to turn onto Downey from 64th due to low visibility on the street.'",
        "'speaker_13': 'And again, the need to pick up speed very quickly due to the speed of oncoming traffic. And while the area on the on one side of the street is Downey is the city of Bellflower. On the other side of the street is in Long Beach, and its residents of Long Beach are where, you know, they heavily use'",
        "'speaker_13': 'this intersection. So this isn't this isn't new or unique to our district. Our district borders, Lakewood, Bellflower, Paramount, Compton, Rancho Dominguez. We board are five agencies, and we commonly have issues across across boundaries and borders of those agencies.'",
        "'speaker_13': 'For example, when El Camino College, Compton Center, when they went to construction, it impacted our residents because on the other side of the border was a college. It was no residents there. So we came to the we were nimble enough to bring it to city council, create a new ordinance, a temporary construction related preferential parking ordinance to'",
        "'speaker_13': 'mitigate those impacts. And there are examples across all different corners of our our our borders when sometimes, you know, the cities don't get along so well and the cities may not communicate very well, such as this experience. The city has tried unsuccessfully to work with the City of Bellflower for coming up on maybe a year now to'",
        "'speaker_13': 'address the issues of speeding. So now we're at a point where we've asked our city manager to speak out and to engage the residents and the city manager in Bellflower and the City of Bellflower about a study. And so they've they've brought us to a point where we have to we have to bring it to city council'",
        "'speaker_13': 'to make sure that we give them we prepare the the city manager with the ability and authority to go in, negotiate a traffic study. Now, I'm going to ask the city manager to chime in on some of these discussions with the City of Bellflower.'",
        "'speaker_13': 'But my it's my understanding that City of Bellflower has outright said if the study will allow the study, but if the study comes back that indeed you need a traffic signal, we're not going to put anything we're going to require the city of Long Beach to pay every dollar of this.'",
        "'speaker_13': 'So that said, that prompted a couple of questions for me before I place this on the city council agenda. The first question it prompted, which is, was, have we ever engaged in signal agreements with other agencies, other border cities?'",
        "'speaker_13': 'And the answer was yes. We're engaged in a number of signal discussions, signal agreements with a number of bordering cities. Secondly, what's the cost to install such a signal? So that's been vetted out and it could be a range between 175000 to 250000.'",
        "'speaker_13': 'The last thing the last thing I would want to do is bring in a recommendation, the city council that was unfunded. So we've identified $275,000 from our District nine infrastructure funds to in case a signal is warranted. We can fund that if it is on the higher end up to 250,000.'",
        "'speaker_13': 'I would imagine that this is going to come back during the budget cycle so we can identify additional funds to make sure that this is funded in FY16. Given that it's going to take us a while to finish the study and we're going to be well into the budget discussion then.'",
        "'speaker_13': 'So that said, my motion is to accept the motion as written, but where it says funds fund an additional expenditure of up to $75,000 in general, fund money for construction of the traffic control device. I want to make sure that I clarify that we're willing to pay 175,000 from District nine infrastructure funds and requesting that if there's'",
        "'speaker_13': 'additional funds are needed, that those be considered within the 516 funds, traffic CIP funds available. So that would be my motion.'",
        "'speaker_0': 'But there's a motion and a second.'",
        "'speaker_13': 'Oh, and I want to hear from city manager, too.'",
        "'speaker_0': 'There's been emotion and a second. Mr. West, do you want to comment on Councilor Richardson's comments?'",
        "'speaker_3': 'Mayor Councilmembers I just want to.'",
        "'speaker_5': 'Reiterate what the councilman said. The City of Bellflower has indeed said.'",
        "'speaker_3': 'That they.'",
        "'speaker_5': 'Will allow a traffic study to be made. And if that traffic study shows that there's a need for a traffic signal, they will require us to build a traffic signal. They will split some of the costs in maintaining the traffic signal.'",
        "'speaker_5': 'And there's certainly you know, it's up to the city attorney to advise us on what a liability issue would be. We haven't had time to look at that.'",
        "'speaker_0': 'Okay. Any member do we want to take members of the public first or come from Boston to join in? Because two members of the public, if you want to come speak on this, please come down and identify yourself for the record.'",
        "'speaker_6': 'Good evening, Mr. Mayor and council members. My name is Phil, so I'm here. 35, 18 lira. I live next to Downey Avenue. Downey Avenue. Between the two signals.'",
        "'speaker_3': 'That Councilman Richardson's talking about is.'",
        "'speaker_6': 'Approximately, I'd say, in regular city blocks, probably about ten, 12 blocks.'",
        "'speaker_3': 'Long. So there's quite a distance and.'",
        "'speaker_6': 'Both the city of Long Beach and the city of Bellflower. Often the police departments got to the point where they have radar stops on that particular street because of the the speeding on that particular street. It's I've lived there for a number of years, and the traffic has increased quite a bit, primarily at the south end of'",
        "'speaker_6': 'that because of commercial development in the northern part, three quarters is residential and.'",
        "'speaker_3': 'The last part is commercial and.'",
        "'speaker_6': 'It's also used primarily by one of the commercial things at the South End is Lakewood Regional Hospital. And we get a lot of traffic going down there for the city of Compton uses Lakewood Regional Hospital as their for their emergency services.'",
        "'speaker_6': 'I hear sirens all the time.'",
        "'speaker_3': 'Coming down there.'",
        "'speaker_6': 'It do. There's a market actually at the intersection that we're talking about. And many times when you come down down the avenue, you will find people trying to cross the street there. And it's very common to see that they're trying to dart between cars.'",
        "'speaker_6': 'And there has been problems with accidents further down where I live, we do have a problem getting on to down the avenue because of the traffic there and you kind of take your life in your own hands to get onto that street.'",
        "'speaker_6': 'So. And those are for those reasons, I think we really need to address that street, you know, traffic control and that particular street for those issues. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Good evening, Mayor and City Council. I have lived in the ninth district for 42 years and right off of Downey Avenue numerous times I've heard accidents. Even just the short distance that I'm away, we measured Downey Avenue between Artesia and South, and it's a mile.'",
        "'speaker_10': 'I have seen where Bellflower, the city of Bellflower, put a speed limit sign of 40 miles an hour, and you go barely one block and into Long Beach. And it's changed to 35 and they just don't recognize it.'",
        "'speaker_10': 'I personally have had an accident at that intersection just a year and a half ago. There was another one where an ambulance was tipped over, but somebody trying to come out on Tony Avenue. So I'd really appreciate anything that the city can do to help control our speed on that particular street.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_4': 'Good evening, Mayor Garcia. Members of the council. My name is Laverne Duncan. I represent the Andy Street Association and I'm here this evening. First, I want to say that I came downtown from up in North Long Beach because I feel that if we just send our comments in, we can't see how you're reacting to what we're saying'",
        "'speaker_4': '. So I really appreciate the fact that you guys listen and hear what we have to say. I represent a lot of residents that may not necessarily come downtown or may not have a voice yet. And that's the voice I want to bring here tonight in support of this agenda item.'",
        "'speaker_4': 'Our council member attends all of our association meetings. We cross, attend each other's meetings. And this particular problem has come up many times in the last couple of years, especially. We now have a WinCo that's in Lakewood, actually, but it's on the corner of South and Downey, and that has increased the traffic tremendously because people come from'",
        "'speaker_4': 'all over to go to WinCo from other cities. And so we have a tremendous amount of traffic. We have kids that come from Collins that get off the bus. And because there are no traffic lights and any traffic crossings, there is that major potential for kids to be harmed.'",
        "'speaker_4': 'So I'm a youth advocate as well as for the elderly in our area. We really, really need some type of traffic signal because that's a very long stretch and people just continue to speed down that freeway and that makes it harmful for everyone.'",
        "'speaker_4': 'I just want to encourage all of you to take a take a ride up there and see exactly what it looks like. I know some of you, especially your new members, are very much data oriented. I appreciate that.'",
        "'speaker_4': 'But take a look at what we're doing. I know our mayor knows what I'm talking about because he's been a great supporter of of of Andy Street and what we've done. So I just want to encourage you guys to please, please support this, because there is a human cost, not just dollars and cents.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Hi. My name is Dale Utterback, the Ramona Park Homeowners Association. I want to thank Councilmember Richardson for doggedly pursuing this. For the last three years, I've been in the resident of the area for five years and I've seen the small business on the corner.'",
        "'speaker_5': 'It's a.'",
        "'speaker_6': 'Market there. Wall has been destroyed three times.'",
        "'speaker_13': 'There's actually I believe there was a fatality of a pedestrian at that intersection.'",
        "'speaker_5': 'I'll just echo what my.'",
        "'speaker_6': 'Fellow participant said. We need to slow it down. It's a safety issue.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Now I have Councilmember Austin.'",
        "'speaker_8': 'Thank you. And I do appreciate, first of all, Councilmember Richardson for bringing this forward. Pedestrian traffic safety is a very important role for this council and for the city. Safety for residents is is our primary responsibility, I think.'",
        "'speaker_8': 'And I appreciate the residents for coming down and adding a human touch to this this this item I did. The thing that I'm going to support this, number one, because, you know, Councilmember Richardson is putting forth and contributing a significant amount of resources from his own discretionary infrastructure funds that are limited to this and to to this'",
        "'speaker_8': 'particular community, which he should be commended for. You know, that money could go toward fixing sidewalks or, you know, getting new treat new streets. But he's he's committed it to the to the Ramona Park Andy Street communities for for safer pedestrian and vehicular traffic.'",
        "'speaker_8': 'But I'm concerned about the the the sheer cost or the lack thereof from the city of Bellflower. And, you know, it would be really great to see the residents in that city who are just across the Downey Avenue organize the way these residents are due to go to their city council and demand the same.'",
        "'speaker_8': 'You know, because I think there is there should be a shared responsibility. And I think Councilmember Bridget Richardson raises some some significant issues in terms of border cities and, you know, our shared responsibility. So with that, I had a few questions, but I'm going to leave that alone for now and support this item and urge my council'",
        "'speaker_8': 'colleagues to do so as well.'",
        "'speaker_0': 'Councilwoman Gonzalez.'",
        "'speaker_9': 'Thank you. I also just had questions for the city manager. I want to thank you first for bringing this up because I know sometimes we have to do what we have to do in order to make sure that safety is the first and main concern.'",
        "'speaker_9': 'But what is the city of Belfast? And perhaps this was mentioned when I left, but what is their take on all of this and their stance? And why aren't they involved?'",
        "'speaker_3': 'In discussing with the city manager.'",
        "'speaker_5': 'He didn't feel there was enough of a need at his level to initiate this, and that could have been represented that maybe Bellflower doesn't have the the quarter million dollars to build a traffic signal to. Sure. But but certainly he made it very clear that they were not interested in helping to fund this.'",
        "'speaker_9': 'Okay. Thank you.'",
        "'speaker_0': 'By Mary Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I wanted to. And I'm sorry if this question was already asked of the city attorney. In terms of liability, I have a limited understanding of what conducting a traffic study would do in terms of where it places us on the liability spectrum.'",
        "'speaker_2': 'If we can if we conducted the traffic study and installed the traffic light.'",
        "'speaker_3': 'The Vice Mayor The way I.'",
        "'speaker_5': 'Understand the amended motion is that the City of Bellflower would be requiring us to conduct the traffic study in a maybe shared or not shared cost. I'm not clear. And then if the traffic study indicates that a traffic signal needs to be installed at that location, the city of Long Beach would have to fund that.'",
        "'speaker_5': 'And that, I believe, is the motion this evening. So if there was 175,000 and whatever the additional costs above 175, the city tonight would be approving our commitment to fund the entire requirement of the traffic study. And the reason I think Bellflower is requiring that is if the if we do it, they have knowledge of a traffic'",
        "'speaker_5': 'study that requires some sort of mitigation or traffic calming measure, and they don't do that. It could potentially expose them to liability while the city this isn't in the city of Long Beach, so there would be no liability to us.'",
        "'speaker_0': 'Mr. West, I have a question because I am wondering. It appears that there's probably been advocacy in the past for this intersection from the community or from the council. So I know it's been our practice that when there is advocacy on certain certain intersections, that we include those in our annual CHP book, and then we get those'",
        "'speaker_0': 'through the budget process. And I'm just wondering, is has this been on the on staff's radar? Is why is it not been in the past possibly allocated? And is there an intention for it to be included in the future?'",
        "'speaker_0': 'Is there any comment on that? Or maybe I don't know. Mr. MALONE If I can comment or if you can comment on that.'",
        "'speaker_3': 'I'm. You want to comment on that? Absolutely.'",
        "'speaker_8': 'We need.'",
        "'speaker_3': 'To visualize.'",
        "'speaker_8': 'This intersection that, you know, there's a map that was submitted. But basically this intersection, 75% of it is in City of Bellflower. Only 25% is in City of Long Beach. We cannot initiate a city project in another city unless the council direct us.'",
        "'speaker_0': 'So. So you're saying that that 75% of the project is in the city of Bellflower. Okay.'",
        "'speaker_8': 'I think for from traffic purposes, there are four legs to this intersection. And if you can see the city boundary line, which is basically at the curve face of westerly side of. The street. There's only.'",
        "'speaker_5': 'Let me look at this.'",
        "'speaker_8': '64th Street is the only street that it's in city of Long Beach. So the entire Downey Avenue is in City of Bellflower. The. That's at the bottom corner.'",
        "'speaker_0': 'Mr. Maloney, you're essentially saying that in the past it appears that there's maybe been some discussions about this intersection, but because a portion of it is in another city, we couldn't add it to our side people. Correct. But I'm under the assumption that.'",
        "'speaker_0': 'So we couldn't even in the past have added a traffic study in through the CIPA process or through the general budgeting process, or has that ever been considered?'",
        "'speaker_5': 'I just want to make it clear that if to do a traffic study, Vellfire is requiring us to build the signal that the traffic study says there is going to be a signal signals necessary. I mean.'",
        "'speaker_0': 'That seems be very honest, just completely unreasonable.'",
        "'speaker_5': 'So we wouldn't initiate that on our own without knowing that the city council's ready to fund the quarter million dollars.'",
        "'speaker_0': 'And I'll also just say, regardless of what happens tonight, that I'm more than happy to have a conversation with the mayor, you know, tomorrow or the next day. Because if it's if at the management level or not, it's not you know, it's I would think that the elected officials would be a little bit more open to hopefully'",
        "'speaker_0': 'working with us. It seems completely unreasonable that this community is not able is suffering because of an issue that is being. Kind of stopped because of another city.'",
        "'speaker_13': 'And just just to add to that, Mr. Mayor, and I want to be clear, like, I don't want to have to spend hours Long Beach money in a different city if we don't have to. I want to like the city staff has indicated to me they're stuck at a place where they can't continue negotiate until we give'",
        "'speaker_13': 'them some direction and appropriate the money. I think they've set the range 175 to 250. I'm willing to put up our 175 so that they can continue to negotiate and that we're in a position to that we should commit to building it.'",
        "'speaker_13': 'So that they they don't have to come back to us and keep checking in about this awkward situation. And you're absolutely right. It's been unreasonable. There's been outreach to the residents on that site. On one side is single family homes and the other side is apartments.'",
        "'speaker_13': 'And it's more difficult to engage them to engage their their council representatives. There's been outreach to the council and there's been numerous discussions, staff to staff, and I've had discussions with council members as well as the city manager when I was chief of staff.'",
        "'speaker_13': 'So some of these, again, we border Lakewood, Bellflower, Paramount, just around this area. If you go to more blocks now on both sides of the street or in Long Beach, so it's literally just awkward intersection that we can't we can't study.'",
        "'speaker_13': 'And we're stuck in this place until we give them some direction. And that's my understanding. And I wouldn't have brought this the city council, because I feel I personally my position was that our one time dollars could have been used on a study because there's a nexus on that area.'",
        "'speaker_13': 'But they're at a place where they need direction, right. They need to bring it to the city council in order to continue this fight.'",
        "'speaker_0': 'Okay. Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I, I completely understand the advocacy on behalf of the residents in the community. And and I'm glad for the question regarding the capital improvement project and understanding which corner belongs to us and and the other city.'",
        "'speaker_2': 'I think from a from a precedent standpoint, I struggle with this because it is applying general fund dollars toward. A project that's in some part not in our city, regardless of the benefit. And in those situations I'm looking to Mr. the city manager.'",
        "'speaker_2': 'I have observed circumstances where the COG or some other regional agency would step in and and offer some opportunity to conduct perhaps not a traffic study, but there have been other circumstances where it's multi-jurisdictional. Maybe just two jurisdictions are involved where it's not one city that's on the hook for the resources.'",
        "'speaker_2': 'Have you observed that in recent memory?'",
        "'speaker_3': 'A For a.'",
        "'speaker_5': 'Traffic signal, an entity like the Gateway Cities Council of Government would not get involved. They wouldn't look at this as a regional issue, and they certainly don't want to get involved. Between a scuffle between two municipalities, unless it's a regional issue.'",
        "'speaker_5': 'So I think this is probably the.'",
        "'speaker_3': 'The.'",
        "'speaker_5': 'Best advocacy that I'm hearing would be for the mayor to reach out to the mayor of Bellflower and see if, indeed the elected officials feel that way.'",
        "'speaker_2': 'And I would agree with that approach as well. I, I want this to be resolved for our residents. It becomes a very, very. Undesirable precedent setting standard, and one that I don't believe this council should be willing to exercise because then it it obviates the responsibility from other jurisdictions.'",
        "'speaker_2': 'And I struggle with that. We have similar issues for services such as language transit. They have they go beyond the city of Long Beach, even if they want a bus stop in a particular location outside of the city of Long Beach.'",
        "'speaker_2': 'And we would want to fund it. We don't fund it because that's that's a bad precedent.'",
        "'speaker_3': 'And the when lobby transit goes outside the city, that.'",
        "'speaker_5': 'City funds everything for for Long Beach Transit.'",
        "'speaker_2': 'Absolutely. And the and the benefit isn't just to the residents of that city or our city, but there is a mutual benefit there. And in keeping with that spirit, I'd like to support that effort. I'd like to support the mayor's reaching out to the council members and, and going forward.'",
        "'speaker_2': 'Mr.. Mr.. MALLOY And even if the project is only a certain percentage in the city of Long Beach, could you not include in your cap consideration when you bring it forward to council a notation or a request that there is there is an interest because my interest would be to make sure that we keep in line with'",
        "'speaker_2': 'how we budget and and make sure that we come through a budget process and that these requests are considered with the larger context, within the larger context of our entire budget. And so if there's a mechanism to do that going forward, that's something we would look at.'",
        "'speaker_2': 'I still do not support funding this from General Fund. My first option would be to go through the route that the mayor suggested.'",
        "'speaker_0': 'Let me make a comment to go out to Councilman Richardson. So I just want to make also very clear, I think, Councilman, what you're doing because is the right thing. I mean, you're you've hit a wall. These neighborhoods these neighborhoods need relief here.'",
        "'speaker_0': 'And so we're try to come up with a solution. Just to Mr. West, I would think that moving forward also, I understand there was a roadblock in the budget book that you'd council approval. But this would be I would I would think that regardless of whether part of it's in Bellflower or not, we have a responsibility to'",
        "'speaker_0': 'still try to fix the problem. And so I would think that in through the budget cycle or moving forward, if there's issues like this arise, I think those could be brought to us through the budget cycle and let us know, by the way, this is an important intersection.'",
        "'speaker_0': 'We've got it. We need a light. But if we, you know, we need additional approval because part of its in Bellflower or what have you and I think I think the council would probably you know, we don't know yet, but it sounds like that's something that we would be very, very supportive of.'",
        "'speaker_0': 'So I, I'm not sure where everyone's at on this. I'd be happy to have some additional conversations, but I think this issue has got to get resolved. And clearly this intersections are a problem for us. Councilman Richardson.'",
        "'speaker_13': 'Thank you. So. So a couple of things. So I want to thank you for your suggestion or your your your offer to reach out. And I would hope that I would want to include that as a part of this.'",
        "'speaker_13': 'But secondly, I want to just chime in on the precedent. So, Mr. City Attorney, are we engaged in any any agreements with other cities about signals?'",
        "'speaker_5': 'As a question. Have we done that in the past? And we have done that in the past.'",
        "'speaker_13': 'Okay. Can you give an example?'",
        "'speaker_5': 'Well, the example that I'm aware of is at the on Carson Avenue, when we built the town center, we reached an agreement, I believe, with the city of wine gardens, but not I'm not sure if we've agreed to build a signal 100% of it for any city.'",
        "'speaker_13': 'So so for me, what this is, is it they've been very clear with us that you cannot conduct this study. We don't know if that even warrants a signal. You will not do this study unless you commit. You are prepared to build this signal because we have no will to do it.'",
        "'speaker_13': 'So what I'm saying is I'm willing to put up our our my district nine resources. If it if that is tapped out, then bring it back in the context of the CERP, the traffic CIP in the next budget, which is in line with what Vice Mayor Lawndale said.'",
        "'speaker_13': 'But I want to give them I want to give you the ability to go negotiate. I want to give the the city manager the ability to go negotiate and let's get this done so we don't have to come back at every incremental point in this.'",
        "'speaker_13': 'So that's it. I mean, I want to continue the main motion. I think that I think that we can accomplish what I think we want to. I don't know if I need to say it because it sounds like you're going to do it anyway, which is good.'",
        "'speaker_13': 'Do you need me to put that in the motion for you to engage the city?'",
        "'speaker_0': 'I think I'm going to I'm going to talk to Mr. West and we're going to, you know, okay.'",
        "'speaker_13': 'Think about it. And just to be clear, if you don't have to spend our general fund dollars, don't. But I just after going through this for 2 to 3 years, I know what was at the bottom. You know, at the end of the day, this is going to be on us to do that.'",
        "'speaker_0': 'Just to clarify, Councilmember, I think are you asking that that that this item be considered through the CIP general fund budgeting process access?'",
        "'speaker_13': 'Yeah. If if 175 doesn't get us there.'",
        "'speaker_0': 'The rest of the rest the rest would be done through yet through the separate.'",
        "'speaker_13': 'Three CFP budget process. Well that is the general fund. That's what they mean by general fund.'",
        "'speaker_0': 'No, Mr. City attorney wants to chime in and then I'm going to go to Vice Mayor Lewis.'",
        "'speaker_13': 'I want to clarify my motion. Yes. If if for some reason that's not enough, then yes, it would go through our CFP process. And I had that conversation with the city manager about what would that look like? You know, how long would that take, considering we're not asking for a quarter million dollar signal after 175 hours spent'",
        "'speaker_13': ', we're talking about, you know, whatever the gap is, 25,000, 50,000, 75,000. So that was just I just wanted to clarify that. That's my intent.'",
        "'speaker_0': 'Okay. Mr. City Attorney.'",
        "'speaker_3': 'My point or.'",
        "'speaker_5': 'Clarification for the council members motion is that at that point there'll be there'll be no obligating, there'll be no opportunity for the city council to say no. The only thing you would be doing at that time is allocating finding where that additional money would come from.'",
        "'speaker_5': 'Tonight, as I understand, the maker's motion, you're committing to building whatever is required there. So the and I don't know where the estimates came from, but if it's $175,000, then you have completely funded the project. But if it isn't 125 or if it's more than 175,000, the city is going to be contractually obligated to pay that difference'",
        "'speaker_5': '. And what would come back to you is whatever that difference was, is where the council would like to take that money from.'",
        "'speaker_0': 'OC Vice Mayor Lowenthal.'",
        "'speaker_2': 'In fear of sounding redundant. Councilmember Richardson The 175, as stated in your agenda item, is coming from Discretionary Infrastructure Fund. Your motion tonight is not requesting any general fund support. Is that correct? Outside of adding it to the CHP for the next fiscal year, which is a process that I would support.'",
        "'speaker_13': 'But tonight tonight I want I. This will be a better question for the city manager, because they're the ones who brought it to me and said, we're stuck. This needs to go to city council. So I need to find out what action they need tonight.'",
        "'speaker_13': 'This recommendation, this motion was, you know, submitted and consulted over. If I want to make sure what we vote on tonight gives them what they need to go negotiate with Bellflower.'",
        "'speaker_0': 'So let me ask this. Mr.. Mr. West, Vice Mayor, if I may. So, Mr. West, how can we what's your suggestion to craft this in a way where where we can work together and come up with a solution, and so that this community knows we're moving forward on this and this issue.'",
        "'speaker_5': 'Mayor Councilmembers, again, this is a supplemental item. So it really came to us yesterday. So we've been noodling this since yesterday to try to come up with an opportunity where we would come up with an extra potentially up to $70,000.'",
        "'speaker_5': 'So going forward right now would lock us into spending the 0 to $70000 and do the the signal. So my conversation with the city manager of Bellflower was yesterday and again, I don't want to delay this or anything like that.'",
        "'speaker_3': 'But it would be nice to have a chance, a letter to the city, to the city.'",
        "'speaker_5': 'Manager, asking him for to take this to his city council.'",
        "'speaker_3': 'So that the city council looks at it or something. Because right now I'm just dealing with the city manager. I don't have the ethical opportunity to talk.'",
        "'speaker_5': 'To his council members. I can only talk to the council, to the city manager. So it stops at that level for me without sending a letter or something like that and raising it to that attention.'",
        "'speaker_0': 'Okay. Councilmember Austin.'",
        "'speaker_8': 'Yes. Thank you. And I do appreciate the the the robust conversation here. Again, Councilmember Richardson has has committed a significant amount of his discretionary infrastructure funds to set aside for this project, including a traffic study. And I'm not exactly clear what his original motion was, because it sounded like he had modified the with what is written here'",
        "'speaker_8': 'on the in the agenda item to say instead of coming from the general fund for construction that it would be B laid over for the CHP. The question I have regarding CHP, there is a priority list in terms of CHP projects that have already been approved.'",
        "'speaker_8': 'Is that correct? That's correct. All right. And so and if we were to approve this in this this the way it is laid out before us or has been presented in this motion, which I seconded, it would would that somehow leapfrog the did the list.'",
        "'speaker_3': 'Or will it put.'",
        "'speaker_8': 'Priority on this?'",
        "'speaker_5': 'Again, if the traffic study mandated a traffic signal, yes, we would be required to find the 0 to $70000, which would could leapfrog a list and or do something like that. But we would be required to bring to you a $70,000 solution during the fiscal year 16 budget.'",
        "'speaker_8': 'So. So if Councilmember Richardson were to to say and I want to get to a solution that that is that is responsible here today, fiscally and fairly for for all parties involved. If he were to instead of saying committing the CHP budget, instead say he's committing his infrastructure budget for for FY 15, would that would that would'",
        "'speaker_8': 'that be better or more? More, I guess, responsible way to to do this?'",
        "'speaker_3': 'I don't understand you for his thoughts.'",
        "'speaker_8': 'So instead of CHP it would be infrastructure dollars for future for future year for for ninth district.'",
        "'speaker_3': 'We we.'",
        "'speaker_5': 'Would. Given what the council's talked about, we would love to have the opportunity to sit down with our public works director, our traffic engineer, to look at other opportunities, maybe to backfill the general fund money and go for Prop C or some other funding source or gas tax money that would do a traffic signal.'",
        "'speaker_5': 'Look at the priorities of the traffic signals that are supposed to be funded this year and next year. And look at all that. That would be nice to have the time to do that.'",
        "'speaker_8': 'So. So council. Richardson would you be open to just using the or committing the $175,000 of your discretionary funds to fund this traffic study and committing that toward the the the the signal? And then if there's anything above that.'",
        "'speaker_13': 'That's my motion. It would come back in the C.'",
        "'speaker_8': 'But you're saying skip which, which, which.'",
        "'speaker_13': 'Is what we approve every year in the budget. I had a conversation today with Tom Modica, who indicated that there's one and a half million dollars that's already allocated this year. This would have to come in a subsequent year.'",
        "'speaker_13': 'Are you comfortable with that? Yes, Mr. Assistant City Manager, absolutely. And I know also that just saw this the other day. I've got an email from my chief of staff to our Malloy in agreeing on the motion, the recommendation.'",
        "'speaker_13': 'So this is a lot I mean, this is I'm really surprised that this has taken this.'",
        "'speaker_8': 'Turn what this this issue. And I think the only thing reason I bring this up is that the cap has been voted on. It's been approved that that list is approved every year. And there are, I'm sure, a number of our districts that that have traffic studies that need traffic signals.'",
        "'speaker_8': 'I know of three of mine that I'd like to get on that CLP list as well. I think this is this isn't because this traffic signal hasn't been and this isn't in the city of Long Beach, Holly. It hasn't been considered on that VIP list in the past.'",
        "'speaker_8': 'I think you're asking for for some consideration. But what I'm hearing is that it would it would take priority, you know, over other over other projects.'",
        "'speaker_13': 'Future years haven't been established yet. So this year is already budgeted. This will not knock any any of the of the traffic signals that are in that one and a half million dollar fund. None of those are impacted.'",
        "'speaker_13': 'So I know a lot of the council was was out of the room when I opened this up. But the first thing I said was, there are two things I took in consideration. And one of them was like, How will we pay?'",
        "'speaker_13': 'How will we pay for this? Is there a signal fund? I knew that this would be an issue where it would potentially be put lower down on the rail. That's why we committed our funds. And we're saying if there's anything additional, put it in line, take it to the CHP, put it in line for that, but make'",
        "'speaker_13': 'it an official project.'",
        "'speaker_0': 'Next, I have Councilman Mango.'",
        "'speaker_4': 'I want to say that I really appreciate the dialog. I think that what I'm hearing from Al is something that I really agree on, which is while I would it is an unsound fiscal practice to commit future dollars, especially from the AP.'",
        "'speaker_4': 'Right now, oil prices are very low and we're not sure what kind of one time moneys are going to come in. And the Budget Oversight Committee has a process to review each and every one of these. And so while I appreciate the dialog between you to what I'm hearing from Councilmember Richardson does not match what I'm hearing'",
        "'speaker_4': 'from city attorney parking, which is where I'm having a big challenge. And so until I have a resolution of that, I have to vote no because I'm uncomfortable committing general fund dollars outside of the budget process. And as my colleague said, frog jumping or lily pad in other projects that have been in the queue.'",
        "'speaker_4': 'I completely agree that this is an issue that needs to be addressed. I also am very uncomfortable with this city taking on quote unquote unfunded mandates. This is us being given a mandate by another city stating that if we do work on behalf of our constituents, we are going to be stuck with the responsibility to pay for'",
        "'speaker_4': 'their traffic signal. If they were willing to put up their share of the traffic signal, of course we would want to partake in that. But my district borders several cities, Lakewood, Home and Gardens, Los Alamitos and more. And so in all of those areas, when those cities aren't willing to pay their share, that that's not acceptable.'",
        "'speaker_4': 'And I reach out to those councilmembers and I'm excited for the mayor to reach out. So I'm open to moving this to a future agenda item after the mayor and the city manager have been able to come back.'",
        "'speaker_4': 'You've been with this item for three years. Your commitment and dedication to the residents is appreciated. In the same way, I hear commitment and dedication to the projects that are already scheduled in our district and I'm sure and many others.'",
        "'speaker_4': 'And so thank you for bringing the item. And from what I'm hearing from City Attorney Parkin, this is a commitment of general fund dollars, whether it's next year or this year outside of the process Connex have.'",
        "'speaker_0': 'Councilor Richardson, did you have additional comments at this time because you're next queued up?'",
        "'speaker_13': 'So is the is the issue the gap between 175? And what the what the cost of signal is? Is that what is that? The discomfort that I'm hearing is that folks might think that this might stop an existing project in their district since this wasn't eligible to be factored into the CIPA discussion, does it not?'",
        "'speaker_13': 'And is that in general what it is?'",
        "'speaker_0': 'I and someone else jumped in. I think what I've heard from the counsel one is there's a there's a concern about something coming out of general fund dollars, not through the general budget process. And so I think we have an annual budget process we go through where those dollars are set aside.'",
        "'speaker_0': 'And I think that what I've heard is that there's some concern from some council members that this is outside that process. And then I think the other concern I heard is this idea of the other city having to pay or being or being part of paying a fair share of their portion of of that.'",
        "'speaker_0': 'I don't know if I missed anything else, but that's at least what I have heard so far.'",
        "'speaker_13': 'Okay. So what I would say is. My motion is $175,000. That does not impact anyone else's projects. If it's above that, it would come in within the budget process. Within the budget process, which means there is a need throughout the year.'",
        "'speaker_13': 'Departments all the time come across a need and established need and they factor that into their budget process. This would be adding to that list. There's a there's millions of dollars of projects on that list. And then if for some reason, you know, it factors into CERP and I'm five years out on the list that's on me'",
        "'speaker_13': 'to figure out what's my priority for the next if I want to move it up by using my my one time dollars in our district, because the priority that at least allows us to do that, we don't have any more red tape from Bellflower.'",
        "'speaker_13': 'My priority tonight is getting where we need to be, so we have a path forward entirely within the city, along beaches, wheelhouse. And so my motion, the motion that I set out, just to be clear, it's to get it entirely in our wheelhouse, give the city manager the ability to go, negotiate an agreement, be as aggressive as'",
        "'speaker_13': 'you need to. But we need to be prepared to move forward on this agreement. And yes, we border a bunch of different cities and these agreements, again, this is not precedent setting. We have these agreements in a number of cities.'",
        "'speaker_13': 'One of them was cited tonight and in Hawaiian Gardens.'",
        "'speaker_0': 'Okay. So just to I know that Mr. Parker, I wanted to wanted to chime in. And so the motion that I'm hearing from Councilman Richardson right now is different than the motion that was originally presented as you laid it out.'",
        "'speaker_0': 'So I want to make sure that we're all clear. So what I'm hearing, which sounds reasonable, is but as Councilor Richardson would like us to, he would like to dedicate 100 so 175 from his dollars to this project.'",
        "'speaker_0': 'Then he would like this project to be added to the CHP book list of projects which we do all the time and not he's not asking for it to, you know, jump ahead of the project. He's just adding he's asking for it to be added to the CHP book as a project to be worked on moving forward'",
        "'speaker_0': '. And in the meantime, the city manager and I and whatever else are going to engage in a conversation to see if we can move this project forward. That's what I've heard. Mr. City Attorney.'",
        "'speaker_5': 'May or members of the council. The only issue that that I would raise with that is the way I understand where the City of Bellflower is, is if the city commits to the traffic study.'",
        "'speaker_3': 'We are legally.'",
        "'speaker_5': 'Committed to install the traffic light. So unlike other projects on your city list where the council can prioritize those and approve those, you're going to have a legal obligation to pay that. Know what I'm hearing the councilmember say is there may be other sources of funds and.'",
        "'speaker_0': 'We're not and we're not. I think what the motion is now is we're not going that step yet. He's setting aside the 175 for this project and and the city manager are going to have some conversations and then the project is added to the scrapbook or.'",
        "'speaker_0': 'Councilman Richardson.'",
        "'speaker_13': 'So I would say I want to be able to give the city manager what he needs to go begin negotiation now and to continue the process. At the end of the day, the study might come back and say there is no no signal.'",
        "'speaker_13': 'We can't even have a study without agreeing to with the City of Bellflower to do this. So, like I said, if, if, if, if the real concern here is falling in line with the city, I would ask the question city the city staff, based on any research that that's been done, where would this fall in that the'",
        "'speaker_13': 'list as of today, because I know there's been some preliminary research done.'",
        "'speaker_12': 'So I'll take a first shot at that. When you asked us to take a look at where this falls in terms of the CHP process, you're correct. We do have about $1.5 million with the projects that are currently funded in our CHP.'",
        "'speaker_12': 'In our initial discussion about this today, the thought was that it would not impact that 1.5 million. Those are already projects that are allocated. We haven't allocated projects for FY 16 yet. We don't quite know what those resources are going to be.'",
        "'speaker_12': 'And so that was the concept and that's how any typical budget process would work within the city of Long Beach for our projects. I think what the wrinkle is that the city attorney brought up today on the floor is that essentially by by providing that direction to do the study and given what we know of City of'",
        "'speaker_12': 'Bellflower as constraints, they are going to require us to sign an agreement to say we will fund the entire allocation. So it may not be even 75. It may be more than that. It may be less than that.'",
        "'speaker_12': 'And so by providing potentially, you know, the 175 that you're providing and given the direction of the manager to go discuss with them, that would give us the ability to negotiate. But it is that extra step of saying every single or that we need to complete the project is what puts is what changes from our normal budgetary'",
        "'speaker_12': 'perspective, you know, our process.'",
        "'speaker_13': 'So just a quick. Question So what in terms of a timeline, if they were to say you have to do it, if they were to say you have to do is met your mandate to build this signal. And our study concludes, you know, after the budget process and we don't revisit this until the 2017 budget.'",
        "'speaker_13': 'Are we do we have a gun to our heads to get it built right then? Or can we say we don't have the funds allocated right now? But when we do.'",
        "'speaker_3': 'I'm I'm going to turn this over over to Ana. So I guess it would depend on the severity of the traffic study.'",
        "'speaker_8': 'That's correct. It becomes a liability issue for both cities. I mean, if if Bellflower is now been given notice that this study shows that you have to build a traffic signal, then the traffic signal needs to be built.'",
        "'speaker_8': 'And in case there are accidents during that period, then there's liability on that side. But also we need to negotiate or have a clearer understanding of who maintains this traffic signal and what portion of it, as far as liability goes, who's going to maintain.'",
        "'speaker_5': 'And who's going to absorb the.'",
        "'speaker_8': 'Liability. So in a typical situation, let's say we have a neighboring city and if three sides of an intersection belongs to another city and we.'",
        "'speaker_5': 'Own one, so it's one.'",
        "'speaker_8': 'Quarter or 25% of the city of Long Beach, we would be liable for 25% and they'll be liable for 75%. And also the same way we will split the maintenance cost.'",
        "'speaker_5': 'That would maintain 75%.'",
        "'speaker_8': 'Of the traffic signal and we will maintain or will be responsible for 25% of it. So, yes, the traffic study, if it comes positive, then puts everybody on notice that there is a need for that traffic signal. And this city of Bellflower will not allow us to do the traffic study unless we have a contract with them'",
        "'speaker_8': 'that says you will build this you shall build this traffic signal if the traffic study comes positive with the results.'",
        "'speaker_5': 'So it's it's it's a zero 200%.'",
        "'speaker_8': 'There's nothing in between. So either we do the traffic study and we pay for the whole construction of it, or we cannot do the.'",
        "'speaker_5': 'Traffic study period.'",
        "'speaker_8': 'Based on Bellflower comments.'",
        "'speaker_0': 'Okay. Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I wanted to restate my concern about. The potential of expending general fund dollars. I agree with Councilmember Austin in how he had articulated the piece on the cap, which I know has been resolved. What I understand, Councilmember Richardson, is your intent not to set back any other projects in.'",
        "'speaker_2': 'Q but in hearing Mr. Parkin's opinion, I am leaning toward favoring that leaning toward making my decision based on his opinion, which is that legal imperative is what guides us as opposed to our intent to solve the problem and solve it by not impacting other projects in.'",
        "'speaker_2': 'Q So I'm taking my direction from the city attorney's comments, which I firmly believe are accurate. And I think he perhaps, if I might just ask one one more clarifying question of you. Mr. Malloy. And so there is no in-between.'",
        "'speaker_2': 'It's either zero or 100%. And so one of the alternatives that Councilmember Richardson had suggested is that he would assign 175 from his discretionary infrastructure dollars. Would he be able to assign the rest if there were future discretionary dollars?'",
        "'speaker_2': 'And I believe the answer, while technically is yes, it doesn't help in this situation.'",
        "'speaker_5': 'That's correct. My understanding is that council members objective is to be able to come live here tonight with a project that the city can move forward with. It's my concern is that we're legally committing to a part as to some amount of money that's unfunded at this time and legally obligated to pay by us.'",
        "'speaker_2': 'Thank you. And that's and that's my concern as well. Mr. West, where are you going?'",
        "'speaker_5': 'Mayor Councilmembers. One of the an option might be and again, this is all up to Councilmember Richardson rather than we the the motion the basic motion doesn't give us an option to negotiate. It just says do it. So if given the fact, if I if I can go to the city of Bellflower with $175,000 that Councilman Richardson'",
        "'speaker_5': 'is putting on the table, that gives us an opportunity to negotiate. And I firmly believe if I'm sitting in that city manager shoes, it's going to you know, I would say.'",
        "'speaker_3': 'Yeah, absolutely.'",
        "'speaker_5': 'We'll go ahead and do that. It's a good gesture. And we then Bellflower will cover everything above the 175. But I think if I have that opportunity to go and negotiate that, talk about that, then that gives us an opening to talk about liability as well.'",
        "'speaker_5': 'And I can come back as quickly as possible to meet the councilmembers needs there. But $175,000 is nothing to sneeze at for a traffic signal. And it, as the councilmember pointed out, it very may well be, you know, close to that 175 and not be above that.'",
        "'speaker_5': 'But I think that might give me the opportunity to negotiate with the City of Bellflower.'",
        "'speaker_3': 'Along with that.'",
        "'speaker_5': 'Public works director, to use their property dollars or their gas tax dollars.'",
        "'speaker_3': 'To do that.'",
        "'speaker_2': 'And that shared responsibility and shared obligation approach as well as action. I would.'",
        "'speaker_3': 'Negotiate.'",
        "'speaker_2': 'Yes, absolutely. And as opposed to us saying we're going to fund it no matter what, there's no incentive on their part. And Councilmember Richardson, if you would be open to that, to changing your motion to that, I would reverse my my no vote to a yes vote.'",
        "'speaker_13': 'Absolutely.'",
        "'speaker_0': 'Okay. So the motion, just so we're clear, the motion is to direct the city manager to your city manager to negotiate with your Bellflower on this project and to set aside 175 as from from his infrastructure dollars to as a starting point for the city manager negotiate a price.'",
        "'speaker_3': 'And I'd like to say to protect councilmembers.'",
        "'speaker_5': 'Richardson's wallet up to 175.'",
        "'speaker_0': 'Right. Okay. And then as and as part of that.'",
        "'speaker_3': 'And.'",
        "'speaker_0': 'As part of that, I'd like to ask that. Councilor Richardson, you're okay with me sending a formal, formal letter over to the mayor, and we'll have a conversation about that. Okay. So that's the motion on the floor. I'd love to go to a vote counts from your end.'",
        "'speaker_0': 'Could you have another comment on.'",
        "'speaker_5': 'This discussion when exactly as they wanted it to go?'",
        "'speaker_0': 'Okay, great. Okay. We've done public comment. Councilmembers, please cast your vote.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'Next motion carry a general.'",
        "'speaker_0': 'Nexus item 25. We're going to jump to 25 because we have some folks here for that. Did you say 25?'",
        "'speaker_8': 'Yes. And Mr. Mayor, I've been advised by the city attorney that I should recuse myself from this particular vote because I serve on the board of the Fairfield Family YMCA. And so I need you to do that.'",
        "'speaker_4': 'Oh, okay.'",
        "'speaker_5': 'No.'",
        "'speaker_4': 'Not yet. 25.'"
    ],
    "Amended and Restated Lease with YMCA for City-owned Property.": [
        "'speaker_2': 'Madam Clerk. Adam 25.'",
        "'speaker_1': 'Item 25 is a report from City Manager and Parks and Recreation and Marine recommendation to execute an amended and restated lease with YMCA for city owned property at 4949 Atlantic Avenue.'",
        "'speaker_2': 'District 8/2 there's been a motion and a second. Councilmember Richardson.'",
        "'speaker_13': 'So just Councilmember Austin know that this is this is a very important YMCA in North Long Beach. Know I used to serve on the board. That was one of my introductions to Long Beach. And Councilman Brosnan is still currently a member of the board.'",
        "'speaker_13': 'He requested a staff report from our I mean, no, from Mike. Mr. Conway.'",
        "'speaker_3': 'Mayor Garcia, members of the City Council. This item relates to an amended lease with the Young Men's Christian Association for City Property at 4949 Atlantic Avenue in Share Park. The YMCA has leased the subject property since March of 1975, with their use being grandfathered in this zone.'",
        "'speaker_3': 'The YMCA constructed and owns the improvements, which includes an 8300 square foot building, an in-ground swimming pool and some parking improvements. The park and the improvements on the site will convert to city ownership at the end of the existing term in March of 2015.'",
        "'speaker_3': 'Since 1975, the YMCA has enjoyed a $1 a year lease, which is due to terminate next March, and staff is proposing a 20 year lease extension with 210 year unilateral options, with the requirement that for each extension the YMCA submit a facilities condition report indicating that the improvements reflect a facilities condition index of 10% or less.'",
        "'speaker_3': 'And this is done to ensure that the YMCA continues to maintain the facilities in a good or better condition. Also, staff has negotiated a market rate lease of $6,225 per month. But we have included an opportunity for the YMCA to offset this lease cost on a dollar for dollar basis for the financial value of the community benefits'",
        "'speaker_3': 'that they offer without cost or without restriction to any appropriately aged community member. The lease costs can also it will be offset annually but cannot be carried over. Additionally, capital improvements can also be offset against the lease cost on a dollar for dollar basis.'",
        "'speaker_3': 'But these capital improvement costs can be carried over on an annual basis until fully repaid. Any lease offset that that is applied to any benefit that is applied to the lease offset shall be verified and confirmed on an annual basis.'",
        "'speaker_3': 'And so staff request the council approve the recommended action.'",
        "'speaker_2': 'Thank you. There was a motion, a second councilmember, mongo.'",
        "'speaker_4': 'I would just like to say thank you to the YMCA of Fairfield. I've been to the facility, have been to events at their facility. I've been a member of the Los Altos YMCA board, Fairfield YMCA. Provided fiscal support of Long Beach community last year of almost $350,000 in support to our residents in need.'",
        "'speaker_4': 'So I fully support this motion.'",
        "'speaker_2': 'Thank you. Sir, any member of the public that wish to address Council on item 25, please come forward. State your name.'",
        "'speaker_3': 'Good evening, Honorable Vice Mayor and members of the council and staff. My name is Alfredo Velasco, president of the.'",
        "'speaker_5': 'YMCA of Greater Long Beach. Presently, the city plus the.'",
        "'speaker_3': 'YMCA, equals.'",
        "'speaker_5': 'Programs and services for literally thousands of kids.'",
        "'speaker_3': 'Teens, families, adults and older adults in the North Long Beach community.'",
        "'speaker_5': 'Served by the Fairfield YMCA. As many of you may know, and some of you very well, the Y is a cause driven organization dedicated to helping all people realize their fullest potential through programs that fostered the development of young people through healthy activities.'",
        "'speaker_5': 'And we do this in a very socially responsible way. Part of that social responsibility includes being available to all, regardless of financial barriers. Our mission promise is that we find a way to serve any child or any family that comes through our doors.'",
        "'speaker_5': 'We believe strongly that with the community benefit that was alluded to earlier, the city working with the YMCA.'",
        "'speaker_3': 'Means the community, our neighbors, our families.'",
        "'speaker_5': 'Our kids and the city of Long Beach. Ultimately, when through this partnership. So we want to thank you for your consideration to continue this partnership to.'",
        "'speaker_3': 'Serve the Long Beach community.'",
        "'speaker_2': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Vice Mayor Lowenthal councilmembers. My name is Mike Kolakowski and I am the board chair of the Fairfield Family YMCA Community Board of Managers. I just want to make sure you understand that this is not just your typical Y kind of a swimming gym, sort of a of a situation.'",
        "'speaker_6': 'It provides much needed services to the residents of the eighth District and beyond. Things like childcare for parents of for children, of working families, as well as a health based programs that serve the community. The YMCA is a nonprofit.'",
        "'speaker_6': 'I've served on the Finance Committee of the Fairfield Board for several years, and I can assure you that the Fairfield branch contributes to the nonprofit status of the YMCA. It's been pretty difficult to run a nonprofit organization since the financial downturn.'",
        "'speaker_6': 'The lease recognizes the community benefits to offset the market rent, and as Councilmember Mongo referred to the the community benefit as much greater than the potential market rent. So this is a good deal for the city. It allows for sustainable operations for the Fairfield Family YMCA.'",
        "'speaker_6': 'Before I close, I'd like to thank Mr. Connelly and the staff for working through this with us. It's been a kind of a unique process with some. It's been a lot of effort on this, on the city's part.'",
        "'speaker_6': 'And we appreciate that. And I just like to encourage your approval and thank you for your consideration.'",
        "'speaker_2': 'Thank you. There's been a motion and a second. Members, please cast your vote. HAMMER Yes.'",
        "'speaker_1': 'Council member, your uncle. Motion carries seven zero.'",
        "'speaker_2': 'Next item, please.'"
    ],
    "Supplemental Agreement with SMG for Capital Improvement Projects at the Convention Center.": [
        "'speaker_1': 'Item 23 is a report from the City Manager recommendation to execute a supplemental agreement to management agreement with SMG for the completion of capital improvement projects at the Long Beach Convention and Entertainment Center District two.'",
        "'speaker_2': 'So moved. There's been a motion. A second.'",
        "'speaker_3': 'Have a very good you think as the address, as I pointed out, the fuel check your notes. There's a half a million dollars being spent on shares. I just googled and I. 5 minutes of various different vendors coming up with what look to be.'",
        "'speaker_3': 'And I haven't seen them yet, but I will check them out. Cheers. Padded stackable. That looked like their sturdy and I hadn't checked them, but I will. $30 apiece. Some for $19 apiece. I just want it on record.'",
        "'speaker_3': 'And I want these the management group to know I'll go out and check because a half million dollars, it's probably, I would say right now standing here probably 30% more than we need to spend. And that comes on just four months ago, urinating away $300,000.'",
        "'speaker_3': 'To put up has to create a sign because after 20 years, a few people couldn't find it. It goes to the issue of this city does not. The biggest problem is not a shortfall of money. It is a shortfall, a good management period.'",
        "'speaker_3': 'I think this management company might well be just seeing this as a Black Friday opportunity or end of the year to balance their budget and so forth. But I would suggest you hold this over until you check and see whether or not it's worth spending a half a million dollars for those chairs.'",
        "'speaker_2': 'Thank you, Mr. Goodyear. It's been in motion in a second. Members, please cast your vote. I mean, yes.'",
        "'speaker_1': 'Motion carries six zero.'",
        "'speaker_2': 'Next item, please.'"
    ],
    "Appian Way Low Flow Diversion Project Construction Contract.": [
        "'speaker_1': 'Item 24 is a report from the City Manager, Financial Management and Public Works recommendation to award the contract to permit building and engineering for construction of the Appian Way Low Flow Diversion Project. For a total contract amount not to exceed 585,750 District three.'",
        "'speaker_0': 'Any public comment on the item?'",
        "'speaker_3': 'Themes lyric do clear as my address my senses last week for the factory senses were triggered off and it's something I think is another one of these. First of all in. Bruises and what catch what brought it to my attention is last week.'",
        "'speaker_3': 'Class 31 going past the electrical pad in Marina Vista Park. I spent about 20 minutes talking to the contractors there after I saw the size of it. And my first reaction was that the city was somebody was trying to establish a sister sister a sister city relationship with Schenectady.'",
        "'speaker_3': 'The power source in there is far, far greater than that is needed in that location. And you need to understand this is a tolling issue. The Planning Commission three years ago were very diligent. Actually, four years ago, very diligent, put their feet on the ground, looked and realized that an electrical pad that was there needed to be'",
        "'speaker_3': 'relocated. Period. It was ugly. And Mr. Sandoval came back and said, well, they can't move it because, see, it would cost them a fortune. So he was complaining they had to pay the pensions of the retired executives and fines from out of the State Utilities Commission.'",
        "'speaker_3': 'I think what you'll find and I haven't seen the fat data yet. But what this is. This otherwise good project to clean up the water is getting it. What they did is upgrade that facility in Marina Vista Park, which is we need the park space.'",
        "'speaker_3': 'There are plans that could have been put forward to relocate that to an area where it wouldn't be or it wouldn't where it would free up that park space. What we have here is the same Black Ops Tidelands group that took down three s public without the knowledge of public works and without the knowledge of the planning'",
        "'speaker_3': 'department. I. Fire. I think this should be held over till we determined where the power source. It is inherent in this project that you're approving where the power source is located. To run that facility. And if is in fact, in the in the one that is in Marina Vista Park, which is the one that was specifically targeted'",
        "'speaker_3': 'by the planning commission, that they should haul blood out of there. At the very most and at the least clean it up. And they have cleaned it up a little bit. But what we have is a midnight work and I think a nefarious work going on there because the size of that is powering something other than the'",
        "'speaker_3': 'few little.'",
        "'speaker_0': 'Thank you projects. All right. Moving on to the next next item, actually, we're going to take a vote on this item. Members, please cast your votes.'",
        "'speaker_1': 'Councilmember Austin.'",
        "'speaker_0': 'Legendary HBO Max that plays.'",
        "'speaker_1': 'Item 27. A Report from Development Services and Financial Management. Recommendation to award nine contracts for as needed on call planning consulting services in an aggregate annual amount not to exceed 2.5 million citywide sum.'"
    ]
}