{
    "Resolution on Environmental Impact Report and Final Plans for Alamitos Avenue Complete Streets Improvement Project.": [
        "'speaker_0': 'Okay. Thank you. As our regular agenda goes, we take the hearing first. So we will take hearing out of number 1/1 and then we'll go right into concern, public comment and the regular agenda. So we have one hearing for tonight.'",
        "'speaker_0': 'Let's hear the first hearing.'",
        "'speaker_1': 'Report from Public Works recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution certifying IIR 01-17 Making Findings of fact adopt a statement of overriding considerations for the Alamitos Avenue Complete Streets Improvement Project and authorize the City Manager to adopt final plans and specifications for the Alamitos Avenue Complete Streets Improvement Project'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'Mr. WEST. Thank you, Mr. Mayor. The staff report will be given by Eric Wood Strahan, our traffic engineer. Good evening, Mayor, vice mayor and council members. I'm here requesting that you adopt a resolution certifying the Environmental Impact Report and adopt a statement of overriding consideration for the Alamitos Avenue Complete Streets Improvement Project.'",
        "'speaker_0': 'This project will reduce the cross section of Alamitos from two lanes each direction to one, traveling in each direction with a two way left turn lane and protected bike lanes from Ocean Boulevard to Seventh Street. It will continue the Rhode Island saw last year from Seventh Street to Pacific Coast Highway.'",
        "'speaker_0': 'This proposed cross section will improve safety for all users in the corridor. The no recross section will calm auto traffic, reduce the crossing distance for pedestrians crossing Alamitos Avenue, and provide a safer bicycle facility for bicyclists traveling along Alamitos Avenue from 2012 through 2016, there are 29 collisions involving people on bicycles and people walking on this segment'",
        "'speaker_0': 'of Alamitos. There are also a total of 205 collisions. During that same time period, the project will add 23 parking stalls during the peak hours by removing the existing peak hour parking restrictions at a time of day when residents have a high demand for on street parking and will remove five all day parking stalls.'",
        "'speaker_0': 'The road died on Alamitos Avenue from seventh Street. North Pacific Coast Highway has worked well from a traffic safety and operations perspective and has resulted in fewer traffic collisions, with the collision rate dropping nearly 50% since its implementation, bicycle ridership has also increased after the roadway was installed.'",
        "'speaker_0': 'This project is consistent with the Bicycle Master Plan update unanimously approved by council in February as the Orange Artesia Corridor is a key North-South connector connecting Central and North Long Beach communities to downtown. And the beach is also consistent with the Vision Zero principles unanimously adopted by Council in May 2016 by improving multi-modal safety.'",
        "'speaker_0': 'This concludes my report, and I'm happy to answer any questions you may have. Kate Thank you. And we, as per the hearing, we open up for public comment on the hearing. KFC. No public comment. Council member, please. Hello.'",
        "'speaker_0': 'My name is Raymond San Miguel. I reside on Ocean Boulevard. I haven't been involved in a lot of this city council and street alterations, but I did grow up here, went to Naples Elementary, Rogers Middle School, graduated from Wilson, went to Cal State, Long Beach.'",
        "'speaker_0': 'But it seems that we're we're just creating so much congestion with all of these bicycle lanes. I understand that we're trying to make it safe for bicyclists. But what we did on Vista with all these the bicycle boulevard and the turn about, you know, I have a friend that lives there and we worked on his yard for'",
        "'speaker_0': '8 hours and I didn't see one person ride a bike down that street. And now we set up, what, over $4 million on Sixth Street has a bike boulevard. We have streets that need repair. We have gutters and sidewalks and and roadways that need repair.'",
        "'speaker_0': 'And we're I just feel we're just throwing away money on these. I know we want to be a bike friendly city, but it just doesn't make sense. The congestion the traffic congestion that we're creating is just out of control.'",
        "'speaker_0': 'We took away two lanes from Temple to Alamitos and made this huge median, but didn't take into account that if we would have taken two feet from each side of that median and gave the cars that parked on that street a little buffer to open up their door and not get hit by passing cars.'",
        "'speaker_0': 'I don't understand why we have that. And then reading in this thing that I saw last night, we're going to continue that from Alamitos down Broadway, from Alameda down to Temple. I mean, we if we're going to do that, I understand that we need to move traffic.'",
        "'speaker_0': 'We have to synchronize the lights. So traffic continues to move. While I was younger back in the seventies and eighties and nineties, if you caught a green light from cherry going towards the 710 Freeway and you stay between 25 and 30 miles an hour, you got a green light all the way to the freeway.'",
        "'speaker_0': 'You don't have that on these streets anymore, you know, and we have the technology to synchronize these lights. So traffic moves through. You've added all these signaling lights on Ocean Boulevard right there at Bluff Park, where I live.'",
        "'speaker_0': 'And and there's so much congestion or in the rush hours that synchronize the lights. So we move traffic along and don't create all this congestion. Those are my thoughts on this. I think we should, you know, take a pause, consider this and really make it safe and move traffic along and and ease up on the congestion that'",
        "'speaker_0': 'we're just creating around the city. Thank you very much. See no other public comment on the hearing. I will turn this back. I will close the hearing by turning it over to the council and Councilmember Pearce.'",
        "'speaker_5': 'Great. Thank you so much. I really want to applaud staff for finishing this project. I know that this is something that we've talked about in the bike mobility plan. We've been doing this works for, let's say, October 2013.'",
        "'speaker_5': 'We talked about the mobility element and the general plan. And looking at this corridor and being able to say one is that we have traffic incidents and I believe the number was 67 serious injuries that require some type of medical attention just in between seventh and ocean, just in that small area and that we need to be'",
        "'speaker_5': 'able to do something to address and getting to Vision Zero. And so I applaud you for being able to think creatively about this stretch of street and being able to do bikes and also add 23 parking spaces, which is not easy to just make up parking spaces out of thin air.'",
        "'speaker_5': 'And so I know that there's been some concerns around traffic flow. And I took Alamitos yesterday from PCH all the way down and the lights were synchronized. I drove a steady 30 miles an hour and everything was smooth.'",
        "'speaker_5': 'So I am excited about this. I believe that when we look at the the transition between downtown and our neighborhoods, we need to be able to have a safe space where people feel like, if I live in Alamitos Beach, I can walk to downtown, I can take my bike to downtown, and that there is a vision for'",
        "'speaker_5': 'that. I think doing this is going to get a lot more people out of their cars as well and hopefully getting to places like Mola, which I appreciate you guys for being here tonight. And so to address any of those concerns, I think that you guys have done a fantastic job.'",
        "'speaker_5': 'And I also want to applaud you for working with the new developments that are coming online to find creative ways to fund not only the plan that's in front of us, but new traffic signals, street lights and things that we'll talk about down the road.'",
        "'speaker_5': 'So I'm just thankful for continuing this project down past seventh. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_6': 'Yes. Thank you as well, Eric, for your hard work and public works. I know that change in this respect is never very easy and easy to think about, but I know this is all in good a good vision for the next few years.'",
        "'speaker_6': 'And in addition to what Councilmember Pearce said, I know gun buyer park, that area was a horrible area, worst traffic situation in the city and that really lessen the issues, as you've mentioned, as well as this beautiful intersection that is in between two amazing museums, both more LA and Pacific Island Ethnic Art Museum.'",
        "'speaker_6': 'I think there is room for bikes to travel through there that could, you know, flow easily with with cars. But I do have a few questions. I know it has been in the report. It mentioned AMPM peak hours.'",
        "'speaker_6': 'What do we do? We see any major significant change in those peak hours. With this plan.'",
        "'speaker_0': 'We will see increase. Thank you for that question, Councilmember. You will see increased travel times of up to 77 seconds in the AM peak hour and up to 70 seconds in the peak hour. So that's common when you convert a road to a road that narrow the streets.'",
        "'speaker_0': 'But we do feel that we will be able to mitigate some of that increased travel time by retiring the traffic signals. When a study of this nature is done. Traffic engineers are generally pretty conservative. If we look at, you know, try and take into account every conceivable development that's coming.'",
        "'speaker_0': 'Look at potential growth in traffic. And then also look at how the intersections are working together. But as we put this type of plan into operation, we would look at taking a fine grained look at how those traffic signals are operating adjacent to each other and retain the corridors.'",
        "'speaker_0': 'We have the opportunity as pedestrians are making, have a shorter distance across. Now we would take signal time, take time away from that that crossing and put more of that time into green time on the corridor.'",
        "'speaker_6': 'Okay, great. And then I know in that area, I know Councilmember Pearce and I as well are also talking in and length about, you know, new development coming to the area and a lot of new changes happening. Parking is golden everywhere.'",
        "'speaker_6': 'But, you know, in that area, we hear it quite a bit. And so I know that there's going to be a overall decrease of five spaces, but an overall increase of 23 spaces. Is that.'",
        "'speaker_2': 'Correct?'",
        "'speaker_0': 'That's correct. It's a5a loss of five spaces over the entire day, but an increase of 23 during the AM peak hours.'",
        "'speaker_6': 'Okay, perfect. That is great. 23 spaces. Wonderful. And then last question. I know it was addressed semi addressed in the in the memo one which unified school district. I know a lot of the parents addressed concerns with pick up drop off traffic congestion.'",
        "'speaker_6': 'And I don't know that we necessarily can do anything about that in general. But, you know, there's that discussion. So do you have an answer to that or how can we I don't know if this helps that in any way.'",
        "'speaker_0': 'I think I just say that, you know, all of our schools experience congestion around, pick up, drop off time. And I think the more we can encourage parents to, the more we can provide safe facilities for kids to get to school by some other means than being driven.'",
        "'speaker_0': 'I think that's a better improvement. And I think that improving of providing a calmer corridor for parents and other motorists to travel on will be a benefit to to kids walking to and from school and for parents driving to and from school.'",
        "'speaker_6': 'Okay, great. And we will have signage and all of the appropriate. Okay, wonderful.'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_6': 'Thank you so much. I appreciate it.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_5': 'I yes, just on the question around Franklin, I know that we are making some changes to some crosswalks around the area as well. So I just want to clarify that we are doing some of that work. I don't know if you can report on that.'",
        "'speaker_0': 'Not specifically on Franklin, but as we will be making improvements. Yes. Great.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'That's what I'm gonna go.'",
        "'speaker_2': 'To Taylor on to Councilwoman Gonzales this point. A lot of the schools have better pick up and drop off than others. And I feel that a lot of the parent groups have really stepped up. I know that the principals rotate often, but the parents are there for the long term.'",
        "'speaker_2': 'They've done some drop off programs where the dads and certain sons open all the doors for everyone in the morning. They pull in cars in a more quick way. The schools in my district that have those have been significantly better.'",
        "'speaker_2': 'I appreciate that we want people to bike. I just don't know that we're at a place where biking is actually a commutable option. And so in my experience and what I've discussed with my residents, we are not in favor of removing a lane, but we are in favor of getting to a safer community.'",
        "'speaker_2': 'And so there have to be ways that we can do that without removing lanes. I recognize you've done an extensive amount of work on this, but I'm going to just make sure to stick with my community on this.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. Please cast your vote to members.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Kate Moss. In case with that, we move on to the hearing is over and we're moving on to the consent. Minus item number 12, please. Can I get a motion in a second? I'm going to motion in a second and all minus item 12.'"
    ],
    "Fiscal Year 2017 Infrastructure Funds Designation and Budget Adjustments. ": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item 12.'",
        "'speaker_1': 'Report from Financial Management. Recommendation to approve fiscal year 2017. Designation of one time infrastructure funds for City Council District Infrastructure Projects and existing programs and approve related budget appropriation adjustments for fiscal year 2017 in accordance with existing City Council policy citywide and repairs.'",
        "'speaker_5': 'Yes, I promised my retro people that I would pull this item and just applaud city staff for their great job. On working on our fourth street plan on our festoon lights. It's something they wanted for about a decade, and we finally figured out a feasible way to do something we thought was almost impossible.'",
        "'speaker_5': 'So really just wanted to give praise to public works for doing that and hoping that we can get that installed before December. And then the other thing is we've got our first ah dog park fencing on here. I just want to say we had four, 200 people, we counted almost 80 dogs at our dog park opening.'",
        "'speaker_5': 'I think it was money well spent. And want to again thank my colleague, Councilmember Price for her investment on that. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson. Thanks, Mr. Mayor. I just wanted to call out a couple of projects here. There's some really exciting stuff on here. So we have Hamilton neighborhood. You're finally getting your bias. Well, that was a participatory budgeting project.'",
        "'speaker_0': 'We have some will be opening and this is funding to open our new Veterans Valor Plaza this Saturday Saturday at 9 a.m.. So I hope you can join us at Highland Park on the corner of Atlantic and Harding.'",
        "'speaker_0': 'Next, we have the Ramona Park Fitness Station, so we're really excited about that. So Ramona Park, that's for you in the Forest Park neighborhood, we've got the fitness stations. This is the funding to install those. So they all should be all this work should be done in a matter of months.'",
        "'speaker_0': 'Thank you. Kathryn Austin.'",
        "'speaker_3': 'Yes. I also want to just since we pulled this item in and thanks for doing that. Just think public works for their expediency and working with our residents on our field and actually creating over 30 new parking spots from and all it was was was paint on the sidewalk and made a big, big difference.'",
        "'speaker_3': 'And then of course the it's not here listed here but the great work, the street improvements in the Jackson Park neighborhood that is actually happening right now. So thank you so much.'",
        "'speaker_0': 'Thank you. So, you know, public comment on this item. Members describe cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Economic Inclusion Assessment and Outreach by Economic Development Commission.": [
        "'speaker_0': 'I'm sorry. I believe those are items 24. Okay. So 22, 23, 24 and 25. And we're doing 24/1, I understand. Right. Okay. And so go ahead. And we're going to begin and we're going to begin by doing item 24.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson, recommendation to refer to Economic Development Commission to conduct a deeper assessment of economic inclusion in Long Beach by embarking on the Everyone in Listening Tour and providing further outreach to marginalized and disenfranchized segments of the business and working community.'",
        "'speaker_0': 'Thank you. Thank you, Madam Clerk. Thank you, Mr. Mayor. I wanted to start off first. Let me just acknowledge, you know, we started a little bit late. We had some really important business in closed session. But I see the amount of people who stood.'",
        "'speaker_0': 'So thank you for for for remaining with us on this very important issue. It's four items here, but I'm only going to give a presentation on one of them and we'll have just a shorter discussion on the others for the sake of time.'",
        "'speaker_0': 'So today we have so I want to actually start we have a video.'",
        "'speaker_5': 'I loved doing business in Long Beach.'",
        "'speaker_2': 'But I don't have access.'",
        "'speaker_5': 'To the.'",
        "'speaker_6': 'Resources.'",
        "'speaker_2': 'That I need to expand my business and to truly thrive. Economies grow faster.'",
        "'speaker_5': 'Stronger and for longer periods.'",
        "'speaker_6': 'Of time when.'",
        "'speaker_2': 'Prosperity isn't limited.'",
        "'speaker_6': 'To just a few segments of our population.'",
        "'speaker_2': 'Everyone here means every.'",
        "'speaker_6': 'Long Beach resident has.'",
        "'speaker_5': 'Pathways of.'",
        "'speaker_2': 'Opportunity to fully participate.'",
        "'speaker_6': 'In the economic life of our.'",
        "'speaker_2': 'City as employers, entrepreneurs, consumers and citizens.'",
        "'speaker_0': 'The blueprint will be a catalyst for economic activity across the city. Long Beach is well-positioned to take a deeper dove into economic conclusions. Long Beach is strongest when everyone has a seat at the table and an opportunity to thrive.'",
        "'speaker_0': 'Join us for a conversation on what everyone means to you. All right. So today we have a package of proposals with the theme of everyone in. And the theme ties together our economic development focus of our city as a city with our new economic blueprint, as well as our focus on equity as a city with our new'",
        "'speaker_0': 'Office of Equity. So this marries the two together. It's a call to action to all segments in all sectors of our community to work together to ensure that our economy grows with everyone in mind. It means making sure that everyone has a place to plug into our economy.'",
        "'speaker_0': 'No matter what part of town you look you live in, no matter your race, your socioeconomic status, your gender, or your criminal background, it means small business owners and aspiring entrepreneurs in all parts of town have access to the resources that they need to grow their companies to create local family supporting jobs.'",
        "'speaker_0': 'But we're not there yet. There's still plenty of work to do. We're not there when five times as many of our Latino and Native American residents are living in high poverty neighborhoods compared to others. We're not there when twice as many black and Latino women are working full time and still living below 150% of the poverty line'",
        "'speaker_0': '. We're not there when homeownership among our black and Latino residents is half that of white households, we know we're not there yet. When fewer than 15% of Asian and black residents have access to the resources they need to own a business.'",
        "'speaker_0': 'So there's a growing body of research that finds greater economic inclusion, fosters a stronger economic growth and a more equitable region. Yet over the past two decades, the critical connection between growth and inclusion has been largely severed. So as as the economy grows, the wealth gap continues to grow as well.'",
        "'speaker_0': 'So since the Great Recession, every one of the 100 largest metropolitan cities in the United States, including Long Beach, has added jobs and has increased their economic output. But only 11 cities have saw a rise in inclusive growth Denver, San Antonio and Austin, to name a few.'",
        "'speaker_0': 'While the rest of us, including all of Los Angeles County, saw increased economic inequality. Inequalities across every single economic indicator including employment, earnings, poverty, business ownership and homeownership. Without changing, without a change in course, racial disparities in income, employment and wealth will weigh more and more heavily on our communities across our nation.'",
        "'speaker_0': 'So this past April, the City Council adopted the blueprint for economic development, providing the city with a framework that seeks to advance a vision of Long Beach as the city of opportunity for workers, investors and entrepreneurs. Economic inclusion is called out as an area of focus, described as increasing access to economic and economic opportunities in low income'",
        "'speaker_0': 'communities to advance economic equity. The objectives as listed in the blueprint are as follows increase the number of minority owned and women owned businesses. Increase nontraditional capital resources for minority owned women owned businesses. Increase investment in low income business corridors.'",
        "'speaker_0': 'Increase the percentage of city spending on local businesses with emphasis on minority and women owned businesses. Increase financial literacy and wealth building opportunities for young people and disadvantaged families and decrease the digital divide for low income households. To me, that means creating an environment where everyone has a seat at the table and everyone has an opportunity to'",
        "'speaker_0': 'thrive. It means making sure every neighborhood is economically viable. It means acknowledging that everyone deserves a path to middle class, good jobs and economic opportunity. Where a young person, a young person who's working his or her first job through the city's youth hire program, learns the fundamentals of financial literacy.'",
        "'speaker_0': 'It also means making sure that everyone has an opportunity to build wealth and have access to capital, whether you're a small business, a home or an aspiring homeowner, or just a working, working individual. So we know that everyone benefits from a more inclusive economy because economies grow straight, grow faster, stronger, and for longer periods of time.'",
        "'speaker_0': 'When prosperity isn't limited to a few segments of the population, more inclusive cities can tap into deeper pools of talent and draw from more educated workforce with a broad range of skills. Strong, economically viable regions are able to provide high quality jobs for the residents, producing new ideas, new products, new businesses and economic activity.'",
        "'speaker_0': 'So the region remains sustainable and competitive. Economically inclusive regions are ready for the future with a skilled ready workforce and a healthy population. Economically equitable regions are places of connection, where residents can access essential ingredients to live healthy and productive lives in their own neighborhood.'",
        "'speaker_0': 'They can reach opportunities located throughout their city via transportation technology and can participate in the political process and interact with diverse sets of residents. Cities all across. The country are embracing similar economic inclusion initiatives and are taking a hard look and embracing more inclusive policies.'",
        "'speaker_0': 'For example, in Stockton, they're conducting the Stockton Economic Empowerment Demonstration with a project called Basic Income as a strategy and strategy to address persistent poverty. Policy commissioned a study in Long Island called Empowering Black Long Island How Equity is Key to the Future of Nassau and all four counties as well as New Orleans called Equity.'",
        "'speaker_0': 'New Orleans the road to equitable government in Long Beach has an opportunity to lead the great L.A. The greater L.A. region has experienced demographic change and economic shock much more much, much before the rest of the nation, and making progress on new commitments to inclusion can inform policy making for the rest of the rest of the region'",
        "'speaker_0': 'and the rest of the nation's metropolitan cities. And that's why, as a part of the Economic Inclusion Initiative, I'm asking the Economic Development Commission to take a deeper dove into economic inclusion by conducting a listening tour, facilitating focus groups which address traditionally marginalized communities.'",
        "'speaker_0': 'The motion tonight will assist with the economic assist the Economic Development Department with resources needed to support them through this process. We're also asking the city to take steps to conduct an economic equity profile of our city and to adapt to measures related to access to capital for small businesses and financial literacy for our youth, which we'll'",
        "'speaker_0': 'hear about later. I want to just take a moment to just acknowledge those who issued letters of support. Senator Steve Bradford, Assembly Member Mike Gibson, our chair of our Economic Development Commission. Randall Hernandez. Central Shah, who I see is in the audience with this pulse for hope.'",
        "'speaker_0': 'The Maynard Foundation, the YMCA of Greater Long Beach and YMCA Community Development. The Long Beach Local Hire Coalition, the Uptown Business District and Humanity. In six months, I'd like the Economic Development Department to provide a report back to the Commission to the City Council on the Listening Tours findings.'",
        "'speaker_0': 'I want to acknowledge that the economic development staff, as well as Rebecca on the Innovation Team and our Office of Equity Staff and the Ninth District staff for helping to put together this presentation and helping to launch this everyone in campaign.'",
        "'speaker_0': 'So that said, I asked the City Council for your support. Okay. I think I'm chairing the meeting. I'll see the the mayor here. Okay. Councilwoman Gonzales?'",
        "'speaker_6': 'Yes, Vice Mayor Richardson, I just want to say thank you for bringing this forward. I think a lot of us have been talking about inclusion when it comes to many of these initiatives within economic inclusion as a whole.'",
        "'speaker_6': 'So I'm glad to see that we're bringing this forward. And I know I've often spoke spoken with Jessica at Central CHA as we brought up the issue of immigrant communities and how we can be more comprehensive in providing resources, not just for to tackle the issue of immigration at its face, but also to look at resources that'",
        "'speaker_6': 'we can provide individuals for housing and and entrepreneurship and ways to get out of the poverty level. And I've talked to Councilmember Dee Andrews about job opportunities as well, and I often reiterate these statistics. But in the 90813, we have high poverty rates.'",
        "'speaker_6': 'As much as 40% of our families are under the poverty line and as much as a 19%, I think it just went down to 16% of our families are unemployed. And so I think there is absolutely room for this in the city of Long Beach.'",
        "'speaker_6': 'I will also say to and I'm glad you brought up the issue of women entrepreneurship. There are some statistics. I was trying to pull them up and I'll find them for you. But I believe there's a banking institution that is looking at women entrepreneurship and access to capital.'",
        "'speaker_6': 'And I think it's important that we also find women, venture capitalists to provide that capital to women entrepreneurs. It's really difficult to do that. So that's why, unfortunately, sometimes we don't see as many women business owners as we'd like to because of that.'",
        "'speaker_6': 'So I think it's also finding that that other side, the individuals that are able and willing to fund and that speaks a lot to what we need to do more for women. And then I would like to think Randall as well, I know we've spoken quite a bit just on economic issues overall, and I appreciate your insight'",
        "'speaker_6': 'into this very issue. And I know that this is going to be a fantastic listening tour. So thank you so much, Vice Mayor.'",
        "'speaker_0': 'Thank you. Next, we have Councilwoman Pierce.'",
        "'speaker_5': 'Yes. I, too, want to applaud you for your efforts with everyone. And I know a lot of these are issues that we've talked about historically for five, ten years. And to be able to kind of put it in a way that we can get our hands around it and understand what that means.'",
        "'speaker_5': 'How do we really create opportunities, everyone from small businesses to everyone else in the community? And so I want to thank you and I want to thank your staff, too. I know that you guys have worked really hard on this.'",
        "'speaker_5': 'And I for me, everyone is about having those conversations. We've been able. Every agenda item I've tried to put forward, I've tried to include deep community meetings. And we know that's where we get the most creative ideas and get people, everyone to roll up their sleeves and do the work.'",
        "'speaker_5': 'And so I look forward to being a part of some of these discussions and having our constituents be that too. And when I think, again, all the community members who are here and I'm sure we'll hear some personal stories from you all.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_0': 'Thank you. Councilmember Price.'",
        "'speaker_6': 'Thank you. Vice Mayor, are we speaking to all the items at once or one at a time?'",
        "'speaker_0': 'We're going to speak to this one. We'll have an opportunity to speak to the others. I'm just not life or presence.'",
        "'speaker_6': 'I think this one's great and I applaud you for bringing it.'",
        "'speaker_0': 'Great. Thank you. Councilman Mongo.'",
        "'speaker_2': 'Well, I'm going to speak freely about all economic development. That's fine. I want to give a big shout out. And thank you to our Economic Development Commission. I'm creating the Economic Development Commission, a group of neighbors and business owners in Long Beach who know economic development, who are connected to the industries that really move our city, who'",
        "'speaker_2': 'are connected to the communities that are a part of our business fabric that really is woven in with our neighbors. It's just such an important decision to make. But choosing the right people and the right leaders has been a huge part of that.'",
        "'speaker_2': 'And so I want to thank Randall Hernandez for his leadership. I know that in every conversation he is always driving us forward. We are looking at economic development and all different ways. And I really appreciate not only his hard work, but also his mentorship, because I think that this is one of many exciting things that are coming'",
        "'speaker_2': 'because of the blueprint that that committee took such a thoughtful care with. And so thank you for that. I also want to thank my colleagues on both the Economic Development Committee. I know that the starting point of where we we started together three years ago was very different than where we are today.'",
        "'speaker_2': 'We are a committee and a council of individuals who now look at the data and know and understand what that data means to our neighborhoods and what that data means to our community. And we're making those data driven decisions to lift everyone up.'",
        "'speaker_2': 'And I think that more often than not, you will find I live in the ninth, but I have a business in the fifth, I live in the fourth, but I have a business in the eighth, I have a business in the first.'",
        "'speaker_2': 'And just people love to live and work here. And so the ability for us to invest in ourselves is such a huge opportunity. And so I'll say what I said at the press conference. I have Akiva account and I look forward to many of you joining me and loaning money to our small businesses through becoming Akiva City'",
        "'speaker_2': '. Because when we take personal ownership of our communities and our neighborhoods and our businesses, only then can we take that next step together. So thank you.'",
        "'speaker_0': 'Thank you. Councilman Austin, thank you.'",
        "'speaker_3': 'And I'm going to keep it short since we have several other items to speak to. I want to congratulate and thank Vice Mayor Richardson and his team for bringing forth this initiative. It's something that I support wholeheartedly. I think they put a lot of innovative thought into it, working with our economic development staff.'",
        "'speaker_3': 'I think we will lay down something that will be beneficial for many in our city, and hopefully we will we will address the equity gap. I can't stress enough every time an issue like this comes before us. I think, you know, partnerships with our great educational institutions is extremely important because that is the great equalizer.'",
        "'speaker_3': 'And we don't achieve equity. We don't improve our conditions without improving our educational status. So thank you very much.'",
        "'speaker_0': 'Thank you. And we're going to take public comment in just a sec. I just wanted to also just congratulate, obviously, vice mayor, particularly at Comp Development Commission. If everyone remembers this is the economic blueprint that this council adopted that the commission put together, spent a lot of time putting this blueprint together.'",
        "'speaker_0': 'It's really a ten year road map for the city when it comes to economic development. And it was a top priority of the commission. And for us to actually get this done, which is really the reason why we reformed the commission, why a restructure the department to have an economic development department.'",
        "'speaker_0': 'And this is really another step to that. And if you look inside this blueprint, one of the pages is dedicated to economic inclusion. And so, you know, this agenda item and what the vice mayor is talking about is a direct I'm really just he's taking from one of the key initiatives of the blueprint and really expanding it'",
        "'speaker_0': 'and bringing life to it and ensuring that has the attention that it deserves. And so I just want to commend him for taking a leadership role on that part of the blueprint. And so with that, we're going to take public comment on this item, which is item 24, but feel free if you want to talk.'",
        "'speaker_0': 'And we hope we're going to have a couple other items on the same topic if you want to just talk kind of once on the whole package. That's great, Mayor. Council members Randall Hernandez, chairman of the Economic Development Commission.'",
        "'speaker_0': 'And I'll make it brief because you do have my letter, but we really do view the everyone in campaign is a call to action. We want to bring stakeholders together, whether it be education, small business, labor, community organizations and really do a deep dove into some of these underserved communities.'",
        "'speaker_0': 'It's always been a challenge. For many years I've been doing economic development for a long time and it's always been a challenge, really reaching in particularly to multicultural communities and really getting them at the table to have a real, really frank discussion on what makes them tick.'",
        "'speaker_0': 'How can we be more effective and what services not only the city can provide, but the services that are available throughout the throughout the community. So one of the things we hope to accomplish through this is really to bring together a lot of the stakeholders and the resources that are available throughout Long Beach to the table and'",
        "'speaker_0': 'have a very frank discussion on all of this items. I want to thank particularly, obviously, Vice Mayor Richardson for really driving this initiative and really accelerating it forward. But to you, Mayor, for the launch of this a year and a half ago, when you asked the commission to take this on and who knows where we're heading with'",
        "'speaker_0': 'that. But I think it's we've we've developed a good product along the way. And I also want to thank and commend Councilwoman Mongo for her leadership on the Economic Development Committee, for working closely with the commission on a lot of these initiatives.'",
        "'speaker_0': 'So I want to say thank you very much, and we look forward to the next phase. We know our work is just beginning and this is going to be a great piece of that continued blueprint action. So thank you.'",
        "'speaker_0': 'Thank you. Speaker, please. Thank you. My name is Robert Leon Wood. I live at 3602. I really want to compliment you for this fantastic idea that we have here. But I also want to want to emphasize the fact that what we have at Long Beach is many families of young men from single parents and a lot of'",
        "'speaker_0': 'children being raised by single parents. And they want to get out to get the information. And we're going to have to make a special effort to reach those who have single mothers, who are midst of poverty, who are living in really negative conditions to make sure that they get a part of this economic growth.'",
        "'speaker_0': 'We also have a lot of young men who do not have skills at this time that are going to have to have a special effort to give them the kind of skills that's necessary to take advantage of the job opportunities that are coming.'",
        "'speaker_0': 'And we know that what Proposition 47, we have many of our young men coming back home from behind the wall, and that needs to be in this package, some kind of a special effort to ensure that these young men and young women are going to have an opportunity to have a chance to appreciate and to get a'",
        "'speaker_0': 'chance to get some of the benefits of this great effort that you're having. So it could be universal to the entire community of Long Beach, but I think right now you're really on the right track. But thank you.'",
        "'speaker_0': 'Thank you. Next speaker. Excuse me.'",
        "'speaker_2': 'Hi. There's a few things that I have seen as being a parent in language unified that I think would bring everyone in for very low cost in. One thing I would like is for the Long Beach Police Department Junior Scouts program at Caboolture High School to get rid of their GPA requirement at Kabul High School so that'",
        "'speaker_2': 'ninth graders could go straight into a program like the police. And some of those kids they see, they fall in between the cracks. And we have to realize that Kabila doesn't have the same kind of grades and English learning skills that other schools have.'",
        "'speaker_2': 'So putting in that GPA, the police putting in the GPA requirement, I don't see as many young black boys able to get on the force. The other thing is the fire department may send in the training in Belmont Shore for the junior lifeguards.'",
        "'speaker_2': 'And that's how we get lifeguards and police and paramedics and firemen. As long as that program is centered in the NOSEWORTHY area and I'm not sure in the most wealthy pool, our kids don't have the ability to get there for that training to get the first lifeguard jobs in the city of Long Beach.'",
        "'speaker_2': 'So I've often asked for the for them to come over to the high school campuses for the lifeguard program and try to get the kids around the teams certified as lifeguards. Because we wanted black lifeguard Cabral High School, we had to have a meeting with our whole team and the principal, A.C. Brown Beach, to ask them why'",
        "'speaker_2': 'they couldn't produce any young black teen lifeguards. And they said that they just don't apply and they didn't have any black lifeguards to give us. So those are two things that if you wanted to listen, I think those things could just be changed and you would start to understand the kids a little bit more.'",
        "'speaker_2': 'And the other thing is we don't have Special Olympics, a Cabral high school pool. We just have them on the east side of town. So these kids also are at a they are a loss. And the Academy of Global Logistics, all high school has a program that's putting kids into global logistics.'",
        "'speaker_2': 'And I think what we have is truckers. And if you gave kids that are faster, kids with no homes, that they go out on the street after they're done with high school or in seniors, if you gave me a truck, it would be like a home and they could see the risk to the United States and maybe'",
        "'speaker_2': 'they could find somewhere to live that they can actually.'",
        "'speaker_0': 'Afford.'",
        "'speaker_2': 'In order to get out of Long Beach. We love to truckers. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Good evening, mayors. City council members, city staff. My name is Tasha Hunter and I'm the executive director of the Uptown Business Improvement District. And I want to say thank you. This is beautiful. This is something that we do.'",
        "'speaker_2': 'I deal with businesses on a day to day business, day to day basis in my business improvement district. And there's people that want to grow. They want to expand. They want access to the capital and the resources. And we search and we look and we find and this is something that we've been thriving for, wishing for all'",
        "'speaker_2': 'coming together. So I'm going to put a special thank you to economic development, Randall and everyone that's helped work on this. We're excited and we're here to support. We gave a letter of support. And any way that you want to utilize the business district, we're here.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good evening. My name is Josue Gutierrez and I'm part of the YMCA Youth Institute, and I support this initiative because according to a partner in the scheme, we are the fifth most expensive brand statewide. A one room apartment would cost a minimum of 6000 dollars, but a minimum wage is 1100 dollars a month.'",
        "'speaker_5': 'My sister is forced to live with my mom and the rest of my family currently because she cannot afford one room, a one room apartment currently. In order for her to move out, she will need my other sister to help her pay rent so she'll be able to live in that apartment, which is a one bedroom apartment'",
        "'speaker_5': '. So what I believe what we should do is raise minimum wage and she will most likely she and other people who have this situation will be able to have a life of their own and help support themselves. And people who are there with also helping out small businesses helps make the community give more jobs for kids and'",
        "'speaker_5': 'people in the city also. It also keeps the revenue within the city that can be used for taxes as well as growing the business itself. This is why the is to support this initiative. Thank you for your time.'",
        "'speaker_0': 'Thank you so much. Thanks, Speaker.'",
        "'speaker_2': 'Good evening. Mayor Garcia, members of the city council. Thank you so much for the opportunity to speak. My name is Jessica Quintana and I'm the executive director of Central Asia, and we're here today to support this initiative. Thank you so much.'",
        "'speaker_2': 'Vice Mayor Rex Richter said. You know, this aligns with the work that we do at Central CHA for over 16 years. Our main priority has been focused on economic development and workforce development in our communities. As you know, the Latino population is at 42% here in the city of Long Beach.'",
        "'speaker_2': 'And having said that, there's a lot of challenges within our community. We have language barriers, access to capital challenges, and developing small business entrepreneurship. Most recently, we just sparked a new initiative.'",
        "'speaker_1': 'With Cal.'",
        "'speaker_2': 'State, Long Beach and providing the first ever Latino Entrepreneurship Bootcamp at Central Asia. Because it's a challenge for a lot of folks to start a small business and really understanding how to begin those steps. A lot of people, what happens is they they save their life savings and really don't know how to navigate and start a small'",
        "'speaker_2': 'business. And for a lot of our youth, we have a lot of our workforce development youth in the audience. So I know Nick would be very proud to see some of his youth there. But, you know, these are things that we focus on.'",
        "'speaker_2': 'We focus on economic development as a strategy for violence prevention to build our communities. So. So they are, you know, equitable in in different parts, not only in the first District, in the ninth and the sixth, but also on the West Side area.'",
        "'speaker_2': 'It's important that we're providing these services citywide because we do have an issue of poverty and an economic lack of inclusion with a lot of folks, especially when they're having language barriers. So this is a great initiative. We look forward to having a seat at the table.'",
        "'speaker_2': 'I think that's important, having, you know, further discussions and conversations. We look forward to hosting a discussion and having that, you know, in translated into Spanish. And, you know, as many of our youth here and just the experiences that they have and and, you know, just their backgrounds are very diverse.'",
        "'speaker_2': 'So, you know, they're all as you know, you know, with a climate, they're in fear of of their current status. Some are. Some are. Their status is going to be expiring. So it's going to be important that they have opportunities to entrepreneurship, because that's the way they're going to be able to continue to to thrive in their'",
        "'speaker_2': 'communities. Because we all know that economics is really a matter of a person being able to live and thrive. It's a quality of life issue. So thank you so much again. And we look forward to the discussion, the conversation.'",
        "'speaker_2': 'Randall, you're in the audience. Thank you so much for your leadership. And we continue to look forward to working with you as well as the economic commission. Thank you so.'",
        "'speaker_0': 'Much. Thank you so much, Jessica. With that, I appreciate all the public comment. And to go back to the council. Councilmember Pierce.'",
        "'speaker_5': 'Well, yes, thank you. I want to again, thank you all for speaking today. And I just wanted to lift up a couple of things that I heard and wanted to ensure vice mayor, that it's included in this. You've done a great job of outlining which folks should be included.'",
        "'speaker_5': 'I think focusing on youth in a way that is a just a youth space, being a part of building healthy communities and their youth work groups. It's a unique space where we get to hear from them without a lot of adults putting in their ideas.'",
        "'speaker_5': 'I would hope that in some of their listening that we would really engage with some high school youth and what that transition looks like for them. Also on that, I just was thinking about the local hire pipeline and one of the challenges we've had with trying to make sure that that's the most robust pipeline because I don't'",
        "'speaker_5': 'have a history of that in Long Beach. And so using these listening tours is also an opportunity to think about how we strengthen some of the work that we've already started. So thank you. And again, really support everything.'",
        "'speaker_0': 'Sure. I'll just I'll just respond with I'm really excited about trying out this equity lens in the conversation. So we're talking with the health department and they're going to conduct training before these happen about how to best sort of use these strategies and tools to facilitate the conversation.'"
    ],
    "Establishing Long Beach as a \"Kiva City\" and Funding a Temporary Part-Time Staff Member.": [
        "'speaker_0': 'So I'm sure a lot of what you talked about can be reflected. Thanks. Great. Thank you. There's a motion in a second. Please cast your votes. Motion carries gray in the next one. And we have three items that were related to this.'",
        "'speaker_0': 'So we're going to do 22, 24 and 25. When I read. That's one. I'm sorry. 22, 23, 25.'",
        "'speaker_1': 'Item 22. Communication from Vice Mayor Richardson. Councilwoman Gonzales. Councilwoman Mongo. Councilman Andrew's recommendation to direct the Economic Development Department to work with Los Angeles Local Initiatives Support Corporation and a Long Beach Community Foundation to establish Long Beach as Akiva City Vice Mayor.'",
        "'speaker_0': 'Thank you, Mr. Mayor. Just have a couple a couple of points here to make. So blueprint. Objective number two on economic inclusion specifically calls out increasing nontraditional capital resources for minorities and women owned businesses. Kiva is a nonprofit, innovative, online microfinance platform that works to expand access to financial services for small business owners who have the dream'",
        "'speaker_0': 'and potential but are locked out of commercial traditional commercial loans. Using the Kiva platform, borrowers can apply for crowdfunded loans of up to $10,000 with a 0% interest rate. Kiva Borrowers are typically entrepreneurs who cannot qualify for conventional business financing due to poor credit time in business or little financial collateral.'",
        "'speaker_0': 'Small businesses are the backbone of our economy. Long Beach is home to diverse communities and economies, with more than 9800 small businesses employing nearly 100,000 people. Yet one of the biggest challenges facing these small business owners, especially women and minority owned businesses, is the inability to access capital.'",
        "'speaker_0': 'That's why Long Beach becoming a key city is vital to the success of our vital of our vibrant small business community. To date, there are only 16 cities across the U.S. with Kiva City designation, and since 2005, Kiva has crowdfunded more than 2.4 million loans totaling over $1,000,000,000, with a global repayment rate of 97%.'",
        "'speaker_0': 'The Kiva platform has attracted the community, a community of over 1.6 million Lennar lenders from 180 different countries. So the proposal tonight is to help get Kiva off the ground in Long Beach and to support a part time point person.'",
        "'speaker_0': 'This person will provide support to city staff regarding the Kiva platform. Ten Key Kiva trainings as needed. Market and promote the program. Recruit and train Kiva borrowers to use Kiva Lending Program. Help set up other Kiva trustee partners within the city.'",
        "'speaker_0': 'Provide annual or semiannual training to Cuba. Trustee Partners and the City of Long Beach. Provide one on one support to help organizations identify and bring forth strong Kiva borrowers. Fundraise for a match that meets previous terms, which has no interest, no fees, and no credit score.'",
        "'speaker_0': 'One of our partners on Kiva is the Los Angeles Local Initiative Support Corporation, who will bring technical advice, technical assistance to the city to train staff and borrowers to use the Kiva application. So I want to thank. Executive director to new address input for helping to.'",
        "'speaker_0': 'For volunteering to offer this support. They'll also help us to market and promote the program, recruit borrowers and use their $100,000 accelerator fund to help borrowers reach their goals quicker. In addition, I want to thank the Long Beach Community Foundation, who've already pledged to help support the first year costs.'",
        "'speaker_0': 'Your support is invaluable to the success of this program, and I want to thank co-sponsors Councilwoman Gonzalez, Councilwoman Mongeau and Councilmember Andrews for dedicating one time funds to help bring Keep It Along Beach as well. But it's not too late.'",
        "'speaker_0': 'If council members have ideas or suggestions, you're more than welcome to put in some funds on these startup costs too. So I couldn't. So that's totally with a couldn't ask before do the Brown act. But we can totally ask now.'",
        "'speaker_0': 'So anybody who wants to get in on Kiva, now's the time. I'm pretty sure every district it once was off the ground. We're going to want every one of our businesses to participate. So. So you're more than welcome to help us get off the ground.'",
        "'speaker_0': 'Thank you. And that's my motion. Thank you, Councilwoman Gonzales.'",
        "'speaker_6': 'I just want to say thanks again, Vice Mayor. I think when I first heard about Kiva was in and about in Kenya. Actually, I wasn't in Kenya, but I heard about it as an initiative that was taking place in Kenya for entrepreneurs there in a third world country.'",
        "'speaker_6': 'And I thought, it's interesting, we're going to bring it here. But now that I looked at this, this is absolutely fantastic, especially in the whole realm of economic inclusion. And I will say as well, just to reiterate the points I've said before with women and just making sure that women are at the table, making sure that women'",
        "'speaker_6': 'are presenting. So I'm glad to see that, to know it will be a part of that. I know she's a very strong woman. That will absolutely be a great part of this program and making sure that we are, of course, providing opportunities for borrowers to sorry for lenders to understand what the risks are.'",
        "'speaker_6': 'And really, I'm actually looking at the Kiva website and it shows that the repayment rate is, I think, averaging over 95%. Yeah, 97, 95%, which is fantastic. So I think that. Is really great. This is a fantastic program.'",
        "'speaker_6': 'I'm glad we brought this here. And I want to thank John Keisler as well for his work in this. And Sergio, thank you.'",
        "'speaker_0': 'Thank you. Councilman Pearce.'",
        "'speaker_5': 'I want to thank you again for bringing this item. When I think about the second District and I think about how many great startups we have, coffee shops, chocolatiers was actually ended up in the first district. But a lot of these small people that start in their homes could benefit from Kiva.'",
        "'speaker_5': 'So RECs, I'm in, come in and look.'",
        "'speaker_0': 'I'll take that as a friendly amendment.'",
        "'speaker_5': 'That's a friendly amendment to include city to maybe to in being a part of, of this initiative. And I really look forward to having some conversations with staff and doing some outreach as well. So fantastic. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Mongo.'",
        "'speaker_2': 'Was there disclosure of how much you just committed to? I think it's I think it's 6200 is what.'",
        "'speaker_6': 'We're committing.'",
        "'speaker_0': '62.'",
        "'speaker_2': 'And so.'",
        "'speaker_4': 'It's less. Right.'",
        "'speaker_2': 'That would be true. Five, five, 5000. And so thank you for that.'",
        "'speaker_0': 'The five ways.'",
        "'speaker_2': 'Now I just want to thank council members for putting their money where their mouth is because I think that's what really demonstrates to businesses. Businesses put money and they finance refinanced their homes. Some of them who even have good credit, they they don't need a loan that's as big as banks sometimes give.'",
        "'speaker_2': 'And so the process and the paperwork and the work, this crowd funding of loans is just an amazing opportunity. I'm already a lender on Kiva and I hope you'll go online and join me. Get ready. Loan the Long Beach business some money soon.'",
        "'speaker_0': 'Thank you. Is there a public comment on this? I know we've heard saying saying none. We have a motion and a second. Please cast your votes.'"
    ],
    "Financial Services and Education for Youth Workforce Development Programs.": [
        "'speaker_4': 'On the.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_1': '1823 Communication from Vice Mayor Richardson, Councilwoman Price, Councilman Andrews, Councilman Austin. Recommendation to work with Pacific Gateway, work for Workforce Investment Network to provide access to free checking and savings accounts and conduct financial literacy education to all youth participants in Long Beach workforce development programs and report back in 90 days.'",
        "'speaker_0': 'Vice Mayor Thank you. And so one of the bullets in the economic blueprint under under economic inclusion talk specifically about increasing financial literacy and wealth building opportunities for young people in disadvantaged families. So this proposal tonight, as a part of that everyone in package specifically has a focus on youth.'",
        "'speaker_0': 'Young people are apt to be receptive to learning about the fundamentals of financial literacy. Teaching them how to manage a checkbook can can go a long way with in a young person's life. People often say, if I had known this when I was younger, well, we have no excuse because we have the captive audience of literally thousands'",
        "'speaker_0': 'of youth. I remember our first job it was in I know my mom's probably at home watching because she watches every council and council meeting. She probably remembers. I worked at Nickel. Nickel didn't work, work there very long, but a lot of a lot of folks come with their first job.'",
        "'speaker_0': 'That's an arcade, by the way. A nickel arcade a lot. I'm not that old. I'm not that old. It was a it was old video games but I'm a lot comes with your first job your first check comes with your first job.'",
        "'speaker_0': 'Sometimes your first checking account comes with the first job. And in Long Beach, nearly a thousand youth participate in our Pacific Gateway workforce and that investment network, youth and employment programs every year. And for them, for many of them, it's their first job.'",
        "'speaker_0': 'So with an audience of youth that already have jobs and are already earning money, we need to make sure that we are taking that opportunity to provide them with valuable financial decision making advice. We've been doing our research and speaking with Pacific Gateway, and currently there are some aspects of the financial literacy education already built into the'",
        "'speaker_0': 'program, but no access to information or direct, no access to certain information or direct connection to a free checking and savings account. So there are a number of partners who come to mind to offer these accounts. But I'm I'm confident that PG Wynn can help sort out what works best best for them.'",
        "'speaker_0': 'I know our Economic Development Committee chairman, commission chairman Randall has some ideas as well. So this is if this is successful, we can broaden this to other programs in the city, potentially all youth programing. But I think starting with youth jobs, a thousand youth in our city, I think that's a good a good target to start with'",
        "'speaker_0': '. So that's my motion. Councilman Price.'",
        "'speaker_6': 'Thank you. I want to thank the vice mayor for bringing this item. I think this is a fantastic item. I love it. I think anything we can do to educate our youth and set them up for success is really nothing but positive for our city.'",
        "'speaker_6': 'So I want to thank you for envisioning this item and for bringing it forward. I do want to suggest that we work. Obviously, we have a lot of banks in the city, but we have some uniquely well connected banks in terms of their history with the city of Long Beach.'",
        "'speaker_6': 'So they might be a good partner, at least as the pilot. Pilot. So farmers and merchants and other banks that really have a deep roots in the city would be I think they would I can't speak for them, but I think they'd welcome the opportunity to partner on something like this because it's a really great message.'",
        "'speaker_6': 'And I think these are the kind of life skills that will set these these young men and women up for successful futures. So I want to thank you for bringing this item. I think it's fantastic.'",
        "'speaker_0': 'Thank you. Thank you. There's a motion and a second journey. Public comment on this item. Just one Mr. Good here. Please come forward. It's a commendable project, and I'm going to make one suggestion, tweak it a little bit, and it's based upon my own experience.'",
        "'speaker_0': 'When I first started working, making money, going out, knocking on doors, selling wallets, brown greeting cards, and then was at a paper out well then would caddy weekends, sometimes three loops a day. One of the things I would suggest the tweaking of this is I would not make the checking account or savings account free.'",
        "'speaker_0': 'I charge them a dollar or $2. Instill in the lesson and instill the lesson. Nothing in this world is free, period. And many of those that are going to be taking advantage of this grew up, unfortunately. In an atmosphere where they're told or their parents were told, just keep popping out of kid.'",
        "'speaker_0': 'Don't worry about the expenses. We'll take care of you as long as you vote for us. All right. And that's in large measure. Not completely, but in large measure why we have so many of the problems. So I think charging a dollar or two for savings and then for the checking account would instill more that business sense'",
        "'speaker_0': 'and let them understand that nothing in this world is free. Thank you. Thank you. Senor, the public comment, please cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Economic Equity Study for the City of Long Beach.": [
        "'speaker_0': 'Thank you. And the last one of this group is 25.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson, Councilwoman Gonzales, Councilmember Pierce, Councilmember Arango. Recommendation to work with the Office of Equity to identify a philanthropic or educational partner to conduct an economic equity study on the City of Long Beach and report back in 60 days.'",
        "'speaker_0': 'Thank you. There's a motion in a second baseman, Richardson. Thank you. So to plan for more equitably, economically equitable community, we first need to start. We need to know where we stand. There's a growing body of research that finds greater economic opportunity, fosters stronger economic growth, and more equitable regions.'",
        "'speaker_0': 'What we need is a truly longitudinal analysis that looks at how dynamics change over time. The first step is a more general top line research assessment for our current environment that can lead to a more intense study to assist communities with this process.'",
        "'speaker_0': 'There are many philanthropic organizations and educational institutions that conduct these top line studies to identify and measure the various equity indicators that could prevent economic vitality, for example. I know that USC, Sol Price School of Public Policy has a startup grant opportunity for a student Ph.D. student who can provide top line research and economic equity profile in'",
        "'speaker_0': 'Long Beach. And there are a number of educational institutions that offer these smaller $25,000 grant opportunities. And the idea is this is the smaller amount of research that sets up for the larger grant or the larger ongoing analysis ongoing.'",
        "'speaker_0': 'The idea here is that we can partner locally, we can partner locally with a local institution and have some tracking evaluation over a three or five year period. But we want to start with one baseline of information. And so we want to start this process of identifying funding or a partner today that can help to help us'",
        "'speaker_0': 'to present this top line, this top line analysis. The hope here is that we can work with our economic development folks for equity folks and maybe have an update in 60 days and where we are. Sometimes it may not take 60 days to get to get this.'",
        "'speaker_0': 'We have some people who are warmed up. We have we've identified some sources that might be a good fit for this, but ongoing. The idea is that this sets up for the larger, larger, ongoing funding that can help us in tracking and evaluate.'",
        "'speaker_0': 'And the final thing I'll say is, you know, for years we hear the term when we talk about Long Beach Tale of Two Cities. And we've we've attempted many times to try to address that close the gap address to equity.'",
        "'speaker_0': 'But really, this is the piece that I see that allows us to track and see how we're doing over time. So that's that's the hope here. And I thank my colleagues now for their support. Thank you. Councilmember Pearce.'",
        "'speaker_5': 'Yes, I. I want to thank you for explaining a little bit on the funding piece for doing the study. I know that in the past we had the Seattle study that we had asked and we had tried to work with Cal State, Long Beach.'",
        "'speaker_5': 'I think the number came back in the $200,000 mark. So it's helpful to know that there are grants at USC and that we can build on that. I also want to continue to work with you and city staff on this so that we can look at some of the pieces from Seattle and bring them into this hopefully'",
        "'speaker_5': ', and make that a part of the grant as well. So look forward to that. And thank you for the first step.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_6': 'Yeah, this is Grant, the one group I wanted to include, and I know we didn't explicitly included. I'm sure they will be included are individuals experiencing disabilities, so I know we should definitely just include that in.'",
        "'speaker_0': 'That makes sense. Yep. Okay. It's Republican on this last one. Casey, nonmembers, please go and cast your votes. Public comment was, Oh, I didn't see Randall. Come on over. Sorry about that. I know time is short, but I just want to re-emphasize that again.'",
        "'speaker_0': 'We want to congratulate the vice mayor for a lot of these initiatives. And obviously, to really get them up and off the ground is going to take some financial resources. We're going to be looking to city staff to kind of help us through that.'",
        "'speaker_0': 'But to your point, Councilman Price, I mean, we want to attract financial institutions, third party nonprofits, private foundations. So we're going to go out there and look for nonpublic financial resources that really can help drive this and not only drive it to get it up and off the ground, but to indeed to be partners.'",
        "'speaker_0': 'I think one of the first steps is indeed going to be reaching out to the banks who do a lot of work with the nonprofit community, community development, financial institutions and organizations like that that can help spur this along more quickly.'",
        "'speaker_0': 'I've always thought and again, you know, I've been in the banking industry for a long time. I think one of the things that we haven't done a great job here in Long Beach is to attract that kind of attention to the city.'",
        "'speaker_0': 'But the great opportunities there are here on the west side, north and central Long Beach. I think we've kind of got to do our own marketing campaign to those institutions and have already begun to have some discussion with some of the banks who already see some Community Reinvestment Act opportunities in the city.'",
        "'speaker_0': 'Now, it's our job, just really kind of to connect those kind of resources with the opportunities we have here. So I just want to make sure everybody understood we are indeed looking for nonpublic funds to make this thing happen as well.'",
        "'speaker_0': 'Okay. Thank you. Thank you. Great. Thank you. And with that members, please go and cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Charter Amendment Committee on City Ethics Commission and Citizen Redistricting Commission.": [
        "'speaker_0': 'So thank you. Thank you very much. And that concludes the conclusion items. Thank you all that came out. For those items we're going to go we're back on the regular agenda as well here, item 21.'",
        "'speaker_1': 'Communication from Councilman Austin, Councilwoman Price, Councilmember Super Na, Councilmember Andrews recommendation to request the Mayor to convene the Charter Amendment Committee of the City Council within 30 days to discuss placing a charter amendment for the voters to establish a city ethics commission and a citizen's redistricting commission.'",
        "'speaker_0': 'Thank you, Councilman Austin. Thank you, Mr. Mayor.'",
        "'speaker_3': 'And I'd like to also thank my colleagues and Co-Actors for signing on to this item. This is, I believe, a very important time in the discourse to ensure that there's confidence in government institutions. On this item, I want to be very clear is meant to be the beginning of a discussion that will hopefully make a lasting, lasting'",
        "'speaker_3': 'reforms to our governance here in the city of Long Beach. From the national to the local level, there has been a clear erosion in confidence in our government institutions, and voter turnout is a key indicator of that. Long Beach has tried to address these issues before.'",
        "'speaker_3': 'A little bit of history. The Long Beach City Council created an ethics task force in 2001 approving a proposal by then council member Bonnie Lowenthal. And that that as the ethics task force was comprised of many people who were continuing to serve in government today.'",
        "'speaker_3': 'They presented a report and recommendations in 2002. The City Council also adopted a code of ethics in 2003. We made we made some progress. In a discussion of charter reform, the city council approved establishing an Ethics Commission and redistricting commission in 2007.'",
        "'speaker_3': 'However, those issues were not those items were not successful on the ballot because they were combined with other issues that were far more controversial. And so it's important to note that every major city in California has an ethics commission or an Office of Equity, and they include Los Angeles, San Diego, San Francisco, San Jose, Berkeley and Oakland'",
        "'speaker_3': '. Cities that we base a lot of our policies on here as a city, these commissions handles duties ranging from conflict of interest, campaign finance, city campaign laws, lobbying, government ethics and including enforcement in some cases. And so I think the time has come for us to have a really serious conversation about improving our ethics laws and codifying'",
        "'speaker_3': 'them in our governance here in the city of Long Beach. Long Beach also has had numerous divisive experiences with redrawing council district lines. In 2011. It was polarizing and politically charged. The process was polarizing and very politically charged.'",
        "'speaker_3': 'Hundreds of residents turned out at community meetings about the proposed lines. Lawn signs went up and throughout some neighborhoods, and it was not a pretty sight. In 2008, our state adopted a independent redistricting commission model that has been widely praised throughout the nation.'",
        "'speaker_3': 'It actually was drafted or put together by a former city council member, Alan Lowenthal, and our current congressional representative. Several cities have followed this approach. And eight cities in California have created citizens redistricting commissions. And those cities include Berkeley, Chula Vista, Escondido, Modesto, Oakland, Sacramento, San Diego and San Francisco.'",
        "'speaker_3': 'Common cause. The League of Women Voters and other good government advocacy groups are promoting these citizen commissions to increase transparency and to also restore public confidence. In 2015, I, along with Councilmember Gosar, proposed city proposals that the city state redistricting redistricting commission I'm sorry, again for Long Beach.'",
        "'speaker_3': 'Unfortunately, that proposal was sent to the election's oversight committee and has been stalled without further action to this point. These issues, I believe, are very timely and really merit our discussion in consideration as a city council and as a city.'",
        "'speaker_3': 'And therefore, I'd like these issues to be discussed in a meeting of a charter amendment committee. And the item tonight. I want to be very clear, does not seek to lay out the details of what an ethics commission will will do or the scope of responsibilities.'",
        "'speaker_3': 'We're looking forward to having that conversation. But this is as I mentioned in the beginning, I started the conversation in the item here, and I'd like to just a minute my item briefly, because it asks for the the the for the mayor and the charter amendment committee of the City Council to be convened within 30 days to'",
        "'speaker_3': 'discuss placing a charter amendment before the voters to establish and the City Ethics Commission and to establish a citizens redistricting commission. I think in light of the timing that we are going into the holiday season, it would be a little rough on staff and to to come back within 30 days.'",
        "'speaker_3': 'And so I would like to change that, to propose 60 to 90 days and within that window that that would give us, I think, plenty of time to prepare, but also in that period of time allow the Council to do due diligence to do their independent research and come back for that at that meeting with with the'",
        "'speaker_3': 'information to have a robust discussion. So with that, I ask for my colleagues unanimous support.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_6': 'I want to commend Councilman Austin for bringing this item forward. I think it's very important as a as an elected body that we have the confidence and and good faith of the people that we work with. It's essential to our ability to get things done, to have their trust.'",
        "'speaker_6': 'So I'm happy to support this item. And I believe it's this is a huge step forward for us in instituting good government practices in the city of Long Beach. And I really appreciated the presentation that Councilman Austin gave, because I think it does a really good job of showing the history of this issue in the city of'",
        "'speaker_6': 'Long Beach, which I was not aware of up until today, and also knowing how many other cities have initiated these practices. I know I work in a county that recently initiated an ethics focused committee or an ethics officer, and I think that's very important.'",
        "'speaker_6': 'So I'm I'm completely supportive of this, and I look forward to hearing from my colleagues on this. And more importantly, I look forward to having the bigger discussion when staff engages with us and gives us options of what some models could look like and what some of the changes to the way we continue to do things would'",
        "'speaker_6': 'be and how those would benefit our residents and ensuring that they have confidence in their elected officials. I think that. I am not obviously as familiar with the redistricting process as Councilman Austin is, having not been through it before.'",
        "'speaker_6': 'But it sounds like it was a very divisive process. And and I don't know that that process has always been fair, not just in the city of Long Beach, but around the nation. That seems to be one of the most politicized processes in governance.'",
        "'speaker_6': 'So to the to the extent that we can employ some best practices to take the politics out of such a process and enhance transparency and really strive for this concept of equity that I know is important to so many of our colleagues in such a process.'",
        "'speaker_6': 'I would be completely supportive of that. So again, I want to thank you for bringing this forward, and I wholeheartedly support this item.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'Thank you. I, too, want to thank Councilmember Austin for a robust presentation. I think that it was well done and well researched. I appreciate that our community needs to be able to look to those that are leading either the council or city departments and or our commissioners and look at the barometer in which we we really exercise'",
        "'speaker_2': 'our ethics. And so I appreciate this. And I also am a big supporter, and I will stand beside you in ensuring that we continue to have ethical leadership. And when we when people make mistakes and there are challenges, we need to have a system in place to first and foremost prevent it.'",
        "'speaker_2': 'And I think that there are lots of good models, including Metro, that lay out some of the best practices and standards to ensure that those that are stepping up are given the tools to be strong leaders and ethical leaders.'",
        "'speaker_2': 'And I think that if you don't have your ethics, you really don't have anything at all. So thank you.'",
        "'speaker_0': 'Thank you. Councilmember Bishop Brown. Thank you. And thanks to Councilman Bronson for bringing this item forward. I'm going to support it. I just had a question and maybe it's for our city attorney in convening the Charter Amendment Committee.'",
        "'speaker_0': 'Let get the language here. So if we have a citizens redistricting committee that would be made up by whatever standards are set by the redistricting committee, is that how that works? Or it will be wide open. It currently under the the redistricting is provided under the charter, I believe it's charter section 103 or 1 to 1.'",
        "'speaker_0': 'So in order to change that, to create a independent committee, I believe the motion is to have that discussion to see what that would look like. It would require a vote of the people to establish a charter committee to look at and redistricting.'",
        "'speaker_0': 'And part of the discussion and process would be bringing back maybe examples of maybe background or certain types of expertize that the council would want those members to possess in order to sit on that committee. Okay. Thank you.'",
        "'speaker_0': 'So that is yet to be determined. So there there if any detractors on the system, we don't have the system in place yet to be determined. All right. Thank you. Thank you. Is there any public comment on this item?'",
        "'speaker_0': 'Please come forward. I see two members of the public. They're going to speak. Okay.'",
        "'speaker_2': 'Good evening, Mayor Garcia and council members. Thank you for the opportunity for me to speak. My name is Sylvia moore. I'm Southern California, organizer for California Common Cause. Two years ago, I was here at the invitation of Councilmembers Gonzales and Councilmember Austin talking about the idea of a redistricting commission.'",
        "'speaker_2': 'And Councilmember Austin, thank you so much for your great presentation on Common Cause. We definitely support this proposal. We're very happy to see that this conversation is moving forward. So why an ethics commission? It helps promote public trust by providing local oversight and education about a city's ethics laws.'",
        "'speaker_2': 'And it would also fill a gap as to local ethics laws that the IPC cannot enforce. Similarly, with a redistricting commission, commission, redistricting commissions are now considered the high watermark for fair, transparent and inclusive redistricting. And that's why state and over a dozen jurisdictions statewide, including Oakland, San Francisco, San Diego, Sacramento and Modesto, have created citizens commissions'",
        "'speaker_2': 'to bring community and neighborhood input into the redistricting process. And local commissions have long been pushed by good government groups, groups including common cause and civil rights organizations like MALDEF and ACLU, because they generally result in fairer lines that better respect and protect minority communities.'",
        "'speaker_2': 'And for the foregoing reasons, we hope that you move forward on both proposals and if you do. California common cause we pledge to lend our assistance to and helping to provide technical expertize and assistance. We have a long history of helping jurisdictions establish conditions, including just last year when we collaborated with the Sacramento City Council in establishing'",
        "'speaker_2': 'that city's first Ethics Commission and Redistricting Commission. Thank you very much for your account, the council's time and consideration on this important topic.'",
        "'speaker_0': 'Thank you. Again, there's more. I just want to just just commend common cause. I think there are very few organizations anywhere that do better work than the work you guys do. And so it just means a lot whenever you guys are here and supportive of the work.'",
        "'speaker_0': 'I'm a huge supporter, so continue the great work you guys are doing. You guys are are always leading the state when it comes to these important issues. So thank you.'",
        "'speaker_2': 'Thank you. Appreciate that.'",
        "'speaker_0': 'Mr.. Good, you. Very good, you resident in Long Beach since 1977 and it's very face. The motion is so obvious. Most people think it needs to be discussed. But let me offer these thoughts on this is looking back on it.'",
        "'speaker_0': 'This is at this point. Not unlike closing the barn door after the horses are out. And let me make it clear also that I think within this council and within this community, there are people that should get and have the caliber and the integrity to be on this commission or involved in this commission.'",
        "'speaker_0': 'However. Having our current mayor or any of his criminally blessed fellow travelers involved. And setting up a commission dealing with ethics and honesty would be like Harvey Weinstein opening up an academy to teach female women how to advance in Hollywood, period.'",
        "'speaker_0': 'Let it move forward, but let it be well distance from the mayor and his criminally complicit fellow travelers. Thank you. Thank you very much. Next picture, please. Thank you very much. My name is Sterling Reagan. I live in the eighth district.'",
        "'speaker_0': 'I live in fourth range three, just Avenue. And when I heard that this proposal was coming up, I was shocked by the fact that this is not already implemented. I would have thought that as soon as a municipality is established that an ethics commission would be there with it to to ensure that the processes are safe and'",
        "'speaker_0': 'secure. And so with that in mind, if you are thinking about not doing it, I have a few reasons why you should. So currently we have a grotesque level of political apathy.'",
        "'speaker_2': 'Currently, here in Long Beach.'",
        "'speaker_0': 'It's something like 13 and a half percent voter turnout in the 2016 election, and it's hope to God that it's not that bad.'",
        "'speaker_2': 'In the.'",
        "'speaker_0': 'Next one. That's coming up. And nationwide, it's somewhere along 40% voter turnout, eligible voters.'",
        "'speaker_2': 'That is just not acceptable.'",
        "'speaker_0': 'And maybe this commission can help people more trusting in their government and say maybe I can be a part of the process and help out my community. I also think a city commission is good because it is very personal to the community.'",
        "'speaker_0': 'So the people that are, you know, you know, organizing the districts and the people that are ensuring that our councilmen are ethically secure, they are our neighbors. They are good local people. So we know them and we can.'",
        "'speaker_2': 'Keep them in.'",
        "'speaker_0': 'Check as much as possible and we know their motives. So that's a positive thing. And you know, guys, this is just common sense. You want your councilman to be ethically secure. You want your elected officials to have a certain degree of checks and balances with their own people.'",
        "'speaker_0': 'So this is a very positive I'm very glad that this is finally a part of the discussion, at the very least. And thank you so much, I hope support. Thank you. Thank you. And our last speaker. Thank you.'",
        "'speaker_0': 'I'm back again. The part that I think about this is that the Ethics Commission proposal that you have here kind of rounds the picture of the economic development package that we were talking about before, because what it's doing is going to encourage the entire city to know that our leadership is trying to make sure that everyone is'",
        "'speaker_0': 'involved and everyone is is working together, is trying to make sure that economically we're working together as a as a community. It's going to be the kind of issues that are going to work with all minority groups and everyone is going to win out of this package.'",
        "'speaker_0': 'So I think tonight has been a very positive night because to know that we're concerned about our ethics, we're going to be concerned about our economics. We're concerned about our community. So so, Mayor, I think this is fantastic.'",
        "'speaker_0': 'And I hope that the best success and I think it's going to be a great effort to but for us to move forward as a community. So thank you very much. Thank you very much. And with that, I just want to also thank Councilmember Austin.'",
        "'speaker_0': 'These are issues that need to be discussed. And we look forward to having a good, robust conversation when they come before the charter amendment committee that the charter committee, which of those who don't know is basically the city council.'",
        "'speaker_0': 'So that will be back will be back to us in a in a in a special meeting. So with that, thanks again and particularly to common cause and please cast your votes.'"
    ],
    "Development of a Veterans Affairs Strategic Plan.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you very much. Item next up is 26.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson and Councilmember Arango. Recommendation to work with the Department of Health and Human Services and the Veterans Affairs Commission to develop a Veterans Affairs strategic plan that includes programs and policies designed to assist veterans in multiple capacities and build stronger connections between local veterans and the community.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson. Thank you. In November 2014, I was I was proud to propose the creation of a Veterans Affairs Commission, which was eventually established, approved by the city council and funded over the past year. Our office began a community wide conversation about how to better honor our Long Beach veterans.'",
        "'speaker_0': 'We did this in partnership with local nonprofit city fabric, who's known for their creative approach to civic engagement. We held five focus groups with over 20 veterans services organizations, 22 neighborhood leaders, and the entire Veterans Affairs Commission, and facilitated an online campaign that engaged hundreds and generated over over 45 ideas.'",
        "'speaker_0': 'The process resulted in a comprehensive report. Hashtag Long Beach Honors Vets that presented a number of finding the recommendations on how we can better honor our local veterans. Focused on three themes sustainability, engagement and programing. One of the main recommendations in that was to examine the feasibility of creating a strategic plan with our Veterans Affairs Commission in'",
        "'speaker_0': 'order for the Commission to further develop and set its direction in focus and establish priorities as a group to work on in years to come. We we envision the development of this plan to follow a similar path to the creation of our sustainability.'",
        "'speaker_0': 'So our Sustainable City Commission Action Plan, where city staff helps guide the process over the course of about a year and a half. So that's what we envision. This recommendation came from the community and so we want to park it there at the Veterans Affairs Commission.'",
        "'speaker_0': 'Obviously, anything that would this plan would have to come back to city council. We might have to go out and seek funding to conduct this plan. But I want to make sure that we just sort of close the loop on this since it came up and park it there with the commission.'",
        "'speaker_0': 'And so, again, similar to the way the Sustainability Commission has a sustainable, sustainable action plan. We want the Veterans Commission to have a veterans strategic plan. So and I'd like to finally just take a quick moment and encourage you to join us to attend our 2017 Veterans Day celebration.'",
        "'speaker_0': 'That's this Saturday, November 11th. Many of the changes that you'll see in this year's celebration are a direct result of that report as well. So we'll have food trucks and open street event. Touch a truck. Touch a truck event.'",
        "'speaker_0': 'We'll have a ninja style obstacle course. A lot of cool, cool things. So we hope that you can join us. So, again, that's my motion. Thank you. Thank you, Councilman Mongo. Okay. Price, actually. Okay. Okay. I want to go to Councilwoman Pryce and.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_6': 'Sure. So I support this item. I think it's. It's really great. The only concern I have, and I'll be perfectly honest, is that and I don't know if you get the same feedback, Vice Mayor Richardson, but I know we tasked the health department with a lot.'",
        "'speaker_6': 'And usually when I have an item, they'll say to me, we don't have the resources or something to that effect. So have we thought about and this is a great item. I mean, who who would not propose this item?'",
        "'speaker_6': 'It's a great item. I'm just. Where are we ranking the work we're asking the health department to do? Because I think there are other issues we've asked them to work on that are really important facing the city like homelessness and other things like that.'",
        "'speaker_6': 'So if we and not that veterans aren't important, I mean, my husband's a veteran. Absolutely. But my point is, is that a something worth thinking about? Because I just I don't know if you have the same conversations with them that I do.'",
        "'speaker_6': 'Oh, yeah. Okay, great.'",
        "'speaker_0': 'Yeah, absolutely.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_6': 'Because sometimes because because we just also task the great economic economic development there. Apparently, they're going to be doing listening, helping with the listening tour.'",
        "'speaker_0': 'We gave a $40,000 to help with that.'",
        "'speaker_6': 'Oh, I thought, okay, that didn't go to economic development that went to health department.'",
        "'speaker_0': 'So they're not doing a listening tour.'",
        "'speaker_6': 'Oh, okay.'",
        "'speaker_0': 'I'm saying we're mixing up the items, but continue.'",
        "'speaker_6': 'Okay. Well, I think one we've called item. No, I may have misunderstood, but when we were on the listening tours item, there was something in the end about the health department conducting workshops or something. Was that not related to a listening tour?'",
        "'speaker_0': 'No. What we said was they have a tool. I think we're getting a little mission creep here. I'll take a borrow Nas motion, but I'll speak to it if. If it's fine, I'll say sure. The Officer Equity volunteered to help craft a tool to help facilitate the focus groups, and so that's sort of their expertize in office'",
        "'speaker_0': '. Equity is a developer equity lens that's a little bit different than what we means that we traditionally go out and do engagement. The idea about economic inclusion is engaging people who typically aren't included and may be speaking to them different ways because for whatever reason what we've been doing hasn't worked.'",
        "'speaker_0': 'So we try to do it a little bit differently here. Just to take it back a little bit. We already have a Veterans Affairs Commission and we voted in the budget to allocate a part time position to support that that office.'",
        "'speaker_0': 'This motion is really about we created the vessel. We have a lot of different commissions and they always ask the question, what should we be working on? Well, I think this commission, this is sort of what came from the community to go back and say, here's what the community is asked that you work on.'",
        "'speaker_0': 'So I'm closing that loop to say this would be a great thing to work toward since you have a staff person and you haven't been giving any clear direction. So that's the hope here that we can give them some direction to sort of work on work on this.'",
        "'speaker_0': 'Now, they don't have the staffing, they don't have the funding to actually complete a sustainable or a strategic plan at this point. But our hope is maybe if they started the work, you know, the preliminary work of maybe scoping it out, discussing what should be engaged in it, maybe doing some of their own work, you know, identifying'",
        "'speaker_0': 'philanthropic groups who might want to fund this kind of work. I think that's the direction what we're asking them to go. So but I agree with you. The Health Department does get a lot of competing the competing demands.'",
        "'speaker_0': 'What I try to do is try to coordinate and don't sort of drop it. All right. On the director, but I try to coordinate with the different offices when the health department to see if there's space capacity to take on certain things.'",
        "'speaker_0': 'And I try to complement what they're already doing. That's the idea here. We set up the commission, we gave them a staff person, and we're complementing what they're doing. That's the hope.'",
        "'speaker_6': 'Okay. And I appreciate that clarification. So so just so I'm clear, you have coordinated with the health department that this this is an undertaking that they can take. It's not a right. There's no resource issue with them on this.'",
        "'speaker_0': 'I mean, typically, city staff will come back if there's a significant staff change so that we can figure that out. But my hope is I mean, last thing I want to do is overburden our health department, who's already overburdened.'",
        "'speaker_0': 'They only get only 2% of their budget comes from the general fund. I mean, you know, this we talk about this probably every three months or so it'll come up. And I do think we need to continue to fund them more.'",
        "'speaker_0': 'But again, this goes back to in 2014. We asked them to take a look at establishing a commission. We did then we place it in the. But they came back and said for us to adequately do this, we need a position.'",
        "'speaker_0': 'And so we placed that in the budget, we placed that in the budget and so they have it there. So now we're talking about a workplan similar to where I remember we did a motion asking like there was youth commission to take a look at park programs or then we did a motion asking the youth commission to'",
        "'speaker_0': 'look at reforming them. So it didn't require any additional consultants and additional staffing. It was more so focus your work that you're already doing on this topic. So that's the hope here. Okay. Vice Council councilmembers, if I could weigh in here, we had a lot of requests that come to us from council offices on Tuesday nights and'",
        "'speaker_0': 'things, which is great. So what we'll do is like after listening to how the entire council responds to a request from a council member or a group of council members, we go back and if indeed there is a fiscal impact, we certainly come back with a two from four.'",
        "'speaker_0': 'So we'll take we'll regroup tomorrow, Kelly. Her team, John and his team, and they'll regroup on the comments they heard on all the items tonight. And if indeed we find that, oh, here's an item that definitely is going to be out of pocket on something, we'll come back and do a two from four and stuff.'",
        "'speaker_0': 'But again, they're all unique. Like, as the vice mayor pointed out, numerous items. I came with a bucket of money. So those are different. But certainly we all talk internally and if we picked up a duty that's going to impact or get in the way of other core duties that we've already been assigned to do, then we'll'",
        "'speaker_0': 'come back with a different floor and educate everybody.'",
        "'speaker_6': 'And that's great, and I appreciate that. And again, I would love for us to be able to fund all of everything we ask the health department to do because it's really, really important work. So I don't want to take away from that.'",
        "'speaker_6': 'I just want to make sure that we're all involved in the discussion of the priorities if there are resource limitations. If they're not, it sounds like there's there's not a resource issue with this particular item. So that's fantastic.'",
        "'speaker_6': 'It's within the operating current operating structure. So that's great. I just want to make sure that we're we're all involved in the conversation in regards to setting priorities for how the limited resources of the Health Department are used until such time as we can fund them with more money, as I think we all, we all agree would'",
        "'speaker_6': 'be worthwhile so that we can work on common goals and objectives for the city. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'So I missed my original call because I had to take a quick bathroom break, but I will say that the dialog has changed a bit, so I'll change my comments as well. I want to also thank both of you for the dialog about where we're spending our resources and our time.'",
        "'speaker_2': 'Because I think it's really important to a a constituency. And I think that oftentimes those allocations and discussions and priorities are incremental. And when they are incremental throughout the year, I think that's what the Budget Oversight Committee has tried to, at least through our new fiscal policies, put together some sort of criteria about resource allocation, because throughout'",
        "'speaker_2': 'the year we might resource allocate. And when a department comes to the table and asks for resources for something, they only come if they aren't able to find the resources in their own department by repurposing. But that's not a part of our dialog.'",
        "'speaker_2': 'And so on. This particular item, I appreciate that you sat with the staff and I think that my comments earlier to some of our other department heads in closed session about the great work that they're doing and how they're prioritizing and making sure that the needs of this council that ultimately means the needs of the community are'",
        "'speaker_2': 'met. To that point, we're also going to be having some some tough discussions in the next few months. And I think that it's important that we keep all of that open and transparent. And so I know that in some of my dialogs we can be super supportive of the items.'",
        "'speaker_2': 'And I just want to say that I seconded this motion. I too believe in it. I think that it's important and that there does need to be a time in the next few months where we as a council talk about here are the priorities of this department overall and here's how we allocate time and resources, because those'",
        "'speaker_2': 'those things really represent the taxpayer dollar in every single thing that we do. And so I appreciate you being mindful of that, Councilman Price. And I know that sitting on the Budget Oversight Committee gives you a unique perspective into the details of each and every one of these decisions.'",
        "'speaker_2': 'And I don't want that to hinder members like Councilmember Richardson for being creative and going out there and taking a stand on things that's important. So I will be supporting this item. Thank you.'",
        "'speaker_0': 'Basically. RICHARDSON Thank you. And I just wanted to sort of refocus this again, veterans assets to create a to work with them to create a strategic action plan. And we have a part time Veterans Affairs Coordinator, Council member to my right, Councilman Austin asked me, hey, why is this with health department?'",
        "'speaker_0': 'And that actually triggered to me that maybe we should opened up by stating we have a detail, we have a, you know, a commissioners place within the department and a staff person that's within the department. I think that could have guided the conversation a bit differently.'",
        "'speaker_0': 'So I'll just say, you know, this is this is sort of this is a continuation of work and steps that have been that began in 2014 and that have all evolved. But it really isn't new work. It's really just continuing to focus in hone in a conversation that started in 2014 and so so again, my hope would'",
        "'speaker_0': 'never be to overburden the health department or any other department. But I do think they should be I mean, they should be aware when folks ask for something, we should have the ability to refer to them, to evaluate it.'",
        "'speaker_0': 'And the hope, again, is that in my answers, I anticipate we might be able to identify the resources to put something like this together. And I hope when when those funding that funding does become available to do a veteran strategic plan, then we can say when our commission say, Hey, I was appointed to a commission on a'",
        "'speaker_0': 'commissioner, say that we can say when someone asks them, what do you actually do? And they can answer the question. As a Veterans Affairs Commissioner, I prepare and approve those. The Strategic Long Beach Veterans Strategic Plan every year, every two years.'",
        "'speaker_0': 'That's the hope to kind of give purpose to these commission, to this commission and to these commissioners. But thanks a lot. Thank you, Councilmember Pearce.'",
        "'speaker_5': 'Yeah, I did just want to highlight I appreciate how anytime you bring items forward, you really work with staff ahead of time and trying to identify funding sources and partnering with the different departments. Talking about equity is hard for some people to wrap their head around and understand that it's the equity lens that's been so important to'",
        "'speaker_5': 'me in my life is that it's a tool that we use, no matter if it's economic development, health, veteran's, but that there is that toolkit there. And so doing that is really important. And I also want to, you know, as a previous chair of a commission in the city who really struggled to get staff to move forward'",
        "'speaker_5': 'with a vision on our own, it really helps to have direction from the council and city staff. Well, we all know here's our goals and here's what we're working towards. There's nothing more frustrating than being appointed to a commission.'",
        "'speaker_5': 'And I think. The mayor has done a fantastic job of appointing people that are not just on commissions for their name, but really want to roll up their sleeves and do the work. So I again support you for making sure that there's actually a work plan in place and doing that together with the commission and the community'",
        "'speaker_5': '. So thank you again for another wonderful item. Vice Mayor It's what, what do we call it? Rex Night. What is it? The Rex Show. I love it. Rex Fest. That's a good job.'",
        "'speaker_0': 'Thank you, councilman orson.'",
        "'speaker_3': 'Okay, I am. I'm in support of this item because I'm in contact with and meet with my veterans commissioner quite frequently comes to all of our community events, but also has my ear and has expressed frustrations with the commission in terms of direction and scope.'",
        "'speaker_3': 'And so I'm supportive of creating a commission and strategic plan that hoped with and hopes to give the Veterans Commission a better direction, which I think this this does. And so I'm happy to support that. Not clear.'",
        "'speaker_0': 'Why.'",
        "'speaker_3': 'And how this is connected to equity in Office of Equity. I don't think it is.'",
        "'speaker_0': 'It's not.'",
        "'speaker_3': 'Okay. It's. This is about our veterans. Yeah. So the veteran. Okay. Thank you. I'm supportive.'",
        "'speaker_0': 'Katie, public comment. CNN, please cast your vote.'"
    ],
    "Downtown Long Beach Property and Business Improvement District Annual Report and Funding Agreement.": [
        "'speaker_1': 'Motion case.'",
        "'speaker_0': 'Thank you. Item 27. Next item.'",
        "'speaker_1': 'Report from Economic Development and Public Works. Recommendation to approve the downtown Long Beach Property and Business Improvement District Annual Report. Automatically extending the agreement for funding with the downtown Long Beach Alliance for one year districts one and two.'",
        "'speaker_0': 'Thank you. Report from staff.'",
        "'speaker_6': 'I think I have to excuse myself. My partner Adam works for the DLP, so I will excuse me.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Okay. Madam Clerk, meet with the item or we'll just read the item. Staff can. Just now. I mean, just backwards. Sure. I mean, members of the city council. This item is the annual approval of the downtown Long Beach Property and Business Improvement District Annual Ongoing Assessment.'",
        "'speaker_0': 'The recommended action in this item continues the assessment for another year. There are no proposed changes to the basis of assessment. However, the downtown Long Beach Alliance board voted on May 4th, 2017, to raise the assessment rates 3% per the allowed Consumer Price Index adjustment, which is reflected in the annual report.'",
        "'speaker_0': 'There are no significant changes in proposed activity. Staff requested the City Council approve the annual report and continue the assessment and authorize the city manager to extend the agreement for one additional year. That conclusion report. Thank you, Councilmember Pearce.'",
        "'speaker_5': 'Yes. I just want to thank the DOJ for their hard work. I want to thank Eric and the team for working with the Dolby. I know we roll these out a little differently than we did last year. And I also want to highlight that the deal is taking on a little bit more in supporting our arts park'",
        "'speaker_5': ', bringing on insurance so we can have that open more often. So again, creating a safe downtown. So thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson. Hear, hear. Keep the public comment on this item. CNN. Please cast your votes.'"
    ],
    "Contract Award and Appropriation Increase for Citywide Parking Operations and Management Services.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you. Next up is item number 29.'",
        "'speaker_1': 'Report from Public Works Recommendation to award a contract to L.A. Z parking in California for citywide parking operations and management services for a total contract amount not to exceed 9,448,990 978 citywide.'",
        "'speaker_0': 'Okay. Thank you. I know that we have a staff report on this. I'm going to turn this over to Mr. West. Craig Cogen. Hi, Craig. Craig Beck.'",
        "'speaker_4': 'And. Come on. It's great.'",
        "'speaker_0': 'No, I'm right here. Good evening, Mayor, and members of the City Council. We would like to give you a brief presentation. So this is about a parking services RFP and as information, see if we can get this to work.'",
        "'speaker_0': 'We can advance to the next slide.'",
        "'speaker_4': 'I don't know.'",
        "'speaker_0': 'Thank you so much. There we go. So the city does manage 25 different city owned parking assets and that includes seven parking garages. The Aquarium City plays Broadway, Lincoln and 100 Broadway, which is our garden lot behind us.'",
        "'speaker_0': 'We also have nine different beach lots. So what are we seeking in a parking operator? We're really looking at someone who can provide maintenance for all of our facilities, who can provide customer service, and who can really look to ensure that all of our patrons are safe using our garages.'",
        "'speaker_0': 'Some of the maintenance work includes sweeping trash removal, regular power washing of the facilities and then minor things paint, touch up, graffiti removal, things like that. To give you an idea of the scale of what we're talking about in fiscal year 17, we anticipate that parking operations will collect almost $9.4 million gross revenue.'",
        "'speaker_0': 'And our largest structure is the aquarium structure. It receives almost 745,000 visitors annually and generates almost half that revenue, $4.4 million. So quite a big operation. I think. Not only does it support the aquarium, but certainly many of the restaurants and businesses down in the Pike area.'",
        "'speaker_0': 'We're also interested in supporting our special events. As we all know, Long Beach is a great location for special events. We see our special events growing from year to year. We have some major events in the Grand Prix, our Pride Festival, Long Beach Marathon and most recently we've seen more and more activity occur down on the Queen'",
        "'speaker_0': 'Mary with the concept of Queen Mary Island. This year's Queen Mary Dark Harbor was so popular that there was special transportation arranged between the aquarium garage where many of the patrons would park to and from the Queen Mary as part of that event.'",
        "'speaker_0': 'Also need to recognize that we have a lot of filming that happens in our city. Over 500 filming permits are typically issued in a year, and that includes closing down streets and it may include special operations where our parking operator would support.'",
        "'speaker_0': 'So in seeking providers for this service, we were really honing in on these categories. We wanted our vendors to share with us their experience in parking management, event management, how they deal with customer service, what their customer service plan look like, what their staffing service plan would be for the various assets, especially the aquarium garage, given its'",
        "'speaker_0': 'high frequency of use. And we also wanted to know their operational plan and what it would cost to provide those services as information. The current parking contract ends in the end of March of 2018. So we did go through an RFP process.'",
        "'speaker_0': 'The RFP was out to the community in March of this year. We did receive five qualified proposals and went through and those came in in May. We went through interviews with all five firms in June, and in July we we shortlisted two to what we believe were the most qualified candidates, and that was last parking and speed'",
        "'speaker_0': 'plus. Those two finalists went through a community partner interview where we engaged both the DOJ, the Aquarium of Pacific, to sit on a panel and have a conversation with these two finalists. And then in October, we issued a notice of intent to award for the recommendation of last parking.'",
        "'speaker_0': 'The city did receive a bid protest. There was a protest issued over the notice of intent to award. Our purchasing group did receive the protest, review the protest and essentially said there was no basis for the protest and moved to support Stout's recommendation.'",
        "'speaker_0': 'So that is what we have before you this evening. Staff is recommending that council move forward with a contract with LA's Parking LLC. We believe that LA's completely understands the complexity of the parking operations in urban areas and specifically in what we need here in the city of Long Beach.'",
        "'speaker_0': 'They've identified a personable and experienced individual as their parking manager. Their cost proposal actually came in less than our number two candidate, about $381,000 annually. I think staff also appreciated the focus that LA's has on special events. They have some very notable clients for special events the Emmys, Golden Globes, Academy Awards, and they also support many California'",
        "'speaker_0': 'operations like LAX, John Wayne Airport and municipal cities in the Bay Area that are listed here, Berkeley and Walnut Creek. So that concludes our presentation and we're available for questions. Thank you. Thank you. I know we have a motion that we're going to, I believe, take public comment first per the request, and so is your public comment'",
        "'speaker_0': 'on this item. Please come forward. Good evening. My name is Jason Johnson. I'm senior vice president for SPX Plus Corporation. We've been the city's parking operator for the last ten years and unfortunately we ended up on the wrong side of this particular bid.'",
        "'speaker_0': 'I always hate coming in talking on these items because it always sounds like spilled milk when you didn't win. Right. But there were enough items that we saw throughout the process that we thought we should at least come and have our say.'",
        "'speaker_0': 'Right. We did protest. The protest was tonight. Hopefully I can give you a few things to think about in a relatively short period of time. So my first set of concerns are around the process, and there's really four items that individually would be concerns.'",
        "'speaker_0': 'And taking them as a total was an even bigger concern for us. Right. And that was the scoring criteria had no way to get average. Right, which gives a lot of leeway to the folks that are evaluating each of the proposals.'",
        "'speaker_0': 'We had no scoring sheet was provided. Our FOIA request was denied before this meeting. And then there's a 20% contingency on this contract, which I've been doing this a really long time and I've never seen anywhere anything close to that.'",
        "'speaker_0': 'And with that 20% contingency, it could take this contract from being less expensive to being considerably more expensive without them without staff having to come back and talk to council. All the value ads that were mentioned in the staff report, we we've recommended to the city over the last few years, we've provided that documentation.'",
        "'speaker_0': 'So the second set of concerns are with us with the selected provider. They've got no no significant municipal contracts here in Southern California. We have a number of them. They have a history of underbid contracts. That has led to some significant thefts.'",
        "'speaker_0': 'And we have one that's that's major. And it's come up pretty significantly here recently, which is they had a theft at the MTA in Boston, which ended up in a $5.6 million settlement for that theft. All right. The attorney general for Massachusetts said by failing to implement reasonable revenue controls, laws gave supervisors and parking attendants the opportunity'",
        "'speaker_0': 'and means to skim cash. So in closing, I'm sure that you guys are all aware that another municipality here in Southern California, Pasadena, just went through the same process. Last was the recommended vendor from staff. City Council rejected that not once, but twice, because they weren't willing to take the chance on someone that has this significant theft'",
        "'speaker_0': 'in recent history, in recent memory. Right. And so city council voted to extend the contract for another year with the existing providers, and they're going to look at it again a year from now. Thank you for your time.'",
        "'speaker_0': 'Thank you very much. And will the public comment on this item? Okay. Good evening, Mr. Mayor. Mr. Vice Mayor, esteemed members of City Council. My name is John Special Ed. I'm the senior vice president for parking. On behalf of all of last parking, and in particular our 2000 local valued team members, we wanted to let you know'",
        "'speaker_0': 'how excited we are to be staff recommendation since the RFP process started. We worked very hard to put our best foot forward. We want to thank staff for all their hard work and diligently vetting all proposals. We sincerely feel that we can bring a renewed passion to the parking operations that result in improved customer service, as well'",
        "'speaker_0': 'as new technology to improve the user experience. We look forward to working with staff, Long Beach residents and the other stakeholders to improve parking in Long Beach. I know that our competition touched on, you know, our lack of experience here, but we have several reputable clients, both in the municipal and private sector, that we've provided letters of'",
        "'speaker_0': 'recommendation on to staff. We've been completely transparent and full of integrity throughout this process, and we want to bring that same level of integrity and passion to City of Long Beach if we're so fortunate. Thank you for your time and consideration.'",
        "'speaker_0': 'Thank you. Any other public comment? Okay. So, you know, the public comment will close, public comment will go back to the council. Councilmember Pearce.'",
        "'speaker_5': 'Yes, I want to thank staff for their work on this. I in the last week have met both with both companies that are here today. Went back to staff for several questions. And I wanted to get a couple of clarifying things for the 20% contingency.'",
        "'speaker_5': 'On the contract, we had discussed what those might be for. And one thing that I don't think was necessarily elaborated on that is one of the things I'm excited about with Lars is the technology, the ability to be nimble, the ability to think outside the box, in using things like a phone app that says, you know, I'",
        "'speaker_5': 'can reserve my parking spot ahead of time. Often when people come to a downtown, they find themselves anxious about parking. Even though we know that there is parking, being able to take on private lots. So, you know, we had mobile here that was here earlier talking about if we were to take on a private lot, working with'",
        "'speaker_5': 'the city to partner with that is really important to me. And so my specific question is, can you clarify what the 20% contingency might be used for?'",
        "'speaker_0': 'Certainly, Councilmember Pearce, I think it's important to make sure council understands we compared the two tracked proposals apples to apples. So the $381,000 savings annually that I mentioned, that is a comparison of the annual contract regardless of the recommendation that was before council.'",
        "'speaker_0': 'Whether that was LA's or if if staff was recommended Espn+, we would still be recommending that council provide a 20% contingency to that contract. We think it's important to give us leeway to address some things not only within our structures but within special events.'",
        "'speaker_0': 'And we believe that that kind of capacity allows us the ability to, say, improve a gate, arm or things that may come up over the course of a contract that we can't foresee at this point in time. Of course, that's all supported by parking revenue.'",
        "'speaker_0': 'If that revenue is not there to support that additional cost, then that is nothing that we would expend money on. But having that flexibility just allows allows us to move quickly to address issues focused on customer service. So everybody coming in to our downtown and all of our parking assets have the best experience they can.'",
        "'speaker_5': 'Great. And can you clarify for me, you mentioned infrastructure improvements, security arm. If something like that happens where I know a lot that's in Councilmember Gonzalez, his district often has issues. If something like that comes up, whose responsibility is that?'",
        "'speaker_5': 'If it's on a city lot?'",
        "'speaker_0': 'Well, ultimately, it's the city's responsibility. But we rely on our parking operator to work with us. Many times we will use our parking operator to actually procure the equipment. Espn+ has done that for us over the years when we needed to do an upgrade and we worked closely with our parking operator to make sure that we had'",
        "'speaker_0': 'that ability to upgrade the equipment. And this 20% contingency would allow us that flexibility moving forward. For example, right now we know we need to make an investment in our city place garages, that that equipment is somewhat outdated and we want to improve it for the customer experience.'",
        "'speaker_5': 'Great. Thank you. I also would like to to highlight, you know, there are several letters in here supporting LA's post, any of the press stuff that has been talked about and following up with those cities that feel really confident and are continuing to sing the praises as one of the other issues, I think it's the right decision'",
        "'speaker_5': 'for the city, and I look forward to not just having a parking company, but working with you guys in partnership in the private lots and working with you. And how do we take.'",
        "'speaker_6': 'That.'",
        "'speaker_5': 'App and make sure that it's on my website, council members website, every business in the downtown and the East Village that we really are trying to to use technology and inform our residents of that. And so I expect you guys at my neighborhood association and my board meetings should this move forward tonight.'",
        "'speaker_5': 'So thank you for for offering that as a partnership. I hope that my colleagues will support staff's recommendations. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Gonzalez.'",
        "'speaker_6': 'Yes, I am excited to talk about parking, because I think this is something that especially downtown residents have been wanting to see move in perhaps a different direction. And I have a few questions myself and I too have met with both teams and making sure that I'm getting all my ducks in a row and on behalf of'",
        "'speaker_6': 'my residents, who in the city would spot, check or audit the contract?'",
        "'speaker_0': 'Councilmember Gonzales said city staff and public works will manage the contract and will be the primary point of contact for them. Our community projects officer, April Walker, has been involved through the entire RFP. Has been a member on the interview groups as we vetted this whole process.'",
        "'speaker_0': 'And she'll be the primary point of contact in helping to coordinate any issues that may come up with the contract.'",
        "'speaker_6': 'Awesome. I was going to say, who's our Luis Maldonado from back in the day? It's now April. Great.'",
        "'speaker_0': 'Now April.'",
        "'speaker_6': 'Wonderful. And then given, you know, the Massachusetts Bay Transit Authority had been brought up, of course.'",
        "'speaker_2': 'Could you just go over really.'",
        "'speaker_6': 'Quickly the insurance requirements that we have on our end to help prevent any issues going forward?'",
        "'speaker_0': 'Certainly, I think that there was a memo that staff sent to council earlier outlining this process. And I want to let everyone know that we really did do our due diligence in reviewing and reached out to Massachusetts and talked to the people involved in this particular incident and every response that we received.'",
        "'speaker_0': 'Not only commended leis for their cooperation, but also pointed to an individual and this was an act of an individual and not something that was indicative of the corporate environment or the service that Lars provided to the organization.'",
        "'speaker_0': 'Kind of, as we look moving forward, one of the things that we're requiring of our parking operators is that they have insurance in place that should this happen moving forward, that there's a policy that would cover the city for any incident such as this.'",
        "'speaker_6': 'Great. And I, too, am very excited about seeing what could occur with technology. So aquarium barcode scanning, entry exits and also special events. And I know that people don't think that that's maybe a big deal, but it absolutely is with our city, especially as we're growing.'",
        "'speaker_6': 'I just hosted, you know, 7 to 8000 people over the weekend. I don't even expect that many people. But we did with our Day of the Dead event. And to think that the very first thing that people were thinking about absolutely was parking and how we could be more efficient on the coordinating side to be able to'",
        "'speaker_6': 'relay to individuals how they can get in and out of our city even before getting in and out of our city, which is pretty incredible. And I also had a question about the parking lot map that we had in the memo.'",
        "'speaker_6': 'It mentioned a few lots that look like they're going to be transferring hands to development. So seventh and Pacific and third and fourth and Pacific. So how will that be transferred? What would that look like?'",
        "'speaker_0': 'So the contract is before we this evening is based on all of the facilities that we're operating now. As those facilities transition to private ownership, then we would no longer be providing parking services there. And those hours or need for service would be adjusted within the contract.'",
        "'speaker_0': 'And, and, and if the city were to acquire a lot and, and add a new lot. Similarly, we would adjust the contract to add services to say a new parking lot.'",
        "'speaker_6': 'Okay, great. And then the final thought that I have is just in relation to maintenance and safety, and that has been a big deal. I know, Craig, we've talked often and we've talked City Place Garages and for us I think that is a key point to ensure that businesses feel safe when their.'",
        "'speaker_2': 'Employees are.'",
        "'speaker_6': 'Walking to and from the city garages, as well as residents who want a very streamlined process. I hear online payments will be very easy for individuals to make. I used to rent a space across the street from where I live in the city, post garages, and it was a little difficult.'",
        "'speaker_6': 'And so to make that a little bit more streamlined and a lot easier for residents, I think it will be key as as well as having the safety and just the little things, maintenance, making sure graffiti and trash and the the the markings are all on point because our city is looking and getting a lot better.'",
        "'speaker_6': 'I also want to thank Craig Kochen as well. We've been working on this, I know, for some time too, so thank you to all who have been involved. I look forward to honoring staff's recommendation. Thank you.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_6': 'Thank you very much, Mr. Vice Mayor. So just a couple of questions here. You said that the the contract for the recommended vendor is 381,000 per year, less than the second recommended vendor. Was that right?'",
        "'speaker_0': 'Yes, Councilmember, that's correct.'",
        "'speaker_6': 'So based on the experience that we've had with the second vendor, do we think are we concerned at all that this this. Under this estimate of $381,000 less is going to have any operational ramifications or employment ramifications or anything like that.'",
        "'speaker_6': 'Like how are they able to do it for a $381,000 less? I'm sure you consider that in your analysis.'",
        "'speaker_0': 'Yes. Councilmember, I'd like to highlight a couple of things in response to your question. First off, I think that there was a concern earlier that was raised about the employees that are currently providing those services. And those employees are represented under an IMU agreement with Local 324 Union.'",
        "'speaker_0': 'I'd like to say and share with this Council that LAS has exact executed a memorandum of agreement with the United Food and Commercial Workers Local 324 to basically honor that agreement, which is in effect through December 31st, 2019.'",
        "'speaker_0': 'So that collective bargaining agreement that's covering the employees that are providing that service today will continue in place under this new operator. So I think that addresses probably your question about wages and benefits, etc., for those folks providing the service.'",
        "'speaker_0': 'What we did as part of the RFP response is we asked each of the proposers to give us a staffing plan and an operation plan, and we did that solely to ensure that we were seeing the same level of service from vendor to vineyard, a vendor.'",
        "'speaker_0': 'And so they a number of hours, the number of individuals, the number of community contacts, project parking managers that were out in the field and available to support these efforts was consistent. And while some may tweak it a little bit between where they have certain individuals, what we're seeing is a like for like hours, number of hours'",
        "'speaker_0': 'that are provided between the two finalists.'",
        "'speaker_6': 'Okay. And what's their responsibility in regards to maintenance of the lots? Six of the lots are in city, three on their beach lot.'",
        "'speaker_0': 'So so under this contract they would provide general maintenance trash pickup if there was some striping improvements that needed to be done. Graffiti removal, you know, normal maintenance that you would think about if it was a larger project.'",
        "'speaker_0': 'I know right now we're engaged in a large construction project on the ground a lot down in District three, and that would be taken on by the city and public works would manage that effort.'",
        "'speaker_6': 'Okay. Because that's that's a concern for me going forward when I see a number like $381,000 less per year. What I want to make sure is that the operator understands that there are certain expectations with maintenance of the parking lots, especially the ones that are on the beach, because they are the areas where we see a lot'",
        "'speaker_6': 'of trash after special events. And that is just completely unacceptable because it really devalues that whole area. So I want to make sure that that $381,000 a year less doesn't mean there's less attention paid to to trash pickup or graffiti removal.'",
        "'speaker_6': 'And the other things that you mentioned, I will say I did also have the opportunity to meet with both parking vendors, and I appreciate staff answering some of the questions. I did look up as the speaker was talking.'",
        "'speaker_6': 'I did Google, Pasadena and LA's and so I did read the article. So I'm happy that staff considered that in making its recommendation because prior to that I wasn't sure if staff had already factored that into it. And I feel satisfied that that staff has looked into it and that we're not exposing ourselves to a liability.'",
        "'speaker_6': 'I would say that if we're having costs come in over the anticipated budget such that the 20% contingency is being triggered, I would want a report back to council. So I would like I would like to make a friendly to my colleagues that if that 20% contingency is triggered, that council get our report back.'",
        "'speaker_6': 'And so that we have the opportunity to look at what what happened, why was this budget not sufficient and why did we have to tap into that 20% contingency so that we're aware of the situation? Is that agreeable with staff?'",
        "'speaker_6': 'Is that something you'd be okay with?'",
        "'speaker_0': 'Certainly, Councilmember Price, I don't see a challenge with that. And let me just give you an example of where that contingency may also come in. Recently, we expanded the number of monthly parking passes in our city place garage and that the number of employees using that greatly increased to almost 800, primarily connected with Molina health care.'",
        "'speaker_0': 'And with that number of folks coming and going every day, we really needed additional security service and additional maintenance, but we were receiving the revenue to help support that. So we utilized some of that contingency budget to enhance those services, to support that level of service that we were experiencing in that garage.'",
        "'speaker_0': 'So providing a report to council on those type of items and where we would engage that contingency is isn't a challenge at all.'",
        "'speaker_6': 'And I think if the maker and the secondary, the motion are open to that, I think that would be good. You know, I'm not worried about the scenario that you just mentioned. What I'm worried about is an underestimation of the actual costs under normal conditions.'",
        "'speaker_6': 'So certainly things are going to happen that are unusual. That would necessitate us to be, as council member Pearce said, nimble and responsive. But if there's normal operations because they've not had experience in the city of Long Beach, we'd want to know what those what those areas are so that we can improve upon them.'",
        "'speaker_6': 'The one thing I will say that I really liked about LA's is they have experience with private lots, as Councilmember Pearce mentioned, and they have experience with valet, extensive experience with valet with Coastal Commission, which is an issue that is a major factor for the third district and something that I think is going to become very relevant'",
        "'speaker_6': 'as we see development with Second and PCH and some of the other restaurants in that and that corridor. So restaurants and businesses in that corridor. So I expect that they will hopefully provide a resource to us in those regards.'",
        "'speaker_6': 'But I appreciate the presentation from both of the the vendors and I think staff for their work on this recommendation. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'I'm really appreciative of the answers that have been provided today. And I will only add to it that when there are opportunities to use that contingency for new and creative things, that there is also a partnership opportunity with our Parks and Rec director.'",
        "'speaker_2': 'And I know that Marie Knight and I spoke about. The opportunity to use some of the parking gate technologies at Eldorado Park, and that especially this year as the community has flourished and thrive. Our level of drive at the parks has gone up.'",
        "'speaker_2': 'We have been faced with some unique parking challenges, specifically at our parks. And so with the two lanes going in and the opportunity to automate a lane for our members and to move away from our old school pasts and the risks and liabilities of our city staff.'",
        "'speaker_2': 'I'm holding large quantities of cash on those days when other options of credit cards and the automation process especially. I know that I talked a little bit with potential parking providers, that there's a lot of data available. Once you start instituting these pass cards instead of a tag that's in your and your window now you can start'",
        "'speaker_2': 'seeing how many times a week, a month, a year are our high propensity users using it or people buying it in your past and using it twice? Are they buying an annual pass and using it every day of the week or once a month?'",
        "'speaker_2': 'And what does that look like? It also helps us start being able to keep track of those that come in on foot if we want them to start using their pass code to get in or out, that that allows us to start seeing the number of users we have.'",
        "'speaker_2': 'And so I just look forward to some technology opportunities and I'm appreciative that the contingency is mostly used for new things and not as a gap. And I think that that's a really important point, and I thank you for that clarification.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_5': 'Yes. I'd like to thank my colleagues for their comments. I accept that friendly. But I would also I understand that sometimes you see something that's new and exciting and it promises a lot. And I know that we also have a lot of challenges with cleanliness and our lots existing right now.'",
        "'speaker_5': 'So I would also like to ask that city staff just do it could be a two from four a report back in a year into how the changes have happened. And if we see more opportunities to put in place kind of the vision that we set forward today.'",
        "'speaker_5': 'Just so we have an opportunity to discuss that. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Hastert.'",
        "'speaker_3': 'Yes. I wasn't going to speak this evening, but Councilman Mungo's comments sparked an idea or thought. I know we brought an item before the council. I want to say about a year and a half ago to look at meters and using those meters to bring or to raise money for our homeless programs here in the city.'",
        "'speaker_3': 'Oh, I would really love that for our our public works department to have that conversation with our new vendor. I expect this to be passed this evening to to look at some some creative ways to engage and help develop that, because I know we received too far from the idea was, I think, a noble one, one that'",
        "'speaker_3': 'is actually working in other cities. But parking meters and old parking meters in particular in business districts would would, I think, help a lot in terms of raising necessary resources to help our homeless population and provide services and to, you know, avoid panhandling in any way possible.'",
        "'speaker_3': 'So this just one thought that I had and I'm supportive of the item.'",
        "'speaker_0': 'Thank you. That concludes comment from the city council. So there is a there's a motion in a second by Councilmember Pearce and Councilwoman Gonzalez, our members, to go ahead and cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Ordinance on Default Beverages for Children's Meals.": [
        "'speaker_0': 'Okay. Thank you very much. Next up is item 30.'",
        "'speaker_1': 'Communication from City Attorney Recommendation of Declare Ordinance Amending the Long Beach Municipal Code by adding Chapter 8.17 relating to default beverages offered with children's meals. Read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'Mr. City. Mr. City. Attorney. Thank you, Mayor. Members of the City Council. The document before you this evening and that was in your package has been amended at the request of both the councilmember from the second district and the Health Department.'",
        "'speaker_0': 'And the change occurs on page three of the ordinance as we further define milk or nondairy milk alternatives. Well, we would the new language would read nonfat or 1% milk or nondairy milk alternative that is under 130 calories per container and or serving offered for sale.'",
        "'speaker_0': 'And with that change, we would submit the document. Okay. There's a motion and a second. Any public comment? So please cast your votes.'"
    ]
}