{
    "Resolution to Vacate Alley West of Cedar Avenue. ": [
        "'speaker_1': 'So, Madam Clerk, hearing number one.'",
        "'speaker_0': 'Here, item one is a report from Public Works recommendation to receive supporting documentation into the record, concludes a public hearing find that the area to be vacated is not needed for present or prospective public use and a resolution ordering the vacation of the alley west of Cedar Avenue between La Reyna Way and Seventh Street, District one.'",
        "'speaker_1': 'Staff, please.'",
        "'speaker_5': 'Yes. The presentation will be given by Sean Crombie, our Deputy Director of Public Works.'",
        "'speaker_6': 'Good evening, Honorable Mayor and Council. Item one on the agenda is a continuation in a process to vacate property located off of Marina and Cedar. Vacation of property has.'",
        "'speaker_7': 'It's a multiple step process and this this.'",
        "'speaker_6': 'Property, like any property going through vacation, has gone through through those steps. This property was found to be compliant with the general plan, the vacation. The Planning Commission heard and approve that item on December 1st, 2016.'",
        "'speaker_7': 'It also came before this.'",
        "'speaker_6': 'Council on February 7th with multiple actions.'",
        "'speaker_7': 'First to deal with California Environmental Quality Act and then to.'",
        "'speaker_1': 'Set a.'",
        "'speaker_6': 'Public hearing for tonight. One of the the boarding property owners requested that this item be continued until May 16th because they couldn't be here. And so it's our recommendation that we that we do that.'",
        "'speaker_1': 'Thank you, Councilmember Pearce.'",
        "'speaker_3': 'Yes, I just on behalf of Councilwoman Lina Gonzalez and the residents would like to make the motion that we continue till May 16th, which is the earliest date that was available for this hearing.'",
        "'speaker_1': 'Okay. Thank you. With that, there's any comment on the hearing. The postponement of the hearing. Please come forward. This is a public comment on the postponement of the hearing.'",
        "'speaker_4': 'I live in that area. I don't I've never heard of this before. I don't know what vacation means. Does that mean abandon it? To vacate it and between. Between Cedar and Laredo. I heard between Marina and Dana. That's on Cedar, that's on Main Street.'",
        "'speaker_4': 'And they did. Is that what it is?'",
        "'speaker_1': 'No. So just to explain that work and so we're not going to actually hear the item today. It's the motion is just to postpone it for another day, but just for your own, so that, you know, they're looking at possibly vacating an alley west of Cedar.'",
        "'speaker_1': 'No, not cedar itself, but an alley. And so that discussion about whether or not vacating it, which essentially means not using the alley, so it would go to another use and Mr. Crumby would use would be in this case.'",
        "'speaker_6': 'The property was previously used as an alley. And what this would do is.'",
        "'speaker_1': 'We find.'",
        "'speaker_6': 'That the the property is not needed for public benefit and a return it to the private property owners. So currently it's fenced off.'",
        "'speaker_7': 'And it's not being used for anything other than growing weeds and.'",
        "'speaker_1': 'Collecting trash.'",
        "'speaker_6': 'This would allow the property owners that are there to incorporate it into their properties and use it.'",
        "'speaker_1': 'So I think.'",
        "'speaker_4': 'That just completed last year in order to turn it into a recreation area and put park benches in it and and so at a very large cost.'",
        "'speaker_7': 'So this would this would.'",
        "'speaker_1': 'Border that property. That's not our property currently. It's fenced.'",
        "'speaker_7': 'Off. You cannot get access to it. But behind the.'",
        "'speaker_1': 'Fences.'",
        "'speaker_7': 'Weeds are growing and trash fills in there and.'",
        "'speaker_6': 'It's serves no purpose.'",
        "'speaker_4': 'Currently it's on Marina way.'",
        "'speaker_1': 'Yes. And so it will do it so, ma'am. So because today's and actually we're not doing the hearing.'",
        "'speaker_4': 'Oh, I understand.'",
        "'speaker_1': 'Yeah. So I will.'",
        "'speaker_4': 'Because I own property, right?'",
        "'speaker_1': 'Absolutely. So we're going to do is we're going to have someone as soon as this hearing votes over is going to come chat with you from the first council district. And we're going to get you the information. And then when this comes back, we'll make sure that you're here for the hearing.'",
        "'speaker_1': 'Okay. Absolutely. And so there's a motion in a second to postpone the hearing at the request of the the person making the hearing request. Any other public comment on postponing the hearing? Seeing nonmembers, please cast your votes.'",
        "'speaker_0': 'Bush and Kerry's.'"
    ],
    "Draft Ordinance for Free Parking for Disabled Drivers in City-Owned Lots.": [
        "'speaker_1': 'Thank you, Mr. Goodhue. Now we're going to move on to the regular agenda. Item six, please.'",
        "'speaker_0': 'Item six is a communication from Councilwoman Pryce, Councilmember Peers, Council membership, and Councilman Andrew's recommendation to request the city attorney to prepare a draft ordinance allowing drivers with valid disabled driver plates and or park carts to park for free in city owned parking lots.'",
        "'speaker_1': 'Thank you, Councilwoman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I want to thank my Cosigners for signing on to this item. This item came to our office as a direct result of some constituent observations. There appears to be an inconsistency with state law in the public right of way and the laws in terms of what handicapped parking spots or folks who park in'",
        "'speaker_2': 'those spots can be charged in city owned lots. This is an issue for us where the accommodation is afforded throughout the state and if there's a minor revenue loss in the city in order to make it more consistent for handicapped residents, then to me that seems like a very fair trade.'",
        "'speaker_2': 'The inconsistency results in confusion from residents, and they have a sense that the cities might be intentionally misleading them in order to perhaps get revenue money from writing tickets, which is absolutely not the case. This ordinance that we're requesting be drafted is meant to apply only to the lots that are already patrolled, not automated lots.'",
        "'speaker_2': 'This this request is in no way limiting the city's move towards automated lots. And we hope that there is a technology available in the future where automated lots will be able to take into account those with handicapped placards, perhaps at the entrance of the parking lot where a ticket is pulled.'",
        "'speaker_2': 'So I ask my colleagues to please support this item and allow for the city owned lots to have the same policies in place in regards to charging handicapped residents as public right of way spots on the streets. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Councilmember Pearce.'",
        "'speaker_3': 'Yes. I just want to thank my colleague for bringing this item up. I also have heard this concern from folks at our senior center on Fourth Street and several other folks in our communities. I think it makes a lot of sense to try to align us where we can.'",
        "'speaker_3': 'And so looking forward to council support. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Andrews.'",
        "'speaker_5': 'Yes, thank you, Mayor. I want to thank our concentration for bringing this item forward, because this ordinance would be about making access easier and making all of our policies in the city owning pilot parking lot. You know, the same you know, someone is wrong with our policies.'",
        "'speaker_5': 'We need to fix them. You know, and thank you very much to our residents who brought these concerns to our attention. And thank you again, you know, Councilwoman Parks, for bringing this forward. Thank you very much.'",
        "'speaker_1': 'Thank you. Is there any public comment on this item? I see no public comment. Members Pisco and Castro votes.'",
        "'speaker_0': 'Councilmember Mongeau the motion carries.'"
    ],
    "Grant Agreement and Appropriation for Pathways to Justice Careers for Youth Program.": [
        "'speaker_1': 'I'm going to skip the next item to serve councilman mangos here. So let me go to item eight. Okay. That's one.'",
        "'speaker_0': 'Item. It's a report from Economic and Property Development recommendation to execute all documents necessary. With the U.S. Department of Labor to receive up to 1 million in Workforce Innovation and Opportunity Act funds to implement the Pathways to Justice Careers for youth programs citywide.'",
        "'speaker_1': 'It's a motion in a second. Vice Mayor Richardson, any comments?'",
        "'speaker_6': 'Just quickly, this is for the past program and it's one of the final grants come.'",
        "'speaker_7': 'Out of the Obama administration.'",
        "'speaker_1': 'We're really proud of this. Good work to all the partners. Thanks. Thank you. Stretch those dollars out. Councilmember Pearce.'",
        "'speaker_3': 'Just congratulations on all the work you've done on path, so keep it up.'",
        "'speaker_1': 'Thank you, Councilman Andrews.'",
        "'speaker_5': 'Thank you, ma'am, because, you know, I like to say that this is a wonderful opportunity for, you know, the Long Beach youth. And I'm very grateful for the hard work staff that allowed the city to secure these funds.'",
        "'speaker_5': 'You know, I've always said that a job would stop a bullet. And this is a program like these that keeps our youth off the street, engage them in a learning opportunity. Thank you again for bringing this forward.'"
    ],
    "Resolution on Annual and Five-Year Reports for Various Facilities Fees.": [
        "'speaker_1': 'Thank you. Any public comment? Seeing nonmembers, please cast your votes. Motion carries item nine and then we will go back to item seven.'",
        "'speaker_0': 'Item nine is a report from Financial Management Recommendation to Adobe resolution approving the annual and five year reports for the transportation improvement fee. Parks and Recreation Facilities Fee. Fire Facilities Impact Fee. And Police Facilities Impact Fees CDI.'",
        "'speaker_1': 'Thank you. There's a motion and a second. Any public comment? Seeing Non councilmember mongo.'",
        "'speaker_2': 'Yes, I was actually just speaking with Mr. Eriksson about the potential for a current modification or if this would have to come back. We have a significant amount of impact in some of our parks and rec facilities due to the recent storms and some of the project areas are not specifically outlined on here.'",
        "'speaker_2': 'And so I was just trying to get a point of clarification if that needs to come back or if I can make a small modification. Mr. City Attorney, would you be able to let me know what I can and cannot do on this item?'",
        "'speaker_9': 'It would have to come back at a later time to make an amendment to this, because this is an adopt resolution approving the annual fight, the five year reports, and that's a requirement under law that they come and report to you what these impacts, fees were collected and what it was spent on.'",
        "'speaker_9': 'If you want to change the fee, it would have to be agenda separately.'",
        "'speaker_2': 'So under this report on page, of course, there's a whole bunch on the page number. Let me turn back on page seven and eight of 13. It has a list of completion date future projects that exceed the amount of money in the fund out not outlined on here.'",
        "'speaker_2': 'There is significant damage to Hilton Park facilities, Silverado Park facilities and Pan Am Park facilities, but it sounds as though that would have to come back, even though they say future.'",
        "'speaker_5': 'So, yes, that's something that we'd have to take a look at. There's also some state law requirements about what is maintenance and what is new. So we'd have to we can certainly get the council some information about what other projects could we be adding.'",
        "'speaker_5': 'We as you're you state, we really do need funding for those. We can certainly look to see if impact fees if they qualify and then where they fit in the priority order.'",
        "'speaker_2': 'Wonderful. Thank you so much for that. I appreciate it. And I'm glad that we are being strategic about these investments. And I appreciate I'm working with the department heads who have been very mindful of our needs. Thank you very much.'",
        "'speaker_1': 'Thank you. Is there a public comment on this piece less about.'",
        "'speaker_0': 'Councilman Andrews. Councilman Andrews. Motion carries a zero.'"
    ],
    "Review of Financial Policies and FY 2018 Budget Outlook.": [
        "'speaker_1': 'Thank you. Item seven, please.'",
        "'speaker_0': 'Item seven is a communication from Councilwoman Mango. Councilwoman Price Council member Sabina and Councilman Austin. Recommendation to request the city attorney to direct the Department of Financial Management to report on how the city puts its financial policies into practice.'",
        "'speaker_2': 'Thank you. This started out as a joint item of my colleagues on the Budget Oversight Committee. I appreciate Council Member Supernova for learning about the item and signing on when we weren't quite at enough signatures because we wanted to make sure it is up to date.'",
        "'speaker_2': 'We wanted to have this discussion or availability of these items tonight since we did the budget overview. I appreciate the hard work that's been done. I think that the financial policies of the city are something that need to be looked at every now and again.'",
        "'speaker_2': 'We have done well in reaching and achieving some of our goals in terms of what we thought was accomplishable when it came to reserves, balancing certain funds, adding different types of reserves and percentages to other areas. And I think that as times change, we need to look at what our risks and liabilities are and how these policies'",
        "'speaker_2': 'protect us. So I really appreciate this item and I appreciate that we are all united on this, on the Budget Oversight Committee, and I hope our colleagues will support it.'",
        "'speaker_1': 'Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'I want to thank my colleague, Councilwoman Mongo, for bringing this item forward. I think it's very ripe for us to start having these discussions now. Well, in advance of the budget cycle and in the discussions leading up to the budget vote.'",
        "'speaker_2': 'So I think, you know, we've been very mindful of the budget with every decision that we've made. And I'm hopeful that we can continue that path moving forward, especially as we are seeing some deficits in 2019 that hopefully we can mitigate through responsive policies and practices.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Pier.'",
        "'speaker_3': 'Oh, yes. I want to thank my colleagues for bringing this item up. I had two questions. Whenever the whenever we bring this back, if we could include what the processes for developing our financial policies. Can you tell me when was the last time that we looked at adjusting our financial policies?'",
        "'speaker_3': 'Sorry.'",
        "'speaker_1': 'Mr. West.'",
        "'speaker_5': 'Lia Ericson.'",
        "'speaker_4': 'Councilwoman Pier or Councilmember Pierce. We actually adopted these policies, the set of policies that you have in contained in the budget book in 2013.'",
        "'speaker_3': 'And is that done every three years typically?'",
        "'speaker_4': 'So one of the one of the financial policies is to revisit them about every three years. So we are we are due to to look at these.'",
        "'speaker_3': 'Okay, great. And when we bring some of these back, if we could just have some of the conversation around the governing for equity piece, which I'll share some with with staff in our next meeting, but really looking at how are we prioritizing some of the the work that we have taken on over the last couple of years'",
        "'speaker_3': 'and how we're balancing that out with other priorities. So I just really want to thank my colleagues for bringing this item forward. Thanks.'",
        "'speaker_1': 'Excellent. We have a motion seconded public comment. CNN. Please cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ]
}