{
    "Alcoholic Beverage License Transfer for Chianina Steakhouse LLC.": [
        "'speaker_1': 'Item 22 is a report from the police department with the recommendation of receiving for the application of Tiano for a person to person and premise to premise transfer of an original I'm sorry of an ABC license at 5716 East Second Street with conditions in District three.'",
        "'speaker_6': 'Similar with conditions.'",
        "'speaker_0': 'I need a second, second, second and Ms.. Frick, any comment? All right. A any public comment on item 22, please convoke.'",
        "'speaker_4': 'Name is Larry Goodhue. Clark as the address I believe this item and there's another one like it on the agenda should be held over should it be held over until the issue that will be coming before the council next week, within the next couple of weeks, and that will be dealt with by the parking of the armature'",
        "'speaker_4': 'of parking commission on this week relative to whether or not to raise yet another house to make room for liquor patrons is what it boils down to. So I would suggest that the wise thing to do is to hold this off.'",
        "'speaker_4': 'Since the possession of the Belmont Shore Parking Association is they don't have enough parking and they're going to have to now tear down this house that you approved doing in a private session without letting the public know all the details.'",
        "'speaker_6': 'This restaurant in Naples.'",
        "'speaker_4': 'Still the same concept, still the same time. Okay. All right. In the area. All right. Two, hop, skip and a jump from it until the parking is impacted. It makes no sense to do that. So let's instead of doing it, that's how we got in the position we are now.'",
        "'speaker_4': 'You don't take a larger picture to hold it off. The barn's not on fire. Thank you.'",
        "'speaker_0': 'Any other comment? I am 22. Senior members. We have motion to second guess the votes. And I'm 22.'",
        "'speaker_1': 'Motion carries nine votes. Yes.'",
        "'speaker_0': 'Thank you. God, I am 15.'"
    ],
    "Pedestrian Path Project Design and Bidding Phase Authorization and Categorical Exemption.": [
        "'speaker_1': 'I am 15. Excommunication from the Office of the City Manager Parks at Parks and the Parks Recreation Department with the recommendation to authorize city manager to proceed with the design and building phase of the proposed pedestrian bike path proposal and consider categorical exemption 12 dash zero four for this is in districts two and three.'",
        "'speaker_0': 'Ms..'",
        "'speaker_4': 'Frick Mr. Mayor, Council Members. Before I turn it over.'",
        "'speaker_8': 'To our assistant city.'",
        "'speaker_4': 'Manager, I just want to highlight that.'",
        "'speaker_8': 'The city has been working for years to address conflicts on our beach bike path. Those conflicts exist between runners and joggers versus cyclists and rollerblades. We've been reaching out for the past couple of years to the high school track.'",
        "'speaker_8': 'Coaches are running clubs are walking clubs, the Long Beach Marathon Group, cycling clubs and Beach Neighborhood Associations.'",
        "'speaker_4': 'Tonight, we're pleased to present a plan that was vetted and approved.'",
        "'speaker_8': 'By both the California Coastal Commission members and their staff. This will ultimately allow us to provide more access and availability to our city beaches. The Long Beach City Council has adopted the moniker of healthy and living a healthy and livable community for our city.'",
        "'speaker_8': 'We promote healthy choices in both nutrition and exercises, exercise and mobility. We have a huge aquatics community. We're billed as the aquatics capital of America. As you know, we've just completed one brand new 50 meter pool and we have two more 50 meter pools scheduled for our aquatics community.'",
        "'speaker_8': 'We also have a huge cycling community. Our nickname is the most bicycle friendly city in America. We've added hundreds of new bicycle.'",
        "'speaker_4': 'Lanes in our city.'",
        "'speaker_9': 'We've added SROs.'",
        "'speaker_8': 'Protected lanes, bike boulevards.'",
        "'speaker_4': 'We have school education programs and bike.'",
        "'speaker_8': 'Roundabouts in addition to aquatics and cycling. We also have a huge running jockey jogging and walking community.'",
        "'speaker_4': 'Tonight, we have the opportunity to eliminate the conflict between.'",
        "'speaker_8': 'Cyclists and runners on a new bike bike path. We have the ability to add a new 3.1 mile path. This is not a concrete path.'",
        "'speaker_4': 'It'll be a knee friendly path. Safer for the.'",
        "'speaker_8': 'It'll have a safer membrane for runners and walkers alike. This also will allow us to add three acres of new sandy beach to our city beaches. It'll also add one third of an acre of grassy parkland area.'",
        "'speaker_4': 'It's in the budget. It's fully funded through Tidelands. And with this, I'm going to turn it over to our assistant city.'",
        "'speaker_8': 'Manager, Suzanne Frick, to walk us through the item. Suzanne.'",
        "'speaker_7': 'Good evening. Mayor, members of the council and the public, we're here tonight to present the redesigned pedestrian path. And really the purpose is to get direction from the city council as to whether or not you want to move forward with the project.'",
        "'speaker_7': 'So the the project purpose initially was. As City Manager West said, to increase the beach access and coastal recreation by creating really a separate walking path that will be exclusively for pedestrians. It will improve the safety by relieving congestion and separating the two user groups that currently share the path.'",
        "'speaker_7': 'We believe it will encourage greater use of our beach. We have an absolutely wonderful beach, but admittedly it is underutilized and we are hoping to bring more people down into the beach area so that they can access the beach and use the path.'",
        "'speaker_7': 'It will promote a more active and healthy lifestyle, improve the mobility for all users, and also the supporting of the pedestrian activity by installing a more flexible, resilient surface. Let me talk a little bit about the background in history.'",
        "'speaker_7': 'The idea of a separate pedestrian path was first floated in the local coastal plan in 1980, and that was to ensure that there was a separation between the two user groups. Again, it was considered in the 23 Parks and Recreation Strategic Plan in the 2008 Beach Master Plan.'",
        "'speaker_7': 'And then as we started moving forward with the concepts, it was included as part of the capital improvement budget and funded through City Council adoption. Let's talk about the existing conditions. The existing bike path was designed in 1986.'",
        "'speaker_7': 'It's primarily a bike path with about a five foot pedestrian designation that's on the seaward side. It is again in our local coastal plan and it isn't the most conducive environment for the public. You can see here that the existing path is extremely popular recreational amenity for a variety of vehicles that may use the path.'",
        "'speaker_7': 'It is also used by pedestrians, but our statistics show that in fact it is highly utilized by bicycles. In fact, when you look at our bike counts it this path consistently shows that it is highly used and it gets the highest use among the surveyed areas of the city.'",
        "'speaker_7': 'However, that's not the case for the pedestrian count. The pedestrian counts are taken at the same time, we take the bicycle counts. And in fact, our pedestrian path ranks right now around eight for utilization in the city. So there's a significant area for improvement in what we've heard from the user groups is that there are conflicts between'",
        "'speaker_7': 'the bicyclists and the pedestrians and not everybody feels that it is a conducive area to walk. The next slide, we also show that the path traverses or crosses over a number of outfalls, and one of the benefits in the new path that we're going to create is improving those outfalls and using best practices so that in fact'",
        "'speaker_7': ', we're catching the trash before it goes out and also using our sponges so that we're really cleaning up the outfalls. So to improve that water quality there. There has been I think we have local outreach efforts. We have the city manager indicated we've gone out to the residents associations, the Parks and Rec Commission.'",
        "'speaker_7': 'We've talked with the Surfrider Foundation, the Long Beach Marathon Expo. We've intended to have a significant amount of outreach to get public comments and review of the proposed path. So now let's talk about that path. It really will extend from Shoreline Drive to 54 place it goes really the entire length of the shoreline from where the existing'",
        "'speaker_7': 'path is. The proposed configuration will consist primarily of a 11 foot wide pedestrian pathway that will be on the land side of the existing bike path. And it would be separated. The two paths would be separated by a six foot sand break.'",
        "'speaker_7': 'And the reason for that is so that we clearly would have that separation between the pedestrians and the bicyclists. We are proposing that six feet separation so that we can get equipment in there to actually comb the sand of debris and trash anything narrower than that distance.'",
        "'speaker_7': 'We would be unable to have mechanical equipment to be able to clean the sand. We've also initially we proposed that the path be on the water side and at the request of a number of people who spoke before the Coastal Commission, Surfrider, members of the public, the Coastal Commission determined that in fact the path should be on'",
        "'speaker_7': 'the land side and not on the water side. So we have redesigned that path so that it is now on the land side to the point where it is in some areas almost immediately adjacent to the Bluff area.'",
        "'speaker_7': 'And it has also resulted in us moving, in fact, the existing path, the bike path closer to the bluff area, so that we can in fact restore some of the the beach area where we are right now. The path that we're proposing will be used exclusively for pedestrians, and we will be proposing to the city council that'",
        "'speaker_7': 'the restrictions about dog walking be lifted so that in fact, somebody could walk their dog along the new path. This is a rendering of what the new path would look like in some areas because of us moving the path closer to the land side or to the bluff and moving then the bike path closer.'",
        "'speaker_7': 'We will have a contiguous path. In other words, we won't be able to have that separation in those cases. As you see here, we will likely have a race curb that would be separating the two paths so that the bicyclists do not enter or go on that new path.'",
        "'speaker_7': 'The new material is going to be a resin based material, which is much easier to walk on and a better running surface as opposed to concrete. And it's more sustainable than asphalt or other oil based materials. One of the areas that is under consideration and of concern to the Coastal Commission and also members of the public is'",
        "'speaker_7': 'the area around the Belmont Pier. Currently, the existing path at the pier area is significantly closer to the water. And there is a 90 degree angle that occurs where the path meets the pier. That 90 degree angle has created a number of safety issues for us because of the inability of that bicyclist to actually see the pedestrian'",
        "'speaker_7': 'in the pier area. So we are proposing that, in fact, we improve that visibility and in fact relocate both the bicycle path and the pedestrian path closer to the landside so that we improve the visibility and also restore some of the sand area and move the paths away from the water.'",
        "'speaker_7': 'Because currently we have during the the major high tides, we have water intrusion. And so in order to eliminate that, we have proposed to move it closer to the landside. The result of that is we lose some parking spaces in that parking lot.'",
        "'speaker_7': 'Initially, we were estimating that we'd lose about 32 parking places. That was not acceptable to the Coastal Commission. They, in fact, ask us to go back and take a look and redesign and see if we could reduce the number of spaces that were going to be eliminated.'",
        "'speaker_7': 'And we have done that to the point where now there's approximately 20 spaces that will be eliminated. That number is acceptable to the Coastal Commission and they have in fact approved that reconfiguration. So we will again take all best efforts to try to minimize that.'",
        "'speaker_7': 'But at this point in time, in order to ensure that there's a there safety and good visibility and to minimize the water intrusion, we do need to move the path more inland. So this path, one of the questions that has been raised is, well, we're paving over the beach and that what is the net loss of sandy'",
        "'speaker_7': 'area? And the reality is there's actually a gain of usable beach area because we are moving the path more, both the bike, the existing path and the new path more towards the land side. We in fact, gain about three acres of usable beach area that can now be used for other recreation activities.'",
        "'speaker_7': 'So when you look at how much we're paving versus how much we're restoring, there's a net gain of about three acres. So our next steps, as we've indicated, that this project has received all of the approvals through the Coastal Commission and now we're at the point where the City Council should decide whether or not you want to'",
        "'speaker_7': 'proceed with the detailed drawings to go out to bid and construct the project. So that's the place where we are today and we're seeking city council direction as to how you would like to proceed with that. That concludes the staff report.'",
        "'speaker_7': 'And we're open to any questions.'",
        "'speaker_0': 'Questions from councilmembers. Mr. Don.'",
        "'speaker_5': 'Then with regard to the parking. There's a number of businesses over there. There's Belmont Brewing Company. There's a few other along that line of individuals who go out to the pier to fish or I think they still catch boats out there and then also use the pool facilities there.'",
        "'speaker_5': 'There's no other way but to eliminate those two parking spaces. Those are pretty precious parking spaces. I have trouble supporting that concept.'",
        "'speaker_7': 'Yeah, there actually there is no other way. If we want to eliminate the the water intrusion and improve the site visibility for that 90 degree angle, we've looked at the different configurations and we've reduced the loss of parking from the 32 through the 20.'",
        "'speaker_7': 'But at this point, that's the proposed design.'",
        "'speaker_5': 'Could you put the picture back up?'",
        "'speaker_6': 'Yeah.'",
        "'speaker_7': 'You can see that the blue line towards the water is where the existing path is today and the proposed path, that is the checkered line.'",
        "'speaker_5': 'Okay. I know Councilmember DeLong has a question about that. That concerns me. You know, when I was you know, we weren't brought in on this in the start. This was something that was in a large budget document and buried in a large budget document.'",
        "'speaker_5': 'The council really never had input on this project as it went forward. You may have had public meetings, but I think in the future we need to have a little bit more oversight of how our tidelands funds are spent and the projects are developed and brought forward.'",
        "'speaker_5': 'And again, it's oversight. But we probably need a master plan. I know some other council members may have an opinion on that as well, but I think we need to kind of put all the parts together in a bigger piece of paper so we see what's going on on our beaches and we can be briefed on it'",
        "'speaker_5': 'occasionally because the beach is everybody's. And I know Gary wouldn't say this, but it's not one councilmembers like the airport. Everybody needs to have a say. Everybody's a user of the beach. Certainly I am. And I was always a fan of widening the existing bike path first building a second bike path.'",
        "'speaker_5': 'So there's a six foot six foot buffer between the two bike paths.'",
        "'speaker_7': 'There is a pedestrian path and then there's the bike path. So the existing bike path in fact will remain. And in some areas we're moving it closer towards the landside. The new pedestrian path that is being constructed is actually on the land side of the bike path.'",
        "'speaker_6': 'Mm hmm.'",
        "'speaker_5': 'Okay. And as one who spent a few years down there working for the Marina Trump familiar with the brakes and so forth, that could go back and forth on the beach. How wide is a surf break? Because that's what they would do to clean the sand between the two paths, which is what they do.'",
        "'speaker_5': 'Right. They go up and just about every morning they're out there cleaning the beach with a surf rig. That's something they tell behind a large caterpillar, typically. And they go up and down the beach and in areas where it's it's you know, there's there's debris.'",
        "'speaker_7': 'Right. We are going to have to purchase special equipment to groom the sand in between those two paths. So, in essence, we will be able to have that equipment. It won't be the same as the the rake that you see grooming all of the other sand.'",
        "'speaker_7': 'That's a much larger rake. But we're going to find a smaller one and we've actually identified it that can, in fact, groom the sand in between the two paths.'",
        "'speaker_5': 'So so you're still not supportive of combining the two or just widening the existing bike path? That's where I struggle with this whole project. I don't know how we got into two bike paths.'",
        "'speaker_7': 'There are a number of areas where in fact the paths will be joined together and separated by a curb. That's not the ideal situation from a safety standpoint. There are there's that condition up and down the coast there.'",
        "'speaker_7': 'A good prominent example is in Santa monica, where the bike path and the pedestrian path are adjacent to one another and they're separated by a curb. What happens in that situation is a lot of the pedestrians will just kind of step over that curb and be walking on the bike path.'",
        "'speaker_7': 'And so it doesn't provide you the level of separation that we would like to ensure that their safety for both user groups.'",
        "'speaker_5': 'I don't know. I don't know if I'm there with you on that one, but either way, let's move forward. So with regard to the oversight and a master plan, how would something like that come forward? Do you have any feedback on that?'",
        "'speaker_7': 'I think it depends.'",
        "'speaker_4': 'On the.'",
        "'speaker_5': 'Oversight speaks to the funding. Right. Right. And what you're planning now, because I don't know. I hear drones. I hear a lot of things that have never been discussed up here. So give me your feedback. Well.'",
        "'speaker_7': 'Any project that we're proposing in the Tidelands actually gets approved by the city council as part of the budget adoption, either through the capital improvement. But for example, in the first quarter adjustment, there were about $13 million worth of projects that the City Council reviewed and approved.'",
        "'speaker_7': 'All of those projects are presented to the Council, probably not at this level of detail, but they're presented. Now, what we can certainly do is, as part of the budgetary process, provide a more detailed presentation on projects that are being proposed in the Tidelands area.'",
        "'speaker_5': 'Mm hmm. I mean, this is going to be a this is going to cost several million dollars, I suspect you. Do you have a general ballpark figure what this will cost?'",
        "'speaker_7': 'Initially, we budgeted about $5 million. But with the revisions that are requested by the Coastal Commission, it is likely we're estimating it to be about a seven and a half to $8 million project.'",
        "'speaker_5': 'It's a lot of money. Again, I just still fall back to why wouldn't you just wait and maybe even replace the existing bike path and just make it a bit wider? That to me seems like common sense, but that's just my perception.'",
        "'speaker_5': 'So with that, I turn it back to you, Mr. Mayor.'",
        "'speaker_0': 'Thank you, Mr. O'Neill.'",
        "'speaker_8': 'Thank you, Mr. Mayor. A couple of questions. Fruit. In regard to the survey that you mentioned, where it was stated that the usage of the other pedestrian path at the beach was eight. Did we drill down on any of those questions to find out why it it ranked so low?'",
        "'speaker_7': 'No, we did not. Anecdotally, from people who have used it, it is only about a five foot walking area and it is not the most conducive area for people to walk, particularly when it is a busy bike path.'",
        "'speaker_7': 'So that's the issue. Another reason why a lot of people do like to walk their dogs, and this is an area where presently dogs are not allowed to be walked on the path. And so that's another factor that we would like the council to reconsider with a separate bike path, a separate pedestrian path.'",
        "'speaker_8': 'And then I want to make sure I understand you right. The recommendation to to put the new proposed bike path closer to the bluff came from the Coastal Commission.'",
        "'speaker_7': 'Yes. Initially, we proposed that the new pedestrian path be on the waterside. That would give us more flexibility for it to meander and to for configuration purposes. But the Coastal Commission, at the request of a number of people who testified, said, no, it shouldn't be on the waterside, in fact it should be on the landside because we'",
        "'speaker_7': 'shouldn't be taking up any more beach area and paving that beach area. So instead we moved it so that it will now be totally on the landside.'",
        "'speaker_8': 'Thank you. It's very.'",
        "'speaker_0': 'Mr. Dillon.'",
        "'speaker_6': 'Thank you, Mr. Mayor. You know, I also have concerns about the loss of the parking spaces. I, I recognize the benefit by taking out the 90 degree turn. However, for me, I would keep the 90, 90 degree turn if I could maintain the additional 20 parking spaces or most of them.'",
        "'speaker_6': 'And I think I'm going to come back to this maybe after public comment when we get into making motions and and there's more dialog and we hear what people have to say. So I guess I would just kind of give you a little notice that we may come back at that point and ask you, you know, perhaps'",
        "'speaker_6': 'to amend it. Because if I look at the map, it seems to me we could keep the 90 degree turn and then come across the bottom of the parking lot. We can still recapture that sand area, which I do agree is a worthy goal.'",
        "'speaker_6': 'But let's see if we can't protect more, if not all of those parking spaces. I think we might come back with that specific recommendation in the form of a motion. So if you could give that some thought. And then the second question I have now is what consideration?'",
        "'speaker_6': 'And I'm sure you have it, but you could just educate the Council. What consideration have you given to sea level rise in the bike path?'",
        "'speaker_7': 'Any project that is approved by the Coastal Commission, in fact has to address the issue of sea level rise. That is a major component that the Coastal Commission asks us to review. You will see and in fact this is a great location that in fact the current tides in fact impact the the path.'",
        "'speaker_7': 'So what we look at is where the mean high tide line is, where the king tide typically occurs, and then do some rough calculations about what the potential could be for increased sea level rise. And you will see that, in fact, we have pulled the path back closer to the landside to address those inundation events and occurrences'",
        "'speaker_7': '. So we believe I mean, there's no failsafe solution for a beach bike path that we've taken into account sea level rise by, in fact putting this path on the landside as opposed to on the water side. And so we believe that we've addressed it to the best of our ability at this point in time.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Mr. Garcia. Thank you, Mr. Mayor.'",
        "'speaker_4': 'I just wanted to first say, I know that you've been working with council staff often on this issue, and I do think that the changes that we were able to make at Coastal Commission with regards to moving the path over to the landside was ultimately the right thing to do.'",
        "'speaker_4': 'I know there's obviously a cost issue there. I have a question about I know we've heard on a few occasions that that isn't the joining the two paths or I know that in parts of the path there joins other adjacent to each other.'",
        "'speaker_4': 'And I know it's been said that that's not ideal for for safety reasons. Is it the obvious ones that are that are are you saying because of possible accidents or. I'm just wondering a little bit more on that.'",
        "'speaker_4': 'And and I only ask because to me, it would seem that the more that we can have them adjacent to each other, the better. That's without maybe knowing the science or the data behind accidents. But that that's what would appear to me to be the best solution.'",
        "'speaker_4': 'In addition to that, that's the case. And I think in much of Europe, if you go around and look at bike paths, which are certainly more prevalent throughout most European cities are almost always just adjacent to the pedestrian path or the sidewalk.'",
        "'speaker_7': 'We we took a look at a number of paths that, in fact, were adjacent to one another and basically separated, sometimes by a curb, sometimes not. And one of the key things that we're trying to address is safety and preventing those pedestrians from moving over onto the bike path and the bicyclist moving on to the pedestrian path'",
        "'speaker_7': ', having a curb. Yes, it prevents those pedestrians or certainly the bicyclists from going onto the pedestrian path, but it is not a good solution for pedestrians. When you look at the path up and down the Southern California area, there is a significant amount of pedestrians that just step right over that curb and are walking on the bike'",
        "'speaker_7': 'path. And that we have found that, in fact, if there is a clear separation between the two, you have improved safety dramatically. And that is one of our key purposes is to improve and enhance that safety.'",
        "'speaker_4': 'And one last question.'",
        "'speaker_7': 'And the the other issue is one of the key things we want to be able to allow here are the dogs to be able to walk on this path, because that is a activity that we've heard resoundingly. Our our residents would like to have the ability to walk their dogs.'",
        "'speaker_7': 'Again, having a separated path between the two is critical for that function so that the dogs just aren't walking over that path. And we believe it is a much safer environment to have that separation.'",
        "'speaker_4': 'Even so, you're saying essentially, even with a curb, you don't find that to be the most. You find it to be very safe, because we.'",
        "'speaker_7': 'Know in the case in point is the city of Santa monica, if you've ever walk that path, they're immediately adjacent with a curb. And in talking to the staff there, they said there's incredible what they call migration between the two user groups where you'll get pedestrians walking on the bike path because there isn't that separation.'",
        "'speaker_4': 'Okay. My last question was, and I know we haven't revisited this since this was back at council in our last discussion, and I'm wondering what where we left off. There was a discussion, and I think at the commission, what we did was we reduced the the the amount of space between the paths, correct.'",
        "'speaker_4': 'Yes. And so we reduced it for remind me. We reduced it from what to what.'",
        "'speaker_7': 'It was approximately ten feet before and we've reduced it to about six feet. And the six feet is the minimum in order to get equipment to groom the sand.'",
        "'speaker_4': 'And so six feet is the minimum.'",
        "'speaker_7': 'The minimum. And in talking with coastal staff, that was acceptable to the coastal staff.'",
        "'speaker_4': 'And it's the minimum because of the type of equipment we have.'",
        "'speaker_7': 'Exactly.'",
        "'speaker_4': 'Is there equipment that that could do it in three. I'm just curious. In a smaller amount of of width.'",
        "'speaker_7': 'We. Yeah. I'm looking at our, our consultant and know there isn't equipment that in fact is off the shelf equipment. What we haven't looked at is whether or not we would be able to get customized equipment. But I don't think we wanted to go down that that path, so to speak, because having custom designed equipment is much'",
        "'speaker_7': 'more costly for the city.'",
        "'speaker_4': 'Okay. And I only ask because obviously I think it's everyone's goal to obviously preserve as much as much beach as possible. And so, you know, the more we can limit that space, that the more access there is to to the to the public beach.'",
        "'speaker_0': 'Council membership scheme.'",
        "'speaker_2': 'Thank you, Mr. Mayor. One of the items in the the staff memo that and I guess we've had a response given to all of us is the public garden and beach master planning efforts. Can staff briefly go over what you're presenting to us and then give the the people in the audience an opportunity to respond to it'",
        "'speaker_2': 'because it seems like they're not the same planet here. When we look at what it's being told to us and what the response has been from those that were engaged by the city of Long Beach to come up with the the art plan that they did.'",
        "'speaker_7': 'It is our understanding back in 2002 that the the Public Corporation for Arts PCH, which is is kind of now the Arts Council, engaged some artists to prepare a plan. A significant amount of time has passed since that period.'",
        "'speaker_7': 'And what is occurred to date is that we are now moving ahead with some of the projects that, in fact were in that original Parks master plan. And that original Parks master plan indicated that, yep, there there should be an art component.'",
        "'speaker_7': 'But the attorney's office was pretty clear to us that in fact we would need to go for a bid so no single artist would have a lock on that particular art piece, that if we are going to incorporate art into projects that would need to go out for a competitive bid.'",
        "'speaker_7': 'We are incorporating art in some of the major projects, for example, the Belmont Pool. When that project went out for a proposal, we asked that the team, in fact include an artist as part of the project development team.'",
        "'speaker_7': 'So there are strategically we are including artists in the projects that have a a major financial commitment and smaller projects such as the pedestrian path. Initially, we had some art component that we wanted to include, but there was opposition both from the Coastal Commission in the community about paving additional area so that we withdrew that particular component'",
        "'speaker_7': 'so that we would really minimize the amount of beach area that we were paving over. So I guess the answer to your question is, is that we are still incorporating art. It is on a project by project basis and it will depend really upon the scope and the scale of the project.'",
        "'speaker_2': 'I think my concern is that apparently the city spent $200,000 on this and that the according to the response that we got, that the Department of Parks and Recreation contracted with the artist to develop an art master plan for the beach, which was reviewed and approved by the Marine Advisory Commission and the Parks and Recreation Commission.'",
        "'speaker_2': 'Once approved, the artist collaborated with landscape architects, designers, planners and engineers as subcontractors to Tetra Tech, which I know the city was using for quite a bit, which are architects and engineering firm. And again, it cost the city in excess of 200,000.'",
        "'speaker_2': 'So I'm a little puzzled why the city would have gone through this extensive process, put a a bid out for a competitive bidding, which was, by the way, done. And then the responses now and I think the reason quite claims for the reason that nothing's been done with it since is because there's been no focused attention up'",
        "'speaker_2': 'until now about the path and this is how this got revisited. So I'm just why would why did the city go through the process and spend $200,000 if it really didn't want to art master plan for the beach?'",
        "'speaker_7': 'I think there's some confusion about the plans. The $200,000 was, in fact, for the the beach parks master plan that was prepared. And that master plan, in fact, it had. That's our industry. There may be a difference of opinion about this, but we've gone back into the records and talked to the Parks and Recreation staff, and their'",
        "'speaker_7': 'recollection is there was never a separate arts master plan. There, in fact was a beach master plan that was done that included some amphitheaters and skate parks and a significant amount of development along the coastal area. It was about $100 million capital improvement project that included some ideas about how the art could be incorporated as part of'",
        "'speaker_7': 'that overall master plan. That was never pursued because of the cost associated with it. The artists, I believe, were part of the overall design team that were. Working on all of the concepts related to that particular project. So that is our understanding of the information as gleaned from the staff reports and also from the Parks and Rec'",
        "'speaker_7': 'staff.'",
        "'speaker_2': 'Well, hopefully they get an opportunity, Mr. Mayor, if they can respond, since they there's some information in the memo, the public memo that I think questions their. They're working with the appropriate professionals on this. So what happened with this?'",
        "'speaker_2': 'So we spent all this money or we're not using any of the. Plan that they brought back?'",
        "'speaker_7': 'Yes. What was determined is that this was a extensive plan that was done with new handball courts and volleyball courts and things like that, paving over the sand and creating major recreation areas. Twofold, the community started to object to it because it was such a extensive and comprehensive revision to the coastline.'",
        "'speaker_7': 'Number one. Number two, there was not the funding to actually support that level of development in the coastal area. So instead, what we've been doing is picking and choosing some of those projects. For example, the pedestrian path that was one of the projects that was identified, a connection from the parking lot to the top of the bluff'",
        "'speaker_7': '. That was another project that was identified. We're moving forward with that. So we're taking a number of the projects that, in fact, are feasible, don't have significant impacts to the residential community or to the environment. We're moving forward with those projects.'",
        "'speaker_2': 'Well, you know, when I brought this to your office's attention, because the two artists that participated in this process brought their plan and said, this is what we produced. I know that your office indicated never heard that this had happened.'",
        "'speaker_2': 'So perhaps maybe we can dig a little bit deeper and find out why these people and they're going to talk about it tonight, I'm sure. But, you know, to go through the process and, you know, to the design and things like that and to spend that kind of money and then for us really as a city, not'",
        "'speaker_2': 'to know that they did it as we are approaching this particular area, that that's what they were asked to design on. I would I'd hope we can somehow use some of their their work and effort otherwise we've spent a lot of money for not so.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Okay. In the comments. I'll entertain a motion. You have motion on the floor before you hear anything goes, even if it's for discussion purposes. So I'm not one. I need a second, second movement. Second. Although public comment, please, if you're going to come forward now, listen carefully.'",
        "'speaker_0': 'I want to see how many people here will try to get everybody. 3 minutes. When you see, you'll have a green light. When you see the yellow light, that means you have 30 seconds left. Please try to be as efficient with your time as possible and give us your name and be mindful of the time.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Good evening.'",
        "'speaker_5': 'My name is Jim Corbett.'",
        "'speaker_10': 'I live in Belmont Shore and I originally came here after talking to Eric Lopez against this proposal of the pedestrian path. And I have now heard tonight from Ms.. Frick that it's going to be dog friendly and I own three dogs.'",
        "'speaker_10': 'And I now come and say, I would.'",
        "'speaker_8': 'Like to have.'",
        "'speaker_10': 'This path on the beach and I support it.'",
        "'speaker_0': 'Thank you. That was very efficient. Appreciate it. Thank you. Next week.'",
        "'speaker_4': 'Larry gives you clear as the address. First of all, I'd like to thank Eric Lopez for all the time that he's put him with on this project. Let me deal, first of all, with the one aspect that is intelligent and that is the aspect of eliminating the at the blind angle around Belmont Pier.'",
        "'speaker_4': 'Beyond that, the majority of this project is thoroughly divorced from intelligence and a lack of understanding of human use, patterns and human nature. There is no power on earth that is going to stop the people from merging into where they want to go, period.'",
        "'speaker_4': 'It's unenforceable. You'd have to put police on the bike path or on the sidewalk up above. Period. It almost is. It is almost on par with the rear with the head up their rear bike path that goes down on third street or where the concrete separation.'",
        "'speaker_4': 'It just doesn't work. It defies human nature. There is a case if there is if around where the outflows are going, if that needs to be corrected. Yes, but just leave the existing path there. People ask questions. The question was raised, well, not enough people are going there.'",
        "'speaker_4': 'The fact is, there's nothing to go to over the vast expanse, a vast expanse of the area. You've got three and a half miles of something that's essentially as exciting as coming to a council meeting. There's nothing there.'",
        "'speaker_4': 'Up around Belmont Pier. Yes. At the other end shoreline. Yes. But there's no draw. You've got up on the bay, up on the bluff. You've got some green, you've got a nice vista. If somebody is going to come and want to go to the water, they're going to come down to where the parking is.'",
        "'speaker_4': 'They're not going to travel for two and a half miles on a concrete, concrete walkway or the new the new type of surface you're going to create, which is really not all that exciting and all that practical. I've seen it.'",
        "'speaker_4': 'We've got it down around the Marine Stadium at the closed end and in the Dunster path and some other period. And that's not a panacea that all this is is a boondoggle to funnel out money to contractors and to consultants who hopefully it'll kick it back into people's campaign coffers.'",
        "'speaker_4': 'Keep what you've got now. Fix it or fix that right angle there and do what needs to be done to save the parking. Thank you. Thank you. Next speaker, please.'",
        "'speaker_3': 'Well, I don't know. I mean, the fish. But I like to make it about six points as to how the bike path and pedestrian walk on the beach could be improved. First, I would suggest you have pyramids. My small pyramids marking the miles that the bike pedestrian goes three miles.'",
        "'speaker_3': 'One, two, three have a marked out. So they have a sense of progress. The second thing I would take note of is that the view is the seen as a first seems to be. You really can't see the ocean when you see the ocean and not the waves, which is really the majestic part of the ocean.'",
        "'speaker_3': 'You can see the waves from the pedestrian bike walk. So I would suggest you put up at least three, three billboards along the way that very artfully that are health oriented suggesting suggestions which shot would you should watch out for in the sun and and possibly the daytime swimming facility to advertise that maybe about three billboards health'",
        "'speaker_3': 'oriented I think would be very distracting really, and will communicate revenue. The third thing I like to say is that maybe it would be a good idea because you're sweating under the hot sun, exerting yourself that they have at least two or one water station along the way.'",
        "'speaker_3': 'A machine not necessarily out. That would be expense not needed, but a water machine for the people that don't have that facility on their bikes or for the walkers, for that matter. I would also like to point out an emergency phone might treat me along the way because you're you're straining and your heart has got to be'",
        "'speaker_3': 'conditions for this kind of exercise frequently that you have an emergency phone along the way so they can call in if somebody is in fear of getting hurt. Now, the other thing is, and this is no suggestion, so much as a critical comment, I don't see why you have to worry about bicycle and pedestrian dangers.'",
        "'speaker_3': 'Since when is a bike really being a danger to a pedestrian? They go slow and they can stop very easily and they have a clear view to be no big landmarks blocking it. So this bit about this is overdoing it, and I may sound like I'm overdoing it, but I think you're overdoing it a bit much.'",
        "'speaker_3': 'Probably a million bucks more wasted again frequently. Yeah, but it's just that it's not necessary to go to the expense of having a bike. And. Thank you, sir. Thank you, Mr. Dunne. Your time. Time is up. And Second Street.'",
        "'speaker_3': 'They drive a bicycle to drive right into traffic. Thank you. Thank you so much. You're either.'",
        "'speaker_4': 'Thank you. Before I take the next speaker, I just want to note, if I if everyone uses up to 3 minutes, we're going to we've got about an hour and 6 minutes of public comment. So the more efficient we can, the better.'",
        "'speaker_4': 'Please, sir.'",
        "'speaker_8': 'My name is Chris Ruggles, resident of Long Beach. I want to say that this idea of having a separate walking path and a bike path is excellent. I use the bike path a lot. I love it. It's a great part of Long Beach.'",
        "'speaker_8': 'It makes living here nice. And if you've ever been on the bike path, you know that. People saunter around in the bike lane. If you ring your little bell to go around them, that give you a look of a lot of attitude.'",
        "'speaker_8': 'And to Councilman O'Donnell, suggestion, councilman, I truly believe you can make it as wide as the four or five freeway and people would still criss cross. So I think widening the path is not a good suggestion. Having to pass will at least orient the people that, hey, everybody's walking on that path or riding on this path.'",
        "'speaker_8': 'Maybe I should walk over here. It will make riding a bike safer, more pleasurable. It'll make walking on the beach safer and more pleasurable. I support it. Absolutely. And if we want to save some money, let's take any art out of it, because I don't think anybody in the past looking at art.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. You just we've got about 20 some odd people in line. So if you could try to reduce your time, it'd be efficient because otherwise we'll be here for an hour and a half. Thank you. Good.'",
        "'speaker_3': 'Okay. Yeah. Mayor Foster, members of the council. My name is Bob Seeger, and I'm also a resident of Long Beach, and I'm the CEO of a company called Run Racing. And we are the ones that organized the annual marathon in October.'",
        "'speaker_3': 'I am here to speak on behalf of the the widening of the bike path. In 13 years, we have taken the marathon from 4500 people to almost 25,000 participants this past year. This is our 30th anniversary, 2014. And one of the bestselling parts that we have for selling the marathon to people all across the country is this'",
        "'speaker_3': '3.1 miles of run along the beach. It's a great selling point for us. And I think the running path with a a runner friendly surface would be a great asset. We want to continue to grow the marathon, and this is an important fact for us, too, to be able to continue to grow the event as years go'",
        "'speaker_3': 'by, the economic impact. And to that, in 2009, we did an economic impact report. The marathon was had about $27 million direct impact for Long Beach in the surrounding area. This is our 30th anniversary. We plan to do another economic impact.'",
        "'speaker_3': 'And and I think it's going to surprise everybody that it's growth. So we're definitely in support of it. And I know a lot of people would like to see it and it is a safety issue.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Seagram. Yes.'",
        "'speaker_7': 'Hello. My name is Kelly Edwards. I've been a resident of Long Beach for nine years, four in Belmont Shores and now five in downtown area. I must say that I am a competitive athlete, so I like to train a lot and run down on the path.'",
        "'speaker_7': 'I really don't. I have, you know, I am good at following the law. I don't run into bikes, so I'm very good on keeping clear of those. There are people that don't follow the law. For instance, the bike paths that we have now, I still see people that actually will bike on the sidewalk next to the path'",
        "'speaker_7': '. So, you know, for me, I just think that I agree with Councilman O'Donnell with widening it and maybe not just a little curb. Make it make it a little bit higher because with that, if we're doing that six feet in between, we're taking away from the volleyball, we're taking away from the soccer, the football that happens.'",
        "'speaker_7': 'The only thing that I do agree with is I would like to run with my chocolate lab on the bike path. And I don't have that option right now, but I understand that safety's an issue. But we also have to be responsible people and ourselves and, you know, know not to run into into traffic.'",
        "'speaker_7': 'Thank you so much.'",
        "'speaker_0': 'Thank you. Appreciate that. Next.'",
        "'speaker_10': 'Hi. My name is Evan Kelly. I'm a been a resident of downtown for six years and I'm an avid cyclist. I ride the the path weekly, if not daily. I'm going to cut to the point here. There's a five foot walking path, and I hear that people can follow the rules.'",
        "'speaker_10': 'But the big issue is people with children and that child takes one step over into the bike lane and the vehicle hit them. A six foot path will keep running children out of the bike lane. Currently you have enough space for one bike going one way, one bike going another way, and maybe one pedestrian.'",
        "'speaker_10': 'But the best chance usually don't walk one on one. They're usually holding hands, and now everybody's looking at the beach. The cyclists are looking at the water, the walkers are looking at the water. And that meandering happens no matter how much you want to stay within the rules.'",
        "'speaker_10': 'So I believe that the separated paths, the two paths, is the safest way to go. And I believe that the city has gone back several times and made revisions and taken community input. And of course the commission recommendations have made the best possible plan.'",
        "'speaker_10': 'So I support it and I hope you do, too.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Next week. My name is Mike Culligan.'",
        "'speaker_3': 'And I live in the fourth District Los Altos area.'",
        "'speaker_8': 'Recently retired from Tidelands Oil Production Company for 30 years service middle management. And I'm here in support of the the widening of the bike path, the separation. It all really all comes down to public safety when it comes to the marathon.'",
        "'speaker_8': 'Over the past several years, I've been involved in the SAG Wagons support vehicle where I work, picking up the tired runners that are disabled or whatever, as well as working with the Long Beach Police Department to reopen the streets.'",
        "'speaker_4': 'In a safe and timely manner. And it really comes down to public safety in this issue and that.'",
        "'speaker_3': 'Plus the inherent liability of the accidents that I've witnessed out.'",
        "'speaker_8': 'There by just riding my bike.'",
        "'speaker_4': 'Out there from time to time.'",
        "'speaker_3': 'It's the you've got to have this separation between between the the pedestrians and these bikes.'",
        "'speaker_8': 'That are going really too fast. You should be getting tickets out there sometimes. Otherwise, you know, you're going to just keep having a safety issue out there. And it really comes down to safety and.'",
        "'speaker_3': 'Liability for the runners. So I would I would urge you to, without further delay.'",
        "'speaker_8': 'To proceed with this fully funded project.'",
        "'speaker_4': 'And I thank.'",
        "'speaker_3': 'You, Mr. Mayor.'",
        "'speaker_0': 'Thank you. You guys are doing great. Thank you very much.'",
        "'speaker_7': 'Good evening, everyone. My name is Terri Bronstein, and I'm an artist. I live at 262 Belmont Avenue, Long Beach. I'm here to strongly recommend that you vote against the proposed pedestrian path that has been referred to by the press as a two lane highway.'",
        "'speaker_7': 'Is this the image that we want to present for our city? We are against approving this path because it does nothing to make the beach more attractive and is based upon the uninspired 25 year old bike path. When we talk about a new pedestrian path, we should be talking about added adding value, making our beach as attractive'",
        "'speaker_7': 'and enjoyable as possible. We should be talking about a design process that resulted in the outstanding beaches of Santa monica and Huntington Beach. We should be talking about approaching all development on the beach so that the planning includes input from the community from the beginning.'",
        "'speaker_7': 'The Arts Council, the Sierra Club, Surfrider and all other critical stakeholders. The Parks and Recreation Plan path was designed to add value, the opposite of being seen as a simplistic highway. And I want to mention here that we are really not talking about art here at all.'",
        "'speaker_7': 'This has been something that's been confused from the beginning. We're not proposing our plan with all of the art elements in it. We're talking about the shape of a pedestrian path and where it goes. That's what the issue is tonight.'",
        "'speaker_7': 'And all of these other issues about that seem to have clouded the eye. What we're what we're really concerned about, the design of the Parks and Recreation Plan path creates a poetic connection between the real beach walkway and the imagined coast of Southern California.'",
        "'speaker_7': 'We recognize, however, that the Parks and Recreation Plan is only one example of what could be done on our beach over the past three months. We have had discussions with many neighborhood groups and important stakeholders, including the Belmont Shore, Belmont Heights Bluff Park and North Alamitos Residents Association, the Sierra Club, the Surf Riders, the Arts Council of'",
        "'speaker_7': 'Long Beach. The Historical Society of Long Beach. Long Beach Heritage. The Long Beach Museum of Art and the Belmont Brewing Company. They all indicated that they liked this design approach better than the highway on the beach path shown to them by city staff.'",
        "'speaker_7': 'What we took away from all of these meetings was a loud plea for the city to show a vision that truly recognizes the beach as its major asset. All groups felt that any pedestrian path that is built should be based upon an integrated plan that includes artistic values along with landscaping, engineering and design.'",
        "'speaker_7': 'And this is another thing to then say We're planning to put art on the beach as we get to each section. We were talking about the restrooms and these other amenities that would go in later. What we're saying is that we need a plan.'",
        "'speaker_7': 'That's an overall plan. That's not one where you call in artists to do each section. That will come later. But you have to start with some kind of vision, some kind of idea, some kind of over riding idea.'",
        "'speaker_7': 'Okay, I'd just like a few more minutes.'",
        "'speaker_0': 'That you do not have a few more minutes you need to conclude.'",
        "'speaker_7': 'Okay. Frankly, everyone.'",
        "'speaker_0': 'I'm sorry, ma'am. You've had over 3 minutes. Everybody gets 3 minutes. You know it's done. Thank you. Next, please.'",
        "'speaker_4': 'Hi. My name is Craig.'",
        "'speaker_3': 'Stone and I have been a resident, the city of Long Beach since 1976. I live at three four, four nine Lees Avenue. I have taught at Cal State Long Beach for the last 34 years. I'm a tenured professor and what I teach is public art and public space development, and about the value of having artist design engaged'",
        "'speaker_3': 'in the design of a project from the onset. So I applaud that you're starting to do that on these next projects. And I also really there's been a lot of thought that's gone into this process. But what I want to talk to you about is just maybe a little better process.'",
        "'speaker_3': 'I've known about the subject of this public art simply because I designed the very first course on it in public art for artists in the United States. It was many years ago. I'm also a public artist, so I've also produced public art that you might be familiar with The Shadows and Bill or the type of Signal Hill'",
        "'speaker_3': 'And the last one was with the prominent. So. So this is. Background. I'm here to speak about a way of designing public spaces that can provide value, often for less money than these conventional design processes. During the recession of 1990, there was an article in the National Journal for Public Art, which is called Public Art Review, about'",
        "'speaker_3': 'the design of a lobby where rather than purchasing an artwork from an artist to put in the lobby, the artist was hired to collaborate with the architect developer and to design an entire lobby as a work of art.'",
        "'speaker_3': 'The cost to create the lobby as a work of art was exactly the same as the building of a conventional lobby and putting a piece of artwork in there. But the value is much, much, much greater. There were no additional cost to maintain the artwork because the floor, the ceiling, the walls, the lobby that comprised the artwork'",
        "'speaker_3': 'was the very surfaces that the artworks made out of the contractors thought they were building a lobby so they didn't understand they were building an artwork until they were done. They were completely surprised and would probably have charged more.'",
        "'speaker_3': 'They thought it was art. When the owner went to rent the offices in the building, all the tenants indicated that the lobby design that convinced them to lease convinced them to rent their offices, to lease their offices. The project was the first conceptual collaboration between an artist and an architect and the developer in this particular city.'",
        "'speaker_3': 'And it demonstrated a way to create value with very little extra cost because the artist was brought in at the beginning of the design stage and not after the lobby had been designed and built. What city did this take place in?'",
        "'speaker_3': 'Know this was the city of Long Beach. The lobby as an artwork is located. It's the Krinsky building on Third and Pine Street Avenue. There's an idea that's called artist added value that grows out of this. And basically when you have an artist come in on the initial aspect of the project, then it changes the context in'",
        "'speaker_3': 'which things are done, right? Just what we have now is a line, and the line is.'",
        "'speaker_0': 'You need to conclude, I'm sorry, I can't do this. I people behind you. I appreciate that. Okay. Sorry. Thank you. I think we got the point. Thank you.'",
        "'speaker_8': 'Good evening. My name is David Lott, one of the owners of Belmont Brewing Company. We've been down there over 23 years, and I'd like to address the issue of the 90 degree turn. We have a confluence of walkers, pedestrians and bikers, people going down the path from 39th place to the parking lot.'",
        "'speaker_8': 'They're going north. South bikers are going east west. In my humble opinion, the last thing you want to do is eliminate that 90 degree turn to allow those bikers to go faster, which is what will happen. What you need to do, in my humble opinion, is put a solar powered, flashing sign to say, slow down or walk'",
        "'speaker_8': 'your bike. This will improve safety. It will eliminate cost and hundreds of thousands of dollars in costs and retain those parking spaces. And if I could quote the certified postal plan that I'd revised in 2006 that no, there would be no reduction in parking spaces.'",
        "'speaker_8': 'Councilor Long has that letter that we sent to him. So. And it will also reducing parking spaces from 32 to 20 is, from what I understand, just a matter of re striping, which is, is what it is, is still reducing access.'",
        "'speaker_8': 'Eliminating that that 92 return is going to make it much more dangerous. And thank you for your time.'",
        "'speaker_0': 'Thank you. Appreciate that. Next, please.'",
        "'speaker_3': 'Good evening. My name is Evan Baroudi. I am wife. My wedding dress is on file, I'm sure. Former Councilperson and currently the president of the Historical Society of Long Beach. Just some history because I was here in 86 briefly and I was the one who spoke in front of the Coastal Conservancy to get the matching funds for'",
        "'speaker_3': 'our bicycle, for our path. Now, it was not very inspired. We wanted to have basically we just wanted to have some way to get people down the path, enjoy our beach as best they could. And that was one way to do it.'",
        "'speaker_3': 'And we did it with both the bicycles as well as with pedestrian. It's clear to me over the years that I've been living here that there's a better way to do that. And I think that the concept of having two different paths is the right way to go.'",
        "'speaker_3': 'I do, however, and I believe Mr. Bernstein brought it up and others that we should be more inspired with the path that we put in for the pedestrians, the bicycles. They go by really quick, but the walkers they want, they walk.'",
        "'speaker_3': 'And if we want them to come down and enjoy it and be more than more than just a place to walk and look at the ocean, which is a beautiful place to be, is maybe, you know, give us some whether it's art or history lessons or whatever along the path.'",
        "'speaker_3': 'And that's what was designed in the early designs that they came back for. They came to us at the Historical Society. We all thought this was a very interesting concept. And to rush, rush it too. And I realize you may not say it's been rushed because it started back in 2003, but it was dead for many, many'",
        "'speaker_3': 'years. And the reality is we need to try to find a way to make it more interesting, invigorating for people who are walking and something that would we would be proud of as the city of Long Beach to present to the rest of the country, the community and the area.'",
        "'speaker_3': 'I think it's a it's something we should be doing and we shouldn't be just. Quickly having a path that's exactly next to it, and it should have a lot more to it than this. Anyway, I don't want to go anything further.'",
        "'speaker_3': 'I'll be short and thank you very much for your time.'",
        "'speaker_0': 'Thank you, Mr. Brown. Appreciate it. Next week.'",
        "'speaker_4': 'Good evening. My name is Marcus Schindler, and I'm president of the Arts Council for the City of Long Beach. I live on Ocean Boulevard. I had a three minute speech prepared. It was timed, but a lot has been said.'",
        "'speaker_4': 'So it's sitting on my seat still, so I'm going to keep it real short. Esthetic considerations.'",
        "'speaker_8': 'Are super.'",
        "'speaker_4': 'Important in our society when all intrinsic values are the same. Whether we're choosing shoes, a car, a home or a city to visit or live in, it's the esthetic consideration that tips the ballot, tips the balance. We choose the more attractive pair of shoes, the more attractive city, the more attractive house.'",
        "'speaker_4': 'So this is something very important to keep in mind when we're designing something for the community to enjoy because we want something that attracts the community as well as people from other communities because that helps drive the economy as well.'",
        "'speaker_4': 'And also another thing to consider is the integrity of the process itself.'",
        "'speaker_3': 'This was a process.'",
        "'speaker_4': 'That was started. It was vetted to a certain extent. And the idea, the aim of this process was to make sure there weren't any rushed expenditures, so the aims were foresighted. So I think that's something to keep in mind because, you know, we're coming out of a period of crisis where there was a lot of fast tracking'",
        "'speaker_4': 'and that was due to a lopsided sense of values. And I think one thing that's important is that our.'",
        "'speaker_3': 'Teachers values and that a city that cherishes art.'",
        "'speaker_4': 'Cherishes its citizens as well. And if we don't, we become victim to lopsided values.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Mr. Segal. Appreciate it.'",
        "'speaker_7': 'Good evening. City Council Mayor Foster, my name is Gordon and Cager. I live at 235 Loma Avenue and I first want to start with a huge thank you to those of you who were willing to speak with me in the last few weeks regarding the process for the speech path and the consideration of the use of Tidelands'",
        "'speaker_7': 'funds for a project when this is definitely has been demonstrated this evening, a piecemeal project, there are elements of what is an over ten year old plan, maybe closer to 15 year old plan, now being brought forward in a piecemeal process, which I have tried to demonstrate to.'",
        "'speaker_7': 'Those of you willing to listen is not the process that these people here want to hear from you. We have an obligation to involve the community. We have an obligation to involve the public in these kinds of projects.'",
        "'speaker_7': 'That has not been demonstrated. Is anyone here proud of the process that's coming forward on this beach path? These are the people who should have been listened to three years ago, five years ago. These are the people who now, now today have an opportunity to speak.'",
        "'speaker_7': 'Mayor Foster. Unfortunately, we don't have a lot of time for them. They only get 3 minutes. This is a process that we know how to do. We know how to involve the public. We know how to do it with CDP.'",
        "'speaker_7': 'We know how to do it with a breakwater reconfiguration. We know how to do it in lots of other elements of our community, and this has not been demonstrated. I'd also like to say that there is a trouble with Tidelands here in Long Beach.'",
        "'speaker_7': 'We have a lot of money coming forward. This project may not be the priority that we need right now. Tidelands money should be addressed and the use of that money and a masterplan be developed with community input, with public participation that allows people to give their opinion and help guide the city as we move forward.'",
        "'speaker_7': 'I'd ask that you stop this project this evening, reconsider the process, reconsider the folks that want to participate and haven't been given an opportunity. Thank you for your time.'",
        "'speaker_0': 'Thank you, Ms.. Gauger. Next, please.'",
        "'speaker_3': 'My name is Vernon Wright. I live at 513 West Ward log out in the vaguely area of Long Beach and I and I'm the fitness coach for yes we serve who we train second and 3/5 grade children traveling.'",
        "'speaker_3': 'I'm a training coach for the big league river runners who prepare the minors for the Wrigley River event. Five and ten k run. I am also the coach for a coach for Back on my Feet, which has two running groups here in Long Beach.'",
        "'speaker_3': 'And needless to say, I'm an avid long distance runner. Some of the benefits of running, it's a top calorie burner. It's inexpensive, great for your social life, great for a long time, lifts your mood, increases the self esteem.'",
        "'speaker_3': 'A great reason to get outside and appreciate nature, reduces stress, lengthens your life span, gives you goals to work towards, boosts created creativity. And the only thing that it doesn't do is enhance one's public speaking skills. The the widening of the current bike path is a make sense proposal for more reasons than one.'",
        "'speaker_3': 'One is the economic impact this unique running path will give to the city of Long Beach. We have four major running clubs, clubs here in Long Beach, and they all train on this here bike path. We we use the bike path to train for various races, including the Long Beach Marathon, the Long Beach, Turkey Trot, the vaguely'",
        "'speaker_3': 'river run. And as major races get closer, like the L.A. Marathon or the Surf City Marathon, the bike path fills up. A wider path will allow for more room for cyclists plus some of them and this is the public speaking part the a wider path will allow more room for cyclists and thus pull some of them off'",
        "'speaker_3': 'of the road and will bring more people to our beaches to enjoy the outdoors, to eat and to take advantage of our blue skies. What stands out most for me is the family structure. I use this pathway to push my grandson in a jogging stroller and there is not much more that warms my heart than watching parents'",
        "'speaker_3': 'do the same with their children. A wider pathway is safer and will create a family friendly environment. Currently, the path can be dangerous when cyclists, runners, walkers and children share the same space. So I respectfully ask that this project be moved forward for the health and the well-being of the users of this pathway.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Pretty good words. Next.'",
        "'speaker_3': 'My name's Joe Gaber.'",
        "'speaker_4': 'I live in Belmont Heights. I want to make a couple of observations. One, I think that this. Exercise of designing the path from.'",
        "'speaker_3': 'The podium tonight really kind of illustrates the total inadequacy of public notice and comment prior to getting this point in the process. You know, we should have had this long before staff got this far down the road. Chacon I want to clarify that the Coastal Commission special condition was pretty clear and unambiguous.'",
        "'speaker_4': 'That the path needs to be inland from the existing path. There are segments.'",
        "'speaker_3': 'Of the design that don't meet that condition.'",
        "'speaker_8': 'But more importantly than all that.'",
        "'speaker_3': 'I agree with this notion of getting a master plan for our beach. It has multiple benefits. You know what the vision is? You know what you're going to end up with at the end of the process.'",
        "'speaker_4': 'It gives you it gives.'",
        "'speaker_3': 'You an opportunity to make sure that multiple.'",
        "'speaker_8': 'Projects that are going.'",
        "'speaker_4': 'On at that beach don't conflict with each other.'",
        "'speaker_3': 'And it gives you an opportunity to prioritize which of those projects come first. Can't build things that are unimportant, but at the exclusion of those that are important. Just for a couple. I mean, there's a I can come up with a laundry list of examples, but a couple of examples of the potential conflicts.'",
        "'speaker_3': 'We're talking about improving the Belmont Pier and improving this bike path, pedestrian path. At the same time, it's my understanding that most of the accidents happen at that intersection on the pier. Is it really going to be safer if you if you encourage that cross traffic, you got more people coming on the pier and more people on'",
        "'speaker_3': 'the bike path. Are you improving safety or are you exacerbating the hazard? I also hear plans for dunes construction on the beach. Look, that's an admirable thing. But if you're doing dunes creation on the beach for habitat values and you're putting a, you know, heavily traveled path right next to those dunes, they're not consistent.'",
        "'speaker_3': 'You need a master plan to put all these pieces of the puzzle together before you go spending any money on any one piece.'",
        "'speaker_4': 'Anyway, I encourage you to fall back.'",
        "'speaker_3': 'Save your money. Make sure you got a plan in place before you start putting these pieces together. Thanks very much.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Mayor Bill Davis, president of Belmont Heights. I used a bike path frequently. Three days a week, three days a week on a bike, one day a week on a long walk, including a bike trip to the aquarium for my volunteer duties commuting.'",
        "'speaker_3': 'I strongly suggested the bike path be improved. It does need to be improved and safety needs to be enhanced. However, I'm probably one of the few people who's actually seen the conceptual drawings and renderings that Terri and David produced as part of the masterplan.'",
        "'speaker_3': 'And quite frankly, those renderings and drawings were stunning, absolutely stunning. And to me, it just is a tragedy that they were kind of lost in the bureaucratic shuffle and does not speak well, I think, to the way that the city is doing this business.'",
        "'speaker_3': 'I strongly urge the Council to move this item back to staff with instructions to include all stakeholders, to include esthetic and cultural elements into the plan, and perhaps even to include the larger master plan. Thank you very much.'",
        "'speaker_0': 'Mr. Davis. Next.'",
        "'speaker_3': 'Hello. My name is Seamus Innes. I'm a live in Long Beach, 3951 door in the fourth District. I'm a licensed civil engineer and a practicing coastal engineer in California for 20 years. And the vice chairman of Long Beach chapter of the Surf Foundation.'",
        "'speaker_3': 'We've been working on the plan with the city for a couple of years, and at the beginning it was a very bad plan and it's much better than it was, but it still has a long ways to go.'",
        "'speaker_3': 'And the surf right at position on it the whole time has been we're not sure if a whole new path is necessary, but if one is, it should be on the language side and the amount of new pavement should be minimized.'",
        "'speaker_3': 'The key reasons for this, for these conditions were are that sea level rise is coming and we're going to lose our beach to sea level rise. Whether we believe it or not, it's going to happen. And if there's one thing we learned from Superstorm Sandy is that wide stable sandy beaches protect structures, bluffs, homes, neighborhoods a lot'",
        "'speaker_3': 'better than beaches that are paved over with ferris wheels or pedestrian paths or bathrooms or other stuff like that. So in order to incorporate these coastal engineering features like sea level rise and sandy stable beaches, the city should make an effort to have those things into a master plan.'",
        "'speaker_3': 'The master plan. The same one that could incorporate. Static features and we need to really improve the process because you know, us, like a lot of other people, feel that we've been not really taken seriously and we shouldn't have 20 people, all those people here talking to you guys, this should all be taken care of ahead of'",
        "'speaker_3': 'time. Please find a way to get the process improved. Also, this is a good practice session because when the breakwater comes, that line is going to be four times as long. So please find a way to improve the process.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_8': 'Good evening. My name is Bill Shin. I'm a 32 year resident of Belmont. Sure, some people flat out don't want a pedestrian path. Others want to create one with cluttered up with extra elements. I think the current plan strikes the balance between those opposing sides and the City Council would be wise to approve it.'",
        "'speaker_8': 'I have attended three of the 14 presentations by Tidelands manager Eric Lopez and have watched the process play out over the past two years. The best thing about Mr. Lopez, his plan is that it minimizes the loss of open space by having the two paths parallel in close proximity.'",
        "'speaker_8': 'It never ceases to amaze me that people will see an open space and come up with schemes to pave over it. There is no reason to add anything other than a pedestrian path. It's a beach created by Mother Nature.'",
        "'speaker_8': 'Why mess with it? And the talk of having a meandering pedestrian path is impractical. The only room for it would be on the ocean side of the current path. And we've learned from the Coastal Commission and interest groups that they don't want any permanent structure on that side.'",
        "'speaker_8': 'On the inland side, at least, for example, from the Belmont Pool down to Granada, there are like 12 volleyball courts. And then if you go farther east, you've got people playing ultimate Frisbee. You've got youth soccer leagues, adult soccer leagues, adult football leagues.'",
        "'speaker_8': 'It's it's gets very wide. It's used a lot. And it needs to remain an open space. The last thing I'd like to say is regarding the dogs. I frequently see people illegally walking their dogs on the current path, and a lot of times the dogs can't make it in time to get to the dog beach.'",
        "'speaker_8': 'So they'll just put their dog out on the beach and either pick a pick up after it or they'll just cover sand over it. I don't think beachgoers should be subjected to have to walk through that. So if you do.'",
        "'speaker_3': 'Allow dogs.'",
        "'speaker_8': 'On the bike, on the pedestrian path, they should curb it on the path itself and not despoil the beach. Thank you.'",
        "'speaker_0': 'Thank you. Ms.. Next.'",
        "'speaker_3': 'Hi. My name's Jason Dunham.'",
        "'speaker_8': 'Back and here, representing.'",
        "'speaker_3': 'Volunteers for an.'",
        "'speaker_4': 'Adventure club we organize of the beach football, beach soccer, beach volleyball, beach tennis, the adult sports crowd. And we're going into youth league soon, primarily near the corner.'",
        "'speaker_3': 'Of Granada Avenue and Ocean. Um, we have over 350 plus participants a Saturday and Sunday weekend basis.'",
        "'speaker_8': 'Have a growing footprint. Every year we bring the community out there to have.'",
        "'speaker_4': 'A good time, get involved with sports, meet new.'",
        "'speaker_3': 'People, make new friends, and it's a great experience. So we like to see the path kept closer to the inland area. So that way we have more space available to.'",
        "'speaker_8': 'Expand.'",
        "'speaker_10': 'Our area and our setup and our events on the beach.'",
        "'speaker_8': 'And to get more people out there playing.'",
        "'speaker_4': 'Um, so we're not against any, any design.'",
        "'speaker_3': 'Or artwork that's not going to take away.'",
        "'speaker_8': 'Beach space, but we want to keep that area open for the.'",
        "'speaker_3': 'Community to use. So thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Good evening, Mike Filippo, born and raised in Long Beach all my life. I am currently at Poly High School. I've been there 25 years.'",
        "'speaker_9': 'I teach science and I am the cross-country coach and the distance track coach.'",
        "'speaker_4': 'So we need this path on the beach. I run 150 kids in the area and we're surrounded by a concrete jungle. In this day of childhood obesity and kids getting carpal tunnel syndrome from texting too much. We need to keep our kids active and we need.'",
        "'speaker_9': 'Areas where they can be.'",
        "'speaker_4': 'Active. A bike path, a pedestrian path on the beach would be a huge, huge bonus for our youth runners as we're down there once or twice a week already, but very limited on our options. What we can do.'",
        "'speaker_4': 'The idea of running surfaces has been documented would be beneficial to all of our youth runners. Every year, when we come back to school from a summer.'",
        "'speaker_9': 'Of training by three weeks and.'",
        "'speaker_4': 'Kids have shin splints because sidewalks around the area. This would give another opportunity.'",
        "'speaker_9': 'Of the proper running service surface for.'",
        "'speaker_4': 'Our youth athletes. I highly recommend that you approve this project.'",
        "'speaker_9': 'Which has been in the planning stages for a long.'",
        "'speaker_4': 'Time, to help our kids in the city continue to be active. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Hey, I'm Wesley Park. I'm a runner over Polly, so our whole team is pretty much in on the support of this. We're down there once a week, and we run on that. That concrete, pat and concrete really sucks for your knees.'",
        "'speaker_9': 'And just like for runners.'",
        "'speaker_8': 'So, like, that path would be, like, awesome to have to run on and stuff. And when we're on that path, when you've like 90 guys on that path.'",
        "'speaker_9': 'That really narrow bike path, and then there's like a caravan of like cyclists, it's, it gets like it's chaos. So it'd be nice to have like a separate lane and. Yeah. That's it. Thanks.'",
        "'speaker_0': 'Thanks, Mr. Clark.'",
        "'speaker_9': 'Good evening, Mr. Mayor. And Council. My name's Andy Kerr, and I live in the eighth District and have been a lifetime resident of the city. I just want to reiterate what the young man said. I've been running on that path since 1986 when I was in high school, and I have the joints and the ligaments now to'",
        "'speaker_9': 'prove it. And so is a lifelong runner. I just want to reemphasize all the points that have already been made by the previous runners and especially Coach Mike Filipov, who's a wonderful asset to the Long Beach Poly and the high school community here in Long Beach.'",
        "'speaker_9': 'And just as an amazing job with our young runners and and I had that type of coach in high school here in Long Beach that gave me a lifelong love of running. And we are surrounded in a concrete jungle.'",
        "'speaker_9': 'Just a couple other quick points I think is an amazing environmentalist. And I think as an environmentalist, this strikes a good balance. I think the National Park Service presents a good model when they have an opportunity with a natural resource to create it more, to be more accessible to the community and to provide better access to the'",
        "'speaker_9': 'community. They do that. They move forward with that. So I think that's a good point. As far as the 20 parking spaces and creating a more you losing those spaces and creating a more safe running a bicycle path.'",
        "'speaker_9': 'I grew up in Long Beach. I get cars. King were a car culture, but I think we need to get beyond that and realize that we do have this health issue in our community. We need to get kids more active.'",
        "'speaker_9': 'We need to get us older people more active. And 20 parking spaces is not a really big cost. And I think the improvement to the beaches as a result of doing this plan, I think the businesses in the community are going to benefit far more than 20 parking spaces.'",
        "'speaker_9': 'So that's all I have to say. Thank you.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_11': 'My name is Alan Crawford, a Long Beach resident executive director for Bikeable Communities and former bike person for the city of Long Beach. I'd just like to address Patrick O'Donnell's culture on O'Donnell's issues, on safety. And I'd like to make two points.'",
        "'speaker_11': 'One, that the separated facility really is much more important to illustrate that in just a moment. And to the curb doesn't solve your problem. As a matter of fact, if you go to the FAA air manual, you will see that they expressly say, no, don't do that for a very simple reason.'",
        "'speaker_11': 'Cyclists coming along. Think of a small child. They hit the curb. They go over, they hit their head. They're in trouble.'",
        "'speaker_4': 'So that's you that's.'",
        "'speaker_11': 'That's not a solution. Santa monica has done it for very short distances and they've accepted the liability for doing that. I don't think we want to accept that liability. Under the second point on the separated path, as illustrated by a story from Washington, D.C., area gentleman, 66 years old, riding a bike, $88 huffy, not exactly a lycra'",
        "'speaker_11': 'clad individual comes up behind an older woman, rings his bell. She does not hear him. She steps in front of the bike. She is hit. She falls, she cracks her head and dies. That's the problem. It's very, very simple.'",
        "'speaker_11': 'Bikes and pads don't mix very well. There's a very strong reason. We have a strong ordinance in Long Beach that says bikes are not permitted on sidewalks in residential and commercial areas. The same should apply for our beaches.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'They gave their council members first two items to do with their proposal. I don't think that they need to take away the parking spaces at the pier. I agree with the gentleman from the Belmont Brewing Company. It's much safer the way it is because I'm a 30 year resident.'",
        "'speaker_7': 'I cycle and I walk on the beach regularly and the only thing that slows down the bike riders is the fact that they have a turn to make. They're not shooting straight over the pier and there's nothing to stop them.'",
        "'speaker_7': 'So I think it's safer if they know that that's there, which they do now, and if they need to make the turn, I believe you can widen that ramp that goes down to the beach and you'd have room for both pedestrians and bicyclists and would be safer.'",
        "'speaker_7': 'On the issue of dogs on the beach, I can understand people love to take their dogs to the beach, but they don't keep them on a three foot leash and they don't keep them by their side. They like to turn them loose or they have these long cords and they let them loose and then people follow them'",
        "'speaker_7': '. I live in the shore. I walk Second Street all the time and constantly am having to stop almost being tripped by a dog people. And there's the issue of the what do they do when they go to the bathroom?'",
        "'speaker_7': 'So I hope you'll consider that there's a very danger there. And thirdly, the problem that you have with all of these people here is there was not a proper public process. This should have gone to something like the Planning Commission.'",
        "'speaker_7': 'I'm not sure why Tidelands funds tens of millions of dollars are spent without going through a proper planning process. A master plan would be good and then open public hearings where people can know precisely what's happening. Mr. Lopez came to the BSR three times.'",
        "'speaker_7': 'He didn't tell us where the path was going to be. It was only when I ask that I learned it was going to be on the ocean side. And after that, we repeatedly asked it to be put in Lent.'",
        "'speaker_7': 'It was not. It was sent to Coastal Commission after they had spent half a million dollars on elaborate demolition, construction plant landscape plants. We only found about it by seeing a little tiny notice like this on the beach.'",
        "'speaker_7': 'The Sierra Club had never been notified, so if riders did not know it had been sent to Coastal. We had to get everybody together to understand what was happening and then make a major effort at Coastal Commission. It should not have happened that way.'",
        "'speaker_7': 'It should have gone through a planning commission and a proper process. Thank you. Thank you.'",
        "'speaker_0': 'Thank you. An expert.'",
        "'speaker_8': 'Good evening, mayor and members of the council. I'm Jeff Miller, a 30 year resident of Long Beach and secretary of the Belmont Shore Residents Association. The bar. Sorry. I want to remind you that sorry. After hearing the presentation by Mr. Lopez about this path and after lengthy discussion, we endorsed a new path for pedestrians, a separation of'",
        "'speaker_8': 'the bicycles and the pedestrians, and supported that for many of the reasons that have already been discussed. And I won't repeat all of that. We did say, though, that it should be on the inland side only and with numerous discussion and reasons for that as well.'",
        "'speaker_8': 'And as you know, the Coastal Commission agreed with us. So it's too bad we couldn't have done all of that upfront rather than backwards like this. But I do want to speak to one point, and that is the parking lot and the loss of parking spaces at the pier.'",
        "'speaker_8': 'It doesn't have to be. There is another way which no one has mentioned this evening. If you take a look at that parking lot and the adjacent pier, what an engineering term is called ground truth. Get out there and take a look.'",
        "'speaker_8': 'I speak with some knowledge of this because I'm a user of the path, both walking and on bicycle. And I've taken a look at this over and over. Every time I go by the existing path, which goes along the south side of the parking lot and then along the west side up the ramp to the pier is'",
        "'speaker_8': 'fine and that can serve as is for the bicycle segment of the path inland where the pedestrian path needs to be. There is already a very wide sidewalk and path on the north side of that parking lot and on the west excuse me, the east side of that parking lot.'",
        "'speaker_8': 'There's no reason that that can't be marked as the pedestrian segment of that path. And there's your solution. And you don't have to pour any new concrete. The unless remember. Please, this is. Referred to as a bicycle path.'",
        "'speaker_8': 'It's not a raceway. It shouldn't be. So having a 90 degree turn at the pier is just fine. In fact, it's a good thing. Bicyclists need to slow down, maybe even stop, because there is a constant stream of pedestrians going to and from the pier.'",
        "'speaker_8': 'And in straightening that path so that the bicycles can go faster is a bad idea. So consider that and save those parking spaces. Thank you.'",
        "'speaker_0': 'Thank you. Next, we.'",
        "'speaker_7': 'Hello. I'm asking that hill and I ever live down in the shire forever. And I remember when there were surf down in Belmont Shore. And of course, that would be the most terrific thing to bring back to Long Beach is to bring back some surf.'",
        "'speaker_7': 'I also have walked run the bike. The path of everyone has said many things about it. I don't need to add anything more other than to confirm what they've said. And I think with Long Beach growing forever and they have the the marathon, which also is a great, great thing to do.'",
        "'speaker_7': 'We need more space. We need it for the bikers. And also on Sundays when young children are down there in strollers with dogs and everything. It's too dangerous, particularly if the bikers are going really fast. I don't really have anything more to add, but thank you for listening to my little speech.'",
        "'speaker_7': 'Long Beach is great and let's get that surf back.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'I'm Nancy Buchanan. And I did send an email to all of you, but I know it was this morning. I support the new pedestrian path because it will increase the safety and enjoyment to cyclists, runners, walkers and families with kids in strollers, internet.'",
        "'speaker_7': 'And I walk weekly on the path and five feet definitely is not enough. I also bike weekly on the path. The 3.1 mile beach path brings together East Long Beach, which is Belmont Shore, Naples and the Bay to Within connects it with downtown, which has the hotels and convention center.'",
        "'speaker_7': 'Now what an excellent connection to showcase our city. The beach path provides an opportunity for groups such as 5013 C's and other groups to raise money for charities. And it brings in thousands and thousands of visitors for people to learn about our city.'",
        "'speaker_7': 'I am a resident. I am proud to be a volunteer with a Long Beach marathon and also with the Community Action Group with the bike event that's on on the 4th of July, and then also with the turkey trot.'",
        "'speaker_7': 'Both those events, all those events need more room. Okay. So I'm requesting that you do approved tonight, the pedestrian path. Thank you very much.'",
        "'speaker_0': 'Thank you, Mrs. Buchanan. Next to me.'",
        "'speaker_7': 'Hi. My name is Sasha Witty. I live at 3 to 140 second Street, and I'm the president of the Bluff Park Neighborhood Association. Our neighborhood association got a presentation a while back about the second bike path, and overall the support was for a separation of pedestrians and bicyclists.'",
        "'speaker_7': 'And then more recently, it was brought to our attention of the plan that had been created with Parks and Rec, Terry and David sometime back. The more meandering path, it just seemed like a more comprehensively well-thought out concept.'",
        "'speaker_7': 'So the neighborhood was very much in support of that. So I'm here on behalf of the Bluff Park Neighborhood Association to say, we'd love you guys, to take a look at it, come up with a more comprehensive plan, go back to some of the things that were already created and take a second look.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Appreciate that.'",
        "'speaker_7': 'Next for Wendy Hahn Bluff Park. And I'm speaking on behalf of Long Beach Heritage Advocacy.'",
        "'speaker_9': 'I, too, first of all, I really would like to thank Ms.. Braunstein. She has made a.'",
        "'speaker_7': 'Significant outreach effort to.'",
        "'speaker_4': 'Inform and.'",
        "'speaker_7': 'Educate various stakeholders and community groups in the area about this wonderful plan that was developed in 2004. It's absolutely phenomenal. If you had an opportunity to see it, great.'",
        "'speaker_2': 'If you haven't, I urge you to perhaps have a.'",
        "'speaker_7': 'Special session where.'",
        "'speaker_9': 'Planning could present this work. It's really, really delightful to.'",
        "'speaker_7': 'See, and we would very much support the second path with adherence to or consideration of conformance or incorporating some of those wonderful design elements.'",
        "'speaker_9': 'Because then I.'",
        "'speaker_7': 'Think you're going to put Long Beach truly on the map of having a unique resource, an attribute that would be attractive.'",
        "'speaker_9': 'For many, many.'",
        "'speaker_7': 'Years to come. Thank you for your time.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Good evening. I'm Raven Adder, and I'm a resident of First Street in Long Beach. I'm also a member of the Bluff Park Neighborhood Association, and I sit on that board. As such, I support what our president just said, the position that we have for the board to put it off at this point.'",
        "'speaker_3': 'But as a private citizen, I would also like to reiterate that point. I think we have the opportunity to make something great at the beach, make it more of a Destin. Nation. And I think today we should just pause to step back and look at the plans that are out there, what's available, and see where we can'",
        "'speaker_3': 'come up with something a little bit better for all. I thank you for your time and consideration.'",
        "'speaker_0': 'Thank you, Miss Spinner. Appreciate.'",
        "'speaker_3': 'Hello. My name is Mike Ilitch. I'm a five year resident of Long Beach, also one of the owners of Ball to Sport Adventure Club. I've also lived in Newport Beach, Huntington Beach, Redondo Beach, and I think there's possibly another feasible approach to this in what I would propose as merely widening the path in consideration of implementing signage'",
        "'speaker_3': 'that would support the safety of our pedestrians and bicyclists. In addition to that, some responsibility of the city to help police that environment and provide that safer, secure environment for the people who are active at the beach. With that being said, we're at the beach every weekend.'",
        "'speaker_3': 'We see everything out there. We understand why there's a concern. I see just as much of a problem with people crossing across the bike path to get to the water as people walking down the path itself. So I think there's a lot of things being addressed here and outside of what our club does.'",
        "'speaker_3': 'It worked with Susan Smith for a few years trying to grow activity here at the beach and now taking it over with our club on behalf of people that aren't here, that play volleyball closer down by this other parking lot, it looks like this proposed plan would actually be removing four courts from that location that are used'",
        "'speaker_3': 'at least five times a week. So let's just just have that in consideration when you're making your decision. That's all I have to say. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'And Mr. Mayor Kristof, just quickly comment on that. I wasn't aware of any courts being removed.'",
        "'speaker_3': 'Or maybe maybe.'",
        "'speaker_6': 'Because that proposal.'",
        "'speaker_3': 'Was before the courts right there. He'll be there and they will say yes.'",
        "'speaker_7': 'All of the existing courts will remain. We're not removing or affecting any of the existing courts.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_7': 'So that's correct. Those are those will stay.'",
        "'speaker_2': 'For the.'",
        "'speaker_3': 'Volleyball. Volleyball do cross next week.'",
        "'speaker_9': 'I am Casey Hunt and don't need to know my whole life story, but I run for poly track and cross-country and we always run down to the beach. And it's kind of fun to run down there, but it kind of sucks running on the bike path because it's like we had to, like, alert each other for bikes'",
        "'speaker_9': 'because the bikes fly by and you need to like really get over and get onto the sand. So I go around the bikes and so they don't hit you. So I'm thinking that the bet that the. I suck at this that the new pedestrian path would be a good idea because now I know we can all run'",
        "'speaker_9': 'on the on our own side and the bikers can go on their own side and it be like separate. And also that people will cross over and they're going to say passing on like a highway, a one lane highway.'",
        "'speaker_9': 'You're going to go around some people, but you'll get back over. And, you know, but I think that the the strip of sand will be a good idea because then you'll want to run through the sand and go, oh, well, too much work and go across it.'",
        "'speaker_9': 'So I think it's a good idea to separate it and that keeping the 90 degree turn, I mean, I don't I'm just going to say this, that I think it was kind of a good idea because like, it slows people down and like, you know, so people bikes have to go slow because bikers, are they legal fast'",
        "'speaker_9': 'and they like they they try to hit you so and that seems like a game to them. So I think that's a good 90 degree turns good. The bike path is good and that sounds good. Yeah.'",
        "'speaker_0': 'Oh, good.'",
        "'speaker_4': 'All good.'",
        "'speaker_8': 'I'm good.'",
        "'speaker_9': 'So thank you.'",
        "'speaker_0': 'Thank you. Well said. Hi, my name is David Bronstein. And as you can imagine, I've been an active listener of this.'",
        "'speaker_3': 'And frankly, you know, I'm bothered by the process.'",
        "'speaker_0': 'Like many of the other people.'",
        "'speaker_3': 'And I think in the end.'",
        "'speaker_0': 'I'm going to make this short.'",
        "'speaker_3': 'But in the end, there are two.'",
        "'speaker_0': 'Basic questions I.'",
        "'speaker_3': 'Think you should all consider.'",
        "'speaker_0': 'First is the community engagement process that reviewed the proposed staff plan complete and satisfactory?'",
        "'speaker_3': 'And I think you've heard from a lot of people that it isn't.'",
        "'speaker_0': 'And you have a broken.'",
        "'speaker_3': 'Process.'",
        "'speaker_0': 'I sat through several of the association meetings and the participants were quite vocal in their preference for a more interesting path, the one proposed by Terry Braunstein. And and they, they were really wowed by the plan that was put together by Park and Rec.'",
        "'speaker_3': 'They were and frankly, they were incredibly annoyed. They were not given this option when asked to vote.'",
        "'speaker_0': 'So all the participation you heard about, I think, has been quite.'",
        "'speaker_3': 'Biased because they had no option.'",
        "'speaker_0': 'People favor.'",
        "'speaker_3': 'Two paths. That's a given. But what they wanted was something more inspired and something more artful. Second, the proposal presented.'",
        "'speaker_0': 'By staff.'",
        "'speaker_3': 'Is not consistent with the 210 Long Beach Strategic Plan. On page four, the fourth go states support neighborhood efforts to.'",
        "'speaker_0': 'Create beauty and pride. I think that what has been described as a two lane highway fare falls very short of that goal. Whereas the Park and Recreation Plan is aimed squarely at meeting that goal.'",
        "'speaker_3': 'And I think you should think about that.'",
        "'speaker_0': 'We're talking about creating pride. We're talking about creating beauty.'",
        "'speaker_3': 'As everyone points out, that makes the beach very attractive.'",
        "'speaker_0': 'And that's one of the goals you want to have. By the way.'",
        "'speaker_3': 'When the local council commission was asked how long it might take to review a new plan, they said 8 to 10 weeks. So it's not a long time. And I think we.'",
        "'speaker_0': 'Should take that time to consider a new path. It seems to me to me the bottom line is that the decisions concerning the beach need to be made with the goal of making it a truly a big asset.'",
        "'speaker_0': 'This is a significant opportunity to make our beach more desirable. So while we're all.'",
        "'speaker_3': 'Four to a pedestrian path, no one's arguing about that because there's a lot of evidence for it.'",
        "'speaker_0': 'It should be thought through.'",
        "'speaker_3': 'Should be part of a master plan, and frankly, it should be one that's a lot.'",
        "'speaker_0': 'More interesting than a.'",
        "'speaker_3': 'Two lane highway.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Grassley. Next.'",
        "'speaker_9': 'Hi, my name is Kristen Kerr. I also run for I also run for coach Phillip Hill, Long Beach Poly. And I just want to offer my support for this path. As someone who goes to a high school like this where it's landlocked, we don't have a lot of places to run.'",
        "'speaker_9': 'One of the few places that we have that's within a reasonable distance from our school is the beach. So someone who's going to be running on this path tomorrow and many more times for the foreseeable future, I'd really like to offer my support for this path.'",
        "'speaker_9': 'Thank you very much.'",
        "'speaker_0': 'The game is curved.'",
        "'speaker_7': 'Hello. Hello. My name is Derek Matos. I also run for Long Beach Poly and I'd like to point out that every single day when we run, we like to go to the beach because it's better than running like 30 something laps on a track.'",
        "'speaker_7': 'So when we go there, we get told like almost every other day to run the right pace with the right people. So technically, when we're on the bike path, we're not going to be running by ourselves. We're going to be running next to people who are about our same speed.'",
        "'speaker_7': 'And generally, we take up more space than the like five foot area allowed to us on the bike path. And when we're running, like people said before, the bikes come whizzing past. So we, like, yell at each other when everyone shows up.'",
        "'speaker_7': 'And so but when that happens, we still almost get hit. My friend got hit by a bike during the summer and it knocked both of them off, both of them onto the ground. And the biker got hurt. And then so, yeah, so I support this new bike path, and it would help a lot.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank.'",
        "'speaker_7': 'Hi. I'm Cassidy, and I also ran for a Long Beach poly. I we run there at least once a week and we're always on the path. And I know when we're running there's a lot of us group together and we always have each other.'",
        "'speaker_7': 'Bike, bike, watch out, you know, on your left. And it's the we actually had a couple accidents with the bikes, like you said, and it's just not safe for us all to be running there with on the same in the same areas, the bikes.'",
        "'speaker_7': 'So I support the bike path. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'Hello. My name is Cadillac Reed. I live on 809 Miramar. And I wanted to thank everyone for considering separating the bike path, for separating them for cyclists and pedestrians. I am part of the pedestrian community and the current design is not sufficient.'",
        "'speaker_7': 'We generally don't work walk alone. We do generally walk side by side to enjoy a chat and that often puts us in the way of the bikers. So I am very pleased that a separation is being considered. I just wanted to emphasize some of the things that Councilwoman Gypsy said earlier this evening about taking the original plans'",
        "'speaker_7': 'that I believe were from 2002 into consideration. And these plans are on Long Beach, California, Facebook page. And they really are very delightful. And they include spots where that were called mini parks, where there's indigenous landscaping and lots of places to put your eyes and are much more esthetically pleasing than a two lane highway.'",
        "'speaker_7': 'And I just wanted to I just wanted to express my concern that they were not taken into consideration and appeared to be lost. And I hope that the council will take them into consideration and that they're not lost in the Office of Circumlocution.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Hi. My name is Melinda Roney and I live in Bluff Park.'",
        "'speaker_9': 'I'm also the president of Long Beach Heritage.'",
        "'speaker_4': 'I very much support two paths, one for bikes.'",
        "'speaker_9': 'And one for pedestrians.'",
        "'speaker_4': 'But I do not support what they're calling a highway.'",
        "'speaker_9': 'I would call.'",
        "'speaker_4': 'It a ribbon of cement.'",
        "'speaker_9': 'I believe there are alternatives to this, and I.'",
        "'speaker_4': 'Don't think that we've had time to look at them. I very much support the plan from Jerry Bernstein.'",
        "'speaker_9': 'And Mike Craig excuse me.'",
        "'speaker_4': 'Craig Stone called Coastal Illusions. It makes something very nice.'",
        "'speaker_9': 'Of our pathway. It also.'",
        "'speaker_4': 'Since it's extending from downtown, I believe it gives Long Beach.'",
        "'speaker_9': 'More of an esthetic appeal.'",
        "'speaker_4': 'People will be able to walk from the convention center and be able to see things that are attractive. Long Beach is very big on bikes and this has been good, but we've got to be bigger on the esthetics and I think that we're selling ourselves short.'",
        "'speaker_4': 'If we go ahead and approve, approve this as is, I think more time has to be taken to look at this plan. And also, I.'",
        "'speaker_9': 'Would like to see the Bernstein and Stone plan incorporated into it. Thank you.'",
        "'speaker_0': 'Thank you. Thanks for.'",
        "'speaker_7': 'Hi, my name is Olivia Gleason and I also run with pie crust country. And I just wanted to mention that I don't think a lot of people realize how many injuries people get from running on hard surfaces like cement.'",
        "'speaker_7': 'I myself received an injury as stress fracture with some reason of it being from running on the hard surfaces. And also I live on the peninsula and we have two dogs and when we try to walk to the dog beach, we can't walk on the bike path and we have to go on the cement around the bike'",
        "'speaker_7': 'path and it's kind of a hassle to get back on there. So I think the alternative path would be really good. And with the six foot margin between where the bikers would go and where the walkers and runners would go, and it would make a lot of sense because when the dogs walk, the have plenty of room'",
        "'speaker_7': 'and even if they did have a long leash or a long line, they wouldn't run into the bikers. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'My name is Jeff Jones, 3850 East Ocean Boulevard. And I'm a regular user of the bike path, have been since it's been built both on bicycle and on inline skates and definitely agree it does need expansion to accommodate the increased usage.'",
        "'speaker_4': 'My concerns. The reason for me to be here today is the.'",
        "'speaker_8': 'Interchange planned over.'",
        "'speaker_4': 'The parking lot at the Belmont Pier. It's it's way over the top. The parking spaces are extremely valuable there, and there are all the other alternatives. One, keep it the same as it is. Put a stop at the top and the bottom and slow down the bikes, as many have suggested.'",
        "'speaker_4': 'But what I haven't heard suggested as simply line up the bike paths and have the bicycle section of the path crossed the pier where the Deadman's Curve is now. That would be a spot on the pier where there's very light traffic.'",
        "'speaker_4': 'Only the people going in and out of the pier, they're coming in one direction instead of the six directions they're coming from at the current level. That's a real heavy, pedestrian intensive spot. Now, where the bike path crosses appear, because some people are going to the restaurants and the businesses, some are going to the pier, some are'",
        "'speaker_4': 'going to the path, some are going to the condos. So you have no one knows who is going what direction. But by removing the bike traffic and making it cross there, you eliminate the Deadman's Curve. It would be a straight approach over an unused section of the beach because that's where.'",
        "'speaker_8': 'The wastewater from the street.'",
        "'speaker_4': 'Runoff all settles. So nobody goes on the beach there. And it would allow the existing ramp that the city built a few years ago that has Deadman's Curve to be the existing walking path. It would save a lot of money and the construction cost would be simpler and it would save the parking places.'",
        "'speaker_4': 'The local coastal plan says the number of parking spaces on the beach parking shall be retained. This plan doesn't follow that. In the packet there with this with this item on the agenda, there was a questionnaire from the Coastal.'",
        "'speaker_8': 'Commission about the parking and instructed the city to retain the.'",
        "'speaker_4': 'Parking unless it's not.'",
        "'speaker_8': 'Feasible.'",
        "'speaker_4': 'Well, I think it is feasible and there are other ways that that can be addressed without building a that major construction and losing that parking, because that parking is used for access to the beach, the local businesses at the nighttime for the residents in a parking impacted area.'",
        "'speaker_4': 'So those cars are going to be displaced and pushed onto already impacted street parking. So I think we need to take another look at that part. And I support most of the positive suggestions I've heard here tonight from the other speakers.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Next week.'",
        "'speaker_4': 'I believe I'm the man you've been waiting for.'",
        "'speaker_8': 'I'm Charlie Gandy. I'm a resident at 38 Orange. And I will take less than a minute to share with you that I support this plan. But we can do better. The synthetic surface that we're planning to put down on this is actually harder than asphalt.'",
        "'speaker_8': 'And so while now it flunks as concrete, it's an F rating.'",
        "'speaker_4': 'This new surface.'",
        "'speaker_9': 'Will be about a D rating.'",
        "'speaker_8': 'Asphalt would be a C. If you really want to create an inspired project, let's go with what other great cities do and that is take it.'",
        "'speaker_9': 'Not using that plastic since.'",
        "'speaker_4': 'Synthetic surface. Let's put down a surface of.'",
        "'speaker_8': 'Dirt of.'",
        "'speaker_9': 'Dig.'",
        "'speaker_8': 'Hard pack between those curves that we're going to put down. It'll work very well. I've applied that surface in other cities and as a runner, as a guy that's down there three days a week running my four miles.'",
        "'speaker_8': 'I want to be able to brag about that facility. If we put the plastic down, we won't.'",
        "'speaker_4': 'Be able to do that. It'll be okay. It'll be better than what it is now.'",
        "'speaker_9': 'But it won't be inspired.'",
        "'speaker_4': 'And I'll help with the staff to make that happen. Thank you.'",
        "'speaker_0': 'Thank you. Hey. We'll take it back to the council. Mr. Johnson.'",
        "'speaker_8': 'Well, thank you, Mayor. And I want to thank everyone who came out and from all perspectives. Certainly, we take that very seriously, all the input here. Ms.. Fricke One thing that came up here was a discussion of the old Parks and Rec plan, and it said that there are a lot of elements to that.'",
        "'speaker_8': 'And one question came to my mind is even if we had the money and even if there were community consensus and I'm not saying there is, wouldn't Coastal Commission have significant concerns about new facilities and new elements or or would that not be a problem?'",
        "'speaker_7': 'Council Member I think this is an issue of kind of the clash between conceptual and practical. Initially when we were designing this plan, in fact we had more creative elements as part of it. The the path was on the water side, had a little more creativity to it.'",
        "'speaker_7': 'We had some nodes that we were proposing that would kind of connect the two paths in locations and have some elements, creative artist elements between those two nodes as we were moving through the approval process. It became painfully apparent that those elements were not going to be supported by the Coastal Commission, that they were pretty adamant that'",
        "'speaker_7': 'we needed to significantly minimize the amount of paving that was going to occur on the beach and that we needed to flip the path from the water side to the landside, which admittedly made it a much more straight and narrow type of path than we initially were proposing.'",
        "'speaker_7': 'So conceptually, we can always talk about these great ideas and working it through and having these new elements. But from the practical standpoint, it is ultimately the Coastal Commission who must approve these projects. And they sent us a clear message that we needed to minimize the impact on the beach area.'",
        "'speaker_7': 'So what is being discussed is likely never going to receive the approval of the Coastal Commission.'",
        "'speaker_8': 'Okay. Thank you. And one other thing that came up from some of the input here tonight was the discussion of the loss of parking and whether or not changing that night of return actually would make it more safer or less safe.'",
        "'speaker_8': 'So I guess I'm quite interested in your professional opinion of the public works folks. What about this opinion that perhaps by making it straighter, the bikes may go faster and actually create more hazard, particularly for the crossing at the pier?'",
        "'speaker_8': 'Is that is that accurate or is that inaccurate?'",
        "'speaker_7': 'We believe that the safety component that we're trying to improve is the visibility, the visibility between the bicyclist and the pedestrian. Right now, as they come around that 90 degree angle, neither the pedestrian nor the bicyclist really has sufficient time to react when they see one another.'",
        "'speaker_7': 'So by changing the design, you can see that there is a greater visibility so that in fact a bicyclist can see that a pedestrian is trying to cross that that path. So we believe that the configuration that's being proposed, in fact, is better from a safety perspective because it gives both the pedestrian and the bicyclist adequate time'",
        "'speaker_7': 'to react when they see one another.'",
        "'speaker_8': 'Okay. And if if for some reason, if the council wanted to change the configuration or keeps the parking, some might that I assume they would have to go back to coastal and have we do we have any feedback and I guess without you know knowing I mean is that something they have a concern about or were the'",
        "'speaker_8': 'chances of approval if we made a design change like that.'",
        "'speaker_7': 'We would have to to look at what the design would be. Again, we've got to ensure that we're providing kind of adequate safety to to some degree, because we are making improvements to the path. So both to the to the bicycle and the pedestrian paths.'",
        "'speaker_7': 'So we need to account for safety. We would take whatever direction the council gives us and then of course we would go back and talk to the Coastal Commission staff and determine what would be the approval process.'",
        "'speaker_8': 'Okay, thank you. Bye bye. I wanna hear from my colleagues, but I do think that the loss of parking, you know, is a concern. But there are tradeoffs. I do think we made as safe as possible. So thank you for your input.'",
        "'speaker_0': 'Mr. Del.'",
        "'speaker_5': 'Well, thank you, Mr. Mayor. So just quickly, what I think I heard tonight was the process wasn't perfect. So we need to look at a master plan and how that is developed or comes forward. I don't know. I don't know if the council would have to put an item on the agenda or not.'",
        "'speaker_5': 'Maybe your staff can weigh in on that and a majority want to split path so O'Donnell loses on his lighter single path. I listen. I listen, but also the parking spaces. I think Mr. DeLong has some thoughts he's going to bring forward on the parking spaces, but I think that's a very important component.'",
        "'speaker_5': 'I actually side with those who say maybe keeping it a little bit the way it is and slowing down the bike traffic might be a net positive in the end as well. So at that, I turn it back to you.'",
        "'speaker_0': 'Mr. Long.'",
        "'speaker_6': 'Thank you, Mr. Mayor. Yeah, I think what I'd like to see us through is amend the motion and direct staff to pursue making those changes to maintain the parking spaces. I want to say, if feasible, so the direction would be for you to go back to council commission staff and go for a diplomat.'",
        "'speaker_6': 'Now, for some reason they reject it. Then we can go forward with the plan as outlined. But. But I would like you to go back to Coastal and gain their support as quickly as you could. Additionally, not as part of this project, but certainly we've heard a lot that people would like to see some kind of art'",
        "'speaker_6': 'plan out there on the beach. I guess what I'd like you to do is come back with a recommendation of the council of what that might look like. And again, I don't think you necessarily have to tie it to the bike path project, but come back in a reasonable amount of time and tell us why this is'",
        "'speaker_6': 'a recommended path that we could take and get some more public comment and some councilmember comment and see what the appropriate steps are to move forward with that. And I'd also like you to, if you could comment a little bit on the material and the issues that Mr. Gandy brought forward.'",
        "'speaker_7': 'So, yes, we have a little bit of a difference of opinion with Mr. Gandy that we believe the material is equivalent to running on asphalt. So we believe it is an acceptable surface. We did look at doing a decomposed granite or a dig path, but you have to remember we are in a beach environment where the wind'",
        "'speaker_7': 'blows, the sand blows and it would be next to impossible to maintain a decomposed granite path. It would be immediately covered by sand in the first windstorm. And so in order to maintain a surface that people in fact can walk and run on, it is important to have some level of hardness.'",
        "'speaker_7': 'And the surface that we're proposing has been used throughout the country. We've observed it and we believe in talking with the runner community that in effect it is an acceptable surface.'",
        "'speaker_6': 'So and I'm sure it is acceptable, but to follow question one is why is sand problematic on DG? But sand isn't problematic on the surface that we're planning on using.'",
        "'speaker_7': 'Because we can easily sweep the hard surface. You cannot sweep granite. So that's the distinction.'",
        "'speaker_6': 'Okay. And are there any other services that are more compatible with running and walking materials that we could look at?'",
        "'speaker_7': 'We looked at a variety of surfaces and talked kind of with the running community about those surfaces. And the surface that we're proposing is really the compromise surface that we feel, in fact, is the best surface for this environment.'",
        "'speaker_6': 'Okay. Thank you. So I guess, Mr. Andrews, you made the original motion or there's a modifications acceptable to you. Yes. Okay. Thank you.'",
        "'speaker_0': 'Councilmember Longo.'",
        "'speaker_7': 'Mr. DeLong, did you did your modifications for Councilmember Andrews include an incorporation or a discussion of what sort of art components can come back?'",
        "'speaker_6': 'Well, I think what it is, it directed staff to come back with some recommendations, but I wasn't more specific.'",
        "'speaker_7': 'Recommendations based on, well, what we've.'",
        "'speaker_6': 'I think certainly what we've heard and the plans that have in place. But then, you know, any any additions or changes or modifications and maybe give us a little bit of what would be a good public process to take that on.'",
        "'speaker_7': 'And that includes the outreach process as well. Haywood. Thank you.'",
        "'speaker_0': 'Any other comment? We have a motion in a second.'",
        "'speaker_5': 'I just want to clarify.'",
        "'speaker_0': 'Certain.'",
        "'speaker_5': 'With Mr. DeLong with regard to going back to the Coastal Commission. You're okay with this, going back to the Coastal Commission level, or are you just talking at the staff level?'",
        "'speaker_4': 'No, just to.'",
        "'speaker_5': 'But to save those 20 spaces, would you be open to it going back to the commission level if that had to be done? It had to go back to the commission for an amendment of some sort. Would you be open to that.'",
        "'speaker_6': 'If coastal staff response to the city was that they fully support what we're trying to do, but they didn't have the authority and they would need to run it through the commission? Yes, I would support that. But there's no reason to take it to the commission if he the staff says absolutely not.'",
        "'speaker_6': 'And here's all the reasons why we wouldn't be if they.'",
        "'speaker_5': 'Object to it. Yeah. They're supposed to can't accommodate it, even at the commission level.'",
        "'speaker_6': 'Exactly. Okay.'",
        "'speaker_0': 'All right, members, we have a motion. The original motion as amended. It's seconded. Cast your votes.'",
        "'speaker_1': 'Motion carries seven votes. One vote. No.'"
    ],
    "Report and Presentation on State-Approved Fireworks Impacts.": [
        "'speaker_0': 'Thank you. I want to thank everybody who testified there was a long, bitter testimony, but you did a great job. Thank you. Now move to item 18. Read.'",
        "'speaker_1': 'Item 18 is a report from the fire department with the recommendation to receive and file a report on the plan presentation regarding the impacts of allowing the sale of safe the sale of safe and use of state approved fireworks care.'",
        "'speaker_0': 'Can I ask people just be try to be as quiet as you can as you leave before have Chief Terry or whoever was going to get the report. I just want to I'm going to have to leave early tonight.'",
        "'speaker_0': 'But I wanted to make a couple of comments on this issue. I know we're not going to vote to put it on the ballot. I know it's to receive and file and hear the report from the fire department.'",
        "'speaker_0': 'But I did want to signal to the proposer of this that I've got some real problems with this. First of all, I think that we're elected to either the city council or mayor or whatever to solve these problems.'",
        "'speaker_0': 'If we if you see it as a problem that should be dealt with, we should put an ordinance up here and craft the kind of conditions under which this should be done, merely putting something out to the public.'",
        "'speaker_0': 'Do you want fireworks or not? Doesn't it only be it doesn't even hardly begin the discussion. For example, you'll hear from Mr. Terry. I'm sure that other cities who have brought these back have a substantial cost for clean up and for public safety.'",
        "'speaker_0': 'At a minimum, I would want a fee imposed here that would compensate the city for those costs. And that just begins the problem here. You know, you'll hear you'll hear from, you know, from Mr. James, from the PSA, who I have great respect for, that he's concerned that because it's hard to enforce this are impossible to enforce'",
        "'speaker_0': 'it. People think that they're negligent, that the the force is being negligent. I understand that point of view. But the fact is, we rely every day on people obeying the law and observing the law without having the law enforcement there.'",
        "'speaker_0': 'If you wanted to fully enforce every traffic law, you'd have to have an officer every quarter mile on every street. But we depend on people. So to say that because it's not enforced, somehow we should just take it off the books, I don't think that makes any sense.'",
        "'speaker_0': 'And to me, if you really want to do this either because your son's football team wants to sell fireworks or create stuff for other charities, I understand that. I think there are other ways of doing it, but I think we need to put the conditions under which that the city is not expend any money, that people are'",
        "'speaker_0': 'safe, that the neighborhoods are protected. Those are the conditions under which should be done. I think that should be in an ordinance putting this before the voters in this form. To me there's really nothing. So I want you have an opportunity to answer that.'",
        "'speaker_0': 'I just wanted to let you know that's kind of where I am right now. And, you know, this this this idea. It gives me great trouble, Mr. Terry.'",
        "'speaker_8': 'Mayor Foster council members on January 7th, the council directed staff, fire staff to come back to them tonight to give a report on the impacts of allowing for possibly for sale, use and possession state approved fireworks. We have a little presentation we'll go through right now for you in the next slide.'",
        "'speaker_8': 'State approved fireworks known by the hour, which are known by the fireworks industry as safe and sane are those that do not go up into the air, explode or move about the ground in an uncontrolled way. They have been approved by the state fire marshal for private use by consumers, and some examples include cones or sparklers under'",
        "'speaker_8': 'ten inches in length, smoke balls and spinners. The fireworks are approved for sale for a few days leading up to the 4th of July. State approved fireworks do provide some several benefits for our community, one of which families can spend the 4th of July holiday at home and avoid the crowds and traffic associated with going elsewhere to'",
        "'speaker_8': 'watch a planned show. The fireworks have been deemed safe for sale use in possession by the state fire marshal. The city of Long Beach could receive income from permit fees and sales tax, and the greatest benefit is perhaps to local nonprofit organizations.'",
        "'speaker_8': 'Nearly all state approved fireworks are sold by volunteers raising money for volunteer groups, as reported to us by phantom fireworks and TNT fireworks. The average gross retail sales for a stand location is between 22,030 $5,000, of which the nonprofit groups keep 30 to 35%, which equates to about 7000 to $15000 per stand.'",
        "'speaker_8': 'A survey of cities that have stands indicated to us that gross sales are near the lower end of that range, typically between 23,020 $4,000, meaning groups keep about $7,000 per stand. The potential profit, however, depends greatly on the number of stands and the proximity of the stands to one another, as well as a stands location.'",
        "'speaker_8': 'Some of these benefits have been outlined by information provided by the fireworks industry. Think slide 295 cities in the state. Permit the sale and use of fireworks or about 61%. 39 cities in Los Angeles County permit fireworks. That's about 44%.'",
        "'speaker_8': 'It means that a slim majority of cities in Los Angeles County, or about 56%, do not permit the sale or discharge of state approved fireworks. The cities in Los Angeles County that do permit fireworks are much smaller than Long Beach, and these cities typically average about 56,000 residents.'",
        "'speaker_8': 'Together, these 39 cities account for one fifth of the county's population. A majority of these cities, or 77%, contract with Los Angeles County Fire for Fire Services and 49% contract with L.A. County Sheriff's Department for their police services.'",
        "'speaker_8': 'Thus, most of these cities do not bear the costs associated with increased public safety demands. I want to point out here that we did reach out to Los Angeles County Fire and Orange County Fire Authority, and they did confirm that the costs associated with staffing up during that holiday period are borne by the county themselves.'",
        "'speaker_8': 'The assumption being, of course, that the contracts included those costs. The existing ban that we have in Long Beach is consistent with most large cities in California, examining the top ten largest cities. In California, of which Long Beach is one, we find that 70% of these cities currently ban consumer use of state approved fireworks.'",
        "'speaker_8': 'No city in Los Angeles or Orange County with a coastline permits the sale or use of state approved fireworks. Coastal cities attract large numbers of visitors to their shores each Independence Day. And even if the fireworks were prohibited on the beachfront, it's nearly impossible with existing staff to prevent their discharge on our shores.'",
        "'speaker_8': 'This creates potentially dangerous conditions on the beaches at night, contributes to litter on the beaches, and exposes ocean waters to toxic substances found in fireworks. Hold on a sec. So the following video shows the situation on the honor beach.'",
        "'speaker_8': 'You'll see a crowded beach filled not with only state approved fireworks, but also dangerous fireworks. And you'll see residents, including youth, engaging in unsafe activity with state approved fireworks, such as throwing them into the air. Over the video, you're going to hear 911 calls that are a sampling of what our dispatch office receives on the 4th of'",
        "'speaker_8': 'July holiday, with reports of trashcan fires and residents who believe that fireworks are actually gunshots or mortars. This is merely a fraction of all activity we would see if the fireworks were to become legal. Keep in mind that this video was created with the band, in effect, Dancing on the beach.'",
        "'speaker_8': 'This is a longer fire. We like to remind. The fireworks are illegal. Please note our 600 are at the intersections of what? Atlantic and Ocean. You've got a building here. It's like a.'",
        "'speaker_0': 'Four story.'",
        "'speaker_3': 'Building. And I just like to go on the roof, the penthouse, open area. They've got some type of pyros. I don't know. They're like open flames, and they're also launching rockets and all kinds of stuff.'",
        "'speaker_7': 'Sounds great upon the paramedics. What's the address of your emergency? 3900 Dispo Avenue. They're all standing in front loading fireworks, and the embers are going up on our roof. It sounds like mortar fire. Gunshots. Okay, hold on a moment.'",
        "'speaker_7': 'Okay. 103. It's just.'",
        "'speaker_9': 'Blown up. Car stands between Santa Ana. I'm the vision and camera in my shorts and so.'",
        "'speaker_7': 'It's about five people are setting off fireworks yeah interest and.'",
        "'speaker_10': 'You alley rear of 1929 Payne fireworks it went bad There's a fire.'",
        "'speaker_3': 'My first friend. Waiter Engine four. Looks like someone threw a homemade.'",
        "'speaker_0': 'Bomb over the wall here.'",
        "'speaker_7': 'It's at 645 Atlantic Avenue in the parking garage area. They have a huge fire going on inside of their dumpster. There's a bunch of teenagers throwing fire in and out of it. Are they fighting fire or firework fire or they were doing fireworks from the dumpster and now it's fire like a huge fire.'",
        "'speaker_7': 'One kid, my dad just burned his arms.'",
        "'speaker_8': 'Next slide. I discussed. Go to the next slide, please. If we could get our PowerPoint back up. I just saw the slides. Yeah, I discussed their personal injuries and property damage caused by fireworks at a previous council meeting.'",
        "'speaker_8': 'Therefore, I will not recount the numerous statistics that I relayed to you on this topic before. I would just simply offer here a few pieces of information that illustrate the harm that fireworks can cause. Next slide. The contents of fireworks include toxic substances that can accumulate in soil and water permitting.'",
        "'speaker_8': 'The sale, use and use of state approved fireworks will reverse progress. Long Beach is made in improving our air and water quality as far as water pollution, fireworks contain a number of toxic chemicals and metals these substances can accumulate in the soil and water.'",
        "'speaker_8': 'Perchlorate, a substance common in fireworks, has been known to cause groundwater contamination. As far as air pollution, fireworks are known to expel toxic chemicals into the air, and these elements are finally responsible, increasing agitation to those with asthma, heart conditions or other respiratory conditions.'",
        "'speaker_8': 'The particulate matter can also be problematic for seemingly healthy individuals, as some of these particulates are healthy and can remain in the lungs. Many Long Beach residents consider the noise produced by fireworks to also be a nuisance. Calls for service due to noise will undoubtedly increase.'",
        "'speaker_8': 'The police will not be able to address the complaints as it will be for illegal activity. The noise pollution disturbs animals. Domestic and wild like dogs have been reported to have run away, even jumped through screens or fences in order to escape from sounds that they hear on the 4th of July.'",
        "'speaker_8': 'This can lead to animals being injured by cars that may run into the street, and we could see an increase in calls to animal care and an increase in missing pets. Animal Care confirms that the days leading up to and following the 4th of July are among the busiest of the year for them in pounds nearly double'",
        "'speaker_8': '. Beginning on the 4th of July, they must schedule extra staff on the 4th of July through the sixth. And fireworks have also been known to disturb and disorient birds, causing them to leave their nests and sometimes collide with buildings.'",
        "'speaker_8': 'Next. The city of Huntington Beach, which is a coastal city located to the south of Long Beach in Orange County, decided to permit the sale, use and possession of state approved fireworks for two years, 2012 and 2013. The city experienced a number of negative impacts.'",
        "'speaker_8': 'Thus, at the conclusion of the two year pilot, the council voted to reinstate the ban. The city of Long Beach can learn a lot from the experience in Huntington Beach. Huntington Beach documented an increase in illegal fireworks or improper use of state approved fireworks.'",
        "'speaker_8': 'Progress had been made in 2010 and 2011 and decreasing fireworks as illustrated by the downward trend in confiscations in 2010 and 2011. This trend reversed in 2012 and 2013 when fireworks were allowed in the city. Confiscation of legal fireworks increased as a result of individuals discharging those improperly or discharging them in prohibited areas.'",
        "'speaker_8': 'The increase of dangerous fireworks is important. These fireworks have a great potential to harm individuals and damaged property by allowing state approved fireworks. Long Beach will almost certainly experience an increase in dangerous fireworks. Police and fire will have a difficult time distinguishing between the approved or dangerous fireworks complicating enforcements.'",
        "'speaker_8': 'The complicating factors put citizens and property at risk. Huntington Beach documented an increase in calls for service citywide as well. The first year, 2012, the police noted a 182% increase in call volumes when compared to the same day of the prior week.'",
        "'speaker_8': 'The fire department noted an 87% increase in emergency calls. Huntington Beach collected 680 cubic yards of trash on the beach alone after the 4th of July. That's equivalent to 170 of these dumpsters you see on the slide. Even though the beaches and parks were considered off limits, residents and especially visitors did not know this or chose to'",
        "'speaker_8': 'disregard the prohibition. This demonstrates that it's very difficult to place certain areas in the city off limits to fireworks. Enforcing geographic prohibitions would not only require that staff be dedicated to the area, but that there be enough staff to adequately patrol the area to ensure compliance.'",
        "'speaker_8': 'In staff reports, Huntington Beach noted that the city was unable to fully recover the costs of the police department, fire department overtime as well as cleanup by their public works and parks departments. Fiscal impact in Long Beach, a fee of 1500 dollars per fireworks stand, which staff tentatively proposes at this time, could result in a new annual'",
        "'speaker_8': 'revenue of $60,000, which would cover staff costs associated with permitting and inspection. The 1% sales tax on the sale of fireworks could result in additional revenue of about 14000 to $15000 if industry estimates are accurate. More likely, the resulting sales tax will be $8000 to $9000.'",
        "'speaker_8': 'However, it is believed that the city's cost for increased fire and police response, as well as public works and parks and Recreation and marine staffing for cleanup activities, would exceed the tax revenue generated from the sales. In. In.'",
        "'speaker_8': 'In the even in the event of a June 3rd, 2014, citywide runoff, the estimated cost of placing an advisory measure on the ballot and in the sample ballot booklet is $150,000. If there is no citywide runoff election, the estimated cost is $1.4 million.'",
        "'speaker_8': 'Excellent. So that said, the fire department recommends that the city council maintain the existing fireworks policy that has been in place for decades due to the risk of injury and property damage and adverse impacts to the quality of life for our residents.'",
        "'speaker_8': 'The environment and city services. Mr. Mayor. With that, I stand ready to answer any questions.'",
        "'speaker_5': 'Any Council comment. I believe this item is just a is this just a receiving file? Because this is simply a report from the fire department on on the last requested action. So I don't know if there's any councilmembers there as a councilmember, Councilmember Austin wishes to come.'",
        "'speaker_12': 'Thank you. And thank you, Chief Tory, for the very comprehensive staff report. I will commend you that it was very illuminating. It was dramatic and somewhat balanced. I do have a few questions because I don't. Despite what we've seen here, I am not convinced fully that that that we are number one.'",
        "'speaker_12': 'I'm convinced fully that we're not enforcing the ban that we have, particularly with those images that was put that that showed that fireworks were rampant at our on our beach. And I assure I'm one of the motivations for bringing this item forward for consideration.'",
        "'speaker_12': 'And in conversation by this council, in conversation for the city, is the fact that the the alarming number of calls service for service says that there actually take place during the 4th of July. And the the the the expectation of residents that that we are going to actually enforce the ban, saying that is not enforced and has'",
        "'speaker_12': 'not been enforced. I thought, why not bring this item forward for discussion, for consideration, for debate by the city and its residents to consider legalizing safe and sane fireworks with the simply because of the fact that they're everywhere throughout our city.'",
        "'speaker_12': 'Your own staff report identifies or defines safe and sane fireworks, which I think you you you backtrack from your original definition as a marketing ploy, but you define them as fireworks, which are approved by the state fire marshal that do not go up in the air, explode or move about the ground in an uncontrolled way.'",
        "'speaker_12': 'Your your graphic about showing the city of Huntington Beach clearly had a table where you said safe and sane fireworks and dangerous fireworks. So I'm I'm assuming that you don't believe the safe and safe fireworks are dangerous or you may be coming back off of your original position on that.'",
        "'speaker_12': 'And the fact if we could go back to that graphic, it would be very helpful because I think it actually the data shows us something else. It shows that when we actually do have safe and sane fireworks in the city of Huntington Beach in 2012 and 2013, the confiscation confiscation rate for the, quote, dangerous fireworks were far'",
        "'speaker_12': 'greater, which tells me that public safety police services were probably focused on confiscating and dealing with illegal fireworks. Those that are going to be more of a harm do more harm to structure and be more dangerous to children and to the public.'",
        "'speaker_12': 'And so I think that graphic was very telling in some respects. Further in your staff report, quote said It's not possible to respond to all request for service. Was that specifically for police or fire or both? I guess that's a question.'",
        "'speaker_12': 'That's a question.'",
        "'speaker_8': 'Councilmember. I can tell you that I can speak for the fire department. I'll let Deputy Chief Luna speak for the police department. But we have a team of four arson individuals that go out and patrol over the 4th of July holiday that look for fireworks to eradicate the use of fireworks that are not permitted in the city'",
        "'speaker_8': ', which is all of them. On July 3rd and fourth this year, our arson unit responded to 41 calls for service, cited nine persons for illegal fireworks and a check of their fireworks been revealed about 75 to 100 confiscated that they then turned into the state fire marshal's office.'",
        "'speaker_8': 'So we respond to all of the calls that we can. I would be willing to bet based on our arson captain this year. He can answer this as well, that we do not get to every single call that comes in related to fireworks.'",
        "'speaker_12': 'So your calls your response to calls for service? Actually, as a fire fire department, you actually confiscate fireworks as well.'",
        "'speaker_8': 'Our arson detail does. They're sworn peace officers. Yes. Okay.'",
        "'speaker_12': 'Thank you. Also, you were quoted in your staff report that said that it will, quote, will lead to a sharp increase in calls. And I have some challenges with that assumption because it may may I think it may lead to a sharp increase or an increase in calls, particularly in fire service.'",
        "'speaker_12': 'But when we look at police calls, if we are legalizing same and same fireworks that are probably more prevalent throughout our neighborhoods, throughout the city, calls will can be be decreased significantly, particularly if we educate the 911 operators and the dispatchers to ask the right questions.'",
        "'speaker_12': 'Are these fireworks on the ground or are they in the air? Are they going bang or are they whistling? I think it's it's very clear here that that there's an opportunity to to actually possibly reduce calls for service and refocus our resources on the dangerous fireworks here.'",
        "'speaker_12': 'And that is really the genesis and the motivation behind doing this this just this discussion here. I want to ask you two more questions for now. I love to hear from the public and my colleagues.'",
        "'speaker_5': 'Councilmember Anderson.'",
        "'speaker_4': 'Yes, thank you very space folks. Here are what we have in a year. Really, I think, you know, allowance, you know, the sale of state approved fireworks is very ill advised by that. You know, by their opportunities to raise funds through the sale of state approved fireworks is not worth the nuisance they did pose to residents in'",
        "'speaker_4': 'my district and in the city of Long Beach. Fireworks are dangerous. They are flammable, combustible and very appealing to those waiting to have the source of entertainment for a party. Unfortunately, many people get caught up in the excitement of the fireworks and forget about the danger that they pose by allowing people to buy these more frequently leaves'",
        "'speaker_4': 'room for more accidents and injuries. And making these and I think you guys can see that in the Boston Marathon that they had those fireworks, that they took all these things on and caused a bit dangerous where most people were killed and other incidents that came about.'",
        "'speaker_4': 'So I think it's something that we really seriously have to look at, not just in my district, think all over the city of Long Beach. It is a dangerous situation. And I think this is why we haven't, you know, made these things legal at this point.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_5': 'Thank you, Mr. Andrews. The members of the public wish to comment. Good lineup. You have 3 minutes.'",
        "'speaker_6': 'Figures.'",
        "'speaker_3': 'Woman No. Fireworks are fun. Yeah. You know, I find it's a celebration of life. And above all, in celebration of our great revolution. It's our most patriotic holiday. I will get just sit by and watch fireworks off the shoreline that indulge their beauty.'",
        "'speaker_3': 'That in itself. When you go to buy them, you're actually helping people. Why do you why restrict something that helps people? The donations go to good causes. More heart, more. Hyman would be done in decimating fireworks than it would it allowing them.'",
        "'speaker_3': 'We have restrictions against smoking. That's always dangerous. But why don't. Why do you want to have a restriction on fireworks, too? That's. That's our holiday for enjoyment. It offers a little danger, I tell you. Maybe we should. Maybe we should outlaw football because a lot of people get injured in that.'",
        "'speaker_7': 'Near here.'",
        "'speaker_3': 'And that goes, you know, good car that fills the pockets of the athletes. No, I think fireworks are just wonderful. I think kids love them. Maybe we should follow the paradigm of L.A. City, which is advanced in many, many ways, more than even we are.'",
        "'speaker_3': 'Their paradigm restrict some, but not all. And there are there are some points that they make in regards to that. They. The point that Mitch Austin makes that they're everywhere should. Yes, there's something right about it. If they're everywhere in Iran, why are they so popular?'",
        "'speaker_3': 'We should not restrict fireworks. It's unpatriotic. It makes. A holiday less participatory. And celebrates America. Power. Love. And of country. And above all, freedom.'",
        "'speaker_9': 'Council members.'",
        "'speaker_3': 'And.'",
        "'speaker_7': 'Mayor. Sit in. My name is Angela and I have lived in.'",
        "'speaker_9': 'Long Beach for a very long time and.'",
        "'speaker_7': 'I have always enjoyed the fireworks.'",
        "'speaker_9': 'From afar. Safe distance. However, I cannot say that our dogs enjoyed it. In fact, we had to buy a tranquilizer. It was named as one of the detriments of fireworks. And as a lifelong animal lover, I can say that it's not just the dogs.'",
        "'speaker_9': 'It's not just the cats, it's horses. And yes, it also affects me when a cherry bomb goes off in my alley or on the beach. And it doesn't stop when everybody wants to go to bed.'",
        "'speaker_7': 'It continues and it continues for days. I find it very stressful.'",
        "'speaker_9': 'And I would like to encourage you to vote against the having Long Beach, allowing that people can buy and fire off dangerous fireworks by themselves. And you know, the statistics in hospitals, how many people do get injured and yes, animals get injured by getting out of the yard, running away in fear.'",
        "'speaker_9': 'And so please keep language safe. It is not as safe as it could be. As long as Lakewood sells it legally and Long Beach residents go and get the stuff and bring it to Long Beach, it's already out of control to a large degree, so let's not increase that.'",
        "'speaker_9': 'Thank you. Hi. My name's is Carbon. I've lived in Long Beach for about 1520 years and I've been a technician at an animal hospital for about the same amount of time. And I can vouch that hundreds of thousands of animals are killed every year from fireworks and.'",
        "'speaker_9': 'Personally, I can't really enjoy em because I know how much it's bothering every creature on the planet. When. When these things are going off. And there's. Statistics are all over the place proving how many shelters get filled up every 4th of July with with dogs and cats that break through glass and run across the street.'",
        "'speaker_9': 'Get hit, get lost. A client of mine's dog broke out of his yard and fell over dead from a heart attack just because humans wanted to be entertained by fireworks. And to me, that doesn't that doesn't make any sense at all.'",
        "'speaker_9': 'With all the. Things that we can do now for entertainment. There's there's things like laser that are quieter and doesn't have fire. And there's just so many reasons to not have them. I think it's pretty selfish to to do it anyway.'",
        "'speaker_9': 'I mean, it bothers a lot of people. Children with asthma, they're they're toxic. The fumes come downwind and. There's just so many reasons to not have known. Three nights ago I was walking my dog and a cherry bomb or some kind of thing landed right behind us on the sidewalk, and he broke out of his collar and'",
        "'speaker_9': 'ran all the way home. And I went back to the house where it came from, and they just denied that they did it. And I know it's impossible for law enforcement to stop that, even with them illegal. We have a huge problem on the 4th of July on the peninsula.'",
        "'speaker_9': 'The police, there's not enough to be there to stop. And the fire department's down there trying to stop illegal fireworks. I mean, I just can't even imagine what it would be like if they were legal. I mean, there's just not enough people to to manage it.'",
        "'speaker_9': 'And it's like putting guns in serial killer's hands. People are going to do something stupid if they're allowed to buy fireworks. And that's just human nature. And please, please don't pass this. Thank you.'",
        "'speaker_7': 'Thank you for being here. On the fireworks issue, I vote no on putting it on the ballot on state approved fireworks in Long Beach. I live next to Naples Elementary School, which is already a war zone with illegal fireworks going off and explosive litter in the weeks leading up to the 4th of July.'",
        "'speaker_7': 'We're not talking about one night of fireworks, of sparklers. People begin getting it, getting it into their hands before the fourth. And the problem starts early for the understaffed and underfunded shelters. I'm a rescue volunteer and they beg us weeks in advance of the 4th of July, please come and take the animals, because they're having to put'",
        "'speaker_7': 'them to sleep, to clear the decks for animals that are going to be coming in. And after the 4th of July, the animals that are dead in the streets and again, they're crowded. They have no chance of getting adopted because of the onslaught of animals coming in.'",
        "'speaker_7': 'So, please.'",
        "'speaker_5': 'Thank you. Now, can you just identify yourself for the record?'",
        "'speaker_7': 'Louise Montgomery. Thank you. Third District.'",
        "'speaker_3': 'Got it.'",
        "'speaker_7': 'I'm Lynda montgomery. Ditto to what everyone said. I know that. You know, the people that get hurt with fireworks, it's usually kids, in which case the parents are responsible. You know, as a kid, I saw somebody get hurt with fireworks, so I've always been kind of afraid of them.'",
        "'speaker_7': 'Anyhow, I saw a kid get his toes blown off and that's always, you know, sort of stayed in my mind. I saw another kid have firecrackers throw down his pants, you know, again. So that's embedded in my mind.'",
        "'speaker_7': 'But the big problem is also adults. I mean, they're stupid adults. But on 4th of July, I mean, I'm the first one to confess I'm sometimes stupid to because we drink. Everybody's at these house parties and they're drunk and they're fooling around with firearms.'",
        "'speaker_7': 'Hello. We don't let people drink and drive, but we let them have fireworks and drink. I don't know. It just doesn't make sense. I mean, we're a smart city. You're a smart council. I can't believe that we're even talking about this issue.'",
        "'speaker_7': 'It's so stupid. But anyways, please vote against it. Thank you.'",
        "'speaker_5': 'Thank you for your candor.'",
        "'speaker_7': 'Yes, I do. I follow Linda. I'm Kate Karp, and I live near Belmont Shore. A while ago, one of my dog of one of my friends burst through a plate glass window and went looking for her mistress because of a firework.'",
        "'speaker_7': 'Whether it was safe and sane or unsafe and stupid, I don't know. But this this was just an example of what everybody else has been saying. My fear is that allowing safe and sane fireworks, so-called safe and sane fireworks, and I'm qualifying them as such because there really isn't any such thing, as our chief pointed out in'",
        "'speaker_7': 'the city, is going to open the door for anything goes. And to me that means anything that goes boom. It's going to be a lot tougher to enforce the laws that we have now. And Councilmember Austin, let me tell you something.'",
        "'speaker_7': 'About four years ago, they decided the city was going to have a crack down on the fireworks. We had a bunch of pinheads who lived across the street who were just the scourge of the neighborhood. We got rid of them because of that ban.'",
        "'speaker_7': 'They were out there. They were stupid enough to throw one in front of the police car that came down when we called them and they wound up out of there after anywhere from a 3 to $5000 fine. So.'",
        "'speaker_7': 'Yes, thank you. Police department. They did. I live near the shore and it's bad enough there. But I have a friend who lives in Lakewood where they do sell fireworks. And she lives in an otherwise quiet residential neighborhood where there are no draws, such as bottle rockets on the beach.'",
        "'speaker_7': 'And she said that they're neighborhoods, a war zone on the 4th of July. This is where they sell illegal fireworks. And furthermore, and this is, you know, close to everybody's heart. It's the animals. I worry about the animals, as our chief said, the animal care services manager.'",
        "'speaker_7': 'He showed you the stats, how they went up and so did the dogs. And this is going to further increase with your your holiday at home. Everybody's going to be setting them off. And that's what we're looking forward to.'",
        "'speaker_7': 'It just seems to me that it's the height of folly to support a measure that's going to cost about $15,000 a year to get on the ballot when it comes to discretion on this issue. I'm listening to our fire chief.'",
        "'speaker_7': 'Let's not take a step backward. Thank you.'",
        "'speaker_5': 'Well to the late Judy.'",
        "'speaker_7': 'Hi. My name is Jenny Warner and I live at 1084 Mahana, which.'",
        "'speaker_9': 'Is Midtown area. I belong to a neighborhood association that basically has four council districts in it. And I can tell you that there's no such thing as 4th of July. It's it starts in June and it ends in May.'",
        "'speaker_9': 'It's like every year when I.'",
        "'speaker_2': 'Moved here four years ago, fireworks.'",
        "'speaker_9': 'Were a huge problem.'",
        "'speaker_7': 'Basically, since Commander Rocky has taken.'",
        "'speaker_9': 'Over, I want to give him a lot of credit. There's been a lot more.'",
        "'speaker_7': 'Enforcement and the list last year was actually very enjoyable. There were just a few apartment buildings that were problems. I have had my hedges catch on fire.'",
        "'speaker_9': 'It's not as bad as where I used to live. In Koreatown, where my roof caught on fire. But safe and sane fireworks in L.A. were just crazy guns being shot. Long Beach is so much better. I really.'",
        "'speaker_7': 'Urge.'",
        "'speaker_9': 'Everybody, just like Deandra said, to vote no on this.'",
        "'speaker_7': 'I worked in hospitals. I ran disaster program.'",
        "'speaker_9': 'I've seen people, little kids come in with their hands split open from the little pole.'",
        "'speaker_7': 'Kind of poppers. I worked for our Medical Reserve Corps.'",
        "'speaker_9': 'I am involved with Surfrider. We've seen the trash impact.'",
        "'speaker_7': 'There's just a.'",
        "'speaker_9': 'Lot of considerations. And 4:00 in the morning, sun waking up to huge fireworks going off right over my house is not fun. I can see the Queen Mary displays from my house. That's fine. Thank you very much.'",
        "'speaker_7': 'But good evening, everyone. I'm Judy Crumpton and I reside in the Forth.'",
        "'speaker_2': 'And my addresses on file.'",
        "'speaker_7': 'And I'm here basically to support what our fire department and police department have already brought forward all the reasons why we need to keep this band. I really like what Councilmember Andrews and our mayor had to say. I echo the thoughts of everybody that has come up here.'",
        "'speaker_7': 'The previous speakers, they've really said it all. I do have great concerns for our children and our animals.'",
        "'speaker_2': 'Safety, it's all been said.'",
        "'speaker_7': 'What happens to animal care services? All animal control services throughout the country suffered dramatically because of one holiday. I'm a patriotic person too, but I put safety for children and people and animals before any tradition on earth. I would just like to say to that I don't appreciate the pollution that will definitely increase dramatically.'",
        "'speaker_7': 'And there are wonderful fireworks displays everywhere. They're terrific. So, yes, it's nice to be at home and have a holiday, but it's not so great if it's not safe and kids are getting hurt and they do all the time.'",
        "'speaker_7': 'The emergency rooms at hospitals are loaded with kids that have lost fingers and eyeballs and and so many animals are killed from from the fear. I know my husband. We cannot go out on the 4th of July. We stay home with our dogs because they are so drastically afraid.'",
        "'speaker_7': 'We have to keep the, you know, the radios up and the TV's up. And also, I want to say, it's not just the fourth people start this nonsense like two weeks ahead of time. A week later, neighborhoods suffer for sometimes because I know my neighborhood does and we don't even bother calling the police department cause we know'",
        "'speaker_7': 'they're so busy. It's not that they don't want to come out and help. They're just so busy with phone calls. They can't. They can't do it. Why can't we just find a better way to enforce our ban? You know, why are we even considering increasing a problem?'",
        "'speaker_7': 'We already have a problem, you guys. Why are we even considering this? So I'm sorry, Councilmember also, but I think this really stinks. Thank you.'",
        "'speaker_3': 'Mr. Double, Vice Mayor, members of the Council. Steve James, President of Long Beach Police Officers Association. You know, obviously, this is a very emotional issue for people. I'm a dog lover. I've got a dog now. I've had two dogs before.'",
        "'speaker_3': 'I lived in Long Beach for, I don't know, 35 years. We always had to sedate our dogs, but there was a ban, but I had to sedate my dogs. I now live in Westminster. When I moved there, fireworks were illegal.'",
        "'speaker_3': 'Safe and sane. State approved were illegal. I had to sedate my dogs. Now they are legal. I still have to sedate my dogs. You're going to have to sedate your dogs on the 4th of July if your dogs need to be sedated, whether this passes or doesn't.'",
        "'speaker_3': 'So I have the utmost respect for these folks. The things that I mean, there's a very good friend of mine sitting back there that does a lot of great work with animals, but I don't think that really is the issue here.'",
        "'speaker_3': 'I want to see a little bit of full disclosure. I work at a fireworks stand in the city of Westminster that raises money for my son's hockey program. I'm not at all interested in a fireworks stand in Long Beach.'",
        "'speaker_3': 'The PIO doesn't want one. Steve James doesn't want one. But I want to talk a little bit about we need to separate two things. The stuff that is illegal in the state of Long Beach is 95, 98, maybe even 99% of what you've heard the problems are.'",
        "'speaker_3': 'We don't they don't sell cherry bombs at a fireworks stand. They don't sell things that explode. They don't sell things that go up in the air. They don't sell things two months before the 4th of July. So if you're having these problems, these problems are not from the fireworks being sold from a fireworks stand.'",
        "'speaker_3': 'I'm not saying that some of those products don't cause these problems, but for, I don't know, 20 years of my life, I got in the car with my dad. We drove to Lakewood, we bought the fireworks. We brought them back into Long Beach and we had a great time and we let them off.'",
        "'speaker_3': 'We are criminalizing. Law abiding citizens with this law. If you put this on the ballot as an advisory, non-binding advisory vote, what you're afraid of is that about 60% of the public is going to tell you that they want these things.'",
        "'speaker_3': 'Why? Because 50% of them are already using them. 10% are afraid because they are such law abiding citizens. Unlike my parents, they won't go buy them. And in Lakewood. We don't need to criminalize these folks. We can't enforce this.'",
        "'speaker_3': 'We cannot enforce this. We don't want to enforce this. You don't want us to enforce this. I am not going to go and take a box of $50 fireworks that were bought at a fireworks stand from a ten year old child and his parents.'",
        "'speaker_3': 'I'm not going to. That's not the impression we want this ten year old child to have of the police. The other thing is, I'm going to get dispatch when that kid has a sparkler in his hand, even under adult supervision.'",
        "'speaker_3': 'And now I'm at that call instead of going to the call where the fireworks are going up in the air, where things are exploding. So this is to me, we need to take some of the emotion out of this and we need to take some of the rhetoric out of it.'",
        "'speaker_3': 'The presentation, with all due respect to my very good friend who is the fire chief. Huntington Beach had 170 dumpsters of trash. Okay. What did they have when fireworks were illegal? 164 dumpsters of trash. I mean, that that doesn't show me that that we're getting anywhere.'",
        "'speaker_3': 'If there's no runoff, there's going to be a runoff. All of you people running for mayor, I think, are well aware there's going to be a runoff. So we don't need to talk about $1.4 million in cost. I know the light's red.'",
        "'speaker_3': 'Just because you don't like what I have to say doesn't mean you have to be rude.'",
        "'speaker_5': 'I think they're saying your lights on. That's what they're the lights on. It's actually been on for about 30, 45 seconds.'",
        "'speaker_3': 'I apologize. But I will just tell you, you're putting police officers in a spot that they cannot be successful. If we take the fireworks, we create enemies. If we don't take the fireworks, we create enemies. It's just a terrible spot to put us in.'",
        "'speaker_7': 'My name is Bill Endicott, and I live in Belmont Shore. When we came here 30 years ago, we had a lot of problems with fireworks. Thanks to the excellent work of the police officers and the fire department. And thank you for your good presentation.'",
        "'speaker_7': 'Cheap battery. We're now down to a fairly quiet situation. Each year it has gotten better. I think what's missing in the discussion here is if you have fireworks stands around the city of Long Beach, the message to the public is, oh, we've changed our mind.'",
        "'speaker_7': 'It's okay to set off fireworks. You can buy them here legally and you can set them off. And the public doesn't know which is safe and save and which is not so. Once you open the door to fireworks, you're going to have more and more of them.'",
        "'speaker_7': 'And I certainly agree with the people who have so much trouble for their animals. I have friends who have to take their dogs to a veterinary place for the weekend of before and after the 4th of July. So we urge you not to spend the money to put this on the ballot.'",
        "'speaker_7': 'There are good ways to raise money. We've got Girl Scouts selling cookies. We've got people selling candy. There are ways to make money for non-profits that are more acceptable. And I urge you, these are dangerous. It'll just open the door to more.'",
        "'speaker_7': 'And please listen to your police and fire. Our police commander does a great job in trying to suppress fireworks and we appreciate it and thank them. So thank you very much.'",
        "'speaker_8': 'Good evening, Mayor and Staff John Kelly, vice president with TNT Fireworks. I'm a resident of Huntington Beach. Make a couple comments to that effect in a moment. A couple of comments on some of the slides shown earlier. The top ten cities, I would point out Anaheim voted unanimously about a week and a half ago at their city'",
        "'speaker_8': 'council meeting to put the issue of fireworks to their voters. In June of San Jose and in Mercury Times in August, Mayor was quoted stating, Our ban is not working and we need to seek some alternate alternatives. And staff is currently studying that issue.'",
        "'speaker_8': 'And while in Southern California, we don't have any cities that rival Long Beach in population, cities like Fresno, California, do and have been selling very successfully since the early 1990s. Want to comment a little bit on the Huntington Beach, one of the slides showing that 166 of dangerous and illegal fireworks were confiscated.'",
        "'speaker_8': 'I want to call to your attention some efforts by a task force that was formed in Los Angeles County by the El Monte Police Department, along with some other supporting agencies. The city of El Monte had a very serious fireworks problem and the task force set out in March of 2013 to do something about it.'",
        "'speaker_8': 'They confiscated over 44,000 of illegal fireworks in a three month period. Clearly, illegal fireworks is a big problem in California. It's a huge problem. It's a huge black market. They do much more business than I do in this state.'",
        "'speaker_8': 'They're not subject to the restrictions that I am for stores, not subject to the sale periods they operate of seemingly with impunity. A couple of comments in closing on the staff report. On the first page, we make a reference to licenses, sales tax and possibly a surcharge.'",
        "'speaker_3': 'Would serve to offset additional.'",
        "'speaker_8': 'Safety costs. And yet nowhere in the remainder of the report do we offer any dollar amounts for those surcharges. I know that I provided staff with examples of cities that charge surcharges to the retail consumer. Those vary anywhere from 2 to 7%.'",
        "'speaker_8': 'So you do the math on those retail sales and you're talking anywhere from 20 to as much as $90,000. And I would question if that would assist in offsetting some of the clean up and enforcement costs. And finally, it states.'",
        "'speaker_3': 'In the last paragraph that.'",
        "'speaker_8': 'A sample ballot would be $150,000. I was at the last city council meeting. It was reported it was 65,000. I'm curious why the increase? Thank you very much for your time.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_10': 'Hello. My name is Vince Watson, and I've been a resident of Belmont Shores since the mid seventies. And I'm here to strongly oppose any sort of legalization of fireworks. I'm a homeowner, business owner, pet owner and the president of a501c3, which is a nonprofit.'",
        "'speaker_10': 'So I'm very familiar with the needs for raising funds, but I don't think this is the way and I'm not a fund hater either. I'm not unpatriotic. But you know, the old adage about you can swing your arms as much as you like until you start hitting people in the face.'",
        "'speaker_10': 'And I think that's where we're at with this. I mean, this is this is people pointed out this goes on a long time. It's it's not a daily thing. I do a one day thing, but I'm representing myself, my family and my neighbors and friends who strong who also agree with me that this is just not a'",
        "'speaker_10': 'good idea. The potential for injury, fire, property damage, vandalism far outweigh any temporary economic benefits to the city from the first and inevitable lawsuit that will follow would eliminate any monetary gains. It also encourages people to come from outside the city, converging on Long Beach with the idea that now it is fireworks friendly, whether they be legal'",
        "'speaker_10': 'or not. And I don't see any evidence that any of these people have our best interests when they do come into the city, as has been documented in Huntington Beach and so many others. I actually, you know, and if you remember, there were two homes that were damaged and or destroyed back in Lakewood within the last ten'",
        "'speaker_10': 'years, probably five or eight years, I don't remember. But someone was actually prosecuted because their fireworks caught fire and did burn homes in a neighborhood. Negative environmental impact has been documented. I mean, realistically, we've heard from professionals, police, fire, city attorney, I don't know this, but I'm assuming the city is not really big on this or the'",
        "'speaker_10': 'city manager. I know animal control is not. These are the professionals. And it seems to me that we should be listening to them. It's a it's a potential step backwards and a liability to the city and the citizens.'",
        "'speaker_10': 'To me, this is the kind of logic of stepping over $100 bill to pick up a dime. It just does not make sense. Thank you.'",
        "'speaker_7': 'Hello. Kelly Edwards again, still downtown Long Beach. I just will be real quick. I just wanted to bring up a couple of things. I was interested to know what the percentage was of when people get fined, of what the percentages of those that actually pay those fines.'",
        "'speaker_7': 'I think that's something that we should look at because maybe if we just have more officers that are hired at that time to really hit our cities hard. Make a statement in the next couple of years, we'll start to see that decline.'",
        "'speaker_7': 'Also, the other thing I just wanted to bring up with in regards to Councilman Austin, I understand that you were talking about educating the nine on one employees. Problem is, is that those that are calling in aren't educated.'",
        "'speaker_7': 'So they're not going to know if it's a cherry bomb, a gunshot or just sparkler that's going off. They could just completely be freaking out and exacerbating the whole situation to where the nine on and most of the time they're not even seeing it.'",
        "'speaker_7': 'They can only hear it. So even with educating them on that is going to fall short when the caller is informed themselves. So thank you for your time.'",
        "'speaker_4': 'Good evening. I've been hearing this argument and I guess I would have to say I'm somewhat neutral due to the fact that, oh, by the way, my name is Hadi Mohammed. And this situation, me personally.'",
        "'speaker_3': 'When I was younger with black convert, I used.'",
        "'speaker_4': 'To, you know, set off fireworks. However, when I hear Councilman Austin and the fact that in this room tonight, I don't think we're qualified to speak for the entire city of Long Beach. And believe it or not, there's some pro, there's some con.'",
        "'speaker_4': 'There's a lot of bad things like in boxing, people fighting it's entertainment. But sometimes people get killed or sometimes you see blood splatter. I believe that this is a situation that needs to go to the voters. Me personally, I don't set off fireworks.'",
        "'speaker_4': 'It's not my thing. However. Maybe there are people who do care about this or who do want to set off fireworks. And I believe that it should be done by popular vote. Thank you.'",
        "'speaker_5': 'Great. Thank you. No more public comment. Council member Neil.'",
        "'speaker_8': 'Thank you, Mr. Pro-Tem. And I would like to thank everyone that has come up and spoke on this issue. This is, as you can see, there is a lot of emotion around this. And I believe I'm not speaking for Mr. Olsen, but I believe his point in bringing this forward was to create this dialog and to really'",
        "'speaker_8': 'look at a situation that, as the head of our police union has said, is not enforceable as it is. All of these things are happening anyway. So the question in my mind is. Is there is there room for the city to benefit?'",
        "'speaker_8': 'And is it worth us investing in. And that you know that. That's a decent question. Right. Because regardless of what we decide today or tomorrow, next year on the 4th of July, all of our animals are still going to be running scared.'",
        "'speaker_8': 'And there are going to be fireworks going off in our neighborhood. It's going to happen. So the question still remains is, is there an opportunity for the city to benefit and.'",
        "'speaker_4': 'Bye. If we were to choose to do a safe and sane.'",
        "'speaker_8': 'Fireworks, does that put the police in a better position to their assumptions? But does it really make it easier for them to go after the unsafe fireworks? Those are the two questions that I have. And I want to thank all of you for your testimony.'",
        "'speaker_8': 'But I'm still left with as many questions.'",
        "'speaker_4': 'As I have before we set out here. Thank you.'",
        "'speaker_5': 'Thank you, Councilmember Neal. You know Councilmember Dawn.'",
        "'speaker_6': 'Well, could we ask Deputy Chief Luna to answer that question?'",
        "'speaker_5': 'What specific question would you like them to ask?'",
        "'speaker_6': 'Answer Councilmember Neal said he had a couple of questions. One of them had to do with whether or not it made it easier or more difficult for the police department to manage this. And I guess I'd like to hear from the police department what their answers.'",
        "'speaker_8': 'Councilman Neal, what you might know, repeating.'",
        "'speaker_3': 'The specific question, please.'",
        "'speaker_8': 'Sure. If we were to have safe and sane fireworks, would would your department be better poised to go after illegal fireworks?'",
        "'speaker_4': 'It's going to be very difficult in the.'",
        "'speaker_3': 'PMA, president stated earlier.'",
        "'speaker_4': 'It puts us in a difficult position.'",
        "'speaker_8': 'Either way when we get out there and we do respond. I would say just talking about the 4th of July itself, our call volume increases between 18 and 20% just for fireworks. People are going to call people are going to call whether they are the illegal kind or what could be deemed illegal.'",
        "'speaker_8': 'It's very difficult to determine. And when they get there, the officers would make the best determination possible. But what we got to look at from a public safety perspective is that the 4th of July hands down, is the busiest day of the year for the Long Beach Police Department.'",
        "'speaker_8': 'We quadruple the number of officers that we put in the field. And it's not only to deal with firework enforcement, that's only part of it. We deal with an influx of several hundred thousand people that come to our beachfront.'",
        "'speaker_8': 'So we're dealing with a lot. The men and women of this police department do an outstanding job. They do enforce firework violations. The citizens of this city call over and over that they are perturbed by this nuisance and the officers do a pretty good job year after year of going out and trying to enforce what they can'",
        "'speaker_8': '. Although they do get put in a difficult situation.'",
        "'speaker_6': 'So I guess I'm not clear. Will the police department be better off or worse off if the city permits safe and sane fireworks?'",
        "'speaker_8': 'The position of the police department is that if if this were to pass, we believe it would put us in a more difficult situation moving forward. And we believe that because I don't see the call volume going down.'",
        "'speaker_8': 'Actually, I see probably and I can't prove this until it happens that the call volume would potentially go up. We still have to respond to citizens calling us regarding fireworks, firecrackers being heard or observed.'",
        "'speaker_5': 'Thank you. Thank you, Mr. DeLong. Any further counsel comment? Do we have a motion on the same you?'",
        "'speaker_6': 'I'll make the motion to with recommendation, receive and file a report.'",
        "'speaker_5': 'Actually, the recommendation is well, it's actually approved recommendation, but it's really receiving files for it should.'",
        "'speaker_6': 'Be so moved.'",
        "'speaker_5': 'Council member Austin wishes to comment. Good.'",
        "'speaker_12': 'And for the record, I did second to the motion. I do agree we should receive and file this motion and staff report. I think at issue here is over the last eight years, we've actually lost 200 officers due to attrition, due to cuts.'",
        "'speaker_12': 'And that is a real problem with our enforcement efforts here in the city of Long Beach. I don't know that fireworks are more prevalent today than they were eight years ago, those. But I've lived here for the last eight years.'",
        "'speaker_12': 'And I will tell you, based on my experience as a resident, as a pet owner, as a homeowner, and as a as a as a vested stakeholder in this community in a city, I don't believe that the volume has has decreased even with the or the the the less number of police officers on the streets.'",
        "'speaker_12': 'Today, I think it was as high eight years ago as it is today. And I would just say that I don't believe that we are doing an adequate job of enforcing this. With all due respect, I think we we have the best police department in Southern California, not the state of California.'",
        "'speaker_12': 'I think they do an excellent job keeping our city safe. But I want them to be able to direct their resources in a manner that is smart and is efficient and that really goes after the dangers in our community.'",
        "'speaker_12': 'Safe and safe fireworks are are state approved. They are legal in the state of California. And I hear you, I've heard you. And I appreciate everyone that came out to the comment. I appreciate the letters that I received both pro and con, on this issue.'",
        "'speaker_12': 'I've heard a lot of good, good dialog over the last few weeks. And so I think I've been successful in one way, inspiring a conversation. I'd like to see this go to the ballot, quite frankly, because I think it deserves a hearing and airing among the voters here in the city of Long Beach.'",
        "'speaker_12': 'This is a statewide issue. If you want to ban fireworks, if you want to, you know, really clean this up and then maybe this is something for Sacramento. And I know a couple of you may be listening to me right here, but, you know, several several cities already have made this are recognizing safer same fireworks.'",
        "'speaker_12': 'And the youth organizations, the service organizations, the nonprofit organizations in those cities are benefiting from the sale of save the same fireworks. The point is duly noted there. Girl Scout cookies and their bake sales and candy sales that work.'",
        "'speaker_12': 'I can tell you, as someone who is a parent of two very active young, young, young kids, they they don't raise enough money. And every one of these organizations is struggling to raise money out there, at least from my experience.'",
        "'speaker_12': 'And I've been involved in youth football, track basketball. PETA's every organization dealing with our youth community based organization today are not raising enough money to meet their needs today. And I'm sure that something like this could serve as a shot in the arm for those those organizations.'",
        "'speaker_12': 'Now, listen, I'm not this is this is not something that I'm going to die on a sword over. You know what I mean? If the voters in the city of Long Beach say no to circus and fireworks, I'm fine.'",
        "'speaker_12': 'I'll move on. But I think it's worthy of their consideration. But with that, I. I'm going to second the motion to oversee the vote. Also, I want to just just point out that the the image here on the beach, on our shores was was deplorable.'",
        "'speaker_12': 'The sea, the bottle rockets, the sea, the fireworks, the see, the blatant disregard for our law and our ordinance right there in our face, on our beach, was not a pretty sight and it's not a pretty sight. Each and every year, let's focus our police officers where they can do their jobs, where they can actually go after'",
        "'speaker_12': 'it. Protect our resources, protect our shores, protect our beaches, protect our assets in the city of Long Beach. That's what I like to see our police officers focused on doing and not running around the city chasing fountains, you know, fountains that are harmless in our neighborhoods.'",
        "'speaker_12': 'I spent the 4th of July last, last year in a bank parking lot in Lakewood and firing off fireworks with my kids and feeling really guilty about it. You know, like I was doing something wrong, you know, I was doing something wrong.'",
        "'speaker_12': 'I mean, I don't think I was violating the law in Lakewood, number one. But when.'",
        "'speaker_6': 'My next door neighbor shoots in my.'",
        "'speaker_5': 'House, Mr. Austin has the floor. We don't need exchange back and forth.'",
        "'speaker_12': 'Well, thank you. But but I think I mean, I'm a law abiding citizen, and there are several other law abiding citizens throughout this city who ask the same question each and every year. Why do I have to feel guilty or.'",
        "'speaker_12': 'Or Why do I have to go to another city to do something that is illegal, that is legal in the state of California, but illegal in our city? You know, and so that's the question. Again, it's about enforcement.'",
        "'speaker_12': 'It's about being smart with our resources, focusing our resources on the issues that truly matter. I heard from Chief Luna, and I appreciate that our police officers are dealing with crowd control issues. They're dealing with illegal fireworks. They're dealing with gunfire.'",
        "'speaker_12': 'They're dealing with violence. Those are the issues that I want to see our police officers focused on and not, you know, breaking up block parties and, you know, family, family fun on the 4th of July. I want to remind you that fireworks are an American tradition.'",
        "'speaker_12': 'It's something to celebrate it. We gather in big places throughout this city to to watch firework displays and celebrate that. And so I think in some ways, we are we're we're backpedaling and depriving our children, our neighborhoods, our citizens from a liberty that is enjoyed by most other Americans.'",
        "'speaker_5': 'Thank you, Mr. Orson. Rather passionate. Councilmember Lipski.'",
        "'speaker_2': 'What can I say? I'm opposed to actually making it legal. I do think that it's fraught with all kinds of problems, not only from the nursing standpoint of what it does to kids and the injuries that it causes.'",
        "'speaker_2': 'But also, quite honestly, I do think would make it much more difficult for fire and police to respond to legitimate concerns of gunfire and other things that do happen around the 4th of July. What? Mr. Johnston Actually, what I'm I'm curious, though, why isn't why wouldn't you just write an ordinance, see if you've got the votes on'",
        "'speaker_2': 'council? You can always take it out to the voters for ratification. You can always ask them after the fact if this council approves it, which it may or may not. Then you can go back and ask the citizens if they support it.'",
        "'speaker_2': 'But I think to spend the money, energy and time to go ask an advisory doesn't move this issue anyplace. It just simply sets up a lot of campaign contributions. But it certainly doesn't do anything to get the issue.'",
        "'speaker_12': 'You probably could benefit from that. I'm not running. I won't do anything right now.'",
        "'speaker_4': 'Just to be clear, was that a question? Yes, ma'am.'",
        "'speaker_5': 'Orlando Councilmember Lipski has the floor.'",
        "'speaker_2': 'My question is that if you feel this passionate about it, why not just bring it forth as a council item for an ordinance? Let the council vote up or down on it. You can always take the results to the voters afterwards.'",
        "'speaker_2': 'But I just think let's you know, let's move forward on it.'",
        "'speaker_4': 'Can I just ask a point of clarification.'",
        "'speaker_12': 'On how you would do that, write the ordinance and then take it to the voters for even for people.'",
        "'speaker_2': 'Mr. Perkins, you can clarify this. If, in fact, this council does pass something, we can ask for it to be. Is that correct? We can ask for the.'",
        "'speaker_5': 'Mr. Parking. Could you opine on that?'",
        "'speaker_6': 'Yes.'",
        "'speaker_8': 'Mayor of members council member on down members of the council. The. It's similar to asking for an advisory opinion on an ordinance you've already adopted. But the the benefit, I guess, would be is that you have an actual ordinance that you're asking them to opine on.'",
        "'speaker_8': 'Right. But it's similar. It's an advisory opinion on your ordinance or you could worded as its own initiative ordinance or as a council member indicated, you could adopt your own ordinance on on a Tuesday.'",
        "'speaker_5': 'That's correct. Thank you. Thank you. Mr. Parking ships here. Go ahead and finish up.'",
        "'speaker_2': 'More importantly, I think we've stepped up and dealt with the issue as the elected officials and, you know, taken taken the consequences of it. I don't think it does any good to send it out to the voters on an advisory opinion on something that is not detailed and specific.'",
        "'speaker_2': 'And so on that basis, I will support the receive and file and and hope that's the end of it.'",
        "'speaker_5': 'Thank you. Council members, item number 18, go ahead and cast your vote. Item number 18, O'Donnell's a yes.'",
        "'speaker_1': 'Motion carry seven votes. Yes.'",
        "'speaker_5': 'All right. Thank you. We're on item number 19, correct?'",
        "'speaker_1': 'Actually.'",
        "'speaker_5': 'I'm 12. All right. Let's get moving here. Item number 12.'"
    ],
    "Request for Information on OpenGov Platform or Equivalent for Online Expenditures.": [
        "'speaker_1': 'And item number 12 is a recommendation from the office. Complimentary shift key to request city manager to provide information on to the City Council regarding the cost and feasibility of utilizing a the government the open government platform or equivalent to make city expenditures available online.'",
        "'speaker_5': 'Reshevsky.'",
        "'speaker_2': 'Thank you, Mayor Pro Tem of some time ago we at this council did discuss about making data open and available and one of the requests was to as many other cities are doing, they're putting their checkbook online, which means that they put the expenditures online so that taxpayers can see how money is being spent.'",
        "'speaker_2': 'We we don't do that. There is a sense an open government platform was developed. It it does transparent operations for a number of cities. It's called managed transparency. They take the government chart of accounts and they show how the money flows through the city, not just how it's stored in databases, complete with educational content that helps simplify'",
        "'speaker_2': 'and explain government finance. The open government platform helps citizens see the complete picture, and to date, they have actually provided this service to 62 local governments, many of which are in California. They are based in the Bay Area.'",
        "'speaker_2': 'And so my motion would be to request the city manager to provide information to the City Council requiring the cost and feasibility of utilizing the open government platform or an equivalent to make the city's expenditures available online.'",
        "'speaker_5': 'Second only council comment. Hearing. No Council Comment. Any public comment on this item? No public comment on item number 12 members. Cast your vote on item number 12. I'm a yes.'",
        "'speaker_1': 'Motion carry six votes. Yes.'",
        "'speaker_5': 'Thank you. I am over 13, Mr. Clerk.'"
    ],
    "Participation in the Investing in Manufacturing Communities Partnership Program.": [
        "'speaker_1': 'Item 13 is a report from the office of Councilman Jerry Ships here with a recommendation to request city manager to work with you and Golden Stuart, director of the Los Angeles County Economic Development Corporation. In submitting comments necessary for the city of Long Beach to participate in seeking the designation designation as a manufacturing community.'",
        "'speaker_5': 'Thank you, Councilmember. Shifting that you wish to comment.'",
        "'speaker_2': 'Yes. Just quickly, I want to thank I understand that through the city manager's office with Tom Modica that Tom has talked with Joanne Stewart, who is the director of public policy for L.A. Economic Development Corporation. This is a wonderful opportunity, I have to tell you.'",
        "'speaker_2': 'The office of the mayor of the city of Los Angeles is working furiously to make sure that they get their information in so that L.A. can be designated one of 12 communities as a manufacturing community. Receiving this designation would mean that this L.A. region, which we have to work through a regional organization, which is L.A. EDC, would'",
        "'speaker_2': 'give us access to approximately 1.3 billion funding, as well as the the help and the assistance of numerous federal agencies. So I would just, for the sake of time, would like to make a motion to request the city manager actually continue to work with Joanne Gordon Stewart, director of Public Policy for L.A. EDC, and submitting comments necessary'",
        "'speaker_2': 'for the City of Long Beach to participate in seeking designation as a manufacturing community as part of the Investing in Manufacturing Communities program established by President Obama.'",
        "'speaker_5': 'Councilmember Andrew Seconds. Any public comment on item number 13? Councilmember DeLong wishes to comment on item 13. Go ahead, Ms..'",
        "'speaker_6': 'Staff. Have any brief comments?'",
        "'speaker_8': 'We would concur with Councilmember Lipski. Mr. Modica has been in contact with the LDC over the weekend and will continue to work with them throughout the week.'",
        "'speaker_4': 'Great. Thank you.'",
        "'speaker_5': 'Thank you. Councilmember Johnson. No, no comment. I will go to the public on item number 13. Any member of the public wishing to comment item number 13, senior members of the public members. Cast your vote on item number 13.'",
        "'speaker_5': 'O'Donnell's a yes or no. Number 13.'",
        "'speaker_1': 'Motion carry six votes. Yes.'",
        "'speaker_5': 'Item number 14. Mr. Clerk.'",
        "'speaker_1': '14 is withdrawn.'",
        "'speaker_5': '14 is withdrawn. Correct. Item number 15 has been. We already handled. 15 were unknown. Number 16, correct?'",
        "'speaker_1': 'Yes.'",
        "'speaker_5': 'Go ahead with item number 16.'"
    ],
    "Ordinance Amendment on Electronic Cigarettes and Similar Devices.": [
        "'speaker_1': 'As an ordinance, the recommendation declaring orders amending the municipal code relating to electronic cigarets read an adopted as read.'",
        "'speaker_5': 'So moved by any public comment and item number 26.'",
        "'speaker_4': 'My name is Mike Schack, the image owner of Essex City, Long Beach. I was here last week and there's a couple of points that I would like to make. One, everything else is right now. I'm going to go ahead and try to make you all Instagram famous.'",
        "'speaker_4': 'Yeah. I want to publicize this on the Internet. And my point being is that technology trumps tradition. And we have the ability today that technology trumps the tradition of old cigarets the old ways. Okay. I have an electronic cigaret in my pocket which automatically demonizes me.'",
        "'speaker_4': 'Apparently that it's bad. It's the same thing as a cigaret, even though there is no studies clarifying that. There is no proof of that. I have studies showing otherwise. So as I take a head.'",
        "'speaker_12': 'It's still legal.'",
        "'speaker_4': 'In this council member. I don't understand what the issue is. I have over 700 signatures asking that electronic cigarets be classified as electronic cigarets and not as tobacco. This is where the problem lies because later in the future, when you classify tobacco as illegal or something else, then electronic cigarets has to fall in that place.'",
        "'speaker_4': 'I believe it's lazy of the city council not taking the time of something so popular. It is not a fad, it's a lifestyle. People want to become healthier. Last week, Dr. Garcia mentioned that he knew somebody that helped was helped by electronic cigarets.'",
        "'speaker_4': 'And I think that really needs to be considered by the entire city council. It's not going anywhere. It's the reality. I think that you guys have a very old school mindset and that you need to embrace it and learn more.'",
        "'speaker_4': 'And I invite you all to come to my shop and any other shops because I believe it. Yeah, there's a few owners here. We would be more than happy to show you what is in electronic cigaret. Can you guys name what's in a cigaret?'",
        "'speaker_4': 'I can name all four ingredients in electronic cigaret and two of the four are optional. All of them are USDA grade. You make em like tobacco. You tell me that I can't vape in my own shop. You want to put me out of business?'",
        "'speaker_4': 'I'm a small business. How dare you? Please reconsider the legislation. Please reconsider not classifying electronic cigarets as tobacco because it is not. Thank you.'",
        "'speaker_5': 'Sir. Thank you. Hey, could you just restate your name for the record?'",
        "'speaker_4': 'I'm Michael Schachner, owner of E-Cig City, Long Beach. Thank you.'",
        "'speaker_0': 'My name's Ken. Attorney. Born and raised Long Beach, California. I'm also the owner of an e-cigarette store. First of all, I'd like to say that this is a huge industry that we're taking on, which is big tobacco. It is a multibillion dollar corporation in which we are already turning people away from them, saving people's lives.'",
        "'speaker_0': 'I've. Personally have had people come to me and and say, after 35 years of smoking and trying everything to quit, this is the only thing has helped me. And to throw this in a category with something that's not even relevant to it.'",
        "'speaker_0': 'The thing is, electronic cigarets are not cigarets. As a matter of fact, everybody in this building right now is vaporizing. You are breathing water in and out of your mouth. Okay. Which is exactly the product that comes out of an e-cigarette.'",
        "'speaker_0': 'Nicotine is not a tobacco product. As a matter of fact, inside of a 150 gram potato, there are five five micrograms of nicotine. Nicotine is an F, almost every vegetable and some fruits. Okay, that that's that's a fact.'",
        "'speaker_0': 'Okay. To categorize this as a cigaret and put this as in and apply the laws to e-cigarettes as the laws are to cigarets. Well, why don't we do that with pot? Why don't we do that with with other substances?'",
        "'speaker_0': 'You can't because everything needs to be treated separately and differently according to the situation. And then on a second note, to categorize it, because you can smoke pot out of it or children smoke it. 20% of high school kids have tried e-cigarettes.'",
        "'speaker_0': 'And that is a fact. And the other fact is the majority of those 20% of those high school kids that have tried e-cigarettes are also smokers looking for an alternative and then for the use of illegal drugs in it.'",
        "'speaker_0': 'And you can use illegal drugs.'",
        "'speaker_3': 'In tin foil cans.'",
        "'speaker_0': 'Baseball bats. I mean, anything. This poll right here, I mean, it's so to to to justify categorize it as.'",
        "'speaker_3': 'A tool of of.'",
        "'speaker_0': 'Drug use is preposterous. Also, as my time's up. Thank you very much.'",
        "'speaker_3': 'Good evening, council members. My name is William Skidmore. I am not a representative of any organization, but I am a representative of 625 online petitioners that I started on Thursday. I sent you copies of the elongated version of our reason for the opposition of these proponents to all of your emails.'",
        "'speaker_3': 'And I have a copy of all of obviously the signatures here. I will summarize briefly for you. Because of time, we are opposed to chapters 581 because of its improperly linking the nicotine to tobacco products. This is not done with nicotine gums or nicotine patches.'",
        "'speaker_3': 'If we're concerned about minors, we took steps against that for things like compressed air or cough sirups. It was not classified as a tobacco product as it as it is requested to be amended in 581. The second aspect is 8.68, where we are having the same rules applied for smoking.'",
        "'speaker_3': 'There is no studies that show that these there is any harm that comes from electronic cigarets and because of this you're in out forcing people who smoke electronic cigarets and could possibly be ailing from these illnesses to be exposed to the same secondhand smoke, which there is plenty of studies, obviously, that there is that problem of exposing'",
        "'speaker_3': 'them. So that's all that I have at this time. Thank you very much. Hi, I'm James Pappas from the fifth District. I have a residence and a business in that area. A lot of these guys have already touched on some of the points that I wanted to make.'",
        "'speaker_3': 'But, you know, the state Senate has looked into regulating e-cigarettes with SB 648 and they showed that the FDA was supposed to hand.'",
        "'speaker_10': 'Down its findings.'",
        "'speaker_3': 'On October 31st, and they have yet to do that. So I think it's a little premature to be discussing regulating e-cigarettes in this manner. And just for the record.'",
        "'speaker_10': 'I am in opposition. Thanks.'",
        "'speaker_7': 'Hi. My name is Jenny Warner, and I'm going to be quick speaking as a health care representative. I can tell you that four years ago, all the hospitals in.'",
        "'speaker_9': 'L.A. that I worked with and knew of were all banning.'",
        "'speaker_7': 'Anything called a smoking.'",
        "'speaker_9': 'Device. And we were citing a lot of things that.'",
        "'speaker_7': 'Some of the supporters were citing that you can put wax in it and it can be pretty much.'",
        "'speaker_9': 'Any substance. We didn't want that in our buildings. We were promoting health. And there's numerous studies and documents about how there's been an increase in the wax and explosions and it's like more prevalent now than meth labs.'",
        "'speaker_7': 'So bringing that back home, e-cigarettes, we decided they were toys.'",
        "'speaker_9': 'They were not something that we needed to promote in the public spaces, and it was not conducive to.'",
        "'speaker_7': 'Our smoke free.'",
        "'speaker_9': 'Campuses. So we banned.'",
        "'speaker_7': 'Them. Thank you.'",
        "'speaker_8': 'Hello. I'm Jeff Miller. E-cigarettes are about nicotine. Nicotine is an addictive substance. One of the speakers said that potatoes contain some nicotine. Well, it may be, I don't know. But until the FDA declares that these devices are as safe as eating a potato, I don't think it should be something we want to promote.'",
        "'speaker_8': 'And it should be noted that young people, teenagers, adolescents, junior high school students emulate what adults do. NPR had a report today indicating the alarming rise in usage of e-cigarettes by this cohort of junior high school students. Well, we don't need any more encouragement of using an addictive substance.'",
        "'speaker_8': 'Yeah, they're not all smoking bubble gum flavors. There's nicotine, and that is addictive. We don't need to give anymore chance for junior high school students to become addicted. So let's regulate these as we do other products containing nicotine.'",
        "'speaker_8': 'That's all that's necessary. Thank you.'",
        "'speaker_7': 'Good evening. And again. I'm sorry. I hope I'm not wearing out my welcome. Melinda Cotton. I live in Belmont Shore, and I'm a member of the Coalition for a smoke free Long Beach. And we appreciated the council vote last last week to on the first reading to approve this with aid to Andrews for bringing forward Mr. Shad'",
        "'speaker_7': ', which I believe the e-cigarette store who just demonstrated e-cigarettes with all the chemicals that are in that vapor. I sat behind him last week and he periodically puffs that in and practically in my face. So if the council fails to pass this ordinance tonight, this kind of demonstration will be prevalent not only in city council chambers, in'",
        "'speaker_7': 'bars and restaurants, every public place. And I don't think we want this. These are dangerous chemicals in there. And just to remind everyone that we're not preventing people from using these if they feel they help them quit actual tobacco cigarets.'",
        "'speaker_7': 'We're only saying please don't smoke them in public places. Please don't glamorize them for our children. And until we hear from the public health people all around the world, there are a lot of studies that show great concerns about this and the other things that can be smoked.'",
        "'speaker_7': 'You can put almost anything inside these e-cigarettes and smoke them. So please support this on the second reading and we appreciate your support of public health. Thank you.'",
        "'speaker_3': 'I stayed to the end. Evan Brownie. My name and address is on file. I've been involved in the tobacco issues and related issues for since I've been on the council. And excuse me, I'm a back surgery last Wednesday, so I'm still a little difficult to walk around quickly.'",
        "'speaker_3': 'But I wanted to this is an important issue to me. It's an important issue, I hope, for the for the city and for our health health conscious people. My biggest concern I mean, I think they've stated a number of things here and I may or may not be true.'",
        "'speaker_3': 'What what's inside is are healthy or not healthy. My my concern is when I hear a radio broadcast from, you know, legitimate journalists who are telling us that these places are being bought up, that companies are being by the by the tobacco companies that we have have not been our best friends over the years, at least, certainly'",
        "'speaker_3': 'not to our kids and and to our the health of our community. And they seem to be buying more of them and more of them to match their to increase their bottom dollar. I'm concerned about what they plan to do with them.'",
        "'speaker_3': 'And that's and I think that has to be we have to be careful about the future and at least for now, protect our community. And this would go away a ways to do that. Thank you.'",
        "'speaker_4': 'My name is Paula Wood, and I am chair of the Smoke Free Long Beach Coalition. I'm here to ask you to again support this on the Second Amendment voting. We feel that this is something that is very critical to particularly our youth of the community.'",
        "'speaker_4': 'I also work and run a nonprofit organization, and what I hear in talking to our youth is this is a serious issue that many of the young people, from what I hear, have not smoked in the past, but are trying these candied this candy vapor e-cigarettes.'",
        "'speaker_4': 'And they're you know, they're just becoming more and more prevalent all over middle school as well as high school. And I just feel that we need to make sure that this does not pass, as we can see if he's allowed the vapor here in the city hall.'",
        "'speaker_4': 'You know, I've also been in restaurants where it's happened. I understand that, you know, some of the college campuses that there's been some vaping in the classroom. And this is very, very a serious matter. And the concerns those of us who are concerned about the health of others.'",
        "'speaker_4': 'So I just hope that we can ask the city council to do what we have done in the past and support us on this tobacco issue. Thank you.'",
        "'speaker_5': 'Thank you. Councilmember Sheepskin.'",
        "'speaker_2': 'Yes. I'd like to actually make a substitute motion that we lay this over until the next council meeting, because I do not think it's fair. We've got three council members who are not here to vote on this. And I think it's very important.'",
        "'speaker_2': 'This is an extremely serious ordinance that we're taking into consideration and like the medical marijuana ordinance that we laid over so that there was all full participants, I would I would ask that we do that until March 4th.'",
        "'speaker_5': 'Seconded by Councilmember Neal. Mr. City Attorney can ask your question. This needs five votes in the motion.'",
        "'speaker_8': 'To lay over does not need.'",
        "'speaker_4': 'Five votes. The motion to pass the second reading would need five votes.'",
        "'speaker_5': 'So if I have six people and I have two indicating they're not going to support through the ordinance, if we get to the vote in the ordinance, the ordinance dies.'",
        "'speaker_8': 'That's correct. You need five votes for your second reading to pass the ordinance.'",
        "'speaker_4': 'You need to be.'",
        "'speaker_5': 'So. Okay, so. The practical impact or effect of voting to delay this would just delay it for two weeks.'",
        "'speaker_8': 'That's correct. You'd come back for your second reading again in two weeks.'",
        "'speaker_5': 'Thank you. You don't want to hold it over two weeks. Okay. The vote here is to hold it over for two weeks till the next council meeting. Till here? Yeah. So. Well, that would be. I'm. He's opining on her substitute motion this week.'",
        "'speaker_5': 'Okay. So any, any any further council comment on this item? Members cast your vote. The substitute motion is to hold the item over till the next council meeting. O'DONNELL Yes.'",
        "'speaker_1': 'Motion carry six votes? Yes.'",
        "'speaker_5': 'Councilmember. He has a question for the city.'",
        "'speaker_2': 'Yes. And Mr. Parking, I think this is the first time that I haven't really gotten a clear answer. Is there any way I know, because of the nature of the fact that people can put in these things any any kind of item?'",
        "'speaker_2': 'Isn't there a way, though, that can be ferreted out between the difference between because we're putting them under the classification of tobacco, which absolutely this city is is really committed to being smoke free with tobacco. Again, my concern down the line is our our vulnerability.'",
        "'speaker_2': 'I know other cities have done this, but our vulnerability of including things in a category that really don't belong there.'",
        "'speaker_6': 'So it.'",
        "'speaker_4': 'Becomes a policy decision.'",
        "'speaker_8': 'Obviously, for the city council. I think from an enforcement perspective it becomes, if will be our officers position would be almost unenforceable because you'd have no way to tell what product is in the e-cigarette that's being vaped unless you were able to test it.'",
        "'speaker_8': 'And I don't think we could enforce that. So the other cities, I think that we're following what they have done is that they have treated all of the product as a cigaret, as we're proposing to do in the second reading this evening.'",
        "'speaker_2': 'And are we distinguishing between, you know, in the first generation of the e-cigarettes, it was a device that lit up and simulate it as if you were smoking. And this these devices are much different. These vapor devices are different.'",
        "'speaker_2': 'So we're throwing everything in the same category.'",
        "'speaker_4': 'That is correct, in that we are treating.'",
        "'speaker_9': 'Them all similarly.'",
        "'speaker_8': 'I think the the other issue would be is if you adopted the ordinance as it's proposed at a future time, after some other technology advances or studies come out, the council could certainly amend the ordinance to address that issue.'",
        "'speaker_8': 'If that was a desire of the council.'",
        "'speaker_2': 'You know, what's the penalty for.'",
        "'speaker_5': 'You know, council memberships? You know, you're talking about altering the policy, not I'm not in the request to it. Well, not on the court. Your request was to hold it over until the next council meeting, which is really what our conversation should be specific to right now.'",
        "'speaker_2': 'Mr. Klein. Can I get that information?'",
        "'speaker_5': 'Jim McCall. Thank you. But right now, let's let's let's vote and move forward where he did so. Mr. City Clerk, that that is our last item, correct? Yes. Okay. New business people.'",
        "'speaker_1': 'We need to vote.'",
        "'speaker_5': 'We did not vote. Okay. You said we voted. Well, odor. And did we vote yes or no?'",
        "'speaker_1': 'Just hold on. Hold on. That's correct. Okay.'",
        "'speaker_5': 'We did vote yes. Sorry about that. Okay. Councilmember Lipski. No, no, no, no, no business. Councilmember Neal.'"
    ]
}