{
    "Donation to Los Cerritos Wetlands Stewards from Third Council District Funds.": [
        "'speaker_0': 'Thank you. We're going to go ahead and do the all the fun transfers. It's items 26, 27, 28, 29, 30, 31, 32, 33, 36 and 37. If I can get a motion any second for all those items in Madam Quirke, you can read them, please.'",
        "'speaker_1': 'Item 26 A Communication from Councilwoman Price Recommendation to increased appropriations by $100,488 to provide a donation to Lois Rita's wetland stewards to support a community planting event. Item 27 Communication from Councilman Super Anna Recommendation to increase appropriations by $250 to provide a contribution to the Friends of the Long Beach Public Library for their Celebrate Our Library event'",
        "'speaker_1': '. Item 28 Communication from Councilwoman Allen. Recommendation to increase appropriations by 1500 to provide a contribution to L.A. Wine Fest to support L.A. Wine Fest 2021. Item 29 Communication from Councilman Austin. Recommendation to increase appropriations by $5,000 to provide a donation to the Bixby North Business Improvement Association to support ongoing programing at the Expo Art Center.'",
        "'speaker_1': 'Item 30 Communication from Councilwoman. And they have recommendation to increase appropriations by $450 to provide a donation to the Long Beach Camerata Singer's 2021 gala, which will take place on October six, 2021. Item 31 A Communication from Councilwoman into House recommendation to increase appropriations by 2500 to provide a donation to the Economic and Policy Impact Center Fellowship'",
        "'speaker_1': 'graduation held on September 18th, 2021. Item 32 A Communication from Councilwoman. Did they have a recommendation to increase appropriations by 250 to provide a donation to the Long Beach Public Library Foundation of Friend? Celebrate our Library event. Item 33 A communication from Councilwoman and I have recommendation to increase appropriations by $500 to provide a contribution to the'",
        "'speaker_1': 'Habitat for Humanity of Greater Los Angeles in support of their collaboration with the Washington Neighborhood for planning of the Dallas Masters event. Item 36 Communication from Council member Urunga. Recommendation to increase appropriations by $500 to provide a donation to Long Beach Camerata Singers to support their 2021 gala.'",
        "'speaker_1': 'An Item 37, a communication from Council member Urunga recommendation to increase appropriations by $500 to provide a donation to Historical Society of Long Beach to support their 2021 cemetery tour. Those are all of those transfers.'",
        "'speaker_0': 'Thank you very much. We have the motion and a second in place. We have one member of the public, Mr. Confer, on these items. Thought about that. I got the calendar misconstrued and had the opportunity of eating at the gala, the public library gala at the table to Miss Jane Hower.'",
        "'speaker_0': 'So she seems like a very kind and lovely woman. And she explained to me the cultural contributions of the Long Beach Camerata singers. So very much in support of that endeavor. With regards to the Expo Center, that is a bastion of community with respect to the city overall, but especially in the eighth District.'",
        "'speaker_0': 'So I'm heavily supporter of Council Councilman Alston's recommendation, especially with regards to the expo now being the home of the African-American Cultural Center. So thank you. Thank you. There is a motion in a second. Please cast your vote in this custom analysis.'",
        "'speaker_0': 'Anything you want to add.'",
        "'speaker_1': 'No. Just support all the.'",
        "'speaker_0': 'Items cost from your income for the item. Please cast your vote.'",
        "'speaker_1': 'Ocean is scared.'"
    ],
    "Continuation of Belmont Shore Parking and Business Improvement Area Assessment and Agreement. ": [
        "'speaker_0': 'Thank you. Next up is. The hearings. We have three hearings. They will have public comment and then we'll have the agenda, the rest of the actual agenda items. So beginning with hearing the first hearing.'",
        "'speaker_1': 'Ring Item number 23 Report from Economic Development Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution continuing the Belmont Shore Parking and Business Improvement Area Assessment Levee District three. We will have a staff presentation of this item by Eric Romero.'",
        "'speaker_1': 'Economic Development.'",
        "'speaker_0': 'Good afternoon, Mayor, and members of the City Council. The Belmont Shore Parking and Business Improvement Area, also known as the Business Improvement District, was established by the City Council in 1983, allowing for the levy an annual of an annual assessment to be paid by businesses located in the district.'",
        "'speaker_0': 'The city contracts with the Belmont Shore Business Association to manage the Business Improvement District and the Belmont Shore Business Association's Board of Directors serves as an advisory board to the City Council on matters related to the district. State law governing business improvement districts requires an annual report be approved by the City Council.'",
        "'speaker_0': 'The annual report describes the boundaries of the proposed activities and the budgetary information, as well as the method and basis for the continuation of the assessment. The annual report proposes no changes to the district boundaries or the method of loving the assessment.'",
        "'speaker_0': 'The proposed activities will focus on marketing, special events and community outreach and security. This concludes my staff report. I'm happy to answer any questions. And I got a motion in a second place. I see no public comment for this hearing.'",
        "'speaker_0': 'Is that correct? Members, please go and cast your vote.'",
        "'speaker_1': 'Components and. Motion is carried.'"
    ],
    "Continuation of Zaferia Parking and Business Improvement Area Assessment and Agreement. ": [
        "'speaker_0': 'Next item, please, which is the next hearing, which is 24.'",
        "'speaker_1': 'Report from Economic Development Recommendation to receive a supporting documentation into the record. Conclude the public hearing and adopt a resolution continuing to zafira a parking and business improvement area assessment levy districts three and four. Dr. Eric Romero will also make the staff presentation for this hearing.'",
        "'speaker_0': 'The depth of marketing and business improvement area was established by the City Council in 2010, allowing for the live even annual supplement to be paid by businesses located in the district. The city contracts with the Zafira Business Association to manage the Business Improvement District and their Board of directors serves as an advisory body to the to the'",
        "'speaker_0': 'City Council on matters related to the district. State law governing this district requires an annual report be approved by the city council. The annual report describes the boundaries, proposed activities and budgetary information, as well as the method and basis for the continuation of the assessment.'",
        "'speaker_0': 'The annual report proposes no changes to the district boundaries or the method of living. The assessment and the proposed activities will focus on marketing, special events and maintenance and beautification. This concludes my staff report.'",
        "'speaker_2': 'All right. We need to make a quick transition. Public comment on item 24.'",
        "'speaker_1': 'No public comment on.'",
        "'speaker_2': 'Okay, Members, please cast your vote. I mean.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Entertainment Permit with Dancing for Compound F&B, LLC. ": [
        "'speaker_2': 'Thank you. What's your item? 25, please.'",
        "'speaker_1': 'Report from a financial management recommendation to receive a supporting documentation into the record. Include the public hearing and grant and entertainment permit with conditions for entertainment with dancing to Accra powered FMB district for there is an oath for this very.'",
        "'speaker_2': 'All right, Councilman. Now. Oh. Is there staff? Oh, I'm sorry. Go forward, though.'",
        "'speaker_1': 'Yes. I'd like to introduce Tara mortensen, the bureau manager for Business Services Bureau, who will introduce this item and make the presentation for council prior to the presentation. Can we administer the oath, please? Anybody who is going to be testifying to you and each of you solemnly state that the testimony you may give in the course now'",
        "'speaker_1': 'and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God. Thank you.'",
        "'speaker_2': 'All right. That report.'",
        "'speaker_1': 'Good evening, honorable mayor and members of the city council. Before you tonight is an application for entertainment with dancing for a compound FNB LLC at 1395 Coronado Avenue operating as a restaurant with alcohol in Council District four. This location is also licensed for an art studio as well as for general services for other activities, including workshops, wellness'",
        "'speaker_1': 'classes and other programing. All of the appropriate departments have reviewed the application and have provided their recommended conditions as contained in the hearing packet. Section two Condition number six States that no live entertainment or dancing may be permitted on the patio.'",
        "'speaker_1': 'The application did requested and PD is recommending that there be no live entertainment outside to prevent nuisance created from the additional noise. I, as well as commander librarian from the police department, are available to answer any questions that you may have.'",
        "'speaker_1': 'That concludes my staff report.'",
        "'speaker_2': 'All right. Is there any public comment on item 25?'",
        "'speaker_1': 'No public comment on this item.'",
        "'speaker_2': 'Okay. And I see there's no council comment. Members, please cast your vote. I mean.'",
        "'speaker_1': 'Castle wanted to have. Motion is carried right now.'",
        "'speaker_2': 'We're going to go into our public comment. We have eight speakers lined up. So let's go ahead and set up for that. So first we have Kenny Allen and then Chief Hunt and I can say Daniel Castro, Alissa Gutierrez, Christopher Covington, Elliott Gonzalez and Francis Yang.'"
    ],
    "Emergency Rental Assistance Program for Landlords and Tenants at Risk of Eviction.": [
        "'speaker_2': 'Public comment. Thank you so much for your testimony and testimony and certainly a lot going on in the town. Right now, we're going to move forward with item 34.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson. Councilwoman Zendaya's. Councilwoman Allen. Recommendation to request City Manager to work with the Department of Development Services to evaluate the feasibility of establishing a single emergency rental assistance application for landlords with multiple tenants and communities at elevated risk of eviction and direct the Department of Development Services to publicize data regarding the rental assistance'",
        "'speaker_1': 'program on a public dashboard.'",
        "'speaker_2': 'Fantastic. Thank you. I can't keep up. So I'm going to make the motion on table for me and pull up the presentation.'",
        "'speaker_0': 'Right.'",
        "'speaker_2': 'So thanks to community partners, thank the city staff, thanks to everyone who provided data and helped shape this proposal tonight and thank you to council members and they have an Allen for your support on this proposal. So a little bit of context.'",
        "'speaker_2': 'Long Beach has been a leader in the region, in the nation on the Recovery Recovery Act. $250 million in Recovery Act. The most significant effort with 64 million in rental assistance so far. The ERAP program, emergency rental assistance program that allows for the full payment of back rent for vulnerable tenants and is our most significant tool to'",
        "'speaker_2': 'keep people in their homes and keep people housed. The city has distinguished itself itself as a leader for efficient management of the pandemic and the recovery. We led the way on vaccination. We're now preparing to be among the first on booster shots.'",
        "'speaker_2': 'Our rescue our Recovery Act was the first meaningful recovery package, making good use of recovery money to strengthen our city. And our rental assistance program has been recognized by the US Treasury as one of the more efficient programs in the nation.'",
        "'speaker_2': 'We have just under 30% of our of our funding disbursed, beating the state and national averages. We've already helped over to about 2500 households with rent and utility payments. Those are 2500 households that are now no longer on the brink of eviction.'",
        "'speaker_2': 'Our Development Services Department and our community organizations have done a great job really rallying and making this successful. At a time when some agencies simply gave the money back because it's a challenge. Compare this to L.A.. L.A. was underperforming, and a month ago they chose to give the money back.'",
        "'speaker_2': 'And all of those people had to go back through the same process and go back to the back of the line. There was no context on it. Okay. So so here's what we're finding. So in Long Beach, ah, or here in L.A. County, our eviction moratorium ended September 30th, and we still have 15,800 households who are still'",
        "'speaker_2': 'behind on rent and vulnerable to eviction. That's estimated that over 43,000 people in our city, that's 99% of our population is in this very precarious position, that 16,000 children are at risk of eviction. And we can help make a difference if we expedite getting this funding out at the current pace.'",
        "'speaker_2': 'We'll take until August 20, 22 to distribute all of our money. And where is the money? What are we hearing? What is the most significant burden to getting the money out faster? Well, first, stringent requirements, so continue to have to prove that their 80% area median income or below.'",
        "'speaker_2': 'Right. They're below 80%. They actually have to prove their economic situation was was impacted by the pandemic. And, you know, they have to prove that they're at a point of housing insecurity. Those are things that we have to provide documentation of proof.'",
        "'speaker_2': 'You also have unique challenges. We understand that Long Beach is a very diverse community. We have digital divide issue. We have some areas where it's harder to connect to the to the Internet. We also know that immigration status makes it more difficult.'",
        "'speaker_2': 'And so the burden. In order to provide the worthiness of this program, although it's a really good program, you know, there are things that we can do to improve. Currently in a currently a ten it alone can apply or as a tenant and a landlord.'",
        "'speaker_2': 'The tenants who need the most help are often the one who are more likely to not have the required documents in order to actually receive the have a completed application or received the assistance. So the folks who are out of work are having a difficult time getting into work.'",
        "'speaker_2': 'Those are also a thing. People are having a difficult time completing the application and sometimes the documents just simply don't exist. The proof, they just simply doesn't exist at 4500 unfilled applications because they are processed by one side and not the other.'",
        "'speaker_2': 'We have 8500 incomplete applications because a tenant or a landlord is having difficulty finding the documents or none of the current proxies like Medicaid or unemployment insurance. Enrollment can be applied in lawsuit scenario. We have a tool called a self attestation form that we just began using.'",
        "'speaker_2': 'In some cases, it can be hard to complete with language barriers if you're signing up to a test, right? Sometimes it takes a little bit of effort to talk someone through what it attestation form. And there's also again, issues with digital access.'",
        "'speaker_2': 'And and so these are some of the barriers. The Urban Institute study show that 36% of tenants who haven't finished the application, they couldn't because of eligibility criteria. Another 24% expressed difficulty communicating with landlord. 21% said that the process of preparing and filing documents is why they didn't finish.'",
        "'speaker_2': 'And landlords expressed a very similar problem. 30% have said they haven't completed applications due to the complicated criteria. 30% said they expressed issues communicating directly with their tenants. 22% have said that they've had trouble preparing or filing documents.'",
        "'speaker_2': 'So here's the opportunity. You know, we've been recognized as a leader. We have responsibility, continue to lead. We've learned a lot. We've kicked around some different ideas. Today is to look at some new opportunities put forward by the Treasury.'",
        "'speaker_2': 'Look at the some of the things we've been kicking around and create some streamlined approaches to get more people in vulnerable areas approved. So the new Treasury guidance allows for advance payments to landlord with lower requirements for proof of eligibility.'",
        "'speaker_2': '2000 applications where landlord have done their site but the tenant haven't found their documents or you know, that could double the allocation overnight if we were to all those 2000 applications. Creating a single, streamlined application.'",
        "'speaker_0': 'Process.'",
        "'speaker_2': 'Targeted to property owners of buildings with large clusters of incomplete applications would help us to get the money out faster, allow you to protect more tenants and reach those who those hard to get tenants who we know. Maybe they haven't signed up, maybe they haven't initiated their own application.'",
        "'speaker_2': 'But if there's already a streamlined application happening within that building, it's easier for them to piggyback on and protect both those units so the neighbors know who their neighbors are, the landlords know who their neighbors are. Want to make it easy to protect more people if we speed this up or be eligible for additional funds.'",
        "'speaker_2': 'What the Treasury is doing and what the state is doing, they're rewarding the jurisdictions who get the money out faster by reallocate, reallocating funding from other jurisdictions. And so some some programs are mismanaging. Some aren't getting the funding out fast enough.'",
        "'speaker_2': 'We can reward ourselves by protecting more people with a win win. Of you promising example Kentucky. If your zip code is low income, you automatically qualify. So they're just looking at if you live in a zip code or area, you don't have to prove all of this.'",
        "'speaker_2': 'You can simply by living in that area, you qualify. Another example, the Carmelita projects. They're different because they're public housing there, but they're one of the only single application processes that have happened. And because they were able to do it that happened right here in Long Beach, they were able to cover, I think, a 20 some odd'",
        "'speaker_2': 'application, 80, 80 tenants and one application protected. All right. Imagine if we were to do this that most law departments in our city, Harris County, Texas, they use the amount of rent owed per month as a proxy for housing insecurity and lower rent, higher risk.'",
        "'speaker_2': 'And so here's the recommendation today. The recommendation is create a streamline single application process for landlords, for vulnerable tenants to cover the whole building. Allows tenants to organize with one voice and allows landlords to target their home their whole building, so allow people to organize around one one application.'",
        "'speaker_2': 'This proposal has had support from folks at every stage of the rental assistance process from tenant and tenant advocate to rental asset. The report provides rental assistance providers to city staff and landlord. You know, it's not often we can hold up a letter from the apartment association in a letter from Long Beach forward both saying the same'",
        "'speaker_2': 'thing. I'll be leader will continue to look at these ways to continue to innovate. So given the city's mandate to push the state to lower the burdensome application process, we've already had some success in getting the state to do that.'",
        "'speaker_2': 'I think we're we will be one of the first we will be the first city in the state to make this happen if we can make this happen. So the ask is move forward, begin engaging with the state on a single, streamlined application.'",
        "'speaker_2': 'If there are other ideas that come out of Federal Treasury or other ideas the City Council has, we want to throw that in the kitchen sink as well. The idea here is to streamline this process and then secondly, create a rental assistance dashboard that can be public, that helps show progress, equity concerns, where where we're making progress'",
        "'speaker_2': ', where we're not adding transparency. That's something that's been good during the pandemic, is our most significant tool to address housing insecurity. And so we should have that same that same concern. And again, we're open to additional ideas as well.'",
        "'speaker_2': 'So that is the presentation, and I'm happy to make this motion. Councilwoman Allen.'",
        "'speaker_1': 'Yes, sir. Thank you, Vice Mayor. That was a really great presentation, very comprehensive. And I just want to say thank you for asking me to sign on to this item. Housing is a priority to me, and this item provides a real opportunity to improve our Erap program.'",
        "'speaker_1': 'The item also streamlined the Erap application process, which is really important and helps get those assistance dollars out faster with more tenant that can be covered under the program. So people really need this. I know I've heard from a lot of my residents and looking at your numbers, we all know that this is really necessary.'",
        "'speaker_1': 'And and I also encourage DAP, if there's anything that happens along the way that you think we can improve this process, we're always looking for that and being a leader. So just happy to support this item today and just a great work by mayor.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'I think I need a second on this notion, actually, Cliff. I'm going to second. In a second to Councilman Allen. Councilman in the house.'",
        "'speaker_3': 'Thank you. Thank you. Vice Mayor, again for. Ask me to sign on to this very, very important item. Why do we have inequalities? Why do inequities exist today? Because for centuries, certain communities, and particularly our black and brown, low income communities have been left behind.'",
        "'speaker_3': 'They have been neglected. Policies and programs have not been designed for them because they have not encompassed nor even acknowledge the additional barriers that exist for the working class families. So I really, really want to thank Vice Mayor Richardson for putting forward this item, as well as Councilwoman Allen for your support.'",
        "'speaker_3': 'Because in this item we are doing, what we are doing is acknowledging the inequities that exist within our rental assistance program, and it is proposing a solution for it. And I think that's what we really have to focus on.'",
        "'speaker_3': 'There are about 8500 applications that have been incomplete. That means that there are thousands of potentially low income households who need this support, yet, because of technical technicalities, wouldn't otherwise be receiving that kind of support. I am proud that Long Beach has been a leader in the management of this program, but we need to do more with'",
        "'speaker_3': 'more than 43,000 people at risk of being evicted. We need to do a better job of ensuring that no family is evicted, especially as we have our holiday season coming up. And since most of the funds that that are for this particular thing are available, so we need to make sure that there are not only available, but'",
        "'speaker_3': 'that they are accessible to all of those who are really in need of them. In regards to the new application options for landlords, I propose that as we identify specific neighborhoods and buildings with the highest needs, that we ensure that every individual in those buildings receives funds if they are in need of it.'",
        "'speaker_3': 'I would like for the application to process to be as easy as possible. I think that that's also where we get hung up and where these technical technicalities occur. So I think that it's very important that we make it as easy as possible for for the landlords to apply for the residence to apply, and for them to'",
        "'speaker_3': 'actually receive this these funds in a very timely manner. Not only are we helping out our residents that are in need of this, but we're also helping out our landlords who have been and who have also been very patient and have been allowing, you know, all of the tenants to just stay there without paying rent.'",
        "'speaker_3': 'And they are also suffering as well. So we really need to make sure that as much as we we can that we help our tenants.'",
        "'speaker_0': 'Thank you, Councilwoman. I don't see anyone else cued up. Is there. Should we do public comment? Well, cancer. Thank you. And I want to appreciate this item I figured out. It's one that I'm happy to support. I was proud to introduce the original item for rental assistance only about a year ago, and that was $5 million commitment'",
        "'speaker_0': 'from the City Council, from our CGP CDBG Fund. And since then our, our emergency rental assistance program and the funding coming from the federal state government has expanded significantly. I think that that we've been able to help a lot of families and and I really appreciate the commitment of this council and our staff to, uh, to help'",
        "'speaker_0': 'not only tenants but also to housing providers during a very, very difficult time. We've come a long way and over the past year I think we've learned how to deliver and continuously improve on our processes and systems to provide rental assistance to families and keep families house.'",
        "'speaker_0': 'So I fully support anything that eliminates barriers and red tape that improves transparency in the process. And allows us to deliver on these critical services to families in need. So with that, I'm happy to support this motion. I think you and I will do public comment, but I'm quick.'",
        "'speaker_1': 'Can the following people please line up for public comment? Elaine Hutchinson. Garcia. Lopez Reyes. Married. You gone, Mike Murchison. John Edmund and I can face an uncertain. Good evening. Honorable Mayor Garcia. Honorable Vice Mayor Richardson. And members of the Long Beach City Council.'",
        "'speaker_0': 'It might not working. 1/2.'",
        "'speaker_1': 'The mic is on and I.'",
        "'speaker_0': 'Know it's on. It's just not projecting it.'",
        "'speaker_1': 'I'm not speaking into it.'",
        "'speaker_0': 'We're going to we're going to check in with this.'",
        "'speaker_1': 'HUTCHISON Can you please put your mask on while you're doing public comments? Thank you. Thank you. May I go ahead or.'",
        "'speaker_0': 'Why don't you wait 1/2? Thank you. I think it was working before, and now it's not. What do you do? Why don't you restart and we'll just restart the time, all right?'",
        "'speaker_1': 'Okay. Now?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'And your mask must.'",
        "'speaker_0': 'Remain on the mask on.'",
        "'speaker_1': 'Put my mask back on. Yes, please. Thank you. Okay. Like this. Okay. Okay. The Honorable Mayor Garcia and Honorable Vice Mayor Richardson and members of the Long Beach City Council. My name is Elaine Hutchison, and I'm here this evening on behalf of the Apartment Association of California's Southern Cities, located at 33 three West Broadway here in Long'",
        "'speaker_1': 'Beach. Just to mention, we're very proud that this year we are celebrating our 97th year serving the rental housing industry here in Long Beach. We want to thank Vice Mayor Richardson and council members the data's and Allen for bringing item 34 forward to streamline the application process for the Emergency Rental Assistance Program.'",
        "'speaker_1': 'We know from calls coming into our office that both tenants and owners have difficulty in communicating to meet the requirements, either because of language barriers or difficulties with understanding the process or simply to understand the purpose of the program and how they felt.'",
        "'speaker_1': 'And then the steps to be taken. We here in Long Beach are very fortunate to have seen several awards of rent relief funds, and we still have 46 million of unspent funds. So while there may be federal or state guidelines to work with, we must remember that our end goal is to help pay unpaid rent and thereby'",
        "'speaker_1': 'prevent homelessness and to help stabilize the tenants in our community who need assistance. We are very pleased to support item 34 and urge the City Council to approve this item. Thank you very much. Good evening. Mayor and council members.'",
        "'speaker_1': 'My name is Grisha Lopez Reyes. I'm the director of the Long Beach Coalition for Good Jobs and a Healthy Community. COVID 19 has revealed the vast inequalities in our communities, but we applaud the city's efforts to develop a strong recovery plan for the COVID 19 pandemic to ensure that we get the necessary resources to residents that have'",
        "'speaker_1': 'been impacted by this public health crisis. The rental assistance program is key to making this happen. However, while this program has tried to help many households with rental and utility payments, the difficulty of the application process discourages tenants, especially low income renters and or undocumented communities from accessing these funds.'",
        "'speaker_1': 'It is confusing, inaccessible and requires the necessary amount of documentation. For this reason, we strongly support the recommendation put forth in tonight's item by Vice Mayor Richardson, Councilwoman Sun has and Councilwoman Allen to lower administrative burdens for eligible residents to ensure that those needed the most are receiving the assistance.'",
        "'speaker_1': 'Our Coalition has engaged thousands of renters through our organizing efforts this month, but I wanted to lift one story from Shelly Ward. She's a Long Beach resident who tried to apply for rental assistance but experienced difficulty due to the long and complicated process.'",
        "'speaker_1': 'Due to the drawback she faced when starting the application process. She was then served an eviction notice. Shelly and her family are now facing the threat of displacement, which could have been avoided if the process was easier and more accessible.'",
        "'speaker_1': 'This new process will open up the opportunity for tenants and landlords to work together and make it easier for the funds to be distributed effectively. By voting yes and improving this recommendation, Long Beach will continue to be a strong leader on COVID 19 recovery and an example for other cities.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Next speaker, please.'",
        "'speaker_1': 'Good evening, Honorable Mayor Garcia and the city council members. My name is Mary. You. I am a pastor and.'",
        "'speaker_3': 'A faith rooted organizer with Clergy and Laity United for Economic Justice, also known as crew. I represent hundreds of.'",
        "'speaker_1': 'Faith leaders connected through crew to speak in support of this item today. First, I want to say thank you to the city for developing such a strong recovery plan to provide resources for our community. And specifically, I want to say thank you to Vice Mayor Richardson, council.'",
        "'speaker_3': 'Members and Council Member Allen, for bringing this item up.'",
        "'speaker_1': 'We all know that availability and access are two different issues. We have our city has the rental assistance funding available to tenants, but the tenants who need it the most don't have access to this resource because of the burden of paperwork.'",
        "'speaker_1': 'The majority of our vulnerable tenants, of people of color. So streamlining this application process is the key to address the issue of access rooted in the racial injustice.'",
        "'speaker_3': 'In our society.'",
        "'speaker_1': 'And as a pastor of an immigrant congregation, I have witnessed firsthand how family and children have been impacted by this pandemic. And our youth have been feeling stressed out because they see their parents struggle to choose between paying rent and putting food on the table.'",
        "'speaker_1': 'So this burden impacts their capacity to engage in school with their studies. So if we want to make sure that our children can have a healthy development and can succeed in school, then we need to make sure vulnerable families have access to the resources that they need the most right now.'",
        "'speaker_1': 'So this new, streamlined process will change the futures of many families and youth, which will change the generations to come in our city. Our Christian sacred text teaches that we are all connected in one family as children of God.'",
        "'speaker_1': 'And some of us, if some of us are in pain, all of us are impacted. For this reason, we believe that developing the development of the streamlined process to provide rental assistance to our tenants as quickly as possible will support the well-being and healing of our city.'",
        "'speaker_1': 'So we ask that you vote yes to approve this recommendation. Thank you.'",
        "'speaker_0': 'Mayor. Vice mayor, council members. Good evening. My name is Mike Murchison. I represent Spier. I represent 100 hundreds and hundreds of other rental property owners that want to commend the vice mayor for bringing this item forward. We also support your fellow colleagues who signed off on this.'",
        "'speaker_0': 'Councilwoman and Councilwoman Allen, thank you very much. I also want to mention the hard work the development services does on this issue because it's been a difficult one. I want to thank Christopher and Oscar for their dedication to this.'",
        "'speaker_0': 'I support the vice mayor's recommendation on this. I support, believe it or not, and be on the same page with a good jobs and healthy community. That's going to be a first for me. But I think the two main issues that I want to bring forward is, number one, streamlining the permit process.'",
        "'speaker_0': 'And I think other speakers have brought that up. That's critical. But the other bigger issue, and I brought this up months ago, is that the federal government has income requirements. And you all saw that in Rex's presentation, the 80% of area median income.'",
        "'speaker_0': 'Those are going to change because you're not going to get to all the tenants in Long Beach. You have, I don't know, 250,000 tenants that live in Long Beach. And I don't know how many of them a high percentage, the oh deferred rent, if you want to get to every one of them.'",
        "'speaker_0': 'Then you go to your California congressional and federal delegation and you talk to them about waiving or reducing significantly that 80% of area median income until that changes. I support obviously expediting and making a one page permit or excuse me, application process, but that income level is what makes it extremely difficult for everybody in Long Beach.'",
        "'speaker_0': 'That has to change. Otherwise, we're going to be in the same boat four or five, six months from now. So I just want to encourage you to reach out to Congressman Lowenthal and others and see what can be done to reducing or getting rid of that income requirement.'",
        "'speaker_0': 'Vice Mayor Richardson, thank you very much. Council people. Thank you. I really appreciate it. One of the rare moments in life where you know me and Mr. Murchison agree. I think that. Am I wise? It makes no sense.'",
        "'speaker_0': 'We have we have a zip code. I love the example that the firemen are use with respect to the state of Kentucky and using zip code measurements. You know, we we know which zip codes are poorer than others and area median income is based on that.'",
        "'speaker_0': 'There are zip codes that have a spectrum of incomes. 90804. If you live on the western, part of that zip code is much different than the eastern part of that zip code. Narrative five is another example. Nine over six I mean, there's a there's multiple zip codes where you have, you know, quote unquote, low income people with'",
        "'speaker_0': 'middle income and higher people living in the same zip code. So if the process is to streamline this effort to pay off the first rent, then I would have to agree we have a rate of above 80% because it's just not realistic.'",
        "'speaker_0': 'There's a reason why over 12,000 applications are not processed yet. I'm unfulfilled, and it has to do with the, you know, the education of those who even know the paperwork, the understanding of it, how difficult it is. And with respect to the streamlined effort, for one, I agree in green in agreement of this.'",
        "'speaker_0': 'I have to say honestly that a lot of the third party organizations that have partnered with the city don't have the reach that they claim that they have. You know, our piece was, I don't know, these no bid contracts that are going through organizations who aren't present in the communities that allegedly they represent in regards to housing'",
        "'speaker_0': '. They have not been able to fulfill their part of the bargain, if not solely on the backs of the city, for why people get these applications in. And with respect to the city, we're going to need massive, you know, boots on the ground.'",
        "'speaker_0': 'You know, maybe a couple of dozen fellowships need to go out and really streamline this on the city side as well as on the applicant side. And also, you know, these rare times that we get federal money to do anything with housing, it shouldn't just be about paying off rent.'",
        "'speaker_0': 'You know, we should be pushing and creating opportunities for tenants to become homeowners because this is just going to become cyclical. Who's to say what's next for Corona 37 or whatever that's going to come down the road and completely shut down our economy again?'",
        "'speaker_0': 'And then we're just going to have to keep doing these things. We need to create opportunities for tenants to become actual homeowners. So just for future mine, because we shouldn't be sending back any money. And although 30% is a, you know, better than everyone else, that's still, you know, a failing grade.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_1': 'Good evening, honorable mayor and Council Members. My name is Elsa Tung, District seven, resident and program manager at Long Beach Forward. I'm proud to join this eclectic group of public commenters in support of this item. Language four does support item 34 to explore creating a streamlined single application process for the ERAP program.'",
        "'speaker_1': 'And we thank Vice Mayor Richardson and Council women's and they have and Allen for their leadership. Now as the presentation showed. Despite Long Beach ranking above our pier cities in rental assistance allocation, the dual eviction and homelessness crises require us to do much, much better at our current rate of rental assistance.'",
        "'speaker_1': 'Disbursement. Long Beach will not be able to pay out its full allocation until August of next year. A streamlined single application process would allow property owners and tenants to organize around submitting one application for groups of vulnerable tenants in eviction clusters to get erap money faster and for more tenants, especially the more vulnerable tenants are covered under'",
        "'speaker_1': 'the program. Here I want to emphasize the data driven policy opportunity. This is an opportunity for the city to develop a proactive process that matches tenants based on vulnerability and geography. So let's first identify clusters of incomplete applications, potentially from a single building or a single particular neighborhood.'",
        "'speaker_1': 'And then let's use well known, publicly available data and metrics. Median household income, racial concentrations of poverty. COVID 19 impacts even concentrations of rental arrears that fall below 80% area median rent. To then target the city services and screen requests for advance payments.'",
        "'speaker_1': 'On the note that the previous commenter made about various income levels being within the zip codes. Yes, that is true, but there is lots and lots of data at the census tract level that can pinpoint and target services and rental assistance even more precisely.'",
        "'speaker_1': 'Emergency rental assistance is not the answer to the eviction crisis, but it is an answer. So let's please vote to make it a more efficient and effective answer. Vote yes on item 34. And finally, justice for Moana Rodriguez.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Good evening. Honorable Mayor. Vice Mayor, City Council, honorable city attorney, city manager, city clerk and staff. Thank you for your time and dedication to the city of Long Beach. My name is John Edmond and I'm the executive director of the Apartment Association of California Southern Cities.'",
        "'speaker_0': 'I'm a long time watcher and a first time speaker. I'm speaking today in support of item 34, sponsored by Vice Mayor Richardson and co-sponsored by council members that has an Allen Long Beach has been a leader in distributing of the erap funds.'",
        "'speaker_0': 'And I just want to say leader in the state for sure. I'd my hat is off to city staff and being able to put together a program and executing it and doing what they've done so far. And it's pretty tremendous at the time that they've had to be able to do that.'",
        "'speaker_0': 'And I think what's happened is we've learned best practices about what can be done, what needs to be done, and what can be implemented with a one application process. Property owners, many of whom are small property owners, stand at the ready to be able to assist.'",
        "'speaker_0': 'They have a lot of information that the tenants need and that the city needs in order to be able to make that happen. And so we want to work with city staff and the city to ensure a streamlined process and being able to make that happen so that we're able to get those funds to those in need'",
        "'speaker_0': '. Thank you for your time and consideration.'",
        "'speaker_2': 'Thank you. Councilwoman Price.'",
        "'speaker_1': 'My question is really for staff. I know I've been talking about this for a long time with you guys. And I know there were some efforts, like kind of a summary. What are we doing? What have we done about the income level?'",
        "'speaker_1': 'That's something that I think our office has been very focused on and trying to expand and broaden that income level because we had a lot of landlords and residents in my district who were not eligible. So what have we done?'",
        "'speaker_1': 'What can we do? What are our limitations? And then the other question I would have is, I think a streamlined process is great, but our streamlined process is really just more of the application process. The requirements are still going to be what's required statewide, regardless of the type of form they have to fill out.'",
        "'speaker_1': 'We're not we're not able to eliminate any of those. Documents that are required. Is that correct?'",
        "'speaker_0': 'Well, thank you, Councilmember. I believe this motion will allow us to reach out to the state and Treasury Department to see if there's other mechanisms beyond what the current regulations allow in order to streamline the process. We've been having conversations with both entities to further push the the risk profile to be able to streamline the process.'",
        "'speaker_0': 'So we will continue that based upon your motion today. In terms of the area, median income, we they prescribed very detailed requirements, 30, 80% and 50% priorities. The charge was to start with 50% priority 50 and my priority then the 80, 80% and my priority.'",
        "'speaker_0': 'We've also modified that a bit to focus in on those that have potential risk exposure to eviction. So we've been moving that forward in terms of any adjustments. That's something that we would need to discuss with the the state and the federal government.'",
        "'speaker_1': 'Is the risk factors. Are those still tied to the income requirements? So there's no risk factors that would outweigh the threshold income requirement.'",
        "'speaker_0': 'That is correct. The risk profile is really based upon the the information and the type of information that we collect. We've been using the attestation process to help those that are requesting funding assistance. We've provided forms in multiple languages to be able to do that, and we keep pushing the envelope, I think.'",
        "'speaker_0': 'The vice mayor indicated the zip code. We've been pushing for the zip code here in Long Beach to be able to have an easier attestation process that goes along with the zip code in areas of need to be able to do that.'",
        "'speaker_0': 'So as far as the the income level, those haven't changed. And so we continue to review that and better understand what we can do to help those income allocations.'",
        "'speaker_1': 'Yeah, I think that's good and that's great and I appreciate everything you're doing. Obviously, we want to be trying to help as many people that are in need as possible. But the. The the fact that the risk factors there's no mechanism for the risk factors to alter that threshold level for aid is ridiculous.'",
        "'speaker_1': 'Because the whole point of this is to try to keep people housed and not. It's ridiculous. Not by your doing. I make that clear. You're limited to what the regulations require you to. But the whole point is to keep people housed and not on the street at a time like this.'",
        "'speaker_1': 'And if someone is at risk of losing their home and they happen to live in an area based on their income and the rent, that they're still going to be kicked out of their home, there's no alternative for them.'",
        "'speaker_1': 'There's no there's zero alternative for them. And I tell you, we get emails all the time from people who are at risk of losing their home and because of their income level, they're not eligible for any sort of aid.'",
        "'speaker_1': 'You know, I've got staff members calling around the property owners, begging them to open up properties at a lower cost so that people don't get evicted. And that's just it's ridiculous that the risk factors don't have some sort of mechanism to lower the threshold for people that are at higher risk regardless of their income.'",
        "'speaker_1': 'And I just don't know if there's any way around it.'",
        "'speaker_0': 'So it's really loud. Council Member There There isn't a way around the income level, but just in case anyone is listening, I would encourage people to apply. So what we are able to do with applicants in that situation.'",
        "'speaker_0': 'So if your prior income was over 80% and you know you would not qualify based on your tax return, we can still qualify that person, but we have to qualify that person. So if my income was at 200% of am I on my last tax return but it's fallen to zero and I can document that it's fallen'",
        "'speaker_0': 'to zero for a sustained period of time, that the more complicated application. But we may be able to qualify that person if a person's income used to be at a very high level and has fallen so much that they qualify for a different form of assistance, whether it's food assistance or any other form of government assistance because'",
        "'speaker_0': 'they've been qualified as low income under that other program, we can use that as a proxy to qualify them. So we are working on those cases that are more complex or difficult, but it's also because they are more complex and difficult.'",
        "'speaker_0': 'You know, they require hours of staff, time for one application and obviously we have thousands of pending applications. So we're doing everything, everything we can. But I think with this item, we're going to have some backing to talk to the state about, hopefully providing us some further flexibility.'",
        "'speaker_1': 'That's wonderful. Thank you. But I did not know that that option was available. So unfortunately, I may be routing some people over to you. So thank you.'",
        "'speaker_0': 'And Councilmember, one last thing. If nothing else, there may be a level of legal protection if they do apply, and we haven't been able to process them because of various levels. So we would encourage everybody that may or may not qualify, that may have a need to nevertheless submit their application to the city.'",
        "'speaker_0': 'We think that concludes public comment. And in the motion there is a motion and a second on the floor just just added. I obviously am very supportive of this. I think the streamlining is really critical. And I do want to thank Mr. Murdoch and our team.'",
        "'speaker_0': 'And you guys are working really, really hard on this topic for many, many months. And I appreciate the regular updates and I know how creative you're all you have all tried to to be and to get as many people support as possible.'",
        "'speaker_0': 'And I know that it's very we have a very complex regulatory and state system that we're working under. So thank you very much. And thank you to all all the folks involved in this proposal, particularly Vice Mayor Richardson and Councilwoman Allen and Councilwoman Linda has.'",
        "'speaker_0': 'Please cast your vote.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Resolution and Outreach for California Clean Air Day.": [
        "'speaker_0': 'Thank you. Next up is 1035.'",
        "'speaker_1': 'Communication from Councilwoman Allen. Vice Mayor Richardson recommendation to request city attorney to prepare a resolution in support of California Clean Air Day on October six, 2021 and request city manager disseminate information to residents about clean air pledge.'",
        "'speaker_0': 'I'm 35 and 35. There is a clean resolution mission, a second public comment on this.'",
        "'speaker_1': 'There's no public comment on the.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_1': 'I'm. Thank you, Mayor. And first of all, I'd like to thank Vice Mayor Richardson for joining me on this item. Poor air quality causes, asthma, cancer and just overall shortens our lives in Long Beach and across the region.'",
        "'speaker_1': 'I spoke about this many times, but I grew up on the West Side and every bit of data we have points to major impacts from the detailed that zone between our horrible freeways. I am a breast cancer survivor with no family history of cancer.'",
        "'speaker_1': 'And it's important that we understand the causes of air pollution and how we change our behaviors and how we start advocating for structural changes in society and the economy. As Chair of our Climate Action and Environmental Committee, I am focused on taking small and large steps to improve our air quality and reduce our impacts on the environment'",
        "'speaker_1': '. This has been brought into sharper focus with a recent oil spill on federal waters off of our coast. Our committee is working with city staff to advocate for cleaner transportation, to support the Climate Action and Adaptation Plan, and to investigate innovative approaches elsewhere to reduce air quality impacts, especially those from transportation.'",
        "'speaker_1': 'Additionally, as a member of the Energy and Environmental Committee, I see regularly the data on the impacts of energy generation on local air quality. I brought this resolution to remind residents of our commitment to cleaning up our air.'",
        "'speaker_1': 'For the benefit of residents today and for the children of tomorrow. We must get better. It will literally saved many lives. Please go to Clean Air Dork Pledge to learn more about how you can clean up our air.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thanks, Matt Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And thank you, Councilwoman Allen, for for partnering up on this resolution. There was an article today in the press telegram, the vicious cycle, fuel, so-called pollution, worst air quality in decades. Well, it's true. We have some of the worst smog that we've seen in L.A. County region and in the south coast basin in'",
        "'speaker_2': 'decades at a time when we have more stringent rules than we've ever had. How does that happen? Well, the vicious, vicious cycle that they're talking about is we're seeing urban heat, island effect. We're seeing hotter temperatures while we also see the diesel particulate matter accelerating the air quality issue.'",
        "'speaker_2': 'So we have higher standards because of climate change, the urgency has significantly increased. What does that mean? The actions that we take on climate action and on air quality together are necessary in order to improve air quality, reduce asthma rates and extend life in our area.'",
        "'speaker_2': 'Earlier this year, I was elected or joined the county board for the first time in a decade that we've had a representative here in Long Beach. We're really engaged in Clean Air Day, which is today, and I represent 51 cities, HMD partners with other agencies.'",
        "'speaker_2': 'Councilwoman Allen mentioned Sky and others, and we allocate over $100 million in funding for low emitting vehicles and equipment. We have some critical deadlines to meet on air quality here in Southern California. Particularly the 2023 federal payment deadline.'",
        "'speaker_2': 'What that means is if we don't make some significant changes. You're going to see some changes in the way all of us move. You're going to see days. EPA will impact implement days where you can't drive in L.A. County, where only essential workers can drive.'",
        "'speaker_2': 'You may see days where the ports. And right now, there's all the ports are backed up. You know, all across America, you may see cargo be diverted to other ports if we don't address this. And that can have significant impacts to our local economy if we don't do the right things on clean air today.'",
        "'speaker_2': 'Earlier this year, we passed a warehouse indirect source rule, a first of its kind, which regulates the types of trucks that can go into Southern California warehouses. That makes a huge difference in areas adjacent to the ports and out in the Inland Empire.'",
        "'speaker_2': 'We're also in discussion on a memorandum of understanding with both ports. It's incredibly important you talk about labor standards, air quality issues and all of that in an agreement with AT&T to address some of the air quality issues that impact our very neighborhoods here in Long Beach.'",
        "'speaker_2': 'So they have a lot of work to do. It's important on clean air to acknowledge that it's more than a resolution. It's time to make sure that we're all getting plugged in on this important goal to achieve a cleaner future that improves our environment, protects jobs, and creates thousands of jobs in a process.'",
        "'speaker_2': 'That's incredibly important. There are a lot of things that we all can do to fight every day for clean air carpooling, mandatory walking, making online purchases in one order instead of cleaning. By now on every one of your purchases you should think about.'",
        "'speaker_2': 'Those are things you should be able to do locally sourcing your meats and your food. All of those things have an impact on our air quality. And so thank you again and adopt this resolution for clean air.'",
        "'speaker_0': 'Thank you. Councilman Sunday House.'",
        "'speaker_3': 'Thank you to Councilmember Allen and Vice Mayor for advocating for California Clean Air Day educational campaign. I'm happy to support this item. We all are too familiar with the negative health effects of air that air pollution causes to everyone, but particularly to our children and to our elders.'",
        "'speaker_3': 'Though these issues certainly require larger scale national and global actions, there are a lot of individual community actions that can be made and that can make a difference. So I'm happy to support this item and I encourage everyone to inform themselves and and to take the clean air pledge that is being made available to all community organizations'",
        "'speaker_3': 'and members.'",
        "'speaker_0': 'Thank you, Councilman. Sir.'",
        "'speaker_1': 'Yes, thanks, Mayor. I just wanted to express my support of this item. I mean, you know, we have a city that is adjacent to the 710 freeway corridor, and my district is adjacent to it. And while we have a higher, you know, it's read in the enviro screen chart reading one area of Long Beach where where the'",
        "'speaker_1': 'air quality is, that impacts all of us throughout. So I think that it's an ongoing daily. I think it's a daily clean air day in all the ways we can do to be conscious of our actions that contributes to our collective action in improving air quality.'",
        "'speaker_1': 'Thank you.'"
    ],
    "Resolution to Declare City-owned Property at 854 East 7th Street as Exempt Surplus Land.": [
        "'speaker_0': 'Thank you. There's a motion in a second. No public comment. Please cast your votes. Just one person. Bush cares. We will do item 38 next, please. Item 30 Report from Economic Development Recommendation to adopt resolution declaring city owned property located at 854 East Seventh Street as exempt surplus land District one.'",
        "'speaker_0': 'Mayor John Casper has assured staff report on this item. Honorable Mayor and members of the city council. I'm going to introduce Mary Tours, who will walk us through what the Surplus Land Act requires for this property at 850 47th Street or the Armory.'",
        "'speaker_0': 'Mary.'",
        "'speaker_1': 'Thank you, Mayor. Members of the City Council. The Surplus Land Act is found in government code section 454220. The purpose is intended to prioritize re-use of surplus lands for affordable housing, parks and schools. It applies to all public land that is declared surplus.'",
        "'speaker_1': 'Notable amendments include expanding definition of local agencies to agencies not previously subject to the surplus land art. Clarifies this position to include leasing and not just sales, clarifies local agencies, does not include commercial or industrial uses, including non-governmental retail, entertainment or office development.'",
        "'speaker_1': 'No longer allows exceptions, but it does exempt expand exemptions available due to size, affordability and other characteristics. It requires city council action to declare a property a surplus or exempt for post prior to disposition requires written notice of availability to the State of California, Department of Housing and Community Development, as well as housing sponsors.'",
        "'speaker_1': 'Requires local agencies to submit their process to HCD for compliance verification. Allows exceed 30 days to respond to that submittal and gives the city a 60 day care period if its notice of a violation. It also imposes penalties if the property disposition is found in violation of authority and is not sure the product.'",
        "'speaker_1': 'The property before you is located at 850 47th Street. If the city gained ownership of this property through a deed reversion once the California Army National Guard ceased use of it as Long Beach Armory. The city did release a solicitation for a long term lease and selected Gundry partners to develop the property as 100% affordable housing development'",
        "'speaker_1': '. Adaptive reuse of the armory building and improvements to combine park. Concurrent to our process, HCA and the state attorney general clarified that the facility does apply to leases. The city then paused negotiations with the developer until we could confirm the process that the SLA modified, as well as the exemption that was available to the project.'",
        "'speaker_1': 'Exemption available to the project in section five for 2 to 1 allows the property to be declared surplus if it meets certain requirements. One, not less than 80% of the building area will be used for housing. Number two, no less than 40% of the total number of units would be affordable to lower income households, and half of'",
        "'speaker_1': 'that 40% must be affordable to very low income. And three, a recorded regulatory agreement providing those minimum standards would run with the plan for 55 years. This project, the current building area, 72,710 square feet. The proposed residential area is 62,200 square feet or 85% of the total area.'",
        "'speaker_1': '63, unit 63 of the 64 units or 98% will be available to low income households, and at least 13 units or 20% will be available to very low income households. And number three, a regulatory agreement will be recorded.'",
        "'speaker_1': 'Next steps for this process. The resolution declaring it 5047 street as exempt surplus property occur. The City will submit the resolution and the regulatory agreement to CBA for compliance verification. 30 days will be allowed for each city to respond if they do not notice the city a violation and that 30 day lapses.'",
        "'speaker_1': 'The city could then restart negotiations with the developer. And should negotiations be successful, an agreement would be brought to the City Council for consideration. Therefore the recommendation of to adopt a resolution declaring a city on property as exempt surplus land as defined in the government code section and authorizes city manager designee to take any actions.'",
        "'speaker_1': 'And execute any documents necessary to ensure compliance with the Surplus Land Act and state regulations. This concludes my staff report. I'm available for any questions.'",
        "'speaker_3': 'Thank you very much for that. Extensive report. And thank you again to our amazing economic development department and to our city manager and city staff for all the hard work that you've continued to do on this project. I'm very, very excited about this.'",
        "'speaker_3': 'I'm very excited to see this process advance and even more excited to see the completion of more affordable housing in my district, which is something that is very, very needed as well. Is various improvements made to our gun binder park?'",
        "'speaker_3': 'This is something that will that will lead to reactivation of that area in a very positive way. And I'm happy to support this resolution, and that will help ensure the project that dances in compliance to the state's surplus land.'",
        "'speaker_3': 'So thank you very much.'",
        "'speaker_2': 'All right. Thank you. Is there any public comment on this item?'",
        "'speaker_0': 'There's no public comment.'",
        "'speaker_2': 'Okay, members, please, guys, remove.'"
    ],
    "Resolution to Declare City-owned Property at 3917 Long Beach Boulevard as Surplus Land.": [
        "'speaker_0': 'Gentlemen. Sorry. Cars.'",
        "'speaker_2': 'I think item 39 is next.'",
        "'speaker_0': '39 Report from Economic Development Recommendation to adopt resolution declaring city owned property located at 3917 Long Beach Boulevard as Surplus Land District eight.'",
        "'speaker_2': 'Staff report.'",
        "'speaker_0': 'Honorable Mayor and members of the City Council. Mary Tours will be giving us a short staff report on this item, which also includes the new Surplus Land Act as defined by the state. Mary, would you like to present it?'",
        "'speaker_1': 'Thank you, Mayor. Members of the city council. I think I will skip slide one, which covers the government code section amendments that we just reviewed in the previous item. The property before you. At 3917, Long Beach Boulevard has operated as Fire Station nine until July of 2019.'",
        "'speaker_1': 'The first complained of visible mold at the site occurred in 2000. Since that time, a number of investigations have occurred, including mold, fungal, asbestos, led based paint and indoor air quality. Remediation attempts were made, but fungal mold and water leakage issues persisted.'",
        "'speaker_1': 'The property is currently vacant as the personnel that formerly operated there was relocated to a temporary station at 2019 Wardlow Road. The remediation that's required includes removal, replacement and or redesign of several areas required to remediate a return to have broken condition, including roof drains, windows, framing, flooring, support and joints.'",
        "'speaker_1': 'The Planning Commission or Environmental Impact Report was considered a Planning Commission's June 17th agenda for potential demolition of the building, but did not preclude re-use. The vote to accept the air was held over until the city could solicit interest in the subject property.'",
        "'speaker_1': 'Solicitation of proposals, various adoptive or otherwise prior to surplus could potentially violate the Surplus Land Act and subject the city to possible monetary fine. The city initiated compliance with Turpel-Lafond Act, the first step of which is for the local agency to declare surplus or surplus, which is the item before you.'",
        "'speaker_1': 'Once all compliance is completed, the air would still need to be certified with a planning permission for any reuse of the site. So compliance does not bypass planning permissions consideration of the air at a future date. The compliance requirements related to the Surplus Landecker declaration include or include finding that the property is no longer needed for the'",
        "'speaker_1': 'fit for public use. The city's reuse requires significant and costly modifications, long term risk, as well as maintenance and security measures, resulting in an ongoing obligation to the general fund. The disposition would allow interested parties an opportunity to reactivate the property, generate sales proceeds, and return the property to the tax rolls.'",
        "'speaker_1': 'Disposition is used neutral, allowing interested parties to propose different uses, including re-use of the building or not as feasible. Disposition does require the local agency's government body to adopt a resolution declaring as either surplus or exempt at a regular meeting.'",
        "'speaker_1': 'The subject property does not qualify as exempt land under the exemptions available in the in the SLA. Upon adoption of the resolution, the city would then be required to follow a process outlined in the Surplus Land Act. And once that process is completed, should an agreement not be reached with any of the entities that are required to'",
        "'speaker_1': 'be noticed? A request for proposals could be released. And any re-use of the subject property would be subject to environmental review. Just the next steps on the timeline for this process. It's a little bit more involved for a property that's declared surplus versus exempt.'",
        "'speaker_1': 'Once the resolution or should the resolution be adopted, declaring it surplus tonight, a written notice of availability would be issued to local public agencies, HPD and housing sponsors that noticed HPD of their interest to be noticed. That would occur in October.'",
        "'speaker_1': 'They would be allowed a 60 day response period, which would bring us to December of 2021. If an interested party notices the city in that time. The city would then commence good faith negotiations for a minimum of 90 days.'",
        "'speaker_1': 'That would bring us to the spring of 2022. If an agreement is reached with a public agency or housing sponsor, that agreement would be brought to the council facility for consideration. If there is no agreement or no interest received, then a request for proposal would be released.'",
        "'speaker_1': 'The city would then complete the request for proposal process, which does include allowing prospective parties to tour the site. And prepare their proposals. Those proposals would be reviewed and a recommendation would be brought to City Council sometime in summer of 2022.'",
        "'speaker_1': 'And then by fall, summer or fall of 2022, the Planning Commission could be updated and reconsider the air. Therefore, the recommendation before you tonight is to adopt a resolution declaring the city owned property at 3917 Long Beach Boulevard a surplus land and authorize the city manager.'",
        "'speaker_1': 'Do we need to take any actions and execute any documents necessary to ensure compliance with the SLA and state regulations? This concludes my staff report. I'm available for any questions you may have.'",
        "'speaker_0': 'Kevin, listen, the second component is you want to start. Thank you. And I am proud to move this motion. First of all, I'd like to appreciate it. Can we go to a public comment for public comment? The following individuals please line up for public comment.'",
        "'speaker_0': 'LAVONNE Janine Williams. My own acre.'",
        "'speaker_1': 'Hi. I'm going to start off tonight, Gene Williams. I am the executive on the executive board of the Ill CNE, which is the Lo Cerritos Neighborhood Association. An email was sent today from the LC and A and I'll read it now again to you, dear Mayor Garcia and council members.'",
        "'speaker_1': 'The neighborhood associations and community groups below are requesting the Long Beach City Council for a 90 day delay regarding fire station nine at 3917 Long Beach Boulevard becoming surplus city property. This delay will give the community additional time to study the feasibility of utilizing the building as a community center or other reuse.'",
        "'speaker_1': 'We are asking for this pause to meet with the Economic Development Department. At this time, we request a postponement on agenda item 39. For nearly two and a half years, we have been denied entrance to the building to review its feasibility as a community asset and need this additional time to continue our access efforts.'",
        "'speaker_1': 'Regards. Bob Gallo, Cerritos Neighborhood Association Cosign Supporting Neighborhood Associations and Community Groups. The American Legion Post 560, Huffington Post. Bixby North Neighborhood Association, California Heights Neighborhood Association. Citizens About Responsible Planning or Caap Coalition of Neighborhood Organizations or Colonial Country Club Manor Neighborhood Association.'",
        "'speaker_1': 'DeForest Park Neighborhood Association, which is a nine. The District nine Friends of Bixby Park, Lakewood Village Neighborhood Association, which I believe is in District five, Long Beach, Gray Panthers, Long Beach Heritage and Low Cerritos Bixby North Clean Street neighbor Naples Neighborhood Watch, which I believe is District three.'",
        "'speaker_1': 'The Neighborhood Association in District nine. People of Long Beach, Ridgewood Triangle Neighborhood Association, Sleepy Hollow Neighborhood Association, South Street Community Watch, Wrigley Area Neighborhood Alliance, which is in seven Wrigley Clinton team Wrigley is going green and there's a lot through this neighborhood association as in seven and eight.'",
        "'speaker_1': 'You know, also, I like the the firefighters museum downtown is showing an interest, but they did not want to commit to they had their meeting tomorrow night to go over the details. And Bob Gale could not make it tonight, which is the president of LCA, because right now he is meeting by Zoom with all the associations to'",
        "'speaker_1': 'increase the communication between our neighborhood group. Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_1': 'Good evening. My name's Lavonne Miller. I'm in District eight and the Long Beach Heritage. Long Beach Heritage has authorized me to. To read this statement. Long Beach Heritage is extremely concerned about the possible declaration of Fire Station nine as surplus property by the Long Beach by the city of Long Beach.'",
        "'speaker_1': 'This Tudor revival style building was designed by a notable local architect, W Horace Austin, in 1938 and constructed by the Works Progress Administration under President Franklin Roosevelt. The exterior retains its architectural integrity, and the original plan is intact and may be eligible for listing in the National Register of Historic Places and the California Register of Historic Resources'",
        "'speaker_1': '. It definitely meets the criteria for a Long Beach historic landmark, and it should not be torn down without first exploring an adaptive reuse alternative. Although a draft environmental impact report was prepared for Fire Station nine, a final air has never been completed nor approved.'",
        "'speaker_1': 'The Planning Commission recommended the Preservation and Adaptive Reuse alternative for the building. The Planning Commission denied the resolution for declaring the fire station surplus property. This matter should be returned to the Planning Commission and the final year should be prepared before the structure can be deemed surplus property by the City Council.'",
        "'speaker_1': 'Long Beach Heritage recommends that you vote against approval of item 20 1-1029 on October 5th. I also have been authorized to read a statement. From Gordon Barney. He writes. Dear Council members, the undersigned has over 50 years experience in the construction and forensics industries, including mold, investigation and remediation.'",
        "'speaker_1': 'In all those years and having investigated thousands of structures and renovated hundreds of both residential and commercial structures, I have never seen a single structure needing to be demolished due to the presence of mold. It is my professional opinion that with proper investigation and scope of remediation, this structure can and should be saved from the wrecking ball'",
        "'speaker_1': '. And in my last 33 seconds, I just like to put my $0.02 in as a beautiful property. A. It's historic. And it's in a neighborhood that appreciates it and needs a community center very much. Thank you.'",
        "'speaker_0': 'Inexplicably the tumor stickers.'",
        "'speaker_1': 'We're here together.'",
        "'speaker_0': 'Yeah. Good evening, Mayor and vice mayor and city council members. My name is Leif Ackerley, and this is my Aichner. We're from the Wrigley area. And we're also Long Beach heritage members. What I what I like to say is that the assumption is that the fire station has no value being designated a surplus property, which concerns all'",
        "'speaker_0': 'who have written letters of protest of you. As you've seen before, there are many groups that are interested in this property and want to see it saved. As I mentioned to you in my letters, our historic properties have value and require stewardship.'",
        "'speaker_0': 'I appreciate the communication from Councilman Austin's office to clarify what the Surplus Land Act is and that the building still requires an e r. However, we heritage are concerned that the process would still allow demolition as an option, and we'd like that removed to a time indefinite to find a buyer.'",
        "'speaker_0': 'Finding a buyer takes takes a lot of time. It takes a person with vision, and it takes a person who has the resources to rehabilitate that building. That doesn't mean that they're not out there. They are out there.'",
        "'speaker_0': 'We just have to have the time to find them. And I would please allow interested community groups to enter the premises to assess the viability of the building. Thank you for your time. Good evening.'",
        "'speaker_1': 'And I'd like to reiterate that, you know, Long Beach has a has a sort of a sordid past about historic properties going down before their time, for example, the Jurgens Trust. But we also have a history of having positive outcomes as well, such as the American Hotel on Broadway.'",
        "'speaker_1': 'So please, hopefully we can have Fire Station nine be one of those success stories. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion in a second. Go back to councilman. Awesome. I thank you. And I want to, first of all, thank you staff for a very thorough. Reporter I think you have answered a lot of questions and dispelled a lot of, I think, misinformation that may be in the atmosphere.'",
        "'speaker_0': 'I also want to thank the people who came forward and took the time out today to come out and give comments and send emails to my office related to this matter. Again, I think the staff report was very, very thorough and answered a lot of questions for me and my colleagues.'",
        "'speaker_0': 'First off, I want to state that fire station nine, the building was determined by our city manager, fire department safety experts to no longer serve or suitable for a firefighter to live in the building. And my number one priority over the last few years since that has happened have been to and I believe it's the city's number'",
        "'speaker_0': 'one priority for the district. I know the community. From what I've heard, one of the top priorities for the district is to actually build a new fire station. And so I've asked out of my office and anybody related to this project to make that a focus for the eighth District.'",
        "'speaker_0': 'Well, Engine and Rescue nine worked out of a temporary station right now. And we're now we've also had the opportunity to acquire a new site for fire station nine, just a few almost a block away from the old fire station.'",
        "'speaker_0': 'We've secured over $8 million for new power stations to build it, and our team is working currently to finalize designs for that new power station. We also have to secure additional resources. I'm sorry. We still have to secure additional resources to complete the construction of the fire station.'",
        "'speaker_0': 'So tonight's action does not and will not determine what the future use of that property will be. We will determine that it will. No. We have already determined that it will not be a fire station. It won't be a place where we house city employees.'",
        "'speaker_0': 'And I know that there are some interested parties, and we've heard from a couple this evening and would like to see the building adaptively reused. And we cannot get to that point of making that determination, in my opinion, or allowing intrastate community groups to submit proposals for such use until we follow state law and first comply with'",
        "'speaker_0': 'the state law plus land. That I've heard from comment that this action is bypassing the Planning Commission and fast track in an effort to demolish the building. So I want to clear the air and make sure that I have an understanding before we go any further this evening.'",
        "'speaker_0': 'Is that the case that this action tonight. Move us forward to a demolition process. Councilmember. I'll ask Christopher Coons to talk about the planning commission process. This this surplus land act process does not circumvent any local decision making or approval.'",
        "'speaker_0': 'Uh, thank you for the question, Councilman Orson. I mean, in summary, the surplus process is a legal process doing it, having to do with the property ownership. But whether the city is the owner or a nonprofit as the owner or a for profit entity or an individual of the owner, they're all subject to the city's land use'",
        "'speaker_0': 'controls. So no matter what happens to this building, no matter who it's owned by, at source, go through the land use process. It has to go through the environmental process and whatever project has to be will come back to the Planning Commission.'",
        "'speaker_0': 'Okay. And since I have you there, Mr. Korn, what was the planning decision Planning Commission's decision related to this particular property? I know it's a separate track. Sure. So the Planning Commission was presented with in the air that would have allowed, among other options, demolition of the site.'",
        "'speaker_0': 'The commission declined to approve that item, and what they instructed staff to do was to delay any action on that approval and actually hand it back to economic development, which is what we did to find out what the marketplace would support that if the city could no longer use the property, what would other possibilities be?'",
        "'speaker_0': 'And my understanding is that's part of what this request process was going to do. And thank you for clarifying that. And that's the way I understand this. And so really by but that information and the way I understand this this evening, postponing this evening's action does not really in any way further advance the opportunity for adaptive reuse'",
        "'speaker_0': 'of the site. In fact, it only proposed postpones and makes the discussion. More longer. So a city staff is laid out from the memo that my office shared with the community back in April of this evening's discussion. The only way to get to the opportunity for our party, for this property or community groups, interested organizations along with'",
        "'speaker_0': 'anyone to submit proposals for the desired uses for this property is the first comply with the Surplus Land Act, which has to be declared this evening. And so it's only going to go through this process that the city staff of my office can then report back to the Planning Commission with additional alternatives for the site they requested'",
        "'speaker_0': 'before taking action on the air. And nothing will happen with this building, and for that matter, returns to the Planning Commission for consideration of the air will have that correct. Yes, that is correct. And this will allow us to move forward to to receive proposals from any group that's interested in reusing this property.'",
        "'speaker_0': 'Okay. So we've hopefully cleared up some of the confusion that is out there in the community. Again, no outcomes have been determined here this evening and no outcomes are being determined here this evening. What we are should be determining in this council determining is a process to get us to a place where we can actually have a'",
        "'speaker_0': 'conversation about adaptive reuse if there's an opportunity to do that with fire station. I move that we improve staff recommendations and ask my colleagues for their support. Thank you. It is emotionally second cousin Ringo. Thank you, Mary. And I want to thank accounts, remember asking for clarifying all the issues involved with this process.'",
        "'speaker_0': 'And it is a process. And just to reiterate that, it's a process that will continue into the future, because we are looking at options. We are going to be offering it out there for additional purposes of reuse. But the one question I do have one question.'",
        "'speaker_0': 'Has there been an assessment made on that property as to the value that we might be looking at in the future?'",
        "'speaker_1': 'Malcolm in the first minute, an evaluation has not been conducted, but that will be part of the process as we move forward.'",
        "'speaker_0': 'Okay. Thank you. That's all. Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor, and thanks, Councilman Austin and Councilman Turanga and city staff for the presentation. I think it was very informative, illuminating. Also want to take a moment just to acknowledge some of the neighborhood groups they reached. They came in toward Station 12 over the weekend.'",
        "'speaker_2': 'The which we adaptively reused in the ninth district. And we opened the new rest, the new station 12. And we, you know, so they reached out, they helped out with a clean up. And we had a conversation, told them kind of how we got to where we got to.'",
        "'speaker_2': 'And I think it was an important conversation. I think it helped inform tonight's conversation a bit. I do want to ask Mr. Koonce, I think it would be good for people to understand the differences or whoever is appropriate.'",
        "'speaker_2': 'I think Mr.. And perhaps Mr. Coons, the differences between how we adaptively reuse Station 12 versus Station nine and or Station 12, a lot of the concerns around the and this is perhaps around mold remediation. But if someone could just help clarify for the public how that that's very different.'",
        "'speaker_0': 'So, Mr. Vice Mayor, I'm going to answer your question, but I also want to say part of the surplus property process is, you know, we're going to be looking at what others creatively can come up with, which might be different than what the city came up with and its analysis.'",
        "'speaker_0': 'So prior in the years prior, you know, this property could no longer be used by the fire department. And we looked at with fire and public works and economic development, we looked at what are the issues with this property.'",
        "'speaker_0': 'So the mall, they've been remediated multiple times. And from a risk management standpoint, even if we remediated it once more, it was we're not going to be able to have a fire station at this location. So we would be.'",
        "'speaker_0': 'Accepting a different amount of risk than was the case. And in the fire station where your field office is today. The other thing that we looked at and again, if money were no object, maybe it's not a concern, but the historic nature of the property in order to remediate the mold in a way that would have finality'",
        "'speaker_0': 'and not have risk going forward, you'd need to remove the roof and build it back differently than what's there today. And you may have to remove large portions of exterior wall. There may be a way to just remove interior wall, but once you don't know until you're in there.'",
        "'speaker_0': 'So what that consultant team with consultants from USA Environmental Sciences found was that once you do all of that, once you remove the roof, build it back differently, remove portions of the wall. Even when you put the thing back together, it's actually lost its historic nature, which is different than the biggest issue with the fire station near'",
        "'speaker_0': 'District was it was not ADA compliant. So if you remember, we had to spend some amount of money on ramps and different door improvements, but we were still able to maintain what's called the integrity of the building. Does it have enough historic material in it to remain historic in nature?'",
        "'speaker_0': 'But again, I say that with the caveat of that was based on our analysis and our experts. But there is a lot of creativity out there among both for profit and nonprofits that might be interested in this property and they may be able to find a different solution.'",
        "'speaker_2': 'Certainly, I just thought it was important to raise that up. We had a great conversation over the weekend and I said I would inquire what the differences were. I think you articulated that, and I think it's important to note and underscore what we just heard councilman often say, that this doesn't preclude a conversation about what the future'",
        "'speaker_2': 'looks like for that site. Anything it more formalizes that process. I like when we can adaptively reuse buildings. I like when we can, you know, preserve the history of buildings. But I think the Surplus Land Act, I don't think that was even in place when we had the conversation about Station 12, which is a different landscape today'",
        "'speaker_2': 'with Station nine and 12 and 12. But thank you so much.'",
        "'speaker_0': 'There's a motion and a second. Please cast your vote.'"
    ],
    "Request by Grand Prix Association of Long Beach to Leave Concrete Blocks in Place and Amend Operating Agreement.": [
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Next to item 40, please.'",
        "'speaker_1': 'Report from Economic Development Recommendation to consent to a request by the Grand Prix Association of Long Beach to leave concrete blocks from the 22021 Long Beach Grand Prix and place along Seaside Way Shoreline Drive and within the elephant lot for a period of seven months and authorize city manager to amend and or apply for California Coastal Commission'",
        "'speaker_1': 'approval of the same and authorize city manager to execute a First Amendment. To amend and restated operating agreement with Grand Prix Association of Long Beach District to.'",
        "'speaker_0': 'Davenport police. And Honorable Mayor and members of the City Council. I'm happy to present this amendment to our agreement. This is a one time amendment. We have an agreement with the Grand Prix Association to run the race between 2017 and 2023.'",
        "'speaker_0': 'That's the current agreement. During this time, we experienced, of course, COVID 19, which meant that we had to work with the Grand Prix Association and Jim Macmillan, who's here tonight to actually change the dates of the race. And as you all know, Jim, and the association was able to run a very successful race this past month.'",
        "'speaker_0': 'The association has requested a one time request to leave some of the infrastructure in place because the next race will be run in approximately seven months. And this April, at its normal time, this one time request would allow for about 1000 concrete blocks to remain in place along seaside way shoreline east of Pine and the elephant lot'",
        "'speaker_0': '. And you can see an image of of where those placements would be and that would stay in place through a May 1st, which would get us through the next race. There are some estimated savings for the the work that's associated with setting those blocks up and removing those blocks again.'",
        "'speaker_0': 'And the association has committed to using some of that that savings for applying in oil treatment that will help to make the streets look new again and ultimately beautify the area. This will also result in three days less set up time for the April race and will reduce the amount of noise and other impacts to traffic and'",
        "'speaker_0': 'quality of life that occur during the setup process. One last thing is, is that this action by the City Council for a one time change to a two hour agreement would actually require consent by the Coastal Commission because this is in the coastal area.'",
        "'speaker_0': 'So we would have to take this request to the Coastal Commission after the City Council decision tonight. So the association will also to to ensure that this is a positive change for the community, will inspect the infrastructure bi monthly, remove all graffiti and ultimately add the city to its insurance so that while they remain in place, they're'",
        "'speaker_0': 'not a liability to the city or the public. And ultimately, the recommendations here to accomplish this request would be that the Council approve the city manager to amend our agreement consenting to a request by the Grand Prix Association to leave concrete blocks from the 21 Long Beach Grand Prix race in place in the areas that were identified'",
        "'speaker_0': 'for a period of seven months, authorize the city manager to execute all the documents necessary to amend or apply for the Coastal Commission, approval the permit, and allow the city manager or designee to execute the documents necessary for the First Amendment to the Operating Agreement with the Grand Prix to amend provisions of the agreement if necessary.'",
        "'speaker_0': 'So that's the end of my report. I'm happy to answer any questions. And um, Jim McCallum, you very much here tonight. To answer any questions, I would like to point out we've had a couple of questions about is this going to impact the aquarium, is going to impact Pyke or the Hyatt on that side?'",
        "'speaker_0': 'And the answer is no, it's only on the east side of Pine Avenue. So it was specifically set up where there is no business activity to prevent the problems with the ingress and egress. Thank you very much. We have a motion and a second public comment, Councilman Allen.'",
        "'speaker_1': 'Yes. Thank you, Mayor. First of all, I just want to say that the Grand Prix was a great success. It was awesome to see all the activity going on in downtown Long Beach and just a huge thank you to Jim for all the work that you did.'",
        "'speaker_1': 'I know this wouldn't happen without you. So just a big congratulations on a very successful event. Over 180,000 people attended the Grand Prix. It definitely exceeded my expectations and was just a successful and also an extremely safe event for the association and for the city.'",
        "'speaker_1': 'So just thank you, Jim, for all the work that you put into that. As we know, the Grand Prix will be returning next April. So I think it makes sense, given how beneficial this event is for the city to allow the association to leave up some of the concrete blocks in place, especially in the in areas where'",
        "'speaker_1': 'nearby residents. I think it will cut down on the noise both right now and then significantly during start up. I think set up would start again in February or March. And so that's a big impact. And I think since it's so close around the corner that that does make sense to keep some of those concrete blocks in'",
        "'speaker_1': 'place and and then exchange the association will pay for the oil, emotion, treatment of the asphalt portions of the track to make sure that the streets are looking good. Also, I appreciate City Manager Modica for making sure that answering that question about the businesses and the impact of the businesses.'",
        "'speaker_1': 'So definitely want to reiterate that this will not impact and impact any of the businesses that live on the east side of pine. So I just want you to know that I support this item. And thank you very much, Jim.'",
        "'speaker_1': 'Thank you. And ditto to everything Councilwoman Allen just said to the entire Grand Prix team. And the events in this area really affect mostly Councilman Allen's district. So I'm happy to support her recommendation. And second, this motion.'",
        "'speaker_0': 'Councilman in the house.'",
        "'speaker_3': 'Thank you, Mayor. A huge thank you to Jim and the Grand Prix team on behalf of all the residents who loved the Grand Prix. Thank you. Thank you for bringing it back this year. We know that COVID has has forced many, many events to either be canceled and postponed.'",
        "'speaker_3': 'And I think we were so very lucky to have the Grand Prix, even though it was later in the year, but we were able to have it and that made a lot of people happy. And so however, I'm super excited that is going to be coming back in its traditional month in April.'",
        "'speaker_3': 'And so I think that this totally makes sense. I totally agree and I'm very supportive of this item and I'm glad to hear that it won't be affecting our businesses, which was one of the main concerns of our residents in the area.'",
        "'speaker_3': 'So again, thank you very much, Jim, for the exciting times that you bring to Long Beach.'",
        "'speaker_0': 'With emotion. In a second, please cast your votes.'",
        "'speaker_1': 'Ocean is carried.'"
    ],
    "Resolution of Intention to Amend CalPERS Contract for LBMA Classic Public Safety Members.": [
        "'speaker_0': 'Thank you. The next few items here seem. I already go to item 42 through 47. None of them have staff presentations. So let's go ahead and start with item 40, 41, actually 42. And sorry, we're going to do 41 most 42.'",
        "'speaker_1': 'Item 42 Report from Human Resources Recommendation to adopt a resolution of intention amending the city's contract with CalPERS to include a mandatory employee contribution of 3% applicable to the Long Beach Management Association, classic Public Safety CalPERS members, and declared an ordinance to amend the city's contract with CalPERS to provide the mandatory employee contribution of 3%.'",
        "'speaker_1': 'Read the first time and later to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'There's a motion. Can I get a motion in a second place? I one member of the public. Mr. Cantero, please come forward. Is this under Mr. Kaiser's department? Is it? I was just curious to ask, um, why or why with respect to public safety, is it, um, just being introduced for like the other divisions that pay into'",
        "'speaker_0': 'CalPERS? Because my mother pays into as well. So it's a current union topic. So just curious to know. There's a motion in the second. Members discussed votes.'",
        "'speaker_1': 'Council member on.'",
        "'speaker_0': 'Did you come from a did you want to ask the question before we went to the vote? Yeah, I just wanted to give a staff an opportunity just to clarify, uh, the question from public comment.'",
        "'speaker_1': 'Oh, I didn't catch his question. I sounded like he was.'",
        "'speaker_0': 'Inquiring.'",
        "'speaker_1': 'About why this was public safety.'",
        "'speaker_0': 'Oh, I'm sorry. This is a pick up. This was a result.'",
        "'speaker_1': 'Of the negotiation.'",
        "'speaker_0': 'With the Long Beach Management Association.'",
        "'speaker_1': 'Public safety. So this is a contract amendment for.'",
        "'speaker_0': 'There for them to.'",
        "'speaker_1': 'Pick up 3% of the employer.'",
        "'speaker_0': 'Cost. So the reason why this is a contract amendment.'",
        "'speaker_1': 'Now we did one with away. We had to finalize that and now we're doing the next group. But it's basically.'",
        "'speaker_0': 'For the group. They agree to.'",
        "'speaker_1': 'Pick up.'",
        "'speaker_0': 'Part of the employer court for the picture. An excited please 43 To clarify, it's the Human Resources Department. Public employee matter things.'",
        "'speaker_1': 'The motion is carried 703 triggers. So to clarify, this is actually management publication. Public safety, police and fire. So Poway has already done it. Our lifeguards are upcoming and then it's pending with firefighter. So it's public safety management for fire and police.'"
    ],
    "Amend Contract with Los Angeles County Metropolitan Transportation Authority for Law Enforcement Services.": [
        "'speaker_0': 'Thank you very much. We saw the motions being carried. We're moving to the next item 43.'",
        "'speaker_1': 'Item 43, report from police recommendation to amend contract with the Los Angeles County Metropolitan Transportation Authority for providing law enforcement services for a revised contract amount not to exceed 33,223,590. District 12678.'",
        "'speaker_0': 'There's the motion in a second. Mr.. Contrary to public comment. So, so we've had multiple, uh, news reports for relation from the Post Press Telegram, even the L.A. Times about the hyper, uh, policing of the, I believe, five metro stations that go through.'",
        "'speaker_0': 'Uh, I'm just curious, uh, you know, obviously. The public is so interested in this topic. But for those watching, I think I'm just curious to see, you know, if this does seem excessive to anyone else. I mean, with respect to the arrests that occur on the blue line, it's disproportional or what respect to the entire Metro transit'",
        "'speaker_0': '. And I think you're a former member, now mayor of the board. So I'm just curious, you know, as a public citizen, just the amount of policing that really, you know, fiscally speaking, you know, if it if it's a bit of excessive.'",
        "'speaker_0': 'Um, thank you. Motion in a second place. Members, please cast your vote.'"
    ],
    "Amendment to Purchase and Sale Agreement with City Ventures for 4800 Long Beach Boulevard Property.": [
        "'speaker_0': 'Thank you. We're going back up to 1841.'",
        "'speaker_1': 'Report from Economic Development Recommendation to authorize city manager to execute all necessary documents with City Ventures to amend the Purchase and sale agreement to allow for a reduction in sales price and amount up to 289,000 District eight.'",
        "'speaker_0': 'Honorable mayors and members of the city council. I'm gonna introduce Mary Torres to give us a short staff report on this item. Thank you.'",
        "'speaker_1': 'Thank you, Mayor. Members of the City Council. Uh, this project, the item before you is for the project at 4800 Long Beach Boulevard. The development at the site will be 18 three story townhomes that will be for sale.'",
        "'speaker_1': 'This project was first approved by the City Council on June 21st, 2016. Uh, we came back to City Council in June of 2021 to reduce the price to $1,109,056 due to dedication of approximately 5000 square feet of property that was due to dedication for City Street.'",
        "'speaker_1': 'In preparation for construction of the project soil. A testing was done and elevated levels of lead were found to be in the soil and need to be remediate in order for residential construction to occur. The estimated cost for the removal was approximately $452,000.'",
        "'speaker_1': 'The city and the developer have agreed to a cost sharing with the city, contributing up to 64% or $289,000 and the buyer up to 3030 6% or $136,000. Additionally, a buyer will also conduct all those remediation activities and will cover any costs that exceed the city's share of $289,000.'",
        "'speaker_1': 'This reduces the proposed sale price to no less than $820,000, and that's only if the full share of $289,000 is realized. So far the project status. There are some milestones to be noted. The project has been fully entitled.'",
        "'speaker_1': 'The project is in building project and nearing completion for the construction permit. The soil remediation will be conducted once the amendment to the agreement is approved. And once remediation is completed and construction permits are issued, construction will be there for the item before use to authorize the city manager to execute any and all necessary documents with the'",
        "'speaker_1': 'developer to amend the purchase and sale agreement to allow for the reduction in sale price. Her purchase price in amount, no less than $820,000 to cover the remediation costs for the project. This concludes my staff report. I'm available for any questions.'",
        "'speaker_0': 'Thank you. There's a motion and a second. I believe that public comment can be. Of course, as we can see, the quote unquote, housing advocates and quote unquote housing providers have left the room ample opportunity to speak about housing, but no one's here.'",
        "'speaker_0': 'This is a describe, I have to say. They cut this land for a steal and now they want the city to pay to clean up the land that they got to steal. This land has been empty for quite some time.'",
        "'speaker_0': 'I'm sure the History Council can tell you it's right over there by Johnny Rebs and everything, and that is above. And you know, my issue with this is, for one, it's a Delaware limited liability company based in San Francisco, in Irvine.'",
        "'speaker_0': 'So we can clearly see that they don't like to pay their taxes and they feel very comfortable with leaning on municipalities to pay the difference for things. But when I went on their page, you know, doing during this housing crisis we're dealing with, I looked up and they said, City Ventures is a rapidly growing California homebuilder focused'",
        "'speaker_0': 'on repositioning underutilized real estate into residential housing in supply constrained coastal urban infill areas as well as high demand suburban locations. So we have 18 three story townhomes being built. None of them have any inclination of affordable housing connected to them.'",
        "'speaker_0': 'They're all going to be market rate. Okay. I have no problem with that. That's just the reality of the market and you get what you get. My issue is why does the city have to pay the difference for and soil remediation?'",
        "'speaker_0': 'They should pay it. They're going to make, you know, square for 5 million on top of the project. I don't know why we have to cover, you know, like the similar TLT thing, like these these developers, they they get opportunities.'",
        "'speaker_0': 'Okay, you have the money, you can have the opportunity. But why do we have the taxpayers have to cover the difference for them? Thank you. That concludes public comment for this item. Please cast your vote through a motion in a second with enough for me.'",
        "'speaker_1': 'Motion is carried.'"
    ]
}