{
    "Budget Hearing for Police, Fire, and Parks, Recreation and Marine Departments.": [
        "'speaker_2': 'we get through these hearings, but we're going to get through those first. And so hearing item number one, of course, is our hearing on on fire and police tonight. And I believe we're also doing one other department. And so I'm going to and turn this over to Mr. Westminster Modica and the budget team.'",
        "'speaker_1': 'Thank you, Mr. Mayor. Council members tonight begins in earnest our budget hearings. So we're going to hear from three departments. They're going to make presentations on their budgets. We're going to hear first from the police department. Next, we're going to hear from the fire department.'",
        "'speaker_1': 'And then we're going to hear from the Parks Recreation and Marine Department. These are part of our continuum of public safety departments that help keep our communities safe. And with that, I'm turn it over to our chief, Robert Luna.'",
        "'speaker_7': 'Good evening, Mayor Garcia and members of the city council. The police department performs a variety of public safety services. Our core services are delivered through the work of five bureaus and 17 divisions. Our core services include 24 seven response to 911 emergencies and general calls for service.'",
        "'speaker_7': 'Investigating Misdemeanor and felony crimes. Homeland Security, including protecting major critical infrastructure such as the port, the airport and Metro Blue Line. Providing contract services to city partners such as. Long Beach Unified. Long Beach. City College. Long Beach Transit.'",
        "'speaker_7': 'The Civic Center and the Pike outlets. Our department also trains, equips and plans for response to natural. And man made disasters, including recent examples such as earthquakes and mass casualty shootings. I want to sincerely thank all of our employees and volunteers who do amazing work.'",
        "'speaker_7': 'Our department has many accomplishments to share. The men. The men and women of the Long Beach Police Department are committed to excellence. I am pleased to share that through their hard work, we responded to over 208,000 dispatch calls for service.'",
        "'speaker_7': 'We have a year to date average response time of 4.4 minutes to priority one calls for service and a 4.2% reduction in total Part one crime for 2019. In Fy19, the police department funded 50 public safety operations and event action plans through the Neighborhood Safe Streets Program.'",
        "'speaker_7': 'These funds have supported collision reduction, school traffic safety, property crime suppression, homeless outreach, fireworks enforcement, prohibited firearm operations just to name a few. And I really want to thank the mayor and all of you sitting at the city council for your support in this program.'",
        "'speaker_7': 'I am proud to share that. Out of 507 17 laboratories in the world, our Long Beach Police Department crime lab was the first internationally accredited forensic laboratory to meet the strict standards of the and see Askew Accreditation Board.'",
        "'speaker_7': 'Forensic analysis supports our ability to investigate crimes and is a vital law enforcement tool. Thank you to our crime lab employees for their amazing work this last year. The police department has made huge strides to implement smart policing methods throughout the department to make our processes more streamlined and efficient.'",
        "'speaker_7': 'We are nearing our first full year of stabilized body worn camera technology with 250 cameras deployed in the north and south patrol divisions. In December of 2018, the Department successfully implemented a mobile application to comply with Assembly Bill 953.'",
        "'speaker_7': 'This legislation requires all police officers to record their demographic perception of all individuals who are detained or stopped. The Department began collecting this data in January of 2019 and will officially submit data to California to the California Department of Justice in April of 2020.'",
        "'speaker_7': 'We are also in the procurement stage of acquiring a modern, modernized records management system, which is typically, typically called arms. Nearly every police department employee uses the arms system. Arms is a core technology that helps our department operate.'",
        "'speaker_7': 'We look forward to choosing a modern solution that streamlines our data entry, data storage and overall records management. Responding to homelessness and quality of life issues are top priorities for the police department. We have increased our original Quality of Life program from two officers.'",
        "'speaker_7': 'Currently deploying six quality of life officers today. Two are funded by measure MJ revenue. Two are funded by Measure eight and two by L.A. Metro. Additionally, through the use of prop funds, we are working to increase our Met team from six officers and six clinicians to eight officers and eight clinicians.'",
        "'speaker_7': 'The police department supports restorative justice efforts, including warrant clearance and expungement opportunities. Our department is held for workshops partnering with City Prosecutor Doug Halbert. In total, we have helped clear 167 warrants. Building community trust through relationships. Transparency and accessibility is a foundational principle supported by the Long Beach Police Department.'",
        "'speaker_7': 'Year to date, we have attended over 150 community meetings and trust dialogs over the past year. We have strengthened our working relationships with the Lee Human Relations Commission to discuss potential policy and procedural changes. The BPD management team also participated in eight trust dialogs led by the Long Beach Interfaith Community.'",
        "'speaker_7': 'Under this effort, we met with many diverse community groups to understand their perceptions of law enforcement and to share our policies and procedures related to hiring, equipment, accountability and training. Recently, we have taken proactive efforts to meet with our community groups to have open conversation on the Long Beach Police Department's stance on immigration enforcement in our city'",
        "'speaker_7': '. Long Beach Police Department team has also chosen to prioritize wellness for both our community members and employees. We onboarded an employee wellness coordinator to help guide injured employees to a pathway of recovery, allowing them to return full duty more quickly.'",
        "'speaker_7': 'Thank you. And we want to thank the city attorney's office, human resources and financial management departments for helping us accomplish this effort. We are proud to share that. We have partnered with Counseling Team International to provide short term and emergency mental health services for our employees.'",
        "'speaker_7': 'We are optimistic that this partnership will allow our first responders to have long, successful, successful careers despite the trauma they see on a daily basis. The police department is also working on a collaborative partnership to on board a program that provides personal, immediate trauma informed care to members of our community who who have experienced traumatic situations.'",
        "'speaker_7': 'That's you. And that's why 20 the proposed police department budget totals $264 million. The total full time equivalent count is 1251 FTEs, which includes 851 sworn and 400 civilian employees. In addition, our operations are supported by over 250 volunteers.'",
        "'speaker_7': 'The Police Department's proposed Fy20 budget reflects many notable changes required within our department to comply with new state legislation and new programs. Roughly $870,000 is needed to support our body worn camera contract. This will increase the number of cameras from 250 to 875 cameras.'",
        "'speaker_7': 'These cameras will be deployed to nearly all sworn in the four geographical patrol divisions and two specialty sworn units and Investigations Bureau, as well as Field as well as the for the Field Support Division. While expansion is planned to include contract services groups such as the airport, port, Long Beach Transit and City College.'",
        "'speaker_7': 'Deployment to these operations may take a little bit of more time, a little bit more time. Cost sharing and infrastructure details need to be finalized before implementation. 850,000 is proposed to add nine civilian full time equivalent to support the full implementation of the body worn camera program.'",
        "'speaker_7': 'These positions will provide our department with basic resources to begin the initial compliance with Senate Bill 1421 and Assembly Bill 748. Both bills require full release of documents, audio and video files within a timeline set by state law.'",
        "'speaker_7': 'The Justice Lab will be fully implemented and funded by the police department budget by converting to existing civilian positions to support this program. The Department proposes to add a public affairs officer to assist with strategic communications funded by the Special Advertising and Promotions Fund Group.'",
        "'speaker_7': 'And as I have mentioned earlier, add an administrative analyst to position to serve as a department's wellness coordinator. Funded by the Insurance Fund Group. Structurally measuring is is is a huge funding source for the police department. It has helped us maintain 86 sworn position positions and enhances police operations by supporting 21 additional police positions in FY 20'",
        "'speaker_7': 'or the FY 20. Budget also includes one time measure funding for the Neighborhood Safe Streets program at 2.2 million, which is an increase from 1.9 million. Measure eight will allow us to continue to fund jail our jail, mental health, clinician services and one time costs for the body worn camera program.'",
        "'speaker_7': 'As the police department looks ahead into Fy20, there are also many challenges. Unfunded legislative mandates are a serious concern for all of us in the city. As you can see in this slide, the police department has been impacted by multiple state legislative mandates that place new and extra responsibilities on the department with no funding.'",
        "'speaker_7': 'Most of the legislation targets information sharing, which, while important, is very technical and cannot be done without a combination of new technology, staffing and vendor contracts to comply with these new laws. As highlighted on this slide, the police department is in the process or has already implemented a solution to comply with the laws that require us to'",
        "'speaker_7': 'report race based information and produce public records within an expedited timeframe, including audio and video data. Assembly Bill 953 Senate Bill 1421 and Assembly Bill 748 alone have an estimated minimum financial impact of approximately $2.5 million annually, and we are still exploring the full cost that's going to impact our city.'",
        "'speaker_7': 'As I mentioned earlier, Assembly Bill 953 places additional workload on police officers required requiring that they enter multiple perceived data points for entry stop for every stop and detention that is conducted. On top of cell phone costs used to capture this data officer time spent on detention and stops have increased due to this additional task.'",
        "'speaker_7': 'This takes officers away from doing proactive community based police work. Senate Bill 1421 An Assembly Bill 748 have brought in the types of document, video and audio records that must be released under public record release laws. Specifically, Assembly Bill 748 requires that all police video and audio footage of critical incidents be released within 45 days of a'",
        "'speaker_7': 'public records request act. As previously previously mentioned in the FY 20 budget, we have requested additional civilian staffing to assist with the review, gathering redaction and data extraction of these files. I must emphasize that it is unknown whether these new resources will be sufficient to meet the new state law.'",
        "'speaker_7': 'For legislation where implementation is still pending. The police department is working with a variety of partners to understand how to comply with these new and potential laws. Senate Bill ten Cash bail reform is on the ballot in California as a vital referendum on November 3rd, 2020.'",
        "'speaker_7': 'Senate Bill 978. While Chapter has an effective date of January 1st, 2020, this provides the department some time to adjust to this new law. I would like to emphasize again that these new and proposed laws do not include any additional funding for local law enforcement agencies.'",
        "'speaker_7': 'However, despite these challenges we are optimistic for. F1 20. I am pleased to report that the police department has had no intentional officer involved shootings in the past 16 months. I want to repeat that I am pleased to report that our police department has had no intentional officer involved shootings in the last six months.'",
        "'speaker_7': 'I don't know if that's ever happened in our history. We accomplish this by improving our internal review of department operations. We have issued a variety of moderate force equipment options, such as 40 millimeter projectiles to our field officers.'",
        "'speaker_7': 'We have expanded our training and do more life scenario based training with the use of our simulator at our training facility. We also train officers to use de-escalation techniques whenever possible and using time, distance and cover when officers interact with suspects in high risk encounters.'",
        "'speaker_7': 'We are also appreciative of the support to convert existing resources into key management positions, such as the Assistant Chief and the Professional Standards Administrator to help navigate the police department through these legislative, legislatively challenging years. Our department is committed to promoting diversity among all levels of the department, and I am pleased to share that increasing diversity is'",
        "'speaker_7': 'reflected in our police recruit, hiring supervisory ranks and command staff. The Department. The department is also looking forward to the construction of a new training facility and public safety parking structure, which will help support our current operations. Lastly, city wide an investment in our technology, infrastructure and fleet has benefited our ability to serve our community well, providing'",
        "'speaker_7': 'a safe city for all people. This concludes my presentation and I'm going to be around to answer any and all questions at the end before I turn it over to my partner at the fire department.'",
        "'speaker_2': 'Thank you. I think we're going to be moving on to the fire department presentation. I'm going to hear all the presentations and we'll come back and do all the other questions. And just as an update also. As the rules were adopted.'",
        "'speaker_2': 'So because this is a hearing and hearing hearings, the limits that that were adopted as far as speaking time and questions from the body, I think are are do not apply on hearings because of their usually extensive and and they're sometimes legal in nature.'",
        "'speaker_2': 'And that's something that the city attorney and I have talked about as well. So.'",
        "'speaker_1': 'Fire Chief Javier Espino.'",
        "'speaker_8': 'This evening, I'll be providing a brief overview of the Long Beach Fire Department's fiscal Year 20 proposed budget. Our presentation will highlight the services provided by the Fire Department. Some of our key accomplishments for the current fiscal year.'",
        "'speaker_8': 'Notable changes in the fiscal year 20 proposed budget and some of the major issues and opportunities that we foresee for the upcoming fiscal year. The Long Beach Fire Department delivers fire rescue, emergency medical services, marine safety responses, hazardous materials response and non-emergency response services to residents, businesses and visitors in the city of Long Beach.'",
        "'speaker_8': 'We provide a 24 hour operation in which all first responders must be prepared at all times. Additionally, we work to ensure the safety of the community and to prevent fires through proactive fire prevention and code enforcement programs. We also provide training and education that is essential to the delivery of our core fire and search and rescue services'",
        "'speaker_8': '. I would now like to present some of the fire department's accomplishments and highlights for the current fiscal year. Over the past 12 months, we've responded to over 72,000 fire, emergency medical services, marine safety and other emergency incidents. Since many incidents require multiple units to respond, these 72,000 incidents equate to more than 140,000 unit responses.'",
        "'speaker_8': 'Included in this number are over 51,000 medical calls and over 5700 fire calls. This number also includes hazardous materials responses, airport responses and other non fire responses. A major highlight of the current fiscal year is the expansion of the Homelessness, Education and response team to two units.'",
        "'speaker_8': 'Together, the two units completed over 2500 interactions comprised of 1800 proactive contacts and 700 dispatches to incidents involving persons experiencing homelessness. The heart units have improved the fire department's response capabilities and would not have been possible without Long Beach measure funding.'",
        "'speaker_8': 'Working in partnership with UCLA and supervisor Janice Hahn. We've recently incorporated a mobile stroke unit into the city's emergency response profile. This unit enables the potential to diagnose and treat stroke victims in the field, thereby increasing our ability to provide specialized lifesaving care to stroke victims before they even get to the hospital.'",
        "'speaker_8': 'Fiscal school year 2019 was and continues to be a very successful year for the Long Beach Fire Department. We realized great success with our Fire Recruit Academy. The Academy attained designation from the State Fire Marshal as a state accredited local academy, and the 2018 Academy graduated 22 new firefighters.'",
        "'speaker_8': 'Our Fire Prevention Bureau promoted community safety and economic growth by conducting over 8000 residential construction and business related fire safety inspections. Our training cadre has developed and is currently conducting the department's first ever Engineer Academy. The Academy is due to graduate candidates within two weeks and is anticipated to be highly successful.'",
        "'speaker_8': 'This year, our Long Beach fire ambassadors have impacted more than 4000 students throughout the Long Beach Unified School District by providing fire safety demonstrations and instruction. And finally, our Strike Team units received the Red Cross Hometown Heroes Award for their response to the Woolsey Fire.'",
        "'speaker_8': 'Their efforts positively impacted the residents of that area and were responsible for the protection of many residences and structures. The proposed fiscal year 20 budget for the fire department is $130.8 million. We comprise a total of 533.86 full time equivalent staff consisting of 405 sworn PhDs in the fire ranks.'",
        "'speaker_8': 'Another 25 full time year round marine safety first responders, over 180 seasonal lifeguards and 26 full time ambulance operators. Additionally, the fire department is supported by civilian staff in fire operations, support services, fire prevention and administration. 76% of our budget is in the general fund, which supports most departmental activities.'",
        "'speaker_8': 'The proposed fiscal year 20 general fund budget for the fire department is $99.2 million. The Long Beach Airport provides support in the amount of 5.9 million for fire and rescue services provided to the airport. And this is included in the fire department's general fund budget.'",
        "'speaker_8': 'Additionally, the Tidelands Fund supports marine safety activities as well as our fire operations in the Port of Long Beach, which include specialty programs of urban search and rescue, hazardous materials and marine firefighting. The Harbor Department provides cost reimbursement for the services provided in the port in the amount of $18.9 million, and that is included in the 26.6'",
        "'speaker_8': 'million Tidelands Fund budget for fire. Proposition eight funds from the oil production tax continue to provide additional support for fire staffing in the amount of just over $1.5 million annually. The fire department, together with the Health Department, provides environmental protection services that are supported by the Cooper Fund.'",
        "'speaker_8': 'Krupa stands for Certified Unified Program Agency and through permit fees, provides funding for inspection services and business emergency plan reviews to ensure hazardous chemicals are handled, stored and transported in accordance with current state and local standards. Notable changes.'",
        "'speaker_8': 'The fire department's proposed fiscal year 20 budget includes several notable changes that I would like to highlight. First, Missouri has been a significant source of funding for the fire department, providing financial support in the amount of 6.3 million annually to maintain 35 sworn fire positions and providing an additional 3.8 million a year to restore 20 additional positions'",
        "'speaker_8': '. The Marine Safety Bureau will receive structural funding to provide additional lifeguard staffing for the city's Bayshore Aquatic Playground facility. By all accounts, this has been a very successful program, and we look forward to supporting it on an ongoing basis.'",
        "'speaker_8': 'The proposed budget includes staffing adjustment to our cannabis inspection program to better align with current service level demands. The annual inspections for sanctioned businesses and enforcement activities related to illegal or unsanctioned businesses have not reached anticipated demands. Conversely, the clerical demands created by the medical marijuana program have exceeded our capacity to manage.'",
        "'speaker_8': 'We have responded to these findings by shifting staffing from inspections to the clerical staffing necessary to maintain a reasonable turnaround time for the inspection process. And finally, the proposed budget includes additional staffing to manage our electronic patient care reporting or PCR processes and emergency response data.'",
        "'speaker_8': 'Implementation of the p c. Our system has streamlined the patient reporting process, improve the efficiency of patient billing, and increased our collection percentages. Looking forward to fiscal year 20. The department has several significant challenges and opportunities. The Long Beach Fire Department is committed to serving the Long Beach community and wants their personnel to represent the city's diverse'",
        "'speaker_8': 'population. In recognition of this priority, the Long Beach Fire Department, in partnership with the city manager's office, undertook a study to proactively review their entire recruiting and selection process and identify best practices for strategically recruiting a more diverse pool of firefighter applicants.'",
        "'speaker_8': 'Our intent is to implement identified diversity, recruitment and hiring process strategies for entry level and promotional positions in our fire department. Consistent challenge is to improve response times and response capabilities and continue to meet the expectations of our community while expanding the quality and capability of our emergency medical services.'",
        "'speaker_8': 'Our addition of a second heart unit and the recent addition of the Mobile Stroke Unit will assist in meeting this challenge. The most basic service infrastructure of a city is its public safety functions. The city of Long Beach has been operating fire and lifeguard services for over 100 years.'",
        "'speaker_8': 'Although the workforce and equipment are evolving to meet the needs of the growing and changing population. Its buildings and structures have not kept pace. Because public safety facilities are utilized by and support our personnel and the public. 24 hours per day, seven days a week.'",
        "'speaker_8': 'Public safety facilities deteriorate more rapidly than a typical office or commercial building. In addition, since a service the needs of the city have changed, some buildings should be considered for redesign or relocation. Finally, a significant challenge and opportunity is to prepare the next generation of firefighters to step into positions of leadership.'",
        "'speaker_8': 'To that end, the fire department continues to mentor potential future leaders in the areas of supervisory skills and management development. These succession planning efforts are critical to our continued success in the years to come. The opportunities for our department are encouraging.'",
        "'speaker_8': 'Our desire to develop a strategic plan was based on the recognition of a need for clear, unified direction for our fire department. In this collaborative effort, our overall objective is to ensure that we create a safer community for our residents and visitors to the city.'",
        "'speaker_8': 'This document will serve as the roadmap that will provide focus and direction to ensure we fulfill our stated goals and define strategies. We will we will utilize PCR and other emergency response information in collaboration with other city departments to enhance data driven initiatives such as adult adult fall prevention and other high frequency utilizer programs.'",
        "'speaker_8': 'Recent changes in the state billing system for emergency medical services will allow us to leverage increased state funding to make long term investment in operational capability and service delivery. And finally, we continue to work to identify funding to enhance our citywide response capability by supporting the restoration of Engine 17.'",
        "'speaker_8': 'That concludes our presentation. Thank you for the opportunity to present an overview of the Fire Department's Fiscal Year 2020 proposed budget.'",
        "'speaker_2': 'Thank you. Thank you, fire chief. And we're going to move on to the next presentation, which I believe is for Parks, Recreation and Marine.'",
        "'speaker_1': 'Park Structure Recreation Marine Director Corrado Mowat.'",
        "'speaker_6': 'Honorable Mayor and members of the City Council. It is my pleasure to present to you the proposed fiscal year 20 Parks, Recreation and Marine Department budget. The PRM Department is very wide in scope. 170 parks, six and a half miles of beaches, a marina, recreation programs and animal care services.'",
        "'speaker_6': 'The prime budget was developed by leveraging existing resources so that the strategic, modest enhancement goes a long way. This budget will allow your prime staff to continue passing forward their passion of bringing joy to all from infants to older adults and our companion dogs and cats.'",
        "'speaker_6': 'Your prime team does this knowing that it is strategically, that it strategically needs to be nimble in order to be effective in responding to the diverse needs of a diverse community. Our core services focus on parks, recreation, beaches, marinas and homeless dogs and cats.'",
        "'speaker_6': 'We aspire to develop and maintain a vibrant park and recreation system. The urban and diverse Long Beach population deserve a park and recreation system that is calibrated to the specific needs of neighborhoods with sensitivity to environmental friendly landscapes and environmentally sustainable maintenance methods.'",
        "'speaker_6': 'We aspire to keep our marinas well-managed and to maintain our beaches clean and safe for all to enjoy. The beaches are for our residents, no matter what part of town they live on. With your support, we develop a winning approach to take animal care services in a positive direction.'",
        "'speaker_6': 'That approach is Long Beach Compassion Saves, model the and commitment to our core services and mission is based on the knowledge that we deliver services that so seeds of joy and health and prevents urban discord and helps develop community unity and harmony.'",
        "'speaker_6': 'It is the upstream part of the local government business. Is an honor to share with you accomplishments delivered by your PRM team. We are now the 18th best park system in the country with a top notch marina, which is the largest public marina system in the country, a parks and recreation system that provides over 1.5 million participation'",
        "'speaker_6': '. Days of recreation programing at our 27 community centers. Three pools, five teen centers, six senior centers, an aquatic facility and a nature center. Because of your support, we enhanced our senior programing by offering expanded programing and are boosting our volunteer program.'",
        "'speaker_6': 'By leveraging our needs, impact fees and Citi measure. In many ways, we have been able to make major improvements in our park system. PRM staff in partnership with the Public Works Department have worked intensely to upgrade playgrounds, community centers, sports courts and began efforts to improve our irrigation system.'",
        "'speaker_6': 'We made investments in water conservation by implementing a data driven irrigation controller program and improve the management of our ground maintenance services contracts with which permits us the opportunities to operate our vast park system in open space more efficiently and effectively.'",
        "'speaker_6': 'Our enhancements in our beach maintenance operations support beach and sand maintenance a cleaning device. Barbara the rake, as shown on this slide, was recently deployed on our beaches, which helps keep our beaches safe, clean and fun for many residents, for our many residents and visitors.'",
        "'speaker_6': 'Animal Care Services continues to improve the live release rates, reduce in pounds and supports spay and neuter efforts. The compassion saves implementation further, promotes our goal of having positive outcomes for all animals in our care. Currently, we have an overall save rate of 92%, 88% for cats and 96% for dogs and are heading towards ending the year'",
        "'speaker_6': 'with a very good with very good rates of saving animals. We provide local teams from our teen centers with new experience, opportunities and personnel development and personal development. We are partnering with Workforce Development to provide training for team participants to increase prospects of obtaining good jobs and are linking our participants with resources for job placement.'",
        "'speaker_6': 'We have also had great opportunities to partner with our local major sports teams with with our youth such as the L.A. Kings, L.A. Dodgers, and have a wonderful partnership with the school district that helps us offer free recreation swim to local youth.'",
        "'speaker_6': 'We have other partnerships, such as the one with musical Theater West and an overall partnership network with Partners of Parks. We developed Community Beach Week, which includes free events on the sand and in the water each day for children and adults.'",
        "'speaker_6': 'This is on top of the many beach related programs offered this summer, including last Friday's All-City Beach Day, where 2000 youth had great fun, fun and got to know and got to know youth from every corner of the city.'",
        "'speaker_6': 'For fiscal year 20. The PRM budget totals over $60 million across all funds, with nearly 35 million from the general fund, which represents a 7% slice of the city's general fund. Prime also has substantial tidelands funds used to support our operations in the marinas, beaches and waterways.'",
        "'speaker_6': 'This budget provides for 44 445.6 full time equivalent positions during our busy summer months, which we have one in which we have one and a half weeks left to go. Our staffing grows to well over 800 people. We employ hundreds of seasonal staff and are proud of our role as a workforce development engine.'",
        "'speaker_6': 'Notable changes expected in PRM with the adoption of the budget is the permanent addition of an animal care services adoption coordinator and support staff to develop to help drive, increase adoption rates and improve life outcomes for shelter animals.'",
        "'speaker_6': 'We are also excited about adding a prime volunteer program coordinator. The coordinator will recruit more volunteers, train them and deploy them in all the prime areas of need. Long Beach is very giving is very giving when it comes to volunteerism.'",
        "'speaker_6': 'And Prime is a great opportunity for wonderful community building volunteer work. We also are excited to receive one time funds to develop support and launch launch fundraising efforts for our Long Beach Animal Care Services. As we face the coming year, Primo will continue to face challenges.'",
        "'speaker_6': 'But with those challenges, opportunities can be explored, such as taking a creative approach to bringing in more grant funds for park projects. The key is leveraging funds such as park impact fees and telling unique stories that meet the needs of grant requirements so that we succeed in bringing more capital improvement progress.'",
        "'speaker_6': 'With the help of your leadership, the task force and dedicated back staff, animal care services will continue to deliver on performance with a compassion saves model. Leading the way we play. We plan to bring to you the bag strategic plan in the spring of 2020.'",
        "'speaker_6': 'We are passionate about exploring how to use nature to benefit the impact of our recreational programing. We call that approach restorative environmental programing. This is a strategic launch that focuses on clean water, sustainable park landscape, clean beaches and wetlands that align with the city's climate action and Adaptation Plan.'",
        "'speaker_6': 'We will continue to advance the development of the PRM strategic plan. The existing PRM strategic plan is six years old and things have changed substantially. We plan to bring to you the prime strategic plan in the summer of 2020.'",
        "'speaker_6': 'One of our challenges is how to sustain the Be Safe program. We do not have sufficient monies in the budget to support all of the B save sites. We will be exploring different avenues to increase our chances in maintaining this important summer evening recreational programing in key areas that benefit from this targeted prevention program.'",
        "'speaker_6': 'As you can see, the PRM team provides very diverse services. We what we do provides joy to a large, diverse community. Our parks and recreation system is considerable, with 170 public parks, six and a half miles of beaches, 27 community centers, dozens of athletic fields and playgrounds, 67 tennis courts, five municipal golf courses, three city pools, and'",
        "'speaker_6': 'over 3300 marina slips and animal care services. We have been recognized for our award winning programs, but the biggest satisfaction is the millions of positive contacts, PR and staff does each day of the year. Honorable Mayor and Members of the City Council.'",
        "'speaker_6': 'Thank you for your continued investment in the Pride team. Your support helps us meet the needs of the community all across the city. Our dedicated employees and I thank you for your support. This concludes my presentation. I'm happy to answer any questions you may have.'",
        "'speaker_2': 'Thank you very much, Mr. Malloy. And let me there is a motion in a second, but let me start with Councilman Price.'",
        "'speaker_3': 'Thank you very much, Mr. Mayor, and thank you to all of the department heads that presented this evening. I really appreciate all the presentations and the thoroughness and the overview of the changes. That's always the most helpful part of budget hearing nights.'",
        "'speaker_3': 'So. I have a question first for police, a couple of questions. So for Chief Luna. First of all, the stats regarding officer involved shootings are fantastic, and the efforts by the department to focus on that area should really be acknowledged and applauded, because I know that's an area that where my colleagues have a thank you.'",
        "'speaker_3': 'Yes. Let's let's applaud. Yes. That's an area where the police department has received a lot of feedback from this body. And so I'm glad to see that we are moving in a good direction there. And I'm really pleased that we're finally implementing a body worn camera program that's going to go throughout the department and outfit most of'",
        "'speaker_3': 'the officers. I think that's fantastic and I think it's great. Given where we are now, would you say that the full implementation would be about six months out?'",
        "'speaker_7': 'If this body approves this item in the budget the day it approves, it will. We have letters ready to be sent off to with the organization that we're going to contract with. And I would estimate with the delivery of the items that are needed, the infrastructure has already been built thanks to our team here.'",
        "'speaker_7': 'And I would estimate sometime in the beginning of 2020 that we would have the nearly 800 plus cameras deployed.'",
        "'speaker_3': 'And the reason I ask that is because I support this program a lot. I mean, more than I can convey in words. I think it's fantastic. I think it's great that we're doing it. My only hesitation with the dollar amounts that are proposed in the budget is that one.'",
        "'speaker_3': 'You know, I don't think we're going to be prepared to utilize all nine of these positions on the first day of the budget cycle. I think there's going to be some time before all nine will need to come online.'",
        "'speaker_3': 'And as Chief Espino was talking about rerouting some of the marijuana positions because of the actual need versus the anticipated need and that that that actuary having to result in shifting some of those positions. What I want to do is think about what do we what do we think we're actually going to need for the body worn'",
        "'speaker_3': 'camera program? And could we maybe not allocate all nine funds, all nine positions now, and come back in six months if the reality is that we need an additional person or two? And the reason I say that is because I'm just I'm just putting that out there because I think there's other priorities that council members might have'",
        "'speaker_3': 'in regards to city wide issues like gun safety, gun buyback, things like that that might be of more immediate relevance to us. And I'm wondering if these the body worn camera positions are of immediate need for the police department.'",
        "'speaker_7': 'You are asking an outstanding question, a question that I posed to our state attorney general in a meeting that we had with other police chiefs. And it was this situation that we're were encountering with unfunded mandates. I would love nothing more than to divert a lot of these moneys elsewhere where I absolutely believe they're needed in our'",
        "'speaker_7': 'community. But unfortunately, we're looking at a bill of we're estimating $2.5 million of unfunded mandates because of Senate Bill 1421 and 748. We have no option of skirting that at all. We are targeted by the media. They're getting frustrated with us because they're asking us for specific documentation that we to date are starting to release but are'",
        "'speaker_7': 'unable to because we don't have the people or the technology to do so. So yes, that is an option. But what ends up happening is I have to go into the department somewhere and look for bodies to comply with all the unfunded mandates that we already have.'",
        "'speaker_7': 'One way or another, I have to provide at least nine bodies, and I think we're being conservative in what we're asking for. I actually think it's going to be more and this is where I challenge us as a community when we're hearing about all these criminal justice reforms and social justice reforms, somebody needs to start asking who'",
        "'speaker_7': 'is paying for this? Because right now every citizen in the city is paying for these social justice changes that we're mandated to do. We don't have an option. We didn't get $0.01 from the state or anywhere else to comply with these, but yet we're under the gun, literally, to present these documents to the media, to the public'",
        "'speaker_7': 'and everyone who is asking for more way behind already. So I sound a little passionate about it, but I'm frustrated because this money can definitely go elsewhere and each of you have great ideas of where that should go.'",
        "'speaker_7': 'But I think we need to we need to regroup and start looking at our state elected officials and saying, hey, what the heck are we doing here?'",
        "'speaker_6': 'Councilmember to you is a very good question about timing. And can we knowing that that workload is coming, can we phase it in? The reality is, is we are experiencing that workload right now. So we are currently rotating in police officers who were able to pull from other areas, whether they're injured on duty or others into that'",
        "'speaker_6': 'job because that workload exists today. So this is actually one that we need to speed up rather than slow down and actually authorize them very soon in order to meet our deadlines.'",
        "'speaker_3': 'And I get that. And I completely I mean, Chief, given what I do every day, there was no money that came with Prop 47. So I'm very mindful of the realities of criminal justice reform, where we have unfunded mandates.'",
        "'speaker_3': 'The thing, though, Mr. Modica, is we have 200 something body cameras that are currently deployed, and yet we don't have allocated positions for those to do the redactions and the discovery. Right. We are going to be and right now we have zero positions.'",
        "'speaker_3': 'My question is, can we phase in the 0 to 9? Because if we had three bodies right now to help with redactions, praise and criminal discovery, that would alleviate the need of having to put officers into that position.'",
        "'speaker_3': 'The way I what I'm suggesting and nine may be a conservative estimate. But with the police agencies with whom I have worked, I have found that. The redaction requirements have not been as onerous as people once thought, especially if we're using software like evidence dot com.'",
        "'speaker_3': 'So there is an ability now it takes a lot of time to watch the video. Redaction of the videos is not that complicated. I'm just saying, maybe once we implement it at full, we realize, you know what, seven positions is great, but we won't know that.'",
        "'speaker_3': 'So if this if these positions are funded starting October the first and we know we're not going to have 800 cameras deployed until, let's say, March, then from October to March, we have nine positions that we're not really needing for this program.'",
        "'speaker_3': 'We may need them for other things, but we're not really needing them for this program that budget savings could fund. Let's say we take 200,000 of that and we find some sort of a program that is more of a bigger need that I know the chief is also very supportive of, like taking guns off the street so'",
        "'speaker_3': 'we can use that instead of taking that at the end of the year. Now, police department has a budget savings because even though they were funded on October the first, they didn't fill those positions until, let's say, March or April.'",
        "'speaker_3': 'Now that budget savings are going to get rolled back into the budget, which I have no problem with more money going to the police department. Let me be clear about that. But I'm just saying, why can't we use that budget saving what we know is going to be a budget savings for something that we might need now'",
        "'speaker_3': ', like a prohibited possessors program, task force or you know something, I'm just putting it out there. I want to hear what my colleagues have to say, but I'm just putting it out there because I don't know. You know, when we do criminal discovery, a lot of the redactions are going to happen at the prosecuting agency.'",
        "'speaker_3': 'When we're doing press, the redactions are going to happen with our police department. When we're doing 1421 requests. The redactions are going to happen at our police department. So how much it burden is the crime? Is the prosecuting agency taking that might relieve us of the duty?'",
        "'speaker_3': 'I don't know. I'm just saying perhaps we'll know as we roll out the process more. Just something to think about. So the other question that I had that I wanted to ask about is, I know Commander O'Dowd is the Commander for East Division.'",
        "'speaker_3': 'He, by the way, he's doing a tremendous job for the record. He has done a lot of great work using Tidelands money with specific equipment on the beach to address camping tents, you know, illegal activities, syringes, things of that nature that we have had issues with on the beach.'",
        "'speaker_3': 'And and I think that was a great use of tidelands money. And I'm wondering if it if I'm interested in finding out what our options are in reallocating one time dollars from Tidelands for additional enforcement at the chief's discretion along the beach?'",
        "'speaker_3': 'Because the beach is an area where thankfully this year we did not have any junior guards step on syringes. But we want to make sure that we keep the beaches clean.'",
        "'speaker_6': 'Certainly so. As part of the budget in front of you, we haven't really gotten to this part in the cap yet, but there's about $2.6 million worth of Thailand's one time investments that we were recommending to put into certain projects.'",
        "'speaker_6': 'If this is a higher priority, we can certainly work to carve out maybe a little bit of extra funds and dedicate that. So we can certainly work through the Budget Oversight Committee if that's an area that you'd be interested in pursuing further.'",
        "'speaker_3': 'Yes. Thank you very much. And I want to thank the chief and, of course, our director of Parks Rec and Marine for the amazing efforts that have been taken to ensure that the beaches stay clean and free of debris.'",
        "'speaker_3': 'It's not just it's a beyond a beautification issue at this point. It's a public hazard issue. And so I thank you. With the equipment that we've purchased to both patrol the beach, enforce the law, and also to clean the sand, it's been fantastic.'",
        "'speaker_3': 'So thank you. The other question that I have, the final question that I had is actually for our PRM director. So thank you very much. She flew and I really appreciate all of your comments for the PRM Director for Director Mowat.'",
        "'speaker_3': 'I had a question about the budget item for replacement of trash containers. What is the anticipate it in the beach. I think we're using. Is this tidelands money that we're using for that? Yes. Okay. And what's the plan for that?'",
        "'speaker_3': 'Because let me just say that one area where I think there's an opportunity for improvement as a city is to have trash cans that match in parks and beaches. Like, I'm not sure how expensive it would be for us to have just trash cans that match.'",
        "'speaker_3': 'So I'm hoping that whatever trash cans we get for the beaches are somehow similar to the ones we might be able to put in the parks and and so on.'",
        "'speaker_6': 'Well, that's a good point. And that's something that we will strive to make sure that they match.'",
        "'speaker_3': 'Our these big bellies.'",
        "'speaker_6': 'I'm. No, they're not.'",
        "'speaker_3': 'Do they have covers?'",
        "'speaker_6': 'Yes, they do.'",
        "'speaker_3': 'Okay. We cannot invest in any more trash cans in the city that don't have covers. It's a huge, huge problem. Things blow out of the trash that go into the water. Terrible for the environment. Not to mention people who go through the trash cans looking for items.'",
        "'speaker_3': 'So I just want to make sure. Are they going to all be the same?'",
        "'speaker_6': 'Yes.'",
        "'speaker_3': 'Okay. And by the way, I see Corey shaking his head. Corey Forester, that guy should get an employee of the Month award. Pat, before you leave, can Corey get an award? He's amazing. He's wonderful. So thank you. That's all I have.'",
        "'speaker_2': 'Thank you. Council member. Council member. Austin.'",
        "'speaker_1': 'Thank you so much. And, you know, many of my talking points were were actually. Cover with Councilmember Price's presentation or questions. And so I will be pretty brief here. This first question is actually for PD chief. The Neighborhood Safe Streets Initiative.'",
        "'speaker_1': 'Are we? We plan to put 2.2 proposals to put $2.2 million in one time funds toward this initiative. Can you elaborate on some of the programs and initiatives that were undertaken this year with the funding you received in FY 19?'",
        "'speaker_7': 'Yes, sir. We did everything from gang enforcement, prohibitive. Possessor, which has been mentioned up here, is we spent about $100,000 this year on prohibitive possessor enforcement. And that is something that I think is very effective when we're talking about gun challenges that we're facing, whether it's on our community regionally or the topic of conversation across the country'",
        "'speaker_7': '. And I do want to thank you specifically, because you talked about trying to bring a program that would reduce gun violence in our community several years ago. And I know there's been talk about gun buyback. And you and I had had a conversation about switching those dollars to let's focus on individuals who shouldn't be who shouldn't have'",
        "'speaker_7': 'guns, people who have been convicted of domestic violence, people with mental illness. The list goes on and on. And our detectives, our officers have done an amazing job. And just to share a quick statistic with you about where some of that money has gone this year, so far, we estimate that 201 weapons were recovered as a result'",
        "'speaker_7': 'of our prohibitive possessor operation, along with 50 arrest and 13 search warrants. That's significant because those are people who could have caused a mass shooting potentially if our detectives and officers weren't staying on top of it. So thank you all really for allowing us to have that money that is going to a very effective program.'",
        "'speaker_6': 'And Councilmember, I did want to correct something from last week. So there was a question last week about was it the same amount we had done, 2.2 million in the past. Actually, last year, we had a little bit less in terms of funds.'",
        "'speaker_6': 'We were down to 1.9 million. And this year we're able to go back up to $2.2 million. So it is an increase over last year.'",
        "'speaker_1': 'Okay. Well, it I think that when we first funded the Prohibited Possessor Task Force, it was funded to the level of, I think, 250,000. That is, anybody would recall that was a few years ago. And so the to the fact that you're still using funds toward doing that, I do appreciate it.'",
        "'speaker_1': 'And it sounds like it's effective, particularly if we'd taken 200 guns off the streets in our city right now.'",
        "'speaker_7': 'Yeah, just for that operation, we've taken over 700 guns off the street thus far this year.'",
        "'speaker_1': 'Okay, well, I want to get to 1000 and or more. And and obviously, there are there are concerns in the community because shootings are being amplified throughout the city. We we need to do more. And I think there's an opportunity, unique opportunity with this this budget to to focus a little bit more.'",
        "'speaker_1': 'And so my comments regarding the Neighborhood Safe Streets funds, I'm glad that there is a portion of it going toward prohibited possessors. But, you know, I'd like to make sure that we are dedicating at least a certain amount in more than $100,000 of that toward that that effort, because obviously there's some still challenges that we're still facing'",
        "'speaker_7': '. I agree with that. And thank you for your support in that area. And that that money, those moneys we're talking about from 1.9 to 2.2, you got to look at that money as each patrol commander gets a portion of that.'",
        "'speaker_7': 'So for us, from a community policing perspective, we are very visible and accessible in the community, just like each and every one of you are. We go to these meetings, people tell us what the issues are that could be traffic related.'",
        "'speaker_7': 'Going back to your original question, school traffic, it can be fireworks, it can be violence on the street, it can be auto burglaries, it can be people stealing packages from porches. It could be anything that the community's telling our commanders, this is a problem.'",
        "'speaker_7': 'And this money allows us the flexibility to put people where the problems are, whether whatever day of the week, time of the day, whatever that may be. That's the the great part about the money that all of you have approved in the past, and hopefully you will this coming year.'",
        "'speaker_1': 'Which if I'm confident that you will use these funds wisely, but understand that that this councilmember and I think you'll probably hear from others, are really, really concerned about guns and gun violence. And that that is I wouldn't like that to be a focus.'",
        "'speaker_7': 'Yes, sir. You've lit up my phone plenty of times. I'm fully aware of how you feel about gun violence and.'",
        "'speaker_1': 'Yes, sir. And and I think Councilmember Price spoke briefly about it. But the the the structural funding for the body worn camera implementation. Now, did you say March? There were you felt that you been able to be fully implemented?'",
        "'speaker_7': 'We would anticipate if it was approved and we are able to acquire the equipment. We believe that by the beginning of 2020, closer to January or February, we would have those cameras out in the field on the officers.'",
        "'speaker_1': 'Okay. So there was a pilot. Program in North Lawn Beach or the North Division last year? Correct. And as I recall, that the cameras and equipment were were provided at no cost to the city. What happens with that equipment, with this new program?'",
        "'speaker_1': 'Do we absorb that or. Or is that program, that equipment given back to the so under.'",
        "'speaker_7': 'That's an excellent question. I do want to highlight that the first year of this body worn camera project, the young lady sitting next to me from a financing perspective, an administrator, Jason Campbell, who's in the audience, did an outstanding job of reaching out.'",
        "'speaker_7': 'And we got this camera system or the equipment and storage for free for an entire year. And it was in South Division and north division are the others that have the cameras on them now. So with the additional cameras coming in, we would outfit the rest of the patrol bureau, including our field support division, and and that's'",
        "'speaker_7': 'what we're talking about doing. But right now, currently, every officer in North Division that contains your district, Councilman Richardson's district and part of Mr. your Angus district have body worn cameras now.'",
        "'speaker_1': 'Okay. So those cameras won't be replaced.'",
        "'speaker_7': 'They will not.'",
        "'speaker_6': 'Okay, well, they will.'",
        "'speaker_7': 'I'm sorry. I'm being corrected. They are going to be replaced.'",
        "'speaker_1': 'Okay. So we'll have one system?'",
        "'speaker_7': 'Yes, we will have one system.'",
        "'speaker_1': 'Okay. And and I know citywide there are citywide cameras installed under the COPS program. How are they maintained? And is there an assigned staff to handle the installation, maintenance and replacement of those cameras in the department?'",
        "'speaker_7': 'Yes. We currently have staff that manages the logistics of the 250 cameras. But but I do want to reemphasize excellent question that was asked earlier, that the bodies that we're talking about are not necessarily for body worn cameras.'",
        "'speaker_7': 'It is for the unfunded legislative mandates that we have to comply with with 1421 and 748. So when we're talking about these additional bodies, they are primarily coming in to manage the information that we're having to release, information we're having to redact.'",
        "'speaker_1': 'Well, I think in the summary in this big giant book that I think I hurt my back. Karen And today I think it mentioned it was going toward support in body worn camera operations and it didn't emphasize the rest of that.'",
        "'speaker_1': 'And so, yeah.'",
        "'speaker_7': 'It's the majority of the bodies that we're asking for are for the other unfunded mandates that were required. We're obligated by law to fulfill and we're already behind. We are constantly being critiqued specifically by our local media that we're not releasing information quick enough.'",
        "'speaker_7': 'And our response is, Hey, we're going to be in front of our political body. We're asking for more resources to comply with this, and that's why we're asking for those bodies and that money.'",
        "'speaker_1': 'So in my last question for you and thank you. The in the proposed budget actually concept templates, the possible reduction or cancelation of a contract with L.B. USD for Saros as negotiations are pending. So with this focus on school safety, is there something that the school district is discussing with the PD as a possibility?'",
        "'speaker_7': 'We are currently in negotiations with Mr. Steinhauser and their staff.'",
        "'speaker_1': 'And King, I guess sounds like negotiations. Can you give us an update, any status on where that's at?'",
        "'speaker_7': 'And we're currently negotiating at least one position to remain. We're trying to push for a second and and they're having some of the same budget challenges that we're all talking about tonight. So I don't want to say too much publicly.'",
        "'speaker_7': 'I want to give them the benefit of the doubt, because I think there's still a lot of a lot of compromise to be reached on both sides.'",
        "'speaker_1': 'Duly noted. Thank you very much. I do have a question for the fire chief. You know. We're just say thank you for all the great work you do in your department. The men and women department keep our city safe and respond to some very extreme circumstances.'",
        "'speaker_1': 'Thank you. But my my question and this actually was mentioned at our community budget meeting for District eight last week. Can you please explain the current status of Fire Station nine and what the long term plans are and whether or not we are considering that in this fiscal year budget in any way?'",
        "'speaker_8': 'Okay. So at at the current time, we're out of station nine, Engine nine is at station 16, which is on the airport and rescue nine is at station 13, which is Adriatic and Willow. Pretty much they've been out for a number of months and we've met with public works, with health, with city management.'",
        "'speaker_8': 'And we've determined that we're at an all stop right now on any further work on Station nine. At this point in time, we're trying to identify different parcels of land that we could go to as a temporary quarters for engine nine.'",
        "'speaker_8': 'We would probably leave Rescue nine at Engine at Station 13. And then the long term goal is to eventually find some property and build a new station nine.'",
        "'speaker_1': 'How far is a station engine 13 from? From Station nine. Well.'",
        "'speaker_8': 'Mile, mile and a half, probably.'",
        "'speaker_1': 'Okay. And for miles or miles. Jerry And how does having a fire station nine out of place impact response times in a big city knows not Long Beach area.'",
        "'speaker_8': 'Having both of those units out of place has increased response times. They they do patrol during the day. They're out of the station. They've been making a good play of staying in the night area.'",
        "'speaker_1': 'Okay. Well, I would just say to you and to our city manager and staff, we have to to to rectify the situation quickly. No, it's not something that can be done instantaneously. But I'd like to see a plan in place as quickly as possible to make sure that we we're delivering the services to to the residents.'",
        "'speaker_1': 'And response times are important. Yes, sir. I do want.'",
        "'speaker_6': 'To highlight for those that aren't aware and the council is all plugged in, but we have had major infrastructure challenges at that facility. So that is one of our older fire facilities. And we were having, you know, safety issues and we investigated them and eventually got to the point because we've not been.'",
        "'speaker_1': 'Able to invest.'",
        "'speaker_6': 'The infrastructure dollars that we've needed to over many, many years that we had to shut it down. So we're now at that point where we are investigating the alternatives. But yes, we realize that that is a critical facility and we need to devise a plan and come back to you on that.'",
        "'speaker_1': 'Okay. Thank you all. Hold my questions for now.'",
        "'speaker_2': 'Thank you. Councilmember Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. And a number of my questions were answered. So if we could just have the director and both chiefs just come up and I don't think you're going to need your additional staff. I just have some general questions for you.'",
        "'speaker_5': 'I didn't want you all to have to sit down and get up and sit down and get up. Right. And I'll start with the fire chief since he's already sitting down. So, first of all, congratulations on all your accomplishments.'",
        "'speaker_5': 'And just one thing. And I know we'll have a conversation a bit later about some of your ideas around diversity, and I'm looking forward to that conversation later on. I noticed that you named as an accomplishment the heart team that you have to hart teams deployed.'",
        "'speaker_5': 'How are they deployed. Where are they are they anchored at a station or how are they deployed?'",
        "'speaker_8': 'They're not anchored at a station. They deploy from headquarters and they're on different schedules. The one Hart unit goes from Monday through Thursday, the other goes from Tuesday through Friday. And essentially they patrol and sometimes that occurs because of need.'",
        "'speaker_8': 'Well, we'll hear from the different council districts stating, can you please visit a certain area? And they will. I think predominantly most of their contacts are in the downtown area, but they do basically travel the entire city boundaries.'",
        "'speaker_5': 'Okay. And I'd be curious to know and we can, you know, continue this conversation offline. But I think it's appropriate to raise. If in the next fiscal year the plan is to open up bridge housing, a shelter, homeless shelter.'",
        "'speaker_5': 'I would love to see if this is going to create if we're going to have a new system on how is deployed, does it create new demands and is there a need for additional resources to the heart theme program?'",
        "'speaker_5': 'I'd love to see a good relationship between the heart team and the shelter, the bridge housing that that's proposed. Thank you. Just moving on down the line, Chief. Congratulations on your accomplishment in terms of what you raised up as.'",
        "'speaker_5': 'With respect to the officer involved shooting. So what would you attribute your success to?'",
        "'speaker_7': 'Fantastic people working for the Long Beach Police Department. And I say that honestly. One, paying attention to the environment we've been in for the last 5 to 6 years. And when I say that, it's not just watching something on on TV or a video, but I mean, actually visiting other police departments, looking at best practices where people'",
        "'speaker_7': 'have succeeded, where people have failed. What training is working? Our training staff has done amazing to really research best practices, bring them back. And at the end of the day, it's not just about standing in a classroom and teaching, but running people through life scenarios of of doing things over and over.'",
        "'speaker_7': 'And it's we've taken situations that have actually happened here and then translated them into scenarios. So we just go over them and over them again. There's I could sit up here for at least 30 minutes and talk about it, but it's our fantastic people absolutely willing to to look at what's going on around us, try different techniques'",
        "'speaker_7': '. And at the end of the day, it's the numbers are working out for us right now. We have a fantastic police department.'",
        "'speaker_5': 'It's good. I'd like to you know, I think that's good. And the more we can sort of pinpoint what best practices we're doing so that we can continue to support those efforts if there's training, if it's the new training staff and although we've talked about your efforts to boost your training staff, those are the things I personally'",
        "'speaker_5': 'like to know so that I can know how to support you. Yes. To continue to have that level of support.'",
        "'speaker_7': 'By the way, you've done that partially. When all of you decided to support Measure three, we were able to put nine police officers out at our academy where they're able to do exactly what I just described. So you're already on the path there.'",
        "'speaker_5': 'Thanks. And I think doing the the shooter training, going out and understanding what goes into it, the training that many of us participated in, it certainly helped open my eyes to what all the sort of nuances that police officers have to deal with.'",
        "'speaker_5': 'Moving on to a different topic. So I know that so every summer, you know, having worked for the city for nine years, every summer, I know that there's typically a some sort of elevated levels of of violent activity.'",
        "'speaker_5': 'And we you know, a lot of times we come together and we talk about what we can do to prepare for it. You know, we've a lot of great programs come out of that, like be safe. And we've ramped up things like summer youth jobs.'",
        "'speaker_5': 'Nonprofits have stepped up like the YMCA Summer Youth Institute, located in different areas to sort of just get the whole community prepared for whatever happens every summer when, you know, youth get out of school and there's just a lot more activity.'",
        "'speaker_5': 'My question for you is, this year just seemed a bit more elevated than most years. And and is there a is there more is there a need for more resources during the summer months within our police department to make sure that we adequately are staffed up to respond?'",
        "'speaker_7': 'We constantly keep up. We're data driven. We're looking at data to see where the spikes are. There are 4 to 6 times during the year that crime, specifically violent crime, will go up. It's not always in the summer.'",
        "'speaker_7': 'A lot of it revolves around the school year, beginning of school and the school. Those are two of our are highlighted areas. So we make sure that a lot of the moneys we are talking about earlier that the previous 1.9 now hopefully to point to that money is instrumental because we do save it for those times where'",
        "'speaker_7': 'we believe there are going to be spikes. So we'll go out. If we look at two weeks, for example, and that's spiking up beforehand. We'll go out and do probation searches will do prohibitive weapons searches, will do all these things to try and prevent some of these things.'",
        "'speaker_7': 'But there's a lot of great programs going on in the city during the summer. I'm we talked about negotiations with Mr. Steinhauser. We are actually talking about a program for next summer. Like our partners at the fire department are doing this summer to take youth off the street, people who are interested in fire will now be interested'",
        "'speaker_7': 'in police and able to to really connect with the youth like we haven't in years from that perspective.'",
        "'speaker_5': 'Okay. And, you know, along that same line of discussion, you know, we used to have the Police Athletic League here in Long Beach. And I know there were, you know, budget decisions, but that was something within your department and it was a good interaction between law enforcement and the community.'",
        "'speaker_5': 'Has there been any conversation about taking a look at a new model of the Police Athletic League?'",
        "'speaker_7': 'We're constantly trying to research best practices. Police Athletic League Once Upon a Time was a very effective program. As you know, during the recession, we lost over 20% of our staffing, and that's one of the programs that went away.'",
        "'speaker_7': 'Our partners at Parks and Rec do an amazing job, so maybe the model looks through Parks and Rec with maybe.'",
        "'speaker_1': 'Us.'",
        "'speaker_7': 'Having a part in that. Those are constant challenges that we're looking at. We're talking about and figuring out a potential way of doing that. But as we talk about some of these reforms that are going on, and that's the unfortunate part, Councilman, a lot of our moneys are having to go to these unfunded mandates and not look'",
        "'speaker_7': 'at these creative programs that we should all be looking at. And I think we all need to take a hard look at that and discuss this at the state level to see what our priorities are or should be.'",
        "'speaker_5': 'I understand. And, you know, and they're connected to the decisions that we made as a as a council like the body camera program. I think it's positive and inevitable, the body camera program. But if we're going to do it, we need to comply with all the laws that that that align with it.'",
        "'speaker_5': 'So that's something that we know will have unknown costs and we should be prepared so that you don't have to come back to the council to fully fund the things that we request you to do. So I support that program and helping fund the program.'",
        "'speaker_5': 'The last thing I'll bring up with you is, is some of the, you know, something I brought up with the fire chief. So, again, we're having a conversation about the shelter, the bridge housing that we're working on doing in the next in the next year.'",
        "'speaker_5': 'I know that the police department in the last budget established a quality of life officer. What I'd like to see is for us to be proactive in thinking about what the relationship is between the community, police, the, the quality of life officer, the heart team, you know, our and we have some bike patrol and we have a'",
        "'speaker_5': 'neighborhood resource officer. I'd like to see some relationship of like a community policing team operating somehow around the shelter operation to make sure that the community really sees and feels that we're really all hands on deck and on this the shelter and and that public safety is a part of the continuum we put in together to make'",
        "'speaker_5': 'sure that the shelter plan works. So I really don't have a question for you on that. Maybe, maybe your thoughts. But that's something I love the conversation I love to have over the course of the next year.'",
        "'speaker_7': 'It's an excellent point. And I'd like to share just a quick story. The mayor and I traveled to South Carolina about a year ago where we spoke at the U.S. Conference of Mayors because Long Beach is seen as a leader in in handling the homelessness challenges.'",
        "'speaker_7': 'We definitely have some work to do, but a lot of what you're describing is already happening with the multidisciplinary team that our health department leads with our fire department, our police department, city attorney, city prosecutor. We're communicating and coordinating like no other city.'",
        "'speaker_7': 'And I'd like to invite you to one of those meetings and to see what goes on there and there. They discuss challenges and priorities, not only individuals, but locations. And I think the location you bring up is a great idea and that can be brought to this team.'",
        "'speaker_7': 'And I think you'd be very impressed with what the with the employees being part of that team do.'",
        "'speaker_5': 'Great. Fantastic. I'd like to take something like that model and sort of replicate it specifically for this, but we have time to talk about it. Thank you for responding my questions, chief. So moving on, the Parks and Recreation.'",
        "'speaker_5': 'So first of all, Harold Gerardo, first of all, thanks for being so easy to work with you and Steven Scott. You know, the Parks team is just the best folks to work with. I you know, my questions generally are about sort of where we're going.'",
        "'speaker_5': 'I love that you're working on a strategic plan. I believe in planning your work, work, your plan. I also think that every time we bring a budget, we should be able to point to what plans, where we're addressing or what gaps we're closing.'",
        "'speaker_5': 'We've had a lot of conversation about closing the open space gap. And, you know, and, you know, and I can reference my district where 1.1 acre, 1.2 acres of open space per 10,000 residents. Right. Which is is, you know, significant.'",
        "'speaker_5': 'It's it's low. And so we took the steps of establishing a plan, creating a plan uptown open space plan to help identify creative ways to expand open space. And I love to make sure that we're taking incremental steps as needed every year in helping to close that gap in every budget.'",
        "'speaker_5': 'And so my question for you, and it's okay if you don't know it, it's kind of on the spot. But over the course of the last year have. We applied for any grants or anything in alignment with that plan.'",
        "'speaker_5': 'I don't think you're I don't think it's on.'",
        "'speaker_6': 'Specific to the the the north Long Beach.'",
        "'speaker_5': 'Town obviously.'",
        "'speaker_6': 'No, there hasn't been any particular grants other than grants to supplement the existing projects like. But with regards to adding adding more space, the only planning that we've been thinking in is, is the possibility of joint use, because that is one way of increasing open space and identifying schools in certain areas that would be too expensive to'",
        "'speaker_6': 'to purchase land in that area. That's the discussion level that I've been having with staff. Sure.'",
        "'speaker_5': 'And just just a nudge, if you will. I would I would say when the community goes through a process and, you know, the councils sort of reinforce this, when the community goes to these planning processes, we get input and we we we we talk about how we can close gaps and achieve the things the community needs.'",
        "'speaker_5': 'I think it's important that we immediately follow up by identifying resources, grants and those things that help, you know, give a little momentum before the plans become stale. Mm hmm. Right. So I think this plan received American Planning Association Award.'",
        "'speaker_5': 'It was very well received. And so to not have submitted and I know there's been multiple rounds of grant applications for not have shown up to the game, you know I don't think is acceptable. So I think we over the course of the next year, we need to show up.'",
        "'speaker_5': 'We need to step up and submit some applications so that we can say with each budget, here's the steps we've taken to help close these gaps. Right. Balancing of providing a balanced budget is a good step, but it's not enough.'",
        "'speaker_5': 'We should be a city that can every year talk about our efforts to close the gap. And then the last thing I'll say is, I know we talked about investing in like a mobile spay and neuter sort of animal health van.'",
        "'speaker_5': 'And I know this thing is expensive, but just curious, have you had any conversations with, you know, partners of parks or other potential funders about this mobile spay and neuter?'",
        "'speaker_6': 'With staff. We've had discussions and hopefully leveraging the funds that you are being proposed in the budget with regards to raising money. Right now there isn't. It's the same thing with discussion with partners of Parks. As you know, there's a one time only money of $100,000 to help develop a momentum for fundraising for animal care services.'",
        "'speaker_6': 'And so those monies, as we bring in more private monies, we will be identifying the high priority areas. And as you know, the as I mentioned, the the El Bax strategic plan is coming back to you in in the spring.'",
        "'speaker_5': 'Sure. Right. Thank you so much. I think that satisfies my questions.'",
        "'speaker_2': 'Thank you, Councilmember. Councilmember Pierce.'",
        "'speaker_4': 'Yes. Hello, everyone. I want to first say how proud I am of every single department, every year that we come to this budget meeting. There are issues that are important to the council, to our community members, and we've really been able to see progress in all three of your departments.'",
        "'speaker_4': 'So I would just want to start by saying that it's an exciting budget to know that while we're on a tight budget, we're doing what we need to do to continue to move the city forward. And so for PD.'",
        "'speaker_4': 'I guess I'm trying to decide where to start. My first question would be, with the attrition rates that we're facing right now, do you feel like this budget is helping us kind of fill that gap? I know that we've had some discussion around some retirement in the department, so I'd just like to hear about the plan to'",
        "'speaker_4': 'kind of address that.'",
        "'speaker_7': 'Yes, ma'am. Very good question. I feel very comfortable about where we're at in regards to planning ahead recruiting, hiring and training. A new Academy class is a significant accomplishment. It takes a lot of work to get there. A lot of commitment from all of you to fund it.'",
        "'speaker_7': 'We estimate that a class cost approximately $6.5 million to get through. Currently, we just hired another class that's anticipated to start on August the 29th. It has 72 recruits that we were able to recruit and hire into this class.'",
        "'speaker_7': 'A very diverse class, by the way. And that'll help us stay ahead of of the anticipated higher than normal attrition that you're asking about. And we have been concerned about in planning this. And I believe we're well ahead of the curve.'",
        "'speaker_7': 'And one of the biggest reasons is your guys's commitment for the funding. It is a significant commitment and it's there. And thank you.'",
        "'speaker_4': 'Okay. I support the new the new class, so long as you can get Commander Lewis to stay on for another ten years. I don't know if he's here, but Commander Lewis is the man.'",
        "'speaker_7': 'Commander Lewis is there and he's here.'",
        "'speaker_4': 'He's awesome.'",
        "'speaker_1': 'Okay.'",
        "'speaker_4': 'And one of the reasons and this leads me to my next question, one of the reasons that he's awesome is because he's out of his car a lot. He's building relationships with our neighborhoods, with people that typically might not have a relationship with PD.'",
        "'speaker_4': 'And so I like to just echo the conversation around community policing. I know I brought it up last time and I know whenever we're short staffed, it's difficult to have our officers out of their cars. But I do know that we have some members of of the second District here today, that community policing is really important to'",
        "'speaker_4': 'them. So if you could maybe elaborate on when you guys decide to have officers out of cars, how much time do they get to do that? And then also talk about the bike program that we have. I know that we voted on that last year and it's just now seems to be kind of rolling out.'",
        "'speaker_7': 'So in regards to community policing, it's a foundation of the way we do work. It's the standard we expect that all of our patrol officers that are in the field for a portion of their shifts will get out of their cars and do what we call walk in talks.'",
        "'speaker_7': 'I don't have the statistics right here in front of me, but it depends on the day. There's days where they're going from called the call and it's a little more challenging. But we do ask them when they see kids playing in the street, in the park, get out, throw the football around.'",
        "'speaker_7': 'As a matter of fact, if if you follow our social media, we're finally getting officers to to take pictures of themselves. That was something they didn't want to do. And I can see why. It's it's it wasn't easy for them, but we are transitioning to a little bit more of a marketing mindset.'",
        "'speaker_7': 'And so we're doing that a lot. And the officers know it's part of who we are and it's part of building a partnership and trust with the community. So it's we ingrain it from the minute we hire people, through the time we train them to get out there and do it.'",
        "'speaker_7': 'So I appreciate the fact that citizens want to see more of them as opposed to the opposite, not wanting to see them at all. So we'll continue to to in our efforts to get people out there. In regards to the the bike unit that was funded.'",
        "'speaker_7': 'We're not quite there yet. The funding wasn't made available at the time, and we're still kind of trying to work through that. But what we're doing is we're augmenting it with the safe streets money that we've talked about.'",
        "'speaker_7': 'So, for example, if you're as you communicate, I know you are with Commander Lewis or Commander O'Dowd. If you tell them there's an area that needs a little bit more, maybe bicycle patrol or foot patrol, that may be something that they put in, then action plan together and put people out there to do just that.'",
        "'speaker_7': 'So in regards to the people in the money, we're we're actually, I think, doing a very good job of putting them on the front lines.'",
        "'speaker_4': 'It's great. And I do know that that both commanders are working at Bixby Park. I believe they're putting their bikes in this next week into our field office so that they can do patrol out of there. So just when that kind of gets into full swing, it would be good to have a report back around the areas'",
        "'speaker_4': 'that had bikes. And if we saw a reduction, I know we've got a lot of chop shops in my district and so making sure that that we're kind of looking at those numbers and saying, does it help? Do we need more so that we can have that conversation with the next budget in relation to.'",
        "'speaker_4': 'I mean, you guys already know it. I know that I've probably been the most outspoken around reducing some of our instances with with PD and our community members. And so the statistics that you shared at the beginning of your presentation, I am thrilled to hear and I'm thrilled to hear that the answer is, well, we have more'",
        "'speaker_4': 'training, we have more hours, I mean, more resources to be able to really invest in our officers. And I think that that's what I've always committed to our constituents, is that we would always have the resources available to our officers to make sure that we're doing training and that we're able to look at the data that we'",
        "'speaker_4': 'have. And so I want to take a moment just to echo Councilwoman Price's comments around whatever we have to do to get staff in there early on to be able to do the redaction and kind of try to do some of that unfunded mandate is important.'",
        "'speaker_4': 'Whether it's unfunded or not, it's important to our constituents. And it's something that we as a council have to prioritize as well alongside all those other police programs. And so it's something that I wholeheartedly support trying to figure out.'",
        "'speaker_4': 'And then last comment for Tidelands. Every budget year, I always say that I support spending more Tidelands funds on public safety on our beaches. I know we did a lot the two years prior. So as you take that conversation, Mr. Modica, to the Budget Committee, that's something that I do support as well.'",
        "'speaker_4': 'I just wanted to to go on record with that. And then just could you elaborate briefly on the gang unit? Because I do think that that we are seeing crime, that that really affects our neighborhood. And we know it happens more in the summertime.'",
        "'speaker_4': 'And I know that it's part of some of the funding that you're already doing. Is there a I mean, I know that we've kind of talked about how much spending we have on our gang unit. Is that enough?'",
        "'speaker_4': 'As like. Does this budget get you what you need with that? I know we don't have fluff in this budget, but it's something that I think is timely for us to talk about.'",
        "'speaker_7': 'So from a perspective of needing more, I don't think any department head would ever sit up here and say, We don't need more. I'm really proud of the city family, the employees for every department because we're working our tails off to make this city safe, to make the city function.'",
        "'speaker_7': 'But at the same time, I'm very cognizant of the fact that when I'm talking about gang enforcement, for an example, you have to have intervention and prevention. You have to have parks and libraries. Those are all functions we absolutely need to have in order to to get to where I think we all need to get to.'",
        "'speaker_7': 'I believe we have a very effective gang enforcement section. Yes. In years past, it was reduced as many specialized units in our department were. That just meant that we we do have to work a lot harder. We have to communicate and coordinate like we never have.'",
        "'speaker_7': 'And our gang enforcement section people are constantly passing on information or intelligence to our directed enforcement teams that are assigned to each patrol division, and they're responsible for the front line enforcement that's taking place. And there are times when they are busy or some of the the the questions that Councilman Richardson was asking about certain times of'",
        "'speaker_7': 'the year. We're trying to maximize our deployment. And that's where I'm telling you that the the the the neighborhood safe streets money is absolutely critical to what we do and how we do it because every time we get flare ups, that's essentially like putting more police officers in specific geographical areas at specific times where the data's telling'",
        "'speaker_7': 'us that we think this stuff's going to happen. And at the end of the day, it's about saving lives. It's about preventing these shootings from occurring.'",
        "'speaker_4': 'Thank you for that. And I know I think I said that was my last question, but the one thing we can talk about in the future, though, is that connection between jobs, our workforce development, our city prosecutor. When we have people that come in with low level situations, what are we doing with the prosecutor's office or with'",
        "'speaker_4': 'our workforce development to make sure we're connecting those people back to jobs? And that's really where we're going to see the biggest reduction in our crime, not just policing, but making sure that we're investing on that front. And so those are my questions for for you police chiefs.'",
        "'speaker_4': 'So thank you so much for all the work that you guys have done for our fire team. I have just two questions. It was great to hear of the progress of our Hart team. Obviously, it's something near and dear to my heart.'",
        "'speaker_4': 'And you guys are seeing a lot of the times in our district, so really appreciate the team and everything they do. Are we anywhere closer to being able to have? I think there's some changes that have to be made at the state level to be able to have the Hart team respond to 911 calls for homeless.'",
        "'speaker_4': 'Is that still an effort that Janice Hahn and others are working on? Do you know?'",
        "'speaker_8': 'We do have one of the heart units as a certified, and the other one is not at this point.'",
        "'speaker_4': 'Okay. So we do have one that's certified. Yes. And I thought that last year we had talked about adding a third heart team. Was that not part of that conversation last year?'",
        "'speaker_8': 'That has has been part of the conversation. But at this point, we're not looking at it in this budget.'",
        "'speaker_4': 'But it doesn't. Okay. And then one.'",
        "'speaker_6': 'Has to remind us, we used to have one heart team that we formed as a pilot. And then last year we added a second using measure. So that was the addition.'",
        "'speaker_4': 'Great. Thank you, Tom. Obviously, the downtown we've seen, you know, over 3000 new units in downtown. It's an area that's that's extremely important to me, particularly with all the high rises. Will you be able to share with us in the next time that we bring up the budget, the number of calls for station one and station to'",
        "'speaker_4': 'increase from last year to next year? I know that's a year out request, but it would be helpful to kind of look and see. I know that the increasing fire in our downtown is low on the list, but since we've added so many new residents, I think it would be helpful to make sure that we as a'",
        "'speaker_4': 'councilor are being mindful of that change.'",
        "'speaker_8': 'Sure, we'd be happy to give that to you.'",
        "'speaker_4': 'Thank you so much. And Parks and Rec. I am so thrilled to have you and the team really partner with us on a lot of our key areas. I know Bixby Park Parcel one has been key. I want to thank your team for the role that you've played there.'",
        "'speaker_4': 'Thank you for helping us in downtown try to figure out the cover around the park. Park. But I wanted to just give big applauds to you for really taking compassion saves to heart. It was great to open up the budget book and see the new positions that have been slotted, and I think I don't have too many'",
        "'speaker_4': 'questions. I just really wanted to say how much I appreciate that. I echo Councilmember Richardson's comments around Park Equity. We've spent I know you came in at the tail end of Park Equity conversation, but we spent a lot of time talking about resources.'",
        "'speaker_4': 'And as a second district resident with the seven year old, every single program my daughter's in is on the east side. And it is frustrating not to be able to have something that's close to have some of that park programing.'",
        "'speaker_4': 'So urging you to take that park equity conversation serious not only in greenspace, but in programing whenever you're doing your your strategic plan, because it is a real issue that we have and we have parks like Miracle on Fourth Street that don't have open programing that people aren't aware of.'",
        "'speaker_4': 'And it's not listed in our parks and rec books. So making sure that we are activating those spaces that that needed the most. So thank you all department heads and city manager. I'm very pleased with where this budget is at and look forward to continuing the conversation.'",
        "'speaker_2': 'Thank you, Councilmember. Councilmember Ringo.'",
        "'speaker_1': 'Thank you, Mayor. And I want to thank my colleagues for asking all the questions I was going to ask. He stole my thunder. And then so basically the one the one question I was going to ask for both the public well, both the public safety heads is it's a recruiting and academies.'",
        "'speaker_1': 'Chief, you mentioned you have a Chief Luna. You mentioned you have a class currently in place with over, what, 72 recruits, I think you mentioned in the class.'",
        "'speaker_7': 'Yes, sir.'",
        "'speaker_1': 'When is that class expected to graduate?'",
        "'speaker_7': 'Six months from August the 29th. And doing the math in my head, I'm going to say about February of 2020.'",
        "'speaker_1': 'Is there going to be another class coming immediately after or what's the plan for the with a budget year with the academy where this year.'",
        "'speaker_7': 'Our goal was to hire to this last year for 2019 and budget permitting. The goal will be to hire two more in this coming year. So we're already recruiting for the next one, even though we're just starting one at the end of this month.'",
        "'speaker_1': 'And I realize that it's all peaks and valleys when it comes to attrition, promotions, people who don't complete the academy. So I know that that's a big part of the the process with personnel, and that's a challenge every year that you face as well with the Chief Espino, that you both have to deal with those issues in'",
        "'speaker_1': 'regards to that. Where are we with the idea? I know you're going to want more because we need more police officers to be hired to get us at least that a closer to a place where we want to be a police officer per thousand.'",
        "'speaker_1': 'Where are we at right now in terms of our representation of police officers to the population that we are at the 480,000, the last census? Where are we with that in terms of a deployment?'",
        "'speaker_7': 'Our current ratio stands in about 1.8 per thousand.'",
        "'speaker_1': 'And what's the national average, you know?'",
        "'speaker_7': 'You know what? It's all over the board. And we're consistent with departments on the West Coast, the average and maybe just a little bit beyond us or below us. And on the East Coast, it's it's closer to sometimes three per thousand, but their policing is very different than it is out here on the West Coast.'",
        "'speaker_1': 'Understood. In regards to the item that Councilmember Richardson mentioned in terms of the power program and I know we used to have there, and that also went away with all the budget cuts. Just to give you a heads up.'",
        "'speaker_1': 'I have been approached by a community group to look into reestablishing Pell. And so I'm looking forward to working with them as well as your department. You're represented that I'm going to be working with is obviously it's the Commander McGuire that I'll be working with and hopefully we can bring something forward that will be workable for not'",
        "'speaker_1': 'only the police department but for the community as well. I think it's a it's a program that was very successful and one that we should probably bring back. So I'm looking forward to having discussions that and of course, with our city manager and and the mayor to see if we could re-implement or reinstitute such a program.'",
        "'speaker_1': 'I think it's very successful. We know that they have the search and rescue, which is there, which is very helpful, as well as promoting future firefighters and future public servants. And I want to commend both of you for all the service that you've done for the city.'",
        "'speaker_1': 'Both of you have been with the city practically your whole careers, and it's been phenomenal. So the same question to Chief Espinal in regards to recruiting, and I know we're going to hear the presentation a little later, but in terms of academies, what do you have in mind for this this budget year in regards to hiring?'",
        "'speaker_8': 'Well, we currently have an academy that's ready to start on August 19th, and they should be graduating December of this year, mid-December. Right now, that number is right around 30 and I say right around 30 because we're in competition with everybody in the region for the same candidates and they're getting swooped up left and right.'",
        "'speaker_8': 'So hopefully we start this academy with right around 20, 30 candidates and we have 28 new firefighters by the end of the year. The follow up to that is we'll start recruiting. In November for the class that's scheduled for 2020.'",
        "'speaker_8': 'That class, by the time they go through the entire process again, they'll start up in August of next year and graduating by about mid-December, about the same number of candidates.'",
        "'speaker_1': 'How many recruits do your comedy class?'",
        "'speaker_8': 'Ideally 28, right. Is a starting point. Right now, I think we're right around 2830 and we have a week to go before we actually start. Would it be unheard of that we lost one or two in the next week or so?'",
        "'speaker_8': 'It's happened before. So just anticipating that.'",
        "'speaker_1': 'And Mr. Moy, I hope that we've spoken before, and I know you have a great grant writing team, great writing team, and I hope that we are able to continue to look at grant opportunities to enhance not only our parts base, but to make them much more enjoyable and and make them more able to be welcoming for'",
        "'speaker_1': 'people to come to the park and play. And those those playgrounds that you put out there recently have been very received. I hope that we can do more. I know you're working with Park with Public Works in some of those projects, so I hope that we are able to continue and put more out there.'",
        "'speaker_1': 'So those are the only the only two questions that I have for each one of you. Thank you very much. Thank you. Just one thing. It's just got to be right now because I saw it right here in your budget.'",
        "'speaker_1': 'Chief Luda, I noticed that you were going down last year. You had a higher number of SS O's in your budget and this year you have about four less. Is there a reason for that? What's what's taking place with your.'",
        "'speaker_1': 'I'm looking at SS. So three. Last year, you had adopted NAFTA 101. And this year you have a budget at 97. That's for lessors. Are they being re reassigned or promoted or what's the what's the status of that?'",
        "'speaker_7': 'I believe there are two positions. I'll have to get back to you on the four. Does it sound familiar? I know there were two that are being shifted around and a lot of them the moneys that we have in order to fulfill some.'",
        "'speaker_7': 'I keep on repeating myself about these unfunded mandates, trying to figure out how to get stay with 1421 and 748, because those are things that or positions that we have to do to get the work done. So but I can get back to you.'",
        "'speaker_7': 'I'll follow up with you on the four. I think it's two.'",
        "'speaker_1': 'Okay. Well, it says four in a bunch of books. Okay. Just following up with that. Thank you.'",
        "'speaker_3': 'Thank you. Oh, excellent. Excellent presentations from all three of you. As always, we're really moving in the right direction, and I appreciate all your work. A couple of things I know that I sat with. I can only think of the joke right now, Mr. Emergency.'",
        "'speaker_3': 'Right now I can't think of Master of Disaster. Thank you. The Master of Disaster. Earlier, there was a notice that went out today, about $12 million available from at the state level for 911 modernization. I know that currently we would have to be a recipient from the state and I don't think we're eligible, but I'd love us'",
        "'speaker_3': 'to keep an eye on that. I think that that's something that's crucial in the next few months. And if if possible, if there's any legislation that we could look for to help modernize the way that the the legislation was written.'",
        "'speaker_3': 'It would be great. The state has 12 million coming our way, and I hear more to come as our 911 system is is important to the work that both of you do. Actually, all three of you, quite honestly, a little bit about unfunded mandates in my prior life.'",
        "'speaker_3': 'We used to package up the unfunded mandate costs on an annual basis and send them to the state. Is there a process for that? I can't think of the acronym right now.'",
        "'speaker_6': 'Yes, we still do that. So every single year we record it's financial liability, we record those and we send them to the state. And every year they don't pay. But every couple of years, probably every 5 to 6, we get lucky and there is a settlement and they end up cutting us a check.'",
        "'speaker_6': 'So it's really important that we track those and that we submit them every year. If you don't submit them, you don't get paid when they do actually pay their unfunded liabilities.'",
        "'speaker_3': 'Yeah, I want to say that I recently heard that a settlement from like 2009 came in. So they're very, very far behind. But I do appreciate that we're still doing that because it's crucial to the work that we're doing.'",
        "'speaker_3': 'Finally, there are.'",
        "'speaker_4': 'Governments.'",
        "'speaker_3': 'Across the states that have looked at getting sponsorships for their trash cans. Many of you may remember when there was a radio station called The Wave. And while we don't have waves at our beaches currently, the wave used to sponsor all the trash cans for the departments of beaches and harbors up and down the state.'",
        "'speaker_3': 'And so in exchange for the cost of the cans and the cost of emptying them and maintaining them and paying for the trash contract, every single trash can up and down the county coastline said 94.3 or whatever the radio station was.'",
        "'speaker_3': 'I'm sure one of you know the wave. And so thank you of 94.7, the wave. Another piece of advertisement for them. For there, there are many years of financial support. I'd be very interested in seeing the Parks and Rec program better utilize the Peps program that this Council adopted that does allow for sponsorships, as Councilmember Orange discussed'",
        "'speaker_4': '. I think that it is important that the trash cans at the.'",
        "'speaker_3': 'Beach have lids. And I also find that it is crucial that the trash cans in our parks have lids. And I know that we've been working hand in hand with the Friends of Eldorado Park. East. I was confused sometimes on East and West on their desired park trashcan lid that we could put on the park trash cans'",
        "'speaker_3': 'so that our vermin population and our birds aren't diving into the trash cans, getting tangled up in wire and other such things.'",
        "'speaker_4': 'I'm also quite interested.'",
        "'speaker_3': 'In knowing a little bit more about our senior programs that we took a lot of effort. I know that the Parks and Rec Department really took a strong lead on that. Do you have any? Short update that you could provide on the initiative that we supported last year that came from Council Member Austin.'",
        "'speaker_6': 'Yes. So the the senior program at the expo, which is was 40,000 of the 100,001 time, only minutes is going very strong. It's three days a week and it's very, very popular. There's about 40 to 50, sometimes more participants.'",
        "'speaker_6': 'So it's very, very strong. And then the we're creating a mobile program to move around senior programing, and that's in the works and being developed with the the $20,000 a one time only. And then the 30,000 is to develop a robust volunteer program for our seniors and for people that want to provide volunteer services at the senior'",
        "'speaker_6': '. And then the last 10,000 is we're working on just promotional material. So the the the moneys are going to very good use. And we appreciate that those resources.'",
        "'speaker_3': 'Well, I really appreciate the hard work that you put into that and the numerous stakeholders that you brought to the table. I know that it was Passion of Councilmember Austin, something that his staff really volunteered for and put his money where his mouth was in terms of the effort.'",
        "'speaker_3': 'And I think that for you to have led that so successfully, we're just really proud of the work that you did. I know you were new at the time, and I just think that that was fantastic. Another initiative that came out of budget oversight and the full council last year was the postings related to park utilization.'",
        "'speaker_3': 'Are you able to give a short update? I know you'll give me updates at our staff meetings.'",
        "'speaker_6': 'But the on the website, the the permits. Yes. So are daily posting of the athletic field sports permits is going very well. People from the public can see who has an actual permit for the sports organization. And we're very close to them now, putting the permits for park events.'",
        "'speaker_6': 'And that's the second part to our plan. Hopefully we'll be able to do that fairly soon. It's the same software as you know, and we're just developing the training to be able to do those reports and put it on the Web.'",
        "'speaker_3': 'And do we think that will be before the end of the fiscal year, before the end of the calendar year?'",
        "'speaker_6': 'I would say around the fall, it may be early October, but we will definitely we are able to do it. It's just a matter of training staff to do it on a regular basis to to to update that information.'",
        "'speaker_3': 'And hopefully that that plan would eventually be automated. That's something that was advocated by our friends of Wardlow Park. And I think that, again, the department has really embraced working with the friends groups and their initiatives. That was a park that was consistently used in violation of the city policy.'",
        "'speaker_3': 'And this allows for the community to be our eyes and ears and support us knowing and understanding when mass gatherings are happening, when additional potential public safety or other things are not scheduled because they were not permitted. And finally, I just want to give a big round of applause.'",
        "'speaker_3': 'And I know the mayor is very supportive of this as well. We are now accepting credit cards at Eldorado Park. I think that is just a huge, huge change and an ability for us to reduce the wait times for the number of individuals who used to have to make U-turns because they did not have cash.'",
        "'speaker_3': 'And I look forward to phasing in a more comprehensive. Documentation of the utilization of park users as they go into the park and what that looks like over time. So thank you very much for your hard work. I think that we are moving in the right direction.'",
        "'speaker_3': 'All three of you. Any other questions I had? My colleagues have already answered or asked. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilmember Supernanny.'",
        "'speaker_9': 'Thank you to all three departments. Excellent reports and very comprehensive. I just have one question. And it involves body worn cameras. So it's either for PD staff or our chief Luna. Great response that that will get things implemented possibly the first month of 2020.'",
        "'speaker_9': 'I just like to approach the question from the opposite direction because I'm sure there are a lot of variables and in getting these things up and in place. So council does its job. Let's say we approved this in this budget and I think the first meeting in October would be October 1st.'",
        "'speaker_9': 'That falls on a Tuesday. If you were to get the go ahead that night, what's the soonest that a contract could be executed?'",
        "'speaker_7': 'I'm being told October.'",
        "'speaker_9': 'Okay. So if we approve this October four, sometime within that 30 days, that a contract would be executed? Yes. Okay. And in terms of the point that Councilwoman Pryce brought up about ramping up for personnel and whatnot, it just seems like you have a pretty short window there.'",
        "'speaker_9': 'That's my impression there, that if you're going to get this thing implemented and in place the first month of 2020, and this contract is, let's say, executed November 1st. That seems like a very short window to get everything going.'",
        "'speaker_9': 'So. So you're you're telling us that that's that's all doable and and no real issues there.'",
        "'speaker_7': 'I will never say there won't be any issues. We will do our best to get there. But again, I do want to clarify. I don't know if I've done a good enough job of communicating this this evening. And by the way, if I didn't say this, I do have through the city manager's office a24 from memo coming'",
        "'speaker_7': 'to all of you regarding our legal obligations with 1421 and 748. It is pretty complex and. Please remember that the the people in the moneys we're asking for today are to comply with the law that's already passed and we're already behind.'",
        "'speaker_7': 'So even if we started. Two weeks from now, we're already behind. So I need people. And one way or another, those people are going to have to do that job. I already have people doing it now. I don't have enough people.'",
        "'speaker_7': 'So what I'm asking all of you to do as your chief is I need the money and people to comply with the law. And it just doesn't involve body worn cameras. We tied it in together, but it's it's all the legal mandates that we have a legal obligation to fulfill.'",
        "'speaker_7': 'So at the end of the day, hypothetically, we don't approve the moneys. I'm going to find the employees somewhere in this police department to complete those task. And it's not going to be pretty. But at the end of the day, we have to get it done as a team.'",
        "'speaker_9': 'Okay. I appreciate that. I just wanted to give you that opportunity or I just want to make sure council is doing everything that we need to do to make this happen. So thank you for that extra explanation. That's it.'",
        "'speaker_2': 'Thank you. Council member Vice Mayor Andrews.'",
        "'speaker_1': 'Yes.'",
        "'speaker_10': 'Thank you, Mayor. As minority. Fine. Thank you. You know the end. I thought I would wait it to the end because the fact that I knew how the questions would be asked, but not the ones that I want to ask you.'",
        "'speaker_10': 'And the biggest part about all of it is that with the chief fire and police. And Parks and Rec. Yeah, I just can't really commend you guys enough for the work that you do here in our city, especially with the fire and the police department.'",
        "'speaker_10': 'Because the fact that I feel like I live at the fire department, yeah, I'm 17, but station ten, you know, they're so quick and fast, I don't get a chance to sleep at night. That just goes to show you how busy they really are.'",
        "'speaker_10': 'And Chief, I'd like to commend you and your staff, because the fact that every incident that happened in my district, I get a call from one of either your commanders or one of your sergeants, and it's excellent. Only at the time when it's like four and 5:00 in the morning, I still get a report.'",
        "'speaker_10': 'And that's why I give everyone in my district my phone number. So if I do get a call from one of those individuals, I will have an update on it. So I really appreciate that. The only question I have to ask an individual and then in the patrol bill, I see that the traffic safety in the proactive'",
        "'speaker_10': 'role of traffic stops are listed as there, you know, as a key service service. And these officers based out of are these officers based out of, you know, our regular station, are these individuals who are solely responsible for these kinds of tasks like the motorcycle officers?'",
        "'speaker_7': 'Every uniformed police officer is responsible for traffic enforcement in the city. So if you if you're working a beat, say, in the area where you live and either, A, they observe a violation or they get complaints of a violation, somebody's running a stop sign, maybe driving too fast.'",
        "'speaker_7': 'Part of their job is to be proactive and make a traffic stop. They don't have to site all the time. It's their discretion. They cite or warn. We do have officers on motorcycles who primary function is traffic enforcement and there are out of our field support division, which is located on Lakewood Boulevard.'",
        "'speaker_7': 'But they have citywide responsibilities. And any time we get community concerns about traffic, whether it's coming from a community member or one of you, your officers, your staffs, they're the ones who get assigned to an area to enforce a speeding or maybe it's traffic around schools, specific traffic enforcement, and they can get around traffic a little bit'",
        "'speaker_7': 'easier. And they're the ones you don't want to see in your rearview mirror.'",
        "'speaker_10': 'Thank you, Jane. Also, I'd like the last question. How many more officers do we have working in the department? How are they assigned throughout the city?'",
        "'speaker_7': 'We have approximately I want to say it's 16 or 18 motor officers and there's we try to have coverage on multiple shifts. We get a lot of, for example, overtime or grants from the Office of Traffic Safety to specifically focus on people using cell phones, impaired driving, seatbelts and things of that nature.'",
        "'speaker_7': 'So they'll get assigned to the grants on overtime. But generally they are focused wherever the complaints are throughout the city.'",
        "'speaker_10': 'Thank you, because I haven't really had a great response when we're having our problems over on Magnolia and Pacific and they were there and they really have to tighten up a lot. So I want to thank you officers for that also.'",
        "'speaker_10': 'And that's enough. I don't need any more from you, Chief, on this. Thank you very much. Now for the fire captain, I'd like to I'm very happy to see that we have the Fire Corps, you know, program because under way, because it's really like, you know, to offer, you know, the help.'",
        "'speaker_10': 'And if there's any help that we can offer you, you know, and to recruit in, you know, at risk kids, you know, we'd be interested in being any part of that upcoming class. And I want to thank you for that.'",
        "'speaker_10': 'Also, you know, Chief, on that one and the like.'",
        "'speaker_8': 'I think it's a terrific program.'",
        "'speaker_10': 'It's a wonderful program. And thank you so much. And then regarding to the budget, looking at it, I learned that about the the limestone program targeting the city, the Latino community. And I am interested in my office having an outreach and in the material for this program, if it's possible.'",
        "'speaker_10': 'On that, and I don't really know much about it, but I'm seeing that that's in it. So how do you pronounce that?'",
        "'speaker_8': 'Yeah, you definitely go and get together with our community services.'",
        "'speaker_10': 'Thank you. Thank you. And the last I'd like with Parks and Rec, you know, in our recent community budget meeting, I heard in the ask for the continuing to be say program during the summer and the feasibility of establishing Mecca.'",
        "'speaker_10': 'This park is one of our sites. You know, I'd really like for us to look at this if possible. And I know that the meeting, the staff mentioned it, it costs about 25,000 would be safe season. So let's please keep this as a priority for my district cause I only saw that be save mentioned once in the'",
        "'speaker_10': 'budget book. So I'd really like for, you know, the Parks and Rec to really keep that as a priority, especially MacArthur's park there, because we have a lot of situations, you know, with homeless there right next to the park.'",
        "'speaker_10': 'So we could really keep some of those things possible. I really appreciate that. And last. And last. I know that lately in the budget hearing, we were heard from the Health and Human Services. But since both PD and parks are here, I think we need to work on an after hour and weekend homeless outreach program, especially around'",
        "'speaker_10': 'our parks. So I would like to meet with any of you and discuss this. You know, we get a chance to Y20 and that's the end of my report. Thank you very much asking.'",
        "'speaker_2': 'Thank you very much, Vice Mayor. Everyone has spoken already, so I'm going to make comments. And then if there's additional comments, we'll go from there. A couple of couple items. The first is, I don't know that I that we had publicly said yet that we have the live release rate is at 92%.'",
        "'speaker_2': 'So I just want to congratulate you on that, Mr. Mouat. And if there's anyone here from the Animal Care Services team that that's actually really going in the right direction. And if we if our if our total number for our total live release number is at 92%, that is showing some significant improvement.'",
        "'speaker_2': 'And we've been improving every year. But I want to just congratulate you on that. I know that was kind of in a slide, but I wanted to point to that and thank you for your work. And let's give our animal care team a round of applause because they work really hard.'",
        "'speaker_2': 'In addition, I just want to echo a couple of comments. One is I'm also an esthetics person. I want to agree with Councilman Price on the trash cans any time we can. As you know, Mr. West, I always talk about stuff like this, but any time that we can ensure that everything looks, matches and looks the same'",
        "'speaker_2': 'and there's a quality to it, please, on those trash cans before we purchase a whole bunch, make sure they're quality and they look similar. I want to lift up something the vice mayor, Andrew said, which was I am also very interested in our homelessness efforts around weekends especially.'",
        "'speaker_2': 'I find that because we don't have the Multi-Service Center open on the weekend and because we don't have staff, obviously we have quality of life and our other folks out there doing the work in the fire department, but we don't have as much dedicated folks.'",
        "'speaker_2': 'Oh, they don't. I thought they were on weekends. Okay. So also quality of life and fire apparently are not a weakness, but I have found that we are doing as best we can during the week. But then on the weekends it becomes very apparent that a lot of folks out there need support and that there is not'",
        "'speaker_2': 'any sort of resources. And so and it also has an impact, quite frankly, on on the way we respond to needs and folks that are out in the community. And so I would just I would just concur that that's something that we should do.'",
        "'speaker_2': 'And I would hope that the council would look at that as an issue. The third is I notice that all everyone talked about measure in their presentations, and I just want to uplift that again and certainly think and talk about the impact that measure has had on the city.'",
        "'speaker_2': 'And it's had an impact on every department, but especially on police and fire. And then the last thing, Chief, I just wanted to I know there's been some discussions about violence and some of the councilman mentioned our needs for policing.'",
        "'speaker_2': 'And I want to just ask to ask you a couple of questions, and I think they're important as well. The first is on the officer involved shooting number. I, too, want to commend you and the department and the leadership.'",
        "'speaker_2': 'I think that you have you all and our rank and file have done extensive amount of of training and thinking about how we how we work on this. This is a very complex and difficult issue. And it's it's something that we want to make sure that all of our officers feel safe.'",
        "'speaker_2': 'And the fact that your you have implemented just some different different tactics and different ways of dealing with incidents. Incidents I think is very commendable to you. And I just want the whole team to know that it's it's very impressive.'",
        "'speaker_2': 'And it doesn't mean that there aren't going to be tragic incidents in the future. But I just want to commend you on that, Chief. And I also want to note something that was alluded to earlier. I think we know there's a lot in the in the in the media about about crime or violence.'",
        "'speaker_2': 'And I think every single crime that happens is very serious. And certainly every single homicide that happens in our city is very serious. And every homicide, like the one we had recently, impacts families and people and loved ones.'",
        "'speaker_2': 'Our homicide number rate this year up to now is is what number.'",
        "'speaker_7': 'And before I answer that, you're right. Every number I'm going to say is is something we look at very seriously. Each one gets investigated fully. As of today, we are at 19 compared to 19 last year, which I wish it was at zero.'",
        "'speaker_7': 'And we fight really hard to try and do everything we can to prevent all of them.'",
        "'speaker_2': 'I know and I know that sometimes I'll read that the homicides are dramatically up this year. There's a lot more than last year. And I think what you're saying is that there's at this point in the year, there's a same amount this year or was last year, is that correct?'",
        "'speaker_2': 'Yes, sir. And then I think that I know that obviously we know that the homicide rate in the last few years has been some of the lowest that we have recorded in the city's history. I know that every single one is a is a tragedy.'",
        "'speaker_2': 'A few years ago, we were averaging I think I know now we're averaging depending on the year, it could be 30, it could be a little more, could be some, some less. I know that we used to average 50, I think maybe 20 years ago when we were averaging 80.'",
        "'speaker_2': 'Before that we were averaging we've averaged over 100 as well. Has the overall crime rate decade to decade gone down over the last 40, 50 years?'",
        "'speaker_7': 'Drastically? There's no comparison. When I was a young homicide detective in 1992, we had well over 100 murders, and that was the average right around that time. So when when people ask me out in the community, it sounds like things are getting worse today.'",
        "'speaker_7': 'I've been here 34 years. And I'm going to tell you, we the city has changed drastically when it comes to violent crime.'",
        "'speaker_2': 'Is it safe to say the city's safer today than it was ten years ago?'",
        "'speaker_7': 'It's a lot safer.'",
        "'speaker_2': 'Today than it was.'",
        "'speaker_7': 'Absolutely. But the changes that it's social media, 24 hour news cycle, everybody knows everything that's happening on these devices. So they feel like there's more of it happening. And that's not to downgrade the seriousness of the events we're still responding to.'",
        "'speaker_2': 'And I know I also have looked at the media reports that you post online that are that are for public consumption. I think they're for public view. And I notice that that the media reports for for this year that if if the things stay on track, in the end they certainly could change.'",
        "'speaker_2': 'But that overall crime this year at the six month at the six month check in is lower than it was last year at the six month check in, is that correct? A little lower overall crime?'",
        "'speaker_7': 'That is correct. We we are as of the the end of June for the 3010 that we report to the FBI, we have a 4.2 reduction in overall part one crime.'",
        "'speaker_2': 'And I know that. And I know that in the last few years, we've been recording the lowest levels of part one crime that we've ever recorded in the history of the city of Long Beach. Is that is that true?'",
        "'speaker_7': 'That is well within range. We are much better today than we have been in the past.'",
        "'speaker_2': 'And I certainly think one of the things that's important, obviously, is looking at data and sometimes I say this to uplift the work that you're all doing, but all our partners across the city, whether it's in parks or in libraries or across the city, violence of any kind at any time is serious and is involves real families'",
        "'speaker_2': 'and real people, and they're incredibly tragic and heartbreaking. I think everyone feels that. I also I also want to just commend you that every every single one of those is is serious. But the fact that they continue to decrease and that we are experiencing right now lower levels of overall crime that we have in the last 40'",
        "'speaker_2': ', 50 years, I think is also important to note. And and I also want to be clear that when I when I read that, you know, homicides are shootings are up dramatically over over the last few years, I think the numbers and the data is the data.'",
        "'speaker_2': 'And and so I think that's important as well. So I just want to I just wanted to add that I think that you all are doing a fantastic job and I'm really proud of our police department. It's a tough environment to work in, but these numbers and your work show just some incredible progress.'",
        "'speaker_2': 'And I just want to thank every single member of the rank and file. And then and then lastly, I'll just say again to the finance staff, you guys have done a really great job. So thank you again for this presentation, Councilmember Pierce.'",
        "'speaker_4': 'And thank you. I want to talk about trashcans again. I left it off my list and it's one of my pet peeves. I believe correct me if I'm wrong, Mr. Modica, didn't we in the last two years purchased some big bellies out of the Tidelands funds for our beaches?'",
        "'speaker_6': 'We did, yes. So we have a report that we'd like to give you. We've done additional big bellies. We also, I believe, put something like several hundred additional cat trash. Hands out on the beach. So we will get you those stats.'",
        "'speaker_6': 'It's important to celebrate what we've done and we know we need to do more. So and we agree things need to look consistent and tight. And and and the and the trashcan caps help as well.'",
        "'speaker_4': 'Yes. And I brought that up because of the conversation is can we match our trash cans? I don't know. I know there's an additional cost associated with emptying big bellies. But they keep our streets so much cleaner and our parks so much cleaner.'",
        "'speaker_4': 'And I feel like every budget I'm a broken cycle, a broken record with whatever we can do to get whether it's big belly or different trash can. The trash cans we have on Broadway are probably what I'm thinking are the trash cans that they want to put back on our beaches while they have a lid.'",
        "'speaker_4': 'You can put your hands in each side and they dump over while they have sand in the bottom. Every Sunday I drive down Broadway and there are empty trash cans. And so whatever we can do, it's just like my biggest pet peeve.'",
        "'speaker_4': 'Those trash cans make our streets look filthy. They're disgusting looking. They're not clean. And I know they're cheap to to empty. But what's the cost? Whenever we think about how much pollution we're putting back in and the cost to those businesses, when you go down a corridor, that's beautiful, except for their trash cans.'",
        "'speaker_4': 'I never thought trash cans would be my issue, but trash cans, whatever we can do to make sure they have solid lids. And then I had one question for Parks and Rec, our mobile adoption van, which I'm very happy to say I adopted Jojo out of.'",
        "'speaker_4': 'I know one of the challenges has been cost to try to get them to be more mobile and to be at places. Do we expect an updated plan on how to get the mobile adoption van actually out and being used more frequently?'",
        "'speaker_6': 'Yes. So that's that's very much part of the Elma strategic plan. And also, I'm excited because of the opportunity of now being given the tools to raise additional monies to be able to do these extra things that will make a big difference.'",
        "'speaker_4': 'Awesome. Thank you very much.'",
        "'speaker_6': 'And Councilmember, I actually do have some of those stats right here if you'd like them. Over the last probably six months or so, we've deployed about 100 of the blue barrels throughout our parks in the Tidelands, and we've done additions on 60 of the 95 gallon rollout receptacles along the beach bike path.'",
        "'speaker_6': 'We've done a number of other big bellies and just this step blows me away. We have a two person team that empties every day, 350 trash receptacles in the Tidelands area along our beaches. So we definitely have a crew that's doing that.'",
        "'speaker_6': 'We can continue to do more and we hear you loud and clear.'",
        "'speaker_4': 'And I think I speak for Councilmember Price and myself. We hate hate the blue barrel trash cans. We just we will take out a campaign against those trash cans if we have to. But also, I know that we've used resources in our Tidelands funds in the past.'",
        "'speaker_4': 'Whatever we can do is we're having the conversations around the Highlands to make sure that if we're talking about consistency, that we go towards the best. I know that the Mr. Beck had talked about. Maybe there's something in between those mushroom top ones, the blue barrel and the the expensive ones to empty.'",
        "'speaker_4': 'So I thought we were going to get a report back on that last year, I guess is really what I'm saying is that we haven't finished our trashcan conversation and I want more trash can conversation.'",
        "'speaker_6': 'We will certainly follow up on that.'",
        "'speaker_2': 'Councilman Monk. Councilman Mongo.'",
        "'speaker_3': 'That work now. Thank you. I really want to reinforce what the mayor said about statistics and misinformation about crime. Are we on a pathway or trajectory to start integrating the crime statistics in a more user friendly manner through our open data portal?'",
        "'speaker_3': 'Is that a better conversation for T.I. or is that a police conversation?'",
        "'speaker_7': 'We are putting it out through our website. But yeah, it's probably better answered by T.I..'",
        "'speaker_4': 'Okay, I'll work on that.'",
        "'speaker_3': 'And then I don't know if you'd have this available today, but perhaps for your recall to the Budget Oversight Committee, if we were to add either through a position or through overtime, a quality of life team for our weekends, I'd be interested in knowing what that would cost and potentially some sources that we could pull it from'",
        "'speaker_3': ', because I completely agree. The homeless population needs to be able to be served 24 hours a day, seven days a week. And if they become accustomed that we are not on duty on the weekends. That's when we have some of the challenges.'",
        "'speaker_3': 'I know I've also met with the city manager on this and I plan to meet with Park Public Works as well. But we have Muse with Caltrans to do maintenance on their property. We need a use immediately to do quality of life.'",
        "'speaker_3': 'Support and enforcement on.'",
        "'speaker_4': 'Both our waterways that are.'",
        "'speaker_3': 'County facilities. DWP has some land behind Steve Lee that we really need to be able to access. And furthermore, on the Caltrans properties, we cannot wait for their process, their postings there. It's just too long of a process and the residents cannot rely upon it.'",
        "'speaker_3': 'And so I'd be interested in a report back. Within, I don't know, 120 days on what our options are and or a draft. And I will also take my time to meet with the department heads city attorney public works to help form that because it's crucial.'",
        "'speaker_2': 'Well, thank you very much. That concludes questions for hearing out of number one. And we are going to try to comment on the budget if there's. I think we have folks lined up for coming on the budget, so please come forward cautiously.'",
        "'speaker_2': 'Robert Fox and Control, Gary Shelton, Ramon Vana and Carlos Avila. Please come forward.'",
        "'speaker_1': 'Mr. Mayor, before we hear from the public, we have a there's been some questions from council to hear from different departments. So here's the schedule. So next Tuesday, we plan to hear from public works and the capital improvement budget.'",
        "'speaker_1': 'Also development services. Then we had September 3rd. We can hear we've had our requests for health and civil service so we can have health and civil service instead of the harbor and the water department. And I think there was a request for ID.'",
        "'speaker_1': 'So on September 3rd, we can have health, civil service and technology. If that's all right with the city council.'",
        "'speaker_2': 'We'll work on the schedule. Thank you.'",
        "'speaker_1': 'Courteously, please.'",
        "'speaker_4': 'Right. Carelessly. A number of things to thank you for here. But with only 90 seconds, I'm going to skip those.'",
        "'speaker_2': 'You have you don't have 90 seconds. Oh, you.'",
        "'speaker_4': 'Don't? Okay. You have 3 minutes. All right. So in terms of the budget, I'd like to talk about the parks budget first. And I want to thank Corrado Mackay for being I'm very encouraged by his willingness to listen and consider alternatives.'",
        "'speaker_4': 'I've been really pleased with Stacie Mungo's program of Friends of Parks that has the promise for working together with the community. Each park is unique. One is an ecosystem with wildlife, and another can be a sports center. So the friends of those parks are all different, have different frameworks on them.'",
        "'speaker_4': 'My my greatest concern here in Eldorado Park is the fact that there has been a lack of maintenance for a number of years, the long term maintenance. I used to ride my bike around the lake in Area three in the 1980s, and that would be a death trap to do that today.'",
        "'speaker_4': 'If you go along that there's chunks of cement six and eight feet or six and eight inches high every few feet. It's broken. And we've talked about that and that it requires capital dollars and a lot of money.'",
        "'speaker_4': 'But we can't ignore that because that's an ADA compliance issue. And if you'd rather pay for a lawsuit, I mean, that's just where I don't want to go. You know, the first time somebody stumbles into that. So I'd really like someone to take a look at that.'",
        "'speaker_4': 'I appreciate the talk about trash cans. We have spent a year on trash cans and our friends at parks groups. And I can only tell you that I am concerned about the discussion about esthetics because we don't have toilets, funds where we are.'",
        "'speaker_4': 'We don't have the money to go out and buy all new trash cans. We have trash cans without bottoms in them, so we need trash can lids. And I don't care what the trash cans look like and I don't care what the lids look like, but those animals are being hurt.'",
        "'speaker_4': 'Every week I am given reports of animals that are taken to emergency and I see them in the park and it's heartrending to see their little foot cut off. And, you know, how do they get away from a coyote if they don't have a foot?'",
        "'speaker_4': 'So I'm really asking that instead of focusing on esthetics, we focus on getting trash can lids and I don't care what they look like. The third thing I'd say about the budget is coming from the private sector. In the budget meetings I've been in, there's always a discussion about reducing budget and headcount, and I don't hear any'",
        "'speaker_4': 'of that in the city ever. I always hear about adding headcount and adding budget making giving raises. So I'd like to see industrial engineering brought in.'",
        "'speaker_2': 'Thank you very much, Mr. Fox.'",
        "'speaker_6': 'Good evening, city council and mayor. It's working. It's on, Robert. I would like to speak on a few subjects. First one is for the police department. I hope we can include in this budget enforcement for E-Scooters. It's a new program that we have here in the city and we have not planned for any kind of enforcement mechanism'",
        "'speaker_6': 'on e-scooters. And we've had several accidents in the Broadway area, and we don't have any options there. We don't have anybody to call or any kind of monitoring whatsoever. So I do hope that we can set aside at least some portion of our police budget to address that relatively new addition to the mobility of Long Beach.'",
        "'speaker_6': 'Also bike enforcement. Since we have such a combination of things happening at this point in time, it's imperative that we have people that actually stop at stoplights or stop at stop signs. The resultant accidents are tragic for everyone, and that's going to take enforcement.'",
        "'speaker_6': 'That's not going to be done voluntarily. I would also, of course, like us to record any dispatch call. I know. That's really. Minutia. But if we don't record the minutia, we don't have a pattern of what happens. This was part of our problem on the Broadway corridor, was trying to figure out what actually our stats were.'",
        "'speaker_6': 'And so I applaud your great work and I hope that we can add on. I mean, that may take a staff person to record all dispatch calls. But particularly if we know we have a problem in a certain area, I think that becomes terribly important for us to make a decision.'",
        "'speaker_6': 'As for the fire department. I know you're into the idea of adult fall programs. Unfortunately, the addition of will anchors on the Broadway corridor have accelerated the falls of individuals, particularly the elderly. I myself happen to have two hip replacements, and I don't really want to fall.'",
        "'speaker_6': 'And I've already fallen once. And I think I have pretty good eyesight, even though I have to wear glasses to read. It occurs to me that we really need to take a really serious look about our infrastructure if in fact we want to preserve people's health and prevent the tripping falls that are happening.'",
        "'speaker_6': 'So I'd like us to look into that as a fire department and give a recommendation to the city manager as to how we might mitigate that. I think that's a reasonable thing to do. Also, it seems to me we need to in some way notify the public that there is a $250 charge for any kind of emergency'",
        "'speaker_6': 'services, like an ambulance to them. I have so many of my people in the area complaining to me about they got a bill for $250 because the paramedics showed up. And I think that if we don't tell people about that, they get irritated afterwards.'",
        "'speaker_6': 'Thank you so much.'",
        "'speaker_2': 'Thank you so much. Miss Cantrell.'",
        "'speaker_4': 'I was glad. Good evening. And Cantrell and I have just been reading a fascinating book by a retired librarian, Long Beach librarian Claudine BURNETT, called Prohibition Madness. And I found this interesting. Statistic about the police department. She says that when the town was about 18,000 people, there were 23 men on the police force.'",
        "'speaker_4': 'And then in 1933, which is the year I was born, there were. 200. Members on the police force. And this was for a population of 145,000 people. Today we have the number of sworn officers as being 1.6 per thousand.'",
        "'speaker_4': 'In 1933, in the depths of the Depression, there was one for every 750 people. I am very concerned about the fact that you are not replacing the police that we lost in the last recession. We no longer, as you said tonight, have the Athletic League.'",
        "'speaker_4': 'We no longer have the. Field anti-gang unit. That go out in the field and see what's going on. We do not have visible patrol people. We don't have the car, the patrol cars in our neighborhoods that we used to have.'",
        "'speaker_4': 'And I think that this even though you say crime is down. People that are in the neighborhoods don't feel this way. So I would like you to use more of Measure A's money to hire more policemen. I think that this will be.'",
        "'speaker_4': 'A better use of the money than some of the other things that have been mentioned tonight. Thank you.'",
        "'speaker_2': 'Thank you, Miss Cantrell. Mr. Shelton.'",
        "'speaker_6': 'Hi, everybody. My name's Gary Shelton, and I'm going to try to draw a nexus between the budget that you're looking at tonight for public safety and Parks and Rec to a couple of other items that might not seem that obvious at first, but the first is that I would hope that you would ask the department heads to'",
        "'speaker_6': 'work to control overtime expenses. And the second is that I would hope that you folks would work to identify available funds for the city's housing trust fund. Now, I'll try to explain to you how I get to those two items from tonight's budget meeting.'",
        "'speaker_6': 'We do have public safety on the docket. We have a lot of homelessness. It was discussed tonight, even homeless dogs. But a lot of money goes to homelessness. I think one thing that we didn't hear and I think we would discover if we asked is that the fire department probably has more calls for service toward assistance to'",
        "'speaker_6': 'homeless people than the police department does. Just a wild guess. But I think that they're they're out there in the streets dealing with homeless people who have fallen or for whatever reason, need their assistance more often than the cops.'",
        "'speaker_6': 'If we were to start now and we have to start now somewhere, and why not now to create the housing that's necessary to put those people into housing where they really belong in, to services where they really belong for their own benefit.'",
        "'speaker_6': 'Then what we would look at would be reduced calls for service and reduced expenses and reduced workload on the public service people. Now we have to start somewhere. We might not get to that point this year, but we do have to start somewhere.'",
        "'speaker_6': 'So the reason I mentioned the housing trust fund is because that's one of the local sustainable sources of. It has a local sustainable source in the transit transit occupancy tax for up to $500,000 a year to come out of the general fund, which is earmarked.'",
        "'speaker_6': 'And a couple of years back and I've been here many times when we had the periodic budget reports expressing that there is funds available, but we lost money never going into the housing trust fund because it was always never available.'",
        "'speaker_6': 'The funds were not available. Now I would ask you folks to work to make sure that those funds are available every year. Okay. And the one year that came down here and it was so disappointing because the funds were clearly available, they had all been spent all $500,000 for police overtime.'",
        "'speaker_6': 'So if we reduce overtime, we can help create housing. If we create housing, we can host housing homeless people. We can reduce the calls for service to those homeless people. Now, I don't think that's a far shot, but we have to start somewhere.'",
        "'speaker_6': 'Okay. So it's up to you folks again to try to work to identify the available money in time that it can be put into the housing trust fund. And also to ask your department heads to work to control overtime.'",
        "'speaker_2': 'Thank you. Thank you, Mr. Shelton. Ramen Vesuvius. Have your oats close enough. Ramon?'",
        "'speaker_6': 'Yes, that's fine.'",
        "'speaker_1': 'Hey, I'm going to be quick. I see you guys are kind of.'",
        "'speaker_6': 'Falling asleep, so I'm not going to keep my.'",
        "'speaker_1': 'My talk to too long.'",
        "'speaker_6': 'I support all of these departments. I think all of you do, too. And here in District five, we're just noticing that it looks like things are just falling by the wayside. And so all I can say is that from the perspective of the residents, we've never seen the parks in worse shape.'",
        "'speaker_6': 'Right now, I applaud the.'",
        "'speaker_1': 'Mayor when he he said the same thing when we.'",
        "'speaker_6': 'Were running out of water for our parks. So I applaud you for.'",
        "'speaker_1': 'At least admitting that to some of the people you'd never seen them that that bad. Since we've gotten the since we've gotten some water back, our.'",
        "'speaker_6': 'A lot of our parks have improved. Right. So I can say that.'",
        "'speaker_1': 'At least one of the problems that we've had for about well, for a long time are the the piping for the for the reclaimed water that we have. It's all of their pipes are about their way past their their lifetime.'",
        "'speaker_1': 'And so it's a matter of time before they just burst. And all together, there's about $212 million worth of of, you know, an undone maintenance that needs to be done on these pipes just replaced altogether. So that's the main thing that I have.'",
        "'speaker_1': 'I'm going to, you know, put my my head to the grindstone and I'm going to look for some some grant funding. And I'm going to work with the parks like I was doing.'",
        "'speaker_6': 'With with Marine.'",
        "'speaker_1': 'And we're going to see if we can get get some money to to help the parks. And I've also secured I got some quite a bit of money that I have secured from private funding to help our parks.'",
        "'speaker_1': 'But it's going to take an effort from the city to to prove to me that they care about our parks. I haven't seen any evidence in a long time. The part that water was a good, good reason, a good.'",
        "'speaker_6': 'First start. But that was a very minor, minor effort. So I can secure money. I can help you, help you get what you want to go, but you have to at least.'",
        "'speaker_1': 'Meet me halfway. I have approached I've approached my council person, haven't heard anything. So all I'm saying is I'm bringing this to you, and if you want to ignore it, that's fine.'",
        "'speaker_6': 'We we all know that.'",
        "'speaker_1': 'The police, in the way that they are making the statistics every year seem to be changing. So and that's that's easy.'",
        "'speaker_6': 'That's publicly, you can see the way that they measure the crime statistics.'",
        "'speaker_4': 'So I'm just letting you know that. Have a great.'",
        "'speaker_6': 'Day and I'll see you out.'",
        "'speaker_2': 'Q Mr. Carlos of Ibis.'",
        "'speaker_1': 'Good evening. I want to address a couple of things. The first has to do with the police department recently. A few months ago, I ran into something called the police scorecard. Those are the statistics in the police scorecard are from 19 I'm sorry, from 2016 to 2017.'",
        "'speaker_1': 'And they don't really present Long Beach in very good light. Out of the 100 top or largest police departments in California, Long Beach ranks number 96. Now, I know that things have been changing. I know that Police Chief Luna presented some some really encouraging statistics, and I applaud that.'",
        "'speaker_1': 'But at the same time, I would like to see the chief's response to the police, the items addressed in the police scorecard. Now, I know that during the campaign for Measure A, there was a glossy flier that came out kind of putting the fear into us, telling us that that we really needed to get those 200 police'",
        "'speaker_1': 'officers reinstated. That hasn't happened yet there. I mean, it looks like we barely are able to keep up with attrition. And I know that all the overtime that the police are working must be pretty stressful and must be leading to some not not very good situations.'",
        "'speaker_1': 'Let's see. Parks in the western half of Long Beach where I live. We have a. A tiny amount of parks in relation to the site of Long Beach with Eldorado Park and with all the golf courses. The parks and the urban forests are really the lungs of the city.'",
        "'speaker_1': 'And in the west side of Long Beach, where I live, where we get the direct results from the four or five freeway, the 710 freeway, the refineries, the port, the incinerator, we really need more parks. Now, this was sort of interesting, the joint use of as a means to increase open space.'",
        "'speaker_1': 'That's a little bit of a stretch because it doesn't really increase open space. It allows use of school facilities as parks, but it's not increasing open space. Thank you.'",
        "'speaker_2': 'Thank you so much. That concludes the comments for our budget hearing. We will continue the budget hearing at the next council meeting and continue with the different presentations. So thank you all for participating in the budget that was hearing item number one before a hearing item.'",
        "'speaker_2': 'The second hearing on the agenda, I want to ask Mr. Patrick Lavin to come forward if he is if he is here.'",
        "'speaker_5': 'Ms.. Mr. Mayor, there's two people queued up on this one.'",
        "'speaker_2': 'I'm sorry. Is this for public comment? Responses are. Councilman Pearce?'",
        "'speaker_4': 'Yes. I just wanted to clarify two things. I know from talking to our commanders that PD did receive a grant to start enforcing the scooters and the bike program and that that enforcement is supposed to be starting sometime soon.'",
        "'speaker_4': 'Is that correct?'",
        "'speaker_6': 'So in the FY 20 budget, we are actually proposing that we add positions as we formalize the ordinance for the SCOOTER program. So there will be enforcement positions as well as administrative positions.'",
        "'speaker_4': 'Great. And then I also just wanted to clarify, we do record all of our dispatch calls in a911.'",
        "'speaker_1': 'Yes, we.'",
        "'speaker_6': 'Do.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. And I wanted to just refocus and thank you for bringing up the point about data. I think it's important we do look at data. You know, my conversation with my line of discussion with the police chief was really focused on those months where we get out of school and get back in school.'",
        "'speaker_5': 'And in fact, the data shows that we had a 50% increase in violent crimes in North Division, 18% in West Division during that period. That spike that we were talking about and when I said it seemed like it went up.'",
        "'speaker_5': 'I'm not saying across the whole city or smoothed out across the whole city or for the whole six months, talking about that period of time when kids get out of school where we all sort of brace. And we saw that.'",
        "'speaker_5': 'And so, you know, sometimes we we need to it's okay to talk big picture about the data, but our job is to really focus in. And so I really wanted I really wanted to have that. Where I wanted that conversation to go was, what can we do around those months to really boost our response or prepare for'",
        "'speaker_5': 'it? So thank you for bringing up the data. The other thing is the way we break out our data is not really reflective of the way people communicate in the public. Right? So when the public's on our reports, I'll say part one, part two, aggravated assault.'",
        "'speaker_5': 'But what you'll see in the press are the dramatic things. A shooting here, a shooting there. We don't really report in that same way in shooting. So we do need to probably think about how we sort of engage and talk about it in a way that actually responds to the needs of the community.'",
        "'speaker_5': 'So I want to just make sure, you know, I didn't want to be I want this to be misunderstood the way it was last week. I'm talking about a very specific thing. When we get out of school, when we get back into school, I think we should I'd love to sort of talk about that period of the'",
        "'speaker_5': 'year. Thanks a lot.'",
        "'speaker_2': 'Thank you very much. With that, we've concluded our budget hearing. I'm Mr. Levin.'",
        "'speaker_1': 'On our end city council members, I wanted to take this opportunity to introduce myself and our organization. I'm Pat Lavin. I'm the IBEW journeyman lineman from IBEW 47. We represent 12,000 IBEW members throughout the state of California and Nevada, and we recently have filed an affiliation with the Association of Long Beach Employees.'",
        "'speaker_1': 'I want to take this opportunity to introduce us that through the hard work of my assistant business manager, Dick Reed, and the members of the association and the other members of our staff that worked on that. So we look forward to a long and productive relationship with the city of Long Beach, not only for our 477 new'",
        "'speaker_1': 'affiliated ALB members that are now part of IBEW 47, but also for about the 2000 members of the IBEW of our local union and other local unions from the Southland that live and work and also vote here in the city of Long Beach.'",
        "'speaker_1': 'Thank you for your time.'",
        "'speaker_2': 'She'll have an thank you and welcome. And we know we'll be we'll be talking. So thank you very much. And we are we're going back to our hearings. This is something we were discussing in closed session and we didn't get a chance to do it earlier.'"
    ],
    "General Plan Amendment and Mitigated Negative Declaration for 1500 East Anaheim Street.": [
        "'speaker_2': 'So I brought that comment forward. But that's related to some of our closed session discussion. Now we're going to hearing item number three. Second. It's the second hearing, but it's titled the hearing out of number three.'",
        "'speaker_0': 'Report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a mitigated negative declaration. Approve a general plan amendment and adopt a resolution amending the Land Use District Map relating to the property at 1500 East Anaheim Street.'",
        "'speaker_0': 'Approve a zone change and declare ordinance amending page ten of the Zoning Use District Map. Read the first time in late over in the next regular meeting of the City Council for final reading and approve site plan, review and vesting tentative tract map for a five story 198,259 square foot mixed use building at 1500 East Anaheim Street'",
        "'speaker_0': '1209. Walnut Avenue, District six.'",
        "'speaker_2': 'Thank you very much. I'm going to turn this over to staff for the presentation.'",
        "'speaker_1': 'Thank you, Mr. Mayor.'",
        "'speaker_6': 'We will have a staff report from Christopher Coons, our planning beer manager.'",
        "'speaker_2': 'Good evening, Mayor, and members.'",
        "'speaker_1': 'Of the city council. The item before you tonight is the land use.'",
        "'speaker_9': 'Related approvals for this particular.'",
        "'speaker_1': 'Affordable housing development at Anaheim and Walnut. Before I dove into those details that are in front of you. Did just want to remind you about the city's.'",
        "'speaker_2': 'Role in.'",
        "'speaker_1': 'This project. We're not just the regulator, but in this case, this was city property. Bridge development was selected as the best possible developer for this particular site. And through LP, CIC, the.'",
        "'speaker_2': 'Long Beach Community Investment.'",
        "'speaker_1': 'Corp. were also an investor in this.'",
        "'speaker_2': 'Project, providing a $4 million loan.'",
        "'speaker_1': 'To this project so that we can provide adequate housing for low income persons, those at risk of homelessness, and those with special needs. So as I mentioned, the property is at Walnut and Anaheim. It's roughly catty corner.'",
        "'speaker_9': 'Across the street.'",
        "'speaker_2': 'From the library.'",
        "'speaker_1': 'There. The existing zoning is a mix of community commercial and two family residential with a similar mix and the general plan designation. Under the future or.'",
        "'speaker_2': 'General plan, the land is all meant.'",
        "'speaker_1': 'The entire site is.'",
        "'speaker_2': 'Designated.'",
        "'speaker_1': 'For mixed use housing. This shows you the existing conditions.'",
        "'speaker_2': 'Out there on the site.'",
        "'speaker_1': 'So it's a vacant site.'",
        "'speaker_2': 'There's no demolition involved.'",
        "'speaker_1': 'In this project.'",
        "'speaker_2': 'And you see.'",
        "'speaker_1': 'The.'",
        "'speaker_2': 'White fence around the site.'",
        "'speaker_1': 'The project proposal includes 88 affordable apartment units. Of those 88 units, 67 are for families, 20 are for individuals with special needs. And there's one on site manager unit.'",
        "'speaker_2': 'There's 32 one bedrooms, 31 two bedrooms and 25 three bedrooms. Those three bedroom units being.'",
        "'speaker_1': 'Particularly critical to meet the shortage of large.'",
        "'speaker_2': 'Family units in our city.'",
        "'speaker_1': 'The affordability on the project is.'",
        "'speaker_2': '40 extremely low units, 13 very low units.'",
        "'speaker_1': '34.'",
        "'speaker_2': 'Low income units, and the one manager unit in addition to the housing.'",
        "'speaker_1': 'We're very excited that this project includes just under 24,000 square feet of ground floor medical space. There will be a children's clinic in the ground floor of this.'",
        "'speaker_2': 'Building in addition.'",
        "'speaker_1': 'To some.'",
        "'speaker_2': 'Residential amenity.'",
        "'speaker_1': 'Space and the parking garage. There's a.'",
        "'speaker_2': 'Subdivision action as part of the entitlements.'",
        "'speaker_1': 'To merge the various parcels into one unified development. So as I mentioned at the ground floor, you have the children's clinic as well as parking. You proceed up various floors to provide the residential units. And then there is outdoor terrace area atop the parking garage to provide additional recreational opportunities for the residents of the building.'",
        "'speaker_1': 'This just shows you how that outdoor terrace area will look. I want to compliment Bridge. We went through a very long entitlement process on this project, but that was necessary to get that design right. And one of the issues we were working on was how we can provide these needed units but provide a high level quality of'",
        "'speaker_1': 'life for those future residents, including recreational opportunities, because we weren't able to do that on the ground floor. We did this redesign, which allows this outdoor terrace area to provide that amenity space. This just shows you.'",
        "'speaker_2': 'And rendering what that.'",
        "'speaker_1': 'Amenity space terrace will look like. This shows you the renderings.'",
        "'speaker_2': 'Of the building.'",
        "'speaker_1': 'Most critically. Anaheim has a major corridor with substantial buildings, but as you back off of that corridor, you have smaller structures and this.'",
        "'speaker_2': 'Building will back down.'",
        "'speaker_1': 'In compliment to those lower, strong structures in the neighborhoods, to the rear. And you have the parking area.'",
        "'speaker_2': 'Providing that.'",
        "'speaker_1': 'Reduced.'",
        "'speaker_2': 'Height and some buffering between the.'",
        "'speaker_1': 'Residential uses, fronting Anaheim and the smaller apartment structures to the South. This just shows you a map of the general plan amendment that's in front of you. The only reason this is in front of you is because on the date that the applicant filed, the general plan amendment was necessary.'",
        "'speaker_1': 'Once the land use element becomes effective, this would not be necessary. But trying to move forward with this project at this time. This is the corresponding zone change. It allows for the unified development across all the parcels, creating a single zone to allow the more unified development.'",
        "'speaker_1': 'There is a density bonus associated with this project. This allows of relief as a matter of right on issues related to setbacks as well as loading space requirements. And while the project does meet open space requirements, there is a slight modification to exactly how that open space is provided.'",
        "'speaker_1': 'There was a secret document, initial study and mitigated negative declaration prepared for the project. All of.'",
        "'speaker_2': 'Those mitigation measures have been incorporated.'",
        "'speaker_1': 'In front of you and there is a safety improvement project.'",
        "'speaker_2': 'Underway and the planning stage along Anaheim and this.'",
        "'speaker_1': 'Developer will be contributing in lieu to that effort that will be later installed by public works. So in front of you is to adopt the.'",
        "'speaker_2': 'Environmental.'",
        "'speaker_1': 'Document, adopt the resolution relating to the General Plan Amendment adopted by.'",
        "'speaker_2': 'Ordinance, the change to zoning and.'",
        "'speaker_1': 'Approve the associated site.'",
        "'speaker_2': 'Plan, review and vesting tract.'",
        "'speaker_1': 'Map for this five storey mixed use building with 88 affordable apartment units. So that's my very brief presentation in the spirit of brief.'",
        "'speaker_2': 'Meetings, and I'm glad to answer.'",
        "'speaker_1': 'Any questions that Council may have.'",
        "'speaker_2': 'Thank you. Since this is a hearing, we will first go to public comment. Mr. Vice Mayor, I know there's a motion and a second we're going to public comment and then I will go from there. I'm going to call the first ten, speak the first few speakers.'",
        "'speaker_2': 'James Sasso city of San Marino con carelessly. Robert Fox those please. 5/1 speakers can please come forward in that order. James Soso Cynthia San Marino, Con Corliss, Lee and Robert Fox.'",
        "'speaker_6': 'Good evening, Mayor and city council members. My name is James Suozzi and I'm speaking as the associate director of Long Beach Forward tonight in support of this really awesome Anaheim and Walnut project. So our collective vision is a long beach where race and income don't determine one's future, but rather that we're a community where everyone is safe'",
        "'speaker_6': ', connected and healthy. And currently, when it comes to living a healthy life and predicting how long someone will live, our zip code is more important than our genetic code. And Long Beach, seven years can be shaved off your life if you live in neighborhoods with less access to resources in places like Cambodia Town here in Long Beach'",
        "'speaker_6': ', because where we live is more about than just our address. It's about our opportunities and access to safe housing, healthy food options, and comprehensive health care. And in areas like Cambodia Town, where this project is situated, life expectancy is lower than in other parts of the city.'",
        "'speaker_6': 'And as in the case with other cities across California and the country, the root cause is racial and economic discrimination. That has happened over generations. So what that looks like today is the high number of residents living in poverty, in rent burdened and severe health problems.'",
        "'speaker_6': 'And this is why exactly why the Anaheim and Walnut Project is so critical to improving the health of the Cambodian home community and overall in Long Beach. This project as a well is important because it will bring comprehensive health and wellness services and affordable housing, much needed affordable housing to our community.'",
        "'speaker_6': 'The project is really a step in the right direction to reverse these historic inequities. And I applaud you all for considering this and working with staff, and we're excited to work together to make this happen.'",
        "'speaker_2': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'Good evening, Mayor. Vice Mayor to City Council on behalf of Cambodia town ing. I'm here tonight to support the Anaheim St and Walnut Project. We are very familiar with the project. We support the project because it will bring the benefits to the Cambodia town neighborhood.'",
        "'speaker_4': 'The Anaheim Walnut Project will bring comprehensive health and wellness services to our community, as well as affordable housing in our community. Seven out of ten residents living within one mile radius of the new center are low income. Three in five residents have a high rent burden, spending more than 30% of their income on housing.'",
        "'speaker_4': 'Only one in five of our area's low income residents use or have access to a community health center. Cambodia town ing is looking forward to working with taxi and bridge housing to bring this project to fruition. Last but not least, we would like to thank Mayor, Vice Mayor, the City Council and staff for moving forward on Anaheim'",
        "'speaker_4': 'and Walnut Project. Thank you.'",
        "'speaker_2': 'Thank you so much. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Marty Kochen. I am the executive director of Pacific Asian Counseling Services. We provide many needed mental health services for the severely mentally ill. And we have been working with the children's clinic for many years, providing integrated care, both behavioral and medical.'",
        "'speaker_4': 'We look forward to this project because it will bring to the community a much needed coalition where we can provide both medical and behavioral health services in one area, in one building. That's very important. We have a fantastic mental health program for Cambodians, which the children's clinic has been part of.'",
        "'speaker_4': 'The other thing is I want to commend Dr. Elisa Nicholas for her vision, because in this center, we are going to have many services, such as a community kitchen, which will provide another set of services for the community that are not now available.'",
        "'speaker_4': 'So I hope that all of you will support this and bring this to fruition as soon as possible. Thank you.'",
        "'speaker_2': 'Thank you so much. Next, Speaker Lee. Next up is call asleep.'",
        "'speaker_6': 'I'm afraid callers didn't want to speak.'",
        "'speaker_2': 'Okay, I'm taking off. Mr. Fox, thank you.'",
        "'speaker_6': 'I appreciate that, Robert. Actually, I'm here to speak on the streamlining of city council. The reason I came tonight. And I applaud the idea of making this.'",
        "'speaker_2': 'Mr. Fox, you have to speak on the hearing. You have to. Yeah. You have to speak on this.'",
        "'speaker_6': 'On 1500. Yes. Okay. Then I don't have anything to say about it because actually it's okay. Thank you.'",
        "'speaker_2': 'Thank you. Next five speakers in this order are Roth from Rocio Torres, Mary Simmons and Jeff Williams.'",
        "'speaker_4': 'Who I co-wrote Hanging Out The Philosophy of World War II. Get Me My Beat, Lay Low. And I haven't got a. And that flow on my mind will not only lead to more than sums up on my 1990 album.'",
        "'speaker_4': 'Sometimes, like they control the Rome plan, they lowered the hymen. While not the negativity online that put young men way to my bottom scarred up my arms up from late and I'm hardly how they got line meaning act of no pipe real multi-pronged on and not a pulling pants no one else's I wouldn't think Paul Young the'",
        "'speaker_4': 'army I'm in a more tight how it'll come when a lot of times they're not yet they're young. Young at the time. Rock group man one thing gonna young men to me had but to me some look you're like Rome won't cast your hand And Coulson cut them off midnight mama carrying our candy man some so on'",
        "'speaker_4': '. Thank you.'",
        "'speaker_1': 'Hello, Mr. May.'",
        "'speaker_6': 'Robert Garcia and all the.'",
        "'speaker_1': 'City council members. My name is.'",
        "'speaker_6': 'Herbert from a residence in the district.'",
        "'speaker_1': 'And I have live about less than a mile from the lot. 1500 and a half and Walnut Alley in Long Beach for 38 years. Today, I would like to say that.'",
        "'speaker_6': 'I am happy to support the.'",
        "'speaker_1': 'Plan on the lot of Anaheim and Walnut.'",
        "'speaker_6': 'This is the place that all of us who have been.'",
        "'speaker_1': 'Elders and senior citizens, we have known this place for 48 years already. This is a place that will.'",
        "'speaker_7': 'Provide.'",
        "'speaker_6': 'Us interest to the Cambodia town and to the neighborhood in.'",
        "'speaker_1': 'The.'",
        "'speaker_6': 'AOC southern area.'",
        "'speaker_1': 'Also.'",
        "'speaker_6': 'We all have very low income and we need a place for our health that will be close to where we live, that we could be within walking distance to look for.'",
        "'speaker_1': 'Doctors whenever we have illness. Therefore, Mr. Mayor Garcia and.'",
        "'speaker_7': 'All the city.'",
        "'speaker_1': 'Council members please approve this and how best.'",
        "'speaker_6': 'To.'",
        "'speaker_7': 'Get this project.'",
        "'speaker_1': 'Going. Thank you so much.'",
        "'speaker_2': 'Thank you so much. Thank you. Thank you so much. And yes, thank you. Our next speaker is Miss Marcio Torres. Then Miss Mary Simmons and Jeff Williams.'",
        "'speaker_4': 'Good evening to city council and our honorable mayor. My name's Rocio Torres and I'm in favor of the Anaheim Walnut Project. I'm a board member of AOC seven and AOC seven is our neighborhood boundaries, which is Anaheim, Orange and Cherry and Seventh Street.'",
        "'speaker_4': 'We adopted Alamitos, and we support the Anaheim Walnut Project. This project would be a benefit to all our community by providing early interventions by the children's clinic to our students and families, early interventions in both physical and mental health, which would benefit all of our city.'",
        "'speaker_4': 'As a school counselor, I see the extreme need to help our students be happy, healthy, productive members of society in our city. The housing component of this project will provide housing in our community to create a stable learning environment for our children.'",
        "'speaker_4': 'We look forward to working with TCC and Bridging House Housing to bring this this project forward. Thank you to the City Council and staff for moving forward in that housing project. Thank you.'",
        "'speaker_2': 'You so much like speaker, please.'",
        "'speaker_11': 'Good evening, Mayor Garcia City Council. My name is Mary Simmons. I'm speaking on behalf of my neighborhood group, AOC seven, Anaheim, Orange, Cherry and Seventh. And I fully support this project coming forth. I'm super excited about it. I've literally lived like a few feet away, less than a block.'",
        "'speaker_11': 'So I'm excited. Like the community benefits that this will bring for for our neighborhood. It'll make it. This is like the missing link that will make our community healthy. So thank you very much. We appreciate your support. Thank you.'",
        "'speaker_2': 'Thank you so much, Ms.. Simmons. Our next group of speakers is Jeff Williams here. Then Ramon, I think I think he left. Maybe I don't see him. Mr. Ovia, Dr. Nicholas and Jenny. Greg, would you guys please come forward?'",
        "'speaker_2': 'Thank you. In that order, Mr. Williams, Mr. Ovadia and Dr. Nicholas and Jenny. Greg.'",
        "'speaker_12': 'Good evening, Mayor Garcia. Vice Mayor Andrews, I am Jeff Williams. We're actually the applicant.'",
        "'speaker_2': 'And sir, I'm going to I'm actually to give you, if you'd like, you're going to get a chance at the end of the comments. Yes. Okay.'",
        "'speaker_12': 'To make I'll keep it very brief.'",
        "'speaker_6': 'Okay.'",
        "'speaker_2': 'Guidance. My.'",
        "'speaker_1': 'I support the project, just like I support the development of all affordable housing in Long Beach, which we sorely lack. And this this comment is not not actually about this specific project itself, although it has some some items that I think are really important.'",
        "'speaker_1': 'One is retail is failing in California, in Long Beach and everywhere else with the advent of Internet sales. So the use of what would otherwise be a retail space for a clinic is is something that I commend. I wanted to talk a little bit about parking in this project than in all other projects.'",
        "'speaker_1': 'See if if. The City Council. If the planning department, then if developers would consider this proposal, I think it would it would be an improvement to our parking condition. We you know, we we all know that that we live in in parking impacted areas.'",
        "'speaker_1': 'Households now have used to have one car and two cars at the most. Now, many households have. Four or five cars and up and in in the creation of parking spaces. I've seen a lot of parking structures built in the city of Long Beach with less than adequate parking.'",
        "'speaker_2': 'Thank you, Mr. Evi. Next up is is Jenny Craig, after Jenny Craig, Jeff Miller, Sri Sri Roth, Lowa and Cynthia. And tonight, coffee.'",
        "'speaker_1': 'Oh.'",
        "'speaker_4': 'Hi. Thank you. Sorry, I forgot my paper. I apologize. Looking at my phone. I took a couple of notes. I went to the planning commission meeting and I addressed a couple of concerns. One is that the entity that's going to be running the clinic is called the Children's Clinic, but it actually hasn't been widely stated that this'",
        "'speaker_4': 'is going to be adult behavioral services primarily. So I think there's some confusion about what the project actually is. So I feel like the public outreach is maybe a little bit not as transparent as it could be. The variance on the planning code is not actually approved even today as we're talking about approving the project and it'",
        "'speaker_4': 'wasn't approved at the Planning Commission. So if that does significantly change, does that make this project no longer valid and it needs to go back through the Planning Commission project process because that's a question right now. The other thing is that the notice in the outreach, you heard from some self-appointed neighborhood association representatives who do strategically skip'",
        "'speaker_4': 'certain blocks in certain areas, and that has been addressed with development services. So there was no notice. The outreach to the community, there may have been two meetings, but they were held for room spaces that hold less than 40 people.'",
        "'speaker_4': 'And this is in an area where we've decided in the planning commission there are about 100,000 people within the three nearest council districts, but 1100 that should be impacted by the 350 square feet. So thank you, ma'am. Thank you.'",
        "'speaker_2': 'Mr.. Is Mr. Jeff Miller here? No, I. Sri Roth lower. Please come forward.'",
        "'speaker_4': 'Evening, Mr. Mayor and vice mayor and all the council members. My name is Robert Law and a resident of District nine. I'm here to voice my support for the project for this project, because this project will help to increase the access of affordable housing and health services to help children and elderly.'",
        "'speaker_4': 'So seven years ago, I was an immigrant child who just arrived in the United States and I had many health issue. If it wasn't because of the children clinics that help me to overcome my sickness, I wouldn't be able to walk to achieve my bachelor's degree and become the first generation graduated college student and be able to'",
        "'speaker_4': 'serve the community. I hope that this general plan amendment be approved in order to expand the services to help more children from diverse in next group so they can stay healthy and achieve their dreams. Thank you.'",
        "'speaker_2': 'Thank you so much. And, Mr. Sun, can we.'",
        "'speaker_1': 'You said it right the first time, Mayor? Yes. And I can't say 56th District resident. I got it right next to you. It's okay. I'm coming in here to support this project. I think it would be a great addition to the to the neighborhood.'",
        "'speaker_1': 'It's a it used to be the little Mexican carnival that they would have sporadically coming into the area. So the fact that now would be a opportunity to house people and be supportive, I always see the I look come my lady over there on the bus where I see you and the 45 very often across the street'",
        "'speaker_1': '. That being said, and appreciative of the chosen clinic and uh, uh, the bridge housing, uh, take an opportunity to invest in this community. Affordable housing units to this size are very much needed in the area. That being said, I'm just curious to see that scene that the city is investing $4 million into this project I'm seeing.'",
        "'speaker_1': 'I'm curious to see if there's any kind of mandate in regards to who gets to live in the project, because the last time a similar project like this was built on Atlantic and Willow, you know, it was filled up completely by County of Los Angeles, people who are on the housing roll for them.'",
        "'speaker_1': 'So just curious to see how it's filled. You know, if it's going to be a boon for the people in the neighborhood. It would be great if people in the neighborhood could actually live in the building. So outside of that, I'm supportive of it and I hope to see this proceed further.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you very much. That concludes public comment. I do have to invite Mr. Williams to come forward. We're going to put 5 minutes on the clock and Mr. Williams is the applicant representing the applicant. And please, I know you have some extended comments and so you're welcome to do so.'",
        "'speaker_2': 'I'm not sure if Dr. Nicholas is part of his presentation, but you're both welcome to please.'",
        "'speaker_12': 'Yes, Dr. Nicholas is. And I'll start start over again. Good evening, Mayor Garcia, Vice Mayor Andrews and the rest of the city council. I know the hours late. And so we will I think we're going to change plans a little bit.'",
        "'speaker_12': 'I think I'll skip most of my presentation in the interest of time. I think really my goal here is just to say that we're excited as bridge housing to be here. This is our first project in Long Beach.'",
        "'speaker_12': 'We've looked forward to this for some time. We've been working at this, as Christopher has indicated for a while on the design. We look forward to working with the city on this and on future opportunities. I am joined tonight by Dr. Lisa Nicholas, the CEO for the Children's Clinic, and I think she does want to say a'",
        "'speaker_12': 'few words. So I will try to be even briefer and also as well as Ernie Vasquez, the CEO of SBA Architects, our architect. I will give you just a brief history of bridge housing. We've been in existence about 35 years.'",
        "'speaker_12': 'Extensive experience. Our mission is building low income housing for families and seniors and special needs populations. This is right within our mission, and we're especially excited here at the synergy of working with the Children's Clinic to provide both housing and health care in the same location and really to improve people's lives and impact the local community.'",
        "'speaker_12': 'We're certainly available to answer any questions about the design. I think Christopher gave you the brief overview. I just wanted to reiterate that Bridges, Bridge Housing is committed to building this project, to completing all the many steps it takes through financing and so forth.'",
        "'speaker_12': 'We expect to have approximately 220 residents at this facility when it's complete, including 190 low, very low and extremely low income family residents, as well as 25 people who are formerly homeless. We expect to generate about 120, 250 construction jobs and 45 to 50 full time jobs.'",
        "'speaker_12': 'The majority of those, of course, will be at the children's clinic. And then we will have a handful of staff on property in terms of maintenance and management. We do have many steps to come, but this is a very important step.'",
        "'speaker_12': 'I'm excited to be here and would appreciate your support in it available to answer any questions. We will work through all those steps in concert with TCC in the city and we're just excited to to be in front of you.'",
        "'speaker_12': 'I'd like to introduce Dr. Lisa Nicholas of TCC, if I can bring her as part of the applicant application. Sure. To speak about TCC itself and their plans for the project.'",
        "'speaker_1': 'Do you want the slides? Okay.'",
        "'speaker_12': 'Can we put the presentation?'",
        "'speaker_2': 'Is it possible to give a presentation back up? Why don't you.'",
        "'speaker_6': 'Go ahead and begin? Yeah.'",
        "'speaker_4': 'Well. Well, I'm thrilled to be here. It's such an honor and very excited for this project to finally be coming to fruition. I want to thank all of you for all of your support and your staff. Sure. And I want to thank all the people that commented and support.'",
        "'speaker_4': 'And I truly love working in this community. And we are very committed to all all of our work. So we were founded 80 years ago. It's our going to be our 80th anniversary. So hopefully I'll be back for another little show here.'",
        "'speaker_4': 'We now have 13 clinics that are not mobile and one mobile clinic that serves the homeless. We serve 40,000 patients every year through 130,000 visits of all ages. And we have 400 employees at this current time, 333 full time equivalents.'",
        "'speaker_4': 'So and of many other opportunities coming.'",
        "'speaker_3': 'In the near future. So this health and wellness.'",
        "'speaker_4': 'Center, I think, you know, most of this we really want to improve the services of the community, create employment opportunities. We hire from the community and we serve this community and really want to decrease social isolation, build community.'",
        "'speaker_3': 'And have a facility that is open to the community, not just for health care services, but wellness.'",
        "'speaker_4': 'This is our bottom floor. The clinic is on one side and then.'",
        "'speaker_3': 'The wellness center is on the side, on either side.'",
        "'speaker_4': 'Of that patio area where we hope to have some activities there. We will be offering full scope, pediatrics, full scope, adult care, full scope women's health care, including prenatal family planning, integrated behavioral health, a pharmacy, acupuncture.'",
        "'speaker_3': 'We're hoping dentistry walk in immunizations and health.'",
        "'speaker_4': 'Enrollment programs in the wellness center. And this is really working with the community. We will try to provide the services that they want us to provide. But this is just some of our things that we have heard from the community that we will be doing.'",
        "'speaker_4': 'We will have a teaching kitchen, we will have a food pantry there. We will have enrollment into multiple programs and wellness.'",
        "'speaker_3': 'Services.'",
        "'speaker_4': 'Both intergenerational a lot with our 0 to 5 population. Arts and crafts that are reflective of the community that we serve and our partners as of now, our Pacific Asian Counseling Services Camera girls in action. But our space will be open to those programs within the community to work with us.'",
        "'speaker_4': 'And that's it. Thank you so much. Thank you.'",
        "'speaker_2': 'Thank you so much. That concludes the presentation and comments for the hearing. I'm going to go ahead and close as we go back to deliberations from the council. So let me start with Vice Mayor Andrus.'",
        "'speaker_10': 'Thank you, Mayor. First of all, I want to thank everyone who's participating in this project. I don't think anyone who's been here since I have would know the impact of that corner right there on Walnut and Anaheim. I mean, it's been such a blight area for such a long time.'",
        "'speaker_10': 'And finally, finally, we have someone who's willing to come on and take this enormous, you know, situation here. So I think what we're doing. To me, I think since if you look around the city and you see the homeless situation, at least we're just at least wood just tapping into it.'",
        "'speaker_10': 'We're not going to be able to act eliminated, but at least what's happening to the homeless situation. You talk about the clinic. We're talking about everything that should be done here in the city of Long Beach, especially when you talk about the individuals who live here can at least be a part of it.'",
        "'speaker_10': 'They can live in these this complex that we're going to build here. And also not only anyone, but work in it also and the individuals who need that help. Dr. Nichols, I just want to tell you and your staff.'",
        "'speaker_10': 'I can't really even start to tell you how much we appreciate this, because that has been a dream. And one of my legacies, I think, well, anything to know that we have a place now for our young kids to go, older individuals, our seniors, a place to live.'",
        "'speaker_10': 'And we know the income situation in my area is very, very low. So now we're going to build something where you will feel very proud of what they're putting in there, because, I mean, I never thought that this project at one time would ever come to fruition.'",
        "'speaker_10': 'But, I mean, there was a time when I really thought that this issue would be a, you know, such a monumental a task. But we're all here and we're almost at the finish line, you guys. So don't give up on this.'",
        "'speaker_10': 'Now, we're almost at the finish line. And I know one doctor came up here and gave a speech and that the housing the bridge housing and Nino and Mr. me that I want to just tell you how much I appreciate you and your staff and what you guys are planning on doing there.'",
        "'speaker_10': 'You know, in putting this together, the project will be a transforming the corner and that entire neighborhood. And when it's built, it will bring 88 new residents. And I think they went over everything now with you. But it also will bring homes to new medical clinics in and with Dr. Nichols and the children's clinic.'",
        "'speaker_10': 'And I ask my colleagues to join me in supporting this project, because it will be a. What about housing and for central Long Beach? And you like we said, even if you don't live in the sixth District, you can still be a part of this project, remember?'",
        "'speaker_10': 'We want Long Beach to be a part, you know, to live in it. We want Long Beach to work in it. But more than anything, we want to finish the project. That's the main thing. So thank you guys so much for being here.'",
        "'speaker_10': 'Yes.'",
        "'speaker_2': 'Thank you, Councilman Austin.'",
        "'speaker_1': 'Thanks. I'm proud to second this this motion, this this project is inspiring and well needed. And, you know, it just goes to show that, you know, when when there's a vision and and political will and things can get done.'",
        "'speaker_1': 'I'm mom. I'm for the public here. I don't I don't think people understand, you know, the how tough it is to get a housing project actually completed or get it even to this step, the the entitlement process, the planning process, all that goes into it.'",
        "'speaker_1': 'So I want to salute Councilmember Andrews. I want to salute the staff that worked on this. Obviously, the developers and the community groups that that that have come out and spoken in support. This is another feather in your cap, Councilmember.'",
        "'speaker_1': 'And I would just say congratulations and getting another one across the finish line. This is a touchdown.'",
        "'speaker_2': 'Thank you, Councilman Austin. Councilman Richardson.'",
        "'speaker_5': 'I want to echo those. Congratulations. This is a great project. I like everything about it. You know, I'm taking a look at this terrace. I would love to have this terrace in North Long Beach somewhere. I see the children's clinic and Dr. Nicholas, who we've had a relationship for many, many years because she has facilities in Hamilton'",
        "'speaker_5': 'Middle School and, you know, to see those wellness services that are being presented. I think that's certainly a feather in the cap. Vice Mayor Andrews is a great, great project. This is what the region needs to see, that we can develop quality, affordable housing that looks great and helps improve and stabilize and bring up a neighborhood.'",
        "'speaker_5': 'And it's amazing. And I would also just add, Mr. Koontz, I got to tell you, what you touch comes out great. So I see what you're doing. I see the work you're doing across the city. And we're really grateful to have you and your expertize in this fight for affordable housing.'",
        "'speaker_5': 'Thanks a lot.'",
        "'speaker_2': 'Thank you, Councilmember Supernova.'",
        "'speaker_9': 'Thank you very much. I'd also like to congratulate Vice Mayor Andrews, and I'd say this is more than a touchdown. This is like your reverse kickoff return during the 1960 junior Rose Bowl. But also, congratulations to the community and special congratulations to Dr. Nicholas.'",
        "'speaker_9': 'We've had a few conversations about this, and I think the public doesn't know the challenges that were in front of you. So congratulations are definitely in order. Thank you.'",
        "'speaker_2': 'Thank you. And Councilman Pierce.'",
        "'speaker_4': 'I just want to echo the same thing. It's great to to see a project like this get completed and get to this point with the council. I know that it takes a lot of funding, a lot of finance, a lot of pieces just to be able to dream up a project like this.'",
        "'speaker_4': 'But then to take the children's clinic, which has deep roots in Long Beach and the community, and put that into that building. I think it's historic for the city to see that we've made a lot of these investments and approved a lot of these projects over the last several years.'",
        "'speaker_4': 'And I hope that this is another model that possibly one day we could find something like this in the second. But just really congratulations, everybody. I know this was took a lot of hard work to get here and I know there's hard work ahead, but we're in this with you guys.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_2': 'And Vice Mayor Andrews.'",
        "'speaker_10': 'Yes, I'd just like to know, Doctor. Mr. Midnight, how far are we away from getting ground control shovels into the ground? Does anyone know?'",
        "'speaker_2': 'Yeah. And I think I think our staff are probably the good answer. From our perspective, we're about a year away, sir.'",
        "'speaker_9': 'So we expect to break.'",
        "'speaker_2': 'Ground during the tail end of 2020. All right. Okay. Thank you. My my comments just are just one is I want to thank the entire team on this project. I have been we've been pretty involved in monitoring this project and the progress and some of the challenges and setbacks that we've had, particularly on funding challenges that we'",
        "'speaker_2': 'had in the past. But the entire time you guys stuck through it and are really delivering a quality project, I think the children's clinic partnership is fantastic. I think that the community support, as you can see, is critical and you're doing exactly what we need.'",
        "'speaker_2': 'This community does need housing that is affordable and accessible, particularly to people that are vulnerable and that are struggling across our city. And so I just commend the entire team for for stepping up. I want to personally thank Mr. Medak, who's in the audience for working with with my team, and just keeping us in the loop about'",
        "'speaker_2': 'what's been going on with the project. And I also want to thank our staff for all their hard work as well. And so with that members, please go and cast your votes.'",
        "'speaker_0': 'Councilmember Richardson. Can. Motion carries.'"
    ],
    "Resolution to Vacate Alley and Sidewalk Right-of-Way in District 7.": [
        "'speaker_2': 'Thank you very much. Congratulations. We have and again, because we had the budget hearing, everything is just taking longer than it normally would. We have one more hearing tonight and that's hearing for or the third hearing on the agenda, and then we'll go into the regular agenda.'",
        "'speaker_2': 'So this is hearing item number four, which is an early vacancy. So, madam, please read the item.'",
        "'speaker_0': 'Report from Public Works recommendation to receive supporting documentation into the record, conclude the public hearing. Find that the area to be vacated is not needed for present or prospective public use and adopt resolution ordering the vacation of the north south alley west of Long Beach Boulevard between East Waldo Road and 35th Street, and a portion of sidewalk'",
        "'speaker_0': 'right of way along Locust Avenue, District seven.'",
        "'speaker_2': 'Thank you, Mr. Modica.'",
        "'speaker_6': 'That report would be given by Craig Beck, our public works director.'",
        "'speaker_2': 'It's members of the council. I think we did a really good job of describing what we're proposing in the recommended action. The staff have been working closely with laser fish to help them expand their footprint here in the city.'",
        "'speaker_2': 'They're looking to add more office space for their operations.'",
        "'speaker_6': 'They own two parcels where an alley cuts those parcels.'",
        "'speaker_2': 'And we're looking to vacate that alley to allow for the development.'",
        "'speaker_6': 'To move forward.'",
        "'speaker_2': 'That concludes my report and I'm available for questions. Thank you. I appreciate that. Let me since we're this is a hearing, let me go ahead and just continue. I want let me go out and do public comment first for the hearing.'",
        "'speaker_2': 'So for the Ali vacation. Carelessly, Robert Fox, Mr. Avaya and Jeff Miller, please come forward now. Mr. Miller. No. Okay. So concludes public comment. Let me go ahead and go back to Councilman Ringo.'",
        "'speaker_1': 'Thank you. I think this is a great project. It's opportunity for Lady Fish to complete its its expansion that it's doing to maintain their business leader fish. It's a great corporate partner here for Long Beach, and this is a great project that will help them expand.'",
        "'speaker_1': 'And I would appreciate the support of my colleagues.'",
        "'speaker_2': 'Thank you, Councilmember Austin. I'm just going to I want to just add that this is a fantastic project. This Ali vacation will allow us to expand and support the incredible work of Lazar Fish, which is an early tech company within the city of Long Beach that took a chance on Long Beach.'",
        "'speaker_2': 'And I always want to recognize that they went in, took a chance. Now they are growing by hundreds and hundreds of jobs on their campus and creating a model facility in Bixby Knolls as a gateway. They're clearing oil fields are replacing fences, they're doing landscaping, they're fixing alleys.'",
        "'speaker_2': 'And they're the exact example of the type of corporate partner you would want in your community. And so I want to thank Mr. Wacker and his entire team. They're really doing a great job and thank the councilmember for his incredible support.'",
        "'speaker_2': 'And this project would not be where it's at if it wasn't for his support as well. And with that, there's in motion any second. So let me please ask you to cast their votes.'",
        "'speaker_0': 'Councilmember Richardson. That's why Richardson motion carries.'",
        "'speaker_2': 'Thank you. We're moving on now to public comment and consent. I made you consent calendar first. Can I get a motion any second on the consent calendar, please? I have carelessly Robert fox carlos over here on the consent calendar.'"
    ],
    "Contract Increase and Extension for Security Guard Services with GSSi, Inc.": [
        "'speaker_2': 'Motion carries item 15 from the consent calendar.'",
        "'speaker_0': 'Please report from Financial Management Recommendation to Increase Munis Contract with G SSI Inc. For providing security guard services by 454,500 citywide.'",
        "'speaker_2': 'There is a motion and a second, Mr. Andrews.'",
        "'speaker_10': 'Yes. Yes, I would I would hope my colleagues would back me on this, because the fact is, I would like to move this back a week, because I don't think we had enough time to do an evening on this, because I'm looking at the price in here and the outside sources in which is being sent out to'",
        "'speaker_10': 'I would just like to get another week so I can do a little more venting on this if that's possible.'",
        "'speaker_2': 'So there's a so there's a motion to hold this over to the next meeting? Yes, please. Is your public comment on holding this over to the next meeting? I don't see any. So we will go ahead and take a vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Fire Department Recruitment Report and Diversity Recruitment and Partnerships Manager Position.": [
        "'speaker_2': 'Thank you so much. Thank you. Appreciate that. Well, thank you. That that concludes public comment. We're moving on to item 33. You know, I think. So you were you were signed up not to speak on general public comment, but I did call your name.'",
        "'speaker_2': 'You were signed up to speak on the on the item before, which was already adopted, which was often some sort of consent calendar. So I already passed the consent counter. Okay, great. So now we're going on to item 33.'",
        "'speaker_0': 'Communication from Council Member Richardson, Vice Mayor Andrew's Council member who ranga recommendation to receive and file the 2019 Long Beach Fire Department recruitment report and request city manager to identify resources to establish a full time sworn diversity recruitment and partnership manager position in the Fire Department.'",
        "'speaker_2': 'Councilor Richardson.'",
        "'speaker_5': 'Thank you, Mayor. So I think this is a pretty timely and a good conversation to have. We've been discussing diversity within our fire department for a number of years. I remember my first conversation with our new new chief.'",
        "'speaker_5': 'He told me this was going to be, you know, something really central to his agenda. And there's been a lot of work, you know, in the community as well. The recent graduates of the Economic Policy Impact Center, who I see are there and holding up signs.'",
        "'speaker_5': 'There's a little bit of work over the last few months and help publish a study on the very issue. And internally here within the city, our chief has done some pretty amazing work with our innovation team and taking on this issue of diversity as well.'",
        "'speaker_5': 'And and so so the goal tonight is to really hear about some of the efforts that are taking place to diversify our police, to power our fire department, and to sort of lift up. I noticed that that both reports, the economic policy impacts and a report in the chief's report both lift up the need to really have'",
        "'speaker_5': 'a full time person dedicated to focusing on diversifying and recruiting and really going deep into our community and recruiting. And so I wanted to lift that up. A city or a city our size, you know, with a, you know, a city where it's in a unique position where both our police chief fire chiefs are both Latino.'",
        "'speaker_5': 'And I remember hearing Chief Espino recount his early years in the field talking about the sense of ease the community felt when they received aid from responder who spoke the same language to them. I think these things are important.'",
        "'speaker_5': 'And so the idea tonight is we're going to hear presentation and I want and the motion here is going to recommend to the city manager to go ahead and explore how we can better support this effort by committing to a full time sworn diversity recruitment and partnerships manager within the department.'",
        "'speaker_5': 'And so let's go ahead at this point and get our presentation from Chief Espinal.'",
        "'speaker_8': 'Thank you, Councilman Richardson. Good evening, Mayor Garcia and members of the city council. This evening, I'll be providing a brief overview of the Long Beach Fire Department's 2019 recruitment report. In April of this year, we began a review of our recruiting and selection process that was completed in July.'",
        "'speaker_8': 'We partnered with the city manager's office and the Civil Service Department to analyze data from Long Beach Fire Department applicants, perform qualitative interviews with current firefighters, survey the previous three cohorts of fire recruits, and review best practice research from other cities.'",
        "'speaker_8': 'Here are the current demographics for the Long Beach Fire Department. These numbers are for sworn staff, only, of which there are 389 total because of its size. Small changes. Changes make a big difference. In the Long Beach Fire Department, for example, the addition of just five more females in the ranks would reflect a 30% increase in females'",
        "'speaker_8': '. Here are our five recruit applicants identified by race and ethnicity over the last four recruitment cycles. Long Beach Fire Department receives an average of 3263 applicants for each fire recruit recruitment cycle. However, from 2014 to 2019, Long Beach Fire Department's black applicants have been reduced by half from 15% down to 8%.'",
        "'speaker_8': 'Meanwhile, its Hispanic applicants have increased to a level similar to white applicants. The Long Beach Fire Department's applicant breakdown by gender is 5% female. This also reflects the state of the department as a whole, which is 5% female.'",
        "'speaker_8': 'Best practices. We looked into a lot of other fire departments across the country and found that we already employed a lot of their best practices. And here's an overview. The fire science program at Jordan High School, which we will be starting in fall of 2019, the Long Beach Fire Department will partner with the Long Beach Unified School'",
        "'speaker_8': 'District to start a fire science pathway at Jordan High School. Our application window time. The Civil Service Department's Fire Recruit application is open for two weeks, which gives people enough time to apply as opposed to some departments which are only open for a day.'",
        "'speaker_8': 'Standardized test. Instead of administering its own written exam, civil service and language for our department, use a standardized test. Our Test administration. Which is our physical built ability test. The Long Beach Fire Department administers its own physical ability test at no cost to the applicant.'",
        "'speaker_8': 'Standardized oral interviews. The two rounds of oral interviews measure different applicant qualities and are standardized. Community involvement stakeholders from the community are invited to participate in the first oral interview. Our team came up with research strategies that fall along the following five categories selection process.'",
        "'speaker_8': 'Recruitment. Staffing, recruitment programs. Communications and data processes. Our selection process has been developed from best practices. However, as in all processes, there is still room for bias. Sending all BFD staff that participate in the selection process through implicit bias training would give them the tools to identify and mitigate any potential biases.'",
        "'speaker_8': 'We got a head start on this and it's happening this recruitment cycle for all of our staff involved in the selection process. We also want to implement, monitor and evaluate pilot studies to make adjustments to our selection process.'",
        "'speaker_8': 'In pilot study number one, we would invite all of a band list to the patty currently in the selection process. The Long Beach Fire Department receives a band of applicants from the Department of Civil Service and reaches out to the air band for their resumes.'",
        "'speaker_8': 'This pilot study, which switch that step with the invitation to the party and analyze to understand the effect in diversity. Pilot Study two We would be adopting the city of LA's test or develop an independent written test. The Long Beach Fire Department does not currently currently have anyone assigned to work on strategic recruitment.'",
        "'speaker_8': 'This report strategies rely on having appropriate staff to develop, implement and monitor programs and policies for recruitment. We are proposing a diversity recruitment and partnerships manager classed as a fire captain. We're establishing a cadre of five rotating firefighters that represent the diversity of the Long Beach community as a crucial step in building a recruitment team.'",
        "'speaker_8': 'These firefighters would be funded by overtime and would help in targeted outreach events as directed by the recruitment staff mentioned above. The Support Services Bureau, Civil Service, personal personnel analysis analyst and recruitment staff will meet quarterly to refine the recruitment efforts.'",
        "'speaker_8': 'This will ensure cross departmental collaboration. Long Beach Fire Department will utilize Instagram, Facebook and the city's website to promote recruitment efforts. We will also update our website, so to best utilize it as a recruitment tool. This is already happening, so stay tuned for a new website coming soon.'",
        "'speaker_8': 'Long Beach Fire Department recruitment staff will use technology like Google Forms to manage applications for programs and to track every recruitment effort. The Long Beach Fire Department recruitment staff will also develop methods for increasing the reliable reliability of the selection process, which includes established establishing highly structured processes for all steps and conducting reliability checks.'",
        "'speaker_8': 'Long Beach Fire Department will develop an internal survey to understand the culture of the organization and how they will receive these programmatic changes. Long Beach Fire Department Recruitment. Recruitment staff will also develop a community survey that measures the community's perception of the fire department and how likely they are to see a fire department job is feasible.'",
        "'speaker_8': 'The Long Beach Fire Department will establish a comprehensive mentorship program. Recruitment staff will set up a short application for interested applicants to fill out and posted on the Long Beach Fire Department website. Overtime is not planned for this.'",
        "'speaker_8': 'Recruitment staff will partner with Long Beach City College to develop a one day event that begins with a panel of female firefighters in the morning asking them questions about how they became interested in the fire service and describing their path.'",
        "'speaker_8': 'This event will be open to all but target females. College athletes and veterans have been proven to have the necessary physical training and discipline to be successful. Firefighters targeting recruitment toward local college sports teams and recent veterans will help the Long Beach Fire Department reach a more diverse candidate pool while also recruiting highly qualified individuals.'",
        "'speaker_8': 'Recruitment staff will develop a recruitment engagement outline based on best practices found in the city's participation in the Government Alliance for Racial Equity, or Geer, as well as several other city wide engagement efforts such as economic developments. Everyone in strategy and development services.'",
        "'speaker_8': 'Climate Action and Adaption Plan. Long Beach Fire Department is working on strategies to fund the implementation and implementation of key recommendations, such as the Diversity Recruitment and Partnerships Manager with cost savings. This concludes our Long Beach Department recruitment report, and we would welcome any questions that you may have.'",
        "'speaker_2': 'Thank you. Thank you. Thank you very much. Mr.. Fire Chief. Mr.. I'm going to go back to the counselor.'",
        "'speaker_5': 'Just to wrap it up. So we saw, we all saw the EEO presentation and, and, you know, behind the rail, a number of us looked at the numbers and said, hey, you know, we can do better here. And I think this is this is great.'",
        "'speaker_5': 'Lift up two things here. The Jordan Highway Pathways Program. Congratulations. I've been tracking and following that. Really excited to see that program get off the ground this fall. And secondly, I thought your presentation was amazing and the fact that you tie in so many current efforts and how it aligns from our governance alliance, racial equity to our'",
        "'speaker_5': 'economic inclusion work, this this connects all of it. And so kudos to you. The last thing I'll say is one I want to recognize and thank the two letters of support, one from Long Beach firefighters, Local 372, who's been a big advocate for this work, as well as a Lumbee City college trustee, would walk Joe into who's'",
        "'speaker_5': 'involved in some of the Longview City College pathway stuff. So thank you so much. And those are my remarks.'",
        "'speaker_2': 'Thank you very much. Concern re oranga.'",
        "'speaker_1': 'Thank you, Mary. And I want to thank you, Chief, for putting down this report for me. This is like deja vu. As you may recall, I was the city's recruitment officer for 14 years, 15 years with the city of Long Beach and the civil service department, until I had an opportunity to work with this as a team'",
        "'speaker_1': 'where I had a crew of assigned firefighters to work with me to do the recruiting up and down the state, even in regards to going to fire science classes, our academies, jobs, job fairs, community colleges and universities, I think that that resulted many times.'",
        "'speaker_1': 'We used to have about 7000 applicants come to apply for jobs in the city of Long Beach, where we had maybe 40, maybe 60 positions. And with that many applicants, it made it very, very tough. And that's why we went into the banning of the of the list, which was something that created greater opportunities, obviously, for the'",
        "'speaker_1': 'city to pick from that from from the best the will you would have a larger list, you have more opportunities and I think we need to maintain that. I would venture to say that I think we have to stop you in that and just go by the rule of the list.'",
        "'speaker_1': 'If rule less meaning that if you take a test and you meet the cutoff, give the whole list to the fire department for you to look at, at the candidates that are there. And that would also provide greater opportunities to look at the people who are there.'",
        "'speaker_1': 'Go to go through the patty. I don't probably you don't have to said all of the patty but the ones that you think are the ones that based on the interview that you think would be more compatible to to do the job and deal with the rigors, I think would be very helpful.'",
        "'speaker_1': 'It creates more work, I understand, for you, for the department, because you would have to assign more people to do these extensive interviews because they do take days. I know that I was part of that once upon a time.'",
        "'speaker_1': 'So, I mean, we have to look at other ways now. We're in the 2000 when I was doing this, it was back in the eighties and nineties that 19 it seemed so long ago now, the 1980s and nineties.'",
        "'speaker_1': 'But, you know, with social media and Twitter and and. Facebook. You know what? It makes it easier now, of course, to reach out and make contact because a lot of people are into that. And so one of the surveys that I did back in the day was to survey the candidates and say, how did you learn about'",
        "'speaker_1': 'this job? And a lot of them a lot of them was word of mouth by relatives, friends, acquaintances, referrals. So I think that that needs to be looked at as well in terms of how you can expand on that.'",
        "'speaker_1': 'And certainly Facebook and Twitter provide another those kinds of social media platforms provides that opportunity. But there's nothing that says success, like pressing the flesh. Being there, going to community organizations, CBOs community based organizations, talking to them directly about firefighters and having the recruitment team reflect the community, which goes a long, long way.'",
        "'speaker_1': 'And I, I had a lot of positive contacts on that. They would see a female firefighter with me and just felt felt inspired to apply for the job as well. So you might make sure that you include females and people of color in your recruitment teams.'",
        "'speaker_1': 'And I'm also very pleased that you're going to look at assigning a person, a a uniformed personnel, to be the full time recruiter. That's that's great because it's it it makes a real good commitment that it registers the commitment that the fire department has to this effort.'",
        "'speaker_1': 'So I want to commend you on that. I also know that civil service has had a great commitment with that, too. And you also have to look at the test itself. The test itself has some negative aspects to it.'",
        "'speaker_1': 'People aren't always ready to take a test. Test anxiety is is high. I used to be an examiner myself back in the day. So I know how how impactful that can be. So I'm glad that you're reviewing that.'",
        "'speaker_1': 'Look at it in turn to analyze it and see what what what better examination instruments you can use to cut people out to get the people to to apply. So with that, I ran out of time, and that's about all I'm going to say for now.'",
        "'speaker_1': 'I might relying on a baton.'",
        "'speaker_2': 'Thank you. I thank you very much, Councilmember. Next up, right on time, Vice Mayor Andrews.'",
        "'speaker_1': 'Yeah, that's all right.'",
        "'speaker_10': 'Thank you, Ms.. Thank you, Mr. Super. Not for that legislative item. 5 minutes. And I'm going to real quickly go to this, because this is very serious, because last week various media outlets broke the story about the lack of diversity in our fire department.'",
        "'speaker_10': 'And similar to those stories was the commitment from our chief, who has increased diversity in the department. And I believe that we can, in the city, need to back up our chief to give him the tools that he needs to get the job done.'",
        "'speaker_10': 'So I am supporting this measure because diversity and opportunities are a key to what makes our city so special. And I ask my colleagues to join in with me. Thank you.'",
        "'speaker_2': 'Thank you very much, Vice Mayor Councilmember Pierce.'",
        "'speaker_4': 'And for those of you in the audience that don't see it, we have a timer on our end, too, to make sure we don't talk longer than 5 minutes. So that's why we were laughing, because I don't see it up on the screen.'",
        "'speaker_4': 'I just wanted to say I appreciate the efforts, the lens, and any day that we have department heads talking about implicit and explicit bias and trying to make sure that our departments look like our community is a win for me and and my constituents.'",
        "'speaker_4': 'And so I fully support this, whatever we can do to make this a model, to make sure that we're using this in other departments as well. I know Public Works is not as compensated as our fire PD, but I know it's another department that lacks a lot of diversity, particularly when it comes to gender.'",
        "'speaker_4': 'And so hopefully we can continue to work with EPIC and with our departments and our city manager to to make this a good model. Thank you.'",
        "'speaker_2': 'Thank you, Councilmember Councilwoman Price.'",
        "'speaker_3': 'So I want to thank the chief as well for all of his efforts. So before I was at my current job, I Orange County Fire Authority was one of my clients when I was at Woodruff. So I'm very familiar with their inner workings.'",
        "'speaker_3': 'And I and also the City of Orange Fire Department was one of my clients. And so diversity in the fire department is always a challenge. And so the efforts that we're doing here are amazing. And I applaud them and I think it's great.'",
        "'speaker_3': 'And this this item, the concept of this item is fantastic. Of course, we're going to have to figure out what the details of it come out to be after we get a report. But the question that in terms of fiscal impact but the question that I have is do we have a position similar to what Councilmember Randall'",
        "'speaker_3': '. I used to hold a recruitment officer for the city. Mr. City Manager Do we have anything like that now?'",
        "'speaker_2': 'Sir West.'",
        "'speaker_3': 'I mean.'",
        "'speaker_1': 'Mr. Stout That would be a question for the Civil Service Department, but I believe they do that. But they certainly do that. I'm not sure if they have a position strictly related to that, maybe. Mr. HONEYWOOD. No. The former or the current acting director.'",
        "'speaker_1': 'Good evening. We do have a deputy director of civil service who.'",
        "'speaker_2': 'Oversees our recruitment and selection division. So that's one person not.'",
        "'speaker_1': 'Dedicated to managing, just recruitment, but also oversees all the work that our test analysts do.'",
        "'speaker_3': 'Okay. And do any of our other departments have recruitment officers in the departments like this? Police. Do we know yet? Police.'",
        "'speaker_2': 'The police department does have.'",
        "'speaker_1': 'One at least one dedicated staff working on recruitment issues. Yes.'",
        "'speaker_3': 'Okay, great. Any other department in the city?'",
        "'speaker_1': 'Each department has an administrative officer and that person is responsible for working with H.R. and also civil service to do this job. Yes.'",
        "'speaker_3': 'But fire doesn't have that.'",
        "'speaker_1': 'Fire has administered. OFFICER But not a not what? The Chief is asking for tonight.'",
        "'speaker_3': 'I see. Got it. Okay. Thank you. Well, I hope that when if the when the report comes back to council, we could include a little bit of kind of historical nature of what we've done for recruitment and some maybe some models of what others are doing and maybe even some other departments.'",
        "'speaker_3': 'Because I imagine, you know, we want to have diversity in the city and in all aspects of the city. This is probably an issue that's not unique to the Long Beach Fire Department when it comes to work as a firefighter.'",
        "'speaker_3': 'But I think that if we have a sense of what is going on throughout the city, we can determine whether there is a central approach that's better or a specific approach within the fire department.'",
        "'speaker_1': 'I think we just recently submitted a report to the city council about three or four months ago, and pretty much all the departments were looking good. The fire department was an outlier, though, and that's why it's here tonight.'",
        "'speaker_3': 'Well, it was an outlier compared to other city departments. But do we know if it's an outlier compared to other fire departments in the state?'",
        "'speaker_1': 'Chief.'",
        "'speaker_8': 'In regards to other fire departments in the state, we're actually doing very well with our percentages. And the difference between that report that the city manager's referencing and our report is that our report only looks at sworn firefighters and not all admin and civilian staff, all of that.'",
        "'speaker_3': 'Okay. All right. Thank you for that information. I look forward to getting the information back. Thank you, Chief.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilmember Soprano.'",
        "'speaker_9': 'Thank you. Happy to support this item tonight. And and also will be happy to support the efforts through our council offices, social media, whatever. But many have touched on it here. I just would like to commend Chief Espino on your work today.'",
        "'speaker_9': 'Great job.'",
        "'speaker_8': 'Thank you. And if I may, I'm just going to take this opportunity. Thank you all for your support. And it's I know right now it's directed at me, but I really do need to recognize Stephanie Zavala, who just stepped away from the dais.'",
        "'speaker_8': 'But for three months, she put her heart and soul into this and really brought this all together for us. So I'd be remiss if I didn't recognize her in front of everyone today. Thank you.'",
        "'speaker_10': 'Yeah. Don't.'",
        "'speaker_5': 'Thank you. Thank you, Vice Mayor. So the conversation, the questions actually prompted me to look at my recommendation and see if I need to make it a little more specific. So, Mr. Chief, in your efforts, do you currently have have you identified currently funding to move forward with this position?'",
        "'speaker_8': 'We have not identified any funding at this point where we're looking through our budget, but we haven't identified anything yet.'",
        "'speaker_5': 'I think the hope here was that we could, you know, help the chief identify those funding, that funding, and then come back with a report later next year about how to make it sustainable. So if I need to amend this to include also recommended to the Budget Oversight Committee, I'd love before we finish this budget to take'",
        "'speaker_5': 'a look at, you know, what we can do to help support to support the chief here. So I want to I just want to amend this. I'm directing, requesting the city manager help identify resources as well as the Budget Oversight Committee.'",
        "'speaker_5': 'I would like for both to look at what we can do to help move this along in this fiscal year so that we can have a conversation, a more fruitful conversation next summer, next August 2020 about sustainability of it.'",
        "'speaker_5': 'So that's what I'd like to recommend.'",
        "'speaker_2': 'Thank you. Councilman Ringo.'",
        "'speaker_1': 'I had to rely up. Ran out of time last time. But I do want to acknowledge the comments that Councilmember Price mentioned in terms of other recruitment efforts. I words at that time the general recruiting officer for a city law meeting and that was all employment but the specialty was public safety, police and fire.'",
        "'speaker_1': 'But I think that one of the things, if we want to look at the possibility of a year round recruiting program, we need to look at how we're going to fund it for one and two. Where is it going to be housed?'",
        "'speaker_1': 'Where it was housed before in civil service was one part of it. We're now in 2020, coming up in 2020, and we need to look at things a little differently. I think that we need to look at it in terms of diversity as a as a whole for the city.'",
        "'speaker_1': 'And I think that every department has a commitment to it. So I would look at maybe having a conversation with our financial office with John over here with regards to growth do in regards to how we can provide a sustainability model for our recruiting division, if you will, or or recruitment officer or whatever that would be sustained'",
        "'speaker_1': 'by all departments because all departments have recruiting needs. We need to, although the city as a whole is, as the city manager stated, that we have a lot of departments are looking good. They're looking good in some areas and not so good in others.'",
        "'speaker_1': 'And I think that we still need to look at diversity as an overall goal for the city and perhaps looking at how we recruit our employees and where we get them from and and what efforts we put out there makes a big difference in terms of where we find people and how we get hired here.'",
        "'speaker_1': 'We're always looking for the best. We want to say that we hire the best, but if we don't make an effort to find the best, we're not going to get them. And I've always said in the past, if we don't get them through the front door, we're not going to we're not going to get them out through'",
        "'speaker_1': 'the back. So that's that's get them through the front door by providing front door meeting, testing, interviewing and getting them to get him on the list or whatever. And in, in, in hiring them and then promoting them and the back door being retirement.'",
        "'speaker_1': 'Okay. Hey, you get the analogy. Didn't work too well, but for whatever it's worth, I think that this is a city we should make this a city commitment to towards diversity. And nothing speaks volumes about that commitment we have there, making a city commitment to diversify our city by having focused and a general recruitment effort that attracts'",
        "'speaker_1': 'all our employees here we had before and we've done the city has gone phenomenally. When I first started, I had three police sergeant, three Latino police sergeant. Now we have a Latino police chief. And because of the efforts that we did, we had very few police captains and battalion chief of the fire department.'",
        "'speaker_1': 'Now we have a Latino police chief because of those efforts that we did before that came in through a targeted recruitment effort. So we want to really put our money where our mouth is. Let's put our money where our mouth is.'",
        "'speaker_1': 'Let's put money into a recruitment division or a recruitment effort that is going to diversify the city. So I'm hoping that in future discussions, we could emphasize that a little more. And like I say, we could find the funding mechanisms to do that.'",
        "'speaker_1': 'Sure percentage of funds that could go from every department into a employment, if you will, employment. Basket bowl, whatever you want to call it, pot. There you go. Not that kind of pot. Pot. In terms of money, pot to waste to do this efforts.'",
        "'speaker_1': 'Hey, man, you know, if you can't have fun here, why not? And so anyway, let's let's look at that. I think that's that it's an opening conversation that I think we we should continue. And I know we're going to be looking at getting a new city manager.'",
        "'speaker_1': 'Perhaps that will be something that that we could discuss as well with with a new city manager. No aspirations to the current one, of course, because, you know, you've been here a long time and and thank you for your service.'",
        "'speaker_1': 'And we also need to look at moving towards a future. Thank you.'",
        "'speaker_2': 'Thank you very much. And now we will move on to public comment. We have five members of the public and I can say Adrian Sias, Stephen Contreras, Brooklyn Wilson and Devin Abad. Please come forward in that order tonight.'",
        "'speaker_2': 'Ken Fay, Adrian Sias, Steven Contreras, Brooklyn Wilson and Devin Ballard. Please begin.'",
        "'speaker_1': 'She's in here. So I just want to make sure, you know, I don't want to join real quick. I don't want to be part of the Scooby Doo and the gang over there. But, you know, there is no speak there's no sound system outside that's stipulates that you're calling, you know, speakers to come to the role.'",
        "'speaker_1': 'You know, in the previous city hall and our old one, seismic one, they had that system, you know, and you have a bathroom that's over 400 feet away. So you have to run to the bathroom, go back through police check to come back in.'",
        "'speaker_1': 'So if we could figure it out, I know we just started in here. We can figure that out. It was a good request. Thank you. Thank you. That being said, I want to first say I appreciate the and commend the efforts of our fire chief.'",
        "'speaker_1': 'This is a very progressive moment in time where we have a city department admitting that there are flaws in the system and they want to do better. It was amazing to see a slide admitting that there is implicit bias in relation to any hiring, especially here in the public sector.'",
        "'speaker_1': 'That being said. I saw that the African American presence has gone from 8.5 to about three and a half. I would assume that's because we're in the the age of the baby boomer, the great baby boomer retirement. That's literally, you know, everyone who was hired probably in the seventies and eighties due to targeted hiring and court mandated'",
        "'speaker_1': ', you know, an unfunded mandate, you know, whatever wants to be called, you know, those those opportunities that occurred in the seventies and eighties. You know, now we have the, you know, the gradual decline that comes with people retiring.'",
        "'speaker_1': 'So we need to figure out a way to not only offset that, but also increase it more to be more reflective of the diversity that we live in. A suggestion that would come to mind for me would maybe be reaching out to the L.A. chapter of the Stentorian, which is a group that advocates for black firefighters across'",
        "'speaker_1': 'the nation. There's a sizable chapter in L.A., and I'm sure they would love to have a conversation with you, fire chief, if you could reach out to them. Also, you know, I grew up next to a fire station and on 23rd and Long Boulevard, I think that's I don't know what number that is, but it's ten.'",
        "'speaker_1': 'Yeah. And, you know, the only fire, the only person that look like me that I ever seen in the jump and the get up. And he came to my school when I was a kid was Mr. Wayne Chaney.'",
        "'speaker_1': 'So, you know, I know I don't know how many years he's got left, but it'll be great to see for the next generation of children that look like me and go to the public school system. You know, we can replace three more of him.'",
        "'speaker_1': 'That being said, thank you, fire chief, for your efforts and I appreciate to see where we go forward from this. Thank you.'",
        "'speaker_2': 'Thank you very much. Next speaker.'",
        "'speaker_4': 'Good evening. Oh. Can you hear me? Can you hear me? Okay. There we go. Now hear myself. Good evening, Mayor Garcia and members of the City Council. My name is Adrian Sears, and I'm a.'",
        "'speaker_3': 'Proud resident of the great city of Long Beach. Tonight, I am here on behalf of the inaugural class of Epic.'",
        "'speaker_4': 'Leaders, the class of 2019, in support of Councilman Rex Richardson's recommendation to hire a full time sworn.'",
        "'speaker_3': 'Diversity recruitment and partnerships manager.'",
        "'speaker_4': 'For the Long Beach Fire Department. Long Beach is the seventh largest city in the state of California and is ranked among or is ranked number ten among the most.'",
        "'speaker_3': 'Diverse cities in the country. As such, we need our first.'",
        "'speaker_4': 'Responding agencies to reflect that diversity. As you well know, the Long Beach Fire.'",
        "'speaker_3': 'Department is not.'",
        "'speaker_4': 'Alone in its struggle to.'",
        "'speaker_3': 'Increase diversity in its workforce. Over the past 20 years, I have worked with first responders throughout Los Angeles County, and they all grapple with the best ways to diversify their workforce. But progress is being made. For example, I worked with the City of Los Angeles Fire Department to create the Crenshaw.'",
        "'speaker_4': 'High School Fire Academy. The Academy's goal was to create an interest in a career in fire service among students of color. We actively recruited males and females and spent the next three months mentoring.'",
        "'speaker_3': 'And training them inside and outside of the classroom. Every Saturday, we transported.'",
        "'speaker_4': 'Busloads of students from Crenshaw High School to the L.A. City Fire Training Academy in Elision Park. They participated in physical training to prepare them for the physical demands of the department. They also participated in classroom learning and hands on.'",
        "'speaker_3': 'Exercises to gain knowledge and the manipulation of tools and equipment. At the end of that three months, each participant proudly received a certificate of completion at graduation in the presence of their family and friends. These kinds of recruitment strategies are only successful when the positions are fully funded by the department and the city, which it serves.'",
        "'speaker_3': 'We have we have to make a sustained investment in diversity and inclusion.'",
        "'speaker_4': 'Chief. Congratulations on the best practices that are already being employed by the Long Beach Fire Department. We appreciate your efforts. To that end, again, we strongly support Councilman Rex Richardson's recommendation to hire a full time sworn.'",
        "'speaker_3': 'Diversity recruitment and partnerships manager. As Jesse Jackson wisely stated. Inclusion is not a matter of political correctness. It is the key to growth. Thank you.'",
        "'speaker_2': 'Thank you so much. Next speaker, please.'",
        "'speaker_6': 'Good evening. Good evening, mayor, vice mayor and council. My name is Steven Contreras and I'm with the Epic Leaders Institute, and this is our culminating project. I would like to ask for your vote. Yes. In support of the recommendation for full time diversity, recruitment and partnership manager, someone who is as someone who has been through the hiring'",
        "'speaker_6': 'process with public safety. I know what it is like to be a minority and not have anyone around you who looks like you during the process. This would add to the diversity, inclusiveness of the fire department. Thank you, Chief, for all of your work and thank you for your time, Mayor and Council.'",
        "'speaker_2': 'Thank you so much. Next speaker, Brooklyn Wilson.'",
        "'speaker_4': 'Good evening. Good evening, Mayor Garcia, all the council members and everyone in this room. My name is Brooklyn. Brooklyn Wilson. I'm 13 years old. I'm a student at Hughes Middle School. I'm an avid reader. And some of my favorite subjects are science and health.'",
        "'speaker_4': 'I'd like to share a quick personal story of myself. When I was around ten or 11, I had a major surgery, and about a month after that surgery, I was in an accident. A car accident was my mother.'",
        "'speaker_4': 'And because of that major surgery, my mother wanted to make sure I was okay. So she called the ambulance. And when the fire department came and made sure that everything was all right that day, I realized that I meant that I met real life heroes.'",
        "'speaker_4': 'And I thought, how cool would it be for me to work in that profession? But the reality.'",
        "'speaker_3': 'Is, I've never seen anyone that looks like.'",
        "'speaker_4': 'Me fighting, working as a firefighter or a paramedic in our community, as a young woman and the as a young woman of color living here in Long Beach, I can speak on behalf of youth like me and say that we need access to programs that show us how to succeed in pursuing careers with the Long Beach Fire'",
        "'speaker_4': 'Department. And we need to see that it can be done through examples that we see working in the fire department today. Thank you.'",
        "'speaker_2': 'Q In the last speaker of bar.'",
        "'speaker_1': 'Hello. My name is Devon Abla. I'm also representing the Economic Policy and Impact Center as one of their inaugural graduates from their leadership class. So obviously, I am here today to ask you to vote yes on this item.'",
        "'speaker_1': 'But first, I just wanted to say there's a lot of different opinions on a lot of different subjects coming from this dais. And the one thing I notice, I worked for city council for two and a half years, and as a resident of Long Beach, there's a real commitment to diversity on this council.'",
        "'speaker_1': 'And I want to thank all of you for that commitment, because our diversity is really our strength. But I really want to talk today because in Epic, we all sort of split up into different groups to tackle different issues going on in the city, from automation at the port to diversity in the fire department to the wage'",
        "'speaker_1': 'gap. Now, I know that the wage gap was said, well, all right, so the fire department, a couple other places maybe, but for the most part, everything is fine. And you know, I applaud the city because women who are doing the same job as men are roughly getting paid the same amount, but they're not getting all of'",
        "'speaker_1': 'the same jobs. And so as we vote yes on this fantastic item that I really do appreciate, because it's so important. I want us to look forward and to see how it's successful, how it is not successful, and how we can carry it on into other departments.'",
        "'speaker_1': 'We need more women as engineers. We need more women as bureau managers. We need more women as department heads. And I think that there's a lot of ways we can accomplish this. And I think that this program or this position right here is going to be a great way for us to measure the effectiveness of some of'",
        "'speaker_1': 'those programs, whether it's going into our high schools, going into our communities, our universities, and making sure that we are letting people know that, you know what, you do have opportunity here in the city of Long Beach. You do have the ability to run a department.'",
        "'speaker_1': 'You do have the ability to be a traffic engineer. You don't have to look a certain way to achieve a certain thing. And I also want to say that this isn't just about women. Obviously, ethnicity is a big deal.'",
        "'speaker_1': 'And I also want to throw out to our LGBTQ community. I want to make sure that as we're doing this, we're looking at them as well and making sure that they can get into high paying careers as well.'",
        "'speaker_1': 'Thank you for your time.'",
        "'speaker_2': 'Thank you very much. That concludes public comment. Councilman Mongo.'",
        "'speaker_3': 'Thank you. I'm sorry I wasn't able to be at the dais during the first part of this. Many of you know I'm a pumping mom, but I did want to make a few comments. I appreciate that we're moving forward on our diversity and inclusion.'",
        "'speaker_3': 'And I think that it's also important to recognize that a lot of great strides have been made by other agencies across the country and even in the region. I know Chief Osby has made a commitment to diversity at the L.A. County level.'",
        "'speaker_3': 'We have a women's academy, pre academy that we run that has helped with both recruitment and retention. We've changed the way that we advertise for our vacancies. When we are doing a recruit academy, we advertise in movie theaters and other places throughout the region and pick those locations by the diversity groups that we're looking to target.'",
        "'speaker_3': 'And and we also do a annual conference where we invite women, firefighters from all over the region to attend and discuss and be a part of the solution of a regional effort. And I would expect that in the future that Long Beach Fire Department will make a commitment to participating in that conference.'",
        "'speaker_3': 'It's an annual conference. It's called Arise, and it's been well-received by the participants. The reviews have been remarkable and inspiring. And so I hope that we can get on to the the the global effort regionally. And finally in closing, I will I'll take another quote from our chief.'",
        "'speaker_3': 'Some of the tests that we do to become, whether it's police or firefighters, are that of history. There's a lot of history behind those tests, but not a lot of data to support that. That kind of test proves the type of capabilities that are necessary to actually execute the job.'",
        "'speaker_3': 'He knew a lot of fire terminology in his speech at the time that I'm not as familiar with, but I'll make the analogy for the sheriff's department as I am more familiar. L.A. County Sheriff's Department used to mandate that you used a particular kind of revolver in your shooting test, but once you became a deputy, you would'",
        "'speaker_3': 'not be required to use that same firearm. And so that firearm, because of the width of its base and because of the the pounds of pressure necessary to pull the trigger, had an extremely high failure rate among people of a certain hand size and smaller.'",
        "'speaker_3': 'Typically, women and people of certain ethnicities had smaller hands than other individuals, and so they had a significant disadvantage in the process. Once they opened up the door to using other equipment which you're allowed to use on the job, the graduation rates skyrocketed and the failure in that particular category of the academy dropped.'",
        "'speaker_3': 'And so similarly, the chief had mentioned that you have to throw a particular apparatus in the L.A. County Fire Training Academy, but never on the job do you have to to throw that apparatus anymore because of newer systems and technology and different materials that those apparatus are made of.'",
        "'speaker_3': 'And so I would ask us to also look at any barriers in the process that are causing those challenges and to ensure, through subject matter experts, that the tests that we are utilizing are most aligned with the success of an individual being on the job, successfully executing the responsibilities and not being injured during the life of their'",
        "'speaker_3': 'career because safety, once they're on the job, is also of the utmost. Importance. So thank you for that. And I also think that there are a lot of challenges that go along with nursing moms that are firefighters. It's nearly impossible to be a first responder and be a pumping mom.'",
        "'speaker_3': 'It it's nearly impossible the way that calls are both on both sides of public safety. So I don't know what opportunities we have to be more inclusive of that side of it as well. But I'm always open to suggestions and support.'",
        "'speaker_3': 'Congratulations on the great work you've done, and thank you for accommodating my my comments at the end of this.'",
        "'speaker_2': 'Thank you very much. There's a motion and a second. Please cast your votes.'",
        "'speaker_1': 'That.'",
        "'speaker_2': 'Yeah, we are.'",
        "'speaker_3': 'We are frozen.'",
        "'speaker_2': 'It is. There's air pumps underneath these.'",
        "'speaker_0': 'Motion cars that.'",
        "'speaker_2': 'Are just pumping very cold air. Thank you very much. That passes. And then moving on to item 35.'"
    ],
    "Sale and Development of City-owned Property at 925-945 East Pacific Coast Highway.": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. Next item 36.'",
        "'speaker_0': 'Report from Economic Development Recommendation to adopt specifications for the Purchase and Development Opportunity at 9252945 East Pacific.'",
        "'speaker_4': 'Coast Highway.'",
        "'speaker_0': 'Declare the city owned as surplus. And authorize city manager to execute all documents necessary with Mercy Housing California for the sale of the subject property in the amount of 750,000 District six.'",
        "'speaker_2': 'Thank you. And we have a short presentation for this.'",
        "'speaker_1': 'Yes, John Geisler and Sergio Romero. Perfect. Good evening, honorable mayor. Council members. This is the disposition of a very important property in Cedar Six that has been vacant for a long time. It's the corner, MLK and PCH, a property at 925 East PCH, a former RTA property.'",
        "'speaker_1': 'By way of background, back in 2016, the city issued an RFP and selected wood investments for the development of this property. Unfortunately, during the due diligence process, wood investments was not able to secure financing and was not able to move forward the development of the property.'",
        "'speaker_1': 'Back in 2018, staff issued a new RFP and through a multidisciplinary panel that was comprised of outside consultants and city staff, selected Mercy Housing, an affordable housing developer with a long track record of successful, quality, affordable housing products throughout Southern California.'",
        "'speaker_1': 'Mercy has proposed a project that would include incorporating the city on site with an adjacent property for the development of the frontage of almost an entire city block about 30,000, a little over 30,000 square feet. The project would bring forth about 68,068 new senior housing units with the segment for seniors who have previously experienced homelessness.'",
        "'speaker_1': 'The project would actually feature a community room, community outreach resource center and of course, recreation and courtyard open space. Through the process, about 140 construction jobs would be created for the development of the project, and about five permanent jobs would be created through the affordable housing project.'",
        "'speaker_1': 'The terms of the sale. This is the first. This tonight's actions will be the first step of the development this property and will be kicked off by the sale, the property and or the exploration of the due diligence by the developer for the acquisition of the property.'",
        "'speaker_1': 'Better state that the property would be sold at $750,000. The developer would conduct a due diligence for about 90 days and would have 21 months to secure financing process entitlements through the Development Services Department. So the rendering that you previously saw, that was only a concept they would be working with Christopher Kuntz, this group, to process the'",
        "'speaker_1': 'design and do community outreach to make sure that the community had an opportunity to have input on the project and features. And with that, staff recommends approval of the sale of the 925 Eastern Pacific Coast Highway and is happy to answer any questions.'",
        "'speaker_2': 'Thank you very much for going to public comment. I have two members of the public eye so I can ferry and Jasmine Tong, please come forward. Please go ahead.'",
        "'speaker_1': 'Okay. Thank you, Mayor. City Council Vice Mayor. I want to say that I'm in complete support of this affordable housing project coming into the neighborhood here. And Africa town, I mean, central Long Beach. You know, I think this is a very appropriate, uh, you know, development in the area.'",
        "'speaker_1': 'This is formerly been, uh, it was formerly a liquor store that was a nuisance in the area. And I was glad when they fled it out and I knew something great was coming. And I just want to say my appreciation to the wise counsel of the sixth District, city councilman and vice mayor, for bringing these kind of'",
        "'speaker_1': 'occasions and opportunities to the neighborhood. That being said, I'm curious to see if maybe. Excuse me. Excuse me. You got me. Yes. Okay. I was curious to see if this will also be an opportunity for the, the Long Beach, uh, investment, whatever that program is that gave $4 million to the project on.'",
        "'speaker_1': 'And I'm in Walnut. You know, maybe we could shorten that at 21 months of escrow and get it, get it down to 16 or 14 with the good graces and opportunities provided by our economic development department. You know, I don't know if that's Mr. Keisler or, uh, uh, Mr. Coons, but, you know, we would love to have'",
        "'speaker_1': 'that. We'd love to have a clinic in that neighborhood. My family has a property on 16th and okay, so I'm right down the street and it would just be so opportune to see this empty lot be turned into something, uh, providing affordable housing for the neighborhood.'",
        "'speaker_1': 'So I would love to see this happen. Thank you.'",
        "'speaker_2': 'Thanks so much, Mr..'",
        "'speaker_4': 'Thank you. Thank you. My name is Yasmin Tong, and I'm here representing Mercy Housing, California. We're a nonprofit, affordable housing developer with more than 10,000 affordable homes nationwide that we've developed, own and manage. We're delighted for this opportunity to acquire this property from the city.'",
        "'speaker_4': 'This will be our second development in the city of Long Beach. It will target seniors, 68 seniors, senior households, as well as formerly homeless seniors. And really, we just want to say thank you very much for the opportunity.'",
        "'speaker_2': 'Thank you very much, Vice Mayor Rangers.'",
        "'speaker_10': 'Thank you. Thank you. Thank you. Okay. Thank you. You know, I keep telling my. Constituents in the sixth District. You got to be around long enough if you want to see good things happen, because patience is a virtue.'",
        "'speaker_10': 'You know, you can't get it all done in eight, nine, ten, 11 years. It takes you little time. That's why I'm sticking around you guys to make sure that these projects come to fruition. So on that corner, if you don't know Long Beach and haven't been in the time that I've been here, that's the corner that you'",
        "'speaker_10': 'always said. No. That is the part where you will understand that when this project goes up, you will be able to see it from downtown on the fourth floor, the third floor. Because that's going to be one of the tallest buildings we have in the sixth District.'",
        "'speaker_10': 'And again, I want to let you individuals know that is a key and a section in my community. And it's been a subject of a lot of interest in over the last several years. No, not several, but seven.'",
        "'speaker_10': 'Last year, the council directed staff to put this workshop up and I couldn't be happier with the results. They established elected mercy housing to be a recipient of this purchase of our development opportunities. Remember, they said they've only done two and I am so happy that you took the second in my district.'",
        "'speaker_10': 'You guys can do two more because I'm going to make sure that our seniors get a place to live and our seniors are going to be excited about everything we do. Everything this blindness excuse me, will be filled up.'",
        "'speaker_10': 'I guarantee you that. Just stick around and watch us do our work. Thank you guys again. And I'm hoping my colleagues will sign on with this group also.'",
        "'speaker_2': 'Thank you. Thank you. Vice Mayor Councilman Austin.'",
        "'speaker_1': 'Yes, I'm Allison, and I support that message.'",
        "'speaker_2': 'Excellent. Thank you. Well, thank you. Members, please go out and cast your votes on a very exciting project. Very supportive.'",
        "'speaker_6': 'Oh.'",
        "'speaker_2': 'Person monger. Yes.'",
        "'speaker_0': 'They're pushing cars.'",
        "'speaker_1': 'They're just very cold.'"
    ],
    "Resolution to Hire Catherine Grant for the Financial Management Department.": [
        "'speaker_0': 'Motion carries. Item 39 report from Human Resources recommendation to adopt a resolution approving an exception to the 180 day waiting period for public agencies to hire Katharine Grant for a limited duration to work in the financial management department citywide.'",
        "'speaker_2': 'Thank you. There's a motion in a second and no public comment.'",
        "'speaker_6': 'Mr. Mayor, we need to read something into the record on this.'",
        "'speaker_4': 'Good evening. Mayor and Council members, I'd like to introduce Fred. The Verdugo Hoosier Deputy Director is going to give a report.'",
        "'speaker_1': 'Good evening, Marion. City Council Members. The Financial Management Department requests City Council approval to hire Catherine Grant Current Payroll Specialists effective August 19, 2019. Learn to support the Enterprise ERP Process Program and the city's financial and human resource system since its grant is proposal start date is less than 180 day waiting period from her retirement date.'",
        "'speaker_1': 'City Council approval is required for Ms.. Grant. The proposed rate of pay will be 35.855. There needs to be some amendments to the documents submitted, and specifically the changes will need to be in the council letter on page 1/2 paragraph under the discussion section.'",
        "'speaker_1': 'The prepared the proposed rate of pay will be 35.855 per hour. And on page two, under the fiscal impact, the changes as the total annual cost will not exceed 34,000 for 20 and $0.80 on 904 960 hours at the rate of 35, eight, five, five.'",
        "'speaker_1': 'And in the resolution letter, page two lang ten and 911 needs to read. Whereas at the direction of the City Council, the hourly rate paid to Kathryn Grant as a retired annuitants will be 35.855. And also on page three, line two and line three.'",
        "'speaker_1': 'The compensation for retired Newton returned grant will be 35.855 per hour and also to the MIS Grants Offer letter dated August 13, 2019. The first paragraph last sentence. Your appointment as a retired annuitants will be effective August 19, 2019.'",
        "'speaker_1': 'At our rate of 35.88 or I'm sorry, 35.855. Thank you. And if you have any questions available.'",
        "'speaker_2': 'Thank you very much. There's no public comment, so please cast your votes. Okay. There's I buy price and mango. Item 40, please.'"
    ],
    "Refuse Transportation Agreements with Private Haulers and Related Rules and Regulations.": [
        "'speaker_2': 'It's what welcome to to the end of the meeting to our report director. And next. This next item is 42.'",
        "'speaker_0': 'Please report from Public Works recommendation to modify and extend existing refuge transportation agreements with private haulers currently operating in compliance with their refuse transportation permit citywide.'",
        "'speaker_2': 'Thank you. Can we have a short staff report?'",
        "'speaker_1': 'Craig Beck. Just real quickly, we'd.'",
        "'speaker_2': 'Like Diego Mosconi in to go over what we're proposing and how it aligns with previous council action on the five year notice.'",
        "'speaker_9': 'Thank you. Good evening, Mr. Mayor, and members of the City Council. In 2009, the City Council approved a nonexclusive franchise agreement system for our commercial waste collection and recycling collection. And we've been operating under that system since that time.'",
        "'speaker_9': 'Franchises were awarded to the haulers that were currently at that time operating legally and in compliance with their FCC transportation permits. The agreements that we entered into enhanced existing operating rules regarding refuse and recycling collection. Compliance with state laws required the use of alternative fuel vehicles, established fees that generate revenue for both the general fund and the'",
        "'speaker_9': 'refuse fund and required improved reporting requirements. Current haulers that are operating in Long Beach are some of the biggest ones in the world, such as Waste Management and Republic Services, as well as some smaller, privately owned companies like a Rent Ban or ATCO.'",
        "'speaker_9': 'In May of 2017.'",
        "'speaker_1': 'The.'",
        "'speaker_9': 'In May of 2017, the City Council directed staff to issue a five year notification to private refuse haulers operating in Long Beach, effectively advising them that the city may at its discretion change the way we manage commercial waste hauling in Long Beach.'",
        "'speaker_9': 'At the end of that five year period. Five year notice is a requirement by state law, but does not require that any specific action be taken. Currently, the solid waste industry is facing many challenges. There's great uncertainty in recycling markets.'",
        "'speaker_9': 'What was once considered recyclable is no longer, in many cases, recyclable. The state continues to pass legislation mandating cities to implement new diversion programs, most recent of which is organics collection, which must be implemented citywide by 2022. In order for us to effectively address solid waste.'",
        "'speaker_9': 'As a whole, we've begun the development of a zero waste plan. This plan will create a path for Long Beach to strive toward generating zero waste and comply with state laws such as organics collection. We've currently stages the beginning stages of that plan.'",
        "'speaker_9': 'We have commissioned a waste characterization study that we should have all the results for by the end of the year. That study basically just goes through our waste streams and determines what materials are there for us to target in order to continue developing this long term strategy for managing our waste.'",
        "'speaker_9': 'We recommend the City Council to enter into agreements with existing haulers for a three year period to align our current system with the five year notice. Staff also recommends to have two one year options off. The Zero Waste Plan identifies a preferred method of managing our waste.'",
        "'speaker_9': 'We will have time to implement a transition plan from our current system to a new system. Thank you.'",
        "'speaker_2': 'Thank you. There's one member. The public is Manuel Govea here? Please come forward.'",
        "'speaker_6': 'The new Mayor Garcia, and his team council members. We made it to item 42, so thank you. My name is Manuel Gouveia, a municipal relationship manager.'",
        "'speaker_12': 'For Republic Services.'",
        "'speaker_6': 'Just briefly, on behalf of Republic and our 300 plus employees here in the city of Long Beach, I thank you all for your consideration in approving this item this evening and the opportunity to continue serving as a solid waste and recycling partner to your great city.'",
        "'speaker_6': 'Thank you so much.'",
        "'speaker_2': 'Thank you so much, Councilmember Pearce.'",
        "'speaker_4': 'Yes. I want to thank staff for their time on this. I have just two quick questions. It's a three year extension and so there'll be an RFP process starting one.'",
        "'speaker_2': 'That's why I'm here, Piers. Yeah, we're proposing that the council approve a three year extension at Lindsey's with the five year notice. It will provide us time to educate us on some of the state mandates that are coming forward and how that affect us from an operations perspective.'",
        "'speaker_2': 'So we anticipate within the two year time frame we would start the RFP process. So at the end of that three year term, we would be ready to come to council with our recommendations on how.'",
        "'speaker_6': 'We would move forward in our.'",
        "'speaker_2': 'Franchise waste hauling. Okay.'",
        "'speaker_4': 'Great. Thank you. And I know you and I have had several conversations today. I know City Attorney Parkins, we had a couple of conversations, so I don't want to make it too complicated. I just want to make sure that the RFP process, can we bring that back to this body so we can have a public conversation about'",
        "'speaker_4': 'what we would like to see in that RFP?'",
        "'speaker_2': 'Certainly. In fact, I think it would be helpful to not only talk about what we would want to include in the RFP, but just where we're at from our zero waste plan, where we're at from organics collection and kind of help do an update to council and where we see our current operations would be at that time'",
        "'speaker_2': 'and then where we would be going forward in the future and how our private haulers would integrate into our future plans. And so certainly support bringing an item back and talking about the RFP process.'",
        "'speaker_4': 'Great. And at that time, when you talk about that holistically, I'm assuming that you'll talk about the surf as well.'",
        "'speaker_2': 'That's right. Our waste energy facility that we have in our city is very unique to Long Beach and really helps us keep our rates down for all of our residents here, providing good renewable energy so that with.'",
        "'speaker_6': 'The clarity.'",
        "'speaker_2': 'On the financial viability of surf moving forward is a little murky at this point in time. So I think a couple more years would help us understand how that's going to fit into the waste picture moving forward.'",
        "'speaker_4': 'Great. Thanks. And just I'll be brief in a little bit of context. Obviously, trash is something that we talked about trash cans earlier today. Sometimes our neighborhoods say their trash wasn't picked up, their big cans weren't picked up.'",
        "'speaker_4': 'And so we want to make sure that as we move forward with a new process and that new RFP, that we really are going into an agreements with the best actors that are consistent, that abide by state laws, that abide by their contracts they have in other cities.'",
        "'speaker_4': 'And that we really are looking at the whole picture and how we get the best haulers with our new standards. And so I appreciate having that conversation come back and that satisfies what I was trying to reach today.'",
        "'speaker_4': 'So I appreciate the time at the end of the meeting to have this short conversation.'",
        "'speaker_2': 'Councilman Hooper. Now, I'm sorry, Councilman Ringo. Councilman Soprano.'",
        "'speaker_9': 'It's just a question of staff regarding what we're asking here. It's my understanding that the haulers are be being asked to invest in as part of this agreement. Would it make sense to go with a five year term?'",
        "'speaker_9': 'I'm not understanding the advantage of the three years plus one plus one would be a disadvantage of just going five years.'",
        "'speaker_2': 'Councilmember Suber not as directed by this council. There was direction given to staff to issue a five year notice to all of our franchise haulers, and we have done that. The extension before you tonight would take this current contract extension to that five year notice period.'",
        "'speaker_2': 'The reason were we're putting in two more options is if at that moment in time, if this council decides that they want to extend.'",
        "'speaker_6': 'For another year or.'",
        "'speaker_2': 'Consider other options, we felt it was important to have that flexibility built within the contract. But right now, the three year term that this council is considering would align with that five year notice if the council was was looking to extend beyond that time frame.'",
        "'speaker_2': 'I think the city attorney can answer this, but it's my interpretation that you would have to take an action to push off the five year notice longer than the term we have currently.'",
        "'speaker_9': 'Okay. Understood. So the two one year extensions gives us flexibility, I think is what you're saying. So that that wasn't clear. So I appreciate the explanation.'",
        "'speaker_2': 'Thank you, Councilmember. We've done public comment. Please cast your votes. Thank you. And I think we have anyone signed up for this ocean carries.'",
        "'speaker_0': 'We don't have a second public comment. Sign up.'",
        "'speaker_2': 'Okay. So that something that we could do for next time. But if there is one, please, now would be a good time. We don't I don't see any. So we will move on from that to new business and new business.'"
    ]
}