{
    "Amended and Restated Lease and Operations Agreement and Funding for Queen Mary Infrastructure Repairs.": [
        "'speaker_3': 'Motion carries the the vote go up. Okay. Item number 18. Mr. West.'",
        "'speaker_9': 'Mayor council members. Tonight is a real epic evening regarding the Queen Mary property. As we know, it was picked up by a company called Garrison, a financial company when Save the Queen went bankrupt. We've been working for the past several years to attract a new company, to take the lease from Garrison, where we would develop the 45'",
        "'speaker_9': 'acres and also manage the Queen Mary. This is a property that I know previous director of economic development Mike Conway, has been working with for the past couple of years, and he's been briefing us so long that we're finally down to the end of the wire here.'",
        "'speaker_9': 'We're going to hear the rest of the presentation by Katherine McDermott, the interim director of economic development of Property Management. But this basically transitions the lease to.'",
        "'speaker_3': 'Urban commons, a group that we've been working with for the past.'",
        "'speaker_9': 'Year to facilitate.'",
        "'speaker_3': 'What.'",
        "'speaker_9': 'The task force for the Queen Mary has been putting together for guiding principles to the city council and the community. So with.'",
        "'speaker_3': 'That, Catherine, let me see. Thank you. I'm sorry about that, Mr.. Mr.. West, you turn it over to Catherine. Catherine McDermott.'",
        "'speaker_8': 'Good evening, Mayor. Council people, city staff and members of the public. We're pleased to bring this item to the council tonight for approval. As Mr. West said, this is the culmination of several years of negotiation and planning by city leaders and staff and the urban Commons team.'",
        "'speaker_8': 'On November 17, 2015, the City Council approved the assignment of the existing amended and restated lease for the Queen Mary from Garrison Investment to Urban Commons LLC. The lease includes the operations of the Queen Mary, Carnival Cruise Lines and Catalina Express in the 42 acres of land surrounding the ship.'",
        "'speaker_8': 'The Council also approved the terms and conditions of a new amended and restated lease with urban commons, which will call the new lease. The new lease was expected to be signed in the following six months or by May of 2016.'",
        "'speaker_8': 'The negotiations were extended past May due to several new issues. The lease terms are in that are in front of you tonight concerning the physical condition of the Queen Mary and the need for urgent repairs. Proposed terms to facilitate the construction of a replacement passenger facility for Carnival to allow urban commons to retake use of the Dome'",
        "'speaker_8': 'in the future for special events. And lastly, a card check neutrality agreement. First, I want to discuss the issues related to the physical condition of the Queen Mary. Garrison investments in it and its successor, Urban Commons, commissioned a marine survey of the Queen Mary.'",
        "'speaker_8': 'The survey concluded that there is over 200 million and repairs required to to be made to the ship. The terms of the new lease would include a pass through of revenue from Carnival to the city, which would be used for capital repairs and renovation on the ship.'",
        "'speaker_8': 'Based on the recommendations of the Marine survey, there are urgent repairs that require immediate attention that exceed the expected annual pass through amount. And I'm sure these slides show you some of the repairs that need to be done.'",
        "'speaker_8': 'Based on the recommendation of the Marine survey, Urban Commons asks the city to create a more robust fund at the onset of the new lease to address some of the urgent issues. The city and urgent in urban Commons have each agreed to divert future and current revenues from Carnival to create a fund of approximately $23 million.'",
        "'speaker_8': 'First, I want to make it really clear that there are no new funds being used to accomplish the ship repairs. The city's contribution will come from a combination of tidelands in Queen Mary, cash reserves and from future revenues from Carnival and Urban Commons in the form of base rent and passenger fees totaling approx.'",
        "'speaker_8': 'Totaling approximately. Over the first seven years the least. Sorry. Urban Commons is also contributing their share of passenger fees rosier received from Carnival in years five through ten of the new lease. The city intends to issue bonds for 17.2 million to be repaid by these revenues over the first ten years of the new lease.'",
        "'speaker_8': 'Secondly, the new lease also required urban commons to turn over the entire dome to Carnival for their expanded cruise operations to accommodate larger vessels expected to begin to call in Long Beach in the future. This has been accomplished, as you may have read in Carnival's recent press release, Urban Commons believes the use of the dome for an'",
        "'speaker_8': 'event facility is integral to its development plans. In order for urban commons to utilize the dome. They will be required to construct a passenger terminal facility for Carnival. This added cost to the development will reduce the capital for development of the vacant land and for visitor serving uses.'",
        "'speaker_8': 'The city and urban Commons have agreed to amend the revenue sharing provision in the new lease to increase the passenger fees paid to urban commons. The additional revenue to urban commons will help defray the cost of construction of the replacement passenger facility and preserve capital for the commercial development of the land.'",
        "'speaker_8': 'The reduction in resident revenue is estimated at approximately 5.375 million in the first ten years of the lease, which is the length of the bond issue. As was mentioned, the city intends to issue revenue bonds for $17.2 million.'",
        "'speaker_8': 'The bond issue is expected to be sized at $19 million to provide about 17.2 million in contract construction proceeds and is to be completed within six months after the effective date of the lease. The bond issue would be backed by a pledge of tidelands revenue.'",
        "'speaker_8': 'The actual source of the debt payment is anticipated to be passenger fees and base rent from urban commons. Lastly, the city and urban Commons have agreed to add language to the newly stating that if urban commons constructs a hotel on the property, a new hotel, they will require the hotel operator or management company to participate in a'",
        "'speaker_8': 'card check neutrality agreement within three months of receipt of the site plan review. The city believes that these changes to the new lease approved by the Council last November are consistent with the city's priorities associated with this project, which include ensuring that Carnival has a facility that will handle or handle future expected larger ships and additional passengers'",
        "'speaker_8': 'to the Long Beach cruise terminal. Commercial development of the land surrounding the Queen Mary, which is integral to the long term viability of the city's historic asset. I'm happy to answer any questions that you may have. At this time, I'd also like to introduce members of the Urban Commons team, including Taylor Woods, Howard Wu and Dan Roney'",
        "'speaker_8': ', who are in the in the audience.'",
        "'speaker_3': 'Sistematica.'",
        "'speaker_9': 'That concludes stats presentation were available for questions if needed.'",
        "'speaker_3': 'Okay, thank you. I'm going to turn over to the maker of the motion. Councilwoman Pierce.'",
        "'speaker_7': 'Thank you very much, staff. I want to thank you guys for not only your presentation today, but the very intensive, long days that led up to this to get us where we are today. I know that you've worked hard and that we are doing our best to preserve what is a city asset, which is the Queen, and'",
        "'speaker_7': 'trying to activate an area that has been particularly challenging to activate. And so, as I said last time this item came up around the Queen is I'm very excited about what we can do there. And I want to thank Urban Commons for thinking outside the box, for being innovative and really pushing ourselves to think about how we'",
        "'speaker_7': 'can preserve the ship, how we can support Carnival, which is one of the largest companies that we have here in the city. That is something we've been able to depend on over the years to make sure that we have revenue coming in and that we are expanding that opportunity here in the city.'",
        "'speaker_7': 'Over the last several months, I have seen even the Queen with you guys taking over. It activated in ways that it wasn't before. And so tonight's vote really being around ensuring that the city is not spending any additional money, but that we are investing in a ship to make sure that we're protecting our asset and that I'",
        "'speaker_7': 'feel confident in the bond that the city is issuing, that we're going to pay that off in seven years. I feel confident in that the sharing of the passenger fees is an appropriate share. And so I'm really excited to hopefully ask for my council support in making sure that this goes through tonight.'",
        "'speaker_7': 'And thank you, staff again. Appreciate it.'",
        "'speaker_3': 'Thank you, Councilmember Andrews. Okay. Well, you're on this. You're the second. Yeah, go ahead.'",
        "'speaker_2': 'I can only say that, you know, it's been a long time coming. And I really want to commend the individuals who have taken this over, because I think you see the pride that we're looking for. And I think with your support and help that we're going to get this ship to where it should be.'",
        "'speaker_2': 'And that's the dream that everyone has. And all the things that you guys have in your mind. Put it in action. And I'm telling you, Long Beach is going to be the way to Always Strong Beach. Thank you guys again for the work you've done.'",
        "'speaker_3': 'Thank you. Councilwoman Pryce.'",
        "'speaker_10': 'Thank you. I like the comments that I'm hearing from my colleagues, but I really would like to focus on the agenda item, which isn't really how wonderful the change in ownership has been, which I think is great, and how much we should try to invest in the Queen Mary, which is also great.'",
        "'speaker_10': 'But the agenda item is actually it's it's involving a debt that we're going to be issuing as a city. Right. So that's the that's the I'm talking about that this has nothing to do with the lease, correct?'",
        "'speaker_8': 'Actually, the issuance of the bond and the repayment from the revenues coming from Carnival are a part of the lease. Yes. Okay.'",
        "'speaker_10': 'And that's. Can I just ask, why is it that the city is undergoing this these expenditures at this time?'",
        "'speaker_8': 'Well, the city had always intended in the lease that was approved last year by the council. The city had always intended that the passenger fees from Carnival would go to the city and then into a historic preservation fund, and that urban commons would use that to preserve the ship.'",
        "'speaker_8': 'The difference that is being made is that that that amount of about $2 million a year just isn't enough to take care of some of these urgent repairs. And so what we're doing is front funding the money with the bond.'",
        "'speaker_8': 'And for the first seven years, we will end four, five years of urban commons. We will both put our fees from the passenger fees. We will put that toward the repayment of the debt. So, again, we're not using money in a different way.'",
        "'speaker_8': 'We're just we're using money as it was intended, which was for the historic preservation of the ship.'",
        "'speaker_10': 'And I understand that I did read the staff memo. My question is, and I guess this is something I didn't know until this item appeared on the agenda, which was frankly a little bit surprising that we're going to be using a pledge of tidelands revenues.'",
        "'speaker_8': 'There are some tailwinds. The Tidelands revenues is the pledge, but those revenues are the passenger fees we intend for those revenues that are going to repay the bond to be these passenger fees. So there aren't the. The idea is we are using the fees that come in from Carnival, which are Tidelands revenues to pay off the bond'",
        "'speaker_9': '. And Councilmember, if I can jump in and help explain as well. Anything in that area has to do with Tidelands. So all the money that comes in and out of the Queen Mary that is also reserved for Queen Mary purposes is actually tidelands funds.'",
        "'speaker_9': 'So I think Catherine explained it very well. We expect no additional money to be needed that we are putting in money that comes from Carnival that used to go to urban commons under the new agreement comes to the city.'",
        "'speaker_9': 'We would then use that as a debt issuance and also as part of this $23 million urban commons is putting their own private money into the deal that the city will go to the bond market. So part of the reason that you see in the in the agenda item that it talks about Tidelands, is for us to'",
        "'speaker_9': 'get a very good interest rate and to have a low cost of borrowing. We're going to be pledging that tidelands revenues will will make up for it. Well, will be the backstop. But we're very certain that the money coming from Carnival will cover that.'",
        "'speaker_9': 'And if that doesn't happen, we do have emergency reserves that would be available. We do not expect to need those that we have all the money that we need from Carnival Lease to be able to pay for this seven year city commitment, plus the other three for urban commons.'",
        "'speaker_10': 'And these emergency reserves. I'm assuming those are out of Tidelands as well.'",
        "'speaker_9': 'First, we have money from Queen Mary, so we have Queen Mary Reserves. That would be as part of that. And then we have operating reserves from Tidelands as well. Yes.'",
        "'speaker_10': 'Okay. So this plan would not use as its insurance any projects that we've already committed to. Our constituents will be paid out of Tidelands.'",
        "'speaker_9': 'So, no, that is not envisioned, although we always plan for every and any risk in eventuality. So if in the very unlikely event, Carnival, one of the largest cruise corporations, would go bankrupt in the next 7 to 10 years, that whatever remaining would be first pledged from any Queen Mary Reserves, we would look to our operating reserves'",
        "'speaker_9': '. And between those pots of money, we're already looking at almost $19 million, which is the debt that we would go to go to the bond market on. If for some reason that weren't enough, we would look to other tidelands, but we are not pledging any additional projects or anything as collateral as part of this.'",
        "'speaker_10': 'I know it's not part of the staff report, but I know that the city auditor's here and I wonder if it's possible for her to give us her thoughts on this, because I know this has been a subject of study and consideration in the past, and I'm just want to make sure that we're proceeding because to me'",
        "'speaker_10': ', this is a pretty significant action by the city to take. And so I would feel more comfortable hearing from the city auditor and even John GROSS if he's prepared to make any comments about and thoughts on this moving forward.'",
        "'speaker_10': 'I don't mean to put you guys on the spot, but if either of you guys have you just happened to be sitting in the front row.'",
        "'speaker_3': 'So why don't we have missed out? And then, Mr. GROSS, maybe after you can make some comments as well, please sit down.'",
        "'speaker_8': 'Thank you. I believe this is a significant item. My last discussions regarding the Queen Mary were with the former director, Mike Conway, several months ago. And at that time, the city was not liable for assuming any risk for the new lease.'",
        "'speaker_8': 'And so there is a significant change happening today. I've reviewed this item and called a meeting with the city manager this morning to discuss it with him. He provided the documents I requested this afternoon, but I haven't had time to review them adequately.'",
        "'speaker_8': 'And any time we're using public funds to invest in something, I would always prefer time to review the details of the financing plan for the the Queen Mary. And thank you, Kathy, for your presentation that you just gave.'",
        "'speaker_8': 'I think that help clarify some things and and it does bring up more questions that I that I have. One of her first comments was the fact that the Queen Mary has over $200 million worth of infrastructure needs.'",
        "'speaker_8': 'And I think that's extremely significant. And how this $23 million investment fits into the long term plan for the Queen Mary. And who's responsible for those $200 million worth of investment infrastructure needs the Queen Mary has? It's an important question I think we need to ask as a city.'",
        "'speaker_8': 'I. I feel like I would prefer to have more time to review the the projections, to feel more comfortable with the risk that the city is assuming at this time. From the documents I've reviewed, it appears the city is the only one assuming risk at this time, and so we would like more time to review it before'",
        "'speaker_8': 'the council would vote on an item like this. And that would be my recommendation to allow us some time to review the documentation that was just provided to us today.'",
        "'speaker_10': 'What would be a reasonable amount of time? Like 30 days? Would that be enough? Mm hmm. Is that a possibility, Mr. City Manager.'",
        "'speaker_9': 'We've been stretching this for quite some time as we learn for a couple of years. We've been negotiating with urban commons really for the past three months intensely. We came up to the final negotiations recently.'",
        "'speaker_2': 'They are stretched.'",
        "'speaker_9': 'If we go any further.'",
        "'speaker_3': 'With interest rate changes, that could affect the interest rate on what.'",
        "'speaker_9': 'They're going to do. Additionally, their extent, they.'",
        "'speaker_2': 'Are perhaps this remote.'",
        "'speaker_3': 'Could talk to this as well that at some point in time. I don't know how quickly that's going to be.'",
        "'speaker_9': 'They could reverse our position with Garrison and actually lose our position with the Queen Mary and it would revert back to Garrison and potentially put urban commons in bankruptcy.'",
        "'speaker_3': 'Can I do I just want to make sure that the one question that Ms.. Doughty did bring up about the liability question, so why don't we have that answered as well? But before I do that, Mr. Price, are you did you want to continue everything else?'",
        "'speaker_10': 'Yes. And I appreciate that for for Mr. West. I appreciate that this has been going on, as you said, for two years. But I think I've tried to be really diligent on this. And before Mr. Conway left, I spoke with him frequently about this lease and this contract and my concerns.'",
        "'speaker_10': 'And this may be going on for two years, but until this appeared on the agenda, I did not realize that we were going to be pledging tidelands funds for this type of debt. So perhaps that's my negligence. Or perhaps there could have been a better job at a briefing that went on, because I did not know that'",
        "'speaker_10': 'this was going on for two years. And I, I do have an issue when items come before us and we're told that there's this imminent urgency that we have to make a decision that night that that to me is puts us in a very difficult place.'",
        "'speaker_2': 'Council Member I let's when we're prepared when Mr. out is concluded, I think that I.'",
        "'speaker_9': 'Think the discussion here is the amount of risk regarding the tidelands, which we think is.'",
        "'speaker_2': 'Fairly.'",
        "'speaker_3': 'Brief. And that's something that Mr. GROSS can talk about when we're ready. Mr.. Can you guys please. Mr.. MODICA You were going to say something.'",
        "'speaker_9': 'Yes. I wanted to respond a little bit to the and just clarify the the liability in the 200 million. And, of course, the city attorney can jump in any time. And if I say something that that needs to be clarified.'",
        "'speaker_9': 'So the the Queen Mary is a city asset that actually belongs to the city. So the way that we have managed our risk in the past is, rather than as a city, take on everything that's responsible to the Queen Mary, we enter into a long term lease with somebody who can make revenue on that site and able'",
        "'speaker_9': 'to create some revenue to put it back into the Tidelands, to pay for the maintenance for a city asset. That, frankly, is very expensive. It's been here since the 1960s. Anything in a marine environment is going to require a tremendous amount of maintenance.'",
        "'speaker_9': 'And so from time to time, the owner of the or we're the owner, but the the lessee over there does Marine surveys. We've done this in the past, and they normally show that there is a lot of maintenance that needs to be done.'",
        "'speaker_9': 'So this was conducted by Garrison before it transitioned to urban commons and looking at over $200 million worth of infrastructure repair. That's not unlike what we see in any facility that we have anywhere in the city. So every facility is going to have maintenance issues.'",
        "'speaker_9': 'And so that is the summary of the major issues, what you've seen in front of you today, those are the structural issues, the ones that are the most urgent. And the way we've done this agreement is urban commons.'",
        "'speaker_9': 'Ultimately, at the end of the day, per the lease is responsible for all of those investments. However, if at some point the city puts the full burden on them, they have the option of basically walking away and the city would it would revert back to the city and we would have that $200 million worth of infrastructure repair'",
        "'speaker_9': 'without really any revenue source to be able to pay for it. So we think that this agreement makes a lot of sense. We're using Tidelands reserved money for the Queen Mary to put into the deal, money that we're receiving from Carnival.'",
        "'speaker_9': 'So no additional tidelands dollars that aren't already going into the ship and then also having urban commons put their money into the deal in order to do that, $23 million with very little risk. So and then, of course, urban commons is also putting in $15 million of their own funds to put into the parts of the ship'",
        "'speaker_9': 'that people see, the part that really makes them want to come spend money like the hotel rooms and the lobbies, which is really the revenue generator. So under this deal, the city helps finance kind of the the structural bones, the utility systems, the plumbing, the things that the city, you know, that need make the ship go.'",
        "'speaker_9': 'And there will be investing more money into what makes money.'",
        "'speaker_10': 'And I appreciate that explanation. It makes a lot of sense to me. My my I guess my confusion lies in the fact that prior to even the last day that Mr. Conway was here, my understanding was that we hadn't reached an agreement yet.'",
        "'speaker_10': 'We didn't have a legal document. So all these terms that you're talking about in terms of this, if this were to happen, this would happen to urban commons of this. Where is that coming from? What, where, how? We're counsel to be made aware of those those conditions.'",
        "'speaker_10': 'That's what I don't understand.'",
        "'speaker_9': 'So there's two documents. One is the lease that they're currently in that has been the lease that we had with Garrison Urban Commons is actually our lessee. We have transferred the existing lease over to urban commons. And so they are our lessee.'",
        "'speaker_9': 'What we brought to you back in November 15th was really the the majority of the of the things that we're talking about today and all those lease conditions, all the things that transfer risk and responsibility over to urban comments.'",
        "'speaker_9': 'That is what the council saw in in pretty great detail on November 15th. Since that time, we've had those discussions with Carnival and with Urban Commons and with the city about really the Dome. And then also now this component about how to fund some of the maintenance.'",
        "'speaker_9': 'And this was a request, as we did back in November, was create that that pot of money, that $2.15 million that we would be able to invest every year. What is a little different in this is they're asking us to just front that money and do it in a short time frame, about seven years of money that'",
        "'speaker_9': 'we were going to put in the ship already that the council approved back in November and just do it quicker. So we have a larger pot of money that frankly, you can get more repairs done efficiently because you're going to have larger sums that you can invest all at once.'",
        "'speaker_10': 'So I'd like to hear from my colleagues on this, but I think that and I'd also like to hear from Mr. GROSS. But I think that our auditor saying that the benefit of 30 days would be very valuable to her and in terms of her comfort is very reasonable.'",
        "'speaker_10': 'And I understand that this is probably something that should have happened yesterday, but the reality is that it's coming to us today and giving us 30 days to feel comfortable with a decision that's this big is is very reasonable there.'",
        "'speaker_10': 'I think 30 days is is not much time at all. In light of I understand the urgency on the part of the negotiating parties, however, we have not been subject to those negotiations in those discussions. So I think 30 days is reasonable to give us some more time.'",
        "'speaker_10': 'I also feel incredibly uncomfortable pledging revenues that could potentially have been already committed to constituents through our Tidelands budget. Those are real constituents advocating for real needs. And I don't I know that while I understand the risk is low.'",
        "'speaker_10': 'I do think that we need to have some thorough and comprehensive and meaningful, genuine discussions before we we pledge that kind of money, because we've worked really hard to prioritize items. And, you know, it's the fact that that something could be set in a meeting that could cause somebody to want to undo years of of of commitment'",
        "'speaker_10': 'to a project is one thing. But meaningfully voting as a council to pledge that money long term is problematic to me. And I think the the the first risk that I just mentioned, you know, I can't control somebody may want to just pull money that's been committed to a project to make a point.'",
        "'speaker_10': 'But I can control us making long term decisions about our finances, knowing that we've already committed some funds to particular constituent groups. And so that's that's a problem that I have is is pledging money that we've already committed elsewhere.'",
        "'speaker_10': 'That's a problem for me. So I'd ask my colleagues to consider putting this over 30 days as the city auditor has suggested, and allow us some time to have the financial numbers so that we can all feel comfortable moving forward.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_3': 'Okay. Let me go ahead and move on. I know we have a couple more speakers. Just as a reminder, we have another critical item that we have to get to after this. And I know that Councilman Ringa also has to go.'",
        "'speaker_3': 'So just I know as I know as we move forward to consider that councilman mongo.'",
        "'speaker_7': 'Thank you i to appreciate and respect. City official and auditor Laura dowd and I think that within the context of the information you have available to you, I can understand why you might think that some more time would be valuable.'",
        "'speaker_7': 'I, like Councilman Price had have had several meetings not only with Mr. Conaway, but also with Councilmember Pierce, and before that, several meetings with Councilmember Lowenthal. I've made the efforts to have meetings with members of urban commons, and I'm familiar.'",
        "'speaker_7': 'I will say that during discussions with Vice Mayor Lowenthal at the time, I realized that I had not experienced anything with Carnival Cruise Lines and had any personal opinions on their value to the city of Long Beach. So my fiancee and I, with our own personal funds, decided to take a weekend and experience Carnival.'",
        "'speaker_7': 'I am very excited that they're bringing another ship. I think this will be huge for economic development. And I think that in in the industry of economic development, one of the things that I've learned in traveling and meeting with brokers and individuals is that a lot of things can change in 30 days, time can kill deals, and'",
        "'speaker_7': 'this deal is a good deal for Long Beach. I worry that should we not find another partner like this in the future? I think we're in a great situation and the assessment and knowledge of what risks urban commons is taking on is, in my opinion, greater than the risks we as the city is taking on.'",
        "'speaker_7': 'And for that, I will be supportive of this item and I hope my colleagues will as well. This was not put on the supplemental agenda. This was not jammed down our throats at the last minute. I believe that over the last seven days, I've had the time necessary to follow up on any conversations I've had since November'",
        "'speaker_7': '. And I feel very confident that this is the right direction. And I appreciate the work in filling me in and briefing me throughout the process, as I know many of my colleagues have as well. And so. I too, want to be mindful and timely in ensuring that we think things over carefully.'",
        "'speaker_7': 'And in looking at the the little matrix that the city manager gives us, I've known this was on the agenda for several weeks. And so for that, I appreciate you. Have a great day and I hope you'll all support me.'",
        "'speaker_3': 'I got some of them.'",
        "'speaker_5': 'I'll be very, very brief if we can bring up slide eight. I just had any clarification on one item there. Is that easy to do?'",
        "'speaker_3': 'Slide eight, please.'",
        "'speaker_5': 'And I'm just talking about years one through five versus years six through ten. I want to make sure I'm really clear on that.'",
        "'speaker_8': 'Okay. As soon as they load that.'",
        "'speaker_1': 'It's right here.'",
        "'speaker_5': 'So we can move on to the next speaker, if you like.'",
        "'speaker_3': 'I'd coming up.'",
        "'speaker_8': 'I. We're trying. You've got to load it back there. There, loading it now.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'So if you can just go over your your version of that. Urban commons, can you can you tell us the years one through five versus six?'",
        "'speaker_8': 'Yeah. So in years one through five, the city receives up to 2.15 million from Carnival's passenger revenue fees, plus 300,000 for base red that would go toward. For five years that share of the city's passenger fees. We'd go, okay.'",
        "'speaker_5': 'I think we have a type. I spotted a typo when it was up there.'",
        "'speaker_3': 'I believe it says went through seven spots. We went through five. I believe that's.'",
        "'speaker_8': 'It. No, it actually is one through seven. Is it. So the year six and seven, the amount goes down to 1.5 million. So the city is pledging seven years of its revenue. It's just in year six and seven.'",
        "'speaker_8': 'It goes down. Urban Commons is pledging year six through ten and that's estimated at about 800,000 $815,000 a year.'",
        "'speaker_9': 'So and just out of that, to be fiscally responsible, the city didn't want to pledge long term this money. We wanted to do it on a short term. So we wanted to put about seven years of hours in.'",
        "'speaker_9': 'So that's one through seven. Carnival Urban Commons doesn't really see any of that passenger facility until year five. So in part of our negotiations, we asked them to put money in. So their money, once it starts in year five, under the current agreement on the lease, they're putting their money in from years 5 to 10.'",
        "'speaker_9': 'We put money in from years 1 to 7.'",
        "'speaker_5': 'Okay. I think that clarifies it for me. Thank you.'",
        "'speaker_3': 'Thank you. Before I go back to Councilman Pearce, do might we go to public comment first and we'll come back any public comment on this issue? Please come forward. If there is, please quickly. Yes. Thank you.'",
        "'speaker_8': 'My name is Diane Roche. I reside in Los Alamitos, California, and I'm here tonight to ask mainly a couple of questions about this new lease. Mayor Garcia and members of the council in the 1990s, I chaired an organization called the Queen Mary Foundation, and that's the organization that is responsible for the ocean liners admittance to the to'",
        "'speaker_8': 'the National Register of Historic Places. And I had a couple of questions about the structural integrity. I know back in 1990 and again in 1992, Radio's International Marine Survey Organization did detailed surveys of the Queen Mary's Hall and superstructure.'",
        "'speaker_8': 'And there were some concerns at that time that were going to be addressed when Joseph still took over the lease of the ship in 1993 and the city engineer Edward Bionic drew up a base maintenance plan. That's Document HD 1605.'",
        "'speaker_8': 'And there were several concerns during the ship's conversion. There were some bulkheads removed, some load bearing members that have never been replaced since that time. And I noticed that when you flashed up on the screen, there were lists of the immediately needed maintenance and restoration concerns of the recent survey.'",
        "'speaker_8': 'I believe it's by Simpson, Gompertz and Hager. I'd like to request at this time, if I may, by Public Records Act, I would like to have a copy of that that Marine survey to compare it with the original reader's reports, because I know what to look for.'",
        "'speaker_8': 'I knew several of the ship's original designers and engineers. So I would really like to make that request. I also would like to share a little bit of the history on that document. 22697. That's the current lease that's being amended and restated.'",
        "'speaker_8': 'That was initially drawn up in 1993 and during Patel's lease it had been. Revised in order to accommodate his nonperformance and non conformance. So I was just wondering how robust that lease is. I really applaud you for holding off.'",
        "'speaker_8': 'Hopefully you'll hold off on making a decision because I think there are probably lots of things in the lease that have to be looked at in terms of the maintenance needs, in terms of the funding. I know that there was a thing called the Queen Mary Fund that was $6.5 million set aside.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Ma'am. Time's up.'",
        "'speaker_8': 'Okay. Could you look into that?'",
        "'speaker_3': 'We've made we made a note of that. We'll try to connect with you as well.'",
        "'speaker_8': 'Okay.'",
        "'speaker_3': 'Can you give the clerk your information, please? And we'll get that for you.'",
        "'speaker_8': 'Thank you very much.'",
        "'speaker_3': 'Next speaker, please.'",
        "'speaker_8': 'Thank you. Oh. $53 million went to the Aquarium of the Pacific. $53 million that they didn't need, but they wanted. For. Beautification of a project that is beautiful. And now we're discussing $23 million. To go to the Queen Mary boat.'",
        "'speaker_8': 'It sits vacant at night. I don't I'm speaking because my other non-profits who work for the for the homeless are not here. The committee commission newly installed is not here. So someone should be here every time the city council begins to discuss, to use money, expeditiously, implementable funds.'",
        "'speaker_8': 'But you still have the humans sleeping in the streets. Still. If the marijuana dispensaries were to open tomorrow, I believe I remember hearing someone to my right saying that they would have immediate $1,000,000 to throw into that project to fund the marijuana dispensaries.'",
        "'speaker_8': 'Now. God is the angels and. The host of heaven. Has assembled again tonight and is listening to this conversation, this meeting. And I worked for him. And when I'm not telling people about the Holy Spirit and Jesus and God and the mission, he's told me to argue, to defend, as if I were a police officer.'",
        "'speaker_8': 'The rights of the homeless. How can you. With a clear conscience. Continue to do this. How can you? The rains.'",
        "'speaker_2': 'Are here. You're hoping for more rain.'",
        "'speaker_8': 'You have a proposal that has been put on your desk as of January 2016. And your piece mealing that thing out. I want to congratulate you for the for the work that you are doing. But you're going to discuss spending $23 million again.'",
        "'speaker_8': 'And it would just take 1 million to clear your streets of the homeless. Martin Luther King said, I have a dream and we're living his dream tonight. Well, that plan that is on your desk. He gave it to me and he said, this is implementable.'",
        "'speaker_8': 'And he would ask you again, how can you discuss spending that kind of money when it would just take 1 million to get the homeless off the street?'",
        "'speaker_3': 'Thank you. Next speaker, please. Then this is our last speaker. The last two speakers kept out offering it back to the council.'",
        "'speaker_0': 'Thank you. Well, good evening. Diane Roche was trying to ask you about the Queen Mary Fund. That was $6.5 million in the budget previously for repairs. And I, too, would like to know, has that 6 million ever been spent or is this part of the 5 million that you're including in this?'",
        "'speaker_0': 'Money that you're going to give to add to the 23 million. How in the world have we allowed this ship to require $200 million worth of repair? Somebody has not been overseeing. The funds that were supposed to be spent on this in the past.'",
        "'speaker_0': 'And I can see. No. Reason to believe that this new lessee is going to do any better. Last year. He said he was going to do all these wonderful things for the Queen Mary if we just give them him the land.'",
        "'speaker_0': 'Then he gets an idea. He has a survey after his. I guess we haven't signed the lease, but. Urban Commons is now looked at it and said, Wow, I can't come up with $23 million to repair this ship.'",
        "'speaker_0': 'I would think if. He is made. If this company has made the obligation to get this lease. They should be responsible for the repairs. That was part of the lease. Now we're changing the lease. So that the city is responsible for these repairs.'",
        "'speaker_0': 'Another thing I had a question about last year was the inclusion of the park. Which is known as Queen Mary Events Park, but it's really Harry Bridges Park, which was mitigation for the park land taken from shoreline to build.'",
        "'speaker_0': 'The aquarium. This park last year was being included in the lease. I heard no mention tonight whether it was or not, and the public has never seen this lease. We've seen parts of it in the staff report. Have you seen the lease?'",
        "'speaker_0': 'Are you willing to have this lease be signed when you haven't even read it? I hope that you will at least put this over. If not 30 days. 15 days. So that somebody can.'",
        "'speaker_3': 'Thank you, Miss Cantrell.'",
        "'speaker_0': 'Reading the lease.'",
        "'speaker_3': 'Thank you. And our last speaker, please. Thank you.'",
        "'speaker_2': 'My name is Ramon. I'll be brief. I know that we got Iran. Got. He's got a quick fuze here. Um, I know. I don't mean like you're angry or anything. I mean, you got to get out of here.'",
        "'speaker_2': 'That's what I mean to say. Okay. I've been involved with government contracts for a long time, and this type of situation seems to be pretty normal for the city of Long Beach. And I'm not trying to criticize. I'm I'm in I've been involved with ambiguous situations quite often in my my job.'",
        "'speaker_2': 'And I understand sometimes things get out of hand. And I'd like to thank Councilwoman Mongo for making a great sacrifice and testing out some of the some of the facilities there. Getting her firsthand information. I'd like to. Congratulate Miss Price in in her concerns.'",
        "'speaker_2': 'I think it's it's pretty clear. One of the things that I'm worried about is that these people were evidently involved with the negotiations and they didn't involve the auditor. While they're doing that, there's something called concurrent, you know, working with people.'",
        "'speaker_2': 'And I get suspicious when people aren't working. They know the process. They're obviously there, but they're not getting all the people involved. And, um, we do know that we have a situation where we're going to be taking some of the revenue that we think that we're going to be making.'",
        "'speaker_2': 'And we're going to use it for the interest payments for the bonds that we're taking out. So you're actually I mean, all this stuff that you're doing, it costs money for it. So we're now losing more money to kind of front them.'",
        "'speaker_2': 'The, uh, the bonds that we're trying to do. And, you know, I understand this is a situation where here, but we also need to do some due diligence with $23 million, we can't just move forward. And the arguments that that my councilwoman in her great wisdom has made doesn't really hit you the root of the cause of'",
        "'speaker_2': 'why we can't do it. I don't know if if the subcontractor has actually given a date. Hey, look, we're going to suffer. We're going to die by if we don't do 30 days or if the auditor can actually work within a shorter timeframe.'",
        "'speaker_2': 'But something like that needs to be hopefully worked out. And I'm giving you 40 seconds there, Mr. York. That's it.'",
        "'speaker_3': 'Thank you. We're going to go to the last few speakers. We're going to get to get to a vote, please. Councilmember Pearce and Councilman Price.'",
        "'speaker_7': 'Yeah. I want to just one more time. Thank everybody for all your work on this and all the community comments. And I want to urge my council to go ahead and take a vote so we can move on.'",
        "'speaker_3': 'Councilman Price.'",
        "'speaker_10': 'Thank you. We do want to hear from Mr. GROSS because he took a seat over there and never got to be heard. So I would like to hear from him, but I also want to highlight that my comments have nothing to do with urban commons.'",
        "'speaker_10': 'I think we're headed in a great direction. I'm very much looking forward to the future. I am a little bit confused as to how we're there in this predicament where we're talking about the city having to be responsible for these repairs like tonight.'",
        "'speaker_10': 'Look at the vote has to happen tonight. It's just a discussion we've never had and certainly not something I was aware of. I think that any time your auditor expresses concerns, those with the fiduciary duty have to stop and ask themselves, you know, what, what they feel comfortable doing.'",
        "'speaker_10': 'And that's going to change with it. It's going to depend on each individual council member. So I appreciate that. But I would like to hear from Mr. GROSS on these financial plans that have been put before us.'",
        "'speaker_3': 'Mr. GROSS.'",
        "'speaker_2': 'Thank you. I think it is a I think it Councilwoman Price has raised a good issue that should always be raised when you issue bonds, what is what is the risk? And I'll try to try to address that.'",
        "'speaker_2': 'From our viewpoint, financial management's viewpoint. What we have is a situation where the lease provides for investment in a city asset, the Queen Mary, and repairs to the Queen Mary. Money flowing into that historic preservation fund. And the concept that we looked at was, okay, we have these urgent repairs and that money flowing over a number of'",
        "'speaker_2': 'years is not going to do those urgent repairs. Can we make a change? And what financial management did is it came up with using that stream of money. We can convert it to upfront cash of about $17 million.'",
        "'speaker_2': 'You add 5.8 million from the Queen Mary Reserves and you're at the $23 million to do those urgent repairs. And what is the risk and how did we do that? As as was said by both Mrs. McDermott and Mr. Modica, we are using a bond issue structure that pledges all tidelands funds.'",
        "'speaker_2': 'That's the typical way we do money to support land area projects. The aquarium is another example where we have pledged all tidelands monies, but we don't expect to use all Tidelands monies because there's rent being paid by the aquarium.'",
        "'speaker_2': 'In this case, we're moving the money from the H, from the historic preservation account to pay debt service. And that risk has been evaluated through the Economic Development Department and seems logical to be a very low risk that money will not be coming in.'",
        "'speaker_2': 'We, in addition, looked at the risk of, gee, what happens? We pledged $23 million, 17 of which comes from a bond issue. That's a $19 million bond issue. It yields about 17 million in cash. What's the risk of us having to pay urban commons and something goes wrong with the bond market temporarily?'",
        "'speaker_2': 'We would have to come up with cash at that time. We consider that risk to be so low as to not be a significant consideration. But we do have to say, if something goes wrong in that second type of risk, yes, we'd have to temporarily use reserves.'",
        "'speaker_2': 'And we believe that's not going to be an imposition, significant imposition on titans, because eventually, within whatever timeframe of the market stabilizes, six months, even a year, we would return the money to the fund and we don't think there'll be any significant damage overall.'",
        "'speaker_2': 'Yes, there is risk. We think the risk is either minute in the case of not being able to issue bonds timely or has been evaluated by economic development, financial management thinks that a valuation is reasonable. Evaluated by the department is a very low risk.'",
        "'speaker_10': 'I thank you for those comments, Mr. Ross. I wonder if that has any impact on the auditor or if there's anything further that the auditor would like to say. It would be nice if we were all on the same page moving forward, and if not, it would be nice if we took a pause to get on the'",
        "'speaker_10': 'same page.'",
        "'speaker_8': 'Yes. Thank you for all of the comments tonight. I think, you know, as the elected leader, I feel like I have a duty to express my concerns. My over arching concern is the to the over $200 million of infrastructure needs in the Queen Mary.'",
        "'speaker_8': 'And I don't think we should ignore the inevitable. It's a significant problem. I. I've been here with the city for over ten years. And these these are serious problems. The queen of this, Queen Mary, has a history with problems.'",
        "'speaker_8': 'And I feel like we need more than seven days to look at the documents that have been presented, to look at the analysis, to look at the risks, to look at the financing. To look and see how this $23 million investment fits into.'",
        "'speaker_8': 'A long term plan for the Queen Mary, its infrastructure needs and how it's going to be financed long term. I don't think we should ignore. Uh, the significance of the issues surrounding the ship. So. If the council would feel more comfortable with 14 days rather than 30, it would at least give us a little time, a little'",
        "'speaker_8': 'more time to to look at this. And we would work as quickly as possible and do as much due diligence as we could. But I really do think that in big picture long term strategy, we need to. Reconsider.'",
        "'speaker_10': 'Well, thank you for that. I do want to make a couple of comments in regards to Councilwoman Mangos. And, you know, anytime anyone raises an issue about something on the agenda, there's always someone who, you know, chimes in with this has been on the agenda.'",
        "'speaker_10': 'I don't know why anyone didn't prepare for it. You know, I read every staff report in my agenda and I read all ten pages of the staff report. And until I asked a few questions, I did not realize that committed Tidelands projects could be at risk.'",
        "'speaker_10': 'And that's where my concerns came. The ten pages here don't say anything about Tidelands projects that have already been committed being the source of a potential risk. So I did read the ten pages. I'm very mindful of when items come out on the agenda.'",
        "'speaker_10': 'I think I do a very good job of reading and preparing for my council meetings and I meet regularly with department heads. We have regular tidelands meetings. We have a briefing. We had a briefing that I wasn't able to be on today, but I meet with the city manager every week.'",
        "'speaker_10': 'I did not realize, and perhaps it's written in here and I missed it, although that's doubtful that Tidelands projects that are committed could be at risk. So I have a problem with that because like I mentioned a moment ago, unfortunately there is even though we work really hard to build collaborations and consensus, unfortunately there's an unnecessary.'",
        "'speaker_10': 'An inappropriate level of risk that already exists that I don't have control over in terms of projects that I've already committed to the constituents of the city. I can't I don't feel comfortable moving forward without and I understand the risk is low.'",
        "'speaker_10': 'But when the auditor is saying, you know, I need two weeks or a month to look at the numbers so that I can feel comfortable with it, I think that's very reasonable. And, you know, I'm asking my colleagues, I realize that this the tidelands revenue doesn't impact every district, but the the districts that it does impact involve'",
        "'speaker_10': 'people who work really hard on projects, just like projects in every other district. And just because we need to to have some sort of an insurance policy for a debt doesn't mean we start to put, you know, their projects that we've committed at risk of potentially if something were to happen that those projects are if we can'",
        "'speaker_10': 'guarantee right now that none of the projects that are impacted and I'm sure Councilwoman Pierce feels the same way, she doesn't want any of the projects that she's committed to her constituents to be attacked. And I would never, ever in a million years disrespect the people that have worked hard on those projects.'",
        "'speaker_10': 'So I think if we can have some sort of a commitment that those projects won't get impacted as part of this, and I'd feel a lot more comfortable with it. But either I completely missed it or we never discussed this being a potential risk when we approved all of the negotiations and the discussions that we as a'",
        "'speaker_10': 'council were privy to. So that's my concern is, yes, I do know when the agenda comes out and yes, I'm aware of the index. And yes, I did read the ten page report. It doesn't answer the questions.'",
        "'speaker_3': 'Thank you. Councilmember Turanga.'",
        "'speaker_2': 'Covered question.'",
        "'speaker_3': 'Okay. Questions been called. There is a motion on the floor by Councilmember Pearce and Councilmember Andrews. Please go and cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Long-Range Master Plan for the Long Beach Airport.": [
        "'speaker_3': 'Okay. Thank you. Next item we're going to hear is item number. I think it was 18. No, I'm sorry. We just heard 18. 27. Thank you. As we're getting up to the urban common guys, we're back there. I just want to thank you all for your commitment to this project.'",
        "'speaker_3': 'We look forward to being really strong partners over the next few years and many years ahead. And we'll look forward to the economic driver, which is going to be that development, but also that Carnival Cruise Line terminal, which we know is going to bring hundreds of thousands of passengers to the city to invest back into the city'",
        "'speaker_3': '. So thank you guys very much.'",
        "'speaker_0': 'Communication from Councilman Austin, Councilmember Super Now Council member Urunga recommendation to request the city manager to have the Long Beach Airport director work with the Airport Advisory Commission. Community members and airport stakeholders develop a long range masterplan for the Long Beach Airport.'",
        "'speaker_3': 'Thank you, Councilmember Austin.'",
        "'speaker_6': 'So thank you, Mr. Mayor. I want to thank my colleagues, Council Supernormal and Urunga, for signing on. There's been some misinformation and speculation in some of the press as to why this agenda item is before us here tonight.'",
        "'speaker_6': 'This is actually something that we have we first considered back in February of this year. So this is not a last minute tactic or or this this wasn't a short sighted agenda item. However, I've been concerned that it seems to when it comes to the Long Beach Airport, the city has been in a very reactive mode, responding'",
        "'speaker_6': 'to external pressures to pursue certain development objectives. There is not a clear, articulated vision of the direction where the city wants to see the airport going in the long term. And that has eroded confidence of many residents in impacted neighborhoods throughout the city that are truly looking at the interests of all the stakeholders when it comes to'",
        "'speaker_6': 'decisions affecting the airport. Most airports, whether they are large commercial airports or small general aviation airports, have airport master plans. The FAA described the goal of a master plan is providing guidelines for future development. Hurry back. So the FAA describes the goal of a master plan as providing guidelines for future airport development, which will satisfy aviation demand'",
        "'speaker_6': 'in a financially feasible manner, while at the same time resolving the aviation, environmental and social economic issues, the existing existing in the community. The FAA guidelines also state that each master plan study must focus on specific needs of the airport for which a plan is being prepared, and the scope of the study must be tailored to the'",
        "'speaker_6': 'individual airport. Therefore, in a given study, certain master planning elements may be emphasized, while others may not be considered at all. Clearly, with the Long Beach Airport, the driving factor in any plan must be protecting our airport noise ordinance.'",
        "'speaker_6': 'And with the long range plan that involves, it incorporates the views of the stakeholders to the airport, which not only involves airport users and businesses, but residents and communities in several council districts. We can articulate a vision that inspires confidence and provides an appropriate balance between the community, passengers, environmental and economic interests.'",
        "'speaker_6': 'However, I do recognize that not everyone has had the opportunity to fully invest the gate and the concept of a master plan. And so I'd like to ask my colleagues to support a revised motion to to the agenda item, which is to request the city manager report back to the City Council within 30 days on the process'",
        "'speaker_6': 'involved. Potential scope and the pros and cons of developing a long range master plan for the Long Beach Airport. And I would ask for my my colleagues support on that.'",
        "'speaker_3': 'Sorry, I Brosnan just wrapped up. And is it now controversy? Controversial product. You want to comment on the second or.'",
        "'speaker_5': 'I'm fine. I think the motion and I don't want to speak for my colleague because he's right here. But the intention is this all came at us very quickly and we had very quick briefings on this. So if the intention is to get an official response from city staff, I support that.'",
        "'speaker_3': 'Councilwoman Price.'",
        "'speaker_10': 'Thank you. So just to clarify, this isn't going to delay at all the process that we're going through with the FISA. My understanding is based on this motion.'",
        "'speaker_6': 'Well, doesn't mention anything about FISA.'",
        "'speaker_10': 'Okay. So that that process is unrelated to this and this issue. This request is just for a report that will outline what the process is, what a master plan is, what it could include, and the pros and cons.'",
        "'speaker_10': 'So it'd be a comprehensive look at what it would look like to enter that process.'",
        "'speaker_8': 'Basically. Is that your.'",
        "'speaker_10': 'Understanding, your your intent? Okay. Great. Thank you.'",
        "'speaker_3': 'Councilwoman Pierce.'",
        "'speaker_7': 'Yes. I had one question about Alps and how they might relate to master plans.'",
        "'speaker_2': 'I mentioned that over to our airport director, Jess Romo. Yes, Councilwoman. Just remove from Long Beach Airport. An Al Port Airport layout plan is a document that the airport, each airport has to maintain and update based on changes that occur from time to time at an airport.'",
        "'speaker_2': 'As an example, Long Beach Airport has a submission in with the regional FAA office, currently as part of the decommissioning of the two North-South runways. In essence, an Al Pea is a very abbreviated version of a master plan.'",
        "'speaker_2': 'It is not a full blown or a comprehensive master plan, but it is it is considered an alternative to a master plan.'",
        "'speaker_7': 'And can you also elaborate on how land use elements might complement that?'",
        "'speaker_2': 'Yeah. Well, as relates to land use, two elements are contained in an LP. Those are considerations. Long Beach Airport as part of the city's general plan. My understanding is that because it's within the city limits, general land uses specifically with zoning have been considered as part of the city's general plan.'",
        "'speaker_2': 'A companion piece, separate but parallel, is the county's Airport Land Use Commission, which looks specifically at land uses and around airports. And that is also something that has been done over the years for Long Beach Airport, specifically as it relates to zoning, as it relates to the terminal concourse improvements that were recently done, as well as the'",
        "'speaker_2': 'two business parks that are adjacent, that are that are actually part of the airport property.'",
        "'speaker_7': 'Great. Thank you so much.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_7': 'I'm going to ask my colleagues to support a received file of this item tonight. If I could get the button to make a new motion, a substitute motion. Over my term with several different airport directors in several meetings with business associations and aviation community and the new community at Douglas Park.'",
        "'speaker_7': 'I think that what I have learned, especially in discussions with neighborhood associations, is that our number one priority is protecting the noise ordinance. Airport director, would you state for us a little bit of your background and information related to master plans at airports that you've experienced?'",
        "'speaker_7': 'I know we've discussed when that started in I think it was 1996 and another one that started after that and the amount they cost and how long they take and that truly that would actually be a greater threat to our noise ordinance than anything else.'",
        "'speaker_2': 'Well, I can speak to, you know, first and foremost, my experience. I'm approaching my 19th year as an airport professional. You know, before coming here to Long Beach, I spent that time with L.A. World airports in a various number of positions, including airport manager for both Ontario and Van Nuys airports.'",
        "'speaker_2': 'Van Nuys Airport did complete a master plan that started in 1992 and was completed in 2006. I chose essentially a 14 year endeavor. The focus was land use, but it was called a master plan. The bulk of the work was done internal.'",
        "'speaker_2': 'So was both city planning staff as well as airport staff. So I don't have a specific number, but I can tell you that it was with a lot of resource support that went into producing and finalizing that document.'",
        "'speaker_2': 'More recently, even though it's still been a while, Ontario Airport initiated a master plan in 2001 over a four year period. The city of Los Angeles, L.A. World Airport, spent $2 million on that effort. That that effort stopped after 2005, with the new director coming on board in 2007.'",
        "'speaker_2': 'She made the decision that it was not the time to complete the master plan. So it has been shelved, practically speaking. But knowing that the airport is under a new authority as of today, actually, they may reinitiated. But to your to your question, in both cases, one, it was a 14 year effort.'",
        "'speaker_2': 'In the second case, it was something that lasted four years and cost $2 million.'",
        "'speaker_7': 'And would you speak to whether or not you personally believe we would be at greater risk should we pursue a master plan?'",
        "'speaker_2': 'With my understanding of master plans and what they are and what they're intended to achieve in primarily master plans, corporate comprehensive master plans. By definition, are either when you are planning to develop an airport or if you've got an airport where you are contemplating adding capacity.'",
        "'speaker_2': 'Those would be the primary times that you would want to do a full blown master plan. So in that regard, if you're going to explore the ten elements that make up a master plan, including airport capacity, in my opinion that does elevate the level of risk.'",
        "'speaker_2': 'I'd probably defer to the city attorney on what that amount might be, but I think that it is fair to say that you you would be elevating the risk.'",
        "'speaker_7': 'And I know that I stand with some of my colleagues in that the number one priority is not to expand aviation at the airport, but to maintain the balance that we have today and the quality of life that we have for our neighbors, that that is a high priority.'",
        "'speaker_7': 'I know that while there have been discussions of distribution of those flights across other runways, that's not something that I'm interested in exploring. I think that we have done a lot of research related to the pavement and the investments that have been put in, both by the federal government and others that have put the airport in a'",
        "'speaker_7': 'position where we're able to protect the noise ordinance and that we're able to monitor and protect those buckets. And so at this time, in an effort to protect our neighbors and ensure that we do not increase the risk to the noise ordinance, I would like to receive and file I have shared with my colleagues, including Councilmember Austin'",
        "'speaker_7': ', my intent for a more broad East Side plan that could consider transportation and all the other components that allow for economic development without expansion of flights. But I feel that at this time this has not been on The Matrix for eight weeks.'",
        "'speaker_7': 'This was added on the supplemental agenda. I know that at previous meetings Councilmember Austin specifically stated that he was not favorable of Councilmember Pearce's addition of items on the supplemental agenda. And I, I think that this is a significantly similar and if there are differences, I apologize that I don't know them.'",
        "'speaker_7': 'But I wished that a partnership could have been formed to move forward on this from a more holistic approach as it is in the fifth District. And I've worked with the Douglas Park planners, I know what's coming down the pipeline, I've worked with the Spring Street Business Association, I've worked with South of Kona and Art Craft Manor'",
        "'speaker_7': 'and Lakewood Village and a lot of the neighborhoods on the side. And I would look forward to the opportunity to partner and work with the other neighborhood associations as well. But I am not ready to take this on at this time because of the additional risk and until we have some clear scoping on what we would want'",
        "'speaker_7': 'the city to bring back to us, then I think that that's not enough direction. So I'm open to what Councilmember Austin proposed, if it had a scope that I think maybe we could discuss or. Get some feedback from the Airport Advisory Commission on what that scope would look like.'",
        "'speaker_7': 'But I think that that the city needs proper scoping. And and this is not to be disrespectful to the city staff, but we have far too many report backs that have not come back timely. And I'm not looking to add any more that would delay the ones that we've already committed to.'",
        "'speaker_7': 'I really would like to see those return as there are certain components of some of those, including the Internet and the infrastructure and others of economic development that I think are a factor in this. And I've been waiting for those and I know that I'm working with Brian Stokes of it, but I think that some of those'",
        "'speaker_7': 'are really crucial in scoping what we want to do at the airport. So I hope my colleagues will support a received file and that it doesn't need to come back in 30 days. But we could revive a new a completely new and different item that has all of the proper elements when the time is right.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'Councilmember Austin.'",
        "'speaker_6': 'Thank you very much. And I just want to address she said a lot, a whole lot there. And I don't think it was all accurate or nor did it accurately reflect my my intentions here. And so, Ms.. McGill, I'm going to restate the motion.'",
        "'speaker_6': 'It was the request of the city manager report back to the city council within 30 days on a process involved. Potential scope in the pros and cons of developing a long range masterplan for Long Beach Airport. That in no way puts our airport noise ordinance in jeopardy.'",
        "'speaker_6': 'And that is absolutely the last thing that is on my agenda or that I would want to do as I live under the flight path that represent thousands of residents who also live under the flight path of Long Beach Airport.'",
        "'speaker_6': 'I would also also just just just like everyone to to understand that I certainly would have included Councilmember Mongo in the this item. However, you were you were absent for three weeks in a row. And so there was not a lot of opportunity to have conversation with you during that period of time and that the airport is'",
        "'speaker_6': 'a citywide resource. When we were talking about redoing the Civic Center, we're talking about doing anything major here. It requires nine votes in every one of these council members are engaged and and respected and brought to the table and engaged in the process.'",
        "'speaker_6': 'This is not a fifth District asset, and I want to be very clear on that. And so. We this is something that and again, the the intent here is to help us articulate a vision, but more importantly, bringing all of the stakeholders to the table, including the community.'",
        "'speaker_6': 'Right. We represent and we are elected by residents of the city. And I've heard on many occasions from individuals who say, well, you know, there are people who bought their homes next to the airport or underneath the flight path.'",
        "'speaker_6': 'And what is. Well, nobody knows what to expect because we don't have a long way to play it. We don't have a long range visit. We do have an ordinance which is very, very important. And I think that is the Holy Grail.'",
        "'speaker_6': 'And if we were to pursue a master plan, I think that should be on the first page of the master plan in terms of our intention, the city. Mr. Romo, you talked about master plans that that seek to expand capacity.'",
        "'speaker_6': 'I can tell you that I would not be in favor of any sort of master plan that would seek to expand flight capacity at Long Beach Airport, because that, too, would be counter to our airport noise ordinance. And so I'm looking at a document right here that says that.'",
        "'speaker_6': 'And I got to reference this document, but it's pretty voluminous. It's. But but it says that there's a great deal of flexibility for for airports that go into scoping their their master plans. And I would imagine that any master plan moving forward, should we go down that route, because what we're asking for and what's only before us'",
        "'speaker_6': 'this evening doesn't even go there. But should we do go that route? I can imagine that that, this, this. And since everybody here says that they support our noise ordinance, I wouldn't imagine that anybody would do anything to to to suggest we should expand our capacity or jeopardize the noise ordinance.'",
        "'speaker_6': 'And so, members, I would ask that you reject the receiving file motion and support the original motion, because it is a common sense approach. It's a responsible approach to to looking forward and including all stakeholders in the airport process, planning process.'",
        "'speaker_3': 'A controversial panel.'",
        "'speaker_5': 'Yeah. And thank you for that clarification. I think we know where council member Austin wants to go with this. It's it's not going to a master plan. It's asking for a report back from city staff. I think Councilmember Mongo kind of made the point in that this was rushed.'",
        "'speaker_5': 'We had. And kudos to our airport director. He's new yet he was able to get an opinion back to us over a weekend, basically. So I think all we're saying is, let's give him a little more time. Let's get a more thorough report back to see the merits of this.'",
        "'speaker_5': 'And maybe we're hung up on the terminology of a master plan. Maybe that's something some type of a hybrid that we need moving forward just to let it go. I think some of this was triggered by the fact that we sat here in these council chambers a week ago and we heard the consultant deliver back and economic'",
        "'speaker_5': 'feasibility report that did not isolate the city of Long Beach. What we have here is a failure to communicate. So I'm thinking that that kind of triggers the fact that we need to get our act together on the city side here a little bit before spending $350,000 on a consultant's report.'",
        "'speaker_5': 'I can't speak if that was the motivation for Councilmember Austin, but it sure made me think about how exactly are we directing this consultant before we spend money on this? So what I'd like to do is just respectfully ask Councilmember Mongeau to withdraw her motion and move forward on the 30 day plan.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_7': 'Councilmember Austin, would you be open to 60 days?'",
        "'speaker_6': 'Why? 60 days?'",
        "'speaker_7': 'Well. E The specific question that was asked was whether or not. It would create a greater risk. And our airport director has already stated that it has. And so if we're going to do something bigger and greater than that, there's a lot on our plate on the east side and a lot of other report backs that are'",
        "'speaker_7': 'coming within the next 30 days that I think are crucial. Specifically, I'm to two of the items that Councilmember Gonzalez and I brought forward that I think can create an impact on the overall plan of Eastside. And I understand that part of the question is whether or not it hurts the noise ordinance, but I think that he's'",
        "'speaker_7': 'clearly stated that. And so for a more comprehensive report, I would like to have those two other reports back. And if that was possible that they could be considered, then I think that that would give another to get us up to either 45 or 60 days and just mindful that many of the reports we've asked back in'",
        "'speaker_7': 'either 30 or 60 or 90 days have not come back timely. So maybe we would just pick a date certain that we would get an I'm asking we're doing a two from four from the city staff or you're asking for it to come back to council?'",
        "'speaker_6': 'Well, I was asking for a report back and a report back can come in either way. Okay. Secondly, I think you're making up facts because I didn't hear him say that this is going to create a significant risk.'",
        "'speaker_6': 'He said that if we move forward with expanding capacity, air capacity at our in our airport, it would create a significant risk and so on. That point would building. I'll just ask a question to the airport director since we're on the question of risk, does this building infrastructure at our our airport infrastructure capacity to airport expose us'",
        "'speaker_6': 'to risk as well?'",
        "'speaker_2': 'Well, the general term infrastructure, whether you're talking about something on the airfield.'",
        "'speaker_6': 'Versus terminal.'",
        "'speaker_2': 'Terminals, you know, I think any time you are looking at changes, there's always going to be some risk that that will come up again. As I said, with with a master plan, I'm not going to speculate in terms of the amount of risk.'",
        "'speaker_2': 'But I think that any time there's a change, you know, as a city, you have to manage that and acknowledge that that, you know, there is risk there. There's risk there if we do nothing.'",
        "'speaker_6': 'I appreciate. And and so the request is what I would accept a friendly amendment to to do 60 days. I would the question is to the airport director, can you get this back to us within 30 days?'",
        "'speaker_2': 'Well, my preference would be to have more time so that it's a thoughtful document and I'm not trying to fish for a longer period. But I think something, you know, in between maybe 45 days would make sure that we get the council back, something that's thoughtful and thought out.'",
        "'speaker_6': 'I could accept 45 days.'",
        "'speaker_7': 'I can accept 45 days. Thank you.'",
        "'speaker_3': 'Okay. That's good. Look, before we move on to the rest of the council, do you want to continue to go to the public first? Okay. Can we please go to the public for public comment?'",
        "'speaker_11': 'Good evening, Mayor and Council Members Ray Garbage District eight. When this first came to my attention, I over the weekend I connected with two area airport managers. And it was interesting because both of them were on opposite sides of their position on this.'",
        "'speaker_11': 'And one of them said that your noise ordinance is your master plan. It controls what's going on at the airport. He also said that if you do do a master plan, you're going to have regional, state and federal attention looking at you.'",
        "'speaker_11': 'And the very first thing that you do in a master plan is determine capacity. Our airport can build a very large terminal on both the east side and on the north side. We have lots of property. Would that be a demand?'",
        "'speaker_11': 'I am not sure the FAA would be watching as well. The other points that he made were, after all the years of the litigation that you went through to discover environmental capacity, the footprints that we have equate to our noise limits.'",
        "'speaker_11': 'He also said that while while this would be ongoing, there are other issues that we should be concerned about. And one of them is there is a environmental justice lawsuit at L.A.X. in the poorer communities. And in that litigation they're talking about, why isn't John Wayne in Long Beach taking more of their share?'",
        "'speaker_11': 'And then you look at the Scaggs travel documents and they are forecasting and they recognize in their document that we could handle we have a noise ordinance, but we should be able to handle 5 million passengers. That's a 50% increase of what we do today.'",
        "'speaker_11': 'So there's that side and then there's the other side of, oh, no, you know, the more study, the better. But but the other person said to me that an office facility would have to be part of the master plan.'",
        "'speaker_11': 'And there I think there's going to be other people here, I think, to talk about the next gen situation that's going to begin, I believe, in the middle of November and it's going to the third phase of it is going to come in in March.'",
        "'speaker_11': 'And there are cities on both sides of us that are suing. There are cities on the East Coast, the state of Phenix, Los Angeles, Culver City, that are suing because the noise has been expanded. And if you read what our former airport manager says when he wrote about next gen, his concern was that the flight patterns are'",
        "'speaker_11': 'going to impact larger areas of the seventh and the eighth District, but they're also going to impact the east side and the southeast side. So I think there's a lot to be considered. And if the master plan is something that you're going to go forward with, the office absolutely has to be a part of that.'",
        "'speaker_11': 'I know that's what you asked, Suzy. And and I think that maybe that was the wrong answer that you received. And, Daryl, what you said about they didn't really give anything specific to Long Beach. That was one of the tasks that they were assigned at 3.4.1, they were to give you quantify the economic impact to the city'",
        "'speaker_11': 'and the local regional economy related to an FAA facility. So they didn't complete their job. They didn't do what they were asked to do. So I'd like to see that go back to them before you make any further decisions.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'My name is run in fifth District. I support Al Austin and Darryl Soup Supernova and Iran guy who's not here, but he's got a short fuze somewhere down the line. Just joking. I understand Stacy's concerns about the airport.'",
        "'speaker_2': 'As a District five resident, I've tried and tried and tried to ask a number of questions through my own district office. And I've had a lot of difficulty getting many of the same information that she says that she has to us to give it out to the residents.'",
        "'speaker_2': 'I can't get it. We've demanded meetings. We've tried everything we can do regarding the airport and we haven't gotten anything. If the only way we can get information out to the residents is to get a report or something like that, I think it's fine.'",
        "'speaker_2': 'I come out of the aerospace industry and I understand what people are saying, Oh, it's so difficult. But there's never been a project that I've ever been on and I've been on projects that are larger than than the budget in the city that were.'",
        "'speaker_2': 'I can't figure out how to solve and get a report back to me in a fashion that I want that will be in a way that will be risk, which will remove the risk that we have our concerns.'",
        "'speaker_2': 'We can do it. I know Romo is an intelligent guy. He can do it. I know he can. It's not hard, but all we're doing is asking for a report from our city manager. You know, it's just can we do it?'",
        "'speaker_2': 'Why do we need to have done. It's not a it's not rocket science. You know, what do we need? What are the elements? That's it. You know, we got a report from Jacobs. I used to work for Jacobs, and I'm telling you, it was insufficient that this is for Long Beach.'",
        "'speaker_2': 'We're spending $300,000 of taxpayer money for this thing. And that was garbage. And I'm not I'm not saying that that's bad. But we got a guy who comes from JetBlue. He goes to two different meetings and he's giving false information to both people, to both meetings.'",
        "'speaker_2': 'I got his name up already reported in to the executives in the company. He's going to be gone. I mean, these are things that are happening. We're seeing all this stuff. People running around. Residents don't have confidence in the way that this is being handled.'",
        "'speaker_2': 'We're trying to get information and we're not getting it. And no matter what we do, there's a lot of misinformation, people connecting the noise ordinance to the to the this report. Yes. And I understand it's not there. You know, there's no connection right now.'",
        "'speaker_2': 'So but we need to get information to us. And this is a minimal standard that we have to ask for. You know, I'm looking through all of the numbers that Jacobs has. I'm an expert in this type of stuff.'",
        "'speaker_2': 'And I'm telling you, there's no backup information for the hard figures that we got. And I'm trying to figure out where they got him. And all I got is a computer program that they're relying on that we have no idea how it works.'",
        "'speaker_2': 'And this is a problem that I have. I'm sorry. I got a little emotional. I didn't mean to do that.'",
        "'speaker_3': 'It's okay. Thank you. Thank you, sir. Councilman Mongo.'",
        "'speaker_7': 'Just to follow up on what Ramon had mentioned, we're so fortunate in the fifth district to have an expert in pavement management and aviation and soccer living in our own district. So Mr. Ramon has received every report that we have available and there just aren't some reports because they have not been requested or commissioned by the city'",
        "'speaker_7': '. And so while I appreciate that he wants more information, we've provided everything that we are available to provide.'",
        "'speaker_3': 'Thank you. Continuing public comment. Yes.'",
        "'speaker_8': 'Hi, how are you? Laurie Smith.'",
        "'speaker_7': 'Uh, district.'",
        "'speaker_8': 'Three. I've talked to you guys about this before, but I just want to talk about what you guys had mentioned about elevating the risk to our noise ordinance and also what airport director Romo had mentioned that, um, the risk is that we, that we do nothing as well, is there.'",
        "'speaker_8': 'So I do want to mention again, as I read to you last year.'",
        "'speaker_7': 'Former airport director Bryant Francis had sent a letter to the FAA regarding his concerns about how it's going to adversely.'",
        "'speaker_8': 'Affect our noise ordinance. And these these new procedures are going.'",
        "'speaker_7': 'To be affecting us beginning November 10th is.'",
        "'speaker_8': 'Phase one.'",
        "'speaker_7': 'March 2nd is phase two and April 27th is phase three. And last week the Culver City and Newport Beach City Councils were so concerned that they filed lawsuits to block the FAA metroplex.'",
        "'speaker_8': 'And so, you know, I'm just.'",
        "'speaker_7': 'Looking for you as our elected officials.'",
        "'speaker_8': 'To support us, your constituents in our quality of life. So here's here's some things that Bryant.'",
        "'speaker_7': 'Francis had sent.'",
        "'speaker_8': 'In his letter to the FAA regarding the.'",
        "'speaker_7': 'Metroplex Metroplex, which is going to be affecting everything in the Southern California area, that he believes that the FAA has.'",
        "'speaker_8': 'Not given appropriate consideration.'",
        "'speaker_7': 'To the reduction of environmental impacts, particularly noise and developing the airspace proposals presented, and that as a result, the proposals do not meet the goals.'",
        "'speaker_8': 'That Congress had defined for it.'",
        "'speaker_7': 'He further goes on to say that he has some concerns with regards to how these changes could impact.'",
        "'speaker_8': 'Citizens and communities near airport. He further goes on to say that it will neither. That it could jeopardize or preclude the ability of the air carriers and general aviation community from utilizing procedures and complying with the city's noise limits.'",
        "'speaker_8': 'So airport director Romo had mentioned that there is a risk that we do nothing. And that's what I'm sorry to say that the city council has done with regards to taking into account the FAA metroplex that's going to be affecting us.'",
        "'speaker_8': 'It's not just this airport, it's the other airports. So in that time, the city government which manages the airport, has allowed us to move forward with nine supplemental slots and now a feasibility study. And it seems to be that the sole wants to be done before the FAA metroplex comes down on the residents.'",
        "'speaker_8': 'And it's a little concerning that that that seems to be what city.'",
        "'speaker_7': 'Government has been looking to do is push this through before we all get affected by.'",
        "'speaker_8': 'By heavy noise impacts. So I just like to also know if.'",
        "'speaker_3': 'You take your time I'm sorry, time is up.'",
        "'speaker_8': 'If airport rama if we've gotten a response back from the FAA, from the airport director, I just would like to know if we have a response back and if this is something that is is able to be given to your constituents.'",
        "'speaker_8': 'Thank you so much.'",
        "'speaker_3': 'Thank you very much for coming. Time is up. And Mr. West, maybe we can follow up on that last question. Okay. Thank you, Mr. Soto.'",
        "'speaker_2': 'Joe. So, Mr. Mayor and city council members Joe Soto, Mr. Airport Manager, there's a.'",
        "'speaker_9': 'Meeting tomorrow in Orange County.'",
        "'speaker_2': 'It's a NexGen meeting.'",
        "'speaker_9': 'In Orange County, one of our local high schools. So we were wondering if you were going to attend that meeting.'",
        "'speaker_2': 'Or if you knew about it. I guess you don't answer back, but that's I want to put that out of. Thank you.'",
        "'speaker_3': 'Carney I see no other public comment. Public comments closed back to the council. Councilman Pearce.'",
        "'speaker_7': 'Thank you. I just wanted to say, you know, I think giving this 45 days something I support and wanted to see if we can make sure we include in that report things that are already tied to similar things as a master plan, as we discussed earlier, and what the timeline of a master plan would be, what the'",
        "'speaker_7': 'cost of a master plan would be.'",
        "'speaker_0': 'And that would be it.'",
        "'speaker_7': 'So I support, you know, Councilmember Mungo's substitute motion. So.'",
        "'speaker_3': 'Councilman. Councilman Austin.'",
        "'speaker_6': 'So I don't believe that was a substitute motion. It was a friendly amendment. Is that correct?'",
        "'speaker_7': 'Yes. I requested to remove my substitute motion and and Fred instead made a friendly that Councilmember Austin accepted. Yes. Sorry, but it's still on the board under the previous.'",
        "'speaker_3': 'So we'll fix that on the board. The motion is Councilmember Austin's 45 day motion.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Councilman Roston. Anything else? Nope. Councilman Mongo.'",
        "'speaker_7': 'No further questions.'",
        "'speaker_3': 'Okay. There is a there is a motion in a second on the floor. It's not yet up on the board. If I. Right now, there's. No it was. It was. It was. It was. Yeah. Okay. It's recorded. Okay.'",
        "'speaker_3': 'Members was going to cast your votes.'",
        "'speaker_0': 'Ocean carries.'",
        "'speaker_3': 'Okay. Thank you. Now we're going back to a presentation that we had earlier that we didn't get to, and that is going to be the presentation, I believe, from gas and oil. And I think Mr. West was going to start off by saying something.'"
    ],
    "Alcoholic Beverage Control License Application for American Petroleum Corporation.": [
        "'speaker_3': 'Very much. Thank you all again. Next item, we're going to go back on the consent calendar. We pulled one of the items, one of the numbers off consent we believe was number eight. So and just as a reminder, also, item number six was taken off the consent calendar, which I mentioned.'",
        "'speaker_3': 'So now this is item eight, which we pull off the consent, if we can read that item.'",
        "'speaker_0': 'Communication from police recommendation to determine the application serves the public convenience and necessity and receive and file the application of American Petroleum Corporation for an original application of an Alcoholic Beverage Control License. District one.'",
        "'speaker_3': 'Okay. And I'm going to turn this over to Councilman Pearce, who's going to speak on behalf of Constable Gonzales.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'On behalf of Councilwoman Gonzales, who couldn't be here tonight, I'd like to make the following motion. I move that we find the original application of an ABC license by American Petroleum Corp. DBA Pacific.'",
        "'speaker_7': 'Union 76.'",
        "'speaker_0': 'Located at 1410. West Pacific Coast Highway does not meet the public convenience and necessity.'",
        "'speaker_7': 'And protest the issuance of the ABC license on the basis of overconcentration.'",
        "'speaker_8': 'So yes.'",
        "'speaker_0': 'That's it. As for your support.'",
        "'speaker_3': 'If I may have an opportunity to speak, I'm representative.'",
        "'speaker_2': 'Public comment.'",
        "'speaker_1': 'Now. Okay, you can go. Come on up.'",
        "'speaker_3': 'Thank you very much, Councilwoman Andrews. I'm the applicant's representative. My name is Michael Pauls. I understand that the speaker card is not appropriate in my business. Stressed to 6475 East Pacific Coast Highway. I number 135 in the city of Long Beach.'",
        "'speaker_3': 'We've have been going forward with this process for over a year. We had contacted the counsel office. We had an opportunity. We'd worked with planning with Jorge Ramirez.'",
        "'speaker_2': 'Officer Barajas.'",
        "'speaker_3': 'This is a long time business owner in the city of Long Beach who is being forced to make this change. He has operated a minor automotive service repair garage, which was so common with these types of gas stations over the years.'",
        "'speaker_3': 'But because of the sophistication of business of vehicles these days, he's being forced to close that enterprise and open up a convenience market. He wishes to move forward with a a national brand franchise, which was the wish of the Planning Commission.'",
        "'speaker_3': 'A national brand franchise is contributing money toward his business. This is an over $750,000 development, and without the national franchise, it becomes very difficult to secure the necessary financing. We're in plan check at this point in time, we spend a substantial amount of money on the project.'",
        "'speaker_3': 'The beer and wine sales is significantly restricted at this site, and we were in agreement. It's 8:00 in the morning until 10:00 in the evening with no single sales, two cooler doors. It is simply just a placeholder with which to be able to secure a franchise which will be able to keep the business open.'",
        "'speaker_3': 'He needs this to remain competitive. Other businesses in the area also have beer and wine sales, which are unregulated with respect to the types of product and that they sell. And what I would simply ask this this census tract, by the way, has no residents.'",
        "'speaker_3': 'So any any any business who wants to establish alcohol in the census tract would have to come before this body for a letter of necessity and can being its or caldara. Finding the census tract in the daytime has a huge population regarding all the people that work there from 8:00 in the morning until 5:00 in the afternoon'",
        "'speaker_3': 'or the various hours in which they do work. So Alcoholic Beverage Control does recognize that, and they recognize the issue that we're having. What we would like to do is and we would like to ask and I realize the Councilmember, Lena Gonzalez, had asked you to speak on her behalf because she's not here this evening.'",
        "'speaker_3': 'And we reached out to her office. But we would like to ask if this item could be continued so that we may have an opportunity to speak to Ms.. Gonzalez, Councilwoman Gonzalez, and to be able to dialog with her regarding the importance and the restrictions and responsibilities that this business owner, who again, has been a business owner'",
        "'speaker_3': 'in this community for over ten years, would would would like to share with the councilwoman. So if at all possible, and we ask you to please assist this business man to simply provide us an additional 30 days, an additional two weeks, whatever the council deems fit, so that we might be able to reach out to the councilwoman'",
        "'speaker_3': ', her staff, and let her understand that that we are not trying to impact this community in a negative fashion at all. So we thank you very much.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_0': 'Much to the man. So I have a few notes I just want to share.'",
        "'speaker_7': 'I know that the councilwoman met with the business roughly around a year ago and her concerns are that there's overconcentration that there are four approved ABC licenses in the area which should have none. That there's future development. The gas station sits next to a lot that's undergoing review by Counsel Office for Future Activation.'",
        "'speaker_7': 'And the reason why this item cannot be delayed is that all responses for the application must be received by.'",
        "'speaker_0': 'November 10th, and our next.'",
        "'speaker_7': 'Council meeting is not until the 15th. Also, in reference to the census track, I understand there's about 100 residents in that census tract, but there are several that are 300 feet away. There are no schools or residences within a reportable 600 feet.'",
        "'speaker_7': 'However, Cabrillo High School is half a mile and there are residents less than 300 feet. And so being that this is Councilmember Gonzalez is item and she's request council to deny it. I'm going to support her in that.'",
        "'speaker_7': 'And I ask.'",
        "'speaker_0': 'That.'",
        "'speaker_7': 'Other council members do the same.'",
        "'speaker_3': 'Thank you. May I have the opportunity to respond to some of that?'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'You know, you can't. No. There was no information that was provided.'",
        "'speaker_2': 'So we'll just have to wait until you like to see. We have to go into any more public comment. But you've had your 3 minutes to.'",
        "'speaker_3': 'Mr. Andrews. Thank you, sir. Appreciate that very.'",
        "'speaker_2': 'Much. Yes, thank you. Any more public comments on this item? You don't. You. Don't you speak. Don't you not? Okay, fine. We'll kick off the motion, please.'",
        "'speaker_0': 'Councilman.'",
        "'speaker_2': 'Oh, yes.'",
        "'speaker_1': 'I mean. Yes.'",
        "'speaker_0': 'Okay. Bush and Kerry's.'"
    ],
    "Contract with Brel & Kjaer EMS for Airport Noise and Operations Monitoring System.": [
        "'speaker_0': 'Motion carries. Next Item 22 Report from Long Beach Airport Recommendation to adopt resolution to execute a contract with Berlin Care EMS for the maintenance upgrade and support of the Long Beach Noise and Operations Monitoring System for total amount not to exceed $880,000 for the proposed three year term District five.'",
        "'speaker_3': 'I think you want to take your motion off. Okay. Okay. I will get in your motion in a second on that. Okay. Can I get a second on that, please? Give us a motion or take any public comment saying none, please.'",
        "'speaker_3': 'We do. Yes, actually. So let me go to Councilman Superhot and then we're going to go to our public comment.'",
        "'speaker_5': 'Councilmember Thank you. This is kind of a housekeeping item. I'd like to address just the language in this item. It's listed as a District five item. And generally speaking, this kind of perpetuates perpetuates the philosophy that the airport is a District five entity when it affects our entire city.'",
        "'speaker_5': 'This specifically involves noise monitors, which are located in districts three, five, four, seven and eight. So I just like the language of this item to be changed to reflect all five council districts.'",
        "'speaker_3': 'Mr. WEST Yes, we certainly will do that. Okay. Thank you. Councilmember Austin.'",
        "'speaker_6': 'I think I second that motion.'",
        "'speaker_3': 'Okay. Councilman Mongo.'",
        "'speaker_7': 'I would not only like it to be reflected in this, but in future noise related items.'",
        "'speaker_3': 'Thank you. Thank you. Any public comment on this? I think there was one. Yes, please.'",
        "'speaker_8': 'Hi again. Laurie Smith, Third District. This I just want to be clear, this also is regarding the web track. Okay. As a Ron Reeves. The noise or the noise?'",
        "'speaker_1': 'Guru.'",
        "'speaker_8': 'Guru. Buddha. The Buddha that that deals with her constituents concerns and issues and keeps us updated on things. He gets a lot of emails from those of us who use web track. We're not exactly.'",
        "'speaker_7': 'Pleased with their service. So I was just talking to.'",
        "'speaker_8': 'To one of the staffers of the councilman. I just want it to be built in that there is a way that the community who uses this service could.'",
        "'speaker_7': 'Be able to interact with them rather than it be Ron Reeves and take up his.'",
        "'speaker_8': 'Time. We've asked for contact information from them and be able to speak to them because there's wide.'",
        "'speaker_7': 'Swaths of sways swathes of.'",
        "'speaker_8': 'Information that are missing. And when you look at a Web track website, they also provide the information for Alex Torrance. You can go to any of them. It's very easy to do on their website. And it's funny because our airport, our Long Beach Airport Web track system misses all the information.'",
        "'speaker_8': 'But if you go to the other airports, you could see it there. So it's it's been something that's going on for a year that we've been talking to them about. Unfortunately, the person that we were speaking to before is no longer there.'",
        "'speaker_8': 'So I don't have a new contact person. It's just a little frustrating when it's the constituents or people that that are that they're providing the service for so that we could be able to get to get the information if there's people that are not flying correctly or flying too low or dangerously over the neighborhood.'",
        "'speaker_8': 'So I would just ask that we be able to to put that in to.'",
        "'speaker_7': 'The contract that they provide.'",
        "'speaker_8': 'That or have a community outreach person or have bi monthly or quarterly meetings that they meet with with community members to look into.'",
        "'speaker_7': 'Issues that we're having with their system.'",
        "'speaker_8': 'Considering that they provide the service to all the other airports. And that information is on there. But it's not an airport. It's something that you would think, you know, you would want to do as a business, that you're providing the service for, you know, 8 to 10 other airports.'",
        "'speaker_8': 'And yet the one that you then there's this one airport that doesn't have that information. So please include in there. I appreciate you allowing me to talk and. And complain about this. Thank you.'",
        "'speaker_3': 'Thank you, Mr. West or Mr. Marker. Can you make sure that our system is if we have a system, it's got to be, like the best, obviously, as far as the data. So if ours isn't up to up to speed or I've heard this complaint multiple times.'",
        "'speaker_3': 'So, Mr. Romo, can we just look into it and we're spending money to do this thing? It should be working.'",
        "'speaker_9': 'We'll certainly have that conversation with the vendor and see what other departments are doing and make sure that we're doing better, if not exactly what they're doing.'",
        "'speaker_3': 'Okay. Thank you, Mr. Austin.'",
        "'speaker_6': 'Thank you, Mr. Mayor. I just had a couple of quick clarifying questions for the airport director regarding this. Obviously, I support this agenda item. As we spoke about earlier, the noise ordinance is very, very important to us. And so monitoring noise accurately is is extremely important for our city.'",
        "'speaker_6': 'And so this this this contract is something that I will support. But I wanted to clarify the noise monitors. Are they specific to the main runway when we 30.'",
        "'speaker_2': 'Councilmember Austin of the 18 monitors that are deployed. I. 12 are dedicated to runway 1230 or main runway. The other six are dedicated to the shorter two five runways.'",
        "'speaker_6': 'So we actually have noise monitoring capabilities for the other two runways.'",
        "'speaker_2': 'We do that. And the purpose for those is not part of the noise budget, if you will, that's tied to runway 11230, the the noise monitors for the short runways or for single event violations. So we monitor that.'",
        "'speaker_2': 'If somebody exceeds the allowable single event, that's that's used for that purpose.'",
        "'speaker_6': 'And do you know, I guess the question, if we have 18 monitors and you said 12 were dedicated to one, two, three zero. That's correct. And so would that mean that three are dedicated to the other two.'",
        "'speaker_2': 'Three, three.'",
        "'speaker_6': 'Each? And you know what the the scope of that noise actually is or geographics in terms of where they they're located.'",
        "'speaker_2': 'Well, I can I'll give you some general information on it and our noise, officer, if you want to get more pinpoint information. But each of the short runways has a one monitor on the approach side and two monitors on the departure side.'",
        "'speaker_2': 'Specific locations. I'd have to have Mr. Reeves come up here if you want that information.'",
        "'speaker_6': 'Which I can get with him. Outside of that, I'm just trying to get some orientation as to. Okay. Our noise monitoring capabilities on the other runways.'",
        "'speaker_1': 'Yes. Thanks.'",
        "'speaker_3': 'Thank you. I we have a I'm sorry, Councilman. You know.'",
        "'speaker_5': 'Just one last point of clarification. This item is primarily software, as I understand it now with the noise monitoring system. There's a physical component. I think web track calls them emus. Ron Reis refers to them Raptis, I believe.'",
        "'speaker_5': 'But it's the pickup device, the microphone that that measures the sound. Does this item. Well, I mean, a better question would be, is there a single point of responsibility if a noise monitor goes down? I know our airport staff does a great job, but Web track is not responsible for their not being sound monitored.'",
        "'speaker_5': 'They're they're responsible for a component of that. Would that be correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_5': 'Okay. So what we really need to do as as the mayor said, if we want a top notch system, it's got to be both the physical component and the software component. So I just like to add that that.'",
        "'speaker_5': 'If that makes sense. Yes. All right. Thank you.'",
        "'speaker_3': 'Excellent. Thank you. We have a motion in a second. We had public comment. Please cast your votes.'"
    ],
    "Twentieth Amendment to Historical Site Lease with Rancho Los Alamitos Foundation.": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': '23.'",
        "'speaker_0': 'Report from Parks, Recreation and Marine. Recommendation to execute the 20th Amendment to historical site lease with Rancho Los Alamitos Foundation to provide for the annual management fee for lease year 2016 through 2017. District three.'",
        "'speaker_3': 'Get to get a motion in a second, please. Councilwoman Price. Okay. Any public comment on the item? Seeing Nancy's casserole.'",
        "'speaker_10': 'She wanted to make a couple of comments on that, please. Thank you. So I just wanted to thank city staff for bringing this item forward. I want to thank our partners with Rancho Los Alamitos Foundation. They do a tremendous job managing the property and creating a space that is accessible to the public and the children of the'",
        "'speaker_10': 'Long Beach Unified School District. They help, through their partnership with the city, maintain this site as a as an asset that provides education, not just on the history of Long Beach, but the history of the region as a whole and our development in this region.'",
        "'speaker_10': 'And they it has the partnership has proven to be extremely successful. And I'm grateful that as a result of measure funds, we're going to be able to assist in our part of the partnership in making sure that the building, the buildings that they help maintain and take care of and preserve are seismically sound and such that we'",
        "'speaker_10': 'can invite the public to continue visiting for many years to come. So thank you. And I'd ask everyone to support this item.'",
        "'speaker_3': 'Thank you, Counsel Braxton.'",
        "'speaker_6': 'Yes. I'd like to just lay my support and voice to in support of this item as well. I think this is something I know that the foundation at Rancho Elizabeth Alamitos has been working on for some time. And, yes, it's good to see this this this project moving forward.'",
        "'speaker_6': 'I just wanted to just also we talked about citywide resources a little bit earlier. This Rancho as well as Rancho Cerritos, are also citywide resources that serve our entire city. Anybody who's interested in history, the history of Long Beach.'",
        "'speaker_6': 'But more specifically to, you know, every child in Levy's unified school district actually has an opportunity to to learn and visit these ranchos at some point during their matriculation through the time. I believe it's the third for the third grade.'",
        "'speaker_6': 'Fourth grade. But anyway, just one of those comment things.'",
        "'speaker_3': 'Thank you. There's a motion and a second. Any public comment on this? Okay. Please cast your votes.'"
    ],
    "Resolution to Apply for and Accept Grant from Los Angeles County Regional Park and Open Space District for Park Projects.": [
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'Motion carries item 24 and Mr. West, I know this is I don't 24 is a pretty big deal. And we're very thankful to Supervisor Tanabe for his work on this. Did you want to do a short staff report?'",
        "'speaker_9': 'Yes, I think we should. This is huge, $2.6.'",
        "'speaker_2': 'Million at the end of the term here. I'm going to turn this over to our director, Marie Knight.'",
        "'speaker_7': 'But scrutiny married members of the council. In June 2016, the Competitive Access Funds became available from the fourth supervisor Supervisor of the District Access Funds Program. This program is provided under Los Angeles County Proposition eight and allocates excess grant funds equally to each supervisor or district, which distributes available funding to eligible recipients through the Office of Supervisor'",
        "'speaker_7': 'Duncan Harvey. The City of Long Beach was notified that it would be receiving $2.6 million in competitive excess funds. Funding may be used for park projects that consist of acquisition, development, improvement and or rehabilitation of real property in the fourth Supervisor District.'",
        "'speaker_7': 'County staff indicated that funds must be prioritized for shovel ready projects that can be implemented in a short amount of time. The Department of Parks, Recreation, Marine and the Department of Public Works to prioritize park projects for this funding based on a set of established criteria designed to leverage existing funding and maximize grant funding.'",
        "'speaker_7': 'These park projects would include shovel ready projects that can be completed in a short amount of time, and specifically those that require gap funding for completion are related to park safety and accessibility projects and priority projects, not funded by Measure A.'",
        "'speaker_7': 'So here are the projects that we have chosen 14th Street Park expansion project that is underway. There's $200,000 being dedicated to that citywide park, irrigation and landscape improvements. As you know, we are in desperate need of upgrading many of our irrigation systems throughout the city.'",
        "'speaker_7': 'And once we do some of those upgrades, which will in some cases require us to re landscaped those areas after we have done the irrigation improvements. That money will be used in those areas. El Dorado, Duck Pond. El Dorado, West Duck Pond Restoration.'",
        "'speaker_7': 'This will be added to some existing grant funding that we have already. El Dorado Regional Park Restroom Rehabilitation. This will help us rehabilitate two of our restrooms in our regional park. The next one is ADA improvements and some relocation of some park amenities at the heart.'",
        "'speaker_7': 'Hutton Park Stearns Park Community Center improvements. This is to go towards some existing emergency funds that were set aside from our general fund for some repair of the roof there. And we're having some major issues there with some structural issues and some leaking of the roof.'",
        "'speaker_7': 'The Wrigley Greenbelt Trail. This will help us provide the final piece of gap funding that's needed so that project can move forward. And the red car greenway, this extends that Greenway project into the next segment in the next phase.'",
        "'speaker_7': 'So again, we are very, very grateful to Supervisor Tanabe for this funding that allows these projects that some of them were in sort of a holding pattern until we had this money to move forward.'",
        "'speaker_3': 'Think. And I just want to add also my thanks to Supervisor Tanabe. I know that he was very supportive of his projects and it's his last, I guess, last ability to give to the projects. And as a note, I know he's giving these to Long Beach, but he's doing some projects across the county.'",
        "'speaker_3': 'And so I think all cities are benefiting from the projects added in this pool. So thank you for that. And Councilmember actually, I'm sorry, Councilman Andres, you didn't have any comments on the motion, right? Okay. Let me go to Councilman Austin.'",
        "'speaker_3': 'Did you know Councilmember Pearce?'",
        "'speaker_0': 'I yes. I also want to thank.'",
        "'speaker_7': 'Supervisor Tanabe for prioritizing our parks. And I just had a question for the citywide park.'",
        "'speaker_0': 'Irrigation and landscaping improvements.'",
        "'speaker_7': 'I'm not sure if Bixby Park is included in that, if it is included in that when we return to redo the landscaping there from doing new irrigation. I wanted to comment that I would really love to see a dog park there and to get some dollars for us to explore what that would cost and how quickly we'",
        "'speaker_7': 'could turn that around, particularly with trying to activate the entire park right now. So at this point, the irrigation projects won't include landscaping in addition to what is needed just to repair the landscaping that has been torn up because of the irrigation projects.'",
        "'speaker_7': 'So that landscaping that's included in this is not additional or landscaping in other park areas, but it is to replace what is being torn up from the construction. And do we know, is a Bixby Park included in at this point?'",
        "'speaker_7': 'I do not have the final list. We're combining this money and projects with some of the major aid money that we have. We are prioritizing those park areas where we are either manually turning on irrigation, which is very inefficient.'",
        "'speaker_7': 'So for example, there are some areas in Hartwell Park that will be looking we'll be looking at parks that are not using reclaimed water so that we can be more efficient with that. So I don't have the final list at this point in time, but I will let you know because the park makes that list.'",
        "'speaker_7': 'Thank you so much. You're welcome.'",
        "'speaker_3': 'Thank you. There's a motion and a second and a public comment saying now please cast your votes.'"
    ]
}