{
    "Report on Latino Cultural Center Community Engagement and Business Plan.": [
        "'speaker_0': 'Thank you. And with that, we're going to go and move on to the first presentation and then we'll do the consent calendar. So I know I think we have majority of people here for item 18. So let's go ahead and do item 18, please on record.'",
        "'speaker_3': 'Report from City Manager Recommendation to receive and file a report on a Latino Cultural Center.'",
        "'speaker_2': 'Community Engagement and Business Plan Citywide.'",
        "'speaker_0': 'Thank you, Mr. Mayor. Members of the Council. I will. We do have a presentation. This is a pretty exciting item that we're in front of. This is an investment of the council made and it's been really important to the community.'",
        "'speaker_0': 'I'd like to turn it over to Tracy Conger, who will start off our presentation.'",
        "'speaker_2': 'Honorable Mayor and City Council. We are so excited and pleased to provide you with an update on the Latino Cultural Center. Next slide, please. Back in September of 2019. Council you all authorized $50,000 to support outreach efforts for Latino Cultural Center.'",
        "'speaker_2': 'And then back last November, we invited 50 prominent Latino leaders to serve on the steering committee. And many of those leaders are here in the audience today. And we want to thank them for their countless hours of advising and guiding us into this process.'",
        "'speaker_2': 'Also, we want to thank the Departments of Economic Development, Parks, Recreation, Marine and Public Works. Brant, Dennis, Eric Lopez, John Keisler and Sergio Ramirez have been huge partners in lifting this effort over the last year. Central CHA led a very robust community engagement process, which you'll see in just a moment.'",
        "'speaker_2': 'And Laud Cultural Resources has developed a draft business plan for your review this evening. Oh. Next slide, please.'",
        "'speaker_1': 'Yeah. Thank you.'",
        "'speaker_2': 'The steering committee has been working diligently over the last ten months to produce the report this evening. We had a big kick off last December. We were excited and the mayor welcomed everyone to the steering committee. We looked at the history and data about Latinos in Long Beach.'",
        "'speaker_2': 'We saw a market overview of models and trends and a case study review of other Latino cultural centers across the country. In addition, as I mentioned, Central Cha led a five month, very robust community engagement process. We reviewed the community engagement report and provided feedback.'",
        "'speaker_2': 'And then from all a culmination of all this information, Lord Cultural Resources developed the draft business plan for your review this evening. Next slide, please. Now I would like to call up Joseph Quintana, executive director of Central Cha and Megan and Nya.'",
        "'speaker_2': 'They're going to provide an overview of the community engagement process.'",
        "'speaker_3': 'Me. Can everybody hear me? Yeah. Perfect. Thank you so much. Tracy and Jessica will join us in just a few moments. But I will begin today's presentation.'",
        "'speaker_2': 'By giving you.'",
        "'speaker_3': 'An introduction into how our community engagement went. So next slide, please. Now this is going to be the quickest version of the history snapshot that we gave at the beginning of every community engagement session we had. And this is for the purpose of giving some community education, but also some cultural context into the issue and why it's'",
        "'speaker_3': 'needed. So just to begin after the 1848 US-Mexico war. Mexico lost about 55% of its territory to the US. This left over 100,000 Mexicanos north of the border. But following that.'",
        "'speaker_1': 'Event.'",
        "'speaker_3': 'Mexicans were largely decimated for decades to come. So between the 1850s to the 1940, the Latino population largely decreased. Now, following the establishment of the Willmar City, which eventually became Long Beach, this area was in an area that was largely derived from the last MI Atoll Brother Territory acquisition.'",
        "'speaker_3': 'And this comprised of Los Alamitos, Fritos and this. So this area was largely connected to the Latino roots. However, by the 1960 census, we saw that the Latino population had decreased to nearly 7500. But at that time, the Latino population started to revive and grow again because their labor force was largely looked for.'",
        "'speaker_3': 'For the current workforce development as well as for for the economics in the city. And so by 2019, we see that the Latino population grew from merely 7500 to over 1009, 190,000. That's an increase of over 191,000 or a factor of 2,652%.'",
        "'speaker_3': 'Now, that might not seem that big of a change, but if you take a look at the entire city's population, it increased by only 118,460 during the same time period. That's a factor of 74%. But the Latino population has grown to be the largest ethnic population in the city.'",
        "'speaker_3': 'Now I'm going to give you an introduction into what the city's current demographics look like. And this was just to give you context as to how the city has grown and how the demographics have changed over time.'",
        "'speaker_2': 'Next slide. Thank you.'",
        "'speaker_3': 'So we see that presently, according to the 2020 census, Lumbee Latinos represent 43% of the entire city's population of that. We take a look at family households in the city and we see that 31.9% of all family households identify as Latinos.'",
        "'speaker_3': 'Now, to take a further dove into what our our Latinos look like here in Long Beach, we see that 81.2% of all Latinos are of Mexican heritage. But we also have residents from Central America, South America, Peru, Peru.'",
        "'speaker_3': 'We also have them from Puerto Rico, Cuba and even the Dominican Republic. So we have a broad range of Latinos presented are represented here in Long Beach. And so if we take a look now not only at the composition of their origin, but we take a look at their age composition.'",
        "'speaker_3': 'We see that 30.4% of the Latinos living in Long Beach are under the age of 18. Those are youth populations. And then when we take a look at the Latinos who are of working age, that represents 65% of all Latinos here in Long Beach.'",
        "'speaker_3': 'Which is not surprising when we take a look at the workforce and we see that 42% of Long Beach's residential workforce are Latino. And this is important when we start to understand what kind of means, what can I give services and what is our population going to request from a cultural center?'",
        "'speaker_3': 'Now, I also must direct your attention to some of the opportunity gaps and the economic challenges that our community faces. Before we look at what the community requested, because in much of what the community requested, it's reflected in many of these opportunity gaps, including educational attainment.'",
        "'speaker_1': 'Income gaps, health access.'",
        "'speaker_3': 'As well as our digital divide, immigration issues, language barriers, and even some of our household challenges.'",
        "'speaker_1': 'Next slide, please.'",
        "'speaker_3': 'So of course, our community engagement was rich and robust. And as much as I would enjoy providing you with all of the details we don't have all night, so I'm going to give you just a glimpse of the outreach and findings that we had from our our our from our community engagement.'",
        "'speaker_3': 'So there was an overwhelming vocalized need for a cultural center that goes beyond the traditional museum or cultural center. And they were speaking our communities really seeking not only cultural recognition or arts, but they're looking for support through wellness, equity, social justice, economic opportunities, historical connections.'",
        "'speaker_3': 'They're looking for education, healing services and really opportunities for recovery. And so when we take a look at the tree presented, this is just a word tree that captures some of the dialog that our community brought up time and time again.'",
        "'speaker_3': 'And we see empowerment, we see recognition, we see acceptance. And so what we gain from this is that Latinos struggle not only with a sense of belonging or a sense of acceptance, but they're also struggling with trauma, financial burdens.'",
        "'speaker_3': 'They're struggling with job insecurity. Disparate health impacts, educational attainment gaps, family struggles, language barriers, immigration issues, and even a digital divide, as I mentioned before. Next slide, please. So Center Cha really did do our best to implement a outreach plan that was broad and robust to make sure that we didn't cherry pick our participants.'",
        "'speaker_3': 'But instead, we cast a broad net to make sure that our true Latino voice here in the city was captured. And through this effort, we hosted 19 focus groups, which encompassed 263 individuals. And it also gained participation from 25 local organizations.'",
        "'speaker_3': 'We held these sessions in both English and Spanish to make sure that it was language inclusive for all of our participants. Additionally, we collected 77 survey responses which were collected from students, youth as well as residents over the age of 18.'",
        "'speaker_3': 'We also connected with many of our city leaders and experts and hosted 15 key informant interviews to see what they had to say, what their input was on the center. And finally, we hosted a see if you will be MBA Student Research Study, which included 12 MBA program students, three professors, as well as one well-known urban planner'",
        "'speaker_3': '. Next slide, please. So from all of these outreach, from all of this outreach, what we found can be summarized into four main categories. We see.'",
        "'speaker_1': 'That.'",
        "'speaker_3': 'Space and facilities.'",
        "'speaker_1': 'Was a big.'",
        "'speaker_3': 'Theme to our community. Programs, services and.'",
        "'speaker_1': 'Exhibits spoke.'",
        "'speaker_3': 'Directly to our community, community arts, health and wellness as well as education. Overall was a big theme, and economic and community development was very big to our community. But these are sort of umbrella categories. So to take a look at the more specific concepts that were identified by our community, you can see at the broad array of'",
        "'speaker_3': 'descriptions below with pictures and what our community really wants to see. And of course there's more, but these are just the most popular ideas and we have to phase in some of the ideas that our community is seeking.'",
        "'speaker_3': 'And historic exhibits was one of the first ones. Our community is really seeking acceptance and connections to the roots here. So they want to hear stories, pictures and really have that connection solidified between us and why and our history here in the region.'",
        "'speaker_3': 'Now, a trusted safe space was the next thing that came up. Very often. Our community wants to make sure that this cultural center is not only a space where they can get resources, but they want to make sure it's a safe space where they feel comfortable to access these resources and that it's safe for people of all'",
        "'speaker_3': 'ages, all backgrounds, and that everyone feels comfortable in the city to go. Additionally, making sure that we create a community resource hub as sort.'",
        "'speaker_1': 'Of a pipeline to.'",
        "'speaker_3': 'Give information as well as to provide information or other resources on some of the issues that our community may be facing, some of the challenges they are seeking help for now. Additionally, there was a very high outcry for services and programs regarding workforce development, entrepreneurial development, as well as business development.'",
        "'speaker_3': 'Now our community, of course, don't want to see cultural arts, education, language programs, language services, even assistance in tech services and so forth. And that all falls under cultural, education and arts. And then another interesting thing was that the community wanted to see architecture, decor, esthetics and displays that really reflected the diverse Latino community.'",
        "'speaker_3': 'Because one thing they mentioned was that when they look at downtown, it doesn't reflect the Latino people. There's not one thing that really reflects their culture. And so that's really missing to the connectedness in the community. Of course, Student Support Services was another large thing.'",
        "'speaker_3': 'But one thing that was interesting that I may mention is that the community really fell in love with the concept of including an elementary school, a traditional Latino marketplace that can serve in the historical cornerstone of the city.'",
        "'speaker_3': 'But it can be a comprehensive economic development and a mixed use project that's not only going to highlight and showcase the city's Latino population and their vitality, but it's also going to support as a support the center overall, as an economic generator, because this can pull in new businesses, this can support local businesses.'",
        "'speaker_3': 'And this could also be a place for tourist, for visitors and for even the city overall. So, of course, this is the overall view of the community engagement and a snapshot. If anyone is introduced, interested in the detailed information, I will be proud to provide that to you.'",
        "'speaker_3': 'But I'm going to keep the show going and I'm going to pass it on to Jeff cooking dinner.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Thank you, Megan, so very much. For those who may not know, Megan just graduated with her.'",
        "'speaker_1': 'Masters in Economics. So she is one of the youngest economists here in the city of Long Beach and has already doing great work, as you can see. So we're so very proud to have her.'",
        "'speaker_3': 'So on behalf of Sensor Tower and our advisory committee and our Latino community and just want to give a big thank you to the city council members.'",
        "'speaker_1': 'To our mayor.'",
        "'speaker_3': 'To city manager Tom Modica, to John Keiser Brant, Dennis, to Eric Lopez, Tracy Colonia for all their support in this.'",
        "'speaker_1': 'Initiative, because without your investment, we would have never been able to do this feasibility study that's so much needed in our community. I'm not going to go over the demographics that's already been presented, but what I would just like to say thank you on behalf of the organization.'",
        "'speaker_1': 'And we look forward to the next steps, the next steps of conducting a feasibility study for the El Mercado de Long Beach and a Latino cultural district. So we're excited for that. I know. That's next.'",
        "'speaker_3': 'And we look forward to.'",
        "'speaker_1': 'Working with Mr. Kiser and our city manager to making that.'",
        "'speaker_3': 'Happen and our hardworking committee members and some of them are here today. So if some of our committee members could just stand up, I know we have a lot more who couldn't be here, and some of them are elders, but our committee advisors who are part of the cultural center just to stand up and.'",
        "'speaker_1': 'To be recognized or give a giveaways.'",
        "'speaker_0': 'One.'",
        "'speaker_3': 'Thank you for your time and service. As you can imagine, we have 40 members.'",
        "'speaker_1': 'But some folks.'",
        "'speaker_3': 'Cannot be here in person and they're watching. So thank you so much.'",
        "'speaker_1': 'For your time and service.'",
        "'speaker_3': 'And so I also just want to thank our community members who came out today. So this is why you won't hear a long speech from me today, because our community has so much to say. So thank you, our community, for coming out.'",
        "'speaker_3': 'Give yourselves a round of applause. And we're there in support.'",
        "'speaker_1': 'And we have a lot of.'",
        "'speaker_3': 'Watchers watching.'",
        "'speaker_1': 'At home, and.'",
        "'speaker_3': 'We are in full support of this project. So thank you. On behalf of Senator to.'",
        "'speaker_0': 'Thank you, Jessica, so much. And Mr. Motorcade, did staff have additional comments or. Yes, we would like to present the business plan by Lord Consulting. Great.'",
        "'speaker_2': 'Great. And we will go quickly through this, mayor. I would like to present Veronica Gonzalez and hub here, Jimenez from Lord Cultural Resources. Veronica's here in person and her colleague, whoever is in remote via WebEx. Honorable man, city council members, it's a pleasure to join you this evening.'",
        "'speaker_2': 'I'm from lower cultural resources and we have just celebrated our 40 year anniversary. Laura Cultural Resources was founded in 1981 in response to an emerging need for specialized planning services in the cultural and heritage sector. We are now the world's largest cultural professional practice, with completion of over 2500 projects in 57 countries across the world.'",
        "'speaker_2': 'Lord has earned an international reputation for sector leadership, innovation and excellence. It has been a true honor to have worked with your very esteemed steering committee, the city's amazing staff Tracy Brandt, Sergio and now Eric. And to have a very important partnership with Centro Cha on the planning of the Latino Cultural Center.'",
        "'speaker_2': 'Jessica, David and Megan, thank you all for the opportunity to work together. We join you in your enthusiasm, engagement and leadership in moving this very important project forward in a way that continues to be transparent, equitable, inclusive, with a focus on access of resources on behalf of your very substantial and growing Hispanic constituencies.'",
        "'speaker_2': 'We look forward to the Council deliberations and consideration of our plan. I now want to introduce my colleague, Javier Hermanas. Javier is our director of organization and strategy. He has a high level of expertize and many years of experience in leading a wide range of projects with museums, cultural organizations and municipalities.'",
        "'speaker_2': 'Of course, we will be here following our presentation to answer any questions you may have. Thank you so much.'",
        "'speaker_4': 'Thank you, Veronica. This is Vince Carter speaking. I hope you can hear me all right.'",
        "'speaker_2': 'We can hear you.'",
        "'speaker_4': 'Great. Great. So. So I'm going to be presenting just, just five slide slides, a snapshot of the of the business. And I just wanted to add in my my gratitude again for the process has been very enriching. You can see that the process followed as we faced the approach we we tried to build on your work with'",
        "'speaker_4': 'other other partners along the process. Very important the contributions from some of the community engagement and process sense which are led and part of our reform was to be, you know, quantifying the implications of this initiative, trying to come up with operations on the use of capital cost estimates for for this project moving forward.'",
        "'speaker_4': 'We can go to the next slide. Thank you. So what? What? The business plan includes the full document. Is this a process overview of the origins? Then the context. We look outside the controlled market realities and risk practices where we we we developed a long list of cultural centers of similar scope and also did a shortlist of'",
        "'speaker_4': 'a more detailed analysis of more and more relevant institutions. Alongside, we also conferred with local institutions in Long Beach to try and investigate attendance levels and other variables. We we then developed operating assumptions across a number of categories.'",
        "'speaker_4': 'And I have to say here that the business plan is built on these assumptions and the assumptions may change, and that is hope to be right. Because at this point in time, there are there there are things that need to be determined determinants like, for example, the scale of the building and some of these assumptions will have'",
        "'speaker_4': 'an impact on the final numbers. So for now, we are working with the assumptions that we that we have been able to build through to the process of consultation starts with the advice also from from the steering committee of the different stakeholders.'",
        "'speaker_4': 'And we believe that the assumptions that we have in place are solid enough. But as I say, we are we are realistic in the sense that this may all as the planning moves forward and the ultimate result is to produce the attendance and financial projections, projections for operations, meaning after opening day, so we can estimate how much'",
        "'speaker_4': 'it will cost to run during the first five years of operations and also a capital cost estimate that I would show you coming. And move on to the next one, please. Thank you. So. So typing right into the the summary of the operational revenues are expensive.'",
        "'speaker_4': 'We are we are focusing on EUR five operations after opening just because we experienced. The first the first couple of years are two years are years when when two issues may occur due to a novelty factor or due to inexperience cropped up of different programs.'",
        "'speaker_4': 'And by year four and or year five, we can start to to assess an institution in a more space. So these numbers are going to be present in our four, four year five after opening. And the budget that we have calculated is around $1.6 million per year.'",
        "'speaker_4': 'This would be non inflated and that would be the operating operational expense of the institution. The we have been analyzed revenue being different categories and we started with bad revenue, meaning that the revenue that the new student inside the control center can generate by itself by selling activities, for example, through admissions, through rentals, through programs, performing arts'",
        "'speaker_4': 'and other things that other services that may be on offer. And this amounts to 23% of operating cost being covered by it. It is a good performance in the cultural sector and we've seen anything between ten and 20, 25% in the comparables, very rarely anything above 30%.'",
        "'speaker_4': 'So so we we we believe this is, you know, it's a good target to achieve. But it does it does it does point to the fact that other other revenues are still required on our revenue. And we have to be very transparent if we want this institution to be sustainable in the long term in being aware that'",
        "'speaker_4': 'it's a very mission driven institution and the model reflects that it's not a market oriented performance, meaning that, for example, ticketing program, some of the services programs that center which have already shared some of those programs, will not be trying to make a profit in the price points.'",
        "'speaker_4': 'Right. So so what that means is that at some some kind of subsidy or some kind of alternative funding is required. So that's what we estimate, that around nine in-house full time positions would be created in the center, supplemented by approximately another 9.5 points.'",
        "'speaker_4': 'So we're looking in total 18 positions. This will be new jobs in that open economy. And in terms of attendance, we projected around 18,400 per year. It could be more than this. We would be conservative here. But also, you know, because we believe that the programs are going to be of high quality and attention to detail, attention'",
        "'speaker_4': 'to that, because we don't want to look as much in maximizing quantity, but making sure that the quality is there and programs that are. So the range of 18000 to 20000 seems reasonable. With that in mind, and I'm not finished with the point about other other sources of revenue and and that would be the need would be'",
        "'speaker_4': 'for around 1.3 million to come from other sources beyond programing on what other sources. That those would be good. That would be the Mercado and which which is going to be a study is going to be developed soon on the visibility of that specific initiative.'",
        "'speaker_4': 'Also, public public private partnerships and government contributions to different levels, including federal, state and local or post all types of of government funding. Also corporate contributions and donations. Sponsorships. And we are recommending unemployment for operations to be put in place as well as as the capital campaign is is called for giving you advice to create another another'",
        "'speaker_4': 'company, a company for the adult and entrepreneurs so we can move on to the next one time. One important assumption we had to make and which, as I said, may change, is the size of the building. A person we are working with with an assumption of 15,000 square feet of enough space.'",
        "'speaker_4': 'And you can see how we we you know, we recommended a breakdown of those spaces between exhibition spaces, public events and amenities, also education and meditation spaces or more specific workshops and classrooms, things like that. And then Michael and offices are 50% of the total excuse me, there was a big a big request from the community to'",
        "'speaker_4': 'also provide outdoor spaces. So we are also forecasting that in the end, the total in the total construction. So the total program space is actually 21,300, including indoor and outdoor. This, as I said, is is based on on our knowledge at this time.'",
        "'speaker_4': 'It might be a renovation of an existing building, potentially an optional or existing stretch of a park. But we don't know if it might also be a new buildings. So those are things that we express as the project moves forward.'",
        "'speaker_4': 'Move on to the next one. Thank you. Yeah. This is just a quick run up of operating expenses. These are revenue. And basically what this shows is pick up right between the 1.6 operating budget of the institution and the 383 180,000 end revenue that we forecast the tax to produce.'",
        "'speaker_4': 'And the next slide that we are moving to now. Thank you. I'll show you the other source of revenue that will cover the cost and what are the amounts that we have planned. And I just focus on the top three, starting with the largest, which is the last one that would be forming a private partnership and all'",
        "'speaker_4': 'or level of public funding. What we have learned from our research of control centers of this type is that they don't rely on some sort of public funding. And this also goes back to the reasoning that many of these institutions or all of our missions within institutions, they are put in place to to serve a community need'",
        "'speaker_4': 'and a subsidy to develop the involvement of the public sector. Is is is critical from the beginning at the moment that the public sector has been very important in all levels. And we hope that will continue. The second largest item that we have that we have forecasted here is some dominance.'",
        "'speaker_4': 'And this would, of course, depend on whether the campaign can afford or whether it's realistic to to put on a party something for a moment. But we believe that if 10 million to possibly 10 million fund was raised or dominant for operations, then that would yield approximately 270,000 per year, which would be, you know, if it were'",
        "'speaker_4': 'to be a great cash cushion for for sustainability long term. So we we already have to pay for this. And then the third item is the recall that medical there are 181,000. This is our very preliminary estimate of what the recoverable generate as a net revenue.'",
        "'speaker_4': 'But as I said, an analysis and there's another study doing this in more data that we offer whether these numbers at this level or be notable. And we can move on to the next slide. Thank you. And this is my last my last night.'",
        "'speaker_4': 'This is now talking about. We were talking about OpEx, operational revenue and cost. And we're just focusing on this line on capital estimation. We have we have run different ranges depending on and different scenarios, depending on whether the the control center is released on or it's a new project and whether, you know, that there's always a range'",
        "'speaker_4': 'between different costs and there are always some some unexpected costs that could originate. So far, renovations, for example, are in high level. We believe that the project would be achieved with between 26 or 26.9 million and 30 million.'",
        "'speaker_4': 'And this is this includes the three bullet points at the bottom. This includes construction costs. So hard costs at 20 to 40 million. It also would include costs. So all the architecture of these project licenses and around 5 to 6 million total, and then we are doing 8 to 10 million for the development fund for operations that'",
        "'speaker_4': 'I mentioned at the beginning. So for example, the development fund was was decided to not be pursued. Then we will decrease these capital campaign needs by 10 million. So actually the building just requires around 20 million, up to 31 winning to Fund Corporation.'",
        "'speaker_4': 'And this is this is it for me for now. I'm happy to answer any questions that anyone may have. Thank you very much.'",
        "'speaker_0': 'Thank you. We're going back to staff now, Mr. Marco.'",
        "'speaker_2': 'Yes. Thank you, Javier and Veronica, for your hard work on the business plan. In terms of next steps and to wrap up this report, central China has been identified as the nonprofit who will lead the Latino Cultural Center.'",
        "'speaker_2': 'They'll need to finalize the draft business plan and develop a work plan and fundraising efforts, as well as initiate the formal planning entitlement phase. And lastly, identify a permanent location for the Latino Cultural Center. Last slide, please. City staff are here to answer any questions you may have, and that concludes our report.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you very much. There is a there is a motion. And the second I'm going to ask the maker of the motion if we can do public comment first unless there's and then we'll come back. So I do have a significant amount of public comment.'",
        "'speaker_0': 'So I'm going to when I read your name, please line up in that order and then we'll get to the public comment and then come back to the council. So I'll just read up what I have. If the first five speakers could please line up in this order.'",
        "'speaker_0': 'Armando Vazquez Ramos, David Salazar, Phyllis Arias, Ron Arias HURTADO. Are safe and eligible to vote for six could please come forward in that order that Amanda Vasquez Ramos. David Salazar. Nicholas Arias Ron Arias parasail and Olivia Ortega. What the fuck is wrong?'",
        "'speaker_0': 'Thank you. I would like to start with a prayer. Lord made the Dodgers make it tonight. I know. I said everybody's mine. Okay? And I wanted to share a little levity, but to celebrate with you and thank all the cooperation from city fathers and in the administration that has been so supportive and it's so wonderful that we're'",
        "'speaker_0': 'at this at this point in time because it's a night and day difference from 50 years ago. So when you know that I go back to the late sixties and certainly that what we have in this city today is capacity, the capacity to be able to go through this process, to create a vision and to implement the'",
        "'speaker_0': 'project. And certainly that the future of Long Beach is strong. This project will certainly create the viable opportunity to develop a long term project in perpetuity. And now with the cooperation with the cities development of the downtown of Long Beach, connecting Drake Park with Cesar Chavez, the ailing river expansion, and certainly I have already introduced or provided'",
        "'speaker_0': 'a letter of support that outlines what I wanted to express. I just want to say a huge thank you. And of course.'",
        "'speaker_4': 'We look.'",
        "'speaker_0': 'Forward to this journey together. Thank you so much, city manager. Thank you so much. City Council and of course, the mayor of L.A. And then I have to thank you, Dr. Ramos. Speaker, please. Mayor Garcia and members of the City Council.'",
        "'speaker_0': 'My name is David Salazar and I'm a secretary, a board member, as well as a resident of the fifth District. We're pleased to be before you tonight to present our report for the Community Engagement and Business Plan for the Latino Cultural Center and Mercado.'",
        "'speaker_0': 'The creation of the center and the Mercado has been discussed for many years in the city, and we feel now that time has come. Currently, Long Beach Latinos do not have a cultural home where the community can celebrate their history, identity and culture in a place they can call their home their hub.'",
        "'speaker_0': 'They also do not have a cultural and relevant retail and commercial space that serves the needs, serves their needs, and promotes entrepreneurial ship, small business development and economic self-determination. We believe that the cultural center and the Mercado addresses multiple objectives and speak to the long standing social and economic inequalities in the city.'",
        "'speaker_0': 'The combination of the two projects are in perfect alignment with the city's racial and equity equitable equity I'm sorry, Equity Reconciliation Initiative, as well as the up and coming 2.0 economic development plan. In summary, the creation of space and the development of the Latino Cultural Center, McCollam will not only showcase the vitality and the spirit of the'",
        "'speaker_0': 'city's Mexican-American and Latino community, but also establishes a much needed cultural home that will provide a place of belonging, pride and economic opportunities for generations to come. Thank you so much. Thank you very much. Next propose.'",
        "'speaker_2': 'Good ending. My name is Phyllis Aria, and I've been a resident of Long Beach for exactly 50 years. In my 50 years in Long Beach. I've seen the city's community of.'",
        "'speaker_1': 'Latinos grow from.'",
        "'speaker_2': 'About 7% in 1971 when I arrived to about 45%.'",
        "'speaker_1': 'Today, which is remarkable. But in my years.'",
        "'speaker_2': 'As an instructor, as a teacher, as an educator, I was always struck by how much our Latino community doesn't know about its own history. And I think that the Latino Cultural Center is the perfect opportunity for us to make sure that we all know that the entire community knows the history of Latinos in Long Beach, the history'",
        "'speaker_2': 'of Latinos in California, the history.'",
        "'speaker_1': 'Of Latinos in the.'",
        "'speaker_2': 'Entire country. And so I fully support the Latino Cultural Center, and I thank the city and its staff for its support.'",
        "'speaker_0': 'Good evening, Mayor. Members of the City Council. My name is Ron Audios, and I'm here to completely and totally support the concept of a Latino community cultural center. As Armando mentioned, I am also one of the old guys that have been around for 50 years.'",
        "'speaker_0': 'For those of you that remember the original Centro on Anaheim and Holy Pedro, that's where I got my first job. And so the idea for a permanent home for the Latino, Hispanic, Latino community has been around for many, many years as communities across the nation struggle with diversity, inclusion and equity and access issues as a result of'",
        "'speaker_0': 'our social change and all that is going on in the country, in the world. This is a great project. It brings us together. It allows us to celebrate who we are. And ultimately, we are much more alike than we are different.'",
        "'speaker_0': 'This is an investment and I thank the Council for supporting this concept. The staff members John Kyser, Tracy Brant, Eric Sergio they have been absolutely wonderful and we wouldn't be here without them. So I just want to completely and totally support this project.'",
        "'speaker_0': 'Thank you very much. Good evening, Mayor Garcia, City Council members. My name is Harold La Salle. I am the community affairs director at Interval House. We are very proud to support the proposed Latino Cultural Center at Mercado there, Long Beach.'",
        "'speaker_0': 'We have no doubt that it will become an important and successful cultural, educational and economic hub for the city, especially because of the involvement of Central Cha and Jessica Quintana. Without question, there is no other organization that could better lead the development of this district center, which has been our community's premiere cutting edge program that has advocated'",
        "'speaker_0': 'for the protection and advancement of not only Latinos, but our culturally underserved and disenfranchized communities in our city. We know that they will continue to be forward thinking and inclusive in their efforts. So on behalf of everyone at Interval House, of which only a few of us are here tonight, we enthusiastically support this incredibly important development.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Good evening, honorable mayors and members of the City Council.'",
        "'speaker_2': 'My name is Sylvia, although.'",
        "'speaker_1': 'I am the legal and Latino program director at Interval House. We have provided housing and support services for victims of domestic violence in our community since 1979.'",
        "'speaker_2': 'I am also the.'",
        "'speaker_1': 'President of the ROMANA, the largest support group for Latina domestic violence survivors. For residents of Long Beach or over 45 years, I am so hopeful to see. The creation of a Latino cultural center in Kabul the longest. It could be such a great development for our city, and we would create a sense of pride for Latinos living'",
        "'speaker_1': 'in Long Beach to have a dedicated.'",
        "'speaker_2': 'Area that highlights our.'",
        "'speaker_1': 'Culture.'",
        "'speaker_3': 'Um. Also, it would.'",
        "'speaker_1': 'Be great for tourism to create a. Fun and a great place for people to come and enjoy and appreciate the diverse and. And College for Latino culture and music and modern art. This would be a great this would be a dream for our community.'",
        "'speaker_0': 'So thank you so much.'",
        "'speaker_1': 'Thank you. Thank you very much.'",
        "'speaker_0': 'Thank you. Gracias. Good to see you.'",
        "'speaker_5': 'Nice to see.'",
        "'speaker_1': 'You.'",
        "'speaker_0': 'And next our next speakers are going to be Adrianna Guerrero, Joshua Sneed, Priscilla Suarez, Diego Zamora. Hear me get here. Mina Cruz. I think it says Marta Cota and Yvonne Garcia. So repeat those, please line up in that order.'",
        "'speaker_0': 'Adriana Guerrero. Joshua Sneed. Griselda Suarez. Diego Zamora. Filomena Cruz, Marta Cota and Yvonne Garcia.'",
        "'speaker_3': 'Good evening, Mr. Mayor, and members of the City Council.'",
        "'speaker_1': 'My name is Guerrero and I'm the Administrative and client services director at Interval House. As a lifelong Long Beach resident and director at Interval House, which has been serving Long Beach and the Latino community for over 40 years, we couldn't be more enthusiastic.'",
        "'speaker_3': 'About this.'",
        "'speaker_1': 'Important development for our community.'",
        "'speaker_3': 'It will not.'",
        "'speaker_1': 'Only be exhilarating and exciting in terms of culture, tourism and entertainment, but it will also be of serious importance in terms of helping our.'",
        "'speaker_3': 'Community access.'",
        "'speaker_1': 'Critical resources for support.'",
        "'speaker_3': 'From health.'",
        "'speaker_1': 'And education to economic and housing support, and much more. It's poised to be a central hub for our community, and we thank you for making this a reality for our city. Thank you.'",
        "'speaker_0': 'Good evening. Members of the Long Beach City Council, fellow residents of Long Beach. Anyone else I have the honor of addressing tonight? My name is Joshua Sneed. I'm a Long Beach resident in the seventh District. And I'm a local nonprofit executive and L.A. County commissioner.'",
        "'speaker_0': 'I'm currently enrolled in classes at California State University, Long Beach. I'm addressing that tonight because I recently attended a presentation about the proposed Latino Cultural Center here in Long Beach. And I want to share my impressions about this project.'",
        "'speaker_0': 'One thing the presenters did especially well was to help me see why our fine city deserves to have a place like the proposed Latino Cultural Center, a place that feels like home, where important celebrations can be held and remembered for decades.'",
        "'speaker_0': 'Where events and exhibits add life and meaning to the history taught in our schools. This idea will eventually become reality. It's inevitable. It's overdue. We should throw our full support behind making this happen. Now I ask our city council if you have an opportunity to provide material support to this idea, please consider how a space like the'",
        "'speaker_0': 'proposed Latino Cultural Center can make our city a more complete. This great idea is worth our investment of time, attention, and the funds needed to make it a reality. Thank you.'",
        "'speaker_1': 'All right. When I have no chance, I'm going to tell that Suarez, the executive director of the Arts Council for Long Beach. I just want to take a moment to also be told I can take a psychic stand or check on a sore throat.'",
        "'speaker_1': 'You think it is the studio you have to go through though? Umberto Liberal Bavaria's Bertone, endemic to the love camp, is a long beach the in central the middle. Yesterday wasn't really bad. Thank you very much, mayor and council for voting to have this study and to have a steering committee.'",
        "'speaker_1': 'This, along with the work of the African-American Cultural Center and the Cambodian Cultural Center, is an important part of Lumbee Fabric as Arts Council. It's been a pleasure to be on the steering committee and as a beacon. Actually, Ghana to be on the steering committee has made a world of difference, to know that you are invested in'",
        "'speaker_1': 'the Latino community here in Long Beach. This is just one intersection of how the cultural center can uplift voices in economy, in arts and culture, in education. It is an intersection, and this Latino cultural center is just one example of many actions.'",
        "'speaker_1': 'There is deep, rich history not only in Long Beach but in the greater Long Beach area. And I think this will be a destination for many families and many residents around the area. So thank you again. And what I actually.'",
        "'speaker_0': 'Good evening. My name is Diego Zamora. I am born and raised from Long Beach. I reside in the district. I support Santa Clara, Latino and vision of America here in Long Beach because I consider myself to be two sides of one coin.'",
        "'speaker_0': 'One side being born in Long Beach and the other one is having a mexican background. With that being said, growing up, it's always been needed in media, which means to say not from here, but from over there into this cultural center, which would be from the bottle, is just kind of bringing both of those two together and'",
        "'speaker_0': 'creating an area where I can relate to something where a lot of people that are just like me can go and be who they are. Thank you.'",
        "'speaker_1': 'One of my kids at. They ran through the serial number if you get through.'",
        "'speaker_0': 'Good evening, Mr. Mayor. And council members. My name is De La Cruz.'",
        "'speaker_1': 'So Miembro de la Paz inaction people in the street to say.'",
        "'speaker_0': 'I am member of Latinas in Action and I'm a member of the Protect.'",
        "'speaker_1': 'Your Boy Centro Cultural Latino concept then gathered in Long Beach Parliament and in La Boulet Latina.'",
        "'speaker_0': 'I support the Latino Cultural Center and the concept of Mercado in order to support the Latino culture.'",
        "'speaker_1': 'But love Comunidad Latina in Centro Cultural Latino. But I represent them. Well Melanie that ended in a strike only that.'",
        "'speaker_0': 'So for the Latino community. This center is going to represent our unity and in our community.'",
        "'speaker_1': 'Them being back there on the ground in nosotros Podemos convivial communities familiar with Yami studies and the world championship up. Their love will do that as they did that Latina a company that is.'",
        "'speaker_0': 'And this place is going to allow families and friends to share a good time together and also to show the Latino identity to other cultures.'",
        "'speaker_1': 'It's important that. But I'm mi mi familia Martinez. I don't do that. And if I see that kind of joke and I said, But I left Proximus candidacy on this.'",
        "'speaker_0': 'It is important for me and my family to keep our identity for the next and future generations to see that we are growth in this city.'",
        "'speaker_1': 'It was for you in the city.'",
        "'speaker_0': 'So thanks for your support in this initiative. It with. Well.'",
        "'speaker_1': 'When I notice that I see you. Well.'",
        "'speaker_0': 'Good evening. May I rather see? It's a pleasure to see you.'",
        "'speaker_1': 'Now, you have told me a lot. I can see.'",
        "'speaker_0': 'Another council member. It is a pleasure to see you.'",
        "'speaker_1': 'If you look by the four yellow butterfly. Yes, they are Latino.'",
        "'speaker_0': 'I am here to support the Latino Cultural Center.'",
        "'speaker_1': 'You see a little bit gurgle, but the native language.'",
        "'speaker_0': 'And also the vision of the America that you have here in the city of long.'",
        "'speaker_1': 'Sorry. I'm also bothered by Latino I've got the name of and I thought that.'",
        "'speaker_0': 'We know that we have a big percentage of Latino neighbors living in this city.'",
        "'speaker_1': 'But all of us are more European. So Korea and the U.S. is intercultural.'",
        "'speaker_0': 'But the most beautiful thing that I believe there, by creating this cultural center and this mercado.'",
        "'speaker_1': 'The entire parastatal, then, of course, basis.'",
        "'speaker_0': 'Is to be able to bring a little piece of our own country.'",
        "'speaker_1': 'People that connect are nothing of a penal spoiler. They look well made the form of way of life.'",
        "'speaker_0': 'And to be able to connect that don't feel like outsiders outside our country.'",
        "'speaker_1': 'Has a wonderful circuit and we'll see on that. If I were killed, that's cool. Buda Nordstrom made a terrible noise, I thought is the only noise.'",
        "'speaker_0': 'Celebration and other thing that makes me really very emotional. I it's really exciting to know that other cultures are going to be able to experience and to see our identity, our culture, our tradition.'",
        "'speaker_1': 'The have in my if I project forward in their own opportunity that if the sense would be so if I look at people before I lose you got to sit up economy are going to suck on Maria Latina.'",
        "'speaker_0': 'And also because this project is going to offer education opportunities is going to also offer health opportunity and economic growth for the entire community.'",
        "'speaker_1': 'That is going to do away with my problem of voces intercultural though they're almost like a totally stone age economic and it's like a little legacy, but I can say about the same moment.'",
        "'speaker_0': 'So I envision that moment when they're in the cultural center. Another, more color. There we go. And cut the ribbon. And the mayor and the council members are there celebrating that moment. That is to come.'",
        "'speaker_1': 'We support the Latin American. Granted.'",
        "'speaker_0': 'That's a. Greetings, Mayor and council members. My name is Ivan Garcia. I live in District one and I'm with Latinos in Action. And today I am speaking in support of the Cultural Latino Cultural Center and the Mercado the marketplace in Long Beach.'",
        "'speaker_0': 'The reason I speak in favor is because the Latinos make a very significant chunk of the population here in Long Beach, and it only it's only fair that their significance is celebrated in the city. And this marketplace, this cultural hub, is a very good be a very good way to do so.'",
        "'speaker_0': 'In addition to that, it can also bring about many economic benefits. Small business, Latino owned small businesses could benefit highly from this hub, this marketplace. And it's also a way to ensure that, as others have mentioned, that immigrants and Latino communities of all types are able to be celebrated and in this in the city.'",
        "'speaker_0': 'And it only makes sense because tourists, people from outside come to visit this highly diverse place. And when they see a Latino hub, they're able to have greater exposure to the diversity, to the very, very diverse nature of the city.'",
        "'speaker_0': 'And that only benefits us as a city. As you know, we have an image of being very diverse, of being a highly place with a lot of high number of Latinos and a high Latino influence. And so to me, it only makes sense that we have a cultural hub that celebrates and encourages Latino entrepreneurship and economic development'",
        "'speaker_0': '. And that's those are those are the main reasons. Those are the reasons I am in support of the Cultural Center for Latinos and a Mercado in the city of Miami. Thank you for your time and thank you for your support.'",
        "'speaker_0': 'Thank you very much. An excellent speakers we have Arianna, Segun, Rana. I think it says. Seven relievers Zambrano, Perez, Jennifer Aguiar, Aguiar, Kenny Green and Maricela Rivera, Ariana Shogun, Rodrigo Zambrano, Edith Perez. Jennifer Aguiar. Avila, Kenny Green and Maricela de Rivera.'",
        "'speaker_1': 'Hello. Good evening.'",
        "'speaker_3': 'My name is Ariana Fagen.'",
        "'speaker_1': 'I am from District four.'",
        "'speaker_2': 'I was born and raised.'",
        "'speaker_1': 'In the city of Long Beach and I'm for support of the Central Coast to a Latino and the vision of America in Long Beach.'",
        "'speaker_3': 'Growing up as a first.'",
        "'speaker_1': 'Generation Mexican-American, I hold significant value to my Latina identity.'",
        "'speaker_3': 'I understand the importance.'",
        "'speaker_2': 'Of creating and cleaning space.'",
        "'speaker_1': 'To feel a sense of belonging. That sense of belonging will be created with a sense of cultural, Latino and the vision of a mercado in the city of Miami. To me, this piece represents the Latino community to flourish and prosper through the creation of economic, educational, social.'",
        "'speaker_3': 'And health opportunities. This space for the.'",
        "'speaker_2': 'Latino community in Long Beach to.'",
        "'speaker_1': 'Claim their identity and express their diverse culture, tradition and values through music, art and performance. I am excited for the opportunity to embrace and preserve the Latino culture in the city of Long Beach. Thank you.'",
        "'speaker_0': 'But whatever your color, the name of the closet you wouldn't in, Mr. Mayor and members of the city council. We know from what I know, they want to get rid of Roger. My name is Rodrigo Zamorano and I live in Detroit.'",
        "'speaker_0': 'If I remember it, I believe in action. And I am a member of Latinas in Action. Bangura player in central control of the Union. I'm here to support the Latino Cultural Center, LA Vision, the image of Carol, the numbers for the second year and also the vision of El Mercato in Long Beach in order to support our'",
        "'speaker_0': 'diverse community. Look on the map, the ever present federal policy in Long Beach. So the Latino community represents a big part of the population here in Long Beach. In Congress, after what happened in the Dallas policy, all of this.'",
        "'speaker_0': 'But it's elements that are contrary tradition. So this is going to bring the opportunity to express in this space our culture and traditions and policies that are really happening there. It is part of that tradition. Yes. And this space is going to offer an opportunity to express those cultures and traditions that we have, again, brought in there'",
        "'speaker_0': '. And it's possible that instead of an associate of Patria, for example, to have a space to celebrate our patriotic celebration of culture with our music occurring, present a human Latino view to hear our music with a live presentation of the shows of Latino show, by our continued tradition of preserving, trying to be able to dance our dances'",
        "'speaker_0': 'and also express our culture through the visual arts. That's certainly more than the parliament for their own party to preserve the present language. So it is very important for us to have a little piece of our Latino countries here in the city of beach.'",
        "'speaker_0': 'Where are. I have an issue there. That's why I supported this initiative.'",
        "'speaker_1': 'Good evening, Mayor, and members of the city council. First and foremost, I want to thank you for your dedication to serve our city and the implementation of this new policy. My name is Edith, for I am first generation Mexican-American, born and raised in the city of Long Beach.'",
        "'speaker_1': 'I reside on the seventh District in a Senate district with my family. I fully support the Latino Cultural Center Business District and the vision of Ella mercado, the Lumbee, because of their opportunities to our community and the economic growth of our city.'",
        "'speaker_1': 'Most importantly, I support the implementation of the ultimate goal, the Long Beach, because it will value our traditions of Latinos and my language will represent our history, our identity, our bond to the past, to our present and the future.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Good afternoon.'",
        "'speaker_1': 'Mayor.'",
        "'speaker_0': 'Mayor and members of City Council. My name is Jennifer Geary and I'm a promoter of community health and education worker.'",
        "'speaker_1': 'For Central Chair. I am also a first generation.'",
        "'speaker_0': 'Mexican-American, born and raised in the city of Long Beach. I am a resident and registered voter in the seventh District. My father also owns a small furniture and upholstery business in the fourth District. I am also.'",
        "'speaker_1': 'Here to support the Latino.'",
        "'speaker_0': 'Cultural Center and Business District and our vision of the Long Beach that it will help to grow Latino and Hispanic entrepreneurship and support local Hispanic business owners who.'",
        "'speaker_1': 'Have been impacted by the pandemic.'",
        "'speaker_0': 'Thank you for your time. We look for your support on this initiative. Good evening, honorable mayor and the rest of the elected officials, leaders of Long Beach. My name is Kenny Green and I am part of the Workforce Development or Social Charter.'",
        "'speaker_0': 'We talked about history throughout this presentation and you know that we are writing history where people are going to look back 100 years and study what was done to say you guys have you guys could make history right now with the Latino Cultural Center and why this is important, because people 50 years, 100 years could look back'",
        "'speaker_0': 'because of the center and the history. The Latino journey could be memorialized so it won't be lost every time one of our seniors passed away. It also will give opportunity for our youth to create the history that's that's going to be here for generations.'",
        "'speaker_0': 'We talk about the American dream. This would give, you know, opportunities for folks to live the American dream by having their own businesses and also ensure that youth and young adults can create a career pathways. Very important because right now you guys could make history where people could look back 100 years from now and look at the'",
        "'speaker_0': 'Latino Center and study what we've done and where we're going. Okay.'",
        "'speaker_3': 'Good evening, Mayor Garcia.'",
        "'speaker_2': 'Council and community. My name is Maricela Rivera. I am the proud mother of these two. The three of us are proud members of the ninth district in North Language.'",
        "'speaker_1': 'This is.'",
        "'speaker_2': 'The first time we have attended in.'",
        "'speaker_3': 'Person since.'",
        "'speaker_1': 'COVID.'",
        "'speaker_2': 'And I hope that that stresses to you how important this is to us.'",
        "'speaker_3': 'We are here to stress our.'",
        "'speaker_2': 'Support.'",
        "'speaker_1': 'For the Latino Cultural Center Center, also senators but.'",
        "'speaker_2': 'Center and.'",
        "'speaker_1': 'Irma mercado. And I am going to relinquish the rest of my time to the staff because that I should still get a card for her. We must remind ourselves.'",
        "'speaker_2': 'That with no.'",
        "'speaker_1': 'Culture, there are no jobs. With no jobs, there's no economy, no economy. There is no Long Beach. With no Long Beach.'",
        "'speaker_2': 'There is no diversity. There is.'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'Democracy.'",
        "'speaker_3': 'But I said otherwise.'",
        "'speaker_0': 'Thank you. That was that was so great. And I have our final three speakers, which are Shane Weaver, Britta Cortina and Abigail me here. Good evening, honorable mayor and members of the City Council. I'm Shane Weaver, field representative for Assembly Member Patrick O'Donnell.'",
        "'speaker_0': 'Happy to be here tonight in support of Agenda Item 18 and just to read aloud a letter from the Assembly member. I am pleased to support the Long Beach Latino Cultural Center Feasibility Report in collaboration with Central Shore and the City of Long Beach.'",
        "'speaker_0': 'The feasibility report includes a community engagement study and a proposed business plan exploring support and financing options to create a Latino cultural center district and a mixed use small business economic development hub. As Assembly member representing the city of Long Beach.'",
        "'speaker_0': 'I commend such try and the City of Long Beach for championing the Latino Cultural Center Feasibility Plan and business plan. Currently there is no established commercial area representing Long Beach Latinos, which roughly is 43% of the city's population.'",
        "'speaker_0': 'The Latino Cultural Center will not only serve as a source of inclusion and innovation, but will also help revitalize neighborhoods by becoming a regional economic generator offering visitors and tourists an authentic cultural experience. The Latino Cultural Center feasibility report captured the huge impact through direct engagement and explored financing options to develop the Latino Cultural Center District and'",
        "'speaker_0': 'a mixed use small business economic development. I urge a favorable consideration of the Latino Cultural Center, Community Engagement and Business Plan. Thank you for your time. Thank you so much.'",
        "'speaker_1': 'Good evening. Mayor and.'",
        "'speaker_3': 'Council Members. My name is Marissa Cortina.'",
        "'speaker_1': 'I reside in the seventh district. Um. I am supporting the.'",
        "'speaker_3': 'Latino Culture.'",
        "'speaker_1': 'Center and Mercado. As a resident business owner, Latina woman, business owner. I have two locations in the sixth District and also in the seventh District. I plan on contributing to the resources and financial literacy. Because I am a tax preparer and because we see that this has been a project that has been much needed in our community'",
        "'speaker_1': '. I growing up, I was in the Central Chop program and which introduced me to entrepreneurship using my skills. I'm creating jobs now that I am. Um, so I support and I think this is a great idea and this is something that's much needed in our community, and I hope that we can make this possible together.'",
        "'speaker_1': 'Thank you. Good evening, everyone. My name's Abigail, and I'm district director for.'",
        "'speaker_3': 'State Senator Lena Gonzalez, and.'",
        "'speaker_2': 'I have a letter.'",
        "'speaker_1': 'On behalf of the senator to share. State Senator representing California's 33rd District and a member of the Latino Cultural Steering Committee. I write to support the Latino Cultural Center Community.'",
        "'speaker_3': 'Engagement Business Plan. The City of Miami should prioritize equity, inclusion and celebrating.'",
        "'speaker_1': 'Of its diversity.'",
        "'speaker_3': 'And its commitment to ensuring that all.'",
        "'speaker_1': 'Residents have an equal opportunity to thrive. The Latino Cultural Center will serve as a focal point to blend the city's unique cultural identity and embrace its historical significance. These efforts can help revitalize the neighborhoods and increase the quality of life of residents, creating community pride, belonging, identity, and reconnecting Latinos.'",
        "'speaker_1': '43 I support the Latino Culture Center's visibility and business plan. Thank you, everyone.'",
        "'speaker_0': 'Well, thank you. And I want to just thank everyone for speaking to. We do have a motion to set and I'm going to turn it over to customers. And in just a minute, I'm going to say just a few things.'",
        "'speaker_0': 'Let me let me start. But it is mademoiselle. Mademoiselle Cleo, instead of those who stress our story, ask on this experience. Yes. It's okay to say that it's a memento. A memento, comma, something important. None of us such a little bit better in la la.'",
        "'speaker_0': 'A study of Latinos in this economy that one grande applause so in which are more a simple chart Latinas index your total operating history on a scale you about how the mucho para you got the momentum. Como tambin como como latino rhythm with your concern document them their own will mercado oligarchy giving you know none of us'",
        "'speaker_0': 'in Mexico battle for Latin America men amateur who eat at the man may see talk tomorrow the bassoon devil but the madness of commedia e but there is an article.'",
        "'speaker_1': 'Is being.'",
        "'speaker_0': 'Presented. It's also the practice and mundo. A eukaryote is being important in this one, too. Just briefly to say also that in the cap, but it is giving a lot of pride to see all of you. You've worked so hard for this moment.'",
        "'speaker_0': 'Everyone in this audience, all of our Latino elders, the leaders, Central China, Latinos in action. And I'm especially excited about the Mercado. I know, Jessica, you've been talking about the Mercado forever to me. And I just think it's going to be a great place to share our culture.'",
        "'speaker_0': 'I think you all know also that I'm you know, my other half is Mexican. And so I have the great fortune of eating a lot of Mexican food, which is almost as good as Peruvian food. Just almost are my two favorite foods.'",
        "'speaker_0': 'And so I look forward to all the all the tamales. And that was first class and, you know, all the great food we're going to have at the ultimate travel together. I will also say the one thing that makes me proud of this moment and I've shared this with a lot of you at a lot of meetings'",
        "'speaker_0': 'is. As Latinos have grown. Our share of our responsibility in leadership is also growing. And that means that with additional power or influence or ability to reach people, that not that also brings additional responsibility as a community. So I think it's important for us to recognize and for everyone here to recognize that the growth and population should'",
        "'speaker_0': 'equal a stronger desire. Any stronger sense of responsibility to the city and to the community. And so I know that that's something that's really important and that I hope that's part of the center, part of its education core is about that responsibility to serve community and the country that has welcomed us and given us and our families'",
        "'speaker_0': 'so much. I know that's going to be a big part of what the center is all about and that experience that we've all had in being a part of this country. So I just want to thank you all all for that great power comes great responsibility.'",
        "'speaker_0': 'My favorite my favorite Spider-Man quote. And I want to also just think I'm going to turn it over to the council. So I'm very happy about this. And I'm, you know, I'm super supportive. So I do plan on being there the day that we cut the ribbon in whatever capacity, you know, maybe a teacher at Chelsea Long'",
        "'speaker_0': 'Beach again to with Dr. Vazquez Ramos. And and I look forward to to sharing that moment. I want to thank our staff have done a fantastic job. I know the tricycle longa you worked so hard on this project.'",
        "'speaker_0': 'I just want to thank you so much for your commitment to the project. All of the staff have worked a lot, but tracy is like really gone to bat, I think, at the city. So I want to thank you, Christopher, for that.'",
        "'speaker_0': 'And and I do want to also especially thank the two council champions that have really been also pushing me not just on this issue, but on a lot of issues. The council is and they have some customary ranga who I know have been talking about Latino issues in general for a very long time.'",
        "'speaker_0': 'I just want to thank them. I want to particularly also I know Councilman Mongo also discussed this issue at the Economic Development Committee. I know that Councilman Allen also was a strong advocate at the committee as well with a lot of advocates here at the council.'",
        "'speaker_0': 'I think everyone here is supportive of this of this project. And so congratulations. Very, very, very proud day for the community. Historic day for the community. And with that, I'm going to turn over to the mic of the motion, compliments of the house.'",
        "'speaker_2': 'Thank you, Mayor. I am such a proud Latina today. Today, being a famous historian again, I feel that the long reads of what is so good that most of us will not blossom when we played the profound. I want to thank everybody who came up to speak today and shared their story and their support for this amazing'",
        "'speaker_2': 'Latino cultural center slash, Edmund Cardon, especially Rosita, of course, and her her companion, Bijan. So thank you. Thank you very much. Another big thanks to our amazing staff like mayor, said Tracy. I'm always going to want you on my side to bat for me.'",
        "'speaker_2': 'Thank you. Thank you so much. I also want to acknowledge on the work that has already been done towards this vision. For many decades, this just didn't happen. So I really want to say thank you to all of those who kept pushing and kept pushing and kept pushing to bring us here to this day.'",
        "'speaker_2': 'Today, I am honored to have been part of the Latino Cultural Center Steering Committee. Thank you for that opportunity. I am super excited and supportive of the cities of Long Beach's vision for creation of the Latino Cultural Center.'",
        "'speaker_2': 'I would like to begin by acknowledging and thanking the work of the Latino Cultural Center Committee, who was composed of some very, very impressive members. I also would like to thank the leadership and collaboration efforts with Centro CHA and our consultant team, the Lord Cultural Resources, the points, components of the community engagement, visioning workshops, best practice research'",
        "'speaker_2': ', marketing analysis and the development of concepts and business plan. All this all of this that was considered for the Latino Cultural Center have been a main theme at this point in this process. No formal specific sites have been identified, although, as we heard tonight, we have a very, very strong community interest in the location in the areas'",
        "'speaker_2': 'of the Drake Chavez masterplan. I also want to acknowledge that there's much more work to do in this effort and a lot more details to the vision for the center and as well as the concepts and plans and detailed marketing analysis and fundraising strategies that must be fully developed by the nonprofit central to that's leading this effort'",
        "'speaker_2': 'as it moves forward. I'd like to make a motion that the city continue to be engaged in the steering committee's efforts that at the appropriate time, as potential locations are explored, that both public and private are explored, and that the public sites that are that meet the need for our Latino cultural centers objective be including and not'",
        "'speaker_2': 'limited but included in the Drake Chavez Park. May may it be may be considered as well. If you need me to be a little more clear, staff, please let me know.'",
        "'speaker_0': 'They've got that loud and clear. So that makes a lot of sense. We'll add that into motion. Thank you.'",
        "'speaker_2': 'Thank you. The reasoning for my motion is that it the possible inclusion of the Latino Cultural Center in the Mercado Project and the fact that Chavis Master Plan, which is something we're all advocating for it it would be have a historic cornerstone area in the city's Mexican-American and Latino community.'",
        "'speaker_2': 'Complementing are open space and parks that we have in in the surrounding community. This location also would enhance the use and programing of its existing general base at Community Center and Art Park. Furthermore, the development of the Latino Cultural Center and Mercado around the around or on the site, Chavez Park, is consistent with the goals of the'",
        "'speaker_2': 'city's Racial Equality, Equity and Reconciliation Initiative Report The Blueprint for Economic Development and the economic profile for the Latino Community Report. Given that it is addressing long standing social, economic, social and environmental and equities affecting the city's business community and promotes community empowerment, cultural recognition, interpersonal ship and self-determination in the city of Long Beach.'",
        "'speaker_2': 'As we know presently, there is no established cultural and retail project representing the city's growing Latino community, which stands at 43.3 of the adult population in the city, along with the Latino Cultural Center and Met Project, will provide identity and recognition for this population and can be integrated into the city's downtown core and and waterfront.'",
        "'speaker_2': 'This creation of place at Cesar Chavez Park hopefully will not only showcase the vitality and spirit of the long before female community, but also will become a regional economic generator and offering visitors and tourist and authentic cultural experience.'",
        "'speaker_2': 'And that makes me super happy. Thank you.'",
        "'speaker_0': 'Thank you very much. And I want to turn it over the customary ringer, if you and I very happily second that motion cast members and then as to what a promotion. Today we celebrated Hispanic Heritage Month. Out in the foyer, out here in front of City Hall.'",
        "'speaker_0': 'It's the seventh annual celebration that we had here when I first was elected in 2014. We didn't have that celebration. We sort of like went dormant after many years of having celebrations in the theater lobby Chelsea, Long Beach, Bixby Park.'",
        "'speaker_0': 'I'm with Ron and Phyllis in Nevada, a little bit here, 50 years. And, you know, we've been through a lot and we've had a couple of false starts in trying to get a central established here. We're starting with Central La Raza, the Accademia, and then and here we are tonight making history.'",
        "'speaker_0': 'This is this is one of those efforts that I think is going to be successful. And I think it's because of the people that are involved. Phyllis, Ron, Armando And of course, can't do it without Central Chad and the leadership of Jessica Quintana, who has basically been at the forefront of making this happen and making it a'",
        "'speaker_0': 'reality. And, of course, the support of staff. Tracy, you've been wonderful. And of course, our city manager has been very supportive of this cultural center right from the start. And it's a very proud moment that we had here tonight because of the efforts of the community and, of course, all of you who came here to speak in'",
        "'speaker_0': 'support of this project, because without without the support of community, there is no project. It works because you make it work. You make it happen. And it's not that's not us here at the city council that make it happen.'",
        "'speaker_0': 'It's you. We basically advocate for you. That's our that's our role. We're advocates. And you let us know what you want. And we try to make it happen. And we try to make it happen in a way that is going to be conducive to being moving forward the agenda for our people.'",
        "'speaker_0': 'The the night tonight is that I am a Chicano. I always call myself a Chicano and I've always been and will be. And a Latino or Hispanic Heritage Cultural Center is is something that will be very proud for.'",
        "'speaker_0': 'One thing I would like to see that I did not see presented here is also the fact that, you know, we as Latino leaders who are up here, we get old. No, we're not as young as we used to be.'",
        "'speaker_0': 'So we need new leadership. We need those individuals who are in the third, fourth or fifth grade now, or those who are just graduated from high school to take leadership role in leadership positions in the near future, because we're not going to be here that long.'",
        "'speaker_0': 'We need we're going to move on. We have to make room for the new leadership is coming. So I hope that this culture center also presents leadership opportunities to advance the the leadership that we need here in this city as it diversifies and becomes even more so than the period of three years now.'",
        "'speaker_0': 'So we know what the statistics are showing. We know what the data is saying. You know, we're becoming more diverse. And with that diversity comes responsibility. And with that responsibility comes leadership. And I hope that the Culture Center will also include some classes or some opportunities for our youth to advance their leadership skills and the opportunity to'",
        "'speaker_0': 'eventually take positions of leadership locally, state and nationally. I want to thank you all for being here. I want to thank. Of course, that which Mary said there has the mayor who who had been always supportive was. By the way, one thing he didn't mention.'",
        "'speaker_0': 'I hope he won't get a lot of Mexican food. Today we get Peruvian food and back at the city council. That delicious. Very good. So, again, thank you very much. And I very happily and proudly support this motion.'",
        "'speaker_0': 'This motion. Thank you. Thank you, Catherine. And we thank those those behind the diocese getting getting very old. I think he's excluding Mary. And I hope that Councilman Austin. Thank you. Thank you, Mr. Mayor. And I'd like to just weigh in and express my full support for this item.'",
        "'speaker_0': 'I stand with my colleagues, as well as the community in the call for cultural center for Latinos in Long Beach, in support of this whole community engagement and business plan. You know, I just want to commend the report, the work that went into, you know.'",
        "'speaker_0': 'Presenting this. You know, I'm always impressed with the young lady, Megan and I. And her data, I think, illustrates our Latino community so, so clearly and and the importance of what we're doing here today. Obviously, our staff report and forward community law, cultural services are they they are amazing to work with.'",
        "'speaker_0': 'And I think they're going to be an amazing partner not only for this cultural center, but we've also been working with them on the African-American Cultural Center. And I expect they'll be involved in other cultural activities as we as a city strive to be more inclusive.'",
        "'speaker_0': 'And this work is really all about inclusion and recognizing and bringing people together, helping us understand who we are as neighbors, as a community. And I'm really proud to support this this evening. I want to hear you say that many of the concepts expressed in the visiting plan here are very similar to to the concepts that were'",
        "'speaker_0': 'expressed in the African-American cultural center process and to the community involved here today. Those of you who came out and spoke this is an amazing, historic moment for you to get involved, to be a part of something, be a part of something that's going to really require a great deal of collaboration as a community, as a city'",
        "'speaker_0': '. And there's a space and a place. There's an opportunity, I would hope, for each and every one of you who want to be involved, to be involved in this. And I would just say that this is a vision.'",
        "'speaker_0': 'The vision is shared by many people, but the work is just beginning and it's going to be a heavy lift. And so it's going to take a lot of work to get there. I'm here to support and hope we get across that finish line very soon.'",
        "'speaker_0': 'Thank you. Thank you, Councilwoman. Councilwoman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And thank you to everyone who came out and spoke in favor of the item tonight. And for all of you who have been working really hard behind the scenes to make this.'",
        "'speaker_1': 'Project a reality.'",
        "'speaker_2': 'I'm really impressed with the presentation that we heard tonight, and I.'",
        "'speaker_1': 'Appreciate the education.'",
        "'speaker_2': 'Regarding some of the history and the importance of a city asset like this. I could not be more supportive. I love the city of Long Beach because of its diversity. And I.'",
        "'speaker_1': 'Mean, it's just it's just.'",
        "'speaker_2': 'One example of how we celebrate one another's culture. But the mayor highlighted food. And I will say I think he secretly thinks Persian food is the best, but he probably won't admit that tonight. But he does often talk to me about how much he appreciates that.'",
        "'speaker_2': 'But, I mean, you just look at the people behind the diets and what amazing diversity we have in our city. So I think anything we can do to to.'",
        "'speaker_1': 'Further support our.'",
        "'speaker_2': 'Cultural differences and educate one another.'",
        "'speaker_1': 'On the beauty and the history of our cultures is a positive for the city. And I will always support efforts to do that.'",
        "'speaker_2': 'All day long.'",
        "'speaker_1': 'I will say the staff first of all.'",
        "'speaker_2': 'Tracy, you're amazing. You're just amazing. I love.'",
        "'speaker_1': 'Having you on the city.'",
        "'speaker_2': 'Team. And I.'",
        "'speaker_1': 'Just it's just it's really it's really.'",
        "'speaker_2': 'Hard not to get behind something that that woman works hard.'",
        "'speaker_1': 'On because she's very thorough. And so I appreciate that.'",
        "'speaker_2': 'But I will say to the city team, I think the.'",
        "'speaker_1': 'Challenge is pretty clear for the city team idea that everyone loves. How do we get that shovel ready so that all of these wonderful elected officials who.'",
        "'speaker_2': 'Sent their representatives to speak to us tonight can be ready when there is funding available for either a matching funds grant or some sort of grant to allow the city to expand on our.'",
        "'speaker_1': 'Cultural diversity.'",
        "'speaker_2': 'And our cultural.'",
        "'speaker_1': 'Assets. So I think that the idea for us, the challenge is going to be projects like this are really.'",
        "'speaker_2': 'Great, but a lot of times.'",
        "'speaker_1': 'They don't become a reality because we're not perfectly situated at the right time to make it happen. So hopefully we can get to a place where this is shovel.'",
        "'speaker_2': 'Ready when those funds become available and we don't miss that opportunity. But with that, I want to thank my colleagues.'",
        "'speaker_1': 'Councilman and de Haas and Councilmember Ranga for championing this project and allowing us all to be a part of it. I fully support it. Thank you.'",
        "'speaker_0': 'Thank you, Councilman.'",
        "'speaker_2': 'So thank you, Mayor. First, I want to just congratulate you all for coming to this kind of milestone and finishing at least this portion of the plan and the business plan. You know, I think that what what I want to lift up is the process it takes to bring everyone together, young generation and our elders, but also'",
        "'speaker_2': 'just the diverse Latino community. I think just that some people don't realize the vast number of their various culture and mentioned and food as well. Right. And how important it is to educate everybody in Long Beach and just the broader community diversity of the Latino community and just want to share that.'",
        "'speaker_2': 'It's an inspiration in what you're all doing. I think the African-American Cultural Center kind of said that they started with theirs and have come to milestone themselves as well as you. And I think the Cambodian American Cultural Center will be on its way so that we're all able to come together at some point and share with each'",
        "'speaker_2': 'other across culture. Meanwhile, as as education is done within the culture of these centers. And so I just want to reiterate my thanks to staff as well as the leadership of Councilmember Sunday House and Urunga for bringing the item forward with a central cause leadership, Latinos in action and many of you all.'",
        "'speaker_2': 'So and I just want to share that and I think as we had one speaker earlier with her, Maricela with her children, and that it is really for our next generation to making sure that we lift up the culture and the pride of our diverse community.'",
        "'speaker_2': 'And I'm just really proud that we as a city highlight that and celebrate it. Thank you.'",
        "'speaker_1': 'Thank you. I'm cute. Next. So I'll take a plate, a personal privilege, and say it's my turn. And thank you all for coming. This has been a long time going. I remember the first time I met with David Salazar.'",
        "'speaker_1': 'In addition to hearing this amazing idea and talking through his vision and what the board had come up with and all the work all of you had done, I also encouraged him to run for city council. His wife said, No, I strongly encourage you to continue to encourage him all through January of 2022.'",
        "'speaker_1': 'He still can get in on it. You guys have brought forward some amazing ideas and it takes strong leaders like David and Jessica and Ron to really continue to be resilient to the ups and downs of the city and the ups and downs of the economy and the ups and downs of the priorities of different council leaders'",
        "'speaker_1': 'who rotate in and out of this dais. But through those years, this group of people and most of you in this room have been constant in your your continued pursuit of what you know to be an amazing vision.'",
        "'speaker_1': 'And I see that vision, and I'm so blessed to be able to be here to be a part of it. I look forward to finding a way to get this over the finish line. I would love to again meet with some of the community members.'",
        "'speaker_1': 'We have an amazing nonprofit organization and economic development partner. And many of, you know, I do a lot of grants and over the last 24 months. Hundreds of millions of dollars in this country have been set aside over the next five years for diversity and inclusion.'",
        "'speaker_1': 'And I think that this project is primed to receive one of those grants. I was on a call with one of the members of that community, a nonprofit group that connected with our city. I'm talking specifically with banks that have specific funds available for projects like this that will lift people out of poverty and give them the'",
        "'speaker_1': 'opportunity to have their own business in a cultural district that they're passionate about, to have a job where when you show up every day, it's not a job because you're actually just doing something you love. And the funds are there.'",
        "'speaker_1': 'We just need to work together to find a way to put them into an organization that can accept them in a meaningful way and implement them. And I'm here to do whatever it takes to get us there. But thank you each and every one of you, because as we move through that process, your voices will continue to'",
        "'speaker_1': 'be needed for continual input and continual support to get over the finish line. And I will be there when the ribbon is cut. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Allen.'",
        "'speaker_1': 'Yes. Thank you for the presentation and congratulations to Central Char and the future of Long Beach is definitely stronger. So I also want to thank Jessica and Tracy for your leadership. And I stand with my colleagues when we say that we wholeheartedly support this.'",
        "'speaker_1': 'I'm just so excited and I just think it's really important that we highlight the heritage and the ongoing contributions of our Latino communities. As many of the speakers mentioned today. I know that our community looks forward to a place where they can go and embrace the cultural significance of Latinos and their history and our community.'",
        "'speaker_1': 'So thank you so much to all the people that made this happen, to all the people that came out today and spoke. You really touched me. I love everything about this project. And like my colleagues, I can't wait to be there at this ribbon cutting.'",
        "'speaker_1': 'Congratulations.'",
        "'speaker_0': 'Thank you. And Customer Supernova. Thank you. I, too, would like to thank all the speakers here tonight. I really appreciate you being here. It's it's just an absolute honor to sit on the dais tonight to support this item.'",
        "'speaker_0': 'But I want to bring the conversation back to food and rather specifically. And I'm looking at Ron and Phyllis here. I mean, listen, listen. It's Pancho's in the fourth District, is it not? There you go. Thumbs up. Okay.'",
        "'speaker_0': 'But I just like to give a special congratulations to Jessica Quintana, and you should be very proud tonight. And what I'm most impressed about is tonight is a big picture item. It's a global issue for the community. And Jessica has the talent to lead that effort.'",
        "'speaker_0': 'And yet no detail is too small for her to keep an eye on. The most minor detail on a vaccination clinic. It always have a park. She's on it. And that's that's a real tight end. And our our district has been the beneficiary of that.'",
        "'speaker_0': 'So I say thank you for that. Well, thank thank you. And that concludes everyone here on the on the council. Dove, congratulations again to everybody. We have a motion and a second by council member and they have some contemporary ranga on the floor.'",
        "'speaker_0': 'So members, please go out and cast your vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Grip graduations, everyone. Thank you. We're going to we're going to move on to that consent calendar item two through 14. Yes. Thank you, guys. Thank you. I get emotional. A second person sent calendar. I have and I can find Dave and there's a I believe here.'"
    ],
    "Charter Commission Appointments and Reappointments.": [
        "'speaker_0': 'Thinking that we're doing the two commission items. We'll start with the charter commission item and then the general commission item, which is 17 and 15.'",
        "'speaker_3': 'Communication from Council Member Super Nature of Government Personnel and Elections Oversight Committee Recommendation to receive Charter Commission appointment and reappointment approved by the Government Personnel and Elections Oversight Committee.'",
        "'speaker_1': 'There's also a.'",
        "'speaker_3': 'Communication from city attorney recommendation to adopt a resolution making findings.'",
        "'speaker_0': 'Now.'",
        "'speaker_1': 'I'm sorry. Just item.'",
        "'speaker_3': '17 recommendation to receive the charter commission.'",
        "'speaker_1': 'Appointments.'",
        "'speaker_0': 'Thank you. Councilman. Okay. Thank you. We would like approval of this motion from the committee. Thank you. Thank you. And as we as we approve this, I want to go ahead and just read a little bit like we have traditionally have about each county commissioner.'",
        "'speaker_0': 'I know that pre-COVID, most of our commissioners would come to the council meetings. There might be a few of them that are here for their appointment. If they are, feel free to to stand or wave over or give us a wave.'",
        "'speaker_0': 'We know most are at home watching, but I wanted to still recognize them and read their their short bio as we appoint them to the Citizens Police Complaint Commission. We are appointing Michael Soto. Michael Soto as a Council District three resident and has called on him for over a decade.'",
        "'speaker_0': 'He is a police special investigator with the Office of Inspector General, which provides oversight to the Los Angeles Police Department on behalf of the L.A. Police Commission. Michael is also an attorney in California and is practice law in the area of criminal defense for over ten years, primarily as a deputy public defender in both L.A. and Orange'",
        "'speaker_0': 'County. Michael is a graduate of CAO of University of California, Hastings College of Law. I'm sorry. You refer to California Hastings College of Law in San Francisco. Also, we were also pointing to the Citizens Complaint Commission, a Dr. Mary to Harry.'",
        "'speaker_0': 'Dr. Mary to Harry is a resident of Council District four and is currently working as a clinical director nurse practitioner for the L.A. County Department of Health Services. Mary's also served as a sexual assault forensic nurse, completing exams and collecting forensic evidence for both victims and suspects in collaboration with the L.A. County Sheriff's Department.'",
        "'speaker_0': 'Dr. Harry holds a doctorate in nurse practice from the University of California, San Francisco. And also being appointed is Michael Bates. Michael Bates is a Council District six resident. He currently works as a design and environmental consulting engineer and the technical services.'",
        "'speaker_0': 'Mr. Bates previously served on the city's Board of Examiners Appeals and Condemnation as a member and later as chair. Michael holds a B.A. of Science in Mechanical Engineering from Purdue University in Indiana and also Michelle Anderson. Michelle Anderson of the Council District eight resident.'",
        "'speaker_0': 'She is a prosecutor with the city of Los Angeles, working at the deputy city attorney and the L.A. City Attorney's Office. Michelle is a member of the Sierra Club, Black Women Lawyers, Negro Lumbee chapter and is active in many other organizations.'",
        "'speaker_0': 'She holds a bachelor's degree in political science from UC Irvine and a Juris Doctor degree from Southwestern University School of Law in Los Angeles. Being appointed to the Planning Commission is Alvaro Castillo. Alvaro is a fifth District Council resident.'",
        "'speaker_0': 'He previously served on the Airport Advisory Commission. Mr. Castillo, the small business owner and a parent of two L.B. Unified School District students, he is employed by the extended Stay America by In America as a divisional director for Human Resources in the Western US, yielding a bachelor's and master's degree from Cal State Long Beach in Business Admin'",
        "'speaker_0': ', where he continues to be involved in alumni activities. Being appointed to the water commission is Courtney Pugh. Courtney is a second district resident and Courtney has lived in Long Beach for over a decade. She's a partner at the nationwide public affairs firm and leads her California operation.'",
        "'speaker_0': 'Prior to that, Courtney spent over a decade working for organized labor and was the first woman and Asian-American to serve in many roles, including as the executive director of SEIU California and the political director for the L.A. County Federation of Labor.'",
        "'speaker_0': 'She graduated with a B.A. from Bell State University in Indiana. Our re appointments are to the Harbor Commission. Bobby Olvera and Frank Colonna both being reappointed and to the Citizen Police Complaint Commission, Veronica Garcia and Danny Buchanan. And also being reappointed is to our Ethics Commission, Margot Morales, James Shotwell and Susan Wyatt.'",
        "'speaker_0': 'So those are all of our charter appointments. I'm not sure if any of them are here as I read their names. I know we're not generally generally for during COVID. We don't have folks coming or anyone here in case we want to stand.'",
        "'speaker_0': 'Yeah, please stand. If I called your name. Oh, yeah, I see some of you aren't here, actually. Let's give them a round of applause, and I'm going to have you guys just come forward in just a minute. But thank you all for being here.'",
        "'speaker_0': 'And I mean, honestly, you're just an incredibly impressive group of individuals. Just really, really proud to appoint all of you. We're going to do the additional commissioners in just a minute. But we've got to do that. These these charter commissioners first.'",
        "'speaker_0': 'Captain Boston. Thank you, Mr. Mayor. And I just want to take this opportunity to say how proud I am to second the motion, also to serve on the committee that made the approval for these charter commission appointments and welcome all these new commissioners and reappointed commissioners to their roles and respective roles.'",
        "'speaker_0': 'I know that on the CBC we are putting forth from some very strong and competent individuals who are going to have a big job in front of them because this commission is going to go under some dramatic change over the next year or so.'",
        "'speaker_0': 'And so I thought it was very important to make some recommendations, at least on my end, for somebody who was going to be very strong. And I want to just take this opportunity to congratulate the eighth District representative.'",
        "'speaker_0': 'There's Michelle Anderson. I know you're doing very, very well, but congratulate everyone in the hall. This is this is a great responsibility. Charter commissions are part of our Constitution, I guess, is the city. And the role that you have are extremely important.'",
        "'speaker_0': 'So. Thank you. Thank you, councilman. Councilman. Sorry.'",
        "'speaker_2': 'Thank you. I just want to congratulate to all the commissioners who have been appointed and reappointed. And one is just thank Michael Bates for serving to represent the sixth District for the Citizen Police Complaint Commission. Appreciate your service and stepping up for the for for this and to all of you for your time and your service to'",
        "'speaker_2': 'the city.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I, too, want to congratulate everyone. I know that the representative from the third Council District for the PCC is someone with whom I've had the.'",
        "'speaker_1': 'Pleasure to work with on the opposite side.'",
        "'speaker_2': 'Of the courtroom. And he will bring to the PCC, I.'",
        "'speaker_1': 'Think, a very balanced approach, having been a public, having served as a public defender for so many.'",
        "'speaker_2': 'Years, and now being involved in police reform.'",
        "'speaker_1': 'And police investigative issues. I think he's going to be a fantastic addition. So congratulations.'",
        "'speaker_2': 'Michael. I think you're going.'",
        "'speaker_1': 'To do a great job. Thank you.'",
        "'speaker_0': 'Thank you. We have a motion and a second. Please cast your vote on these commissioners.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Great. Congratulations to all of you. And just we're going to take a photo, so just hold on 1/2 if you can just stay here. Thank you all very much. And now I want to we have the next item, which is our general commissioner's.'"
    ],
    "Cannabis Delivery and Equity Dispensary Ordinance and Funding. ": [
        "'speaker_0': 'Right. Next item is item number 16. I'm sorry, item number 19.'",
        "'speaker_3': 'Report from City Manager Recommendation to receive and file a report on the cannabis delivery and dispensary feasibility analysis and direct city attorney to prepare an ordinance to allow cannabis delivery and equity dispensary facilities in.'",
        "'speaker_1': 'Long Beach Citywide.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Like the first go to staff or staff report each year. We do have a fairly lengthy staff report. That's a pretty complex issue and we'd like to go through some of the analysis that we've come up with.'",
        "'speaker_0': 'We also did a significant amount of community outreach that we'd like to share with you as well. So this is in response to a council request to look at can we increase the number of dispensaries from four equity applicants as well as delivery licenses?'",
        "'speaker_0': 'So I will turn it over to Kevin Jackson, our deputy city manager and the team. Thank you, Tom. And we're going to go ahead and jump right into the presentation. We're going to have Emily Armstrong, our cannabis program manager, who will be doing the presentation tonight.'",
        "'speaker_0': 'And as Tom indicated, if you can be patient with this is pretty lengthy presentation. We're reporting back on both initiatives and we want to make sure that we provide clarity to you as well as the listening public. Also, before I turn it over to Italy, I want to acknowledge that we have Art Sanchez, our deputy city attorney'",
        "'speaker_0': ', who provides support to cannabis operations and policy. So with that, I'll turn it over to you, Emily, and if you can take us through the slides.'",
        "'speaker_3': 'All right. Thank you. Good evening. I know the mayor is not here, but members of the city council. Good evening. This item is a report back on the feasibility of allowing cannabis delivery businesses and additional equity dispensaries in the city.'",
        "'speaker_3': 'This report is a culmination of the work we've been doing in the city to improve the cannabis social equity program. For some background, the city council adopted the cannabis social equity program in 2018 alongside the Adult Use Cannabis Ordinance, with the goal of promoting opportunity in the cannabis industry for individuals and communities negatively impacted by the war'",
        "'speaker_3': 'on drugs. Through business ownership and employment. In a memo released on August 5th of 2020, staff detailed some of the challenges reported by equity applicants in opening a cannabis business. These challenges included a lack of available retail license types and others with low startup costs, the highest cost and need for capital with the license types that are'",
        "'speaker_3': 'currently available. Challenges with identifying and securing property in the city's eligible zone, known as the Green Zone. A lack of technical assistance to support equity applicants with their real estate, financial or legal needs, as well as the lack of community input in the design of the program.'",
        "'speaker_3': 'In response to these challenges, staff identified options in the memo for the City Council's consideration to reduce these barriers to entry, including allowing the shared youth manufacturing license type and increasing the availability of retail license types such as delivery and storefront retail for equity applicants.'",
        "'speaker_3': 'In January and March of this year, the City Council directed staff to prepare an ordinance allowing shared use manufacturing in Long Beach to prepare a feasibility study on allowing delivery businesses in Long Beach with an emphasis on prioritizing equity applicants and exploring the feasibility of a cap on the number of delivery businesses.'",
        "'speaker_3': 'And to prepare a feasibility study on allowing up to eight additional dispensaries in Long Beach to be made available exclusively to equity applicants. This presentation outlines the recommendations in both the delivery feasibility study and Equity Dispensary Feasibility Study for the City Council's consideration.'",
        "'speaker_3': 'The first study being presented tonight is the delivery feasibility study. Cannabis delivery businesses, also known as non storefront retailers or businesses that sell cannabis goods to customers exclusively through delivery. For example, a customer goes online, places an order, and an employee of the delivery business drives to the customer's home and delivers the cannabis goods.'",
        "'speaker_3': 'Delivery businesses must have a commercial license premises, and that location must remain closed to the public at all times. Currently, delivery operations are allowed in Long Beach, but only by licensed dispensaries. Therefore, delivery of a standalone license type is not available for any other applicants, including equity applicants.'",
        "'speaker_3': 'When preparing to conduct the feasibility analysis, staff identified three policy areas that would need to be explored to have a significant impact on increasing equity business ownership. First was the issue of a licensing cap and how that would affect some of the predatory practices involving equity applicants.'",
        "'speaker_3': 'It was the issue of allowing equity applicants to have priority of this license type or to make these licenses exclusively available to equity applicants. And third was where delivery businesses could locate in the city to gain as much information around these policy areas as possible.'",
        "'speaker_3': 'Staff performed outreach to the community, contacted other jurisdictions to learn best practices, researched laws and regulations, and held internal discussions with city departments responsible for licensing and regulating cannabis facilities. As part of the Feasibility Study Council requested that staff explore the feasibility of a licensing cap on delivery businesses.'",
        "'speaker_3': 'A licensing cap would limit the number of businesses that could operate in the city at any given time. Similar to the licensing cap on dispensaries. One of the primary reasons the cap was placed on the number of dispensaries in the city was to limit any potential negative impacts from overconcentration of retailers in the city, while still providing'",
        "'speaker_3': 'consumers with sufficient access to cannabis. However, unlike dispensaries, delivery businesses must remain closed to the public. Similar to other non-retail cannabis business types, thus reducing the potential impact on the surrounding community associated with having customers frequent the establishment.'",
        "'speaker_3': 'When staff requested feedback from the community on a licensing cap for delivery businesses. 59% of respondents in a community survey did not agree that there should be a limit on the number of delivery businesses citywide. In addition, when we reviewed other jurisdictions policies, no other jurisdictions that a cap on the number of delivery licenses allowed in their'",
        "'speaker_3': 'city. Jurisdictions who have that caps for other license types exclusive to equity have experienced a high rate of predatory agreements and other unfair business practices utilized by individuals seeking to partner with equity applicants who would otherwise not qualify for a business license without that partnership.'",
        "'speaker_3': 'A way to avoid these challenges is to adopt a delivery program that does not place a cap on the number of available licenses, thus reducing the risk of individuals engaging in predatory practices. Under a licensing model that does not have a cap.'",
        "'speaker_3': 'The total number of businesses would be determined by property availability and local consumer demand for cannabis products purchased via a delivery business. Staff then explored the concept of prioritizing the delivery license plate for equity applicants or making the license type available exclusively to equity applicants by offering this license type exclusively to equity applicants.'",
        "'speaker_3': 'Equity applicants would be afforded an opportunity to gain access to the retail market with little to no competition from non equity businesses in Long Beach. However, restricting non-equity individuals from this license type does come at some risks of those individuals engaging in predatory practices against equity applicants.'",
        "'speaker_3': 'This is why staff has also researched ways to prevent and protect equity applicants from these practices, which will be explored further in this presentation. Although it does not come at no risk making delivery licenses, exclusive to equity applicants would provide the greatest opportunity to level the playing field and allow equity businesses to have a long term foothold'",
        "'speaker_3': 'in the cannabis market in Long Beach. The community also largely supports the concept of making delivery licenses available exclusively to equity. Lastly, staff explored the various requirements surrounding where delivery businesses would be able to locate in Long Beach.'",
        "'speaker_3': 'As we have heard over the years from equity applicants going through the city's licensing process. Identifying and securing property has been one of the most difficult barriers to overcome. Equity applicants have reported that there are overly restrictive zoning and buffer requirements, limited inventory of available and compliant properties, a lack of credit or lease history for equity applicants'",
        "'speaker_3': '. A lack of education by the property owners of the equity program and predatory lease agreements or premiums charged to cannabis businesses, police space or staff is exploring ways to reduce some of these barriers to entry across all license types.'",
        "'speaker_3': 'When exploring the delivery license type staff first needs policy direction on the number of businesses that will be allowed before providing a recommendation regarding the zoning for this license type. The number of businesses allowed in the city will impact the zoning determination due to the level of impacts that could be experienced throughout the city.'",
        "'speaker_3': 'The common concerns around delivery that staff would need to address in a zoning determination are related to parking and traffic. For these reasons, staff proposes to explore the impact and make a determination regarding zoning during the ordinance drafting process.'",
        "'speaker_3': 'Although it was not included as a policy area under consideration, it is important to note the enforcement approach that can be taken regarding illicit delivery businesses. Currently, cannabis enforcement activities are conducted on a complaint basis. Therefore, if staff receives a complaint regarding a potential illegal cannabis facility, staff will investigate the complaint and take the appropriate enforcement action'",
        "'speaker_3': '. However, the current enforcement model and the existing staffing capacity cannot effectively proactively detect or prevent illegal delivery businesses in Long Beach. What I mean by that is that if a delivery business advertises its services on an online platform, which they typically do, they do not indicate where their facility is located in the advertisement and pursuant to state'",
        "'speaker_3': 'law. Businesses can legally deliver across jurisdictional boundaries, meaning a delivery business operating in Los Angeles could technically legally sell to a Long Beach customer. Due to these challenges. We don't know the nature and extent of the illicit delivery market in Long Beach, which would be those businesses storing cannabis products and delivering from facilities located in Long Beach'",
        "'speaker_3': '. If City Council were to desire a new approach to enforcement, $25,000 would be needed to hire a consultant to perform outreach and research on potential models of enforcement and best practices. The study would then outline an appropriate enforcement approach, along with any additional resource requirements, which would likely include a significant additional cost above what is currently budgeted'",
        "'speaker_3': '. In conclusion, staff recommends that there be no licensing cap on delivery businesses and that delivery licenses be made available exclusively to equity applicants. These recommendations provide the greatest impact on equity ownership are consistent with community expectations, and although there is a moderate risk of predatory practices, staff are confident that we can put the necessary protections in place'",
        "'speaker_3': 'to reduce these practices from occurring. So the next study I would like to talk about is the equity dispensary feasibility study. To provide some background. There are currently 32 licensed cannabis dispensaries operating in the city today. None of the 32 dispensaries are owned by equity individuals, due in large part because the equity program did not exist at'",
        "'speaker_3': 'the time licenses were awarded. Therefore, equity applicants have been completely shut out of the retail market. Given the time, given the impact that new dispensary licenses would provide for the equity community, we really emphasize the importance of community feedback in this process.'",
        "'speaker_3': 'To solicit community feedback. Staff staff held a virtual community meeting open to the public, held virtual roundtables with well-known cannabis organizations and equity organizations in Long Beach, and provided a survey which was pushed out through email campaigns, various websites and social media.'",
        "'speaker_3': 'Staff identified four key policy areas for the equity dispensary study. First was the issue of what an appropriate number of equity dispensaries would be for the city. And although the motion requested up to eight counsel did request, we look into the appropriate number for the city during the study.'",
        "'speaker_3': 'Second was the issue of expanding the Green Zone, as this has been a primary barrier for most applicants. Third was the type of competitive application process that would be used to select the equity applicants to move forward in the dispensary licensing process.'",
        "'speaker_3': 'And last was how we could prevent or protect equity applicants from predatory practices in the future. Each of these policy areas was necessary to explore to ensure the success of the Equity Dispensary Licensing program. Each recommendation surrounding these policy areas was crafted very thoughtfully, with the goal of developing a program that would not only provide a pathway'",
        "'speaker_3': 'to licensure for these applicants, but to also ensure that they would be successful in obtaining a license and ultimately operating their business for years to come. Our first recommendation regarding licensing caps is to allow up to eight licenses or 20% of all dispensary licenses to be made available exclusively to equity applicants through the survey.'",
        "'speaker_3': 'Virtual meetings and roundtable discussions. We asked the community what they felt would be an appropriate number. The average response from the survey was that there should be 34 dispensaries for equity, in addition to the 32 dispensaries that exist today.'",
        "'speaker_3': 'What respondents reiterated in the meeting were that there should be a 5050 ratio for equity and on equity. In that instance, it would bring the total number of dispensaries in the city to 64. Although this was seen as an equitable number of businesses, there are some practical concerns.'",
        "'speaker_3': 'It is unclear if the market would sustain that many dispensaries, and there were concerns from the industry that that many additional dispensaries might impede. On the success of all the dispensaries in Long Beach. Participants believed that the number of businesses should be sustainable for not only the existing dispensaries, but also the new equity dispensaries opening their doors'",
        "'speaker_3': '. When staff researched other jurisdictions, many jurisdictions are allocating between 20 to 50% of their dispensary licenses to equity. It's important to note the many jurisdictions with a higher allocation built that into their original dispensary licensing process. There were also practical implications when it came to the amount of assistance the city could provide through the form of direct'",
        "'speaker_3': 'grants and technical assistance. On average, it will cost the dispensary over $500,000 to become licensed and fully operational. Equity applicants are heavily reliant on the city to provide some of this capital to avoid them getting involved with an investor who might be predatory.'",
        "'speaker_3': 'Given the current level of grant funding. Eight businesses would be awarded around $126,000 in grant funds. This would also just be if grant funds were awarded to the dispensaries and no other equity businesses. While we are confident more grant funds will be received, grant funds are not guaranteed in order to provide the greatest level of support to'",
        "'speaker_3': 'these businesses. Staff recommends allowing up to eight equity dispensaries in the city, which would bring the total number of dispensaries to 40. Staff also recommends expanding the Green Zone in Long Beach to allow more opportunities to equity applicants so they can find viable locations to operate their dispensary.'",
        "'speaker_3': 'Properties that comply with all the current regulations are very limited in the city of most commercial corridors or within the buffers of schools, parks, daycare centers and or beaches. Staff identified that expanding the Green Zone would help alleviate some of the challenges with securing viable properties.'",
        "'speaker_3': 'Without an expanded Green Zone, it is possible some equity applicants will find no viable properties to conduct their cannabis business, or they will experience significant delays due to the extended search for a viable property to determine which changes would produce the greatest impact in expanding the Green Zone while also maintaining public health and safety.'",
        "'speaker_3': 'Staff conducted a spatial analysis, reviewed community feedback study buffers in other jurisdictions and discussed buffer amendments with internal city departments. Staff developed the following recommendations. Recommendations Should the City Council wish to allow additional dispensaries? First is to remove the park buffer and implement a 600 foot buffer from playgrounds and a 600 foot buffer from community centers.'",
        "'speaker_3': 'Currently, parks include all open space areas, including some areas that are not frequently used or are not traditionally viewed as parks, including medians, dog parks, marinas and waterways. Staff recommend focusing the buffers on those areas of the city that have large number of children present and or are predominantly patronized by minors, which typically include areas with playgrounds'",
        "'speaker_3': 'and community centers. The second is to reduce the school buffer to 600 feet to align with the state's requirement. Long Beach has over 145. Charter public and private schools, which is severely limited the amount of available property in Long Beach.'",
        "'speaker_3': 'Although there are some concerns over child access and exposure, there are reasonable protections in place to prevent this, including age requirements for individuals to enter the cannabis facility. Opaque exit packaging. When a customer leaves the facility with cannabis and the sale of prepackaged cannabis goods to reduce odor.'",
        "'speaker_3': 'Staff recommends aligning with the state's requirement to open additional space in Long Beach. And third is to remove the beach buffer. As we know, Long Beach is mainly bordered by a beach which does limit some commercial corridors of the city.'",
        "'speaker_3': 'Eliminating the beach buffer would have a significant impact on the Green Zone. In addition, protections would still be in place when children are present as any beaches that contain a playground or community center would continue to have a 600 foot buffer.'",
        "'speaker_3': 'In total, these changes would add an additional 3.1 miles to the Green Zone in Long Beach, which would provide significantly more opportunities for equity applicants to find viable properties. In terms of application processes to select these equity applicants for dispensary licenses, staff identified four options as found in other jurisdictions who have had similar dispensary licensing programs.'",
        "'speaker_3': 'Based on community feedback, a review of best practices and applying an equity lens to this analysis, staff recommends a hybrid application process that would include both a merit based review process and a lottery process. The merit based review process would include a full discretionary review of applications based on an applicant's fitness to become a cannabis business owner'",
        "'speaker_3': ', as well as their experience during the War on Drugs and their history in the equity program. Unlike the city's last dispensary application process, which was also a hybrid model, this process would include a merit based process that includes the city's RFP process instead of just a simple point scoring criteria.'",
        "'speaker_3': 'And then the qualified pool would attend the lottery. There is proposed to be four phases of this hybrid model. Phase one involves review of pass fail eligibility criteria to determine if an applicant submitted all the appropriate paperwork, meets the requirements of the equity program or any other criteria to be eligible for this process.'",
        "'speaker_3': 'This phase is typically conducted by internal city staff. Then Phase two involves a review of evaluation criteria. This is part of the discretionary piece of the process similar to an RFP. Applications or proposals will be evaluated and scored by a panel of individuals looking at best practices in other cities.'",
        "'speaker_3': 'The panel will be scoring applications that are redacted for any identifying information to reduce bias. The panel is proposed to be a voluntary panel consisting of individuals with expertize in economic or business development, actively involved in social equity matters or cannabis regulators from another jurisdiction.'",
        "'speaker_3': 'To reduce bias, we recommend the panel should not be affiliated with the cannabis industry in the city of Long Beach. After the panels provide their scores, staff will tally up their scores and rank the application. Those that meet a certain threshold will move on to phase three or the interview phase of the application process similar to an'",
        "'speaker_3': 'RFP. This allows the individual to provide clarity or context to their proposal and give the panel an opportunity to determine the legitimacy of an applicant. Any individuals who are deemed to be part of the qualified pool by the panel will then be placed in a lottery to select the eight applicants awarded to move forward in the licensing'",
        "'speaker_3': 'process. It is important to note that the evaluation criteria has not yet been developed. Given the feedback from the community on wanting to really help shape the program. Staff is recommending hiring a consultant for $50,000 to conduct a co-designing process with the community to develop the criteria.'",
        "'speaker_3': 'This would give the community an opportunity to provide feedback on criteria they believe is important and necessary to ensure that equity applicants will be successful. Business Owners. Staff would then work with the consultant and the community's input to ultimately develop recommendations for the City Council's approval.'",
        "'speaker_3': 'Starting from today. This process would likely take a full year to draft the ordinance, develop and implement the application process, and ultimately select those businesses able to move forward in the licensing process. Should the city council move forward with directing staff to prepare an ordinance?'",
        "'speaker_3': 'It is anticipated that with current staffing levels it would take approximately three months to develop the ordinance. At the same time, staff would be conducting the RFP for the CO-DESIGNING consultant, as well as performing recruitments for additional staff.'",
        "'speaker_3': 'The ordinance would likely take effect in February, at which point shortly thereafter we would be continuing to work with awarding the contract to the consultant, as well as starting to license delivery and shared use manufacturing businesses in Long Beach.'",
        "'speaker_3': 'Once the consultant is selected, the Co-Designing process will take a couple of months, which would likely occur around April of next year. The dispensary application process would then open in May of 2022 and would likely be conducted over a period of five months, with applicant selected in November of 2022.'",
        "'speaker_3': 'Lastly, staff explored how to prevent or protect equity applicants from predatory practices. Which are those predatory agreements or other unfair business practices utilized by individuals seeking to partner with equity applicants who would otherwise not qualify for a license without that partnership, providing protections against these practices are absolutely necessary to ensure the success of the equity program.'",
        "'speaker_3': 'Without these protections, the integrity of the program is at risk. And ultimately these licenses could perhaps fall into the hands of a non equity individual, harming that equity individual's chance to build generational wealth. Staff identified two recommendations to assist with this effort.'",
        "'speaker_3': 'One is to strengthen equity provisions in the municipal code, and the other is to provide more education, training and direct technical assistance. There are many different options for municipal code protections that would need to be explored in further detail during the ordinance drafting process to consider which ones are the best fit for Long Beach and the equity'",
        "'speaker_3': 'program. Some examples include barring non-equity, individuals or entities from having an ownership interest in more than two equity cannabis permits setting a minimum time limit that a business must be equity owned. Setting a time limit before an equity business can transfer ownership.'",
        "'speaker_3': 'Or allowing multiple equity applicants to have a majority ownership in a license. When we asked equity applicants what they thought would assist them the most with this issue of predatory practices, we overwhelmingly heard about the need for more direct technical assistance and education.'",
        "'speaker_3': 'Although we are starting to provide some technical assistance to equity applicants, applicants have specifically voiced the need for training regarding owning and operating a dispensary business, as well as having attorneys on hand to assist in reviewing legal documents.'",
        "'speaker_3': 'Many times, equity applicants will enter into predatory agreements without knowing the harm done. We are hoping to prevent that by providing those resources to the applicants upfront before they sign on the dotted line. The recommendations as outlined in this presentation will require additional resources to implement.'",
        "'speaker_3': 'This slide represents all the resources that would be required for both the delivery license type and the equity dispensary license type. Staff is requesting $75,000 for a technology solution for the equity program. $50,000 in one time for the community engagement consultant, as well as an additional $200,000 to guarantee funding for the direct technical assistance needs of the'",
        "'speaker_3': 'program. Currently, the administration of the equity program is conducted using manual processes and outdated technology in order to streamline the review of applications, administer grant funding and provide reports on equity program statistics. $75,000 is needed to develop a software program that can accommodate these functions on an ongoing basis.'",
        "'speaker_3': 'In addition to the one time costs, staff is also requesting two full time employees to support the administration and expansion of the program. One of t would be to support the business license division in the Department of Financial Management, and the other would be to support the Office of Cannabis Oversight in the City Manager Department.'",
        "'speaker_3': 'The cost for the two structural activities is anticipated to be $230,000 annually. Staff is requesting to structural active as opposed to temporary staffing due to the increased workload of the cannabis program over the last few years. These two employees will not only support the implementation of these license types, but will also assist businesses through the licensing process'",
        "'speaker_3': ', which could take years and provide ongoing regulatory support and work on future policy changes that would affect the cannabis program and equity program. Over the years, staffing has been reduced for the cannabis program across the city, and these staffing resources are necessary for any expansion of the cannabis program in Long Beach.'",
        "'speaker_3': 'To offset these one time and structural cost staff is recommending a tax increase on all cannabis businesses that pay a tax on gross receipts. This would include all delivery, dispensary, lab testing, manufacturing and distribution facilities inclusive of any equity businesses.'",
        "'speaker_3': 'Staff is recommending a point to 5% increase on the gross receipts tax, which would result in increased revenues of approximately $609,000 annually. This increase would be able to cover the costs of the one time needs and a portion of the cost of the empties in FY 22 and would be structurally incorporated into the NY 23 based budget'",
        "'speaker_3': '. Through these policy recommendations in the work that we have been doing on an ongoing basis, we have addressed most of the challenges identified by equity applicants with becoming a cannabis business owner. We are increasing the availability of cannabis retail licenses.'",
        "'speaker_3': 'We have approved an ordinance allowing shared youth manufacturing in Long Beach. We continue to offer direct grants and loans to equity applicants throughout the licensing process. We are developing policies to help assist applicants with securing Green Zone property.'",
        "'speaker_3': 'We are expanding access to technical assistance and training programs and we have been involving the community in every step of the way. Although there is more work to be done, we are confident that the work we are doing and continue to do are further supporting the goals of the equity program.'",
        "'speaker_3': 'In conclusion, we are recommending to allow delivery with no licensing cap and make licenses available exclusively to equity applicants. Expand the Green Zone for dispensaries in Long Beach. Allocate eight new adult use dispensary licenses or 20% to verified equity applicants.'",
        "'speaker_3': 'Use a hybrid application process, including a merit based review and lottery to select which equity applicants can move forward in the dispensary licensing process. Strengthen the Long Beach Municipal Code and provide additional education, training and direct technical assistance to equity applicants.'",
        "'speaker_3': 'Add to of to Eve at an annual estimated cost of 230,001 time funds of 325,000. Increase the cannabis business license tax by 0.25% for all cannabis businesses, charged a percentage of gross receipts and report back on the status of these new equity license types in 24 months.'",
        "'speaker_3': 'Should the City Council wish to allow delivery in equity dispensaries in Long Beach? We request that Council direct the city attorney to prepare an ordinance as well as provide the appropriations for the one time funds and the approval for the ongoing structural costs of the two.'",
        "'speaker_3': 'These. Thank you. And I'll stand by for any questions.'",
        "'speaker_0': 'Thank you, Mr. Mayor. That concludes that presentation. Thank you. Let me. Just go back. I go to public comment first. You know what? Okay. Let me first go to public comment and I'm going to read I have nine members of the public.'",
        "'speaker_0': 'Let me just read all nine members. If you want to just line up, please. And I can say Luis Carlos Zee, Matthew Souza may very well. Julian Xavier, Violeta Aguilar, Andrew Cruz and Derrick Smith of Common Names are in this order tonight.'",
        "'speaker_0': 'Ken Elliott Lewis Carroll Courtesy Matthew Souza May Burial. Julian Xavier. Violeta Aguilar, Andrew Cruz and Derrick Smith. The goal of social equity laws is to ensure that people from communities disproportionately harmed by marijuana prohibition and discriminatory law enforcement are included in the now legal marijuana industry.'",
        "'speaker_0': 'This is according to the National Cannabis Industry Industry Association. As it stands. The Bureau of Justice states blacks who compromise, who comprise 13% of the national population or 49% of people arrested for drug selling, and 36% of persons arrested for drug possession.'",
        "'speaker_0': 'And in the city of Long Beach, we make up 0% of the 32 holders of cannabis licenses. And without a local hire requirement of our presence, even as mere employees seems to be another element not to be tolerated.'",
        "'speaker_0': 'So who does the social equity share rates truly serve? Reserving eight new licenses for equity applicants through a program that has as of yet served zero of its clients toward obtaining a retail location is a doomed project from the very beginning.'",
        "'speaker_0': 'And looking at the feasibility report. Miss Armstrong, I read all 26 pages. I am ashamed to see an attempt to use a Trumpian economic empowerment zone, i.e. using capital to deprive neighborhoods, to create a shell, to funnel federal money into investment in what is still considered a Schedule one substance.'",
        "'speaker_0': 'That won't fly in court. Mr. City Attorney Now Solutions. I think Stash recommended the idea of time limits for transfer of equity ownership is a great equity protection. Let's put some teeth on it. Let's make it in perpetuity.'",
        "'speaker_0': 'In the state of New York, 50% of all cannabis licenses will go to social equity applicants. We're obviously better than the state and the city of New York. So the city of Long Beach should be 100% marginalized. Communities should not be combating of Big Pharma and private equity for capital investment, business licenses and real estate.'",
        "'speaker_0': 'There's a reason that the Green Zone is trying to be expanded today into East Long Beach, and not one measure in first came about in 2016. I got plenty of time on this. First time I wrote anything down.'",
        "'speaker_0': 'I think that I should do that more often. There probably is. There's a it's the irony of this is that the equal protection clause prevents us from making exclusively racial laws in relation to things like that. Okay. But property like this, expansion of the Green Zone.'",
        "'speaker_0': 'There's a racial element in it. If you couldn't afford the land in 2016, you got what you got in a lot of the central and western areas that you cannot afford to get today. It's becoming a feudal system with the delivery versus retail storefront.'",
        "'speaker_0': 'I think that the city needs to step in because we can't let the wolf who's in the henhouse regulate themselves. Thank you. My name's Elliott Lewis. I'm with the Catalyst Cannabis Co. First, I want to say, if you guys know me, I've been known to be critical of government from time to time here.'",
        "'speaker_0': 'I would take a very positive stance. I'm just really impressed with Emily and Ty have put together. They really put time and effort into hearing all the stakeholders, all the different opinions from the equity applicants to every stakeholder industry, different city.'",
        "'speaker_0': 'So I want to applaud them as well as city council members who have reached out and asked questions and been curious. And I'm just so proud that we're approaching this issue how we have and this is a broader discussion.'",
        "'speaker_0': 'You know, seeing the Latino Cultural Center and seeing the diversity of the people that were appointed to the commissions is just great. It makes me proud to be a Long Beach resident. So, you know, I want to come out and focus on the positive.'",
        "'speaker_0': 'You know, I'll be the first one when government does something that, you know, I disagree with to be outspoken. But I think it's important on this matter when it deserves praise, it gets it's it's praise. So I think it's a super nuanced issue.'",
        "'speaker_0': 'It's very difficult. And I'm very proud how the city's approached it. I will say I'm really vehemently opposed to the tax increase, so I'm not going to get into the rabbit hole of different industries that you could tax that are around town oil.'",
        "'speaker_0': 'But I will say that there's plenty of places and, you know, we're being utilized as a piggy bank. At the end of the day, three quarters of the market is illicit. If you want to create jobs, we have to reduce our tax rate.'",
        "'speaker_0': 'So it's not only a quarter point, but at some point, you know, you have to put down the line. The other thing that I would say is I'd like to go with full merit based. I think that's better.'",
        "'speaker_0': 'It's very important to take in the biography of somebody, you know, and then there's other things that go into that, like, is this person going to have high labor standards? I know some people in cities have signed up for union contracts.'",
        "'speaker_0': 'These costs 20, $25,000 more in order to run. And then really just see if this person has the hustle gene. Because at the end of the day, if you ain't got the hustle gene, you're just you're not going to make it.'",
        "'speaker_0': 'So we're trying to do a hand up, not a handout. And, you know, everybody wants to talk about barriers of entry being, you know, money and finance and the red tape and those are there. But the thing that I want to talk about that I think is important is the industry itself.'",
        "'speaker_0': 'And sometimes the political class holds down social equity through social equity from from from happening. And, you know, look, it's hard. I'm looking at the new map myself and I'm thinking, damn, another eight licenses. Well, I got shareholders, too.'",
        "'speaker_0': 'And we're all trying to make a profit. If I'm being honest with myself and I'm checking out the areas I understand, you know, sometimes where the industries coming from. Unfortunately, Councilman Richardson isn't here to respond to my remarks.'",
        "'speaker_0': 'But, you know, we brought this issue up with him many times and would influence what the industry does in the political class is they don't really address the issues. And his quote to me on several occasions, he must be hiding in the basement what his black and brown brothers and sisters aren't ready for social equity.'",
        "'speaker_0': 'And to me, that shows and that's a quote verbatim. And to me that shows the problem sometimes that the industry itself and the political class, they're engaged in pandering and gesturing but don't really want to get stuff done.'",
        "'speaker_0': 'But I would add on a positive note, great job staff. Great job, everybody. And city council that reached out. Thanks. Did any man, mayor and city council want to start off by saying that? I'm very disappointed with the recommendations being proposed by this report.'",
        "'speaker_0': 'First, this report is only recommending additional dispensary licenses to be made available to social equity applicants. Only if the Mayor and City Council move forward with this recommendation. Eight out of 40 dispensary licenses will be owned by social equity applicants.'",
        "'speaker_0': 'That is only 20%. 20% is really just the tip at a restaurant. It is an end, it is an afterthought and shows the lack of effort put in to create an equity in the cannabis space. Second, if the selection process includes any form of lottery, it is lazy and cheap.'",
        "'speaker_0': 'What a way to devalue and dehumanize the human experience by essentially putting this in a hat and drawing names at random. Moreover, don't use eight dispensaries, share manufacturing and delivery licenses as a distraction from truly resolving the issue.'",
        "'speaker_0': 'There is a lack of diversity in the cannabis sector, especially when it comes to dispensary ownership. For context and lobby, two 0% of dispensaries are owned by the black and brown community. Unfortunately, this is not unique to lobby.'",
        "'speaker_0': 'It is an endemic statewide black and brown dispensary. Ownership is pretty much nonexistent. Besides elected government, a government officials who determine who gets cannabis licenses. Licensed dispensary owners have the second most powerful position in the cannabis chain. Re Max y.'",
        "'speaker_0': 'Food for thought dispensary owners work as the gatekeepers into the cannabis space, meaning they determine what products hit the shelves, and most importantly, they can open up doors of opportunity. Obviously, the more diversity among dispensary owners, the more diversity in the cannabis space overall.'",
        "'speaker_0': 'The only time trickle down anything will work. I want to end with this. On July six, 2021, the last time I was here, we came together as a community to condemn the desecration of Martin Luther King statue. As a reminder, Martin Luther King Martin Luther King's versus was not just about racial justice.'",
        "'speaker_0': 'His message was also about the redistribution of wealth and power. Honoring and preserving his legacy is not simply about protecting the statue, but also about creating and implementing policies that will redistribute wealth and power in the indigenous, black and brown communities.'",
        "'speaker_0': 'As I stand in front of you, I can't help but notice that the city council's makeup is diverse. You all have directly benefited from our Luther King's work. Now you have a choice. Do you sit down and enjoy the benefits of Martin Luther King's work and an unfortunate death?'",
        "'speaker_0': 'Or do you pick up the baton and truly honor his legacy by creating and implementing policies that will redistribute wealth and power in communities of color that have been negatively impacted by the war on terror. Thank you.'",
        "'speaker_3': 'Great evening, everyone.'",
        "'speaker_1': 'With giving all glory and honor to God. My name is Muriel Burrell, also known as May, and I was born and raised in Long Beach, and now I am a verified social equity applicant.'",
        "'speaker_0': 'Mr.. I'm so sorry. We have to keep the mask on.'",
        "'speaker_1': 'Okay? It's hard to talk with this.'",
        "'speaker_0': 'I know. I'm so sorry.'",
        "'speaker_1': 'Currently there are 32 non equity owned dispensaries in operation within the city and they have been operating for years. Yet these next eight potential eight social equity owned stores that we discussed tonight patiently, impatiently wait for their chance to operate.'",
        "'speaker_1': 'I do ask tonight that you do your best to expedite this process. Also, as Emily mentioned, locating property is the biggest problem. But that problem could be solved if the city gave us access to its own properties, which would help us to avoid those predatory practices.'",
        "'speaker_1': 'Also, regarding the lottery choice, I do ask that you all do not allow the lottery choice of dispensaries where greedy snake investors seek to benefit. Instead, begin with the waiting list that the program already has in place, starting with applicant number one.'",
        "'speaker_1': 'Also, I do ask for an unlimited amount of delivery licenses, yet only awarded to 100% equity owned businesses. And regarding the stars that I saw tonight in wanting to employ new employees within the city. I was saddened to see that because we have less than a handful of social equity applicants that have successfully, successfully gone through the'",
        "'speaker_1': 'program. And yet you all are looking to employ more people when that money could go toward us in helping more applicants actually successfully go through the program instead of us sitting around talking about it. Thank you. Mr. Mayor and the Council.'",
        "'speaker_1': 'My name is Jillian Xavier. I am originally from the island of Trinidad Tobago. I have been this country for over 45 years. And I want to tell you, I can read from this, but I'm just annoyed. The lottery is not the way to go.'",
        "'speaker_1': 'I've been a social equity entrepreneur since the inception of the program. We've been sitting here looking for properties that don't exist at all. Right. Because you have this map with a bunch of dot. A couple of stars that says if they're approved, all the dots are just applications.'",
        "'speaker_1': 'Applications that went in. It's been sitting there for a year or two. But you have. For 20 properties and all these properties then yeah, we have some history to look at. You get over there and there's another applicant that's already, you know, sent in an application.'",
        "'speaker_1': 'They can't find the presenter. We send the application. We need help having a lottery. That's a lot. And then you're still asking for money to hire more people. Shared kitchens have been. Shared manufacturing had better access. July, what's going on with that?'",
        "'speaker_1': 'Have you reached out to anybody who's already in the manufacturing? I said, we want to work with social equity. There's no where that study we're sitting here frustrated. You're telling me to wait another 20, 22 to get in on a lottery that's just been sitting here since 2016?'",
        "'speaker_1': 'Like, what are you guys going to do to help us get into business? Help me help you get your taxes so I can help the community and I can bring people, these young people. And look, I'm a mother whose son was shot and killed at 18 years old.'",
        "'speaker_1': 'I will not be a grandmother. I'm in this business because I have a passion for it. Cannabis has helped me stay off pharmaceutical drugs when they would say, Oh, just take this Prozac. Well, but wait a minute, you might hallucinate.'",
        "'speaker_1': 'Cannabis has helped me. That's why I'm passionate. Talk to the passionate ones, not the ones just sitting here trying to cash a check. Now, was this trying to change the community, bring these young people off the street, show them how to be owners of their own business?'",
        "'speaker_1': 'That's what's important to me. And we need to do better. And I'm asking you guys to really not do this lottery thing because we have been here standing for a long time. My name is Joni and Lisa Xavier.'",
        "'speaker_1': 'I'm not going anywhere and I'm asking you guys to do better.'",
        "'speaker_3': 'Good evening, Honorable Mayor and City Council. My name is Taylor with Catalyst Cannabis Co. And as you know, Catalyst is very proud to be here in Long Beach and who have four stores here in the city of Long Beach.'",
        "'speaker_3': 'We just opened our last location in downtown Long Beach, and it has been a great community effort to really revitalize the whole block.'",
        "'speaker_1': 'So this is what we believe cannabis can do for our communities.'",
        "'speaker_3': 'We have been advocating and.'",
        "'speaker_1': 'Working on port policy in.'",
        "'speaker_3': 'The city of Long Beach that provides actual opportunity for social equity applicants. Through this process, we have had the opportunity to closely work and collaborate and learn from folks that have gone through the social equity program here in the city of Long Beach.'",
        "'speaker_1': 'We have come to learn firsthand through our partnership with.'",
        "'speaker_3': 'Carlos from push and delivery.'",
        "'speaker_1': 'Of the barriers and.'",
        "'speaker_3': 'Challenges social equity businesses face.'",
        "'speaker_1': 'Even when they have all of that support.'",
        "'speaker_3': 'Including access to capital, including access to vendors. There's still many, many barriers that social equity applicants face. So that is.'",
        "'speaker_1': 'Why right here, we want to make sure.'",
        "'speaker_3': 'That those barriers are removed and that they.'",
        "'speaker_1': 'Are able to open business. So we are glad to see that the city has moved to add additional brick and mortar licenses as we see this as the real entry to the industry.'",
        "'speaker_3': 'We support this and we urge.'",
        "'speaker_1': 'Council.'",
        "'speaker_3': 'To support merit based.'",
        "'speaker_1': 'Process when selecting new applicants. We also support and really encourage the.'",
        "'speaker_3': 'City to really look at what are the.'",
        "'speaker_1': 'Like, what are the barriers and what are the processes that.'",
        "'speaker_3': 'We can implement to ensure that the technical.'",
        "'speaker_1': 'Assistance, training and education is a bit readily.'",
        "'speaker_3': 'Available for social equity applicants.'",
        "'speaker_1': 'And we reduce predatory.'",
        "'speaker_3': 'Practices. So as we continue this process, we are proud to be here.'",
        "'speaker_1': 'If we want to continue to be partners with the community, we want to continue to.'",
        "'speaker_3': 'Be part of this conversation with social equity applicants to ensure that the industry.'",
        "'speaker_1': 'Provides those opportunities.'",
        "'speaker_3': 'That we know are available in the industry for our communities.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Good evening, everybody. I like to think that first I'd like to take the opportunity to thank city staff and council for their hard work and dedication for social equity within this past couple of months or so, like a year now.'",
        "'speaker_0': 'It's been very frustrating for a lot of people, as you can see. So, you know, I really do appreciate your commitment to it. Emily Armstrong And kind of an oversight. I really do. Thank you guys for stepping up and moving forward with all these recommendations moving forward.'",
        "'speaker_0': 'I do have some. Give me 1/2 as I see recommendations being announced with the Agenda 19. I would also like to add some suggestions to city staff and council within our recommendations, given as we hope to move forward with adding to with annual estimated and one time calls and also increasing kind of effect licenses.'",
        "'speaker_0': 'I would suggest a community oversight committee that should be created and appointed to oversee the implementation of Long Beach Cannabis Regulation and Revenue Ordinance. The purpose of this committee is to convene representatives of the cannabis business operators, workers, patients and other key stakeholders in the cannabis industry to oversee the Cannabis Office of Cannabis Oversight Implementation by evaluating'",
        "'speaker_0': 'data on the industry's growth and also provide guidance and recommendations to the Board and counsel on amendments to local laws and regulations, including those governing the equity program to facilitate socially responsible growth of this new industry by creating living wage jobs and economic opportunities consistent with the city's intent to commit to the social equity and our minority'",
        "'speaker_0': 'community communities. Most importantly. As I said, we all know this is a frustrating task. Our goal is to all come together to try to reach these these endeavor, these milestones that both of us can, you know, get over when it comes to the RFP in a lot of respect.'",
        "'speaker_0': 'The lottery kind of impedes on an RFP. So like it would kind of be pointless to just do a RFP, do interviews, and then go with the lottery process out there. So thank you guys for your time and opportunity and I look forward to keep working with you guys.'",
        "'speaker_0': 'Good evening. I have a letter from my president, Andrew Zehnder, which I'm happy to give to you. But perhaps in the interest of brevity, I'll read you the highlights. My union. Yes. CW Local 324 represents 300 cannabis workers in the city.'",
        "'speaker_0': 'We appreciate the work of staff to craft a proposal that addresses the need for more social equity. Social justice is a core value of the CW, and we're pleased that Long Beach has taken the lead on this issue.'",
        "'speaker_0': 'In general, we approve the inclusion of labor peace and it remains an important tool for preserving job standards in the industry. We support the usage of merit based review during the application process. Collectively, we have sufficient experience assessing which operators are committed to upholding the letter and the spirit of the regulations that the city established.'",
        "'speaker_0': 'And we should draw from that experience and continue to promote businesses that play by the rules. We suggest the city delay the implementation of the tax increase of a quarter percent, although we recognize the value of a cost neutral program.'",
        "'speaker_0': 'We have to be mindful of the fact that the current legal industry only maintains about a 30% foothold in the city and that it's incumbent upon all of us to make every effort to increase that percentage if we have any hope of preserving a healthy industry.'",
        "'speaker_0': 'Increasing taxes will not accomplish that. And yes, UW continues its advocacy in this industry to ensure the promotion of the welfare of workers and the community in which they live. And we appreciate your consideration of our perspective. Thank you.'",
        "'speaker_0': 'Good evening. My name is Matthew Souza, and I'm actually going to allow Adam, the president of the LBC, to speak for me. Good evening. Sorry I didn't. Last time I was here, we were able to just walk up during the agenda item and talk.'",
        "'speaker_0': 'So I didn't lose a card, but. Good evening, Honorable Mayor City Council. My name's Ahmed Jazzy. I'm on the board of directors of the Long Beach Collective Association. You know, the BCA and other groups have been working for months to be able to craft and provide city staff and city council with recommendations to consider.'",
        "'speaker_0': 'I wanted to thank city staff's effort and the time that they spent to go through all the information that was provided not only from the local groups, but also from very from various cities in the state and nationwide.'",
        "'speaker_0': 'I wanted to highlight some important feedback that we received to date from many not only equity operators in other cities, but a diverse group of people that we've been talking to. Number one thing is there isn't really a social equity program in the state of California that actually in its entirety works.'",
        "'speaker_0': 'Right now, there's many holes in the various programs, and I think that we've been able to learn at least some of the things that have gone wrong, and we can successfully fix it here in the city of Long Beach.'",
        "'speaker_0': 'Time will tell the actual best direction for cannabis equity and all social justice efforts that are happening here in the city, state and nationwide. But there is some wrong steps to start going down this policy. First, raising taxes is not the right step to moving policy forward.'",
        "'speaker_0': 'Currently, the market today is a very intense market at overtaxed. We're paying taxes on taxes on taxes literally when it comes to the state and city. Some good things that are going to be key to a successful program is opening up the zoning for job applicants.'",
        "'speaker_0': 'That is definitely the right step. Also ensuring sustainability of the new and existing facilities to avoid overconcentration within the city. Everybody will have to actually operate and work within this industry once everybody is able to get included. Lastly, having a roadmap to education, training and the protections is going to be as important as any other policy item'",
        "'speaker_0': 'that we're deliberating over tonight. The ability for an applicant to get the proper training, education and having access at least to that is going to be paramount. Lastly, I want to say that timing is important. I think, you know, the process does take a long time and being able to streamline that process.'",
        "'speaker_0': 'What's happened in the city of Los Angeles is we have about three and a half, three years later, still waiting, only, barely, not even I don't even know how many have actually opened, but we have over 350 applicants are still waiting three years later.'",
        "'speaker_0': 'So I wanted to thank city council and I'm going to. Thank you. Thank you to all of our our speakers. We do have a motion on the second. I want to just read a quote from an owl in just a minute.'",
        "'speaker_0': 'I just want to quote Mr. Merkin. I might have some additional questions and comments. Just one clarification that I want to make sure that I that I heard I think I heard almost from from a few people, including you, CW.'",
        "'speaker_0': 'And I want to, of course. Reiterate what we said about labor peace provisions. I think most folks I've talked to in the industry, I've shared I'm sure that one of us I think I know it's difficult for some dispensaries, but one of the things that I really supported early on was the unionization of the workforce to me'",
        "'speaker_0': 'was incredibly important to for many of us that are familiar with the way unions operate. There was a sense of structure that was put in place and a sense of empowering the worker and the employer and the employee.'",
        "'speaker_0': 'That I think is really for many folks helped also add to the legitimacy of dispensaries and of the industry. And so I just want to thank you, UW, for all of their work. And I do want to also ask this question about the lottery versus the merit based system, because I've heard this a few times.'",
        "'speaker_0': 'What I want to understand, Mr. MARQUEZ So I have over the last few years, I have had a chance to, you know, run into or meet different folks that have been involved or been active in kind of a social equity process that obviously looking to open a dispensary and are trying to do it the right way.'",
        "'speaker_0': 'And and so my only concern about about the lottery system is that the folks that have been on the ground level then get left out of that process. And I'm not sure who's been there from the beginning or not exactly.'",
        "'speaker_0': 'But I just want to make sure that from what I understand, that what you're proposing is not a straight lottery, but some type of merit based lottery. Is that correct? It's you have a you have a merit based program and then the merit based program gets you into a lottery.'",
        "'speaker_0': 'Can you explain that? Yes, it's definitely a merit based program. First and foremost, you have to be merit based to get into it. I'll let Emily explain how the lottery would work after the merit based system and why we think that's a a reasonable approach.'",
        "'speaker_3': 'Yeah. So. So the intent is to go through a traditional kind of RFP process. And so that will involve evaluating proposals, determining fitness, determining their history with the equity program, their history with the war on drugs. And it's ultimately to get to a point where, let's say you have 100 applicants that apply for this.'",
        "'speaker_3': 'Maybe the panel ends up saying that 20 people could legitimately be cannabis business owners as equity applicants. They meet all the criteria. They have really great proposals. They have really great interviews. And then it really just comes down to how do you select eight?'",
        "'speaker_3': 'How do you select the top eight when they're all really great? And that would be the reason for the lottery.'",
        "'speaker_0': 'I see. I understand that. You know, my only thought, you know, my only thought as I think about that and and. Thinking about merit based program, particularly, you know, I you know, my experiences in like the college admissions world.'",
        "'speaker_0': 'And I think that that merit merit based programs work and they're the right approach. But we also look at not just who might appear on paper to be the exact perfect candidate, but also, you know, try to find those that have the potential and frankly, those that have been involved in the advocacy work and been part of'",
        "'speaker_0': 'our process now for many years. So what I just what I just hope you are taking into account and I'm not sure if it's part of the point system is if we have social equity folks that have been engaged with the city for years.'",
        "'speaker_0': 'And they qualify. Obviously, they have to qualify and meet all of your criteria. I think that's the most important thing. Right. And they qualify, meet the criteria. So that person have the same or or a better chance of being able to open a dispensary than an applicant that is just coming in.'",
        "'speaker_0': 'And so it is very it's part of the merit based program. Are there points awarded to two folks that have been kind of working with all of you now for for a few years in this process?'",
        "'speaker_3': 'Again, the criteria has not been developed and that is really the purpose of hiring the consultant. To do this kind of Co-Designing work around the criteria is to make sure that we are hearing that, and that's a part of the criteria and we have heard that.'",
        "'speaker_3': 'So the intent would be to hopefully prioritize those people that have been involved in this program for for a few years now.'",
        "'speaker_0': 'Okay. And then as far as it relates to the tax question. So I understand that the council recently obviously decreased the tax. That was something the council took action on recently. So not that I'm opposed to, you know, appropriately ensuring that things are taxed at an appropriate level.'",
        "'speaker_0': 'I think that's important. But it does seem a little bit counter to what we what we just did. And so I understand that it's to hire additional city staff, I think is two positions. Am I correct? But we there's no there's there is no other way to see.'",
        "'speaker_0': 'I mean, the when you open the turn of the century, we are going to see more tax revenue. Yeah. I'll jump in on that using that projection for the additional staffing. So we looked at that first. Can we use any of that money?'",
        "'speaker_0': 'We believe that that's not going to be available, at least structurally for at least several years, because we have to go through a process right now to bring on the staff, to do this work, to then work with everybody, to provide all the assistance.'",
        "'speaker_0': 'And then they're going to start opening probably two or three years down the road, maybe faster. Well, we did want to make this cost neutral. We did reduce the tax, but we reduced it in a in a specific area of cannabis.'",
        "'speaker_0': 'It wasn't on every single one, if I remember right, it was to specifically entice the manufacturing side of of the shop. And last year, when we were making our $18 million reductions out of a $30 million deficit, we looked first and foremost.'",
        "'speaker_0': 'And how do we not affect services? How do we not affect police and fire and parks and rec and libraries? And what we did first was to look at our cannabis group, which we had staffed up as we started this program.'",
        "'speaker_0': 'And then we felt we were kind of at the equilibrium where we could reduce that. We reduced in my office, we cut assistant to the city manager position, we reduced the are in business licensing with the idea and we discovered that to the Council that we couldn't take on new assignments if we got rid of that staff'",
        "'speaker_0': 'and then we kind of got this direction to go the other way. So that's what we're looking to do is to restore the staff that came up as part of the reductions last year. If we need to take on this additional work, there could certainly be other ways that you fund it.'",
        "'speaker_0': 'But then we'd be adding to the structural deficit and we'd have to come up with some other reductions in other departments. And what's it and what's the total amount? Uh, have you come to the 300 range? One option, which we have described is we do believe there are some grants out there that we can get some of'",
        "'speaker_0': 'this, uh, cost from like some of the technical assistance. What we don't think the grants will fund are the two administrative bodies. So we definitely need the two administrative bodies to move forward. It's potential you can get other state resources and then drop the tax a little bit so that it's not at the point five could be'",
        "'speaker_0': 'a little bit less if we get that direction too to look into that. Now, another thing, I think the council is been much more engaged, I think, and probably some members in the details of the proposal than I have.'",
        "'speaker_0': 'So I'm just kind of, you know, just chiming in on what I what I'm hearing. So I'll let the council, I think, ask they probably know more about about the the structure for the purpose for this funding or for the tax.'",
        "'speaker_0': 'I would just I would just say and then I'm interested in hearing what what others have to say is I'm wondering if and maybe this is not possible, but if before the actual tax was implemented, we could first go see if we can get grants and see how how the revenue actually starts coming in.'",
        "'speaker_0': 'Because that's my understanding that revenue has been performing fairly well on the cannabis side. Is that right? Yes, it has been going up and that's been part of our projections as well to help offset it hasn't has. And also the revenue has been in some cases higher than expected it has been.'",
        "'speaker_0': 'And those projections are part of our multiyear deficit. So, yes, they've been going up, but so have costs and other things. So those are included in there. I would just I would just, you know, in just in the discussions that the council has, I would just add that we interested to see if before we do the tax'",
        "'speaker_0': 'that we could look at first thing through our grants available that and I think that the the revenue we're seeing on the other end is is they're passing on expectations. So I think that's a very positive thing. Thanks to everyone that spoke today and the industry and and where things are headed.'",
        "'speaker_0': 'So I'll first of all, Councilman Allen and then kind of see where where I would comment on Councilman Allen.'",
        "'speaker_1': 'Thank you, Mayor. I just want to start by recognizing Emily and Ty for their hard work on this item. This is just a complex issue. And I know that you've been working on this for months, meeting with stakeholders, weighing options, and I appreciate how through these reports have been.'",
        "'speaker_1': 'So thank you very much. With respect to both delivery and dispensary retail license, I think that we have a real opportunity to expand the cannabis program and do it in a way that helps meet our social equity goals.'",
        "'speaker_1': 'This is a new industry and prior to we knew it was illegal. Many people suffered as a consequence of unfair drug policies. And I think it's really important that we do everything that we can to ensure that our social equity initiatives are robust and lead to a successful business.'",
        "'speaker_1': 'Regarding our delivery licenses, I fully support the staff's recommendation to pursue exclusive licensing for equity applicants with no caps on the number of licenses. This option, I think, has the most community support and the potential for the most impact as it provides an opportunity for equity applicant to obtain a delivery license.'",
        "'speaker_1': 'Regarding the retail dispensary license. I want to thank the staff for such a thorough report too. I do fully support the expansion of the Green Zone. Right now we're in a situation where there is not enough space for new businesses to set up shop.'",
        "'speaker_1': 'And without expanding the Green Zone, it's possible some equity applicants will not find a viable property to conduct their cannabis business. So I do support removing certain buffers and aligning with the state regulations to open up some space.'",
        "'speaker_1': 'I also appreciate the four option staff within it and how we might go about awarding retail licenses. While the staff did recommend the hybrid approach. I believe that the full merit based system is more appropriate. And I'll tell you why.'",
        "'speaker_1': 'I think the city and consultant, they can do a good job at categorizing and and awarding these contracts. I think that's important. And we do it that way because there are just equity applicants that have different stories. There's equity applicants that their lives and and lives of their children and grandchildren have been affected.'",
        "'speaker_1': 'And I think that we we can't we can't just pick from one on a lotto. I think that we have to. I think we need to do that on an RFP process. And I feel confident that that staff could do that.'",
        "'speaker_1': 'And then lastly, with regards to the proposed tax increase, I'm not fond of that either. I think right now the cannabis industry is taxed north of 30% and one of the most taxed industries. And and I think if we're ever going to expect these businesses to compete in the illicit market, the taxes should be lower.'",
        "'speaker_1': 'And so I'm not I'm not an advocate for for raising the taxes. And then lastly, I want to I think we need to expedite this process and whatever that looks like. I think we need to get this.'",
        "'speaker_0': 'Middle.'",
        "'speaker_1': 'On and long. And I agree with many of the speakers that we've been waiting a long time for for this to happen. Thank you.'",
        "'speaker_0': 'Well, thank you, Councilwoman Councilmember Renko. Thank you, Mayor. And I want to thank Councilmember Allen for her comments. There are a lot of them were right on with what I was thinking about. Well, the things that I that I like about the town, however, is the fact that the distance between businesses is smaller.'",
        "'speaker_0': 'I mean, it's gone from a thousand feet to 600 feet. Does that include a visit between within each other or is it just between like what the what the you mentioned about schools, parks and other only businesses.'",
        "'speaker_3': 'The 1000 feet between the dispensaries would still be maintained.'",
        "'speaker_0': 'Right. It's just one clarification on that. And then also when it comes to there was a commentary made earlier from one of the public speakers about lack of business, space, lack of building or other other opportunities to open a dispensary, perhaps even in the Green Zone.'",
        "'speaker_0': 'What about and we also just passed the law in its resolution a couple of weeks ago regarding the compensation for developers. For building affordable housing. I'm thinking about empty properties, empty lots. Those types of opportunities with that, would that come into play at all or were those properties stay available only for affordable housing and not and not'",
        "'speaker_0': 'to be able to not be eligible for a dispensary to be in that place. And obviously it would have to be away from from other houses and commercial areas.'",
        "'speaker_3': 'Yeah. So we haven't looked into that. But I will say we have looked into other ways to try to incentivize property owners to allow cannabis or use their spaces or use some of these vacant areas. I think there is still some legal challenges due to the fact that at the federal level cannabis is illegal and perhaps the'",
        "'speaker_3': 'money that we're using to incentivize it's federal funding that really can't be used for that purpose. And so we kind of have to be creative with the ideas, but that's definitely something that we can look into a little bit more.'",
        "'speaker_0': 'That's, I think. Thank you, Councilwoman Pryce.'",
        "'speaker_1': 'Mr. Mayor. So I have a couple of questions about this. I want to thank staff for your work. You guys have done an excellent job on this and.'",
        "'speaker_2': 'I know that. At least I.'",
        "'speaker_1': 'Have. I have at least one current. Cannabis business owner.'",
        "'speaker_2': 'Here tonight.'",
        "'speaker_1': 'Who spoke and that's Elliott Lewis. And and I've said many times in the past, the council office has had a tremendous working relationship with that operator. And to the extent that he's going to be involved in the social equity program, I trust that he will honor his word in regards to what he's shared with me regarding the'",
        "'speaker_1': 'goals of the program. And so I support the work that staff has done. I support very much the process that the staff has undertaken. But still, I do have a concern about the green zones and also. The number of cannabis dispensaries we have in each council district understanding that our redistricting commission is going through a redistricting process'",
        "'speaker_1': 'right now. One of the things that we made abundantly clear in the discussions that we had about cannabis leading up to the voter initiative.'",
        "'speaker_2': 'And even beyond, was we did not want.'",
        "'speaker_1': 'Cannabis dispensaries to be concentrated in any one particular area. We wanted them spread out throughout the city.'",
        "'speaker_2': 'Because certainly it would not.'",
        "'speaker_1': 'Be fair for them to be concentrated in any one or more areas. And one of the reasons that you guys have modified the buffers is, I.'",
        "'speaker_2': 'Think, to allow for more opportunities.'",
        "'speaker_1': 'For the establishment of the brick and mortar shops, which I think is great in looking at the distribution of dispensaries throughout the city. There are some that have one. There are some that have two, and then there are some that have six.'",
        "'speaker_1': 'So what I'd like to do is make sure that we have some fairness in terms of where future dispensaries go. So I'd be interested in talking to my council colleagues about some sort of a density cap per district, whether that's a conversation we have.'",
        "'speaker_2': 'Tonight.'",
        "'speaker_1': 'Or whether that's a conversation we have in the future as the new district boundary lines are created. That probably makes a little bit more sense because I think that's a conversation we need to have. Obviously, access.'",
        "'speaker_2': 'To cannabis was something that.'",
        "'speaker_1': 'Was discussed as being very important before it went to the voter initiative. A lot of people came to council and talked about the medical needs and how important access was for that medical purpose. And we've talked a lot about health and wellness.'",
        "'speaker_1': 'And so we certainly want to make sure that everyone throughout the city has access to this medical or recreational option. And so we with the buffers are hopefully.'",
        "'speaker_2': 'Allowing for.'",
        "'speaker_1': 'That. So the increase of the buffer zones is that allowing.'",
        "'speaker_2': 'More.'",
        "'speaker_1': 'Sites to be developed, more businesses to be established throughout the city. Is there now more opportunity in every district?'",
        "'speaker_3': 'Where there is more opportunity in every district. You know, some districts will have more available space just due to the number of parks or the number of, you know, buffers, the schools, the things like that. So there is expansion in every district.'",
        "'speaker_3': 'It just it differs between districts.'",
        "'speaker_1': 'Okay. But but sitting here right now, there is capacity in every district right now to take on more than there was before the vote on whatever the maps are tonight.'",
        "'speaker_3': 'Bear there could be.'",
        "'speaker_1': 'Okay. And then having said that, I do have an issue with one of the areas that it now appears to be an eligible buffer, and that is in the peninsula in southeast Long Beach. It seems like we are trying to build the buffers around places where children would gather.'",
        "'speaker_1': 'And yet every summer we invite over 600 children. We specifically, in fact, you have to be a child to participate in this program. We invite them to the peninsula to run along the beaches and go back and forth between the bay and the ocean.'",
        "'speaker_1': '600 of them from all over. We're really proud of the equity program that we've built for the Junior Guards program. We've got to with it there. We've got a sailing center there. We actually go out of our way to attract children to this area.'",
        "'speaker_1': 'And yet that's not a buffer or that's not a prohibited area. It's a residential area that has a liquor store and a cafe. I just don't think we should be allowing. If the goal is to protect children from peripheral proliferation of marijuana dispensaries, then we should not.'",
        "'speaker_2': 'Be inviting 600.'",
        "'speaker_1': 'Of them. And let me not even touch upon the numerous beach camps that the City Parks Department sponsors at Bay Shore. So I really would like to ask staff to reconsider that. I don't know if that's a conversation we can have right now, but I don't understand why putting a dispensary in the middle of the Junior Lifeguard'",
        "'speaker_1': 'program is allowed. It seems I can't defend that position. So if we're not able to remove that or somehow move the Junior Lifeguard program, I can't support the current boundaries. And I hate to say that because I think the program and the policy, everything we've done is great.'",
        "'speaker_1': 'But I cannot knowingly say 600 children throughout the city who were trying to give access an opportunity to welcome. There's no other businesses here, but there is a dispensary. It just makes no sense to me, so I can't support that.'",
        "'speaker_1': 'But other than that.'",
        "'speaker_2': 'I think the program's great.'",
        "'speaker_1': 'And I want to do whatever I can to support you. And I want to support the program. I just I don't understand why we need to have one on 67th Street.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman, Mongo.'",
        "'speaker_1': 'I will try to get through so many of these comments. Great presentation staff. You guys have done excellent work. I'm really proud of being a part of this City Economic Development Committee and the work that has been brought forward.'",
        "'speaker_1': 'Special thanks to Councilmember Austin Councilwoman Allen. I think this has been just a great eye opening opportunity. I also am supportive of a full merit based system, but I would say that banding similar to how we band exams for being hired in the city is appropriate because when you have big money at stake, a half a point'",
        "'speaker_1': 'to make a mistake at that level and the liabilities that can be brought into that. I just think that we should be put together a building system that makes sense, but that is merit based. And I agree with.'",
        "'speaker_1': 'Elliot about the hustle. Gene, I don't know how you judge for that, but. Being one of a few members of this diet who's actually been an independent business owner, the hustle gene matters. And we want to give people with the highest likelihood of success the opportunity to be there.'",
        "'speaker_1': 'I've talked to a dispensary specifically in my district, and one of them had said to me, Man, I think the taxes are too high. However, if I couldn't have gotten through the process and the time that I did because of the excellent staff you have.'",
        "'speaker_1': 'It would have taken me a lot longer to get my business off the ground. So I think that it's a push pull, right? If you don't have the staff to support the program, then the equity program will take three years.'",
        "'speaker_1': 'But if we staff up quickly and we make the investment. You could get an equity program off the ground more quickly and have that focused staff attention. And so everyone knows me. I'm not a big supporter of raising taxes, but I am a supporter of paying for the things that we need.'",
        "'speaker_1': 'And at least in my discussions with dispensary owners who have needed handholding throughout the process, they have appreciated the staff that the city has provided immensely. And so I think that that's something to kind of talk about. I'm not sure who the interviewees were and how many there were in the surveys that you kind of discussed throughout'",
        "'speaker_1': 'the presentation. And I think that that's kind of an important component, right? Like you just survey, did you ask for respondents from 500 people in ten responded or was it 25? Were they from the same groups? I just don't know.'",
        "'speaker_1': 'So it's hard for me to validate the data and feel comfortable with it. So if staff to give us a little bit of input on that, that'd be helpful.'",
        "'speaker_3': 'Yeah. So is this specific to the dispensary survey or both?'",
        "'speaker_1': 'Actually, I'm going to go through all my questions because I realize my clock is ticking. But if you could answer my questions at the end because I know I have a limited time, but yeah, on both, I'm kind of interested just to know what that looks like.'",
        "'speaker_1': 'Issues about the zones and fairness. So I'm one of the councilmembers with six in my district. So as Councilmember Richardson, who's not here tonight, I've been at a budget meeting in his district where the community asked, why do we have six dispensaries and no one else does?'",
        "'speaker_1': 'And I was able to say, No, no, Mimi, I to do. And the reason that Councilmember Richardson and I both have the great blessing of more dispensaries is because we are adjacent to a number of cities that do not authorize cannabis sales.'",
        "'speaker_1': 'And so the borders of our city really have quite a number of dispensaries. Almost three of my borders to other cities have those have dispensaries and have quite great volumes because they're not really competing for the Long Beach market.'",
        "'speaker_1': 'They're really competing for the Orange County market or the Lakewood Market or the Signal Hill Market or not saying, oh, I'm sorry, Paramount Market, etc., etc.. So just something to think about. But in that discussion, a community member had specifically stated, What about all these other marijuana related businesses?'",
        "'speaker_1': 'What are the added risks? They had some specific data or concerns that they presented about the number of attempted break ins and so on and so forth that have happened. I've had several in my district. The dispensaries do an excellent job of preventing theft.'",
        "'speaker_1': 'I would even say in some of the cases better than the pharmacies are doing right now. But it is something that they think about. I would be interested because there are districts that only have one. Same idea with when you talk about districts versus development zones in the city.'",
        "'speaker_1': 'We have three major development areas. Maybe we do it by development areas since we know that those boundaries are going to be moving soon. And the specifics of being on the side of a council district or that side maybe isn't as important of making sure that the north piece of Long Beach, the downtown people love it.'",
        "'speaker_1': 'On the east piece of Long Beach, Equitable equitably have access in the area. But when push comes to shove, people are going to want to put in dispensaries where the demand is. Big companies like McDonald's don't go where there aren't people who want to buy McDonald's.'",
        "'speaker_1': 'Similarly, in the sophisticated industry of cannabis, the dispensaries need to be where the people want the marijuana. So. Eight more. I don't know how we equitably look at what that looks like and where we want them, as I mentioned, to be successful in placement.'",
        "'speaker_1': 'I'm out of time. But if you could answer that question and then based on my colleagues, I might queue up one more time with my last three questions next.'",
        "'speaker_3': 'Yeah. So in regards to the the survey question that you had posed, so for the delivery survey, there was a total of 79 respondents to that survey and we did send that out via email or website. I don't believe that one was on social media at the time, but we did get 79 total responses.'",
        "'speaker_3': '47% of the respondents were equity applicants or identified as equity applicants, 21% identified as Long Beach residents, 20% identified as cannabis business owners. 5% were potential equity applicants. 3% were just members of an LP, business or community organization, and then 4% were other.'",
        "'speaker_3': 'And then in terms of the Equity Dispensary survey, we did push that out on social media, which gave us a little bit more of a response rate. And so we we received 135 total responses, 43% were equity applicants, 23% cannabis business owners.'",
        "'speaker_3': 'And then or I'm sorry, 30, 43 were equity applicants, 23 cannabis business owners, 67 of those respondents were Long Beach residents. And then to identify those other.'",
        "'speaker_1': 'Thank you for that information. I think that one of the big challenges that I had, at least with the dispensary locations, was people don't realize how small a thousand feet is. And when you reduce that to 600 feet, I mean, we got a lot of complaints with that dispensary doesn't meet the rules.'",
        "'speaker_1': 'But when you look at the the measurement, it far exceeded the rules. People's perception of that that before is a lot different than the reality. And I think that's important. So I'm not real comfortable with the maps yet, but I'm comfortable and supporting, I don't think councilmember.'",
        "'speaker_0': 'So I'm okay. I'll take that. Well, first, I'd like to thank staff and our city's Office of Cannabis Oversight Team for really putting in the work for this feasibility report and the recommendations on top of all their other duties.'",
        "'speaker_0': 'I understand that they're split in time, and this is a real issue with staff capacity that we have to deliver cannabis oversight, but also add on new facets to add to this program. And I know it took a lot of effort and the report was very thorough.'",
        "'speaker_0': 'I want to appreciate my my colleague's comments as well. I'll just say that I generally support the recommendations, including the revised green zones, with the comments of my colleagues regarding the beaches and the children on the beaches. I think those are important points that need to be taken into consideration for any ordinance that we we may look'",
        "'speaker_0': 'at drafting. I think a dispensary licenses exclusively for cannabis equity applicants is a reasonable and manageable starting point. Right, for the market absorbing new businesses in the market. That was the number we threw out in March. It seemed to be a number that was.'",
        "'speaker_0': 'Settled upon by many of the respondents who have been engaged in the process. And so they got that part right for right now. But that doesn't mean that it's capped enough that it'll be over with. We can we can always look at doing more.'",
        "'speaker_0': 'I'd love to see us move faster and expedite the process. If if there's any way for us to do that. And I'm going to continue to push in that regard. But the idea of a 25 or point 25% tax is a little troubling for me as well.'",
        "'speaker_0': 'I've heard from a couple of my colleagues that that might be a dealbreaker. We want to we want to move this equity program forward. And I'd like to explore other ways, too, to getting there immediately. The financial needs to add staff and deal with the one time, as well as structural costs associated with building this program out'",
        "'speaker_0': '. So later on tonight, we'll talk a little bit about what, a 21 budget performance report. And in that report, staff indicates that business license tax revenues are anticipated to outperform what was projected in the budget by $1.3 million.'",
        "'speaker_0': 'Right. Due to a surge in cannabis sales, as well as an extension of business hours that the council approved. So if we've been a partner, we've been proactive, we've done all we could to make this industry work and be profitable.'",
        "'speaker_0': 'And it looks like we exceeded our expectations. I guess I need to ask what that exceeded expectations were those revenues going in and world and can those revenues be used back into the program? So they are eligible youth.'",
        "'speaker_0': 'But if you look at the whole performance report, those are general fund dollars or measure em, but they essentially are general fund. And as you look at the whole of the general fund, we're only half a million dollars.'",
        "'speaker_0': 'Balance. We're essentially exactly balance. We don't have a structural surplus and we're going into a structural deficit. So while that specific revenue has gone up, others have gone down, other costs have gone up. So we are currently for this year's budget balanced and then for next year's budget, we're right now looking at a 36 to $38 million'",
        "'speaker_0': 'deficit. I'm hoping that'll come down as the economy continues to improve, but we'd be looking at reductions next year. I couldn't possibly be performing better than 1.3 million. And. It's possible. So I think we're hearing that from the council.'",
        "'speaker_0': 'What I'd like to suggest is that you don't take the tax completely off the table yet, but you consider other options if we can get additional state dollars. Give us a little bit of time to see what measure M revenues might do, what the state dollars would might be, and then what that delta is.'",
        "'speaker_0': 'And we'll bring you back some options, one of which could be a lower tax, one could be general fund and cutting something else, because we've got a little bit of time to develop the ordinance and come back to you with the staffing model.'",
        "'speaker_0': 'Well, I love that recommendation. I just want to figure out how to get out of tonight in terms of a vote to support moving forward with our campus equity program and then maybe leaving it open for staff to to figure out the financing without a text right away.'",
        "'speaker_0': 'I think that's the direction tonight instead is to give us more direction to come back with other options. And we'll bring that back. When we bring the ordinance back. When we bring back the appropriation increase, we'll bring back, you know, what our new funding strategy is going to be from June.'",
        "'speaker_0': 'So yeah, I'd like to move that into the record. And I really think that that's important because I don't I don't hear a consensus around moving forward with a quarter cent tax and and probably. Potentially crippling even those businesses that we are trying to lift up right at the same time.'",
        "'speaker_0': 'The fact that that my my really my my my real concern here on with that. If we can, we can do that. I think we are we're in a great place. I like the idea of looking at other grant funding opportunities.'",
        "'speaker_0': 'I know that there are opportunities from the state. I think that, you know, again, time the more time we we put into developing our social or cannabis equity program, it's potentially opportunity life. Um, and I will just say that, that the the ideal of, of.'",
        "'speaker_0': 'A merit based process is very, very important. Listening to the presentation. The ideal of a hybrid where we are doing an RFP, we're assessing qualifications. There's an interview process. I think that for me, the most important component is that it's a fair process that will get you better.'",
        "'speaker_0': 'But that tends to put a little bit more in terms of. Not for a little bit. Oh, man. I'm talking about Cuba. Cuba. Thank you. Councilman, sir.'",
        "'speaker_2': 'Thank you, Mayor. So I also want to express my appreciation for staff's hard work in making sure to get community input, equity applicant input, as well as those who are working in the cannabis business as well. And also appreciate all the questions and comments made by my colleagues.'",
        "'speaker_2': 'You know, one of the things that I want you to just comment on, well, it's taken time to get us to this point. It's something that's not been done. And we've worked kind of looking at other models of city have done what they've done right and what they didn't do right that we can learn from.'",
        "'speaker_2': 'So I also see that equity is going to be a process in development, right? So I see this as a pilot programing. Eight isn't I don't think it's right to say any number right now is the right number unless we do a little bit more piloting of how this program will work to making sure we even get'",
        "'speaker_2': 'eight. A total of eight. Ensuring they're successful. Right. That would be a success if it's 100% they're able to get their business running. So I feel like there's a lot of lessons that can be learned through this, what I would consider as a piling piloting phase of this equity program in Long Beach.'",
        "'speaker_2': 'One of the other things that I wanted to ask about, certainly I'm also concerned about this tax rate, which, in addition to the options that were the share that would be looked at, is where we find this funding is also looking at, well, what are the tax rates, what are the tax rate in the other cities and'",
        "'speaker_2': 'how have they explored ways to fund their program? I appreciate this exhibit. You know, at the very last page, exhibit H, a D attachment D here where you have lists a variety of cities that included, you know, looking at how they implement their program and their even their caps, as well as interested in seeing what their tax'",
        "'speaker_2': 'rates are and to ensure that we're kind of learning from them as well. The other thing that I. Wanted to talk about was also just this process of this these eligible applicants. It's really important to me that we also ensure there's a majority that are Long Beach residents, Long Beach resident, those who have been impacted by the'",
        "'speaker_2': 'war on drugs in Long Beach. I think we need to make sure that if there's a point system in the guideline, that we give them additional points. Because I think it's important that we lift up those who've experienced the various barriers here in the city.'",
        "'speaker_2': 'And then the other thing, too, is when you do get whatever your review process looks like, when you get your consultants together, or that's a consideration of how you find your consultant, I think it's really important that we also have variety of reviewers of these applicants, that it'll be people who are in the cannabis business, as well'",
        "'speaker_2': 'as those who understand equity that comes from that, have a background in understanding how do we approach using that lens in how you determine, you know, weighing in their experience, their life experience and also other other criteria as well that can be taken into consideration.'",
        "'speaker_2': 'So I'll say this again in that while it's it feels like it's taking a long time, I also think that we should also move forward a little quicker so that we can pilot this to see what we can do right and what we can do, you know, taking lessons learned from other city and what we can do'",
        "'speaker_2': '. Well, right. So so I know that I value that. We we want to make sure there's fairness and all of that should be taken consideration. But we also want to make sure we get started sooner than later. I'm going to make sure I see all my questions here.'",
        "'speaker_2': 'So yeah. So I think that's all my question for now. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilman. And they have.'",
        "'speaker_2': 'A thank you, mayor. And I also agree with my colleagues on all their previous comments and concerns as well. I'm glad that we're thinking about taking out the tax portion of this item or actually exploring other options, I should say.'",
        "'speaker_2': 'That would be great. I think that to me that's important because this is an equity program and I would hate for us to have and then turn the consequences here and be able to hurt the equity community, our cannabis community that we're literally trying to help and uplift.'",
        "'speaker_2': 'So so that's good. Another thing that I was wondering, just I was thinking about, you know, how things are across the city. And right now, the cannabis dispensaries have to be a thousand feet away from each other. And I was wondering what the feasibility of maybe increasing that to 1500 could be because of the fact that we'",
        "'speaker_2': 'that way it would be better city wide to be able to have that. And also it would help these equity applicants in being successful and not be overly concentrated in certain areas. And that way they can not only become successful but sustainable, which is what we want.'",
        "'speaker_2': 'We want them to be both a successful and sustainable. So with that said, I'm I'm so proud of us as a city that we're moving in the right direction. And I think that, you know, this has been long overdue.'",
        "'speaker_2': 'So I do also would like to see us move a little bit quicker on this. I know it's hard, especially if we don't have the staff. So I'm really hoping that we can together work something out and find funds so that we can bring on staff to really dedicate to this program.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you very much, Councilwoman Councilwoman Pryce.'",
        "'speaker_2': 'Mr. Mayor, I just want to follow up on some of the comments that I made. So I'm seeing here that we have added the community center buffer.'",
        "'speaker_1': 'So the area that I was referencing before on the peninsula, I believe there is at least one community center in that area.'",
        "'speaker_2': 'So I would like to make a friendly.'",
        "'speaker_1': 'That that buffer be reevaluated in regards to 32nd Street and the Leeway Center. The other.'",
        "'speaker_2': 'Point I wanted.'",
        "'speaker_1': 'To touch base on with the council and I haven't heard really anyone comment on it. So I'm thinking maybe there's not a whole lot of support for it, but I would love.'",
        "'speaker_2': 'To hear my council colleagues.'",
        "'speaker_1': 'Comments on the overconcentration of dispensaries in throughout the city and specific parts. So I'd like us to address that issue.'",
        "'speaker_2': 'Maybe it's not tonight.'",
        "'speaker_1': 'In the form of a motion.'",
        "'speaker_2': 'But I'd love to know what.'",
        "'speaker_1': 'My colleagues think about that, since this is an issue that is before us on an ongoing basis, I believe, at present. Really some Brown Act areas that I'm uncomfortable reaching out to colleagues to talk about when we have items like this on the agenda.'",
        "'speaker_1': 'I think it's a public conversation that we have to have that I would like to have publicly about whether there should.'",
        "'speaker_2': 'Be a limit on.'",
        "'speaker_1': 'The number. So we how many total will we have with this? Eight.'",
        "'speaker_0': 'I'm sorry, could you ask the question again?'",
        "'speaker_1': 'How many total will we have?'",
        "'speaker_2': 'I can do the math, you guys. I'm just trying to have a public.'",
        "'speaker_1': 'Equity hybrid with my colleagues. We would have 40, 40, but that number I can get. Okay, so if we have 40.'",
        "'speaker_2': 'And we have assuming we have nine council.'",
        "'speaker_1': 'Districts, which that's probably not going to change even with the redistricting. What what would what would that look like if we were to have an equitable distribution?'",
        "'speaker_0': 'So I will say that redistricting is the X factor. As you mentioned, we don't know what the boundaries are going to look like. We'll know what those will look like by December. And we're not planning to bring back with this ordinance before that time.'",
        "'speaker_0': 'So there will be time to, if you wanted to give a certain direction tonight to be able to look at the new boundaries when we bring something back.'",
        "'speaker_1': 'I think that would be great. I'd like to add as a friendly that after the redistricting information.'",
        "'speaker_2': 'Comes out, that council will have an opportunity.'",
        "'speaker_1': 'To have a discussion about the concentration or the distribution, I should say, of dispensaries throughout the city. And whether we want to consider a density cap or for lack of a better word. Because, you know, I think we should be all roughly around the same.'",
        "'speaker_1': 'And we should provide opportunities in the districts that are underrepresented in cannabis businesses. We should do whatever we can to help those businesses get those types of services for their residents as well, so that their residents because I recall that was a really big issue when we would debate this topic, is that people having to drive to'",
        "'speaker_1': 'other parts of the city to get access. So we want to make sure everyone has access. I think that would be a great conversation to have and I bring that as a friend like.'",
        "'speaker_0': 'A sentimental.'",
        "'speaker_1': 'Yes. And so on. Yeah, that definitely is accepted. One of the things that I wonder is I, you know, represent downtown. And so where we have a small area or dense or high, so there's not going to be as much availability and downtown as there might be and councilwoman among those district just because of the fact that'",
        "'speaker_1': 'she has a big footprint. So I accept that friendly and I want to make sure I want to clarify the motion. So my motion is that we do not raise the taxes, that we look at all other alternatives, that the application process is based on merit.'",
        "'speaker_1': 'And then Councilwoman Price's friendly. That's my emotion.'",
        "'speaker_0': 'Okay. So I didn't have speaker style, but that's the to clarify, the motion on the floor is the staff recommendation and with the addition of the Friendly's by Councilman Price removing the tax and looking for other alternatives and to go off of a merit, a stronger merit based system than the one proposed.'",
        "'speaker_0': 'I think what the motion is that is correct. Again, there's a second customer and get your supporters. Oh, really? Go ahead, Mr. Mayor, if I can make a suggestion, I heard from the council that you'd like to keep this moving forward.'",
        "'speaker_0': 'We haven't figured out how to pay for it because we kind of removed that option today. We need at least $50,000 to start the consultant to move that forward. So I'd like to just we'll find the resources for that or come out of, you know, something in the reserves or end of year fund balance.'",
        "'speaker_0': 'But that will allow us to at least take that next interim step if that's amenable. Okay, great. We'll wait for the customers on the way back. But let me just continue on the on the speaker's list, Councilman Mongo.'",
        "'speaker_1': 'Thank you. Just a question about the tax. Was the tax only going to be applied to recreational or medical as well? If it would have been in motion just cause I just didn't know, it would be to both.'",
        "'speaker_1': 'Okay. So one of the things that I would definitely recommend is for it not to be a part of the medical side, like we don't want to tax people's medicine if we can avoid it. In talking with. Dispensary owners, an average sale is $65.'",
        "'speaker_1': 'So we're talking about a dollar, a dollar, $52 per purchase. And while that is a lot of money on the recreational side, I'm not as concerned as I would be about the medical side, those who have cancer and need the medical treatment and all of those things.'",
        "'speaker_1': 'I think that's the number one concern for us. When looking at your revenue options for the future, obviously this council would prefer not to increase taxes. But when you do talk about. For me, I would like to not increase taxes and to get equity licenses available within six months.'",
        "'speaker_1': 'However, if I had to choose between a small tax of a dollar 50 a transaction and getting equity businesses off the ground in six months versus three years from now, I think I would choose getting them off the ground sooner because I think we've waited just far too long, and I think that our process to date has'",
        "'speaker_1': 'been very frustrating. And so I think that that's part of the. The weight of the options. Obviously not increasing taxes best, but if it means it's going to be a three and a half year delay because the two of you are going to have to singlehandedly lift eight dispensaries off the ground.'",
        "'speaker_1': 'I just don't know how it could be physically possible for you to do. There's just that amount of workload that's feasible and there's an amount of work that does not. I do recognize there's a national discussion going on with legalization and perhaps the grant funding will be available.'",
        "'speaker_1': 'And I think that would be an amazing opportunity. And if that is, I also think that there's potentially a lot of equity funding coming from major foundations. I just don't how we get that into the city because most of their grant requirements are that it goes through a nonprofit.'",
        "'speaker_1': 'I don't know how we're set up to make that happen, but when it comes to moving this program forward, I'm very passionate about making sure that that happens. And I support councilman. Price's comment regarding. It's trying to find a way to distribute these evenly across the city.'",
        "'speaker_1': 'And I do completely agree with Councilman Allen about the density issues. And even with as many parks as I have and of many non zones that I have, we still have a lot of zones and I think that in discussing with the community certain dispensaries as they were put in.'",
        "'speaker_1': 'If if we could be a part of those discussions. I think we know our communities pretty well. And there are some locations that literally across the street would have been acceptable. But where they are is just the foot traffic of the kindergarten or the.'",
        "'speaker_1': 'It's just it's not always just about a circle around the location that really makes sense. It's a path of travel. It's a lot of things. And when you talk to a dispensary owner, some of those other things are very valuable.'",
        "'speaker_1': 'So I haven't actually mentioned this to Eliot, but he's right off a freeway. Nobody's ever made a negative comment about his because it's kind of like tucked into a corner and people have easy access on and off of the freeway versus another dispensary that might have significantly less traffic that is 1000 feet from a high school.'",
        "'speaker_1': 'And that one is highly controversial and highly frustrating for the community. They have no parking. They're constantly impacting the neighborhood. I mean, everything about that dispensary is a struggle. And so when you kind of work through what that is, I think that there's a lot of contacts that we could help provide you with that mapping.'",
        "'speaker_1': 'But I also recognize that there's some legal components of just like. How you articulate that in working with development services to make sure that we're equitably applying rules across the city and there's not just one versus another, so.'",
        "'speaker_1': 'Very supportive of both of those. But I do want to just say that while I don't want to increase taxes, I don't want this program to take three years. So what is your timeline on coming up with a solution and or bringing back?'",
        "'speaker_1': 'A temporary solution and or a proposal.'",
        "'speaker_0': 'I'm not sure we know yet. So we brought a proposal tonight with change a little bit. So we'll go back and do a little bit of work. It'll be after December and then we'll come back with some ideas.'",
        "'speaker_1': 'And for me again, I don't want to raise taxes if I don't have to, but I would rather raise taxes 0.3% on recreation and 0% on medical. If that meant the same amount. Just trying to protect those that are using marijuana as a medical youth.'",
        "'speaker_1': 'So that's what I'd like to just continue to voice as a priority. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Austin. And comma forgot what I was cued to say. But I do think that to Councilmember Price's point in terms of. Addressing density and equitable distribution of licenses throughout the city. I think expanding green zones will expand opportunity for that and I do think we as a council have to also be realistic to the'",
        "'speaker_0': 'market demand as well, and that plays a role into where these businesses are located. I'll probably have less than anybody on the council. I have one in my my district. You guys remind me of that often. That's right.'",
        "'speaker_0': 'On the liquid border. So I don't know why that dynamic is. Perhaps, you know, it's hard to place cannabis businesses in the district because of the current restrictions that we have. We have a lot of parks. We have daycare centers, we have schools.'",
        "'speaker_0': 'So I'm very supportive of bus. Inconsistent with the state policy. I think that's a smart approach that opened up opportunities for for these cannabis exclusive cannabis equity licenses to be successful in our city. And then again, yes, we'll have that of conversation about.'",
        "'speaker_0': 'Oversaturation. But I think this is a great starting point, and I'd love to get to a vote so we can get that to work and move this item. Thank you. And then finally, transformers in death.'",
        "'speaker_2': 'You just wanted to make a quick clarification. I was hoping that my request for and the feasibility of increasing the footage from one 1000 to 1500. The feasibility of it could be a friendly. The woman, Alan.'",
        "'speaker_1': 'Yes. iPod. My understanding is that that number was 1600 now to match up with state regulations. And that's just the distance that it's from schools and things like that. So I'm not sure I understand.'",
        "'speaker_3': 'No, I think I think Councilman Van de Haas is proposing to expand the buffer between dispensaries from 1000, which we were not proposing to amend to 1500. Yeah.'",
        "'speaker_1': 'I accept.'",
        "'speaker_0': 'Just so we understand, that wouldn't be from ones that are currently in place. It's only for the that the eight new ones. Is that correct? Because we wouldn't be able to change anybody who already has a brick and mortar dispensary.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Then it would be when new ones come in, we would look at the feasibility of doing 1500 from each other for the New Haven.'",
        "'speaker_2': 'And my purpose for that is to make sure that we give these new dispensaries a chance to be able to be successful and be able to be sustainable.'",
        "'speaker_0': 'That we can certainly bring back a second map that shows one with an one without. So the council can look at that as we move forward.'",
        "'speaker_2': 'Thank you. Councilmember Allen.'",
        "'speaker_0': 'Okay. Okay. So my comments come from Brockton. I just I feel like that the last friendly amendment respectfully makes it more restrictive where we're trying to reduce to the buffer zones and expand. Opportunities for for equity licenses to be located in our city.'",
        "'speaker_0': 'And that that particular addition seems to. Who might be a little bit more restrictive. Right. It pushes us in the other direction.'",
        "'speaker_1': 'Now, can you answer that question for me?'",
        "'speaker_0': 'Yeah. So I need to correct the mindset is when we do buffers from fixed assets, we can certainly plot that on a map if we are doing hypothetical parcels that have not been selected yet because we won't know where they're going to go until they get through their process and bring us a leaf.'",
        "'speaker_0': 'Those are going to be essentially impossible for us to map so we can give you some ideas of what that means. But we would definitely be shrinking the Green Zone a little bit if we go to 1500 as opposed to keeping it at 2000.'",
        "'speaker_2': 'And it would just be a feasibility, nothing to actually decide on today, but just to see what what it would look like.'",
        "'speaker_0': 'So why don't we try this when we add in to. Right, we'll read you up an analysis of what the pros and the cons would be, and we'll have that answer returned when we come back.'",
        "'speaker_1': 'Awesome.'",
        "'speaker_0': 'That's perfect. Thank you. And counsel on Mongo.'",
        "'speaker_1': 'To address the comments of both because of all of them that they have and the previous comments of Councilman Price and to factor in the need for it not to be as restrictive as Councilman Austin has just brought up my.'",
        "'speaker_1': 'Thoughts on how we can solve this problem right now without having to worry about all of that coming back. Is any any equity dispensary that's proposed within an area that was previously a restricted area would go through a small coop process.'",
        "'speaker_1': 'Therefore, you'd have that opportunity at the last minute to work with what's already in that area and know that area well, like the peninsula, like a couple of other things to be able to say, would this work? Is that a good idea?'",
        "'speaker_1': 'I'm trying to come up with a solution so that you don't have a bunch of analysis. I think you're weighing in. That doesn't sound like it'll work. Councilwoman Mongo, just in the interest of talking about the reduction of cost associated with that right now, increased conditional use permit process is pretty costly.'",
        "'speaker_1': 'And I think with the most recent fee update that the council approved those fees increase again. And I'm going to. Don't don't quote me on it. But I think those fees are upwards of around 10,000 or 10 to 15000.'",
        "'speaker_1': 'So that's a pretty sizable cost to add to the the equity dispensaries. I see.'",
        "'speaker_0': 'And it councilmember in addition to the 10,000 I think we can work here at the staff table to accomplish. I hear the council's concern without creating okay not just the cost to the applicant but, you know, processing a conditional use permit.'",
        "'speaker_0': 'There is not there's reasons we don't see a piece for dispensaries because there's not a lot of conditions that we would add. And we're putting someone through this for nothing.'",
        "'speaker_1': 'We're just trying to think of a way that we wouldn't have all this.'",
        "'speaker_0': 'Yeah, I think the one.'",
        "'speaker_1': 'Thing that that my brother has taught me being an industrial and commercial real estate, is that the loss of time is money. And he would much rather pay an extra $0.25 a square foot to get his location opened now than to wait another 18 months or a year because time is money.'",
        "'speaker_1': 'And so I was just trying to think of what could we do to get this resolved tonight? Thank you for that additional call.'",
        "'speaker_0': 'We can do a consultation process here where the applicant is required to have a formal meeting with development services, is required to have a formal meeting with their relevant council representative. And if, based on the location, there is one, a neighborhood association that would not be in approval, it's just requiring them to have that consultation.'",
        "'speaker_0': 'And I think that would avoid the very costly fees. Thank you. Thank you so much. Great idea. Let me go to Councilman Press and we're going to go to a vote and we keep going back and forth. So we just need to include Councilman Price.'",
        "'speaker_2': 'And to say support Councilman Sun House's friendly.'",
        "'speaker_1': 'But I'm not sure if that's still relevant. Okay.'",
        "'speaker_0': 'Okay. Thank you. So I think we have the motion on the floor, which I'm going to repeat, which is staff recommendation. We're going to add the two friendlies that Councilwoman Pryce made. And then Councilman Sun has this motion as well, which is an analysis of the 1500.'",
        "'speaker_0': 'But also we're going to bring back the initial staff recommendation on the buffer zone. And then we are also eliminating the tax and looking for a grant as a first option or other state funding, but also authorizing staff to put in the initial 50 grand or whatever the cost is to get the process started.'",
        "'speaker_0': 'And we are trying to focus on a more merit based process than the one presented by by staff. I think I got that motion correct.'",
        "'speaker_1': 'That is correct.'",
        "'speaker_0': 'Okay. With that, there is a motion and a second. Members, please go ahead and cast your vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Thank you. Let's go ahead and go to item number one.'"
    ],
    "Resolution and Contract Amendment for State Rental Assistance Program and ERAP Implementation.": [
        "'speaker_2': 'Motion is carried in 20.'",
        "'speaker_1': 'Report from Development Services recommendation to adopt a resolution to execute all block.'",
        "'speaker_3': 'Grant award documents. To participate in the second round of the State Rental Assistance Program. And amend.'",
        "'speaker_1': 'Contract with.'",
        "'speaker_3': 'Yardi Systems to provide.'",
        "'speaker_2': 'ERP.'",
        "'speaker_3': 'Implementation to increase the contract.'",
        "'speaker_1': 'Amount by 3,800,000 citywide.'",
        "'speaker_0': 'We want public comment in Stephanie Davis here. Looking forward.'",
        "'speaker_1': 'Good evening, Mayor. Council members and staff. Tiffany Simone David.'",
        "'speaker_0': 'District four resident.'",
        "'speaker_1': 'Speaking in support of this.'",
        "'speaker_0': 'Item. Furthermore, doing so as it basically.'",
        "'speaker_1': 'The discussion that took place.'",
        "'speaker_0': 'Last week.'",
        "'speaker_1': 'Concerning expediting and.'",
        "'speaker_0': 'Streamlining the process.'",
        "'speaker_1': 'This item actually does by.'",
        "'speaker_0': 'Increasing staff.'",
        "'speaker_1': 'That already does.'",
        "'speaker_0': 'Exist but does need additional support.'",
        "'speaker_1': 'From April the present day. I've had the pleasure of assisting hundreds of tenants and.'",
        "'speaker_0': 'Landlords in completing their applications throughout the all nine districts of our city. I wasn't there. I was not able to address council last week for the discussion. Again, just wanted to highlight that this item does do a service for that discussion.'",
        "'speaker_0': 'I'd be remiss to not take the opportunity.'",
        "'speaker_1': 'To thank Development Services.'",
        "'speaker_0': 'Who has done an extraordinary job, I believe, of streamlining.'",
        "'speaker_1': 'What.'",
        "'speaker_0': 'Necessary documents. The city.'",
        "'speaker_1': 'Cannot get around it, much less a state when.'",
        "'speaker_0': 'Receiving federal funds.'",
        "'speaker_1': 'Lastly, I encourage all city.'",
        "'speaker_0': 'Council members who have not yet done so to take the opportunity to inform the residents.'",
        "'speaker_1': 'Of the other County Board of.'",
        "'speaker_0': 'Supervisors September.'",
        "'speaker_1': '28th decision to.'",
        "'speaker_0': 'Convert and extend the.'",
        "'speaker_1': 'State.'",
        "'speaker_0': 'Moratorium.'",
        "'speaker_1': 'Effectively renaming at the county COVID 19 town, and.'",
        "'speaker_0': 'Protections.'",
        "'speaker_1': 'Which are in effect until January.'",
        "'speaker_0': '31st, 2022. Thank you. Thank you so much. Seeing no other public comment numbers, please cast your vote.'"
    ],
    "FY 21 Budget Performance Report and Projections. (Citywide)": [
        "'speaker_3': 'Motion is carried.'",
        "'speaker_0': 'Thank you. Item last item 21.'",
        "'speaker_3': 'Reporter from.'",
        "'speaker_1': 'Financial.'",
        "'speaker_3': 'Management Recommendation to receive and file a fiscal year 2021 Budget Performance.'",
        "'speaker_1': 'Report City Wide.'",
        "'speaker_0': 'There's no public comment, correct? Okay. We're going to just do a brief. And Mr. Monica, do you want to just give us a brief? Performance Report update. I think most accounts have probably read the agenda, but I want to just do that publicly.'",
        "'speaker_0': 'Yes. Great.'",
        "'speaker_2': 'All right. Good evening, Mayor. Members of the city council. This report is a preview of the potential FY 21.'",
        "'speaker_1': 'Year end projections.'",
        "'speaker_2': 'Just as a comment, your end transactions are still in progress and final disbursements of revenues are still pending.'",
        "'speaker_1': 'So this report.'",
        "'speaker_2': 'Is still based on estimates. And we'll bring we'll be bringing.'",
        "'speaker_3': 'Back a final report on the Fy21 performance based on actual.'",
        "'speaker_1': 'Per our normal schedule in February. This budget, as a reminder, was established at the start.'",
        "'speaker_2': 'Of the pandemic in the middle of the incredibly steep and swift recession. And so what we're finding out on a positive.'",
        "'speaker_1': 'Side is that current projections.'",
        "'speaker_2': 'Show optimistic signs that revenue.'",
        "'speaker_3': 'Shortfalls in key areas are not.'",
        "'speaker_1': 'As severe as originally thought.'",
        "'speaker_2': 'That we might be, they might be. So, as Tom mentioned earlier.'",
        "'speaker_3': 'For the general fund.'",
        "'speaker_1': 'Projections.'",
        "'speaker_2': 'Are essentially showing that we are generally balanced for FY 21.'",
        "'speaker_3': 'With a small operating surplus.'",
        "'speaker_1': 'Of 500,000.'",
        "'speaker_2': 'I do want to say it's important to note that there are many outstanding variables.'",
        "'speaker_1': 'And when we're.'",
        "'speaker_2': 'Talking 500,000.'",
        "'speaker_1': 'We're talking a very small margin. And so it's.'",
        "'speaker_2': 'Possible that this number could be.'",
        "'speaker_3': 'More positive or it could even swing to be a negative.'",
        "'speaker_1': 'We do have measure A, we still have one quarter left to go, but Measure is currently.'",
        "'speaker_2': 'Showing a potential net program.'",
        "'speaker_1': 'Surplus of about 10 million.'",
        "'speaker_3': 'And so for this final surplus.'",
        "'speaker_1': 'The city manager will be looking at all the priority items that.'",
        "'speaker_2': 'Council mentioned on adoption night as well as other major needs.'",
        "'speaker_1': 'Eligible under Measure eight. And we'll be bringing back a comprehensive list of recommended projects in February in the year and performance report for City Council.'",
        "'speaker_0': 'Consider very much I think that's a good pick it up just as a note just wanted to add that all the projects that Councilmember Austin and the Council worked on so really worked under a great list of projects.'",
        "'speaker_0': 'If things continue as planned, those are all going to get funded or are looking like a lot of those going get funded. So that's really great news. So there's a motion and a second on this item. Members, please cast your vote.'"
    ]
}