{
    "Recognition of Women in Transportation in Long Beach.": [
        "'speaker_0': 'And now we're going to be doing item number 20 via email on that.'",
        "'speaker_2': 'Communication from Vice Mayor Lowenthal. Councilwoman Gonzalez. Councilwoman Price. Councilwoman Mongo recommendation to recognize the role women play in transportation in the city of Long Beach.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I wanted to thank everyone that is here today for trying to see people behind this, but. In honor of National Women's Month 2016, I would like to formally request the mayor and my colleagues to join me in recognizing the role of women.'",
        "'speaker_5': 'The role that women play in transportation in the city of Long Beach. Women all over the world hold key positions in transportation industry, whether they are building automobiles and spaceships or designing them. There's still enough there's still some ground to be made up related to the gender gap.'",
        "'speaker_5': 'But thanks to the early innovators, pioneers, adventurers, engineers, scientists and inventors, women have a strong foothold in the future of transportation. We have the port and the port affiliated organizations Long Beach Transit, MTA, Caltrans, the airport, all of these giants that help us get people and merchandise in or out of, as well as around our city.'",
        "'speaker_5': 'And at the heart and soul of these giants are many amazing, talented women. With us tonight, we have representatives from most of the entities that I just mentioned from Pacific Merchant Shipping Association, PMC. We have Michelle Grubbs here tonight.'",
        "'speaker_5': 'Michelle has been an international trade advocate for almost. For PMC. Michelle was employed by McDonnell Douglas and Boeing for 13 years. Future Ports is dedicated to ensuring a healthy and. 14. Kerry is responsible for planning, construction operation and maintenance of the state freeway and highway system in the region and has been with Caltrans for 25 years.'",
        "'speaker_5': 'From Long Beach Airport, I'd like to recognize Carolyn Carlton Lowe and Claudia Lewis. Carolyn is our operations and facilities bureau manager and Claudia is our manager of finance and administration. Owned and operated by the city of Long Beach.'",
        "'speaker_5': 'Our airport is a consumer favorite in the region and one of the world's busiest in terms of general aviation activity. Presently, the airport covers 1166 acres and has five runways. Delorme Transit is governed by a seven member board of directors and two city designees.'",
        "'speaker_5': 'Our entire lobbies transit board is female, except for one, and I couldn't be more proud of the women chosen to represent this agency. Maricela de Rivera Chair. Sumi Gant Vice Chair. Mary Zendejas Secretary and Treasurer. April Economides. Colleen Bentley, Nancy Pfeifer, Barbara Sullivan and Amy Bodak.'",
        "'speaker_5': 'This board, which represents an entire agency full of dynamic women, provides broad policy and financial decision setting direction for management. Also being recognized tonight, but not. Here are three of our harbor commissioners, Lori and Guzman, President Luann Bynum, Vice President and Tracy Gorski, secretary.'",
        "'speaker_5': 'The Port of Long Beach is governed by the Board of Harbor Commissioners, appointed by the mayor and approved by the council. And it helps create policy. The harbor department employees employs about 400 people, many of them women from the Metropolitan Transportation Authority.'",
        "'speaker_5': 'I have recognized Diane Dubois and Karen Hite, who are also unable to be here tonight. The MTA is the Public Transportation Operating Agency for the County of Los Angeles and directly operates bus light rail and bus rapid transit services.'",
        "'speaker_5': 'I'd like to thank these women and I ask them to rise at this time. If you are here, please and come together around the podium for a certificate of recognition. The City of Long Beach would not be the transportation hub it is currently without the significant contributions of strong women past and present.'",
        "'speaker_5': 'Without a doubt, the women being honored tonight play an integral role in the development and advancement of transportation and are committed to excellence in the transportation industry. Thank you for being here and thank you for your service.'",
        "'speaker_0': 'Councilwoman Gonzalez.'",
        "'speaker_1': 'I, too, just want to congratulate every single woman that is up here. I think what Vice Mayor Lowenthal said is is exactly right. Every single one of you have been a very important part of the expansion of the betterment and success of our ports, but also our our goods movement, our transportation, our city.'",
        "'speaker_1': 'And I'm so very proud of that. It's it's amazing what key positions you each hold in your respective industries and your respective organizations. I also know that some of you are refer to yourselves with the ladies of Logistics, which I'm really excited about, and it's been wonderful getting to know every single one of you in everything that'",
        "'speaker_1': 'you do. And it's nice that you'll be able to tie in business as well as environment, transportation and green space. There's a beautiful, healthy balance in everything that each of you do. So thank you very much and congratulations.'",
        "'speaker_0': 'Thank you, Councilwoman Price.'",
        "'speaker_1': 'Thank you. Ditto for me. Thank you for all that you do. I think that having strong, courageous, innovative, hardworking women in our community is such a positive asset and benefit and resource for all of the community, especially our youth, to see to see us doing so well, to see you doing so well.'",
        "'speaker_1': 'And in especially in a transportation industry which historically has been a male dominated industry. So to have so many women involved in goods movement and and mobility is just very impressive. Thank you. And, you know, I have to say, it also keeps you looking young because I was looking at some college photos the other day and I'",
        "'speaker_1': 'have some pictures with me and Mary and she looks exactly the same. So apparently being on this side of the dais does not do the same as being an active member in the transportation industry. So thank you for all you do and for your service.'",
        "'speaker_0': 'Q Councilman Andrew.'",
        "'speaker_3': 'Yes, thank you, Mayor. I think this is a great legislation, so I commend the Vice Mayor, Lowenthal, for bringing this item forward. You know, this is another step, you know, towards affirming that Long Beach is a city that stands for equality and commanded this amazing women for their role in keeping Long Beach, you know, mobile.'",
        "'speaker_3': 'And I want to thank each and every one of you and keep up the good work. Thank you.'",
        "'speaker_0': 'Councilman Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. And thank you guys can hear me this time, right? Thank you, Mr. Mayor. And thank you to the authors, Vice Mayor Lowenthal and others. And I just want to say what a tremendous example you all are making for our community, the youth of our community, for other communities to look up and see.'",
        "'speaker_10': 'These are key players that are in leadership and the industry that is sort of chief here in our community, in our region. So I think I think it really says a lot. So thank you. Congratulations to you and keep up the good work.'",
        "'speaker_0': 'Thank you. And Councilman, you're Ringa.'",
        "'speaker_9': 'Thank you, Mayor. At the risk of sounding sexist, I find nothing more sexier than a woman in power. And you're all women of power. And I want to thank my council members for bringing that here, because they are also women of power.'",
        "'speaker_9': 'And without women, there is no Long Beach. So thank you very much.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_11': 'And how do I follow that? I'll just say I would agree with him. And I am just just I admire each and every one of you for for the contributions that you make to our city, to our region that you have made.'",
        "'speaker_11': 'I know that many of our are the plans and the the advances that we are making in terms of mobility, freight movement, active transportation throughout the city of Long Beach. But the region that makes Long Beach the example that it is for, for the region comes from the leadership of each and every one of you.'",
        "'speaker_11': 'And so I just want to say thank you and keep us moving in the right direction. Thank you.'",
        "'speaker_0': 'Councilwoman Mongo.'",
        "'speaker_2': 'We are a young council and we stand on the shoulders of all of you who came before us. Thank you.'",
        "'speaker_0': 'Thank you. And obviously, I know all you. I've appointed half of you. And so thank you for all your for your service. And we're going to that the photos going to be with with the women of the of the council.'",
        "'speaker_0': 'So Councilman Price and Councilman Mongo can go up there. They're going to take a photo with you.'",
        "'speaker_4': 'I'm going to wait for you to get married. Yeah. Okay. I want. Good. I get all that? I'm ready to go. What happened? Oh, I thought, you know, if I never had a negative. You always got, like, a third of those certificates, but you tell them, like, you know.'",
        "'speaker_0': 'And just like.'",
        "'speaker_8': 'If you can have your.'",
        "'speaker_4': 'Apprentice certificates in front of you, like, that's.'",
        "'speaker_8': 'Yeah, wonderful.'",
        "'speaker_4': 'Gambling in their. Mind. Programs program. Just keep smiling inside and.'",
        "'speaker_7': 'We're having a contest.'",
        "'speaker_4': 'For that picture. Okay. I don't know. Oh.'",
        "'speaker_0': 'Okay. We I'm just going to ask if there's any really public comment on this item. I don't think I don't think there is.'",
        "'speaker_4': 'I like that.'",
        "'speaker_0': 'Okay. Seeing no public comment on this item, there is a motion and a second. Please go and cast your votes.'",
        "'speaker_4': 'Yes, you. Yeah. Oh, really? Okay.'",
        "'speaker_2': 'Councilman Price. Vice Mayor Longo.'",
        "'speaker_0': 'Okay.'",
        "'speaker_8': 'Uh, go.'",
        "'speaker_0': 'Ahead, sir.'",
        "'speaker_8': 'Vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'When we had that. Go ahead, make your comment, Ben.'",
        "'speaker_8': 'They had their own council members. I'm very pleased with our transportation. And because of these women and others working in our transportation agency, long major transit is going to be one of the first transit agencies in the nation to go with electric busses requiring no overhead wires.'",
        "'speaker_8': 'I rode the first one last Tuesday around the city.'",
        "'speaker_3': 'And tried it out. It is absolutely marvelous.'",
        "'speaker_0': 'Thank you. We're moving on now to item. We're going to go to item 33 then. So you have public comment on this.'",
        "'speaker_8': 'Larry Goodhew, firm, supporter of Long Beach Transit. They do a great job. I'm going to use this opportunity to suggest what I suggested to Mr. Smith this morning is that the city can consider and put in place a dynamic where.'",
        "'speaker_8': 'Four Express busses. Maybe five will leave our transit mall in the morning. Make one stop either Willow Wardlow, hop on the freeway and go downtown to Seventh and Figueroa, which is just beyond the Staples Center. And return with return trips in the evening.'",
        "'speaker_8': 'I think that makes eminent sense given the growth of of traffic, given the problems with the blue line, which are going to continue. And it just makes sense to run those express busses up there and have four or five in the morning return in the evening.'",
        "'speaker_8': 'We should be able to get funding for that of out of the Fed to the county without any problem. Thank you.'"
    ],
    "Proclamation for Cesar E. Chavez's Legacy and Long Beach Moving Forward Partnership.": [
        "'speaker_0': 'Thank you. We're going to go to item 33. They were going to go to a public comment.'",
        "'speaker_2': 'Communication from Councilwoman Gonzalez. Councilmember Wodonga. Councilmember Richardson. Recommendation to present a proclamation and celebration of such Chavez's legacy through support of our local Long Beach moving forward. Citizenship and Dakar Initiative. Partnership. A Brighter Future includes new American immigrant families and students.'",
        "'speaker_4': 'Oh.'",
        "'speaker_1': 'Okay. Thank you, Mayor. I first want to start off by thanking Central Chai C Jessica here in the audience and so many of our community partners in in working with Central Cha to make sure that we are reminded every day of the legacy and work of Cesar Chavez.'",
        "'speaker_1': 'And they certainly put that legacy into action. And in recognition of the day of March 31st, we will be issuing this proclamation to which I'm very, very proud. It's such an honor to have Cesar Chavez Park in the First District, along with Jenny Oropeza Community Center and as ever, Central Cha and their partners, including the California Community'",
        "'speaker_1': 'Foundation, the Immigrant Rights Coalition, Interfaith Coalition Organization, and our city departments are busy organizing a big citizenship fair on Sunday, April 10th, to assist legal, permanent residents and youth who qualify for DOCA. This work is every day and we know it's a very hard work and we know that the individuals that are involved seeking the citizenship, seeking'",
        "'speaker_1': 'the support, certainly deserve that. And I am always supportive of that. And I now would like to invite Jessica Quintana from Central Cha to come up and share more about her work, but also about this proclamation, if you'd like to do that.'",
        "'speaker_2': 'Thank you so much, Councilwoman Lena Gonzalez and Robert Garcia and Councilman Richardson, so much for your support and your leadership in this initiative and knowing how important it is. And I also want to recognize Councilwoman Price for kicking this off and bringing this beautiful celebration here today.'",
        "'speaker_2': 'I have never been in council so much where there has been so much love and joy here. So thank you so much for that because, you know, our city is definitely a very diverse city and we are so fortunate.'",
        "'speaker_2': 'I know Councilwoman Red off all our collaborative members with Central Charm, the Immigrants Rights Coalition and the Interfaith Community Organization. And all of us individually work very hard in this city to help our immigrant families, whether it be through citizenship, whether it be through tax assistance for our students to ensure that they complete high school and go'",
        "'speaker_2': 'on to college and get a job and also support to their parents. But for the first time ever, you know, we as as organizations here has formed a collaborative and it's Long Beach moving forward for a brighter future that includes all immigrant families and students here in our city.'",
        "'speaker_2': 'And so we've been very successful not only to be recognized as the city of Long Beach and doing this hard work, but across the state of California. And now we put together a regional collaborative that not only expands to Long Beach, but it also extends all the way to the bridge, to San Pedro and to the right'",
        "'speaker_2': 'of us, all the way through Hawaiian Gardens and Artesia. So that has been the hard work of your groups here in the city of Long Beach. So we just want to thank you for your support. We want to also recognize the legacy of Cesar Chavez here in the city of Long Beach and and thanking you for that'",
        "'speaker_2': 'support. We truly appreciate it. But also just to have the partnership with the city of Long Beach, I can't tell you how important it is going to be going forward and helping our families to become naturalized citizens, to be able to come more civically engaged in their communities and helping the students.'",
        "'speaker_2': 'So right now, our organizations has resources and we have assets to be able to provide our city in partnership and work with all the various departments, with Parks and Recreation, with the library services, with neighborhood services, with the development services to really reach our families, to be able to help them to become naturalized citizens and help our'",
        "'speaker_2': 'students. Right now we're doing fee waivers, so we're all trained to be able to help with fee waivers for those who are on meets benefits and be able to get and waive that $680 that that's cost so much for working families and for folks that are on on benefits.'",
        "'speaker_2': 'So we're a resource here. We, you know, invite you to to come to our celebration on the 26th will be processing applications. We'll have attorneys there. And, you know, we truly need your support. One more plug. I also want to invite you to another huge workshop that's happening in the city of Long Beach.'",
        "'speaker_2': 'And this is again through our leadership of our mayor, Robert Garcia, who's going to be doing this huge mega workshop on April 10th. And it's going to be at the convention center. And it's working not only with our organizations here, but our partnership organizations in the city of L.A., with Charla Advancing Justice, Coffee and California Community Foundation'",
        "'speaker_2': '. And so it's going to be a huge, huge push to really help our permanent legal residents become naturalized citizens. So we invite all of your leadership to be there that day. I do want to say something. I just want to say thank you for having us here today.'",
        "'speaker_2': 'And the Lumbee Immigrant Rights Coalition is happy to be, you know, working in collaboration with IKO and Central Asia. And we invite all of you to come attend our event on March 26. Good evening, everyone. I just wanted to say thank you on behalf of Greater Long Beach Interfaith Community Organization.'",
        "'speaker_1': 'As well as our partners here.'",
        "'speaker_2': 'With Long Beach Immigrant Rights Coalition in Central Asia. We're really excited to move forward along this work. Of course, this is work that's going to continue on for over a year. So we're really excited for that continued support and hopefully our fellow community members here, anybody who needs that assistance, that's exactly why we're doing this work is'",
        "'speaker_2': 'for all of you guys. So thank you so much.'",
        "'speaker_0': 'Thank you, Councilman Durango.'",
        "'speaker_9': 'Thank you, Mayor. I also want to thank Councilmember Gonzales for inviting me to join on this and this occasion. Citizenship has always been an issue that's been very important, not only for Long Beach before our country, and honoring Cesar Chavez legacy for the work that he's done for immigrants.'",
        "'speaker_9': 'But workers rights for basically creating equity and equality for all. Has is well known a Pulitzer Prize winner, a Pulitzer Prize winner, Nobel Prize winner that hey, he he's up there that really recognizes the wonderful work that he's done.'",
        "'speaker_9': 'And Central Asia, as the premier Latino organization here at Long Beach. And the work that you're doing is absolutely amazing. And you're right. And every day there is someone coming to this country and every day they need that support and to help towards a path to citizenship.'",
        "'speaker_9': 'And I only hope that this is the beginning of a realistic and working, workable immigration reform in the future. So thank you for your work, and thank you for all you do for the city of Long Beach.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_10': 'On this and Central Asia, thank you for being a regional voice and bringing those other communities together. That's our role here in Long Beach to, you know, other communities may not have the means or the voice to speak on this, but you provide that resource and that's important.'",
        "'speaker_10': 'So thank you so much and keep up the good work.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank thank you. Councilman Andrew.'",
        "'speaker_3': 'Yes, I thank you. A councilman woman Gonzales for this because I truly honor the teaching of Cesar Chavez and his leadership to our people. And I commend all of the organizations who work together to improve, you know, our immigration policies, as well as helping students and their families create a better future for themselves.'",
        "'speaker_3': 'And thank you again, Jessica.'",
        "'speaker_2': 'Thank you, Councilman Andres.'",
        "'speaker_0': 'Yes, Councilman Price.'",
        "'speaker_1': 'I, too, want to thank Councilwoman Gonzalez and the coauthors on this item. And thank you for everything that you do. You educate us regularly and you do a lot of great work for the community. So thank you for being here and thank you to the councilman for the item.'",
        "'speaker_0': 'Thank you again. And you guys know I love all of your work and I'll just one more plug the the citizenship event that's going to happen on on the April the 10th, I think will be probably the largest naturalization citizenship event ever to be held in the city of Long Beach.'",
        "'speaker_0': 'It's a huge countywide effort or really proud of that. And I know there's a lot of partners from around the county and region coming together for that for that event. So I'm happy to be a part of that and support that event as one of the hosts.'",
        "'speaker_0': 'And I look forward to see you all there as well as the other events happening.'",
        "'speaker_2': 'So thank you, Mayor.'",
        "'speaker_0': 'Thank you very much, Jessica. And the whole team.'",
        "'speaker_1': 'Thank we had the proclamation to present to you formally. So will the mayor and myself will come up and give that to you.'",
        "'speaker_0': 'Thank you. And is there any any other public comment, I mean, separate of the presenters here? Seeing none. Thank you to the proclamation members. Please go ahead and cast your vote.'",
        "'speaker_2': 'Motion carries. Hello.'",
        "'speaker_0': 'Okay. We're going to actually go and do item 17 quickly, which is just appointment of council members to one of our our council committees. Sir. Can I get a motion in a second, please? Any public comment? This is the school board's joint.'"
    ],
    "Contract Award for Recyclable Collection Services to Waste Management.": [
        "'speaker_2': 'I don't. 14. Report from Public Works and Financial Management. Recommendation to award a contract to Waste Management for recyclable collection services in an annual amount not to exceed 3.5 million citywide.'",
        "'speaker_0': 'Okay. Mr. West.'",
        "'speaker_7': 'Mayor, council members. Over the past few weeks, there's been a huge amount of misinformation provided about the procurement process with regards to the recycling RFP, which we have attempted to correct. Each of the four firms have a financial benefit from securing this contract, so it is natural that they will be doing everything possible to secure the award'",
        "'speaker_7': 'for their company. This is a very common practice in California and throughout the nation. Recycling and trash procurement is one of the most competitive procurement processes any city can undertake. In large part due to the length of the contract period and the large costs of providing the service.'",
        "'speaker_7': 'Recognizing early on that the procurement process for recyclable collection services would be a high profile, sensitive one. City staff hired H, F and H, an independent consulting firm, highly regarded industry expert in refuse collection and recycling procurement. Their role was to lead us through this process from creation of the scope of work of the RFP to the'",
        "'speaker_7': 'evaluation of the proposals. An RFP procurement process was selected to find the best value for the city, which includes a number of criteria affecting the service, including implementation, cost, revenue to the city, potential disruption of services and service reputation.'",
        "'speaker_7': 'H.f. and H is an expert in compiling various proposals and comparing apples to apples. As in many cases, firms will have varying benefits or costs in their proposal. They are highly respected for their expertize transparency and independent analysis.'",
        "'speaker_7': 'HFA and H has served over 300 public agencies and managed over 70 competitive procurements. In fact, each of the four firms we considered has each used the H, F and H forms and bidding process in the past, and each has won under that process.'",
        "'speaker_7': 'In summary, city staff has taken all the necessary steps to conduct a transparent procurement process by hiring a chef and H. A highly regarded and reputable independent consulting firm. However, since questions have been raised and with the memorandum from the city auditor stating that she has concerns based on the issues discussed at the March 8th meeting, I'",
        "'speaker_7': 'feel the best approach at this point is to reject all proposals, rebid the contract and request new proposals. We need to ensure the issues raised are properly reviewed and addressed. If they prove to be factual. To respond to that request to the request of the auditor.'",
        "'speaker_7': 'I will be engaging in an independent. I will be engaging an independent financial firm to review the concerns and have input from both the city auditor and city attorney. The city auditor and the city attorney will have the ability for complete input into this review, and the result will be a report to the City Council on its'",
        "'speaker_7': 'findings within 30 days. There are improvements that can be made in any process. Improvements recommended by the review would be incorporated into the rebid process. The study scope would include the following a review of all written protests and comments and a review of all verbal allegations made at City Council made at City Council by vendors.'",
        "'speaker_7': 'A review of RFP forms as to whether they were confusing or otherwise problematic. A review of the information submitted by proposals and whether that information was properly utilized. A review of basic steps in the RFP process, including the request for additional information and including the role of the consultant use.'",
        "'speaker_7': 'The firm will be able to talk to anyone they wish and will get input from the auditor and the city attorney and the draft results will be reviewed by them. Finally, I do need to point out that any option other than awarding the contract to Waste Management will necessitate.'",
        "'speaker_7': 'We negotiate with Waste Management to provide interim recycling collection services while we perform the review and new procurement process. Their contract with the city expires in June 2016 and has to be renegotiated before it can be extended. We will engage in those negotiations immediately and return to the City Council with a recommendation.'",
        "'speaker_7': 'Thank you. This concludes my report. HLN is here tonight and is available to answer any questions anybody might have.'",
        "'speaker_0': 'Okay. Thank you. There's a there's a motion any second. I'm going to start with Councilman Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. So so, first of all, thank you, Mr. West, for for this report and for keeping us up to speed on this. And thank you, City Auditor Dowd, for the memo. I did get a chance to take a look at it.'",
        "'speaker_10': 'And so I have seen the questions that have been raised from different parties in particular, and and now this this memo from our city auditor. So I do see what prompted this new recommendation from our city manager. As I see it and as I've been following this, it looks like there's, you know, three options that have been'",
        "'speaker_10': 'placed on the table. On the table. The first was the first staff recommendation, which is what's actually on the agenda tonight to approve this contract. Then there's the second staff recommendation, which is to conduct the third party review while running concurrently through a new bid process.'",
        "'speaker_10': 'And my understanding is that that still would require us to go back to the the agency that has the contract and renegotiate because their their term will expire in June. Then there was the option from the motion two weeks ago or last week that requested the 4 to 6 month audit from the city auditor.'",
        "'speaker_10': 'And those all seem like, you know, it doesn't seem like there's a perfect solution here. So what I'm what I'm hoping would exist is a fourth option and what that fourth option is. My first question would be how long would it take to conduct the third party review?'",
        "'speaker_10': 'That's actually a part of tonight's recommendation. How long would it take to conduct that review and help us determine whether there was a foul in the process? If there was a foul in the process, then fine. We push the button, go back, rebid the process, extend the contract and take those additional steps.'",
        "'speaker_10': 'But isn't there something isn't there a fourth option that takes less time before we, you know, so we can find out if there was a foul and use some third party. So I guess that's my first question. Is city manager, is there a way to do a shorter review, you know, 30 to 60 days, something that does'",
        "'speaker_10': 'not trigger us to go back and extend the existing contract? Is that a possibility?'",
        "'speaker_7': 'Councilmember My recommendation in my recommendation tonight, that is one of the recommendations that I would engage a financial consulting firm which would complete that study within 30 days.'",
        "'speaker_10': 'And would that avoid us from having to extend the contract because the rest of your recommendation right now is to rebid it and then we would have to extend that contract, correct?'",
        "'speaker_7': 'If we rebid the contract, we certainly would have to renegotiate with the current vendor.'",
        "'speaker_10': 'So because I think I mean, I think it's great that we do have an auditor, but we do have a city attorney and we have a number of eyes that we can place on this process. I think that what you know, it's I think asking for a 4 to 6 month audit seems like and after I find'",
        "'speaker_10': 'out everything that goes into this, it seems like sort of the nuclear option. And I think there's a number of steps we can take to find out if there was a foul before we go a go and commit the resources to a 4 to 6 month study.'",
        "'speaker_10': 'So before we make a decision on the contract, I want to know, was there a foul? So what I'd prefer to do and I'm going to make this into a motion, I'd prefer that we go forward with the first half of your recommendation, which is conduct that review within 30 to 60 days that does not trigger renegotiate'",
        "'speaker_10': ', you know, renegotiating an extension and rebidding come back to the council so we can see with a third party review so we can see whether or not there was a foul, if there were if in fact, there was a foul.'",
        "'speaker_10': 'Then we can the city council can make that decision. So that would be my motion. I would also, as a part of that motion request, that the city attorney, city auditor, that they all play a role in this, whether it's they are part of the group that selects this third party contract, this third party evaluator, you know'",
        "'speaker_10': ', if you will. But I would like that to be a part of that. Is that so? That's my motion.'",
        "'speaker_0': 'Okay. There is a motion and I think there's a second by Councilwoman Price. Is that right?'",
        "'speaker_1': 'There is. But I have a friendly a couple questions and a friendly.'",
        "'speaker_0': 'Okay, Councilman Price. Okay.'",
        "'speaker_1': 'So. I have a few questions here. First of all, I agree with Councilman Richardson's assessment. I can say unequivocally nobody that I've talked to wants to restart this process. So I think that's the one thing everybody is in agreement on is not wanting to start this process unless, of course, there's some indication that that would be a'",
        "'speaker_1': 'prudent course of action after some analysis, which we have no evidence to suggest that that would be the case. I think our intent, at least my intent with the agenda item last week was to just have a second, a neutral second set of eyes, take a look at the process.'",
        "'speaker_1': 'And while I think a longer audit would be the best course of action, I understand that we have some timing limitations and that the 4 to 6 month period presents a host of concerns. So I'm okay with this.'",
        "'speaker_1': 'The route that we're going, the friendly that I would make is I would like the city attorney's office, since they're a neutral, kind of not connected, they don't oversee any department that was involved in this process. I'd like the city attorney's office to select the the vendor who conducts the review.'",
        "'speaker_1': 'So that's the first friendly that I would make.'",
        "'speaker_10': 'Absolutely. I think that's that was my tent by saying involve them but I prefer the language you selected so we can have the city attorney who wasn't involved make that make that call to.'",
        "'speaker_1': 'Select the the the vendor that we work with. And then second, for the city attorney to kind of oversee the review process and report the findings back to me.'",
        "'speaker_10': 'Did you mean city? Did you mean city auditor? No.'",
        "'speaker_1': 'City City attorney. Attorney.'",
        "'speaker_7': 'Okay.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'City. I think that would be that that's that's an entity that's not connected with any department that was involved in this process. And I think since we're now using not an in-house reviewer, but a contracted reviewer, I think that would make the most sense.'",
        "'speaker_4': 'Sure.'",
        "'speaker_1': 'And and then in regards to the the timing of this, I understand that we've labeled it a 30 day review. But but frankly, I think it should be the amount of time that's necessary to do the work, hopefully somewhere less than six months.'",
        "'speaker_1': 'But if it's 30 days or as Councilman Richardson said, 60 days, I don't think I think that if we get to June and by the way, Mr. City Manager, is there a date certain in June when the contract expires June 30th, June 30th.'",
        "'speaker_1': 'So if it would be possible for us to have this the findings of this review come back to council like mid-June, you know, the election's going to be kind of a busy time. So maybe the meeting after, if we could have them come back, that'll give us time to determine whether or not we're going to be moving'",
        "'speaker_1': 'forward with staff's recommendation or we need to. Go further. So I would recommend June 14th. That comes back by the city attorney with recommendations.'",
        "'speaker_10': 'Or no later than.'",
        "'speaker_1': 'No later than.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_10': 'And I would accept that and let me clean it up then since initially I said, you know, who could be involved as a city attorney, city auditor, I think since given these friendlies, I think we should just keep it clean and just say the city attorney.'",
        "'speaker_1': 'That's fine.'",
        "'speaker_10': 'Period.'",
        "'speaker_0': 'Perfect. Okay. We're going to keep moving forward here. Councilman Price, did you have any additional comments or, you.'",
        "'speaker_1': 'Know.'",
        "'speaker_0': 'OC suggested I'm going to restate this just to be very clear. What we're essentially taking the recommendation to re rebid and restart the process the same time. That I missed that first part.'",
        "'speaker_10': 'So that's the part we're not doing. So what we're doing is just restate. We're going to conduct the review that takes, you know, sometime between 30 and 60 days, as long as it does not trigger the contract extension.'",
        "'speaker_10': 'We're going to do the review. Based on that review, the council will decide either to award the contract as recommended or we begin the process again. Got it.'",
        "'speaker_0': 'Okay. Thank you. That's actually completely different than what I heard.'",
        "'speaker_10': 'With with the city attorney.'",
        "'speaker_0': 'Conducting. And the and the person conducting the review is the city attorney.'",
        "'speaker_10': 'No. They select.'",
        "'speaker_0': 'Selection, selecting the third.'",
        "'speaker_10': 'Party to provide oversight to the process.'",
        "'speaker_0': 'Perfect. Okay.'",
        "'speaker_7': 'And, Mayor, if I may, I.'",
        "'speaker_3': 'The what I heard from.'",
        "'speaker_7': 'The city manager is the scope of the services. I want to make sure what I'm signing up for here. So the.'",
        "'speaker_3': 'It would be to.'",
        "'speaker_7': 'Come back to the were in working with the independent financial firm within 30 days before June 14th to.'",
        "'speaker_3': 'And I'm just going to read it's.'",
        "'speaker_7': 'A review of all the written protests, the comments, a review of all the verbal allegations that were made at the council meeting, a review of the forms, and then a review of the information submitted by the proposers and whether the information was properly utilized and considered.'",
        "'speaker_7': 'And then the basic steps in the RFP process, including the request for additional information in the context and the roles of our consultant, and that this firm would would be talking to anyone and everyone in the city that they needed to in order to get that information.'",
        "'speaker_7': 'At that point, they will come back with some sort of a an opinion on the process and what happened. And if I understand Councilmember Richardson correctly, at that point, council can make a decision to either reject all bids if there were problems.'",
        "'speaker_3': 'Or if they believe that the.'",
        "'speaker_7': 'Process was fair. You can make your determination on who to award to.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_1': 'And Councilman Price, I do I do have some clarification on that scope. But since I seconded the motion, one thing that wasn't included in the scope that the city manager specified, although I think it is included in the broader umbrella but wasn't spelled out and I think it should be spelled out is I've met with three of'",
        "'speaker_1': 'the four vendors and every single one of them has pointed to some numeric equation or numeric value that was reported that in their opinion. That to me raised some concerns about what actually was and put it and if everybody was on the same page about the numeric value.'",
        "'speaker_1': 'So I think the scope should involve, you know, again, this is this is not our industry. So that's why we're hiring someone to help us with it. But the replacement of the containers and the value of the recyclables, whatever criteria was factored into the equation, because when we're speaking with these vendors and they're telling us this number'",
        "'speaker_1': 'was an accurate or this, that's really not something that council members should be interpreting, in my opinion. So if they can look at the numbers, the data that went into the calculations and make sure that everybody was operating from the same understanding, I think that would be that would give me a lot of confidence in this process'",
        "'speaker_0': '. Q Councilmember Oranga.'",
        "'speaker_9': 'Thank you, Mayor. Basically, as I said last week, I wasn't approving the direction that the City Council was giving the city attorney or the city order in this. I still feel that the process took care of itself and with that in mind, like to ask staff if they could go over the process again from beginning to end'",
        "'speaker_9': 'and how long did it take and how much staff time was involved in getting these bids evaluated and to the point of last week where we a recommendation was made.'",
        "'speaker_7': 'Councilman to restate the question.'",
        "'speaker_9': 'Describe the process from beginning to end as to how we got to the point of last week where you made your recommendation to go with waste management.'",
        "'speaker_7': 'Our public works director, Craig Beck. I think you might want to introduce our consultant.'",
        "'speaker_9': 'By the way, as a consultant here.'",
        "'speaker_7': 'So. So, Craig, could you introduce our consultant?'",
        "'speaker_0': 'Yes. You're mayor members of council tonight. We have a representative.'",
        "'speaker_8': 'From that who who worked directly with staff in the preparation of this RFP and who analyzed the responses and who has done this a number of times. And I'll ask him to generally walk through the process and. Provide some more information about how the groups were put together and analyze.'",
        "'speaker_8': 'Good evening. Mayor and council members. The City of Long Beach released an RFP to the city's purchasing division on April 21st, 2015. Pre proposal meeting was subsequently held on May 11th, offering all the proposals proposers an opportunity to ask questions.'",
        "'speaker_8': 'Written responses to those questions from the pre proposal meeting were issued on May 13th. 2015. And then after the pre proposal meeting, written questions were subsequently accepted until May 22nd, 2015, and then written responses to those questions were provided by the city on June 10th, 2016.'",
        "'speaker_8': 'The proposals were due on July one, 2015. A written proposal summary that was prepared by our office, dated August five, 2015, was sent out by the city to each proposer to confirm our understanding of their proposals, and that included the proposed first year compensation.'",
        "'speaker_8': 'Responses to that communication were submitted by August 12th, 2015.'",
        "'speaker_9': 'Could you stop right there for a second?'",
        "'speaker_8': 'Yes.'",
        "'speaker_9': 'This backtrack a little bit. Who are you? How long have you been in business? What's your track record in doing these kinds of auto proposal reviews for not only the city of Long Beach, but for other jurisdictions as well?'",
        "'speaker_7': 'Build up. Build up.'",
        "'speaker_9': 'Tell me you're credible.'",
        "'speaker_8': 'Tell me who you are. We're very credible. And we have done more of this work in the state of California than any other firm that's out there. We were founded in 1989. I joined the company in 1991. And since that time, this is all I do is solid waste work.'",
        "'speaker_8': 'I don't do roads one day and transportation the next day. All I do 52 weeks a year is solid waste and recycling work. I've personally been involved in approximately 30 of the competitive processes that we've taken cities through and have negotiated many, many more contracts than that.'",
        "'speaker_8': 'We don't work for any of the trash companies. We only provide these services to public agencies to avoid any sort of conflict of interest that would occur if you were to work for garbage company on Monday in the city on Tuesday.'",
        "'speaker_8': 'I think that would be a problem. So after the responses were received to our summary of proposals that completed the preliminary evaluation and then additional cost information was requested from the proposers under a fixed ten year term, the initial seven year term included a three year option to the city to extend.'",
        "'speaker_8': 'So to get a better price, the city package the three year option with a seven year fixed term and said what would that do to your price for ten year? And the companies responded in writing, providing that ten year cost information.'",
        "'speaker_8': 'The last step in the process was all four proposers were interviewed by the city's evaluation team. Then we prepared an evaluation report, provided information that the city staff and city staff prepared the documents that you've that you've seen after the preliminary staff reporter draft staff report was prepared or not, a draft eight staff report was prepared.'",
        "'speaker_8': 'Public indicated that there they believe their costs were less than what was shown in the report. Essentially, Republic didn't complete its proposal form correctly. They made a mistake. They're human. People make mistakes. They were provided an opportunity to correct that mistake and information that was provided subsequently to the council.'",
        "'speaker_8': 'And so you've seen their numbers go both ways. The bottom line is, even if you take their corrected figure, it is still higher than that of Ed Coleman Waste Management, and it is higher than that of the current rates.'",
        "'speaker_8': 'This is a request for proposal, not a request for bid. So you can still you don't have to throw their proposal out, which you would do in a bid process. You could still accept it if you choose to.'",
        "'speaker_8': 'You can accept any one of the four proposals that are before you. But their proposal is not as cost effective as the ones from waste management that go.'",
        "'speaker_9': 'Is that complete?'",
        "'speaker_8': 'Yes.'",
        "'speaker_9': 'Okay. In terms of a staff time, a city manager, how much staff time was put in on this report from beginning to end, from May to last week or two weeks ago?'",
        "'speaker_7': 'From the last two weeks.'",
        "'speaker_9': 'Up to that point from eight to the.'",
        "'speaker_7': 'Oh, the entire RFP process. Boy, I'm going to turn that over to our public works director or perhaps Jason McDonnell, our purchasing officer who did the RFP.'",
        "'speaker_8': 'Councilmember. We would estimate that there were hundreds of hours involved in the analysis as well as the RFP preparation.'",
        "'speaker_9': 'Now going back to the process itself and at the point where one of the three agencies submitted, I'm assuming that they submitted a complaint. That the process was somewhere flat. Was that was that a process in itself also to revisit or review the contentions that were being made by this other this other agency?'",
        "'speaker_9': 'And what was that? What did that include?'",
        "'speaker_8': 'Council member the process to review a bid protest or in this case, an RFP proposal protest is stated within the specifications and allows certain timelines. The responses were acknowledged and based on the complexity of this process, there was additional time requested by the city to respond to both a letter of concern from Echo and a specifically called'",
        "'speaker_8': 'out protest by Republic. So there was additional work done at that time to review and consult both with the consultant as well as city staff in the Environmental Services Bureau.'",
        "'speaker_9': 'So the consultant was also a part of the protest review period.'",
        "'speaker_8': 'Yes, sir.'",
        "'speaker_9': 'Okay. So in essence, what is being moved in front of me by Councilmember Richardson is to add is to and he and this is a statement I think that he made was. He wants to know if there was no foul foul in stat's review of the complaint.'",
        "'speaker_9': 'Now. From what I understand up to this point, there was an RPG put out. People applied, they were reviewed, a recommendation was made, a protest was filed, the protest was reviewed. And the staff came with a recommendation. Yeah, correct.'",
        "'speaker_9': 'Yes, sir. To summarize it very briefly. Okay. So at this point, I want to thank you, obviously, for your remarks, but there is nothing that I've seen at this point to indicate that anything went a fall. That there is a misinterpretation of figures that there has been any kind of malfeasance, as it was mentioned before.'",
        "'speaker_9': 'I think that having the third party review with H.f. and each was was fair. It's a third party review. It is a consultant and city manager or maybe city attorney. If you were to go to a third party review, who would you hire if not H.f. and H?'",
        "'speaker_9': 'Who is there somebody out there?'",
        "'speaker_7': 'I certainly don't have a name as I sit here today. We would have to go find someone and I would get names of folks who have to do this kind of work.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_9': 'So and that's and that's my contention. I think that what we did was we did the best we possibly could. We had the best of the best involved in this. And so I want to make the substitute motion to go back to the original motion, which is to accept staff's recommendation for the the proposal that's presented.'",
        "'speaker_0': 'There's emotion. I don't see a second there. A second? There is a second. Okay. By Councilmember Austin, which is the original motion. Councilman Austin, do you want to speak to the second?'",
        "'speaker_11': 'Yes. This is and I want to thank all of the bidders for for their interest in serving the city of Long Beach. I want to thank staff for their exhaustive work on this. I want to thank the council members for for weighing in.'",
        "'speaker_11': 'But I tend to agree that we are we may be duplicating our efforts. Again, it seems to me that there has been a third party independent review and a third party governing this this this process. The outcomes are not necessarily what everybody necessarily wants, but it seems to me that.'",
        "'speaker_11': 'Our actions could be perceived as disruptive. It would disruptive to two services. If we don't, we don't make a decision soon. And and so I'm very concerned about that. I'm concerned about our ability to to continue to actually get recycle or have recycle services.'",
        "'speaker_11': 'I don't want interruption. It's clear that for the past 20 plus years, we've had pretty decent service. I haven't heard too much of in terms of disappointment with the services that we we currently have here today. I've looked at the YouTube videos.'",
        "'speaker_11': 'I've reviewed a number of the the the claims and understanding that this is a very, very competitive process. I think council member Urunga is assessment is is is is actually pretty spot on here. And so therefore I'm seconding the motion and recommending that that the rest of the council follow suit.'",
        "'speaker_0': 'Okay. Thank you. Now, just before I continue, I want to make sure we can get to the public as well. If unless I know we're going back through another round of folks that have of councilmembers are unless there's objection, I'd like to go to the public and they will come back to the speaker's lists unless there's objection'",
        "'speaker_0': '. Okay. Councilman, you really want to clarify something about your motion? Yeah.'",
        "'speaker_9': 'I want to recommend. I want to make clear that my motion is to receive and file the city manager's report and to accept the original proposal from city management to award the contract as proposed to waste management. Okay.'",
        "'speaker_0': 'That's the that is the substitute motion on the floor. We're going to go to any public comment and it will come back to the speaker's list of the council without objection, seeing none. Okay, great. Any public comment on this item?'",
        "'speaker_0': 'Okay. So there is no public comment on this item. So I'm going to go and go back to the council. There is no there is. Okay. We got to make up our minds if there's public comment or not.'",
        "'speaker_0': 'Please, guys, if there is. Let's do that now.'",
        "'speaker_3': 'Good evening, Honorable Mayor Garcia and members of the council, the city of Long Beach. My name is Jeff Snow and I am with Republic Services and Rainbow Environmental Services of Huntington Beach. I am wearing a purple tie tonight because to me, this contract is still about recycling.'",
        "'speaker_3': 'Recycling and sustainability in the city of Long Beach. And I'd like to share some recycling performance data at the mayors and councils. Pleasure Based on the March 9th City Council meeting. Staff presented the 26,749 tons were recycled for the city of Long Beach in the prior year, just down the road using advanced murf or material recovery facility'",
        "'speaker_3': 'technologies using a workforce with the tenure of ten years on average where they're paid well, provided full benefits and workforce development opportunities, and with outreach to residents that increases their participation and set out rate. Based upon the actual performance validated by the state of California.'",
        "'speaker_3': 'Cal Recycle for the city of Huntington Beach. The same Long Beach results would have been nearly 50,000 tons recycled instead of 26,000 through Republic Services Program and Rainbows Material Recovery Facility. We do think that recycling and diversion is important to the citizens of the city of Long Beach, and we urge council and staff to evaluate the actual'",
        "'speaker_3': 'recycling performances of the Smurfs. Again, we invite all to come and visit our facilities, see what our processes, what our outreach, and what our programs can do to enrich this community's sustainability. Diversion and commitment to the planet. Thank you.'",
        "'speaker_0': 'Next week, please.'",
        "'speaker_8': 'Good night. We are.'",
        "'speaker_3': 'I'm representing the drivers of the company that pick up your recycling problem, which we've been doing for 20 years, over 20 years. Whether we're right, whether it's clean and we want to keep on doing it. We went through.'",
        "'speaker_3': 'All this process I think is long enough. We will need to go to extension or anything. We just want to keep on doing what we're doing well. And we've been doing it for so long. Just please ask you, we ask you to consider it right now and get it over with.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mayor. Council, city staff and guests. My name's Jeremy Harris, senior vice president at Long Beach Area Chamber of Commerce. Tonight, I'm here on behalf of our Chamber and Long Beach area businesses. We're here due to the recent comments made in the press and the various correspondences that have been made public regarding the proposal process for'",
        "'speaker_3': 'the city recycling collection services that we're discussing tonight. We welcome the opportunity for an independent third party. Review has been discussed tonight. We believe this is a permanent move. The Chamber is not only concerned with this particular process or this particular bid or RFP, but the entire bidding and process long term.'",
        "'speaker_3': 'Time and time again, members and non have contacted the Chamber regarding the city's RFP and bid process. Each time we've ensured these businesses that we believe staff is provided the utmost care and due diligence to the process. In fact, we've openly promoted the city's bid proposal process through multiple media channels to our members and interested businesses.'",
        "'speaker_3': 'So that is why we are here tonight, to ensure that when the process is further put under the microscope, which has been made apparent with this particular bid, that we take notice with these concerns so that we may appropriately educate our members about the process through the city.'",
        "'speaker_3': 'It is with this understanding that we ask for an independent and thorough review of the process. We find it prudent and unbiased that if a third party comes in and does this, it is the best way to move this process.'",
        "'speaker_3': 'This item with the city recycling contract and services forward and ensure our business is of a fair process moving forward in the future. Thank you for your opportunity to address you tonight.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Thank you, Mayor and City Council. My name is no Legado Mondo. I'm actually the executive director of Long Beach Blast, a nonprofit here in Long Beach. Been around since 2000. And we are committed to this city and to the youth and to education.'",
        "'speaker_2': 'And I must say, although I'm not here to talk about the bid process or the RFP, I do want to talk about waste management and their commitment to the city and to the youth of our community, because they not only are here obviously bidding this contract and wanting to serve the public, but also want to serve our'",
        "'speaker_2': 'youth. They support us, which supports the community of Long Beach, not only financially but also with their time. One of our board members is from Waste Management, Janine Hamner. She's here. And again, as somebody who cares about Long Beach, and even though this might be all about dollars and cents, we have to think about who is committed'",
        "'speaker_2': ', who is putting their money and their time and their effort to our community. And that's waste management. Thank you.'",
        "'speaker_0': 'Thank you. See no other public comment. I'm going to go to close public comment and go back to the council and then we're going to go to vote. Councilman Mongo.'",
        "'speaker_2': 'Since we have the consultant here, I thought I might ask just a few quick questions of things that had been posed to me via email of my constituents over the last two weeks while we've had this time. They had asked whether or not the time our RFP process took is significantly similar to other agencies of our size'",
        "'speaker_2': '. Would the consultant be able to speak to that?'",
        "'speaker_8': 'Yes. Similar.'",
        "'speaker_2': 'And. Would you say that what an average cost would be of putting together an RFP of this magnitude for a have you have you worked on an RFP of a similar city? And did it cost plus or -10% of what this bid cost?'",
        "'speaker_8': 'Yeah. We've been involved in processes that have run from 100, $250,000 for the whole process start to finish.'",
        "'speaker_2': 'And this one cost.'",
        "'speaker_8': 'I think this is right about 100.'",
        "'speaker_2': 'And so if we're a significant city of great size, we were on the lower end of that. Is there any contributing factors to why that was?'",
        "'speaker_8': 'It's only a recycling contract. Most of the cities have integrated trash, recycling organics programs, all the residential, all the commercial, all the roll off. And they're actually by dollar value, far larger than this one here at Long Beach for much smaller cities, because this is only the recycling piece, which is a very the smallest piece of the'",
        "'speaker_8': 'solid waste stream in the city of Long Beach. Municipal crews provide the residential refuse collection, which is a much larger activity than the recycling. And the commercial is provided by multiple commercial haulers that compete on for business rate at the individual account level.'",
        "'speaker_8': 'So we're talking about a very small portion of the entire solid waste stream here in Long Beach.'",
        "'speaker_2': 'And typically does your firm prepare the report or do the city staffs of each city that you do the research for typically perform those reports?'",
        "'speaker_8': 'We typically develop the evaluation report and then the the city staff develop a staff report with their recommendation to council.'",
        "'speaker_2': 'So that's significantly similar to what happened in this last round as well.'",
        "'speaker_8': 'That's correct.'",
        "'speaker_2': 'Do they typically have up to four adjustments in discussions after the interview phase asking for different variances.'",
        "'speaker_8': 'There's not a standard there. Every city's done things differently if they've. So I think it's important to understand that what the was was trying to be achieved here is to allow everybody the opportunity to propose on the same thing.'",
        "'speaker_8': 'And as an example, when the initial proposals came back, they were for seven year terms and with all the carts being replaced and one of the vendors proposed, well, if we don't replace all the cards in EUR four, we can provide a more cost effective proposal.'",
        "'speaker_8': 'And they gave an alternative cost. And so to ensure we had apples to apples, we went back and asked all the other vendors. We said, well, if you were to do that, what would that do to your costs, too?'",
        "'speaker_8': 'So, you know, the situation was tailored to the circumstances that you had so that the council wouldn't be placed in a situation where you had one company that provided a proposal under one set of circumstances and another company saying, well, here's this alternative proposal, and it's much better when the other companies haven't had an opportunity to propose'",
        "'speaker_8': 'on it. Mm.'",
        "'speaker_2': 'And the last major question that I received via email was about understanding the commodity of recycling and how. The prices change and how a vendor would even be able to predict what recycling revenue to the city might be and what that does to a bid.'",
        "'speaker_8': 'Recycling commodity revenues are an important part of what the vendor is going to get back to offset portion of their costs of operation, as well as what they'll remit in revenue sharing to the city. Trying to predict commodity markets is like trying to predict what the stock market is going to do each year for the next ten'",
        "'speaker_8': 'years. It's a nearly impossible exercise. That being said, the vendors do the best they can, but they may make very different assumptions about what those commodity markets are going to look like. So it wouldn't make any sense for the city in evaluating the proposals to put as an offset to their cost evaluation what different proposers are projecting'",
        "'speaker_8': 'in the commodities markets, because they all make very, very different assumptions and in the end they're all selling to the same commodity market. They may make and use the stock market example again. They all may make very different predictions about what that market's going to look like, but in the end, they're all going to participate in the'",
        "'speaker_8': 'same market.'",
        "'speaker_2': 'And so with that flexibility and commodity, as you can tell, many of my residents are very read up on the issue, some of which used to be city staff. Is there a reason that we don't standardize the revenue requirement of recyclable contracts?'",
        "'speaker_2': 'And is that we Stan standard across all bids across many cities in the region? They are not standardized, is that correct?'",
        "'speaker_8': 'Well, most cities don't have a separate recycling contract. It's a small piece of a much larger contract. And the and the recycling pieces is very modest. And so that's not the focus when you're looking at a trash contract.'",
        "'speaker_2': 'Thank you. I appreciate you being here tonight. I appreciate you standing by your work. I appreciate the work that the city staff have done, and I look forward to hearing the comments of my colleagues.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_1': 'Thank you. I already spoke. So I'm going to be very brief. I just want to say, I heard what Councilman Urunga and Councilman Austin said, and you were going to have to agree to disagree on their points. I think in light of what the city auditor has pointed out, we're talking about we were talking about a six'",
        "'speaker_1': 'month review process. I think Councilman Richardson. Was very thoughtful in his desire to compromise for something shorter that allows a review, while at the same time allowing the process to move forward. You know, it's it's this this whole losing side of the forest for the trees argument.'",
        "'speaker_1': 'We're talking about a short window of time to be able to say that we did everything that we could to ensure that the process was fair. This is not at all about the companies. Let me just start by saying all three of these companies are stellar companies.'",
        "'speaker_1': 'There's no doubt about it. None whatsoever. I've met with all three companies. I've met with their representatives. The City of Long Beach would be well-served to have any one of these three companies representing it. And Waste Management has absolutely done an amazing, outstanding job over the last 20 plus years, no doubt about it whatsoever.'",
        "'speaker_1': 'But that's not what we're here to do. We've gone out to to bid. We've opened up the process. We haven't opened up this process for decades. And every single one of the vendors has pointed out something that warrants some additional consideration.'",
        "'speaker_1': 'And we're not talking about an extensive process. We're talking about 30 to 60 days to make sure that we feel confident in the process before we vote to move forward on a ten year partnership. I met today. I've met with all the representatives and again, I have nothing but positive things to say about all of them.'",
        "'speaker_1': 'But I do have to highlight I met with Ed Co today and I just I want to say every single one of these companies has been a class act. But I was taken aback by Ed Coe's. Just there, there, there demeanor during the interview.'",
        "'speaker_1': 'I mean, they had nothing but amazing, positive things to say about the people that are competing for this proposal. Amazingly positive attitude towards the city of Long Beach, towards wanting to do work in the city of Long Beach.'",
        "'speaker_1': 'You know, they have some issues with some of the calculations, but certainly it's not something that they're going to protest. That's just not how they do things. As as they explained to me, whether you choose to follow their philosophy or not.'",
        "'speaker_1': 'That's just an example to me of what good quality companies we're dealing with here. That in a meeting with me tonight before this item, they had nothing but positive things to say about the people that are bidding against them on this project.'",
        "'speaker_1': 'And really, their their ask was, we think a second set of eyes would be prudent. There are some things that they would have, you know, like to see included or not included that they feel were a big factor in the final price recommendations that came down.'",
        "'speaker_1': 'And that is the same with Republic and even Waste Management and talking with them. I've learned that there are there are probably had they not been the recommended bids, some issues that they would have had with the numbers.'",
        "'speaker_1': 'So this really isn't about every single one of these companies is great partner. This is just about taking the additional 30 to 60 days with Shorten that process, we've taken the full official audit out of it and said, You know what, let's have an entity that's not affiliated with this process.'",
        "'speaker_1': 'Select someone to help us take a look. We lose nothing by doing this. We lose nothing. No, there's no credible argument that anyone can make that says we lose anything. Even waste management that I've spoken with their representatives, they understand why we're doing this.'",
        "'speaker_1': 'They understand that we've made efforts to shorten this process. And I think they're willing to be a ten year partner with the city. An additional 30 to 60 days is not too much to ask in terms of an investment.'",
        "'speaker_1': 'I think everyone that we're working with is patient enough to understand that process. Again, we want to be if if the staff recommendation is what the reviewing body says, you know what this was all the numbers are accurate.'",
        "'speaker_1': 'Everything was reported accurately. The process was great. We can vote on that. No problem. I have no problem voting on that. I just don't want to vote on that, especially knowing what I know now in terms of some of the things that have been pointed out, I don't want to do that until I personally have a second'",
        "'speaker_1': 'set of eyes, take a look at it. And my understanding is that the consultant that we hired wasn't here to give it a second set of eyes. They actually were the consultant that was hired to do the process.'",
        "'speaker_1': 'They weren't brought in to review the process. They were the company that helped us do the initial process. So it's not we haven't had a review of the process. So I think I thank my colleagues for listening.'",
        "'speaker_0': 'Councilman Richardson.'",
        "'speaker_10': 'Thank you. I'm going to clarify the intent here, and I'm going to appeal to my colleagues to try to find some consensus here, because the intent was this was a compromising consensus building motion. So so I do want to thank all of the companies that submitted.'",
        "'speaker_10': 'I'm pretty confident that most of them, if not all of them, probably would have done a great job. And that's why I don't think we should immediately throw out the baby with the bathwater. I understand the diligence that did go into this process.'",
        "'speaker_10': 'What I'm looking at seeking is clarity and confidence in casting. No doubt on the process we can get to a yes or no. And you know, the I read the auditor the memo from the auditor. The city manager acknowledged it and changed his recommendation.'",
        "'speaker_10': 'I can't reconcile that by going back to the original recommendation. I count on the city manager, our city attorney, our city auditor to provide good advice. And I'm looking at a change in position because it's okay to take a moment, take a pause in, you know, and review the process.'",
        "'speaker_10': 'That's okay. My motion is to substantiate whether or not there's an issue and, you know, and save money while we do it. That's what I consider a hybrid or a compromise. It should provide more confidence to this process.'",
        "'speaker_10': 'It saves money from a 4 to 6 month process. That would also include an extension of a contract. But it preserves the integrity of the the original bids by just reviewing whether that process was legitimate or not. I.'",
        "'speaker_10': 'I would rather verify or dispel doubt and convert that doubt into certainty of yes or no. And that's the intent of this motion. So that said, given that I don't have a dog in this fight, I think that most of these companies will probably do great.'",
        "'speaker_10': 'I'm going to appeal to the to the SEC, to the substitute motion maker and the second tier that said, you know, I understand where you're coming from in terms of, you know, wanting to not take any additional precedent in this process.'",
        "'speaker_10': 'But do you do you have any issue with taking a moment? We're talking 30 to 60 days so that the entire the entire council can feel as confident as the two of you do. And that's really what the question is.'",
        "'speaker_10': 'I don't I don't think we should go into a split vote. All of our interest is doing the right thing here. So I'd like to have a response from if we could.'",
        "'speaker_0': 'Well, actually well, I'd actually counsel my rank of next. And so counseling for your anger.'",
        "'speaker_9': 'Are you done? I mean, if I respond, do you see what I'm done?'",
        "'speaker_10': 'I just wanted to ask you.'",
        "'speaker_9': 'To roll with it. I'm just getting clarification. Brother is getting clarification. Okay. The the the intent of my motion. The intent of my motion. You know, I certainly agree with all the comments have been made thus far that the three agencies have all three being class acts.'",
        "'speaker_9': 'I mean, I've met with all three of them as well. They were very cordial, friendly, open, obviously concerned about about the whole process, but they were professional and competent. And there was no question that either one, any one of them could do an outstanding job for the city.'",
        "'speaker_9': 'But. My issue, if anything, is that there was a selection made. There was a process. They competed. They turned them in. There was a protest. The protest was reviewed and the recommendation came forward. That's where our man is that there was a process.'",
        "'speaker_9': 'And anything going beyond what the recommendation already is, is a spent is a is an expenditure. We're investing more time. We're investing more money. We're investing more staff to continue the process, even if it's for a month. To revisit this whole this whole process here.'",
        "'speaker_9': 'I have a question also for the for the firm H.f. and h have you ever encountered anything like this before where you're being you're being asked to step aside and have a third party review of a contract or a recommendation that you've already done before this happened?'",
        "'speaker_8': 'No, we've never seen a third party review.'",
        "'speaker_9': 'Okay. So it's it's precedent setting in this case. And, you know, I'm not sure that we want to go that route, but I leave it up to my counsel colleagues in that respect. And in terms of staff. I'm sorry I lost my money.'",
        "'speaker_9': 'I didn't lose anything. I just can't read my own writing. Okay. Well, that would be that would be basically my, my, my, my comments there is that. My issue with this and the reason for my motion is that the process was a process.'",
        "'speaker_9': 'Staff invested a lot of time. Thousands of hours in this hole, in this whole issue. And staff came back with a recommendation. My my whole point in this is not whether we want to find or go on a witch hunt to find something wrong.'",
        "'speaker_9': 'There was a protest filed. And basically what this country is going to do is say that that the protest has validity. Even though staff found no validity. But in the end and the council. Those who are supporting the the well.'",
        "'speaker_9': 'Let me rephrase it that the the the proposal, the original one is that to go through an audit that's out of the window now. So I guess I found my comment. So in this now not that it's it's it's changed the game to a certain to a certain extent city manager now that the the the city auditor'",
        "'speaker_9': 'has been taken out of the equation. Where where does that put you now in terms of your recommendation with with the report, the staff report that you filed today?'",
        "'speaker_7': 'Councilmember regarding the study by an independent third party firm. I'm standing firm with that given the auditor's memorandum, so I have to respect that.'",
        "'speaker_9': 'Okay. So you're you you you stand by the actual because you already you've been you been requested or asked to. Have a third party review, whether it's a moderator or not.'",
        "'speaker_7': 'No, Councilmember, I've not been. No one's asked me that question. Given the memo that the auditors sent, I felt that the best way to deal with that would be to have an independent review. I'm certainly okay going off the for 30 or 60 days before without rejecting the bids.'",
        "'speaker_7': 'But certainly I think I have to stand with the independent review because I do have to respect the auditors memorandum, though. That's very serious. Okay.'",
        "'speaker_9': 'Well, I'm going to stand by my my my motion only because I think that staff invested a lot of time, a lot of money, a lot of, I guess, blood, sweat and tears in getting this whole contract go to the city council and in a timely manner, starting from last May to two weeks ago.'",
        "'speaker_9': 'So I no Councilmember Richardson. I will not I will stay I'll stay by way of initial motion.'",
        "'speaker_0': 'Vice Mayor Lowenthal.'",
        "'speaker_5': 'Thank you, Mr. Mayor, and I appreciate the conversation. And I know that Councilmember Yarrawonga spoke very emphatically during the last time we took this item up, and and I have a lot of respect for his position. I come from a couple of decades worth of history with our peace and bid processes.'",
        "'speaker_5': 'And the last thing we want to do is really waste anyone's time or waste anyone's resources. And the government procurement process is is a lengthy one. It's it's not expedient and sometimes it's not efficient, but we do the best that we can.'",
        "'speaker_5': 'And our standard, to be sure that we did the ultimate best is is a high one. And so taking a little bit more time, as much as. As much as I begrudge that it does in the end, allow us the confidence to make the decisions that we do.'",
        "'speaker_5': 'With this particular situation, I and I want to concur with Councilwoman Price. Every person representing a company that spoke to me and my office regarding this issue had only the best things to say about their competitors, which is unique.'",
        "'speaker_5': 'It's hard to find that in in a competitive industry. And I want to thank all of you for taking that approach. No one disparage the other regardless of where they came in the ranking, but all spoke to the integrity of the process and laid out their case, which is their job.'",
        "'speaker_5': 'That is what they're supposed to do. Our job is to feel absolutely confident in the recommendations that we're making or that we're voting on. And I feel and I believe and I think that with this particular recommendation, I'm not as confident as I'd like to be to make that decision.'",
        "'speaker_5': 'And so I appreciate Auditor Dowd's report. I appreciate that our staff took a look at it and came forward with a recommendation. What I'd like to support and ask that we all support is a 30 day review, as the original motion indicates of of the process, and then come back and see what our recommendation is at that'",
        "'speaker_5': 'time. So with that, colleagues, I recommend that we go back to the original motion. I do respect Councilmember Yarrawonga and and Councilmember Austin's position. It is a correct one in in on the face of it, because it is time, it is resources.'",
        "'speaker_5': 'And you feel strongly and I agree with Councilman Richardson, I'd like to feel that strongly with my vote. Thank you.'",
        "'speaker_0': 'Councilman Austin and then Councilman Gonzales. And we're going to a vote.'",
        "'speaker_11': 'Thank you. And they say we always agree up here. I don't think that's the case. And I do appreciate the comments from my colleagues. Everybody is making reasoned comments here this evening. My my my concern has been been obviously the process and and, you know, just entertaining that you know, there has been something wrong with the process'",
        "'speaker_11': 'when. But in our city auditor's memo was certainly eye opening. I'm curious this evening hearing the original motion, why the city auditor was removed from the process? No, because it states that it's going to go right through to the city attorney only.'",
        "'speaker_11': 'And so she she raised so many pointed points during her entire memo. The original motion has has actually sought to to eliminate her. And so this is this is this is not a mea culpa or anything like that.'",
        "'speaker_11': 'I do think that it is important that we we move forward in award of contract. I think it is. We're running out of time. We are going to bring an issue back and then literally have two weeks to to make a decision.'",
        "'speaker_11': 'And and and even possibly if we decide to kick the can down the road a little bit further, renegotiate with with with a two week window. I think we are really putting a lot of strain and have put a lot of strain on our on our city staff on this particular RFP.'",
        "'speaker_11': 'And and as a council, I think it is our job to try to inspire confidence for them as well. This is and I'm really concerned about about setting a precedence here because, you know, we reward or award our fees and contracts week after week after week here.'",
        "'speaker_11': 'Now, none of them have been this contentious and none of them have literally been dragged through the mud the way this one has has been and dragged through. And so as as polite as each and every one of the respondents to our RFP have been, and they have all been been great to work with.'",
        "'speaker_11': 'I think they all continue to be stakeholders in our city in one way or another doing different type of services. The the the process I will say I am I'm a bit disappointed in how. The, um, this this is this is kind of played out.'",
        "'speaker_11': 'And again, I'm concerned about really setting up a setting a messy precedence here. But that's it. I mean, I'm it sounds like the votes are here. And and, you know, if we all stand with the council member, you wrong on this motion if it this motion fails, then, you know, we will deal with the original motion.'",
        "'speaker_11': 'I want to thank my colleague, Councilman Richardson, for for looking for that compromise. And and again, I think, you know, we are we are prolonging the inevitable. But if it requires us to spend more resources, to spend more time to make sure that that everybody is competent, then then that's that's something that we can do as well'",
        "'speaker_11': '. And I will be be supportive of doing that. But honestly, I'd like to go with the original motion. And again, I have to to question the city manager here because your point is well taken. You came forth with a work or make a recommendation a week ago and and or two weeks ago and now because of the'",
        "'speaker_11': 'auditor's report, which was based on what was heard here at city council, mostly because and that's what I read it was based on what was raised at council and public comment and from colleague and from council members. She raised concerns.'",
        "'speaker_11': 'Um, and I don't know if that was necessarily based on raw data or, or any, any real review of the process and so forth. For you, Mr.. City Manager, your recommendation is something that we have to weigh very seriously.'",
        "'speaker_11': 'Um, why specifically the turnaround again.'",
        "'speaker_7': 'COUNCILMEMBER I'll repeat what I mentioned to Councilmember Turanga. The I, the city auditor prepared a memo that raised issues and questions. And I believe in our city auditor. I'm taking that very, very seriously. And given what was in that memo, I think we should definitely go back and do the 30, 30 day look see with an independent'",
        "'speaker_7': 'firm. And I truly believe that. And um, we have a memo from our auditor stating concern and we have to respect that.'",
        "'speaker_11': 'Okay. So with that, I'm going to withdraw my second from this motion. I will. And I'm going to give deference to our city manager, because I think we need to to read those signals and read those cues. But I certainly hope I certainly hope, Mr. City Manager, that when this comes back, that that if there is any'",
        "'speaker_11': 'sort of malfeasance found in here in this process, that people are held extremely accountable for that.'",
        "'speaker_0': 'Okay. Councilman Gonzales. And are going to a vote.'",
        "'speaker_1': 'Right. I think everything has been said, as you know, to what I wanted to say. But, you know, I think with such a large contract, you know, there's questions that naturally raise. And I don't think that any of us have questions that are out of the norm.'",
        "'speaker_1': 'I think many cities go through something similar like this. And so with that, I mean, you know, we're looking at the auditor's report. There's been questions raised as to that. I think the city manager did a great job in terms of kind of stepping back and realizing that this council really needed to take an extra look at'",
        "'speaker_1': 'this despite everything. And I don't I don't negatively look at our city process and think that it was done in any way, shape or form, in a malicious way or anything was less than high integrity at all. I just think that this is a large contract and we need to make sure that we're doing things in a'",
        "'speaker_1': 'way that this council I think feels is most necessary, is just taking an extra review. And I think I hope it goes to the former of 30 days versus the latter, but we'll see. And that would be my my support.'",
        "'speaker_1': 'I would certainly support doing an independent review. So we'll.'",
        "'speaker_9': 'Official.'",
        "'speaker_1': 'We'll go from there. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Ringo.'",
        "'speaker_9': 'Just to make it official, I will withdraw my motion.'",
        "'speaker_0': 'Okay, great. And I'm just one thing I think that needs to be said after this conversation. I just want to repeat that. No one up here. This is a process has gone through. There's been a had an independent person go through the process that's kind of well-respected in the industry.'",
        "'speaker_0': 'Staff has worked very hard. I want to thank staff for working hard on this. They have been working very hard to respond to all the questions and the inappropriate questions from the council as part of their deliberative process.'",
        "'speaker_0': 'So I just want I want to thank them for that, but I just also want to want to clear up and make sure that we're pretty clear that no one is accusing anyone or has accused anyone of doing anything inappropriate.'",
        "'speaker_0': 'What has happened is questions have been raised that people have the confidence to move forward and make sure that this big contract is being awarded in the right way. And there's nothing wrong with taking another. We're taking a look, which is what I think the council is is saying.'",
        "'speaker_0': 'And so there's a motion on the floor. Castro votes.'"
    ],
    "City Auditor Review of Residential Recycling Collection Services Bid Responses.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item.'",
        "'speaker_2': 'Item 15 Communication from Councilwoman Price, Council Member, Super Councilwoman Mango and Council Member Richardson. Recommendation to request City Auditor to review the bid responses for the residential recycling collection services and report findings of the review directly to the City Council at the earliest possible date.'",
        "'speaker_0': 'I think this would be a receiving file, Charlie, at this point, so that's correct. Okay. Can I get a motion there? Receive and file.'",
        "'speaker_2': 'Move to receive?'",
        "'speaker_0': 'Okay. I think I think Councilor Richardson sends the wrong items on the screen. Is that right or were they switched, as it were? Correct. Right. Yeah. Okay. We're good. The receiving file and public comment and receive and filing.'",
        "'speaker_8': 'Not just on this, but any motion where your recommendation of your city auditor is to take a course of action. That action, that recommendations should be followed. Fact, if it were followed more often, we probably would not be in the financial condition we are in now.'",
        "'speaker_8': 'It matters not how long it takes, as long as red flags are up. You need to take the requisite time. To make the right decision. Otherwise, that red flag goes up and every time you follow that and duplicate ignoring the city auditor, the red flag goes up even higher and the stench gets even greater.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Senior the public comment cast your vote. And Stephen finally.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Next item, please.'"
    ],
    "Resolution and Budget Request for California Coastal Trail Association Membership.": [
        "'speaker_2': 'Item 18. Communication from Councilmember Odinga, Vice Mayor Lowenthal and Councilwoman Price. Recommendation to request the city attorney to draft a resolution in support of the California Coastal Trail Association.'",
        "'speaker_5': 'Thank you. There's been a motion and a second. Councilmember Urunga.'",
        "'speaker_9': 'Thank you, Ms.. Mayor. First, I want to thank my colleagues, Vice Mayor Sue Geelong, Athol and Constable Susie Price for signing on to this item. The California Coastal Trail Association is organization dedicated to the idea of a contiguous coastal trail from Oregon to the border in Mexico.'",
        "'speaker_9': 'The city of Long Beach would be able to highlight our world class beaches, recreational resources, biking, pedestrian trails and all that as part of the vision for the California coastal trail. So I encourage my colleagues to please join me in supporting this item.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_5': 'Thank you and thank you for asking me to be a coauthor. I appreciate that. And I think it's the right thing to do. And thank you for your service on the Coastal Commission. I know it has been. Less than easy these last few months, but I'm very proud to have you represent us, so thank you.'",
        "'speaker_5': 'Sarah, any public comment on item 18? Please come forward.'",
        "'speaker_8': 'Yes, I fully support this. The only thing I can think of of enhancing this is to take the requisite steps. To enhance and strengthen the Coastal Commission by adopting some of the suggestions that are being put forth now relative to making sure that there is transparency and that there are no private communications, i.e. any communication with an'",
        "'speaker_8': 'expert in ex parte communication. Must come to an end. It must be a matter of public record. And I think that would help the Coastal Commission in Chief and. Help our Coastal Commission member avoid some embarrassing problems. Thank you.'",
        "'speaker_5': 'Thank you. There's been a motion in a second. Members, please cast your vote. Motion carries next item please.'"
    ],
    "Agreement with Los Angeles River Revitalization Corporation for Design and Analysis of the Long Beach Portion of the Los Angeles River.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_5': 'Next item please.'",
        "'speaker_2': 'Report from City Manager Recommendation to execute an agreement with Los Angeles River Revitalization Corporation to conduct an integrated design and technical analysis of the Long Beach portion of the L.A. River in an amount not to exceed $250,000 citywide.'",
        "'speaker_5': 'Thank you, Mr. City Manager.'",
        "'speaker_7': 'Yes. We have a report here from our deputy city manager, Arturo Sanchez.'",
        "'speaker_8': 'Good evening, Vice Mayor Lowenthal.'",
        "'speaker_3': 'And members of.'",
        "'speaker_7': 'The City Council. The item before you.'",
        "'speaker_3': 'Is an agreement with the L.A. River Revitalization Corporation to conduct an integrated design and technical analysis of the Long Beach portion of the L.A..'",
        "'speaker_0': 'River. The L.A. River Revitalization.'",
        "'speaker_3': 'Corporation has assembled a technical team that includes Gehry, Partners Olin and Geocentric to develop an integrated design that looks at the entire river.'",
        "'speaker_0': 'So this is really exciting.'",
        "'speaker_7': 'They're looking at the entire 51 miles.'",
        "'speaker_3': 'But they're going to start the first phase of their analysis down in the lower portion in this area of Long Beach. And so their first phase of their analysis will actually begin down here. Commitments have been made by the Ramsay.'",
        "'speaker_7': 'The Santa monica.'",
        "'speaker_3': 'Rivers and Mountains Conservancy as well. And we are essentially just contributing to the pool of money that's looking at a way to revitalize the entire stretch of the Los Angeles River in a holistic way that will add recommendations and layers as to the types of developments that we can have in our portion.'",
        "'speaker_7': 'That would be.'",
        "'speaker_0': 'That would fit in.'",
        "'speaker_3': 'Well with whatever other recommendations they have in the upper portions.'",
        "'speaker_0': 'So the recommendation from staff is.'",
        "'speaker_3': 'That you authorize the city manager to execute an agreement with the Los Angeles River Revitalization Corporation to conduct the integrated design for the Long Beach portion of Los Angeles River in an amount not to exceed $250,000 for a term of 12 weeks.'",
        "'speaker_5': 'Thank you, Mr. Sanchez. And I want to thank staff for bringing this item forward. And I'm looking forward to our participation in this process that is long overdue and very exciting. That renowned architect Frank Gehry and his firm are working on the very iconic parts of what this river revitalization will be about.'",
        "'speaker_5': 'So I'm definitely looking forward to that. Councilwoman Price.'",
        "'speaker_1': 'Of no comment.'",
        "'speaker_5': 'Thank you, Councilmember Richardson.'",
        "'speaker_10': 'I just wanted to chime in and say how exciting this is. And Mr. West and Mr. Sanchez, you guys are doing a great job on this, how you figured out how to how to pay for this. And I want to I want to say, as a community that has the river in it, I'm really excited to see'",
        "'speaker_10': 'improvements here in Long Beach to our river. So congratulations. You have my support and to the leaders, the mayor and other districts with the river in it. This is really exciting for for all of us. So I you know, this is another big thing for our city that we should all be excited about and seeing how it'",
        "'speaker_10': 'develops. Thanks.'",
        "'speaker_5': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_1': 'I, too, just wanted to share my excitement. This has been a long time coming. I want to thank the city staff, Arturo and and Pat, as well as the mayor, for keeping this on our radar. I know we're hearing it a lot out there and the 710 Project Committee, and they've included that.'",
        "'speaker_1': 'And it's exciting to know that Long Beach will now be a part of of this. So thank you for all your efforts.'",
        "'speaker_0': 'Councilman, you Ranga.'",
        "'speaker_9': 'Thank you, Mayor. I represent the seventh District and a river runs through it. I want to thank staff for supporting this. I think it's it was a no brainer in the sense that so much is going on in the northern portion of the river and we need to take care of ourselves in the southern part of the'",
        "'speaker_9': 'river. So I want to thank Stephanie for doing this.'",
        "'speaker_0': 'Thank you. Emotion. In a second, public comment on the item saying please cast your vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': '22.'"
    ],
    "Contract and Appropriations for the 2015 Urban Area Security Initiative Grant.": [
        "'speaker_2': 'Motion carries. An exciting report from Disaster Preparedness and Emergency Communications and Fire and Health and Human Services and Police recommendation to execute a contract with the City of Los Angeles to receive and expand Department of Homeland Security grant funding for the 2015 Urban Area Security Initiative grant in an amount not to exceed 5.3 million citywide.'",
        "'speaker_0': 'It was emotion and a secondary public comment on this item. Please come forward.'",
        "'speaker_8': 'Very good. A heads up relative to the specter of having all federal money suspended for any purpose to the city of Long Beach. These are the the Sorento. Pathway project. That has not. The Sorento pathway project has not come before this council yet.'",
        "'speaker_8': 'But in essence, this Sorento pathway project is supposed to be finished or started. At the conclusion of the current phase of the Naples Seawall Project. The Feds have approved that project to finish that first phase off. What is in jeopardy is the Sorento.'",
        "'speaker_7': 'Pathway.'",
        "'speaker_8': 'Because of the chicanery used in designing the plans. Those plans, which are now marching in formation, are directly at war with federal l federal aid laws. What the feds are going to require is that the Sorento pathway be completed.'",
        "'speaker_8': 'And completed in a manner that someone in a wheelchair. Can start at the Eastern End at the Bay Shore Bridge and travel all the way down through the end. If not. If not. And until that's done, all federal grants.'",
        "'speaker_8': 'For any purpose to the city of Long Beach will be suspended because they don't want the Gloria Allred of ADA knocking under general law. More importantly, to do so, to give the middle finger to the ADA community by doing what the Sorento packed some of the Sorento path residents want, i.e. they don't want them in their front'",
        "'speaker_8': 'yard. And part of this problem belongs to previous city councils that look the other way and allow them to build out onto public walkways or public areas and so forth. So I caution you very carefully in terms of federal grants.'",
        "'speaker_8': 'There's a good possibility they're going to be suspended until the plans for Sorento pathway are approved by the feds, and that pathway is completed. Then and only then will the money flow to the city of Long Beach for any federal, out of any federal, and which will also then trigger a suspension by county and state.'",
        "'speaker_8': 'You don't mess with the admirals. Thank you.'",
        "'speaker_0': 'No other public comment. Cast your vote, members.'",
        "'speaker_2': 'Motion carries. Excited report from Financial Management Recommendation to adopt resolution approving the annual and Five-Year Reports for the Transportation Improvement Fee Park and Recreation Facilities Fee via facilities impact fee and police facilities impact for you citywide.'"
    ],
    "Contracts with The Michelson Found Animals Foundation and the Stray Cat Alliance for Cat Services.": [
        "'speaker_0': 'Next item.'",
        "'speaker_2': 'Item 26 Report from Parks and Recreation and Marine recommendation to execute two contracts to allow Long Beach Animal Care Services to provide a variety of services to decrease shelter euthanasia of Cats District five.'",
        "'speaker_0': 'There's a motion and a second I'm actually going to have I've had a couple requests for a staff report on this. So think of a staff report, please.'",
        "'speaker_7': 'Sure. We have Ted Stevens, our bureau manager of animal care services, and also interim director of Parks and Rec, Steve Scott.'",
        "'speaker_1': 'Are you sure that's really Ted Stevens?'",
        "'speaker_7': 'I know he's disappearing before our very eyes.'",
        "'speaker_8': 'Okay. I'm not sure where to go with that one, but. But thank you.'",
        "'speaker_5': 'I guess it must be the stress of the coyotes.'",
        "'speaker_8': 'No, it's intentional. I would think the mayor and the council members. Thank you for having me here tonight for a chance to speak briefly on this. We're just formalizing some contracts with the Found Animals Foundation Foundation and Stray Cat Alliance to continue some life saving progressive programs here in the city of Long Beach that are aimed at'",
        "'speaker_8': 'helping one of the most at risk animals in our city. And that would be the community cat and the kittens that are born from them. And these these efforts have. Have had a significant impact in increasing life outcomes and reducing euthanasia and euthanasia in the shelter.'",
        "'speaker_3': 'And we're looking to continue those programs.'",
        "'speaker_0': 'Thank you. And can you can you talk about those programs are exactly.'",
        "'speaker_8': 'So just briefly, the programs that we're mentioning here would be Kitten Foster program. We're looking to transfer between 3 to 500 kittens to the foster program that the Found Animals Foundation runs out of their adoption shop in Culver City, where they will take over the care and feeding of the animals until they get old enough to be'",
        "'speaker_8': 'spayed or neutered and adopted into loving homes. And unfortunately, kittens are one of the most at risk animals at any animal shelter. And this is going to allow us to save several of them through this agreement. It also briefly, I can touch on the community cat program where we span neuter cats that are outdoor cats.'",
        "'speaker_8': 'Many of them are owned, some are loosely owned. Some don't necessarily have any identified owners that we know of, but somebody is taking care of them. These are healthy cats that have no illness, no injuries, but would not make good pets due to their temperament.'",
        "'speaker_8': 'But they are they do have a home may not be a perfect home, but it is a home that they know and the home that they have. And as long as they're healthy and happy, this program gives them the opportunity to live out their lives in a humane way without reproducing and having any more babies and kittens'",
        "'speaker_8': 'and reducing a lot of the negative impacts that they would have in the community.'",
        "'speaker_0': 'Thank you. Councilman Price, to have anything on your motion.'",
        "'speaker_1': 'I just want to thank Mr. Stevens and his team for doing excellent work. And we always look forward to your reports because there's always progress that you are reporting. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'I am so excited that found animals has put our trust in TED and our animal control services. Usually they focus on really large organizations and I know that we are growing, but compared to some of the bigger animal control agencies, to be able to receive this funding and to have these kittens and cats have this opportunity, it'",
        "'speaker_2': 'says a lot about you and how far you've brought the animal agency in the last few years. So thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Lowenthal.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I, too, wish to thank Steven Scott and Ted Stevens for bringing this item forward. I suppose in a perfect world, we wouldn't have feral cats throughout the community and thousands of unwanted strays in our shelters and every animal's spayed or neutered and has a loving and safe home.'",
        "'speaker_5': 'As Ted talked about, the sort some of these cats do have home is just not perfect. And we wouldn't have the no kill versus kill shelters debate, which is painful. We can all agree that this is not a perfect world and this is a great progressive next step in expanding our efforts and our existing partnerships with these'",
        "'speaker_5': 'two organizations. I appreciate the feedback that our office has gotten from folks that are both against and for the item. But I do believe this is the right thing to do, both for feral cats and kittens. Our goal is to increase spay and neutering while decreasing euthanasia in our shelter.'",
        "'speaker_5': 'And that can't be said enough times. This contract and these relationships help us do just that in a very humane way. It's not perfect. We know that. I think you'll even have our staff share that. It's not perfect, but given the options, it really is the best way.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Mongo, I think. Is that Quebec up or no? Okay. Council Councilmember Austin.'",
        "'speaker_11': 'Thank you. And I intend on supporting this item. I do have a couple of questions based on questions that were presented to me by constituents just over the weekend. I think this is very timely. The constituent reported a feral cat population in her neighborhood and states that we've actually.'",
        "'speaker_11': 'Animal Services has actually come out and picked up cats and and and and fix them one way or another. But also they return them back to the community. Is that is that the practice?'",
        "'speaker_8': 'Yes. That that's what this this program is.'",
        "'speaker_11': 'Okay. So you return them back to wherever you caught them, and. And they're just. Just out there. Yeah.'",
        "'speaker_8': 'We're if they are healthy, if they are not healthy, we will not rerelease them. If they come to us. Healthy of good weight in good condition. It's. The assumption is that there is someone taking care of them, someone's feeding them, providing them with shelter and food and water.'",
        "'speaker_8': 'And like I said, it's not the perfect life for them, but it's you know, they are in a healthy condition. Okay.'",
        "'speaker_0': 'Thank you. And I know that, Mr. Stevens I know that was not part of this report. But what kind of related is the animal care services just opened up a what's now its largest kind of secondary adoption center over in Councilman Austin's district at the new Pet Food Express, which is a great new service to the community'",
        "'speaker_0': 'as well. So congratulations on that. That's really wonderful. Any comment on the item, please? How are you doing? Hi, good to see you.'",
        "'speaker_2': 'Anna Wong, I am the program director for the Return to field program here in Long Beach. I have been since the inception. I wanted to address Councilman Austin's nervousness. And I understand many of you, your offices have contacted me directly when your constituents have had issues and have needed some help, especially during kitten season.'",
        "'speaker_2': 'We've been happy to go out and help them with that. This is not a program that's simply putting cats back out. We spent an enormous time and energy educating the city of Long Beach and the contract cities on the return to field program and its benefits.'",
        "'speaker_2': 'We've already seen a massive reduction in impound rates, which Ted Stevens can go over, if you like. Those numbers. We've seen a massive reduction in euthanasia and we have had a reduction in kitten in pounds so far this year being the third year, we expect to see a dramatic drop in those in pounds.'",
        "'speaker_2': 'Along with the return to field, we have done what's called targeted TNR, which is trap neuter return. So when kittens are impounded at the shelter, we get the addresses where those kittens came from. We go back, we trap those cats that the constituents did not trap, and we are fixing those cats as well.'",
        "'speaker_2': 'The fiscal impact is zero to the city. Basically. This is something that we are doing with the grant from the Richardson Foundation found animals and we would like to continue to do it and we appreciate all of the positive response that the Council has had on this.'",
        "'speaker_2': 'We thank you for your support and gone out to many of your neighborhood meetings and spoken to your people out there. And I'm happy to continue to do that with any issues that you guys may have.'",
        "'speaker_0': 'Thank you very much, Casey, and no other public comment on the issue. Thank you for all your work members. Please go ahead and cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Contract with Los Cerritos Wetlands Stewardship for Maintenance and Management of Environmentally Sensitive Areas.": [
        "'speaker_0': 'Okay. Thank you. Next item, please.'",
        "'speaker_2': 'Report from Parks, Recreation and Marine and Financial Management recommendation to execute a contract with Lo Cerritos. Wetland Stewardship for the maintenance and management of environmentally sensitive areas for a total annual contract amount. Not to. It's not to exceed 419,000 citywide.'",
        "'speaker_0': 'Okay. Can I get a second, please? CARNEY public comment on this item. See. Now, please cast your vote. Absolutely. Councilman Price, before we.'",
        "'speaker_1': 'Vote, I just want to I know Lenny was here earlier. Is he still here? No. I just want to thank staff for working so well with our contractors. They do amazing work, and they do a lot of work in an hour in my district.'",
        "'speaker_1': 'So I'm very grateful for their efforts and happily support this item.'",
        "'speaker_0': 'Thank you. Please cast your votes. Motion carries. Next item.'"
    ]
}